{
  "gid": "517481543704249946",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja rozgrywki 7.40b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1766531100,
  "rtime32_end_time": 1766536201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c09b13cda87a548b83b626fb33a32efd7895c634.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": false,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1766531101
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1769111732
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1766528114
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "517481543704249947",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aktualizacja rozgrywki 7.40b",
    "posttime": 1766531102,
    "updatetime": 1769111732,
    "body": [
      "[p]Aktualizacja 7.40b jest już dostępna. Listę zmian możecie sprawdzić [url=\"https://www.dota2.com/patches/7.40b\"]tutaj[/url]. ",
      "Dodatkowo w ciągu ostatnich kilku dni zajęliśmy się następującymi problemami:",
      "[/p][list][*][p]Naprawiono błąd powodujący, że wartości procentowe dotyczące wyboru i stosunku wygranych dla talentów w Dota Plus nie były prawidłowo agregowane.[/p][/*][*][p]Naprawiono błąd powodujący, że przełącznik „Nauka umiejętności” nie zamykał się automatycznie po osiągnięciu 24. poziomu.[/p][/*][*][p]Naprawiono nieprawidłowe obszary trafień dla wielu przedmiotów ozdobnych dla stróżów obserwatorów i stróżów detektorów.[/p][/*][*][p]Naprawiono błąd powodujący, że przedmiot Smoke of Deceit nie działał z poziomu plecaka, jeśli od początku znajdował się w plecaku.[/p][/*][*][p]Naprawiono błąd powodujący, że obrażenia od przedmiotu Rattlecage nie były klasyfikowane jako odbite.[/p][/*][*][p]Naprawiono błąd powodujący, że przedmiot Rattlecage nie działał, jeżeli został wytworzony, będąc martwym.[/p][/*][*][p]Naprawiono błąd powodujący, że ulepszona z Aghanim's Scepter umiejętność od Bloodseekera nie miała prawidłowego czasu oczekiwania.[/p][/*][*][p]Naprawiono błąd powodujący, że położenie Bounty Huntera było ujawniane, jeżeli rzucono um. Track podczas niewidzialności we mgle wojny.[/p][/*][*][p]Naprawiono błąd powodujący, że regeneracja zdrowia z ulepszenia z Aghanim's Shard dla Brewmastera była zawsze aktywna przy poziomie zdrowia poniżej 50%, nawet jeśli mocny trunek nie został wypity.[/p][/*][*][p]Naprawiono błąd powodujący, że szkielety przywoływane przez Clinkza miały nieprawidłowy priorytet ataku.[/p][/*][*][p]Naprawiono błąd powodujący, że zębatki z um. Power Cogs od Clockwerka z aspektem Rozszerzona Armatura nie odbijały się od wrogów w prawidłowy sposób.[/p][/*][*][p]Naprawiono błąd powodujący, że um. Rabble-Rouser od Enchantress nie była nakładana na szkielety przyzywane przez mrocznego trolla przywoływacza i golemy z odłamka.[/p][/*][*][p]Naprawiono błąd powodujący, że um. Omnislash od Juggernauta i inne umiejętności wymagające ciągłego widzenia ich celu nie działały podczas um. Arena of Blood od Marsa oraz innych umiejętności, które warunkowo usuwały współdzielenie widzenia wśród sojuszników.[/p][/*][*][p]Naprawiono błąd powodujący, że instancje krwawienia z um. Kazurai Katana od Keza były usuwane, jeżeli przebicie nastąpiło od tyłu.[/p][/*][*][p]Naprawiono błąd, wskutek którego niepowodzenie przebicia od Keza powodowało, że później było nieprawidłowo aktywowane.[/p][/*][*][p]Naprawiono błąd uniemożliwiający Kezowi aktywowanie znaku z um. Raven's Veil pierwszym atakiem po rzucie umiejętności, jeśli znajdował się on w maksymalnym zasięgu ataku.[/p][/*][*][p]Naprawiono błąd umożliwiający Kezowi aktywowanie znaków dwa razy podczas um. Raptor Dance przy określonej konfiguracji ustawień i przedmiotów.[/p][/*][*][p]Naprawiono błąd powodujący, że um. Catchy Lick od Largo nie rozpraszała efektów na sojusznikach, jeśli znajdowali się oni pod wpływem przedmiotu Black King Bar.[/p][/*][*][p]Naprawiono błąd powodujący, że um. Catchy Lick od Largo rozpraszała próbę przybicia piątki.[/p][/*][*][p]Naprawiono błąd powodujący, że interfejs um. Amphibian Rhapsody od Largo nie był wyświetlany osobom z wyłączoną funkcją map_enable_portrait_worlds.[/p][/*][*][p]Naprawiono błąd powodujący, że żabki Largo blokowały odradzanie się stworów z obozów neutralnych.[/p][/*][*][p]Naprawiono błąd powodujący, że przedmiot Lotus Orb nie nakładał rozproszenia po skopiowaniu przez ulepszenie z Aghanim's Shard dla Largo.[/p][/*][*][p]Naprawiono błąd powodujący, że przedmiot Linken Sphere nie był kopiowany przez ulepszenie przez Aghanim's Shard dla Largo.[/p][/*][*][p]Naprawiono błąd powodujący, że um. Combustion od Liny zadawała za dużo obrażeń po otrzymaniu premii z um. Croak of Genius od Largo.[/p][/*][*][p]Naprawiono błąd powodujący, że duchowy niedźwiedź nie przełamywał um. Blur od Phantom Assassin.[/p][/*][*][p]Naprawiono interakcje między um. Fate's Edict od Oracle'a a niewrażliwością na negatywne efekty.[/p][/*][*][p]Naprawiono błąd uniemożliwiający Oracle'owi rozproszenie rozbrajającej części um. Fate's Edict na sojusznikach.[/p][/*][*][p]Naprawiono błąd powodujący, że iluzja Phantom Lancera po ulepszeniu przez Aghanim's Shard nie odnosiła korzyści z jego um. Illusory Armaments.[/p][/*][*][p]Naprawiono błąd powodujący utratę umiejętności przez Rubicka po śmierci lub kradzieży innej umiejętności podczas rzucania um. Amphibian Rhapsody od Largo po ulepszeniu przez Aghanim's Scepter.[/p][/*][*][p]Naprawiono błąd powodujący niewidzialność efektów um. Disruption od Shadow Demona, jeśli on sam znajdował się we mgle wojny.[/p][/*][*][p]Naprawiono błąd powodujący, że talent Spectre na 25. poziomie nie był stosowany do wszystkich rodzajów iluzji.[/p][/*][*][p]Naprawiono błąd powodujący, że um. Avalanche od Tiny'ego trwała 0,2 sekundy dłużej, niż zamierzono.[/p][/*][*][p]Naprawiono błąd powodujący, że um. Battle Trance od Trolla Warlorda rozpraszała um. Ice Blast od Ancient Apparition, gdy próg zabójstwa tej drugiej został aktywowany, a Troll Warlord był ogłuszony i miał zakolejkowane rzucenie Battle Trance.[/p][/*][*][p]Naprawiono błąd powodujący, że Ursa wydawał z siebie ryk przy rzucie um. Earthshock po ulepszeniu przez Aghanim's Shard.[/p][/*][*][p]Naprawiono błąd powodujący, że um. Recall Familiar od Visage'a nie działała.[/p][/*][/list]"
    ],
    "commentcount": 499,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1426387032_1766532288_0",
      "mod_require_rereview"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "685240979008216192",
    "event_gid": "517481543704249946",
    "voteupcount": 36333,
    "votedowncount": 4900,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "685240979008216192",
  "rtime32_last_modified": 1769111733,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1766532289,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 21299299,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 36333,
  "votes_down": 4900,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "685240979008216192",
  "clan_steamid_original": "103582791433224455"
}