{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Oppdatering til Dota 2 – 2. august 2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1723158392
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1724688606
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false,
    "rt_migrated_time": 1723158346.729
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Oppdatering til Dota 2 – 2. august 2024",
    "posttime": 1722648012,
    "updatetime": 1724688606,
    "body": [
      "I løpet av de siste dagene har vi ordnet opp i følgende problemer:",
      "[list]",
      "[*] Fikset en feil som noen ganger forårsaket inndataforsinkelse i flere sekunder.",
      "[*] Fikset at auraer ikke ble påført ordentlig hvis kampen varer for lenge (gjelder flere skadeforekomster av Doom osv.).",
      "[*] Fikset at nedkjølingsreduksjon noen ganger ikke fungerte ordentlig når den reduseres med svært små verdier (Staff of the Scion osv.).",
      "[*] Fikset at skadeblokkering for nærkamp av og til ikke blokkerte noen skade.",
      "[*] Fikset at Bloodstones verktøytips ikke viste tilhørende manaregenerasjon.",
      "[*] Fikset at Ironwood Tree ikke kunne kjøpes i demomodus.",
      "[*] Fikset at Mirror Shield blokkerte formler mens den var på nedkjøling når Lotus Orb er aktiv.",
      "[*] Fikset at Unwavering Condition forårsaket et krasj.",
      "[*] Fikset at Alchemists Unstable Concoction ikke kunne brukes på Spirit Bear.",
      "[*] Fikset at overlapp av Banes Nightmare og Fiend's Grip hadde et lite vindu der evner uten brukstid kunne brukes.",
      "[*] Fikset at Beastmasters Drums of Slom ikke fungerte ordentlig når illusjoner av Beastmaster er til stede.",
      "[*] Fikset at Bloodseekers fasett Bloodrush tildelte Bloodseeker feilaktige medvirkninger. ",
      "[*] Fikset at Bristlebacks fasett Seeing Red gjorde at den visuelle effekten ble stablet uendelig.",
      "[*] Fikset at Clockwerks tannhjul hadde et feilaktig verktøytips om bunden tilstand.",
      "[*] Fikset at Death Prophets Exorcism kunne rettes mot utposter.",
      "[*] Fikset at Drow Rangers bruk av Glacier avbrøt Multishot med fasetten Sidestep.",
      "[*] Fikset at Elder Titans effekt fra Tip the Scales ikke fungerte på tårn som var usårbare på grunn av at det tilsvarende tårnet på forrige nivå ikke var ødelagt.",
      "[*] Fikset at Elder Titans effekt fra Tip the Scales ikke fungerte mens Elder Titan var død.",
      "[*] Fikset at Ember Spirit ikke kunne øke nivået på alle talenter.",
      "[*] Fikset at Hoodwinks Acorn Shot ikke kunne reflekteres fra helter som ikke har prosjektiler.",
      "[*] Fikset at Jakiros Liquid Frost av og til gjorde ekstra skade fra Blood Grenades skade over tid.",
      "[*] Fikset at Kunkkas Ghostship ikke brukte den udødelige effekten «Prize of the Saltworn Mariner» når Kunkka har Aghanim's Scepter.",
      "[*] Fikset at Lifestealers Ghoul Frenzy ikke fikk fullstendig avbrudd.",
      "[*] Fikset at Lina ikke kunne øke nivået på alle talenter.",
      "[*] Fikset Leshracs Diabolic Edict noen ganger gjorde mindre skade enn forventet.",
      "[*] Fikset at Lone Druid kunne motta mer ødeleggelsesgull fra Philosopher's Stone.",
      "[*] Fikset at verdiene til Lone Druids Spirit Bear ikke samsvarte med verktøytipsene.",
      "[*] Fikset at Lone Druids Demolish og Entangling Claws ikke viste riktige nivå.",
      "[*] Fikset at verktøytipset til Lunas Lunar Blessing noen ganger forårsaket et klientkrasj.",
      "[*] Fikset at Mars' Dauntless fungerte mot (eller med) illusjoner.",
      "[*] Fikset at skade over tid fra Nature's Prophets Curse of the Oldgrowth ikke stemte overens med fasetten Ironwood Treant.",
      "[*] Fikset at verktøytipset til Nature's Prophets Spirit of the Forest ikke viste det femte nivået.",
      "[*] Fikset at Ogre Magi kunne bruke Multicast med 3x og 4x før oppgradering til evnens andre og tredje nivå.",
      "[*] Fikset at Omniknights Repel manglet utsagn.",
      "[*] Fikset at Phantom Lancers medfødte evne Illusory Armaments gav uendelig skade.",
      "[*] Fikset at Phantom Lancers medfødte evne Illusory Armaments gav null skade.",
      "[*] Fikset at Razors Dynamo noen ganger gav feil mengde formelstyrkelse.",
      "[*] Fikset at Rubick ikke påførte skade fra Death Rime når han stjal Ancient Apparitions evner.",
      "[*] Fikset et krasj med Rubick som oppstod når en stjålen Ghostship utløp rett før den nådde målet.",
      "[*] Fikset at Sand Kings Stinger ikke kunne stjeles. ",
      "[*] Fikset at Skywrath Mages talent på nivå 15 ikke ble oppdatert til hemming for Concussive Shot.",
      "[*] Fikset at Snapfires Lil' Shredder gjorde mindre skade enn forventet med kritiske treff.",
      "[*] Fikset at verktøytipset til Snipers Headshot feilaktig gav uttrykk for at evnen fungerer på allierte kryp.",
      "[*] Fikset at lyden fra Spectres Reality ikke kunne høres av fienden hvis hun teleporterer til et sted skjult i krigståken.",
      "[*] Fikset formelomdirigeringen til Spirit Breakers Planar Pocket for evner som søkte nye mål under omdirigeringen, som tidligere førte til utilsiktet ekstra skade i hele området.",
      "[*] Fikset at verktøytipet for selvskaden fra Techies' Blast Off! ikke gjenspeilet riktig skadetype.",
      "[*] Fikset at Tinys Toss ikke utløste Phylactery når det kastede målet er det samme som hovedmålet.",
      "[*] Fikset at Troll Warlords Berserker's Rage gjorde skade på ham selv.",
      "[*] Fikset at Venomancers Plague Carrier ikke tok hensyn til «Deaktiver hjelp».",
      "[*] Fikset at verktøytipet til Visages Lurker brukte uttrykket «nedkjølingsreduksjon» i stedet for «nedkjølingsfremskynding».",
      "[/list]"
    ],
    "commentcount": 201,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "ModAct_487176015_1723138016_4",
      "ModAct_1426387032_1723159076_4",
      "ModAct_1278681683_1724689360_4"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 6751,
    "votedowncount": 744,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1730847165,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724689361,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "votes_up": 6751,
  "votes_down": 744,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}