{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Оновлення Dota 2 — 2 серпня 2024 року",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1723158392
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1724688606
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false,
    "rt_migrated_time": 1723158346.729
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Оновлення Dota 2 — 2 серпня 2024 року",
    "posttime": 1722648012,
    "updatetime": 1724688606,
    "body": [
      "За останні дні ми виправили такі проблеми:",
      "[list]",
      "[*] Виправлено помилку, через яку введення іноді відбувалося із затримкою в кілька секунд.",
      "[*] Виправлено помилку, через яку аури не застосовувалися правильно, якщо матч тривав дуже довго (наприклад, кілька аур шкоди від Доленосця тощо).",
      "[*] Виправлено помилку, через яку зменшення зарядки іноді працювало неправильно під час зменшення на невеликі значення, як-от від Посоха спадкоємця (Staff of the Scion).",
      "[*] Виправлено помилку, через яку іноді не працювало блокування шкоди в героя ближнього бою.",
      "[*] Виправлено помилку, через яку в описі Кривавого каменя (Bloodstone) не показувалася регенерація мани.",
      "[*] Виправлено помилку, через яку Залізне дерево (Ironwood Tree) не можна було купити в режимі демонстрації.",
      "[*] Виправлено помилку, через яку Дзеркальний щит (Mirror Shield) блокував чари під час зарядки, коли була активна Сфера лотоса (Lotus Orb).",
      "[*] Виправлено помилку, через яку Стан непохитності (Unwavering Condition) призводив до аварійного завершення.",
      "[*] Виправлено помилку, через яку Нестабільну суміш (Unstable Concoction) Алхіміка не можна було застосувати на ведмедя-духа.",
      "[*] Виправлено помилку, через яку можна було застосовувати чари без анімації між ефектами здібностей Страшний сон (Nightmare) і Демонічна хватка (Fiend's Grip) у Губителя.",
      "[*] Виправлено помилку, через яку Барабани Слома (Drums of Slom) Звіромайстра працювали неправильно, коли були наявні ілюзії Звіромайстра.",
      "[*] Виправлено помилку, через яку грань Поклик крові (Bloodrush) Кривавого Жерця помилково зараховував йому підмоги в убивствах. ",
      "[*] Виправлено помилку, через яку не зникав візуальний ефект грані Червона ганчірка Бронеспина.",
      "[*] Виправлено помилку, через яку шестерні Годинникаря мали помилкову інформацію про ефект прив’язі.",
      "[*] Виправлено помилку, через яку духи від Екзорцизму (Exorcism) Провісниці Смерті вибирали ціллю застави.",
      "[*] Виправлено помилку, через яку застосування Льодовика (Glacier) Дроу-Рейнджер переривало Мультипостріл (Multishot) з гранню Крок убік.",
      "[*] Виправлено помилку, через яку ефект Нахилу терезів (Tip the Scales) Древнього Титана не працював на вежах, які були невразливі, бо попередня вежа не була зруйнована.",
      "[*] Виправлено помилку, через яку ефект Нахилу терезів (Tip the Scales) не працював, якщо Древній Титан був мертвий.",
      "[*] Виправлено помилку, через яку Палючий Дух не міг вивчити всі свої таланти.",
      "[*] Виправлено помилку, через яку герої без снарядів не могли відбити Постріл жолудем (Acorn Shot) Каптурниці.",
      "[*] Виправлено помилку, через яку Криготеча (Liquid Frost) Джакіро іноді завдавала додаткової шкоди під час періодичної шкоди від Кривавої гранати (Blood Grenade).",
      "[*] Виправлено помилку, через яку Корабель-привид (Ghostship) зі Скіпетром Аґаніма не використовував нетлінний ефект від Prize of the Saltworn Mariner.",
      "[*] Виправлено помилку, через яку Шаленство вурдалака (Ghoul Frenzy) Життєкрада переривалося лише частково.",
      "[*] Виправлено помилку, через яку Ліна не могла вивчити всі свої таланти.",
      "[*] Виправлено помилку, через яку Диявольський указ (Diabolic Edict) Лешрака іноді завдавав менше шкоди, ніж потрібно.",
      "[*] Виправлено помилку, через яку Самітний Друїд міг отримати більше золота за знищення предмета від Філософського каменя (Philosopher's Stone).",
      "[*] Виправлено помилку, через яку характеристики ведмедя-духа Самітного Друїда не збігалися із зазначеннями в описі.",
      "[*] Виправлено помилку, через яку неправильно показувалися рівні Бешкетництва (Demolish) і Обплітальних пазурів (Entangling Claws) Самітного Друїда.",
      "[*] Виправлено помилку, через яку опис Місячного благословення (Lunar Blessing) в Луни іноді призводив до аварійного завершення роботи клієнта.",
      "[*] Виправлено помилку, через яку Безстрашність (Dauntless) Марса враховувала ілюзії героїв.",
      "[*] Виправлено помилку, через яку періодична шкода від Прокляття стародавнього лісу (Curse of the Oldgrowth) Провісника Природи не узгоджувалася з гранню Залізнодеревний ент.",
      "[*] Виправлено помилку, через яку в описі Духу лісу (Spirit of the Forest) Провісника Природи не показувався п’ятий рівень.",
      "[*] Виправлено помилку, через яку здібності Огра-Мага спрацьовували 3 чи 4 рази до вивчення відповідних рівнів Мультичаклування (Multicast).",
      "[*] Виправлено помилку, через яку для Відбиття (Repel) Вселицаря не було фраз у відповідь.",
      "[*] Виправлено помилку, через яку Ілюзорне озброєння (Illusory Armaments) Фантомного Улана завдавало нескінченну шкоду.",
      "[*] Виправлено помилку, через яку Ілюзорне озброєння (Illusory Armaments) Фантомного Улана завдавало нуль шкоди.",
      "[*] Виправлено помилку, через яку Динамо (Dynamo) Леза іноді давало неправильний обсяг посилення чарів.",
      "[*] Виправлено помилку, через яку Рубік не накладав ефекти Убивчої паморозі (Death Rime) викраденими в Древнього Привида чарами.",
      "[*] Виправлено помилку, через яку відбувалося аварійне завершення, коли Рубік застосовував викрадений Корабель-привид (Ghost Ship) перед тим, як втратити його.",
      "[*] Виправлено помилку, через яку Жало (Stinger) Царя Пісків не можна було викрасти. ",
      "[*] Виправлено помилку, через яку талант 15-го рівня Небогнівного Мага не оновився до сповільнення від Потужного пострілу (Concussive Shot).",
      "[*] Виправлено помилку, через яку Мала дробарка (Lil' Shredder) Запальниці завдавала менше критичної шкоди, ніж потрібно.",
      "[*] Виправлено помилку, через яку в описі Пострілу в голову (Headshot) Снайпера неправильно вказувалося, що ця здібність діє на союзних кріпів.",
      "[*] Виправлено помилку, через яку вороги не чули звук Реальності (Reality) Спектральної Мари, якщо вона телепортувалася в туман війни.",
      "[*] Виправлено помилку, через яку деякі здібності шукали нові цілі під час перенаправлення від Планарної кишені (Planar Pocket) Винищувача Духів і завдавали більше шкоди в області, ніж потрібно.",
      "[*] Виправлено помилку в описі шкоди собі Відриву (Blast Off!) Техніків, де вказувався неправильний тип шкоди.  ",
      "[*] Виправлено помилку, через яку Кидок (Toss) Малюка не активував Філактерію (Phylactery), якщо істоту було підкинуто на місці.",
      "[*] Виправлено помилку, через яку Лють берсерка (Berserker's Rage) Троля-Воєводи завдавала шкоду йому самому.",
      "[*] Виправлено помилку, через яку на здібність Носій чуми (Plague Carrier) Трутоманта не діяло вимкнення допомоги.",
      "[*] Виправлено помилку в описі Підстерігача (Lurker) Візажа.",
      "[/list]"
    ],
    "commentcount": 200,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "ModAct_487176015_1723138016_4",
      "ModAct_1426387032_1723159076_4",
      "ModAct_1278681683_1724689360_4"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 6647,
    "votedowncount": 731,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1728403261,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724689361,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "votes_up": 6647,
  "votes_down": 731,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}