{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2 -päivitys 2.8.24",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1723158392
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1724688606
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false,
    "rt_migrated_time": 1723158346.729
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2 -päivitys 2.8.24",
    "posttime": 1722648012,
    "updatetime": 1724688606,
    "body": [
      "Tuore päivitys korjaa useita pelaamiseen vaikuttaneita ongelmia.",
      "[list]",
      "[*] Korjattiin virhe, joka välillä aiheutti useiksi sekunneiksi syöttöviivettä.",
      "[*] Korjattiin virhe, jonka vuoksi auravaikutukset eivät toimineet oikein pelin kestäessä liian kauan (esim. kun Doom teki liian paljon vahinkoa).",
      "[*] Korjattiin virhe, jonka vuoksi todella pienet latausaikojen lyhennykset eivät toimineet kunnolla (esim. Staff of the Scion).",
      "[*] Korjattiin virhe, jonka vuoksi lähitaistelusankareiden vahingontorjunta ei välttämättä torjunut vahinkoa.",
      "[*] Korjattiin virhe, jonka vuoksi Bloodstonen kykyteksti ei näyttänyt sen antamaa mananpalautumista.",
      "[*] Korjattiin virhe, jonka vuoksi Ironwood Treetä ei voinut ostaa koeajotilassa.",
      "[*] Korjattiin virhe, jonka vuoksi Mirror Shield torjui loitsuja jäähyllä ollessaan aktiivisen Lotus Orbin avulla.",
      "[*] Korjattiin Unwavering Conditionin aiheuttama kaatuminen.",
      "[*] Korjattiin virhe, jonka vuoksi Alchemistin Unstable Concoctionia ei voinut kohdistaa Spirit Beariin.",
      "[*] Korjattiin virhe, jonka vuoksi Banen Nightmaren ja Fiend's Gripin välillä oli pieni aikaväli, joka antoi vihollisen käyttää käyttöviiveettömiä kykyjä.",
      "[*] Korjattiin virhe, joka esti Beastmasterin Drums of Slomia toimimasta oikein Beastmasterin harhojen läsnäollessa.",
      "[*] Korjattiin virhe, jonka vuoksi Bloodseekerin Bloodrush-kulmakivi antoi hänelle virheellisiä avustuksia. ",
      "[*] Korjattiin virhe, jonka vuoksi Bristlebackin Seeing Red -kulmakiven visuaalinen tehoste kasautui loputtomasti.",
      "[*] Korjattiin Clockwerkin Power Cogsin virheellinen kahlintateksti.",
      "[*] Korjattiin virhe, jonka vuoksi Death Prophetin Exorcism-henget hyökkäsivät vartiopisteisiin.",
      "[*] Korjattiin virhe, jonka vuoksi Glacierin käyttö Sidestep-kulmakiven kanssa keskeytti Drow Rangerin Multishotin.",
      "[*] Korjattiin virhe, jonka vuoksi Elder Titanin Tip the Scales -luontaiskyvyn vaikutus ei vaikuttanut torneihin, jotka olivat haavoittumattomia edellisen tornin elossa olemisen vuoksi.",
      "[*] Korjattiin virhe, jonka vuoksi Elder Titanin Tip the Scales -luontaiskyvyn vaikutus ei vaikuttanut, kun Elder Titan oli kuollut.",
      "[*] Korjattiin virhe, jonka vuoksi Ember Spirit ei voinut päivittää kaikkia taitopuun taitoja.",
      "[*] Korjattiin virhe, jonka vuoksi hyökkäysammuksettomat sankarit eivät voineet heijastaa Hoodwinkin Acorn Shotia.",
      "[*] Korjattiin virhe, jonka vuoksi Jakiron Liquid Frost teki joskus lisävahinkoa Blood Grenaden vahingosta.",
      "[*] Korjattiin virhe, jonka vuoksi Kunkan Ghostship ei käyttänyt Suolaisen merimiehen saaliin kuolematonta tehostetta Aghanim's Scepter -päivityksen kanssa.",
      "[*] Korjattiin virhe, jonka vuoksi Lifestealerin Ghoul Frenzy ei murtunut täysin.",
      "[*] Korjattiin virhe, jonka vuoksi Lina ei voinut päivittää kaikkia taitopuun taitoja.",
      "[*] Korjattiin virhe, jonka vuoksi Leshracin Diabolic Edict teki joskus odotettua vähemmän vahinkoa.",
      "[*] Korjattiin virhe, jonka vuoksi Lone Druid sai enemmän kultaa Philosopher's Stonen tuhoutumisesta.",
      "[*] Korjattiin virhe, jonka vuoksi Lone Druidin Spirit Bearin piirteet eivät vastanneet kykytekstin arvoja.",
      "[*] Korjattiin virhe, jonka vuoksi Lone Druidin Demolishin ja Entangling Clawsin tasot eivät näkyneet oikein.",
      "[*] Korjattiin virhe, jonka vuoksi Lunan Lunar Blessingin kykyteksti saattoi kaataa pelin.",
      "[*] Korjattiin virhe, jonka vuoksi Marsin Dauntless laski harhat sankareiksi.",
      "[*] Korjattiin virhe, jonka vuoksi Nature's Prophetin Curse of the Oldgrowthin vahinko ei ottanut Ironwood Treant -kulmakiveä huomioon oikein.",
      "[*] Korjattiin virhe, jonka vuoksi Nature's Prophetin Spirit of the Forestin kykyteksti ei näyttänyt viidettä tasoa.",
      "[*] Korjattiin virhe, jonka vuoksi Ogre Magi saattoi saada 3× ja 4× Multicasteja ennen toista ja kolmatta tasopäivitystä.",
      "[*] Korjattiin Omniknightin Repelin puuttuvat äänirepliikit.",
      "[*] Korjattiin virhe, jonka vuoksi Phantom Lancerin Illusory Armaments -luontaiskyky antoi loputtomasti vahinkoa.",
      "[*] Korjattiin virhe, jonka vuoksi Phantom Lancerin Illusory Armaments -luontaiskyky ei antanut lainkaan vahinkoa.",
      "[*] Korjattiin virhe, jonka vuoksi Razorin Dynamo antoi välillä väärän määrän kykyvahvistusta.",
      "[*] Korjattiin virhe, jonka vuoksi Rubick ei tehnyt Death Rime -vahinkoa varastaessaan Ancient Apparitionin kykyjä.",
      "[*] Korjattiin kaatuminen, joka aiheutui, kun Rubickin varastama Ghostship vanheni juuri ennen määränpäähänsä saapumista.",
      "[*] Korjattiin virhe, jonka vuoksi Rubick ei voinut varastaa Sand Kingin Stingeriä. ",
      "[*] Korjattiin virhe, jonka vuoksi Skywrath Magen tason 15 taitopäivitys ei ollut päivittynyt Concussive Shotin hidastukseksi.",
      "[*] Korjattiin virhe, jonka vuoksi Snapfiren Lil' Shredder teki liian vähän vahinkoa kriittisillä osumilla.",
      "[*] Korjattiin virhe, jonka vuoksi Sniperin Headshotin kykyteksti väitti virheellisesti kyvyn toimivan liittolaiskätyreihin.",
      "[*] Korjattiin virhe, jonka vuoksi Spectren Realityn ääni ei kuulunut vihollisille, jos hän siirtyi sotasumussa olevaan harhaan.",
      "[*] Korjattiin Spirit Breakerin Planar Pocket -loitsun uudelleenohjaus kyvyille, jotka etsivät uusia kohteita uudelleenohjauksen aikana. Tämä aiheutti tahatonta ylimääräistä vahinkoa koko alueella.",
      "[*] Korjattiin virhe, jonka vuoksi Techiesin Blast Offin kykyteksti ei näyttänyt itseisvahingolle oikeaa vahinkotyyppiä.",
      "[*] Korjattiin virhe, jonka vuoksi Tinyn Toss ei laukaissut Phylacteryä, kun heittokohde oli sama kuin heitettävä hahmo.",
      "[*] Korjattiin virhe, jonka vuoksi Troll Warlordin Berserker's Rage teki vahinkoa Troll Warlordiin.",
      "[*] Korjattiin virhe, jonka vuoksi Venomancerin Plague Carrier -kulmakivi ei totellut kykyjenestotoimintoa.",
      "[*] Korjattiin virhe, jonka vuoksi Visagen Lurkerin kykyteksti käytti latausaikojen lyhennystä latausaikojen nopeuttamisen sijaan.",
      "[/list]"
    ],
    "commentcount": 201,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "ModAct_487176015_1723138016_4",
      "ModAct_1426387032_1723159076_4",
      "ModAct_1278681683_1724689360_4"
    ],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 6751,
    "votedowncount": 744,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1730847165,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724689361,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "unlisted": 0,
  "votes_up": 6751,
  "votes_down": 744,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}