{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2 – Atualização de 2 de agosto de 2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1723158392
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1724688606
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false,
    "rt_migrated_time": 1723158346.729
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2 – Atualização de 2 de agosto de 2024",
    "posttime": 1722648012,
    "updatetime": 1724688606,
    "body": [
      "Ao longo dos últimos dias, corrigimos os seguintes problemas:",
      "[list]",
      "[*] Foi corrigido um bug que podia causar latência de input durante alguns segundos.",
      "[*] Foram corrigidos casos onde os efeitos de auras não eram aplicados corretamente se a partida durasse demasiado tempo (por exemplo, várias instâncias de dano de Doom).",
      "[*] Foi corrigido um problema com reduções de cooldowns, que não funcionavam corretamente ao decrementar em valores muito baixos (por exemplo, Staff of the Scion).",
      "[*] Foram corrigidos casos onde efeitos de bloqueio de dano corpo a corpo (Melee) não bloqueavam dano nenhum.",
      "[*] Bloodstone: a descrição foi corrigida para incluir o bónus de regeneração de mana.",
      "[*] Ironwood Tree: foi corrigido um problema que impedia este item de ser comprado no modo de teste.",
      "[*] Mirror Shield: foi corrigido um caso onde este item bloqueava feitiços se estivesse em cooldown e Lotus Orb estivesse ativo.",
      "[*] Unwavering Condition: foi corrigido um problema que fazia com que este item causasse uma falha crítica.",
      "[*] Alchemist: a habilidade Unstable Concoction foi corrigida para poder ser usada no Spirit Bear.",
      "[*] Bane: foi corrigido um caso onde alvos de Nightmare podiam usar habilidades sem tempo de conjuração antes que fossem afetados por Fiend's Grip.",
      "[*] Beastmaster: foi corrigido o funcionamento de Drums of Slom quando ilusões do Beastmaster estão presentes.",
      "[*] Bloodseeker: foi corrigido um problema com a Faceta \"Bloodrush\", que atribuía assistências incorretamente. ",
      "[*] Bristleback: foi corrigido um problema com a Faceta \"Seeing Red\", que fazia com que o efeito visual se acumulasse indefinidamente.",
      "[*] Clockwerk: foi corrigido um problema com a habilidade Power Cogs, cujas engrenagens usavam incorretamente o texto \"Acorrentado\".",
      "[*] Death Prophet: a habilidade Exorcism foi corrigida para deixar de afetar Postos Avançados.",
      "[*] Drow Ranger: foi corrigido um problema com a Faceta \"Sidestep\", que fazia com que Glacier interrompesse Multishot.",
      "[*] Elder Titan: foi corrigido um problema com a habilidade Inata \"Tip the Scales\", cujo efeito não funcionava em torres que estavam invulneráveis porque a torre correspondente de nível anterior ainda não tinha sido destruída.",
      "[*] Elder Titan: o efeito da habilidade Inata \"Tip the Scales\" foi corrigido para funcionar enquanto o Elder Titan estiver morto.",
      "[*] Ember Spirit: foi corrigido um bug que impedia a obtenção de todos os talentos.",
      "[*] Hoodwink: foi corrigido um problema com a habilidade Acorn Shot, que não podia ser refletida por heróis sem projéteis.",
      "[*] Jakiro: foi corrigido um problema ocasional com a habilidade Liquid Frost, que causava dano adicional a alvos afetados pelo dano periódico do item Blood Grenade.",
      "[*] Kunkka: a habilidade Ghostship foi corrigida para que o navio fantasma use o efeito do item Imortal \"Prize of the Saltworn Mariner\" quando o herói tiver um Aghanim's Scepter.",
      "[*] Lifestealer: foi corrigido um problema com a habilidade Ghoul Frenzy, que não era totalmente desativada pelo efeito Break.",
      "[*] Lina: foi corrigido um bug que impedia a obtenção de todos os talentos.",
      "[*] Leshrac: foi corrigido um problema com a habilidade Diabolic Edict, que podia causar menos dano do que o esperado.",
      "[*] Lone Druid: foi corrigido um caso onde este herói podia receber mais ouro do que o esperado ao destruir o item Philosopher's Stone.",
      "[*] Lone Druid: foi corrigido um problema com o Spirit Bear, cujos valores não correspondiam aos indicados em descrições.",
      "[*] Lone Druid: foi corrigido um problema com as habilidades Demolish e Entangling Claws, que não indicavam o respetivo nível corretamente.",
      "[*] Luna: foi corrigido um problema que fazia com que a descrição da habilidade Inata \"Lunar Blessing\" causasse uma falha crítica.",
      "[*] Mars: a habilidade Inata \"Dauntless\" foi corrigida para funcionar contra (ou com) ilusões.",
      "[*] Nature's Prophet: foi corrigido um problema com a habilidade Curse of the Oldgrowth cujo dano por segundo era inconsistente com a Faceta \"Ironwood Treant\".",
      "[*] Nature's Prophet: a descrição da habilidade Inata \"Spirit of the Forest\" foi corrigida para incluir os valores do 5.º nível.",
      "[*] Ogre Magi: foi corrigido um caso onde Multicast tinha uma probabilidade de usar habilidades 3x/4x antes de obter o segundo/terceiro nível da habilidade.",
      "[*] Omniknight: foi corrigido um caso onde falas não eram reproduzidas quando a habilidade Repel fosse usada.",
      "[*] Phantom Lancer: foi corrigido um problema com a habilidade Inata \"Illusory Armaments\", que concedia dano infinito.",
      "[*] Phantom Lancer: foi corrigido um problema com a habilidade Inata \"Illusory Armaments\", que concedia 0 de dano.",
      "[*] Razor: foram corrigidos casos onde a Faceta \"Dynamo\" concedia a quantidade errada de amplificação de feitiços.",
      "[*] Rubick: foi corrigido um problema onde o dano de Death Rime não era aplicado ao roubar os feitiços do Ancient Apparition.",
      "[*] Rubick: foi corrigida uma falha crítica que ocorria quando a duração do roubo da habilidade Ghostship terminava antes de o navio fantasma chegar ao seu destino.",
      "[*] Sand King: a habilidade Stinger foi corrigida para poder ser roubada por Spell Steal. ",
      "[*] Skywrath Mage: foi corrigido um problema onde o talento de nível 15 não era atualizado para \"Concussive Shot: +15% de abrandamento\".",
      "[*] Snapfire: foi corrigido um problema com a habilidade Lil' Shredder, que causava menos dano crítico do que o esperado.",
      "[*] Sniper: foi corrigido um erro na descrição da habilidade Headshot, que dizia que funcionava contra creeps aliados.",
      "[*] Spectre: foi corrigido um problema com a habilidade Reality, cujo som não podia ser ouvido pelo inimigo caso ela se teletransportasse para um local na névoa de guerra.",
      "[*] Spirit Breaker: foi corrigido um problema na interação entre Planar Pocket e habilidades que perseguem alvos novos durante redirecionamentos, que fazia com que dano adicional inesperado fosse causado na área.",
      "[*] Techies: foi corrigido um problema na descrição da habilidade Blast Off!, que não indicava o tipo de dano correto do dano autoinfligido.",
      "[*] Tiny: foi corrigido um problema com a habilidade Toss, que não ativava os efeitos do item Phylactery se o alvo lançado e o alvo principal fossem o mesmo.",
      "[*] Troll Warlord: foi corrigido um bug que fazia com que a habilidade Berserker's Rage causasse dano ao próprio herói.",
      "[*] Venomancer: foi corrigido um problema com a Faceta \"Plague Carrier\", que estava a ignorar a opção de desativação de ajuda.",
      "[*] Visage: a descrição da habilidade Inata \"Lurker\" foi corrigida para usar o termo \"aceleração de cooldowns\" em vez de \"redução de cooldowns\".",
      "[/list]"
    ],
    "commentcount": 201,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "ModAct_487176015_1723138016_4",
      "ModAct_1426387032_1723159076_4",
      "ModAct_1278681683_1724689360_4"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 6751,
    "votedowncount": 744,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1730847165,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724689361,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "votes_up": 6751,
  "votes_down": 744,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}