{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização do Dota 2 — 2 de agosto de 2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1722878356
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Atualização do Dota 2 — 2 de agosto de 2024",
    "posttime": 1722648012,
    "updatetime": 1723136791,
    "body": [
      "Nos últimos dias, corrigimos os seguintes problemas de jogabilidade:",
      "[list]",
      "[*] Correção de problema ocasional que causava atrasos de entrada por alguns segundos.",
      "[*] Correção da aplicação incorreta de auras em partidas muito longas (exemplo: múltiplas instâncias de dano de Condenar).",
      "[*] Correção de problema ocasional onde reduções minúsculas de intervalos entre usos não funcionavam corretamente (exemplo: Cajado do Descendente).",
      "[*] Correção da não aplicação ocasional do bloqueio de dano de heróis corpo a corpo.",
      "[*] Pedra de Sangue: correção da ausência de regeneração de mana na descrição.",
      "[*] Árvore Galho-de-Ferro: correção da indisponibilidade na loja do modo de testes.",
      "[*] Escudo Espelhado: correção do bloqueio de habilidades, que era ativado durante o intervalo entre usos caso houvesse um Orbe de Lótus ativo.",
      "[*] Condicionamento Inabalável: correção de travamento.",
      "[*] Alchemist: correção da Mistura Instável, que não podia ser usada no Espírito Urso.",
      "[*] Bane: correção da interação entre Pesadelo seguido pelo Aperto do Demônio, que permitia brevemente o uso de habilidades sem ponto de lançamento.",
      "[*] Beastmaster: correção do Tambor de Slom, que não funcionava corretamente quando havia ilusões do Beastmaster próximas.",
      "[*] Bloodseeker: correção da faceta \"Correndo Pelas Veias\", que creditava o Bloodseeker com assistências indevidas. ",
      "[*] Bristleback: correção da faceta \"Fúria Focal\", cujo efeito visual era acumulado indefinidamente.",
      "[*] Clockwerk: correção da Engrenagem, onde o texto \"Enraizado\" era exibido indevidamente sobre os alvos presos.",
      "[*] Death Prophet: correção do Exorcismo, que podia alvejar postos avançados.",
      "[*] Drow Ranger: correção da Geleira, que interrompia o Disparo Múltiplo com a faceta \"Arqueira Multitarefa\".",
      "[*] Elder Titan: correção da habilidade Nativa, Fiel da Balança, cujo efeito não funcionava em torres invulneráveis devido a uma torre anterior ainda de pé.",
      "[*] Elder Titan: correção da habilidade Nativa, Fiel da Balança, cujo efeito não funcionava caso o Elder Titan estivesse morto.",
      "[*] Ember Spirit: correção de problema que impedia aprimorar todos os talentos.",
      "[*] Hoodwink: correção do Disparo de Bolota, que não podia ser refletido por heróis sem projéteis.",
      "[*] Jakiro: correção do Gelo Líquido, que ocasionalmente causava dano adicional da Granada de Sangue ao longo do tempo.",
      "[*] Kunkka: correção do Navio Fantasma, que não usava o efeito do Imortal \"Prêmio do Marinheiro Salobro\" com o Cetro de Aghanim.",
      "[*] Lifestealer: correção do Frenesi Carniçal, que não era inteiramente quebrável.",
      "[*] Lina: correção de problema que impedia aprimorar todos os talentos.",
      "[*] Leshrac: correção do Decreto Diabólico, que às vezes causava dano aquém do esperado.",
      "[*] Lone Druid: correção de problema que o permitia receber mais ouro com a destruição da Pedra Filosofal.",
      "[*] Lone Druid: correção do Espírito Urso, cujos valores não correspondiam aos da descrição.",
      "[*] Lone Druid: correção das habilidades Demolir e Garras Entrelaçantes, que não exibiam os seus níveis corretamente.",
      "[*] Luna: correção da Bênção Lunar, cuja descrição podia travar o cliente.",
      "[*] Marte: correção da habilidade Nativa, Destemor, que funcionava contra (e com) ilusões.",
      "[*] Nature's Prophet: correção da Maldição da Floresta Nativa, cujo dano ao longo do tempo era inconsistente com a faceta \"Treant Galho-de-Ferro\".",
      "[*] Nature's Prophet: correção do Espírito da Floresta, cuja descrição não exibia os valores do quinto nível.",
      "[*] Ogre Magi: correção de problema que o permitia ativar Multilançamentos de 3x e 4x antes de aprimorar a habilidade para os níveis 2 e 3.",
      "[*] Omniknight: correção de Repelir, cujas falas estavam ausentes.",
      "[*] Phantom Lancer: correção da habilidade Nativa, Armamento Ilusório, que podia conceder dano infinito.",
      "[*] Phantom Lancer: correção da habilidade Nativa, Armamento Ilusório, que podia conceder dano zerado.",
      "[*] Razor: correção da faceta \"Dínamo\", que às vezes concedia a quantidade incorreta de amplificação arcana.",
      "[*] Rubick: correção da interação com habilidades roubadas do Ancient Apparition, que não aplicavam dano do Frio de Matar.",
      "[*] Rubick: correção de travamento ao usar um Navio Fantasma roubado e perder a habilidade antes do término do efeito.",
      "[*] Sand King: correção da Ferroada, que não podia ser roubada. ",
      "[*] Skywrath Mage: correção do Talento Nível 15, que não foi atualizado para \"Retardo para Disparo Contusivo\".",
      "[*] Snapfire: correção da Rajada Bélica, que causava dano aquém do esperado em acertos críticos.",
      "[*] Sniper: correção de Atirar na Cabeça, cuja descrição informava incorretamente que funcionava em criaturas aliadas.",
      "[*] Spectre: correção da Realidade, cujo som era inaudível para o inimigo caso ela se teletransportasse para um ponto sob a névoa de guerra.",
      "[*] Spirit Breaker: correção do redirecionamento do Bolsão Planar com habilidades que buscam novos alvos durante o redirecionamento, que causava dano em área além do esperado.",
      "[*] Techies: correção do Lançamento!, cuja descrição de dano causado a si mesmo não indicava o tipo de dano correto.",
      "[*] Tiny: correção de Lançar, que não ativava o Filactério quando o alvo Lançado era o alvo primário.",
      "[*] Troll Warlord: correção da Ira do Furioso, que causava dano a si próprio.",
      "[*] Venomancer: correção da faceta \"Carona Envenenada\", que não respeitava a opção de desativar ajuda.",
      "[*] Visage: correção da habilidade Nativa, Espreitador, cuja descrição usava o termo \"redução dos intervalos entre usos\" em vez de \"aceleração dos intervalos entre usos\".",
      "[/list]"
    ],
    "commentcount": 120,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "mod_require_rereview"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 2562,
    "votedowncount": 270,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1723136792,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1722886745,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 2562,
  "votes_down": 270,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}