{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja Dota 2 – 2 sierpnia 2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1723158392
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1724688606
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false,
    "rt_migrated_time": 1723158346.729
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aktualizacja Dota 2 – 2 sierpnia 2024",
    "posttime": 1722648012,
    "updatetime": 1724688606,
    "body": [
      "W ciągu ostatnich kilku dni zajęliśmy się następującymi problemami:",
      "[list]",
      "[*] Naprawiono błąd powodujący, że czasami występowało kilkusekundowe opóźnienie wprowadzania danych wejściowych.",
      "[*] Naprawiono błąd powodujący nieprawidłowe nakładanie aur, gdy mecz trwał za długo (dotyczy wielu instancji um. Doom itd.).",
      "[*] Naprawiono błąd powodujący, że czasami redukcja czasów oczekiwania nie działała prawidłowo, gdy była zmniejszana o bardzo niewielkie wartości (aspekt Kostur Potomka itd.).",
      "[*] Naprawiono błąd powodujący, że blokowanie obrażeń zadawanych wręcz niekiedy nie blokowało żadnych obrażeń.",
      "[*] Naprawiono błąd powoujący, że objaśnienie przedmiotu Bloodstone nie wyświetlało zapewnianej przez niego regeneracji many.",
      "[*] Naprawiono błąd powodujący, że nie dało się zakupić przedmiotu Ironwood Tree w trybie testowania bohatera.",
      "[*] Naprawiono błąd powodujący, że przedmiot Mirror Shield blokował czary podczas czasu oczekiwania, gdy przedmiot Lotus Orb był aktywny.",
      "[*] Naprawiono błąd, wskutek którego przedmiot Unwavering Condition powodował nieoczekiwane zamknięcie gry.",
      "[*] Naprawiono błąd powodujący, że um. Unstable Concoction od Alchemista nie dało się użyć na duchowym niedźwiedziu.",
      "[*] Naprawiono błąd powodujący, że kombinacja um. Nightmare i Fiend's Grip od Bane'a miała małe okienko czasowe, podczas którego cel mógł rzucać umiejętności bez czasu rzucania.",
      "[*] Naprawiono błąd powodujący, że um. Drums of Slom od Beastmastera nie działała prawidłowo w obecności jego iluzji.",
      "[*] Naprawiono błąd powodujący, że aspekt Gorączka Krwi od Bloodseekera przypisywał mu nieprawidłowe asysty. ",
      "[*] Naprawiono błąd, wskutek którego aspekt Widzę Czerwień od Bristlebacka powodował nieskończone kumulowanie się efektu wizualnego.",
      "[*] Naprawiono błąd powodujący, że um. Power Cogs od Clockwerka miała błędne objaśnienie przywiązania.",
      "[*] Naprawiono błąd powodujący, że um. Exorcism od Death Prophet obierała posterunki za cel.",
      "[*] Naprawiono błąd powodujący, że Drow Ranger przerywała um. Multishot z aspektem Zwód, rzucając um. Glacier.",
      "[*] Naprawiono błąd powodujący, że efekt um. Tip the Scales od Elder Titana nie działał na wieżach, które były nietykalne, ponieważ odpowiadające im wieże poprzedniego stopnia nie zostały jeszcze zniszczone.",
      "[*] Naprawiono błąd powodujący, że efekt um. Tip the Scales od Elder Titana nie działał, gdy nie żył.",
      "[*] Naprawiono błąd powodujący, że Ember Spirit nie mógł podnieść poziomu wszystkich swoich talentów.",
      "[*] Naprawiono błąd powodujący, że um. Acorn Shot od Hoodwink nie dało się odbić od bohaterów, którzy nie mieli pocisków.",
      "[*] Naprawiono błąd powodujący, że um. Liquid Frost od Jakiro sporadycznie zadawała dodatkowe obrażenia okresowe z przedmiotu Blood Grenade.",
      "[*] Naprawiono błąd powodujący, że um. Ghostship od Kunkki nie wykorzystywała wiekopomnego efektu Nagrody Marynarskiego Weterana, gdy miał on Aghanim's Scepter.",
      "[*] Naprawiono błąd powodujący, że um. Ghoul Frenzy od Lifestealera nie dało się w pełni złamać.",
      "[*] Naprawiono błąd powodujący, że Lina nie mogła podnieść poziomu wszystkich swoich talentów.",
      "[*] Naprawiono błąd powodujący, że um. Diabolic Edict od Leshraca czasami zadawała mniej obrażeń, niż oczekiwano.",
      "[*] Naprawiono błąd powodujący, że Lone Druid mógł uzyskać więcej złota za zniszczenie przedmiotu Philosopher's Stone.",
      "[*] Naprawiono błąd powodujący, że wartości dla duchowego niedźwiedzia nie zgadzały się z tymi przedstawionymi w objaśnieniu.",
      "[*] Naprawiono błąd powodujący, że um. Demolish i Entangling Claws od Lone Druida nie wyświetlały prawidłowo swoich poziomów.",
      "[*] Naprawiono błąd, wskutek którego um. Lunar Blessing od Luny niekiedy powodowała nieoczekiwane zamknięcia klienta.",
      "[*] Naprawiono błąd powodujący, że um. Dauntless od Marsa działała przeciwko iluzjom (lub z nimi).",
      "[*] Naprawiono błąd powodujący, że obrażenia okresowe z um. Curse of the Oldgrowth od Nature's Propheta były niezgodne z aspektem Drzewiec Żelazokory.",
      "[*] Naprawiono błąd powodujący, że objaśnienie um. Spirit of the Forest od Nature's Propheta nie wyświetlało jej 5. poziomu.",
      "[*] Naprawiono błąd powodujący, że potrójne i poczwórne rzucenie czaru z um. Multicast od Ogre Magi było możliwe przed osiągnięciem drugiego i trzeciego poziomu umiejętności.",
      "[*] Naprawiono błąd powodujący, że um. Repel od Omniknighta brakowało kwestii dialogowych.",
      "[*] Naprawiono błąd powodujący, że um. wrodzona Illusory Armaments od Phantom Lancera zadawała nieskończone obrażenia.",
      "[*] Naprawiono błąd powodujący, że um. wrodzona Illusory Armaments od Phantom Lancera zadawała zerowe obrażenia.",
      "[*] Naprawiono błąd powodujący, że aspekt Dynamo od Razora czasami przyznawał nieprawidłową wartość wzmocnienia czarów.",
      "[*] Naprawiono błąd powodujący, że Rubick nie nakładał obrażeń z um. Death Rime po ukradnięciu jej od Ancient Apparitiona.",
      "[*] Naprawiono błąd powodujący nieoczekiwane zamknięcie związane z Rubickiem, gdy skradziony czar Ghostship wygasał zaraz przed dotarciem do celu.",
      "[*] Naprawiono błąd powodujący, że um. Stinger od Sand Kinga nie dało się ukraść. ",
      "[*] Zaktualizowano talent 15. poziomu Skywrath Mage'a do zamierzonej wersji z aktualizacji 7.37, w której wzmacnia on spowolnienie z um. Concussive Shot.",
      "[*] Naprawiono błąd powodujący, że um. Lil' Shredder od Snapfire zadawała mniej obrażeń z trafień krytycznych, niż było to w założeniu.",
      "[*] Poprawiono objaśnienie do um. Headshot od Snipera, które błędnie wskazywało, że umiejętność działa na sojusznicze stwory.",
      "[*] Naprawiono błąd powodujący, że odgłos um. Reality od Spectre był niesłyszalny dla wroga, jeśli teleportowała się ona do lokalizacji skrytej we mgle wojny.",
      "[*] Naprawiono błąd powodujący, że przekierowywanie czarów z um. Planar Pocket od Spirit Breakera dla umiejętności poszukujących nowych celów w trakcie przekierowywania powodowało niezamierzone dodatkowe obrażenia na całym obszarze.",
      "[*] Poprawiono objaśnienie um. Blast Off! od Techiesów dotyczące obrażeń zadawanych samym sobie tą umiejętnością, które wcześniej nie odzwierciedlało poprawnego typu obrażeń.",
      "[*] Naprawiono błąd powodujący, że um. Toss od Tiny'ego nie aktywowała przedmiotu Phylactery, gdy rzucony cel był tym samym co wybrany cel.",
      "[*] Naprawiono błąd powodujący, że um. Berserker's Rage od Trolla Warlorda zadawała obrażenia jemu samemu.",
      "[*] Naprawiono błąd powodujący, że aspekt Nosiciel Plagi od Venomancera ignorował opcję „Wyłącz pomoc”.",
      "[*] Naprawiono błąd powodujący, że objaśnienie um. Lurker od Visage'a używało określenia „skrócenie czasu oczekiwania” zamiast „przyspieszenie czasu oczekiwania”.",
      "[/list]"
    ],
    "commentcount": 196,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "ModAct_487176015_1723138016_4",
      "ModAct_1426387032_1723159076_4",
      "mod_require_rereview"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 5972,
    "votedowncount": 672,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1724688606,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1723159077,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 5972,
  "votes_down": 672,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}