{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Aggiornamento di Dota 2 del 2 agosto 2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1722878356
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aggiornamento di Dota 2 del 2 agosto 2024",
    "posttime": 1722648012,
    "updatetime": 1723136791,
    "body": [
      "Nel corso degli ultimi giorni abbiamo risolto i seguenti problemi:",
      "[list]",
      "[*] Corretto un bug che a volte causava un ritardo di input per alcuni secondi.",
      "[*] Risolto il problema per cui le aure non si applicavano correttamente se la durata della partita era troppo lunga (si applicava a più istanze di danno di Condanna, ecc.).",
      "[*] Risolto il problema per cui la riduzione del tempo di ricarica a volte non funzionava correttamente quando diminuiva di valori molto bassi (Bastone del discendente, ecc.).",
      "[*] Risolto il problema per cui a volte il blocco dei danni da mischia non bloccava alcun danno.",
      "[*] Risolto il problema per cui la descrizione di Diaspro Sanguigno non mostrava la rigenerazione di mana fornita.",
      "[*] Risolto il problema per cui Albero di Ferro non era acquistabile in modalità demo.",
      "[*] Risolto il problema per cui Scudo Specchio bloccava gli incantesimi durante il tempo di ricarica quando l'abilità Loto Gemmato era attiva.",
      "[*] Risolto il problema per cui Condizione Incrollabile causava un arresto anomalo.",
      "[*] Risolto il problema per cui Miscuglio instabile di Alchemist non era utilizzabile su Spirito Orso.",
      "[*] Risolto il problema per cui sovrapponendo Incubo e Stretta maligna di Bane si creava un breve intervallo in cui le abilità senza tempo di lancio potevano essere utilizzate.",
      "[*] Risolto il problema per cui Tamburi di Slom di Beastmaster non funzionava correttamente quando erano presenti le illusioni di Beastmaster.",
      "[*] Risolto il problema per cui la faccetta Scatto sanguinario di Bloodseeker conferiva a Bloodseeker degli aiuti errati. ",
      "[*] Risolto il problema per cui la faccetta Vedo rosso di Bristleback faceva sì che l'effetto visivo si accumulasse all'infinito.",
      "[*] Risolto il problema per cui gli ingranaggi di Clockwerk mostravano una descrizione errata di Incatenato.",
      "[*] Risolto il problema per cui Esorcismo di Death Prophet bersagliava gli Avamposti.",
      "[*] Risolto il problema per cui Ghiacciaio di Drow Ranger interrompeva Colpo multiplo con la faccetta Versatilità.",
      "[*] Risolto il problema per cui l'effetto Ago della bilancia di Elder Titan non funzionava sulle torri che erano invulnerabili per via del fatto che la corrispondente torre di livello precedente non era stata distrutta.",
      "[*] Risolto il problema per cui l'effetto Ago della bilancia di Elder Titan non funzionava quando Elder Titan era morto.",
      "[*] Risolto il problema per cui Ember Spirit non riusciva a livellare tutti i talenti.",
      "[*] Risolto il problema per cui Lancio della ghianda di Hoodwink non poteva essere riflesso dagli Eroi che attaccavano senza proiettile.",
      "[*] Risolto il problema per cui Ghiaccio liquido di Jakiro occasionalmente infliggeva un danno aggiuntivo oltre al danno nel tempo di Granata di Sangue.",
      "[*] Risolto il problema per cui Nave fantasma di Kunkka non utilizzava l'effetto immortale \"La Ricompensa del Lupo di Mare\" quando Kunkka aveva uno Scettro di Aghanim.",
      "[*] Risolto il problema per cui Frenesia macabra di Lifestealer non era completamente disattivabile.",
      "[*] Risolto il problema per cui Lina non riusciva a livellare tutti i talenti.",
      "[*] Risolto il problema per cui Editto diabolico di Leshrac a volte infliggeva meno danni del previsto.",
      "[*] Risolto il problema per cui Pietra Filosofale conferiva a Lone Druid più oro da distruzione.",
      "[*] Risolto il problema per cui i valori di Spirito Orso di Lone Druid non corrispondevano ai valori della descrizione.",
      "[*] Risolto il problema per cui le abilità Demolizione e Artigli intrappolanti di Lone Druid non mostravano i rispettivi livelli in modo accurato.",
      "[*] Risolto il problema per cui a volte la descrizione di Benedizione lunare di Luna causava il crash del client.",
      "[*] Risolto il problema per cui Intrepido di Mars funzionava contro (o con) le illusioni.",
      "[*] Risolto il problema per cui i danni nel tempo inflitti da Maledizione dei millenari di Nature's Prophet non corrispondevano alla faccetta Ent corazzato.",
      "[*] Risolto il problema per cui la descrizione di Spirito della foresta di Nature's Prophet non mostrava il quinto livello.",
      "[*] Risolto il problema per cui la multievocazione di Ogre Magi potrebbe attivare le abilità tre o quattro volte prima ancora di raggiungere il secondo e il terzo livello dell'abilità.",
      "[*] Risolto il problema delle risposte vocali mancanti di Vade retro di Omniknight.",
      "[*] Risolto il problema per cui l'abilità innata Armamenti illusori di Phantom Lancer infliggeva un danno infinito.",
      "[*] Risolto il problema per cui l'abilità innata Armamenti illusori di Phantom Lancer infliggeva zero danni.",
      "[*] Risolto il problema per cui a volte Dinamo di Razor forniva una quantità sbagliata di amplificazione degli incantesimi.",
      "[*] Risolto il problema per cui Rubick non infliggeva il danno di Brina mortale quando rubava gli incantesimi di Ancient Apparition.",
      "[*] Risolto il problema del crash di Rubick che si verificava quando un incantesimo Nave fantasma rubato scadeva poco prima di raggiungere la sua destinazione.",
      "[*] Risolto il problema per cui Pungiglione di Sand King non poteva essere rubato. ",
      "[*] Risolto il problema per cui il talento di livello 15 di Skywrath Mage non veniva aggiornato al rallentamento di Colpo a concussione.",
      "[*] Risolto il problema per cui Piccolo distruttore di Snapfire infliggeva meno danni del previsto con i colpi critici.",
      "[*] Risolto il problema per cui la descrizione di Colpo alla testa di Sniper indicava erroneamente che funzionava sui creep alleati.",
      "[*] Risolto il problema per cui il suono di Realtà di Spectre non era udibile dal nemico se si teletrasportava in un luogo nascosto dalla nebbia di guerra.",
      "[*] Risolto il problema della deviazione dell'incantesimo Sacca planare di Spirit Breaker per le abilità che cercavano nuovi bersagli durante la deviazione, causando un danno aggiuntivo involontario in tutta l'area.",
      "[*] Risolto il problema per cui la descrizione del danno autoinflitto di Partenza col botto! di Techies non rifletteva il tipo di danno corretto.",
      "[*] Risolto il problema per cui Lancio di Tiny non attivava Filatterio quando il bersaglio lanciato era lo stesso del bersaglio primario.",
      "[*] Risolto il problema per cui Rabbia del berserker di Troll Warlord infliggeva danni a se stesso.",
      "[*] Risolto il problema per cui Portatore di peste di Venomancer non rispettava Disabilita aiuto.",
      "[*] Risolto il problema per cui la descrizione di Lurker di Visage utilizzava il termine \"Riduzione del tempo di ricarica\" al posto di \"Accelerazione del tempo di ricarica\".",
      "[/list]"
    ],
    "commentcount": 120,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "mod_require_rereview"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 2562,
    "votedowncount": 270,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1723136792,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1722886745,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 2562,
  "votes_down": 270,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}