{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Ενημέρωση Dota 2 – 2/8/2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1723158392
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1724688606
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false,
    "rt_migrated_time": 1723158346.729
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ενημέρωση Dota 2 – 2/8/2024",
    "posttime": 1722648012,
    "updatetime": 1724688606,
    "body": [
      "Τις τελευταίες ημέρες διορθώσαμε τα ακόλουθα προβλήματα:",
      "[list]",
      "[*] Διορθώθηκε ένα σφάλμα που προκαλούσε μερικές φορές καθυστέρηση εισόδου για αρκετά δευτερόλεπτα.",
      "[*] Διορθώθηκε πρόβλημα όπου οι αύρες δεν εφαρμόζονταν σωστά, αν η διάρκεια του αγώνα ήταν πάρα πολύ μεγάλη (αφορά πολλαπλές περιπτώσεις ζημιάς του Doom κτλ.).",
      "[*] Διορθώθηκε πρόβλημα όπου η μείωση του χρόνου επαναφορτίσεων μερικές φορές δεν λειτουργούσε σωστά, όταν ελαττωνόταν κατά πολύ μικρές τιμές (Staff of the Scion κτλ.).",
      "[*] Διορθώθηκε πρόβλημα όπου το μπλοκάρισμα ζημιάς για αγχέμαχους μερικές φορές δεν μπλόκαρε καθόλου ζημιά.",
      "[*] Διορθώθηκε η επεξήγηση του Bloodstone, που δεν εμφάνιζε την παρεχόμενη αναπλήρωση ενέργειας.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν ήταν δυνατή η αγορά του Ironwood Tree στη λειτουργία δοκιμής.",
      "[*] Διορθώθηκε πρόβλημα όπου το Mirror Shield εξουδετέρωνε ξόρκια όσο ήταν σε επαναφόρτιση, όταν ήταν ενεργό το Lotus Orb.",
      "[*] Διορθώθηκε το Unwavering Condition που προκαλούσε απρόσμενο τερματισμό.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν ήταν δυνατή η χρήση του Unstable Concoction του Alchemist στην αρκούδα του Lone Druid.",
      "[*] Διορθώθηκε πρόβλημα όπου, όταν εκτελούνταν ταυτόχρονα οι ικανότητες Nightmare και Fiend's Grip του Bane, δινόταν μια σύντομη ευκαιρία για εκτέλεση ξορκιών χωρίς χρόνο εκτέλεσης.",
      "[*] Διορθώθηκε πρόβλημα όπου το Drums of Slom του Beastmaster δεν λειτουργούσε σωστά, όταν υπήρχαν ψευδαισθήσεις του Beastmaster.",
      "[*] Διορθώθηκε πρόβλημα όπου η όψη Bloodrush του Bloodseeker απέδιδε εσφαλμένα βοήθειες στον Bloodseeker. ",
      "[*] Διορθώθηκε πρόβλημα όπου η όψη Seeing Red του Bristleback έκανε το οπτικό εφέ να συσσωρεύεται επ' άπειρον.",
      "[*] Διορθώθηκε πρόβλημα όπου το Power Cogs του Clockwerk είχε εσφαλμένη επεξήγηση για τη δέσμευση.",
      "[*] Διορθώθηκε πρόβλημα όπου το Exorcism του Death Prophet στόχευε Φυλάκια.",
      "[*] Διορθώθηκε πρόβλημα όπου η εκτέλεση του Glacier από τη Drow Ranger, με την όψη Sidestep, διέκοπτε το Multishot.",
      "[*] Διορθώθηκε η επίδραση του Tip the Scales του Elder Titan που δεν λειτουργούσε σε άτρωτους πύργους, επειδή ήταν ακόμα ζωντανός ο αντίστοιχος πύργος προηγούμενης βαθμίδας.",
      "[*] Διορθώθηκε η επίδραση του Tip the Scales του Elder Titan που δεν λειτουργούσε όσο ήταν νεκρός ο Elder Titan.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Ember Spirit δεν μπορούσε να αναβαθμίσει όλα τα ταλέντα.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν ήταν δυνατή η αντανάκλαση του Acorn Shot της Hoodwink από ήρωες που επιτίθενται χωρίς βλήματα.",
      "[*] Διορθώθηκε πρόβλημα όπου το Liquid Frost του Jakiro προκαλούσε περιστασιακά επιπλέον ζημιά από τη ζημιά διαρκείας του Blood Grenade.",
      "[*] Διορθώθηκε πρόβλημα όπου το Ghostship του Kunkka δεν χρησιμοποιούσε το Immortal εφέ «Prize of the Saltworn Mariner», όταν ο Kunkka είχε ένα Aghanim's Scepter.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν ήταν δυνατή η πλήρης θραύση του Ghoul Frenzy του Lifestealer.",
      "[*] Διορθώθηκε πρόβλημα όπου η Lina δεν μπορούσε να αναβαθμίσει όλα τα ταλέντα.",
      "[*] Διορθώθηκε πρόβλημα όπου το Diabolic Edict του Leshrac προκαλούσε μερικές φορές λιγότερη ζημιά από την προβλεπόμενη.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Lone Druid μπορούσε να λάβει περισσότερο χρυσό καταστροφής από το Philosopher's Stone.",
      "[*] Διορθώθηκε πρόβλημα όπου οι τιμές της αρκούδας του Lone Druid δεν ταίριαζαν με τις τιμές στην επεξήγηση.",
      "[*] Διορθώθηκαν οι ικανότητες Demolish και Entangling Claws του Lone Druid, που δεν εμφάνιζαν σωστά τα επίπεδά τους.",
      "[*] Διορθώθηκε πρόβλημα όπου η επεξήγηση του Lunar Blessing της Luna προκαλούσε μερικές φορές απρόσμενο τερματισμό της εφαρμογής.",
      "[*] Διορθώθηκε πρόβλημα όπου το Dauntless του Mars λειτουργούσε εναντίον ψευδαισθήσεων, καθώς και με ψευδαισθήσεις.",
      "[*] Διορθώθηκε πρόβλημα όπου η ζημιά διαρκείας του Curse of the Oldgrowth του Nature's Prophet δεν ήταν σε συμφωνία με την όψη Ironwood Treant.",
      "[*] Διορθώθηκε η επεξήγηση του Spirit of the Forest του Nature Prophet, που δεν εμφάνιζε το πέμπτο επίπεδο.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Ogre Magi προκαλούσε Multicast για 3 και 4 φορές, πριν λάβει το δεύτερο και τρίτο επίπεδο της ικανότητας.",
      "[*] Διορθώθηκε πρόβλημα όπου έλειπαν οι φωνητικές αποκρίσεις από το Repel του Omniknight.",
      "[*] Διορθώθηκε πρόβλημα όπου η εγγενής ικανότητα Illusory Armaments του Phantom Lancer έδινε άπειρη ζημιά.",
      "[*] Διορθώθηκε πρόβλημα όπου η εγγενής ικανότητα Illusory Armaments του Phantom Lancer έδινε μηδενική ζημιά.",
      "[*] Διορθώθηκε πρόβλημα όπου το Dynamo του Razor παρείχε μερικές φορές λανθασμένο ποσό ενίσχυσης ξορκιών.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Rubick δεν εφάρμοζε ζημιά Πάχνης Θανάτου, όταν έκλεβε τα ξόρκια του Ancient Apparition.",
      "[*] Διορθώθηκε απρόσμενος τερματισμός που συνέβαινε όταν ένα κλεμμένο Ghostship από τον Rubick έληγε ακριβώς πριν φτάσει στον προορισμό του.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν ήταν δυνατό να κλαπεί το Stinger του Sand King. ",
      "[*] Διορθώθηκε πρόβλημα όπου το ταλέντο επιπέδου 15 του Skywrath Mage δεν ενημερωνόταν με την επιβράδυνση του Concussive Shot.",
      "[*] Διορθώθηκε πρόβλημα όπου το Lil' Shredder της Snapfire προκαλούσε λιγότερη ζημιά από την προβλεπόμενη με καίρια χτυπήματα.",
      "[*] Διορθώθηκε η επεξήγηση του Headshot του Sniper, που ανέφερε εσφαλμένα ότι λειτουργεί σε συμμαχικά κριπάκια.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν ακουγόταν ο ήχος του Reality της Spectre στους εχθρούς, όταν τηλεμεταφερόταν σε μια τοποθεσία που δεν φαινόταν λόγω της σκιάς του πολέμου.",
      "[*] Διορθώθηκε πρόβλημα όπου η ανακατεύθυνση ξορκιών από το Planar Pocket του Spirit Breaker για ικανότητες που αναζητούσαν νέους στόχους κατά τη διάρκειά της, προκαλούσε κατά λάθος επιπλέον ζημιά σε όλη την περιοχή.",
      "[*] Διορθώθηκε η επεξήγηση ζημιάς εαυτού του Techies' Blast Off!, που δεν εμφάνιζε τον σωστό τύπο ζημιάς.",
      "[*] Διορθώθηκε πρόβλημα όπου το Toss του Tiny δεν ενεργοποιούσε το Phylactery, όταν η μονάδα υπό Toss ήταν η ίδια με τον κύριο στόχο.",
      "[*] Διορθώθηκε πρόβλημα όπου το Berserker's Rage του Troll Warlord προκαλούσε ζημιά στον εαυτό του.",
      "[*] Διορθώθηκε πρόβλημα όπου η Άρνηση Βοήθειας δεν εφαρμοζόταν στην όψη Plague Carrier του Venomancer.",
      "[*] Διορθώθηκε η επεξήγηση του Lurker του Visage που χρησιμοποιούσε τον όρο «Μείωση επαναφορτίσεων» αντί για «Επιτάχυνση επαναφορτίσεων».",
      "[/list]"
    ],
    "commentcount": 201,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "ModAct_487176015_1723138016_4",
      "ModAct_1426387032_1723159076_4",
      "ModAct_1278681683_1724689360_4"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 6751,
    "votedowncount": 744,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1730847165,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724689361,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 6751,
  "votes_down": 744,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}