{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualizare Dota 2 – 2 august 2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1722878356
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualizare Dota 2 – 2 august 2024",
    "posttime": 1722648012,
    "updatetime": 1722878356,
    "body": [
      "Pe parcursul ultimelor zile am remediat următoarele probleme:",
      "[list]",
      "[*] A fost remediată o eroare care cauza uneori latență timp de câteva secunde pentru input.",
      "[*] A fost remediată problema în care aurele nu erau aplicate corect dacă meciul dura prea mult (de exemplu, instanțele multiple de daune ale abilității Doom).",
      "[*] A fost remediată problema în care reducerea repausurilor nu funcționa uneori corect atunci când repausul trebuia redus cu valori foarte mici (de exemplu, abilitatea Staff of the Scion).",
      "[*] A fost remediată problema în care, uneori, blocarea de daune de meleu nu bloca nicio daună.",
      "[*] A fost remediată problema în care descrierea obiectului Bloodstone nu afișa regenerarea de mana oferită.",
      "[*] A fost remediată problema în care Ironwood Tree nu putea fi achiziționat în modul demo.",
      "[*] A fost remediată problema în care Mirror Shield bloca vrăjile cât timp era supus repausului dacă Lotus Orb era activ.",
      "[*] A fost remediată o cădere a jocului care era cauzată de Unwavering Condition.",
      "[*] A fost remediată problema în care abilitatea Unstable Concoction a lui Alchemist nu putea fi utilizată pe Spirit Bear.",
      "[*] A fost remediată problema în care victimele lui Bane puteau folosi abilitățile cu invocare instantă între instanța de Nightmare și cea de Fiend's Grip.",
      "[*] A fost remediată problema în care abilitatea Drums of Slom a lui Beastmaster nu funcționa corect atunci când erau prezente iluzii ale lui Beastmaster.",
      "[*] A fost remediată problema în care fațeta Bloodrush a lui Bloodseeker îi acorda asistări în mod eronat. ",
      "[*] A fost remediată problema în care fațeta Seeing Red a lui Bristleback determina suprapunerea la nesfârșit a efectului vizual.",
      "[*] A fost remediată problema în care abilitatea Cog a lui Clockwerk afișa în mod eronat „Priponit” deasupra țintelor.",
      "[*] A fost remediată problema în care abilitatea Exorcism a eroinei Death Prophet țintea avanposturile.",
      "[*] A fost remediată problema în care abilitatea Multishot a eroinei Drow Ranger era întreruptă dacă aceasta utiliza fațeta Sidestep și invoca Glacier.",
      "[*] A fost remediată problema în care efectul abilității Tip the Scales a lui Elder Titan nu funcționa asupra turnurilor invulnerabile dacă turnul din rândul precedent nu fusese încă distrus.",
      "[*] A fost remediată problema în care efectul abilității Tip the Scales a lui Elder Titan nu funcționa cât timp Elder Titan era mort.",
      "[*] A fost remediată problema în care Ember Spirit nu putea dobândi toate talentele.",
      "[*] A fost remediată problema în care instanța de Acorn Shot a eroinei Hoodwink nu putea fi reflectată de eroii care atacă fără proiectile.",
      "[*] A fost remediată problema în care abilitatea Liquid Frost a lui Jakiro cauza ocazional daune suplimentare țintelor care încasau daune periodice de la Blood Grenade.",
      "[*] A fost remediată problema în care abilitatea Ghostship a lui Kunkka nu utiliza efectul Immortal „Prize of the Saltworn Mariner” dacă Kunkka avea un Aghanim's Scepter.",
      "[*] A fost remediată problema în care abilitatea Ghoul Frenzy a lui Lifestealer nu putea fi perturbată în întregime.",
      "[*] A fost remediată problema în care Lina nu putea dobândi toate talentele.",
      "[*] A fost remediată problema în care abilitatea Diabolic Edict a lui Leshrac cauza uneori mai puține daune decât trebuia.",
      "[*] A fost remediată problema în care Lone Druid putea primi mai mult aur în urma distrugerii obiectului Philosopher's Stone.",
      "[*] A fost remediată problema în care valorile unității Spirit Bear a lui Lone Druid nu corespundeau cu cele din descriere.",
      "[*] A fost remediată problema în care abilitățile Demolsh și Entangling Claws ale lui Lone Druid nu afișau corect nivelurile.",
      "[*] A fost remediată o cădere a jocului care era cauzată de descrierea abilității Lunar Blessing a eroinei Luna.",
      "[*] A fost remediată problema în care abilitatea Dauntless a lui Mars ținea cont de iluzii.",
      "[*] A fost remediată problema în care daunele cauzate de-a lungul timpului de abilitatea Curse of the Oldgrowth a lui Nature's Prophet erau inconsecvente dacă acesta utiliza fațeta Ironwood Treants.",
      "[*] A fost remediată problema în care descriere abilității Spirit of the Forest a lui Nature's Prophet nu afișa multiplicatorul pentru nivelul 5.",
      "[*] A fost remediată problema în care Ogre Magi puteau invoca de 3 și de 4 ori abilitățile înainte de a dobândi abilitatea Multicast de nivelul doi și trei.",
      "[*] Au fost adăugate replicile care lipseau pentru abilitatea Repel a lui Omniknight.",
      "[*] A fost remediată problema în care abilitatea înnăscută Illusory Armaments a lui Phantom Lancer oferea daune infinite.",
      "[*] A fost remediată problema în care abilitatea înnăscută Illusory Armaments a lui Phantom Lancer oferea zero daune.",
      "[*] A fost remediată problema în care fațeta Dynamo a lui Razor oferea uneori o cantitate greșită de amplificare pentru vrăji.",
      "[*] A fost remediată problema în care Rubick nu cauza daunele aferente abilității Death Rime atunci când fura vrăjile lui Ancient Apparition.",
      "[*] A fost remediată o cădere a jocului care avea loc atunci când Rubick fura Ghostship, iar vraja expira înainte ca instanța să ajungă la destinație.",
      "[*] A fost remediată problema în care abilitatea Stinger a lui Sand King nu putea fi furată. ",
      "[*] A fost remediată problema în care talentul de la nivelul 15 al lui Skywrath Mage care oferea +15% furt de viață pentru vrăji pentru Ruin and Restoration nu a fost înlocuit cu cel care oferă +15% încetinire pentru Concussive Shot.",
      "[*] A fost remediată problema în care abilitatea Lil' Shredder a eroinei Snapfire cauza mai puține daune decât trebuia în cazul loviturilor critice.",
      "[*] A fost remediată problema în care descrierea abilității Headshot a lui Sniper afirma faptul că aceasta funcționează pe creepii aliați.",
      "[*] A fost remediată problema în care sunetul abilității Reality a eroinei Spectre nu era auzibil de inamici dacă aceasta se teleporta într-o locație din ceața războiului.",
      "[*] A fost remediată problema de interacțiune dintre abilitatea Planar Pocket a lui Spirit Breaker și abilitățile care căutau ținte noi în timpul redirecționării, care cauza daune suplimentare în mod eronat în întreaga zonă.",
      "[*] A fost remediată descrierea abilității Blast Off! a lui Techies pentru a specifica tipul corect de daune suferite de către sine.",
      "[*] A fost remediată problema în care abilitatea Toss a lui Tiny nu declanșa Phylactery atunci când ținta aruncată era chiar ținta principală.",
      "[*] A fost remediată problema în care abilitatea Berserker's Rage a lui Troll Warlord îi cauza acestuia daune.",
      "[*] A fost remediată problema în care fațeta Plague Carrier a lui Venomancer nu ținea cont de opțiunea „Dezactivează ajutorul”.",
      "[*] A fost remediată problema în care abilitatea Lurker a lui Visage utiliza noțiunea de „Reducere a repausului” în loc de „Accelerare a repausului”.",
      "[/list]"
    ],
    "commentcount": 88,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "mod_require_rereview"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 1394,
    "votedowncount": 141,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1722878357,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1722711305,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 15246903,
  "build_branch": "",
  "votes_up": 1393,
  "votes_down": 141,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}