{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2-opdatering: 2. august 2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1722878356
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2-opdatering: 2. august 2024",
    "posttime": 1722648012,
    "updatetime": 1722878356,
    "body": [
      "I løbet af de sidste par dage har vi rettet følgende problemer:",
      "[list]",
      "[*] Rettede en fejl, der nogle gange forårsagede inputforsinkelse i flere sekunder.",
      "[*] Rettede, at auraer ikke blev påført korrekt, hvis kampen varede for længe (gælder flere skadeinstanser såsom fra Doom osv.).",
      "[*] Rettede, at nedkølingsreduktion nogle gange ikke fungerede korrekt, når den blev reduceret med meget små værdier (Staff of the Scion osv.).",
      "[*] Rettede, at skadeblokering fra nærkampskade nogle gange ikke blokerede nogen skade overhovedet.",
      "[*] Rettede, at Bloodstones beskrivelse ikke viste mana-regenerering.",
      "[*] Rettede, at Ironwood Tree ikke kunne købes i afprøvningstilstand.",
      "[*] Rettede, at Mirror Shield blokerede besværgelser, mens den var på nedkøling, når Lotus Orb var aktiv.",
      "[*] Rettede, at Unwavering Condition forårsagede et spilnedbrud.",
      "[*] Rettede, at Alchemists Unstable Concoction ikke kunne bruges på Spirit Bear.",
      "[*] Rettede et overlap med Banes Nightmare og Fiend's Grip, hvor man kunne bruge evner uden kastetid.",
      "[*] Rettede, at Beastmasters Drums of Slom ikke virkede korrekt, når hans illusioner var i nærheden.",
      "[*] Rettede, at der fejlagtigt blev tildelt assisterede drab med Bloodseekers facet Bloodrush. ",
      "[*] Rettede, at Bristlebacks facet Seeing Red fik den visuelle effekt til at stable uendeligt.",
      "[*] Rettede, at Clockwerks Power Cogs fejlagtigt nævnte lænkning i beskrivelsen.",
      "[*] Rettede, at Death Prophets Exorcism angreb udkigstårne.",
      "[*] Rettede, at Drow Ranger med facetten Sidestep fik afbrudt Multishot, når hun brugte Glacier.",
      "[*] Rettede, at Elder Titans effekt fra Tip the Scales ikke virkede på tårne, der var usårlige, fordi det forrige tårn stadig var i live.",
      "[*] Rettede, at Elder Titans effekt fra Tip the Scales ikke virkede, mens han var død.",
      "[*] Rettede, at Ember Spirit ikke kunne vælge alle sine talenter.",
      "[*] Rettede, at Hoodwinks Acorn Shot ikke kunne reflekteres fra helte, som ikke havde projektiler.",
      "[*] Rettede, at Jakiros Liquid Frost til tider gjorde ekstra skade over tid med Blood Grenade.",
      "[*] Rettede, at Kunkkas Ghostship ikke brugte den udødelige effekt fra \"Prize of the Saltworn Mariner\", når han havde Aghanim's Scepter.",
      "[*] Rettede, at effekten fra Lifestealers Ghoul Frenzy ikke kunne deaktiveres helt.",
      "[*] Rettede, at Lina ikke kunne vælge alle sine talenter.",
      "[*] Rettede, at Leshracs Diabolic Edict nogle gange gjorde mindre skade end forventet.",
      "[*] Rettede, at Lone Druid kunne modtage mere guld fra Philosopher's Stone, når den blev destrueret.",
      "[*] Rettede, at værdierne for Lone Druids Spirit Bear ikke matchede værdierne i beskrivelsen.",
      "[*] Rettede, at Lone Druids evner Demolish og Entangling Claws ikke viste deres level korrekt.",
      "[*] Rettede, at beskrivelsen for Lunas Lunar Blessing nogle gange forårsagede et klientnedbrud.",
      "[*] Rettede, at Mars' Dauntless virkede mod (eller med) illusioner.",
      "[*] Rettede, at skade over tid med Nature's Prophets Curse of the Oldgrowth ikke stemte overens med facetten Ironwood Treant.",
      "[*] Rettede, at beskrivelsen af Nature's Prophets Spirit of the Forest ikke viste det femte level.",
      "[*] Rettede, at Ogre Magi kunne multikaste 3x og 4x, før evnen fik sit andet og tredje level.",
      "[*] Rettede, at Omniknights Repel manglede stemmereplikker.",
      "[*] Rettede, at Phantom Lancers medfødte evne Illusory Armaments gav uendelig skade.",
      "[*] Rettede, at Phantom Lancers medfødte evne Illusory Armaments gav nul skade.",
      "[*] Rettede, at Razors Dynamo nogle gange gav den forkerte mængde evneamplifikation.",
      "[*] Rettede, at Rubick ikke påførte skade fra Death Rime, når han stjal Ancient Apparitions evner.",
      "[*] Rettede et nedbrud med Rubick, når den stjålne besværgelse Ghostship udløb, lige før den nåede sin destination.",
      "[*] Rettede, at Sand Kings Stinger ikke kunne stjæles. ",
      "[*] Rettede, at Skywrath Mages level 15-talent ikke blev opdateret til hæmning fra Concussive Shot.",
      "[*] Rettede, at Snapfires Lil' Shredder gjorde mindre skade end tilsigtet med kritiske angreb.",
      "[*] Rettede, at beskrivelsen af Snipers Headshot fejlagtigt beskrev, at evnen virkede på allierede kryb.",
      "[*] Rettede, at lyden fra Spectres Reality ikke kunne høres af fjenden, hvis hun teleporterede til et område, som var skjult af krigstågen.",
      "[*] Rettede, at Spirit Breakers evneomdirigering med Planar Pocket fik evner, der søgte efter nye mål efter omdirigering, til at gøre utilsigtet ekstra skade i hele området.",
      "[*] Rettede, at selvskaden fra Techies' Blast Off! ikke viste den korrekte skadetype i beskrivelsen.",
      "[*] Rettede, at Tinys Toss ikke aktiverede Phylactery, når det kastede mål var det samme som det primære mål.",
      "[*] Rettede, at Troll Warlords Berserker's Rage gjorde skade på ham selv.",
      "[*] Rettede, at Venomancers Plague Carrier ikke overholdt indstillingen \"Slå hjælp fra\".",
      "[*] Rettede, at beskrivelsen af Visages Lurker nævnte reduktion af nedkøling i stedet for accelerering.",
      "[/list]"
    ],
    "commentcount": 88,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "mod_require_rereview"
    ],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 1394,
    "votedowncount": 141,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1722878357,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1722711305,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 15246903,
  "build_branch": "",
  "votes_up": 1393,
  "votes_down": 141,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}