{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualización de Dota 2 - 2/8/2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1723158392
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1724688606
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false,
    "rt_migrated_time": 1723158346.729
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualización de Dota 2 - 2/8/2024",
    "posttime": 1722648012,
    "updatetime": 1724688606,
    "body": [
      "En los últimos días, hemos solucionado los siguientes problemas:",
      "[list]",
      "[*] Se corrigió un error que a veces provocaba latencia de entrada durante varios segundos.",
      "[*] Se corrigió que las auras no se aplicasen correctamente si la duración de la partida era demasiado larga (se aplica a varias instancias de daño de Doom, etc.).",
      "[*] Se corrigió que la reducción del tiempo de recarga a veces no funcionase correctamente al disminuir en valores muy pequeños (Bastón del Vástago, etc.).",
      "[*] Se corrigió que el bloqueo de daño cuerpo a cuerpo a veces no bloquease ningún daño.",
      "[*] Se corrigió que la descripción emergente de Piedra de Sangre no mostrase la regeneración de maná proporcionada.",
      "[*] Se corrigió que no se pudiese comprar el Árbol de Madera Férrea en el modo de prueba de héroe.",
      "[*] Se corrigió un problema en el que Escudo de Espejo bloqueaba los hechizos durante su tiempo de recarga cuando el Orbe de Loto estaba activo.",
      "[*] Se corrigió un problema en el que Condición Inquebrantable causaba un bloqueo.",
      "[*] Se corrigió que Mezcla Inestable de Alchemist no se pudiese usar en el Espíritu Oso.",
      "[*] Se corrigió que la superposición de Pesadilla y Garra del Diablo de Bane permitiese un breve intervalo en el que se podían lanzar habilidades sin puntos de lanzamiento.",
      "[*] Se corrigió que Tambores de Slom de Beastmaster no funcionase correctamente cuando había ilusiones de Beastmaster presentes.",
      "[*] Se corrigió que la faceta Torrente Sanguíneo atribuyese a Bloodseeker asistencias erróneas. ",
      "[*] Se corrigió que la faceta Visión Roja de Bristleback hiciese que el efecto visual se acumulase indefinidamente.",
      "[*] Se corrigió que la descripción emergente de Engranajes Electrificados de Clockwerk, que mostraba incorrectamente el texto «Encadenado».",
      "[*] Se corrigió que Exorcismo de Death Prophet se pudiese lanzar sobre puestos avanzados.",
      "[*] Se corrigió que Glaciar de Drow Ranger interrumpiese Multidisparo con la faceta Simultaneidad.",
      "[*] Se corrigió que el efecto de Inclinar la Balanza de Elder Titan no funcionase en las torres que eran invulnerables debido a que a la torre del nivel anterior correspondiente aún seguía en pie.",
      "[*] Se corrigió que el efecto de Inclinar la Balanza no funcionase mientras Elder Titan estaba muerto.",
      "[*] Se corrigió que Ember Spirit no pudiese subir de nivel todos los talentos.",
      "[*] Se corrigió que los héroes sin proyectiles no pudiesen reflejar Bellotazo de Hoodwink.",
      "[*] Se corrigió que Escarcha Líquida de Jakiro a veces infligiese daño adicional debido al daño con el tiempo de Granada de Sangre.",
      "[*] Se corrigió que Barco Fantasma de Kunkka no utilizase el efecto inmortal «Premio del Marinero Salado» cuando Kunkka tenía un Cetro de Aghanim.",
      "[*] Se corrigió que Ruptura no pudiese neutralizar totalmente Frenesí Demoníaco de Lifestealer.",
      "[*] Se corrigió que Lina no pudiese subir de nivel todos los talentos.",
      "[*] Se corrigió que Decreto Diabólico de Leshrac a veces infligiese menos daño del esperado.",
      "[*] Se corrigió que Lone Druid pudiese recibir más oro de destrucción de la Piedra Filosofal.",
      "[*] Se corrigió que los valores del Espíritu Oso de Lone Druid no coincidiesen con los de la descripción emergente.",
      "[*] Se corrigió que las habilidades Demoler y Garras Enredadoras de Lone Druid no mostrasen sus niveles con precisión.",
      "[*] Se corrigió que a veces la descripción emergente de Bendición Lunar provocase un bloqueo del cliente.",
      "[*] Se corrigió que Intrépido de Mars funcionase contra (o con) ilusiones.",
      "[*] Se corrigió que el daño con el tiempo de Maldición del Bosque Primigenio de Nature's Prophet fuese inconsistente con la faceta Ent de Madera Férrea.",
      "[*] Se corrigió que la descripción emergente de Espíritu del Bosque de Nature's Prophet no mostrase el nivel 5.",
      "[*] Se corrigió que Multilanzamiento de Ogre Magi utilizase el lanzamiento triple y cuádruple antes del segundo y tercer nivel de la habilidad.",
      "[*] Se añadieron respuestas de voz que faltaban en Repelente de Omniknight.",
      "[*] Se corrigió que la habilidad innata Armamentos Ilusorios de Phantom Lancer otorgase daño infinito.",
      "[*] Se corrigió que la habilidad innata Armamentos Ilusorios de Phantom Lancer no otorgase daño.",
      "[*] Se corrigió que Dinamo de Razor a veces otorgase una cantidad incorrecta de amplificación de hechizo.",
      "[*] Se corrigió que Rubick no aplicase el daño de Escarcha Mortal al robar los hechizos de Ancient Apparition.",
      "[*] Se corrigió un bloqueo de Rubick que se producía cuando un hechizo de Barco Fantasma robado expiraba justo antes de alcanzar su destino.",
      "[*] Se corrigió que Aguijón de Sand King no se pudiese robar. ",
      "[*] Se corrigió que el talento de nivel 15 de Skywrath Mage no se actualizase a la ralentización para Disparo Conmocionador.",
      "[*] Se corrigió que Ametralladora de Snapfire infligiese menos daño del previsto con los Impactos Críticos.",
      "[*] Se corrigió que la descripción emergente de Disparo a la Cabeza de Sniper indicase que funciona con los creeps aliados.",
      "[*] Se corrigió que los enemigos no pudiesen escuchar el sonido de Realidad de Spectre si se teletransportaba a un lugar oculto de la niebla de guerra.",
      "[*] Se corrigió que la redirección de hechizos de Bolsa Planar de Spirit Breaker buscase nuevos objetivos durante la redirección, lo que infligía daño adicional no intencionado en toda el área.",
      "[*] Se corrigió ¡Despegue! de los Techies. Se corrigió que la descripción emergente del daño autoinfligido no mostrase el tipo de daño correcto.",
      "[*] Se corrigió que Lanzamiento de Tiny no activase Filacteria cuando el objetivo lanzado era el mismo que el objetivo principal.",
      "[*] Se corrigió que Furia del Berserker de Troll Warlord le infligiese daño a él mismo.",
      "[*] Se corrigió que Portador de la Plaga de Venomancer no respetase la desactivación de ayuda.",
      "[*] Se corrigió que la descripción emergente de Acechador de Visage utilizase el término «reducción de los tiempos de recarga» en lugar de «aceleración de los tiempos de recarga».",
      "[/list]"
    ],
    "commentcount": 201,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "ModAct_487176015_1723138016_4",
      "ModAct_1426387032_1723159076_4",
      "ModAct_1278681683_1724689360_4"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 6751,
    "votedowncount": 744,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1730847165,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724689361,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 6751,
  "votes_down": 744,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}