{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualización de Dota 2 - 2/8/2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1722878356
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualización de Dota 2 - 2/8/2024",
    "posttime": 1722648012,
    "updatetime": 1722878356,
    "body": [
      "Abordamos los siguientes problemas en los últimos días:",
      "[list]",
      "[*] Se corrigió un error que a veces causaba latencia de entrada por varios segundos.",
      "[*] Se corrigió que las auras no se aplicaran correctamente si la duración de la partida era demasiado larga (se aplica a varias instancias de daño de Doom, etc.).",
      "[*] Se corrigió que la reducción del tiempo de recarga que a veces no funcionaba correctamente al reducir en valores muy pequeños (Bastón del Vástago, etc.).",
      "[*] Se corrigió que el bloqueo de daño cuerpo a cuerpo que a veces no bloqueaba ningún daño.",
      "[*] Se corrigió la descripción emergente de Piedra de Sangre, que no mostraba la regeneración de maná proporcionada.",
      "[*] Se corrigió que no se pudiera comprar Árbol de Madera Férrea en modo de prueba de héroe.",
      "[*] Se corrigió un problema con Escudo de Espejo, que bloqueaba los hechizos durante su tiempo de recarga cuando Orbe de Loto estaba activo.",
      "[*] Se corrigió un problema con Condición Inquebrantable que causaba un bloqueo.",
      "[*] Se corrigió Mezcla Inestable de Alchemist, que no se podía usar en Espíritu Oso.",
      "[*] Se corrigió la superposición de Pesadilla y Garra del Diablo de Bane, que permitía un pequeño intervalo en el que se podían lanzar habilidades sin puntos de lanzamiento.",
      "[*] Se corrigió Tambores de Slom de Beastmaster, que no funcionaba correctamente cuando había ilusiones presentes de Beastmaster.",
      "[*] Se corrigió la faceta Torrente Sanguíneo, que le atribuía a Bloodseeker asistencias erróneas. ",
      "[*] Se corrigió la faceta Visión Roja de Bristleback, que hacía que el efecto visual se acumulara indefinidamente.",
      "[*] Se corrigió la descripción emergente de Engranajes Electrificados de Clockwerk, que mostraba incorrectamente el texto \"Encadenado\".",
      "[*] Se corrigió Exorcismo de Death Prophet, que se podía lanzar sobre puestos avanzados.",
      "[*] Se corrigió Glaciar de Drow Ranger, que interrumpía Multidisparo con la faceta Simultaneidad.",
      "[*] Se corrigió el efecto de Inclinar la Balanza de Elder Titan, que no funcionaba en torres que eran invulnerables debido a que la torre del nivel anterior correspondiente todavía seguía en pie.",
      "[*] Se corrigió el efecto de Inclinar la Balanza, que no funcionaba mientras Elder Titan estaba muerto.",
      "[*] Se corrigió que Ember Spirit no pudiera subir de nivel todos los talentos.",
      "[*] Se corrigió que los héroes sin proyectiles no pudieran reflejar Bellotazo de Hoodwink.",
      "[*] Se corrigió Escarcha Líquida de Jakiro, que a veces infligía daño adicional debido al daño con el tiempo de Granada de Sangre.",
      "[*] Se corrigió Barco Fantasma de Kunkka, que no utilizaba el efecto inmortal \"Premio del Marinero Salado\" cuando Kunkka tenía Cetro de Aghanim.",
      "[*] Se corrigió que Ruptura no pudiera neutralizar totalmente Frenesí Demoníaco de Lifestealer.",
      "[*] Se corrigió que Lina no pudiera subir de nivel todos los talentos.",
      "[*] Se corrigió Decreto Diabólico de Leshrac, que a veces infligía menos daño del esperado.",
      "[*] Se corrigió que Lone Druid pudiera recibir más oro por la destrucción de Piedra Filosofal.",
      "[*] Se corrigieron los valores del Espíritu Oso de Lone Druid, que no coincidían con los de la descripción emergente.",
      "[*] Se corrigieron las habilidades Demoler y Garras Enredadoras de Lone Druid, que no mostraban sus niveles con precisión.",
      "[*] Se corrigió la descripción emergente de Bendición Lunar de Luna, que a veces provocaba un bloqueo del cliente.",
      "[*] Se corrigió Intrépido de Mars, que funcionaba contra (o con) ilusiones.",
      "[*] Se corrigió el daño con el tiempo de Maldición del Bosque Primigenio de Nature's Prophet, que era inconsistente con la faceta Ent de Madera Férrea.",
      "[*] Se corrigió la descripción emergente de Espíritu del Bosque de Nature's Prophet, que no mostraba el nivel 5.",
      "[*] Se corrigió Multilanzamiento de Ogre Magi, que utilizaba lanzamiento triple y cuádruple antes del segundo y tercer nivel de la habilidad.",
      "[*] Se agregaron las respuestas de voz faltantes en Repelente de Omniknight.",
      "[*] Se corrigió la habilidad innata Armamentos Ilusorios de Phantom Lancer, que otorgaba daño infinito.",
      "[*] Se corrigió la habilidad innata Armamentos Ilusorios de Phantom Lancer, que no otorgaba daño.",
      "[*] Se corrigió Dinamo de Razor, que a veces otorgaba una cantidad incorrecta de amplificación de hechizo.",
      "[*] Se corrigió que Rubick no aplicara el daño de Escarcha Mortal al robar hechizos de Ancient Apparition.",
      "[*] Se corrigió un bloqueo de Rubick que se producía cuando un hechizo robado de Barco Fantasma expiraba justo antes de alcanzar su destino.",
      "[*] Se corrigió Aguijón de Sand King, que no se podía robar. ",
      "[*] Se corrigió el talento de nivel 15 de Skywrath Mage, que no actualizaba la ralentización para Disparo Conmocionador.",
      "[*] Se corrigió Ametralladora de Snapfire, que infligía menos daño del previsto con Impactos Críticos.",
      "[*] Se corrigió la descripción emergente de Disparo a la Cabeza de Sniper, que indicaba que funciona con creeps aliados.",
      "[*] Se corrigió que los enemigos no pudieran escuchar el sonido de Realidad de Spectre si se teletransportaba a un lugar oculto de la niebla de guerra.",
      "[*] Se corrigió la redirección de hechizos de Bolsa Planar de Spirit Breaker, que buscaba nuevos objetivos durante la redirección, lo que infligía daño adicional no intencionado en toda el área.",
      "[*] Se corrigió ¡Despegue! de Techies. Se corrigió la descripción emergente de daño autoinfligido, que no mostraba el tipo de daño correcto.",
      "[*] Se corrigió Lanzamiento de Tiny, que no activaba Filacteria cuando el objetivo lanzado era el mismo que el objetivo principal.",
      "[*] Se corrigió Furia del Berserker de Troll Warlord, que infligía daño a él mismo.",
      "[*] Se corrigió Portador de Plagas de Venomancer, que no respetaba la desactivación de ayuda.",
      "[*] Se corrigió la descripción emergente de Acechador de Visage, que utilizaba el término \"Reducción de tiempos de recarga\" en vez de \"Aceleración de tiempos de recarga\".",
      "[/list]"
    ],
    "commentcount": 88,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "mod_require_rereview"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 1394,
    "votedowncount": 141,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1722878357,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1722711305,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 15246903,
  "build_branch": "",
  "votes_up": 1393,
  "votes_down": 141,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}