{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2-uppdatering – 2 augusti 2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1723158392
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1724688606
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false,
    "rt_migrated_time": 1723158346.729
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2-uppdatering – 2 augusti 2024",
    "posttime": 1722648012,
    "updatetime": 1724688606,
    "body": [
      "Under de senaste dagarna har vi tagit itu med följande problem:",
      "[list]",
      "[*] Åtgärdade en bugg som ibland orsakade inmatningsfördröjning i ett antal sekunder.",
      "[*] Åtgärdade auror som inte tillämpades korrekt om matchen pågick för länge (gäller flera skadeinstanser från bl.a. Doom).",
      "[*] Åtgärdade att cooldownreducering ibland inte fungerade korrekt när den reducerades med mycket små värden (t.ex. Staff of the Scion).",
      "[*] Åtgärdade att skadeblockering i närstrid ibland inte blockerade någon skada.",
      "[*] Åtgärdade att Bloodstones verktygstips inte visade manaregeneration som det gav.",
      "[*] Åtgärdade att Ironwood Tree inte kunde köpas i demoläge.",
      "[*] Åtgärdade att Mirror Shield blockerade besvärjelser när Lotus Orb var aktiv under cooldown.",
      "[*] Åtgärdade Unwavering Condition som orsakade en krasch.",
      "[*] Åtgärdade att Alchemists Unstable Concoction inte kunde användas på Spirit Bear.",
      "[*] Åtgärdade en överlappning av Nightmare och Fiend's Grip, där man under en kort tid kunde använda förmågorna utan fördröjning.",
      "[*] Åtgärdade att Beastmasters Drums of Slom inte fungerade korrekt när det fanns Beastmaster-illusioner.",
      "[*] Åtgärdade att Bloodseekers fasett Bloodrush gav Bloodseker felaktiga assister. ",
      "[*] Åtgärdade att Bristlebacks fasett Seeing Red gjorde att den visuella effekten stackades oändligt.",
      "[*] Åtgärdade att Clockwerks Power Cogs hade ett felaktigt Leash-verktygstips.",
      "[*] Åtgärdade att Death Prophets Exorcism kunde attackera utposter.",
      "[*] Åtgärdade att Drow Ranger avbröt Multishot med fasetten Sidestep när hon använde Glacier.",
      "[*] Åtgärdade att Elder Titans effekt Tip the Scales inte fungerade på torn som var osårbara på grund av att det motsvarande tornet på föregående nivå inte hade förstörts.",
      "[*] Åtgärdade att Elder Titans effekt Tip the Scales inte fungerade när Elder Titan var död.",
      "[*] Åtgärdade att Ember Spirit inte kunde öka nivån på alla talanger.",
      "[*] Åtgärdade att Hoodwinks Acorn Shot inte kunde reflekteras från hjältar som inte har någon projektil.",
      "[*] Åtgärdade att Jakiros Liquid Frost ibland gjorde extra skada över tid med Blood Grenade.",
      "[*] Åtgärdade att Kunkkas Ghosthip inte använde den odödliga effekten Prize of the Saltworn Mariner när Kunkka hade en Aghanim's Scepter.",
      "[*] Åtgärdade att Lifestealers Ghoul Frenzy inte kunde avbrytas helt.",
      "[*] Åtgärdade att Lina inte kunde öka nivån på alla talanger.",
      "[*] Åtgärdade att Leshracs Diabolic Edict ibland gjorde mindre skada än förväntat.",
      "[*] Åtgärdade att Lone Druid kunde få mer guld från Philosopher's Stone när den förstördes.",
      "[*] Åtgärdade att värdena på Lone Druids Spirit Bear inte stämde överens med verktygstipsets värden.",
      "[*] Åtgärdade att Lone Druids förmågor Demolish och Entanglig Claws inte visade sina nivåer korrekt.",
      "[*] Åtgärdade att Lunas verktygstips Lunar Blessing ibland gjorde att klienten kraschade.",
      "[*] Åtgärdade att Mars Dauntless fungerade mot (eller med) illusioner.",
      "[*] Åtgärdade att Nature's Prophets skada över tid från Curse of the Oldgrowth inte stämde överens med fasetten Ironwood Treant.",
      "[*] Åtgärdade att Nature Prophets verktygstips för Spirit of the Forest inte visade den femte nivån.",
      "[*] Åtgärdade att Ogre Magi kunde använda Multicast tre eller fyra gånger innan förmågan uppnådde sin andra och tredje nivå.",
      "[*] Åtgärdade att Omniknights Repel saknade röstrepliker.",
      "[*] Åtgärdade att Phantom Lancers medfödda förmåga Illusory Armaments gjorde oändlig skada.",
      "[*] Åtgärdade att Phantom Lancers medfödda förmåga Illusory Armaments inte gjorde någon skada.",
      "[*] Åtgärdade att Razors Dynamo ibland gav fel mängd besvärjelseförstärkning.",
      "[*] Åtgärdade att Rubick inte applicerade skada från Death Rime när han stal Ancient Apparitions besvärjelser.",
      "[*] Åtgärdade att en krasch med Rubick, som inträffade när en stulen Ghost Ship-besvärjelse upphörde precis innan den nådde sin destination.",
      "[*] Åtgärdade att Sand Kings Stinger inte kunde stjälas. ",
      "[*] Åtgärdade att Skywrath Mages nivå 15-talang inte uppdaterades till nedsaktning med Concussive Shot.",
      "[*] Åtgärdade att Snapfires Lil' Shredder gjorde mindre skada än förväntat vid kritiska träffar.",
      "[*] Åtgärdade att Snipers verktygstips Headshot felaktigt angav att det fungerar på allierade creeps.",
      "[*] Åtgärdade att ljudet från Spectres Reality var ohörbart för fienden om hon teleporterade till en plats som var gömd i krigsdimman.",
      "[*] Åtgärdade besvärjelseomdirigeringen för Spirit Breakers Planar Pocket, för förmågor som sökte nya mål under omdirigeringen, som ledde till oavsiktlig extra skada i hela området.",
      "[*] Åtgärdade att verktygstipet för självskada från Techies Blast Off! inte återspeglade rätt skadetyp.",
      "[*] Åtgärdade att Tinys Toss inte utlöste Phylactery när målet som kastades var detsamma som det primära målet.",
      "[*] Åtgärdade att Troll Warlords Berserker's Rage gjorde skada på sig själv.",
      "[*] Åtgärdade att Venomancers Plague Carrier inte tog hänsyn till inställningen Inaktivera hjälp.",
      "[*] Åtgärdade att Visages verktygstips för Lurker använde termen cooldownreducering istället för cooldownacceleration.",
      "[/list]"
    ],
    "commentcount": 200,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "ModAct_487176015_1723138016_4",
      "ModAct_1426387032_1723159076_4",
      "ModAct_1278681683_1724689360_4"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 6647,
    "votedowncount": 731,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1728403261,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724689361,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "votes_up": 6647,
  "votes_down": 731,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}