{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2 Güncellemesi - 2 Ağustos 2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1723158392
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1724688606
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false,
    "rt_migrated_time": 1723158346.729
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2 Güncellemesi - 2 Ağustos 2024",
    "posttime": 1722648012,
    "updatetime": 1724688606,
    "body": [
      "Son birkaç gün içinde aşağıdaki sorunları çözdük:",
      "[list]",
      "[*] Bazen birkaç saniyelik girdi gecikmesine neden olan bir hata düzeltildi.",
      "[*] Maç çok uzun sürdüğünde auraların doğru uygulanmaması düzeltildi (örneğin birden fazla Doom hasarı).",
      "[*] Dolum süresi azaltmanın, çok az bir değerde olduğunda bazen düzgün çalışmaması düzeltildi (Staff of the Scion gibi).",
      "[*] Yakın dövüş hasar engellemenin bazen hiç hasar engellememesi düzeltildi.",
      "[*] Bloodstone'un araç ipucunun mana yenilenmesini göstermemesi düzeltildi.",
      "[*] Ironwood Tree'nin deneme modunda satın alınamaması düzeltildi.",
      "[*] Lotus Orb aktifken, dolum süresindeki Mirror Shield'ın büyüleri engellemesi düzeltildi.",
      "[*] Unwavering Condition'ın çökmeye neden olması düzeltildi.",
      "[*] Alchemist'in Unstable Concoction yeteneğinin Spirit Bear üzerinde kullanılamaması düzeltildi.",
      "[*] Bane'in Nightmare ve Fiend's Grip yeteneklerinin, kullanım noktası olmayan bir yeteneğin kullanılabildiği kısa bir pencereye sahip olması düzeltildi.",
      "[*] Beastmaster'ın Drums of Slom yeteneğinin, Beastmaster'ın illüzyonları varken düzgün çalışmaması düzeltildi.",
      "[*] Bloodseeker'ın Bloodrush yükselticisinin Bloodseeker'a hatalı asistler yazması düzeltildi. ",
      "[*] Bristleback'in Seeing Red yükselticisinin, görsel efektin süresiz olarak istiflenmesine neden olması düzeltildi.",
      "[*] Clockwerk'ün Power Cogs yeteneğinin hatalı olan bağlama açıklaması düzeltildi.",
      "[*] Death Prophet'ın Exorcism yeteneğinin ileri karakolları hedef alabilmesi düzeltildi.",
      "[*] Drow Ranger'ın Glacier kullanmasının Sidestep yükselticisine sahip Multishot'ı kesintiye uğratması düzeltildi.",
      "[*] Elder Titan'ın Tip the Scales yeteneğinin, bir önceki seviye kulenin hâlâ yıkılmamış olması nedeniyle hasar verilemeyen kulelerde etkili olmaması düzeltildi.",
      "[*] Elder Titan ölüyken Tip the Scales yeteneğinin etki göstermemesi düzeltildi.",
      "[*] Ember Spirit'in tüm yeteneklerinin seviyesini yükseltememesi düzeltildi.",
      "[*] Hoodwink'in Acorn Shot yeteneğinin atış yapmayan kahramanlardan yansıtılamaması düzeltildi.",
      "[*] Jakiro'nun Liquid Frost yeteneğinin bazen fazladan zamanla Blood Grenade hasarı vermesi düzeltildi.",
      "[*] Kunkka'nın Ghostship yeteneğinin, Kunkka Aghanim's Scepter'a sahipken \"Prize of the Saltworn Mariner\" ölümsüz etkisini kullanmaması düzeltildi.",
      "[*] Lifestealer'ın Ghoul Frenzy yeteneğinin tamamen kırılabilir olmaması düzeltildi.",
      "[*] Lina'nın tüm yeteneklerinin seviyesini yükseltememesi düzeltildi.",
      "[*] Leshrac'ın Diabolic Edict yeteneğinin bazen beklenenden daha az hasar vermesi düzeltildi.",
      "[*] Lone Druid'in Philosopher's Stone ile yıkımlardan daha fazla altın alabilmesi düzeltildi.",
      "[*] Lone Druid'in Spirit Bear değerlerinin açıklamadaki değerlerle uyuşmaması düzeltildi.",
      "[*] Lone Druid'in Demolish ve Entangling Claws yeteneklerinin seviyelerinin doğru görüntülenmemesi düzeltildi.",
      "[*] Luna'nın Lunar Blessing araç ipucunun bazen istemci çökmesine neden olması düzeltildi.",
      "[*] Mars'ın Dauntless yeteneğinin illüzyonlarla veya illüzyonlara karşı etki göstermesi düzeltildi.",
      "[*] Nature's Prophet'ın zamanla verilen Curse of the Oldgrowth hasarının Ironwood Treant yükselticisiyle uyuşmaması düzeltildi.",
      "[*] Nature Prophet'ın Spirit of the Forest yeteneğinin açıklamasının 5. seviyeyi göstermemesi düzeltildi.",
      "[*] Ogre Magi'nin Multicast yeteneğinin ikinci ve üçüncü seviyeye ulaşmadan 3x ve 4x şeklinde uygulanması düzeltildi.",
      "[*] Omniknight'ın Repel yeteneğinin eksik replikleri eklendi.",
      "[*] Phantom Lancer'ın Illusory Armaments doğal yeteneğinin sonsuz hasar vermesi düzeltildi.",
      "[*] Phantom Lancer'ın Illusory Armaments doğal yeteneğinin sıfır hasar vermesi düzeltildi.",
      "[*] Razor'ın Dynamo yeteneğinin bazen yanlış miktarda büyü artırımı sağlaması düzeltildi.",
      "[*] Rubick'in, Ancient Apparition'ın büyülerini çaldığında Death Rime hasarı uygulamaması düzeltildi.",
      "[*] Çalınan bir Ghostship büyüsü hedefine ulaşmadan hemen önce sona erdiğinde oluşan Rubick çökmesi düzeltildi.",
      "[*] Sand King'in Stinger yeteneğinin çalınabilir olmaması düzeltildi. ",
      "[*] Skywrath Mage'in seviye 15 hünerinin Concussive Shot yavaşlatması olarak güncellenmemesi düzeltildi.",
      "[*] Snapfire'ın Lil' Shredder yeteneğinin kritik vuruşlarda amaçlanandan daha az hasar vermesi düzeltildi.",
      "[*] Sniper'ın Headshot yeteneğinin dost yaratıklar üzerinde etki gösterdiğini belirten hatalı açıklama düzeltildi.",
      "[*] Spectre'nin Reality yeteneği sesinin, Spectre savaş sisinde gizli bir yere ışınlandığında düşman tarafından duyulamaması düzeltildi.",
      "[*] Spirit Breaker'ın Planar Pocket büyü yönlendirmesi, yönlendirme sırasında yeni hedefler arayarak tüm alanda istenmeyen ekstra hasara neden olan yetenekler için düzeltildi.",
      "[*] Techies'in Blast Off yeteneği kendine hasar açıklamasının doğru hasar türünü göstermemesi düzeltildi.",
      "[*] Tiny'nin Toss yeteneğinin hedefi birincil hedefle aynı olduğunda Phylactery'nin tetiklememesi düzeltildi.",
      "[*] Troll Warlord'un Berserker's Rage yeteneğinin kendisine hasar vermesi düzeltildi.",
      "[*] Venomancer'ın Plague Carrier yükselticisinin \"Yardımı Kapat\" ayarına uymaması düzeltildi.",
      "[*] Visage'in Lurker yeteneği açıklamasının \"Dolum Süresi Hızlandırma\" yerine \"Dolum Süresi Azaltma\" terimini kullanması düzeltildi.",
      "[/list]"
    ],
    "commentcount": 201,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "ModAct_487176015_1723138016_4",
      "ModAct_1426387032_1723159076_4",
      "ModAct_1278681683_1724689360_4"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 6751,
    "votedowncount": 744,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1730847165,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724689361,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 6751,
  "votes_down": 744,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}