{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2 frissítés – 2024. augusztus 2.",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1722878356
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2 frissítés – 2024. augusztus 2.",
    "posttime": 1722648012,
    "updatetime": 1722878356,
    "body": [
      "Az elmúlt néhány napban orvosoltuk a következő problémákat:",
      "[list]",
      "[*] Javítottunk egy hibát, ami bemeneti késést okozott több másodpercig.",
      "[*] Javítottuk, hogy az aurák nem alkalmazódtak megfelelően, ha a meccsidőtartam túl sokáig tartott (több sebzéspéldányt alkalmazott a Doomból stb.).",
      "[*] Javítottuk, hogy az újratöltődés-csökkentés néha nem működött megfelelően, amikor nagyon kicsi értékekkel csökkentett (Staff of the Scion stb.).",
      "[*] Javítottuk, hogy a közelharci sebzéskivédés néha nem védett ki semekkora sebzést.",
      "[*] Javítottuk, hogy a Bloodstone elemleírása nem az adott manatöltődést mutatta.",
      "[*] Javítottuk, hogy az Ironwood Tree nem volt megvásárolható demó módban.",
      "[*] Javítottuk, hogy a Mirror Shield blokkolta a varázslatokat, miközben újratöltődésen volt, amikor a Lotus Orb aktív volt.",
      "[*] Javítottuk, hogy az Unwavering Condition összeomlást okozott.",
      "[*] Javítottuk, hogy Alchemist Unstable Concoctionje nem volt használható a Spirit Bearen.",
      "[*] Javítottuk, hogy Bane Nightmare és Fiend's Grip képességeinek átfedésében volt egy rövidke időablak, amikor varázsolhatók voltak varázsláspont nélküli képességek.",
      "[*] Javítottuk, hogy a Beastmaster Drums of Slomja nem működött megfelelően Beastmaster illúzióinak jelenlétében.",
      "[*] Javítottuk, hogy Bloodseeker Bloodrush vetülete hibásan segítést adott Bloodseekernek. ",
      "[*] Javítottuk, hogy Bristleback Seeing Red vetületének hatására a látványeffekt végtelenszer összeadódott.",
      "[*] Javítottuk, hogy Clockwerk Power Cogs képességének hibás kipányvázási elemleírása volt.",
      "[*] Javítottuk, hogy Death Prophet Exorcism képessége célba vette a helyőrségeket.",
      "[*] Javítottuk, hogy a Sidestep vetülettel Drow Ranger Glacier varázslása megszakította a Multishotot.",
      "[*] Javítottuk, hogy Elder Titan „Tip the Scales” hatása nem működött olyan tornyokon, amik sebezhetetlenek voltak a kapcsolódó előző szintű torony le nem dőlése miatt.",
      "[*] Javítottuk, hogy Elder Titan „Tip the Scales” hatása nem működött, miközben Elder Titan halott volt.",
      "[*] Javítottuk, hogy Ember Spirit nem tudta az összes Adottságát fejleszteni.",
      "[*] Javítottuk, hogy Hoodwink Acorn Shotja a lövedékkel nem rendelkező hősökről nem pattant vissza.",
      "[*] Javítottuk, hogy Jakiro Liquid Frost képessége időnként plusz sebzést okozott a Blood Grenade időarányos sebzésével.",
      "[*] Javítottuk, hogy Kunkka Ghostshipje nem használta a „Sószítta Tengerész Zsákmánya” Halhatatlan effektet, amikor Kunkkának Aghanim's Sceptere volt.",
      "[*] Javítottuk, hogy Lifestealer Ghoul Frenzyje nem volt teljesen megszakítható.",
      "[*] Javítottuk, hogy Lina nem tudta az összes Adottságát fejleszteni.",
      "[*] Javítottuk, hogy Leshrac Diabolic Edictje néha a vártnál kevesebb sebzést okozott.",
      "[*] Javítottuk, hogy Lone Druid több elpusztítási aranyat tudott kapni a Philosopher's Stone-tól.",
      "[*] Javítottuk, hogy Lone Druid Spirit Bearjének értékei nem egyeztek az elemleírási értékekkel.",
      "[*] Javítottuk, hogy Lone Druid Demolish és Entangling Claws képességei nem pontosan jelenítették meg a szintjüket.",
      "[*] Javítottuk, hogy Luna Lunar Blessing képességének elemleírása néha kliensösszeomlást okozott.",
      "[*] Javítottuk, hogy Mars Dauntless képessége működött illúziókkal, vagy azok ellen.",
      "[*] Javítottuk, hogy Nature's Prophet „Curse of the Oldgrowth” időarányos sebzése nem volt következetes az Ironwood Treant vetülettel.",
      "[*] Javítottuk, hogy Nature Prophet „Spirit of the Forest” elemleírása nem jelenítette meg az 5. szintet.",
      "[*] Javítottuk, hogy Ogre Magi Multicastja 3x-os és 4x-es szorzóval is működött a képesség 2. és 3. szintjének megszerzése előtt.",
      "[*] Javítottuk, hogy Omniknight Repeljének hiányoztak a hangválaszai.",
      "[*] Javítottuk, hogy Phantom Lancer „Illusory Armaments” ösztönös képessége végtelen sebzést biztosított.",
      "[*] Javítottuk, hogy Phantom Lancer „Illusory Armaments” ösztönös képessége nulla sebzést biztosított.",
      "[*] Javítottuk, hogy Razor Dynamója néha rossz varázslaterősítési értéket adott.",
      "[*] Javítottuk, hogy Rubick nem alkalmazta a Death Rime sebzését, amikor ellopta Ancient Apparition varázslatait.",
      "[*] Javítottunk egy Rubick okozta összeomlást, ami akkor történt, amikor egy ellopott Ghostship varázslat pont azelőtt járt le, hogy elérte volna a célját.",
      "[*] Javítottuk, hogy Sand King Stingerje nem volt ellopható. ",
      "[*] Javítottuk, hogy Skywrath Mage 15. szintű Adottsága nem lett frissítve a Concussive Shot lassításra.",
      "[*] Javítottuk, hogy Snapfire Lil' Shredderje a szándékosnál kevesebb sebzést okozott a kritikus találatokkal.",
      "[*] Javítottuk, hogy Sniper Headshot elemleírása helytelenül azt jelezte, hogy működik szövetséges creepeken.",
      "[*] Javítottuk, hogy Spectre Reality hangja nem volt hallható az ellenségnek, ha a háború köde által takart helyre teleportált.",
      "[*] Javítottuk Spirit Breaker Planar Pocketjének varázslat-átirányítását olyan képességeknél, amelyek új célpontokat kerestek átirányítás közben, és így nem szándékos többletsebzést okoztak az egész területen.",
      "[*] Javítottuk, hogy a Techies „Blast Off!” képességének önsebzési elemleírása nem a helyes sebzéstípust jelenítette meg.",
      "[*] Javítottuk, hogy Tiny Toss képessége nem aktiválta a Phylacteryt, amikor az eldobott célpont megegyezett az elsődleges célponttal.",
      "[*] Javítottuk, hogy Troll Warlord saját magát is sebezte Berserker's Rage képességével.",
      "[*] Javítottuk, hogy Venomancer Plague Carrierje nem vette figyelembe a „Segítség tiltása” beállítást.",
      "[*] Javítottuk, hogy Visage Lurkerjének elemleírása „újratöltődés-csökkentés” kifejezést használt „újratöltődés-gyorsítás” helyett.",
      "[/list]"
    ],
    "commentcount": 88,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "mod_require_rereview"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 1394,
    "votedowncount": 141,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1722878357,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1722711305,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 15246903,
  "build_branch": "",
  "votes_up": 1393,
  "votes_down": 141,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}