{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Обновление Dota 2 — 2 августа 2024 года",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1723158392
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1724688606
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false,
    "rt_migrated_time": 1723158346.729
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Обновление Dota 2 — 2 августа 2024 года",
    "posttime": 1722648012,
    "updatetime": 1724688606,
    "body": [
      "За недавнее время мы исправили следующие ошибки:",
      "[list]",
      "[*] Исправлена ошибка, из-за которой ввод иногда происходил с задержкой в несколько секунд.",
      "[*] Исправлена ошибка, из-за которой ауры (например, несколько аур получения урона от Doom) не накладывались корректно, если игра была слишком долгой.",
      "[*] Исправлена ошибка, из-за которой очень маленькие значения уменьшения перезарядок (например, от аспекта Staff of the Scion) иногда работали неверно.",
      "[*] Исправлена ошибка, из-за которой блок урона героем ближнего боя иногда не срабатывал.",
      "[*] Исправлена ошибка, из-за которой в описании предмета Bloodstone не отображался бонус к восстановлению маны.",
      "[*] Исправлена ошибка, из-за которой предмет Ironwood Tree нельзя было приобрести при опробовании героя.",
      "[*] Исправлена ошибка, из-за которой перезаряжающийся предмет Mirror Shield блокировал заклинания, когда действовал эффект Lotus Orb.",
      "[*] Исправлена ошибка, из-за которой предмет Unwavering Condition приводил к сбою.",
      "[*] Исправлена ошибка, из-за которой способность Unstable Concoction у Alchemist нельзя было применить на духа-медведя от Spirit Bear.",
      "[*] Исправлена ошибка, из-за которой можно было применять заклинания без анимации между эффектами способностей Nightmare и Fiend's Grip у Bane.",
      "[*] Исправлена ошибка, из-за которой способность Drums of Slom у Beastmaster работала неверно в присутствии его иллюзий.",
      "[*] Исправлена ошибка, из-за которой аспект Bloodrush у Bloodseeker по ошибке засчитывал ему помощь в убийствах. ",
      "[*] Исправлена ошибка, из-за которой не исчезал визуальный эффект аспекта Seeing Red у Bristleback.",
      "[*] Исправлена ошибка, из-за которой у шестерней от способности Power Cogs у Clockwerk по ошибке отображался текст о привязке.",
      "[*] Исправлена ошибка, из-за которой духи от способности Exorcism у Death Prophet выбирали целью аванпосты.",
      "[*] Исправлена ошибка, из-за которой применение способности Glacier у Drow Ranger с аспектом Sidestep прерывало действие Multishot.",
      "[*] Исправлена ошибка, из-за которой эффект аспекта Tip the Scales у Elder Titan не действовал на башни, неуязвимые из-за того, что предыдущая башня не разрушена.",
      "[*] Исправлена ошибка, из-за которой эффект аспекта Tip the Scales у Elder Titan не работал, когда он был мёртв.",
      "[*] Исправлена ошибка, из-за которой Ember Spirit не мог изучить все свои таланты.",
      "[*] Исправлена ошибка, из-за которой герои без снарядов не могли отразить способность Acorn Shot у Hoodwink.",
      "[*] Исправлена ошибка, из-за которой способность Liquid Frost у Jakiro иногда наносила дополнительный урон, когда наносился периодический урон от предмета Blood Grenade.",
      "[*] Исправлена ошибка, из-за которой способность Ghostship у Kunkka с Aghanim's Scepter не использовала эффект Immortal-предмета Prize of the Saltworn Mariner.",
      "[*] Исправлена ошибка, из-за которой способность Ghoul Frenzy у Lifestealer отключалась истощением лишь частично.",
      "[*] Исправлена ошибка, из-за которой Lina не могла изучить все свои таланты.",
      "[*] Исправлена ошибка, из-за которой способность Diabolic Edict у Leshrac иногда наносила меньше урона, чем нужно.",
      "[*] Исправлена ошибка, из-за которой Lone Druid мог получить больше золота при исчезновении предмета Philosopher's Stone.",
      "[*] Исправлена ошибка, из-за которой характеристики духа-медведя от способности Spirit Bear у Lone Druid не совпадали с указанными в описании.",
      "[*] Исправлена ошибка, из-за которой неверно отображались уровни способностей Demolish и Entangling Claws у Lone Druid.",
      "[*] Исправлена ошибка, из-за которой описание способности Lunar Blessing у Luna иногда приводило к сбою клиента.",
      "[*] Исправлена ошибка, из-за которой способность Dauntless у Mars учитывала иллюзии героев.",
      "[*] Исправлена ошибка, из-за которой периодический урон способности Curse of the Oldgrowth у Nature's Prophet не учитывал множитель от энтов у аспекта Ironwood Treant.",
      "[*] Исправлена ошибка, из-за которой в описании способности Spirit of the Forest у Nature Prophet не отображался её пятый уровень.",
      "[*] Исправлена ошибка, из-за которой способности Ogre Magi срабатывали 3 или 4 раза до изучения соответствующих уровней Multicast.",
      "[*] Исправлена ошибка, из-за которой отсутствовали фразы-реакции для способности Repel у Omniknight.",
      "[*] Исправлена ошибка, из-за которой способность Illusory Armaments у Phantom Lancer давала бесконечный урон.",
      "[*] Исправлена ошибка, из-за которой способность Illusory Armaments у Phantom Lancer не давала урона.",
      "[*] Исправлена ошибка, из-за которой аспект Dynamo у Razor давал неверный бонус к урону способностями.",
      "[*] Исправлена ошибка, из-за которой Rubick не накладывал эффекты мороза способностями, украденными у Ancient Apparition.",
      "[*] Исправлена ошибка, из-за которой происходил сбой, когда Rubick применял украденную способность Ghostship прямо перед тем, как потерять её.",
      "[*] Исправлена ошибка, из-за которой нельзя было украсть способность Stinger у Sand King. ",
      "[*] Решена проблема, из-за которой талант 15-го уровня у Skywrath Mage не поменялся на бонус к замедлению от Concussive Shot.",
      "[*] Исправлена ошибка, из-за которой атаки от способности Lil' Shredder у Snapfire наносили меньше критического урона, чем нужно.",
      "[*] Исправлена ошибка, из-за которой в описании способности Headshot у Sniper было указано, что она действует на союзных крипов.",
      "[*] Исправлена ошибка, из-за которой противники не слышали звук способности Reality у Spectre, если она телепортировалась в туман войны.",
      "[*] Исправлена ошибка, из-за которой некоторые способности по ошибке искали новые цели при перенаправлении от Planar Pocket у Spirit Breaker и в итоге наносили больше урона.",
      "[*] Исправлена ошибка, из-за которой в описании урона по себе у способности Blast Off! у Techies указывался неверный тип урона.  ",
      "[*] Исправлена ошибка, из-за которой способность Toss у Tiny не активировала предмет Phylactery, если существо подбросили на месте.",
      "[*] Исправлена ошибка, из-за которой способность Berserker's Rage у Troll Warlord наносила урон ему самому.",
      "[*] Исправлена ошибка, из-за которой на способность Plague Carrier у Venomancer не действовало отключение помощи.",
      "[*] Исправлена ошибка, из-за которой в английском описании способности Lurker у Visage использовался неверный термин.",
      "[/list]"
    ],
    "commentcount": 200,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "ModAct_487176015_1723138016_4",
      "ModAct_1426387032_1723159076_4",
      "ModAct_1278681683_1724689360_4"
    ],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 6647,
    "votedowncount": 731,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1728403261,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724689361,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "votes_up": 6647,
  "votes_down": 731,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}