{
  "gid": "4335362463041041498",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota-2-Update – 2. August 2024",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1722648000,
  "rtime32_end_time": 1722652201,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1722555283
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1722653396
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1722628430
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1723158392
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723136791
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1724688606
      }
    ],
    "clone_from_event_gid": "4335361829072642530",
    "clone_from_sale_enabled": false,
    "rt_migrated_time": 1723158346.729
  },
  "announcement_body": {
    "gid": "4335362463041041499",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota-2-Update – 2. August 2024",
    "posttime": 1722648012,
    "updatetime": 1724688606,
    "body": [
      "In den vergangenen Tagen haben wir die folgenden Probleme behoben:",
      "[list]",
      "[*] Fehler behoben, durch den gelegentlich die Eingabe für einige Sekunden verzögert wurde.",
      "[*] Fehler behoben, durch den Auren nicht ordnungsgemäß angewendet wurden, wenn Partien zu lange dauerten (z. B. bei mehreren Schadensinstanzen von Doom usw.).",
      "[*] Fehler behoben, durch den die Abklingzeitreduzierung gelegentlich nicht ordnungsgemäß funktionierte, wenn die Abklingzeit nur um sehr kleine Werte reduziert wurde (z. B. bei Skywrath Mages Facette „Stab des Sprösslings“ usw.).",
      "[*] Fehler behoben, durch den der Schadensblock von Nahkampfhelden gelegentlich gar keinen Schaden blockte.",
      "[*] Fehler behoben, durch den die Kurzinfo von Bloodstone die gewährte Manaregeneration nicht anzeigte.",
      "[*] Fehler behoben, durch den der neutrale Gegenstand „Ironwood Tree“ im Demo-Modus nicht gekauft werden konnte.",
      "[*] Fehler behoben, durch den der passive Effekt des neutralen Gegenstands „Mirror Shield“ trotz Abklingzeit Zauber blocken konnte, wenn der Effekt des Gegenstands „Lotus Orb“ aktiv war.",
      "[*] Fehler behoben, durch den der neutrale Gegenstand „Unwavering Condition“ einen Absturz auslösen konnte.",
      "[*] Fehler behoben, durch den Alchemists Fähigkeit „Unstable Concoction“ nicht auf Lone Druids Geisterbären gewirkt werden konnte.",
      "[*] Fehler behoben, durch den sich Banes Fähigkeiten „Nightmare“ und „Fiend’s Grip“ überlappen konnten, sodass ein kurzes Zeitfenster entstand, indem Fähigkeiten ohne Zauberverzögerung gewirkt werden konnten.",
      "[*] Fehler behoben, durch den Beastmasters Fähigkeit „Drums of Slom“ nicht ordnungsgemäß funktionierten, wenn Illusionen von Beastmaster zugegen waren.",
      "[*] Fehler behoben, durch den Bloodseekers Facette „Blutrausch“ Boni durch fälschlicherweise zugeschriebene Assists gewährte. ",
      "[*] Fehler behoben, durch den sich der visuelle Effekt von Bristlebacks Facette „Rotes Tuch“ mehrfach überlagerte.",
      "[*] Fehler behoben, durch den Clockwerks Fähigkeit „Power Cogs“ in der Kurzinfo fälschlicherweise angab, dass die Fähigkeit den Statuseffekt „Gebunden“ auslöst.",
      "[*] Fehler behoben, durch den die Geister von Death Prophets Fähigkeit „Exorcism“ Außenposten angriffen.",
      "[*] Fehler behoben, durch den die Fähigkeit „Multishot“ abgebrochen wurde, wenn Drow Ranger die Fähigkeit „Glacier“ wirkte und vor der Partie die Facette „Ausweichmanöver“ ausgewählt wurde.",
      "[*] Fehler behoben, durch den der Effekt von Elder Titans Begabung „Zünglein an der Waage“ nicht bei unverwundbaren Türmen funktionierte, wenn noch ein Turm einer niedrigeren Stufe den Pfad bewachte.",
      "[*] Fehler behoben, durch den der Effekt von Elder Titans Begabung „Zünglein an der Waage“ nicht funktionierte, während Elder Titan tot war.",
      "[*] Fehler behoben, durch den Ember Spirit nicht alle Talente erhalten konnte.",
      "[*] Fehler behoben, durch den Hoodwinks Fähigkeit „Acorn Shot“ nicht von bestimmten Helden reflektiert wurde.",
      "[*] Fehler behoben, durch den Jakiros Fähigkeit „Liquid Frost“ gelegentlich zusätzlich den kontinuierlichen Schaden des Verbrauchsgegenstands „Blood Grenade“ zufügte.",
      "[*] Fehler behoben, durch den Kunkkas Fähigkeit „Ghostship“ nicht den Immortal-Effekt „Beute des alten Seebärs“ verwendete, wenn Kunkka Aghanims Zepter besaß.",
      "[*] Fehler behoben, durch den Lifestealers Fähigkeit „Ghoul Frenzy“ nicht vollständig unterbrochen werden konnte.",
      "[*] Fehler behoben, durch den Lina nicht alle Talente erhalten konnte.",
      "[*] Fehler behoben, durch den Leshracs Fähigkeit „Diabolic Edict“ gelegentlich weniger Schaden zufügte als vorgesehen.",
      "[*] Fehler behoben, durch den Lone Druid mehr Gold als vorgesehen nach der Zerstörung des neutralen Gegenstands „Philosopher’s Stone“ erhalten konnte.",
      "[*] Fehler behoben, durch den die Werte von Lone Druids Geisterbär nicht mit den Werten der Kurzinfo übereinstimmten.",
      "[*] Fehler behoben, durch den die Level der Fähigkeiten „Demolish“ und „Entangling Claws“ von Lone Druids Geisterbär nicht korrekt angezeigt wurden.",
      "[*] Fehler behoben, durch den die Kurzinfo von Lunas Fähigkeit „Lunar Blessing“ gelegentlich einen Client-Absturz auslösen konnte.",
      "[*] Fehler behoben, durch den Mars’ Begabung „Unbeugsam“ gegen (oder mit) Illusionen funktionierte.",
      "[*] Fehler behoben, durch den der kontinuierliche Schaden von Nature’s Prophets Fähigkeit „Curse of the Oldgrowth“ Inkonsistenzen mit der Facette „Eisenholz-Treant“ aufwies.",
      "[*] Fehler behoben, durch den die Kurzinfo von Nature’s Prophets Begabung „Geist des Waldes“ das fünfte Level nicht anzeigte.",
      "[*] Fehler behoben, durch den Ogre Magis Fähigkeit „Multicast“ eine 3-fache bzw. 4-fache Zauberchance erhielt, ohne dass die Fähigkeit auf das zweite bzw. dritte Level aufgewertet wurde.",
      "[*] Fehler behoben, durch den beim Wirken von Omniknights Fähigkeit „Repel“ keine Heldensprüche abgespielt wurden.",
      "[*] Fehler behoben, durch den Phantom Lancers Begabung „Illusorische Bewaffnung“ unbegrenzten Schaden gewährte.",
      "[*] Fehler behoben, durch den Phantom Lancers Begabung „Illusorische Bewaffnung“ keinen Schaden gewährte.",
      "[*] Fehler behoben, durch den Razors Begabung „Dynamo“ gelegentlich die falsche Menge an Zauberverstärkung gewährte.",
      "[*] Fehler behoben, durch den Rubick keinen Todesreim-Schaden zufügte, wenn er eine von Ancient Apparitions Fähigkeiten stahl.",
      "[*] Absturz behoben, der auftrat, wenn Rubick die von Kunkka gestohlene Fähigkeit „Ghostship“ wieder verlor, nachdem diese gewirkt wurde, aber das Geisterschiff seinen Zielpunkt noch nicht erreicht hatte.",
      "[*] Fehler behoben, durch den Sand Kings Fähigkeit „Stinger“ nicht gestohlen werden konnte. ",
      "[*] Fehler behoben, durch den das Level-15-Talent von Skywrath Mage nicht auf den neuen Effekt „+15 % Verlangsamung durch Concussive Shot“ aktualisiert wurde.",
      "[*] Fehler behoben, durch den Snapfires Fähigkeit „Lil’ Shredder“ bei kritischen Treffern weniger Schaden als vorgesehen zufügte.",
      "[*] Fehler behoben, durch den die Kurzinfo von Snipers Fähigkeit „Headshot“ fälschlicherweise angab, dass auch verbündete Einheiten von dem Effekt betroffen werden konnten.",
      "[*] Fehler behoben, durch den der Sound von Spectres Fähigkeit „Reality“ für Gegner nicht abgespielt wurde, falls sie sich zu einem Ort im Nebel des Krieges teleportierte.",
      "[*] Fehler behoben, durch den die Umlenkung von Zaubern durch Spirit Breakers Fähigkeit „Planar Pocket“ dazu führte, dass diese bei der Suche nach neuen Zielen unbeabsichtigt zusätzlichen Schaden in der näheren Umgebung zufügten.",
      "[*] Fehler behoben, durch den in der Kurzinfo der Fähigkeit „Blast Off!“ der Techies der falsche Schadenstyp für den Eigenschaden angezeigt wurde.",
      "[*] Fehler behoben, durch den Tinys Fähigkeit „Toss“ nicht den passiven Effekt des Gegenstands „Phylactery“ auslöste, wenn eine Einheit nur hochgeworfen statt auf eine andere Einheit geschleudert wurde.",
      "[*] Fehler behoben, durch den Troll Warlords Fähigkeit „Berserker’s Rage“ Eigenschaden zufügte.",
      "[*] Fehler behoben, durch den Venomancers Facette „Pestträger“ die Einstellung „Hilfe deaktivieren“ ignorierte.",
      "[*] Beschreibungstext der Kurzinfo von Visages Begabung „Schattenwandler“ korrigiert, in dem fälschlicherweise der Begriff „Abklingzeitreduzierung“ statt „Abklingzeitbeschleunigung“ verwendet wurde.",
      "[/list]"
    ],
    "commentcount": 201,
    "tags": [
      "hide_library_overview",
      "hide_store",
      "mod_reviewed",
      "ModAct_1434573178_1722650485_0",
      "patchnotes",
      "ModAct_1434573178_1722654853_4",
      "ModAct_487997664_1722711305_4",
      "ModAct_1294976491_1722886745_4",
      "ModAct_487176015_1723138016_4",
      "ModAct_1426387032_1723159076_4",
      "ModAct_1278681683_1724689360_4"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4520010286981957567",
    "event_gid": "4335362463041041498",
    "voteupcount": 6751,
    "votedowncount": 744,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4520010286981957567",
  "rtime32_last_modified": 1730847165,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724689361,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 6751,
  "votes_down": 744,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4520010286981957567",
  "clan_steamid_original": "103582791433224455"
}