{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2-update van 21 februari 2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2-update van 21 februari 2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "De afgelopen dagen hebben we de volgende problemen opgelost:",
      "[list]",
      "[*] Probleem opgelost waarbij de helden in de Vaardigheidstrekking geen gaven hadden.",
      "[*] Probleem opgelost waarbij de timers bij de Lotus Pool in Turbo de standaardtijden weergaven van een gewoon Dota-spel.",
      "[*] Probleem opgelost waarbij de pictogrammen op de minimap niet werden weergegeven voor live toeschouwers in de spelersweergave.",
      "[*] Probleem opgelost waarbij de spawnvakken voor sommige kampen hoger waren dan de Torrent van Kunkka.",
      "[*] Probleem opgelost waarbij Tormentor in de demomodus op ongewenste locaties spawnde.",
      "[*] Neutrale tooltips geven nu een nauwkeurigere schatting van het niveau van betovering.",
      "[*] Bomen die met Iron Branch worden geplant zorgen nu weer voor een langere genezingsduur als ze met Tango worden verbruikt.",
      "[*] Probleem opgelost waarbij je Smoke of Deceit opnieuw op je bondgenoten kon toepassen als je Ninja Gear gebruikte terwijl je onder de invloed was van Smoke.",
      "[*] Probleem opgelost waarbij Phylactery vijanden niet vertraagde bij activatie.",
      "[*] Probleem opgelost waarbij Pirate Hat ervoor kon zorgen dat de kosten voor doodgaan in de tooltip enigszins afweken van de daadwerkelijke kosten.",
      "[*] Probleem opgelost waarbij Pyrrhic Cloak teruggekaatste schade terugkaatste.",
      "[*] Probleem opgelost waarbij Revenant's Brooch meer schade veroorzaakte voor illusies dan bedoeld.",
      "[*] Probleem opgelost waarbij Scurry en Death Pact meer dan het maximale aantal ladingen hadden als het corresponderende talent werd afgenomen nadat de vaardigheid volledig was behaald.",
      "[*] Meerdere problemen opgelost met Morph van Morphling.",
      "[*] Meerdere problemen opgelost met Winter's Curse van Winter Wyvern.",
      "[*] Probleem opgelost waarbij Magebane's Mirror van Anti-Mage geen mana verbruikt als de gebruiker niet genoeg mana te besteden heeft.",
      "[*] Probleem opgelost waarbij Flux van Arc Warden met Aghanim's Scepter soms toch het zwijgen kon opleggen, zelfs als Flux werd verdreven.",
      "[*] Probleem opgelost waarbij Blueheart Floe van Crystal Maiden geen hoger niveau kreeg met Freezing Field.",
      "[*] Probleem opgelost waarbij Dazzle geen ladingen voor Desolator kreeg als helden werden gedood als Nothl Voyager.",
      "[*] Probleem opgelost waarbij Dazzle geen ladingen voor Urn of Shadows kreeg als helden werden gedood als Nothl Voyager.",
      "[*] Probleem opgelost waarbij Aghanim's Shard met Dazzle niet voor genezingsversterking zorgde in het Nothl-rijk.",
      "[*] Probleem opgelost waarbij Nothl Projection van Dazzle in sommige situaties geen voordeel had van talentupgrades voor Poison Touch.",
      "[*] Probleem opgelost waarbij Nothl Projection van Dazzle in sommige situaties meer Town Portal Scrolls toekende dan gewenst.",
      "[*] Probleem opgelost waarbij Nothl Projection van Dazzle ervoor zorgde dat er een afkoeltijd werd gestart voor Aeon Disk.",
      "[*] Probleem opgelost waarbij Nothl Projection van Dazzle ervoor zorgde dat er een afkoeltijd werd gestart voor Refresher Orb.",
      "[*] Probleem opgelost waarbij de debuffduur van Poison Touch van Dazzle niet werd verlengd als deze vaardigheid werd gebruikt voordat de ultimate werd toegepast (en omgekeerd).",
      "[*] Probleem opgelost waarbij de ziel van Dazzle gebruik kon maken van Hand of Midas.",
      "[*] Probleem opgelost waarbij de Corrosive Dragon-spreuken van Dragon Knight en de effecten van Damage over Time, ook van Dragon Knight, geblokkeerd werden door fysieke afweer.",
      "[*] Probleem opgelost waarbij Wyrm's Wrath van Dragon Knight bij het afwijzen debuff toepaste op teamgenoten.",
      "[*] Probleem opgelost waarbij Wyrm's Wrath van Dragon Knight met het facet Fire Dragon ongewild schade toebracht aan torens.",
      "[*] Probleem opgelost waarbij Wyrm's Wrath van Dragon Knight met het facet Fire Dragon twee keer per treffer werd toegepast wanneer hij in Elder Dragon Form was.",
      "[*] Probleem opgelost waarbij de effectgebiedsbonus van Wyrm's Wrath van Dragon Knight met het facet Fire Dragon niet werd gestapeld met andere bronnen van effectgebiedstoename.",
      "[*] Probleem opgelost waarbij er blinde vlekken optraden in de gezichtslijn van het level 20-talent Sharpshooter van Hoodwink.",
      "[*] Probleem opgelost waarbij Invoker met Aghanim's Scepter meer levels behaalde voor Quas, Wex en Exort dan bedoeld.",
      "[*] Probleem opgelost waarbij de schade die door Aghanim's Shard was veroorzaakt niet werd hersteld voor doelwitten die met Tether aan Io waren verbonden.",
      "[*] Probleem opgelost waarbij Impale van Lion geen voordeel kreeg van de effectgebiedsbonussen die waren verkregen bij het behalen van hogere levels voor Impale.",
      "[*] Probleem opgelost waarbij klonen van Monkey King goud stalen met Pirate Hat.",
      "[*] Probleem opgelost waarbij Adaptive Strike van Morphling met het facet Flow geen doelwitten verlamde als Morphling morfte terwijl er een projectiel onderweg was.",
      "[*] Probleem opgelost waarbij de Shield Crash-barrière van Pangolier een afkoeltijd startte voor Blink Dagger als de barrière de schade volledig blokkeerde.",
      "[*] Probleem opgelost waarbij de Ferocity-ladingen van Primal Beast in sommige situaties onbeperkt waren.",
      "[*] Probleem opgelost waarbij Rubick in staat was om ladingen van Arcane Accumulation te verzamelen door het gebruik van End Projection voor Nothl Projection.",
      "[*] Probleem opgelost waarbij Rubick met Aghanim's Scepter geen upgrade van Aghanim's Scepter kreeg bij het stelen van Shackles.",
      "[*] Probleem opgelost waarbij Phase Shift van Puck werd onderbroken door bepaalde opdrachten.",
      "[*] Probleem opgelost waarbij Tricks of the Trade van Riki werd onderbroken door bepaalde opdrachten.",
      "[*] Probleem opgelost waarbij Minefield Sign van Techies met Aghanim's Scepter al tijdens de gebruiksvertraging werd geactiveerd.",
      "[*] Probleem opgelost waarbij Meld van Templar Assassin met Hidden Reach meer tijd dan verwacht nodig had om het maximale aanvalsbereik te behalen.",
      "[*] Probleem opgelost waarbij Killshot van Windranger doelwitten kon executeren met iets hogere drempels dan aangegeven.",
      "[*] Probleem opgelost waarbij het level 25-talent van Windranger 'Doden met Focus Fire verkorten afkoeltijd met 18s' niet correct werkte.",
      "[/list]"
    ],
    "commentcount": 228,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 8651,
    "votedowncount": 969,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1746741908,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 8651,
  "votes_down": 969,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}