{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2 frissítés – 2025. február 21.",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2 frissítés – 2025. február 21.",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "Az elmúlt néhány napban orvosoltuk a következő problémákat:",
      "[list]",
      "[*] Javítottuk, hogy a hősöknek Ability Draftban nem voltak ösztönös képességeik.",
      "[*] Javítottuk, hogy a Lótuszmedence időmérők normál Dota játékbeli időket mutattak Turbóban.",
      "[*] Javítottuk, hogy a minitérkép ikonok nem jelentek meg az élőben nézőknek játékos nézetben.",
      "[*] Javítottuk, hogy néhány tábor születésnégyzetei magasabbak voltak Kunkka Torrentjének magasságánál.",
      "[*] Javítottuk, hogy a Gyötrők nem megfelelő helyeken jelentek meg demó módban.",
      "[*] A semleges tárgyak elemleírásai mostantól jobban megtippelik az igézések szintjét.",
      "[*] Javítottuk, hogy az Iron Branch fák nem adtak hosszabb gyógyítást Tangóval elfogyasztva.",
      "[*] Javítottuk a Ninja Gear használatát Smoke of Deceit hatása alatt, lehetővé téve, hogy újra alkalmazd azt szövetségeseidre.",
      "[*] Javítottuk, hogy a Phylactery nem lassította az ellenségeket aktiválódáskor.",
      "[*] Javítottuk, hogy a Pirate Hat hatására a halál árának elemleírása kissé helytelen mennyiséget jelenített meg.",
      "[*] Javítottuk, hogy a Pyrrhic Cloak visszaverte a visszavert sebzést.",
      "[*] Javítottuk, hogy a Revenant's Brooch illúziókon több sebzést okozott a szándékosnál.",
      "[*] Javítottunk egy problémát, aminél a Scurry és a Death Pact a maximálisnál több töltettel rendelkeztek, ha a kapcsolódó Adottság a képesség fejlesztése után volt választva.",
      "[*] Javítottuk Morphling Morphjának különféle problémáit.",
      "[*] Javítottuk Winter Wyvern Winter's Curse képességének különféle problémáit.",
      "[*] Javítottuk, hogy Anti-Mage Magebane's Mirrorja nem csökkentette a manát, amikor a varázslónak nem volt elegendő elhasználható manája.",
      "[*] Javítottuk, hogy Arc Warden Aghanim's Scepteres Flux képessége időnként még akkor is elhallgattatott, ha a Flux meg lett szüntetve.",
      "[*] Javítottuk, hogy Crystal Maiden Blueheart Floe-ja nem fejlődött a Freezing Fielddel.",
      "[*] Javítottuk, hogy Dazzle nem kapott Desolator tölteteket Nothli utazóként ölve hősöket.",
      "[*] Javítottuk, hogy Dazzle nem kapott Urn of Shadows tölteteket Nothli utazóként ölve hősöket.",
      "[*] Javítottuk, hogy Dazzle Aghanim's Shardja nem adott gyógyításerősítést a Nothl Birodalomban.",
      "[*] Javítottuk, hogy Dazzle Nothl Projection képessége bizonyos helyzetekben nem részesült a Poison Touch adottságfejlesztéséből.",
      "[*] Javítottuk, hogy Dazzle Nothl Projection képessége bizonyos helyzetekben a szándékosnál több Town Portal Scrollt adott.",
      "[*] Javítottuk, hogy Dazzle Nothl Projection képessége újratöltődésre tette az Aeon Disket.",
      "[*] Javítottuk, hogy Dazzle Nothl Projection képessége újratöltődésre tette a Refresher Orbot.",
      "[*] Javítottuk, hogy Dazzle Poison Touch gyengítésének időtartama nem nőtt, amikor az ultimate képességének varázslása előtt volt használva (és fordítva).",
      "[*] Javítottuk, hogy Dazzle lelke képes volt használni a Hand of Midast.",
      "[*] Javítottuk, hogy Dragon Knight Corrosive Dragonjának varázslatait és időarányos sebzéseit blokkolta a fizikai sebzéskivédés.",
      "[*] Javítottuk, hogy Dragon Knight Wyrm's Wrath képessége gyengítéseket alkalmazott a csapattársakra beáldozáskor.",
      "[*] Javítottuk, hogy Dragon Knight Wyrm's Wrath képessége a Fire Dragon vetülettel nem szándékoltan a tornyokat is sebezte.",
      "[*] Javítottuk, hogy Dragon Knight Wyrm's Wrath képessége a Fire Dragon vetülettel találatonként kétszer aktiválódott Elder Dragon Form közben.",
      "[*] Javítottuk, hogy a Fire Dragon vetülettel Dragon Knight Wyrm's Wrath képességének hatóterület bónusza nem adódott össze más hatóterület növelő forrásokkal.",
      "[*] Javítottuk, hogy Hoodwink 20. szintű Sharpshooter Adottságának holtterei voltak a látómezejében.",
      "[*] Javítottuk, hogy Invoker a szándékosnál több Quas, Wex vagy Exort szintet kapott Aghanim's Scepterrel.",
      "[*] Javítottuk, hogy Io Tetherje Aghanim's Sharddal nem gyógyította az összekötött célpontokat az okozott sebzésből.",
      "[*] Javítottuk, hogy Lion Earth Spike képessége nem részesült a hatóterületi bónuszokból, ha azokat az Earth Spike fejlesztése után szerezte.",
      "[*] Javítottuk, hogy Monkey King klónjai aranyat loptak a Pirate Hattel.",
      "[*] Javítottuk, hogy Morphling Adaptive Strike-ja a Flow vetülettel nem bénította a célpontokat, ha Morphling a lövedék repülése közben alakult át.",
      "[*] Javítottuk, hogy Pangolier Shield Crash védőpajzsa újratöltődésre tette a Blink Daggert, amikor a védőpajzs teljesen kivédte a sebzést.",
      "[*] Javítottuk, hogy Primal Beast Ferocity összeadódásai bizonyos helyzetekben nem voltak korlátozva.",
      "[*] Javítottuk, hogy Rubick képes volt Arcane Accumulation összeadódásokat gyűjteni a Nothl Projection End Projection alképességéből.",
      "[*] Javítottuk, hogy Rubick Aghanim's Scepterrel rendelkezve nem kapta meg az ellopott Shackles Aghanim's Scepteres fejlesztését.",
      "[*] Javítottuk, hogy Puck Phase Shiftjét megszakították bizonyos parancsok.",
      "[*] Javítottuk, hogy Riki Tricks of the Trade-jét megszakították bizonyos parancsok.",
      "[*] Javítottuk, hogy a Techies Aghanim's Scepteres Minefield Signja a varázsláspont közben aktiválódott.",
      "[*] Javítottuk, hogy Templar Assassin Meldje Hidden Reach vetülettel a vártnál lassabban érte el a maximális harctávot.",
      "[*] Javítottuk, hogy Windranger Killshotja kissé a jelzett küszöb fölött végezte ki a célpontokat.",
      "[*] Javítottuk, hogy Windranger 25. szintű „Focus Fire ölésenként 18 mp újratöltődés-gyorsítás” Adottsága nem működött megfelelően.",
      "[/list]"
    ],
    "commentcount": 136,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 2049,
    "votedowncount": 211,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1740400246,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2048,
  "votes_down": 211,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}