{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2-opdatering: 21. februar 2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2-opdatering: 21. februar 2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "I løbet af de sidste par dage har vi rettet følgende problemer:",
      "[list]",
      "[*] Rettede, at helte i Ability Draft ikke havde medfødte evner.",
      "[*] Rettede, at timerne for lotusdammene viste almindelige Dota-tider i Turbo-tilstand.",
      "[*] Rettede, at der ikke blev vist minikortikoner i spillervisning for tilskuere i direkte kampe.",
      "[*] Rettede, at visse lejres spawn-områder var højere end højden på Kunkkas Torrent.",
      "[*] Rettede, at plageånder dukkede op på uønskede steder i afprøvningstilstand.",
      "[*] Beskrivelser af neutrale genstande er bedre til at gætte fortryllelsesniveau.",
      "[*] Rettede, at Ironwood-træer ikke gav forlænget helingsvarighed, når de blev opbrugt med Tango.",
      "[*] Rettede, at brug af Ninja Gear, mens man var påvirket af Smoke of Deceit, gjorde, at man kunne påføre Smoke of Deceit på allierede igen.",
      "[*] Rettede, at Phylactery ikke hæmmede fjender ved aktivering.",
      "[*] Rettede, at Pirate Hat gjorde, at der blev vist et forkert beløb for dødsomkostning i beskrivelsen.",
      "[*] Rettede, at Pyrrhic Cloak reflekterede reflekteret skade.",
      "[*] Rettede, at Revenant's Brooch på illusioner gjorde mere skade, end det var meningen.",
      "[*] Rettede et problem, som gjorde, at Scurry og Death Pact fik mere end det maksimale antal ladninger, hvis det tilsvarende talent blev valgt, efter evnen var blevet opgraderet.",
      "[*] Rettede diverse problemer med Morphlings Morph.",
      "[*] Rettede diverse problemer med Winter Wyverns Winter's Curse.",
      "[*] Rettede, at Anti-Mages Magebane's Mirror ikke reducerede mana, når brugeren ikke havde nok mana at bruge.",
      "[*] Rettede, at Arc Wardens Flux med Aghanim's Scepter nogle gange stadig undertrykte, selvom Flux var blevet fordrevet.",
      "[*] Rettede, at Crystal Maidens Blueheart Floe ikke steg i level med Freezing Field.",
      "[*] Rettede, at Dazzle ikke fik Desolator-ladninger, når han dræbte helte med Nothl Projection.",
      "[*] Rettede, at Dazzle ikke fik Urn of Shadows-ladninger, når han dræbte helte med Nothl Projection.",
      "[*] Rettede, at Dazzles Nothl Projection ikke fik helingsamplifikation med Aghanim's Shard.",
      "[*] Rettede, at Dazzles Nothl Projection ikke fik fordel af talentopgraderingerne til Poison Touch i visse situationer.",
      "[*] Rettede, at Dazzles Nothl Projection gav flere Town Portal Scrolls end tilsigtet i visse situationer.",
      "[*] Rettede, at Dazzles Nothl Projection satte Aeon Disk på nedkøling.",
      "[*] Rettede, at Dazzles Nothl Projection satte Refresher Orb på nedkøling.",
      "[*] Rettede, at svækkelsesvarigheden af Dazzles Poison Touch ikke blev øget, når den blev brugt før ultimate-evnen (og omvendt).",
      "[*] Rettede, at Dazzles sjæl kunne bruge Hand of Midas.",
      "[*] Rettede, at besværgelser og skade over tid fra Dragon Knights Corrosive Dragon blev blokeret af fysisk blokering.",
      "[*] Rettede, at Dragon Knights Wyrm's Wrath påførte svækkelser på holdkammerater ved nægtelse.",
      "[*] Rettede, at Dragon Knights Wyrm's Wrath med facetten Fire Dragon utilsigtet gjorde skade på tårne.",
      "[*] Rettede, at Dragon Knights Wyrm's Wrath med facetten Fire Dragon blev udløst to gange per angreb, når Elder Dragon Form var aktiv.",
      "[*] Rettede, at det ekstra effektområde med Dragon Knights Wyrm's Wrath og facetten Fire Dragon ikke blev stablet med andre kilder til ekstra effektområde.",
      "[*] Rettede, at Hoodwinks talent for Sharpshooter i level 20 havde blinde vinkler i synsfeltet.",
      "[*] Rettede, at Invoker med Aghanim's Scepter fik flere levels af Quas, Wex eller Exort end tilsigtet.",
      "[*] Rettede, at Ios Tether ikke helede forbundne mål for skade fra Aghanim's Shard.",
      "[*] Rettede, at Lions Earth Spike ikke fik fordel af ekstra effektområder, hvis de blev opnået efter opgradering af Earth Spike.",
      "[*] Rettede, at Monkey Kings kloner stjal guld med Pirate Hat.",
      "[*] Rettede, at Morphlings Adaptive Strike med facetten Flow ikke lammede mål, hvis Morphling brugte Morph, mens projektilet var i luften.",
      "[*] Rettede, at barrieren i Pangoliers Shield Crash satte Blink Dagger på nedkøling, når barrieren blokerede skaden fuldstændigt.",
      "[*] Rettede, at Primal Beast fik ubegrænsede stablinger af Ferocity i visse situationer.",
      "[*] Rettede, at Rubick kunne få stablinger med Arcane Accumulation fra Nothl Projections End Projection.",
      "[*] Rettede, at Rubick med Aghanim's Scepter ikke modtog Aghanim's Scepter-opgraderingen, når man stjal evnen Shackles.",
      "[*] Rettede, at Pucks Phase Shift blev afbrudt af visse kommandoer.",
      "[*] Rettede, at Rikis Tricks of the Trade blev afbrudt af visse kommandoer.",
      "[*] Rettede, at Techies' Minefield Sign med Aghanim's Scepter blev udløst i løbet af kastetiden.",
      "[*] Rettede, at det tog længere tid end forventet for Templar Assassins Meld med Hidden Reach at nå maksimal angrebsrækkevidde.",
      "[*] Rettede, at Windrangers Killshot dræbte mål med lidt højere værdier end de angivne tærskler.",
      "[*] Rettede, at Windrangers level 25-talent \"Focus Fire: Drab fremskynder nedkølingen med 18s\" ikke fungerede korrekt.",
      "[/list]"
    ],
    "commentcount": 228,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 8651,
    "votedowncount": 969,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1746741908,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 8651,
  "votes_down": 969,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}