{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2-uppdatering – 21 februari 2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2-uppdatering – 21 februari 2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "Under de senaste dagarna har vi tagit itu med följande problem:",
      "[list]",
      "[*] Åtgärdade att hjältar i Ability Draft inte hade medfödda förmågor.",
      "[*] Åtgärdade att timerna för lotusdammen visade tider för det vanliga spelläget i Turbo.",
      "[*] Åtgärdade att minikartikoner inte visades för liveåskådare i spelarvyn.",
      "[*] Åtgärdade att vissa lägers spawnområden var högre än höjden på Kunkkas Torrent.",
      "[*] Åtgärdade att Tormentor spawnades på oönskade platser i demoläget.",
      "[*] Neutrala verktygstips är nu bättre på att gissa förtrollningsnivå.",
      "[*] Åtgärdade att Ironwood-träd inte gav utökad varaktighet för helande när de blev förbrukade med Tango.",
      "[*] Åtgärdade att Ninja Gear-användning under påverkan av Smoke of Deceit gjorde att man kunde återapplicera Smoke of Deceit på sina allierade.",
      "[*] Åtgärdade att Phylactery inte saktade ner fiender vid aktivering.",
      "[*] Åtgärdade att Pirate Hat gjorde att verktygstipset för dödskostnad visade en felaktig summa.",
      "[*] Åtgärdade att Pyrrhic Cloak reflekterade reflekterad skada.",
      "[*] Åtgärdade att Revenant's Brooch gjorde mer skada än vad som avsågs på illusioner.",
      "[*] Åtgärdade ett problem där Scurry och Death Pact hade fler än det maximala antalet laddningar om motsvarande talang valdes efter att förmågan blev uppgraderad.",
      "[*] Åtgärdade olika problem med Morphlings Morph.",
      "[*] Åtgärdade olika problem med Winter Wyverns Winter's Curse.",
      "[*] Åtgärdade att Anti-Mages Magebane's Mirror inte minskade mana när användaren inte har tillräckligt med mana att använda.",
      "[*] Åtgärdade att Arc Wardens Flux med Aghanim's Scepter ibland tystade även fast Flux hade avlägsnats.",
      "[*] Åtgärdade att Crystal Maidens Blueheart Floe inte levlade upp med Freezing Field.",
      "[*] Åtgärdade att Dazzle inte fick Desolator-laddningar när man dödade hjältar som en Nothl-resande.",
      "[*] Åtgärdade att Dazzle inte fick Urn of Shadows-laddningar när man dödade hjältar som en Nothl-resande.",
      "[*] Åtgärdade att Dazzles Aghanim's Shard inte gav helandeförstärkning i Nothlriket.",
      "[*] Åtgärdade att Dazzles Nothl Projection i vissa situationer inte drog nytta av talanguppgraderingar från Poison Touch.",
      "[*] Åtgärdade att Dazzles Nothl Projection i vissa situationer gav fler Town Portal Scrolls än önskat.",
      "[*] Åtgärdade att Dazzles Nothl Projection satte Aeon Disk på cooldown.",
      "[*] Åtgärdade att Dazzles Nothl Projection satte Refresher Orb på cooldown.",
      "[*] Åtgärdade att Dazzles debuffvaraktighet för Poison Touch inte ökade om den användes innan den ultimata förmågan (och omvänt).",
      "[*] Åtgärdade att Dazzles själ kunde använda Hand of Midas.",
      "[*] Åtgärdade att Dragon Knights Corrosive Dragon-besvärjelser och skada över tid-effekter blockerades av fysisk blockering.",
      "[*] Åtgärdade att Dragon Knights Wyrm's Wrath applicerade debuffar på lagkamrater vid nekande.",
      "[*] Åtgärdade att Dragon Knights Wyrm's Wrath med fasetten Fire Dragon oavsiktligt skadade torn.",
      "[*] Åtgärdade att Dragon Knights Wyrm's Wrath med fasetten Fire Dragon aktiverades två gånger per träff i Elder Dragon Form.",
      "[*] Åtgärdade att effektområdet för Dragon Knights Wyrm's Wrath med fasetten Fire Dragon inte stackade med andra källor till ökat effektområde.",
      "[*] Åtgärdade att Hoodwink nivå 20-talang för Sharpshooter hade blinda fläckar i synfältet.",
      "[*] Åtgärdade att Invoker med Aghanim's Scepter fick fler nivåer av Quas, Wex eller Exort än avsett.",
      "[*] Åtgärdade att Ios Tether inte helade sammanlänkade mål från skada utförd med Aghanim's Shard.",
      "[*] Åtgärdade att Lions Impale inte gynnades av effektområdesbonusar om de förvärvades efter att Impale hade uppgraderats.",
      "[*] Åtgärdade att Monkey King-kloner stal guld med Pirate Hat.",
      "[*] Åtgärdade att Morphlings Adaptive Strike med fasetten Flow inte bedövade mål om Morphling använde Morph medan projektilen var på väg.",
      "[*] Åtgärdade att Pangoliers Shield Crash-barriär satte Blink Dagger på cooldown när barriären helt blockerade skadan.",
      "[*] Åtgärdade att Primal Beasts Ferocity-stackar var obegränsade i vissa situationer.",
      "[*] Åtgärdade att Rubick kunde få stackar med Arcane Accumulation från Nothl Projections End Projection.",
      "[*] Åtgärdade att Rubick med Aghanim's Scepter inte fick Aghanim's Scepter-uppgraderingen när man stal Shackles.",
      "[*] Åtgärdade att Pucks Phase Shift avbröts av vissa kommandon.",
      "[*] Åtgärdade att Rikis Tricks of the Trade avbröts av vissa kommandon.",
      "[*] Åtgärdade att Techies Minefield Sign med Aghanim's Scepter utlöstes under användningsfördröjningen.",
      "[*] Åtgärdade att Templar Assassins Meld med Hidden Reach tog längre tid än förväntat för att nå maximal attackräckvidd.",
      "[*] Åtgärdade att Windrangers Killshot dödade målen vid högre HP än de angivna tröskelvärdena.",
      "[*] Åtgärdade att Windrangers nivå 25-talang ”Kills med Focus Fire påskyndar cooldown med 18 s” inte fungerade korrekt.",
      "[/list]"
    ],
    "commentcount": 228,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 8651,
    "votedowncount": 969,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1746741908,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 8651,
  "votes_down": 969,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}