{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota-2-Update – 21. Februar 2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota-2-Update – 21. Februar 2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "In den vergangenen Tagen haben wir die folgenden Probleme behoben:",
      "[list]",
      "[*] Fehler behoben, durch den bestimmte Helden im Spielmodus Ability Draft keine Begabungen erhielten.",
      "[*] Fehler behoben, durch den der Lotosbrunnen-Timer die Zeiten von regulären Partien im Turbo-Modus anzeigte.",
      "[*] Fehler behoben, durch den in der Spieleransicht keine Minikartensymbole für Zuschauer einer Live-Partie angezeigt wurden.",
      "[*] Fehler behoben, durch den Spawn-Boxen einiger Lager neutraler Einheiten die Höhe von Kunkkas Fähigkeit „Torrent“ überragten.",
      "[*] Fehler behoben, durch den der Peiniger im Demo-Modus an nicht vorgesehenen Orten erschien.",
      "[*] Fehler behoben, durch den die Kurzinfo im Tab „Neutral“ gelegentlich nicht die korrekte Stufe für Verzauberungen anzeigte.",
      "[*] Fehler behoben, durch den mit dem Gegenstand „Ironwood Branch“ gepflanzte Bäume die Heilungsdauer des Verbrauchsgegenstands „Tango“ nicht verlängerten, wenn sie damit konsumiert wurden.",
      "[*] Fehler behoben, durch den der Smoke-of-Deceit-Effekt des neutralen Gegenstands „Ninja Gear“ erneut auf Verbündete angewendet wurde, wenn der Anwender und diese bereits von dem Effekt betroffen waren.",
      "[*] Fehler behoben, durch den der Gegenstand „Phylactery“ bei Auslösung des Effekts Gegner nicht verlangsamte.",
      "[*] Fehler behoben, durch den der neutrale Gegenstand „Pirate Hat“ dafür sorgte, dass ein leicht verfälschter Wert für die Todeskosten angezeigt wurde.",
      "[*] Fehler behoben, durch den der neutrale Gegenstand „Pyrrhic Cloak“ reflektierten Schaden erneut reflektierte.",
      "[*] Fehler behoben, durch den der Gegenstand „Revenant’s Brooch“ Illusionen mehr Schaden als vorgesehen zufügte.",
      "[*] Fehler behoben, durch den Hoodwinks Fähigkeit „Scurry“ und Clinkz’ Fähigkeit „Death Pact“ mehr als die max. Anzahl an Aufladungen erhielten, wenn das zugehörige Talent nach der vollständigen Aufwertung der Fähigkeit gewählt wurde.",
      "[*] Verschiedene Probleme mit Morphlings Fähigkeit „Morph“ behoben.",
      "[*] Verschiedene Probleme mit Winter Wyverns Fähigkeit „Winter’s Curse“ behoben.",
      "[*] Fehler behoben, durch den Anti-Mages Fähigkeit „Counterspell (Ally)“ mit der Facette „Spiegel des Magierfluchs“ kein Mana verbrannte, wenn der Anwender über weniger Mana als die Manakosten des gekonterten Zaubers verfügte.",
      "[*] Fehler behoben, durch den Arc Wardens Fähigkeit „Flux“ mit Zepterbonus gelegentlich Gegner verstummen ließ, auch wenn der Effekt entzaubert wurde.",
      "[*] Fehler behoben, durch den Crystal Maidens Begabung „Blauherzessenz“ nicht mit der Fähigkeit „Freezing Field“ aufgewertet wurde.",
      "[*] Fehler behoben, durch den Dazzle keine Instanzen für den Gegenstand „Desolator“ erhielt, wenn er gegnerische Helden während der Fähigkeit „Nothl Projection“ tötete.",
      "[*] Fehler behoben, durch den Dazzle keine Instanzen für den Gegenstand „Urn of Shadows“ erhielt, wenn er gegnerische Helden während der Fähigkeit „Nothl Projection“ tötete.",
      "[*] Fehler behoben, durch den Dazzles Fähigkeit „Nothl Projection“ mit Splitterbonus keine Heilungsverstärkung gewährte.",
      "[*] Fehler behoben, durch den Dazzles Fähigkeit „Nothl Projection“ in bestimmten Situationen nicht von der Talentaufwertung der Fähigkeit „Poison Touch“ profitierte.",
      "[*] Fehler behoben, durch den Dazzles Fähigkeit „Nothl Projection“ in bestimmten Situationen mehr Exemplare des Gegenstands „Town Portal Scroll“ gewährte als vorgesehen.",
      "[*] Fehler behoben, durch den Dazzles Fähigkeit „Nothl Projection“ die Abklingzeit des Gegenstands „Aeon Disk“ auslöste.",
      "[*] Fehler behoben, durch den Dazzles Fähigkeit „Nothl Projection“ die Abklingzeit des Gegenstands „Refresher Orb“ auslöste.",
      "[*] Fehler behoben, durch den die Schwächungsdauer von Dazzles Fähigkeit „Poison Touch“ nicht erhöht wurde, wenn sie vor der Fähigkeit „Nothl Projection“ gewirkt wurde (und umgekehrt).",
      "[*] Fehler behoben, durch den Dazzle während der Fähigkeit „Nothl Projection“ den Gegenstand „Hand of Midas“ benutzen konnte.",
      "[*] Fehler behoben, durch den Dragon Knights Schaden von Fähigkeiten und kontinuierlichen Effekten mit der Facette „Giftdrache“ durch physischen Schadensblock geblockt werden konnten.",
      "[*] Fehler behoben, durch den Dragon Knights Fähigkeit „Wyrm’s Wrath“ beim Denyen Teammitglieder mit Schwächungseffekten belegte.",
      "[*] Fehler behoben, durch den Dragon Knights Fähigkeit „Wyrm’s Wrath“ mit der Facette „Feuerdrache“ Türmen Schaden zufügte.",
      "[*] Fehler behoben, durch den der Effekt von Dragon Knights Fähigkeit „Wyrm’s Wrath“ mit der Facette „Feuerdrache“ in der Urdrachenform zweimal pro Treffer ausgelöst wurde.",
      "[*] Fehler behoben, durch den sich der Wirkungsbereichsbonus von Dragon Knights Fähigkeit „Wyrm’s Wrath“ mit der Facette „Feuerdrache“ nicht mit anderen Effekten dieser Art aufsummierte.",
      "[*] Fehler behoben, durch den Hoodwinks Level-20-Talent „Sharpshooter gewährt Sicht während der Kanalisierung“ tote Winkel im Sichtbereich aufwies.",
      "[*] Fehler behoben, durch den Invoker mit Zepterbonus mehr Level für Quas, Wex und Exort als vorgesehen erhielt.",
      "[*] Fehler behoben, durch den Ios Fähigkeit „Tether“ verbundene Einheiten nicht heilte, wenn Gegner mit der Verbindung in Kontakt kamen.",
      "[*] Fehler behoben, durch den Lions Fähigkeit „Earth Spike“ nicht von Wirkungsbereichsboni profitierte, wenn diese erst nach der Aufwertung der Fähigkeit gewährt wurden.",
      "[*] Fehler behoben, durch den auch Monkey Kings Affensoldaten mit dem neutralen Gegenstand „Pirate Hat“ Gold raubten.",
      "[*] Fehler behoben, durch den Morphlings Fähigkeit „Adaptive Strike“ mit der Facette „Flut“ Ziele nicht betäubte, wenn Morphling die Fähigkeit „Morph“ wirkte, während das Projektil unterwegs war.",
      "[*] Fehler behoben, durch den die mit Pangoliers Fähigkeit „Shield Crash“ gewährte Barriere die Abklingzeit des Gegenstands „Blink Dagger“ auslöste, wenn die Barriere Schaden vollständig blockte.",
      "[*] Fehler behoben, durch den Primal Beast in bestimmten Situationen unbegrenzt viele Instanzen für seine Fähigkeit „Uproar“ erhalten konnte.",
      "[*] Fehler behoben, durch den Rubicks Fähigkeit „Arcane Supremacy“ mit der Facette „Arkane Akkumulation“ Instanzen durch das Wirken der Unterfähigkeit „End Projection“ von Dazzles Fähigkeit „Nothl Projection“ erhielt.",
      "[*] Fehler behoben, durch den Rubicks Fähigkeit „Spell Steal“ mit Zepterbonus nicht den Zepterbonus von Shadow Shamans Fähigkeit „Shackles“ gewährte.",
      "[*] Fehler behoben, durch den Pucks Fähigkeit „Phase Shift“ durch bestimmte Befehle unterbrochen werden konnte.",
      "[*] Fehler behoben, durch den Rikis Fähigkeit „Tricks of the Trade“ durch bestimmte Befehle unterbrochen werden konnte.",
      "[*] Fehler behoben, durch den der Effekt der Fähigkeit „Minefield Sign“ der Techies mit Splitterbonus schon während der Zauberverzögerung ausgelöst wurde.",
      "[*] Fehler behoben, durch den Templar Assassins Fähigkeit „Meld“ mit der Facette „Verborgene Reichweite“ länger als vorgesehen benötigte, um die max. Angriffsreichweite zu erreichen.",
      "[*] Fehler behoben, durch den Windrangers Fähigkeit „Powershot“ mit der Facette „Henkerspfeil“ Ziele hinrichtete, deren Lebenspunkte etwas über dem benötigten Schwellenwert lagen.",
      "[*] Fehler behoben, durch den Windrangers Level-25-Talent „Kills mit Focus Fire verkürzen die Abklingzeit um 18 s“ nicht ordnungsgemäß funktionierte.",
      "[/list]"
    ],
    "commentcount": 228,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 8651,
    "votedowncount": 969,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1746741908,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 8651,
  "votes_down": 969,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}