{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja Dota 2 – 21 lutego 2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aktualizacja Dota 2 – 21 lutego 2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "W ciągu ostatnich kilku dni zajęliśmy się następującymi problemami:",
      "[list]",
      "[*] Naprawiono błąd powodujący, że bohaterowie w trybie Ability Draft nie mieli umiejętności wrodzonych.",
      "[*] Naprawiono błąd powodujący, że czasomierze basenów lotosu w trybie Turbo wyświetlały czasy ze standardowego trybu Dota 2.",
      "[*] Naprawiono błąd powodujący, że ikony minimapy nie były wyświetlane dla widzów na żywo w widoku gracza.",
      "[*] Naprawiono błąd powodujący, że obszary odradzania w niektórych obozach były wyższe niż gejzer z um. Torrent od Kunkki.",
      "[*] Naprawiono błąd powodujący, że dręczyciel pojawiał się w niepożądanych lokalizacjach w trybie testu bohatera.",
      "[*] Od teraz objaśnienia przedmiotów neutralnych są lepsze w zgadywaniu poziomu wzmocnienia.",
      "[*] Naprawiono błąd powodujący, że drzewa z przedmiotu Iron Branch nie zapewniały wydłużonego czasu leczenia przy użyciu z przedmiotem Tango.",
      "[*] Naprawiono błąd powodujący, że korzystanie z przedmiotu Ninja Gear podczas um. Solitary Disguise umożliwiało ponowne nałożenie um. Smoke of Deceit na sojuszników.",
      "[*] Naprawiono błąd powodujący, że przedmiot Phylactery nie spowalniał wrogów po aktywacji.",
      "[*] Naprawiono błąd, wskutek którego przedmiot Pirate Hat powodował, że objaśnienie utraty złota z powodu śmierci wyświetlało nieznacznie nieprawidłową wartość.",
      "[*] Naprawiono błąd powodujący, że przedmiot Pyrrhic Cloak odbijał odbite obrażenia.",
      "[*] Naprawiono błąd powodujący, że przedmiot Revenant's Brooch użyty na iluzjach zadawał więcej obrażeń, niż zamierzono.",
      "[*] Naprawiono błąd powodujący, że um. Scurry od Hoodwink oraz Death Path od Clinkza miały wyższą od maksymalnej liczbę ładunków, jeśli powiązany talent został wybrany po nauczeniu się umiejętności.",
      "[*] Naprawiono rozmaite błędy związane z um. Morph od Morphlinga.",
      "[*] Naprawiono rozmaite błędy związane z um. Winter's Curse od Winter Wyvern.",
      "[*] Naprawiono błąd powodujący, że um. Counterspell i Counterspell Ally od Anti-Mage'a z aspektem Zwierciadło Zabójcy Magów nie redukowały many, gdy rzucający nie miał jej wystarczająco do użycia.",
      "[*] Naprawiono błąd powodujący, że um. Flux od Arc Wardena po ulepszeniu z Aghanim's Shard okazjonalnie nadal nakładała uciszenie nawet po jej rozproszeniu.",
      "[*] Naprawiono błąd powodujący, że poziom um. Blueheart Floe od Crystal Maiden nie podwyższał się wraz z um. Freezing Field.",
      "[*] Naprawiono błąd powodujący, że Dazzle nie otrzymywał ładunków z przedmiotu Desolator, gdy zabił bohaterów podczas um. Nothl Projection.",
      "[*] Naprawiono błąd powodujący, że Dazzle nie otrzymywał ładunków z przedmiotu Urn of Shadows, gdy zabił bohaterów podczas um. Nothl Projection.",
      "[*] Naprawiono błąd powodujący, że przedmiot Aghanim's Shard nie zapewniał wzmocnionego leczenia podczas um. Nothl Projection.",
      "[*] Naprawiono um. Nothl Projection od Dazzle'a, która w pewnych sytuacjach nie korzystała z ulepszeń talentów um. Poison Touch.",
      "[*] Naprawiono błąd powodujący, że w pewnych okolicznościach um. Nothl Projection od Dazzle'a przyznawała wyższą od pożądanej liczbę sztuk przedmiotu Town Portal Scroll.",
      "[*] Naprawiono błąd powodujący, że um. Nothl Projection od Dazzle'a aktywowała czas oczekiwania na przedmiot Aeon Disk.",
      "[*] Naprawiono błąd powodujący, że um. Nothl Projection od Dazzle'a aktywowała czas oczekiwania na przedmiot Refresher Orb.",
      "[*] Naprawiono błąd powodujący, że czas trwania negatywnego efektu z um. Poison Touch od Dazzle'a się nie wydłużał, gdy użyto jej przed rzuceniem um. ostatecznej (i odwrotnie).",
      "[*] Naprawiono błąd powodujący, że dusza Dazzle'a podczas um. Noth Projection mogła korzystać z przedmiotu Hand of Midas.",
      "[*] Naprawiono błąd powodujący, że czary i obrażenia okresowe z aspektu Żrący Smok od Dragon Knighta były blokowane przez blokadę fizycznych obrażeń.",
      "[*] Naprawiono błąd powodujący, że negatywne efekty um. Wyrm's Wrath od Dragon Knighta były nakładane na sojuszników przy dobijaniu.",
      "[*] Naprawiono błąd powodujący, że um. Wyrm's Wrath z aspektem Ognisty Smok od Dragon Knighta w niezamierzony sposób zadawała obrażenia wieżom.",
      "[*] Naprawiono błąd powodujący, że um. Wyrm's Wrath z aspektem Ognisty Smok od Dragon Knighta była dwukrotnie aktywowana przy trafieniu w postaci pradawnego smoka.",
      "[*] Naprawiono błąd powodujący, że premia do obszaru działania um. Wyrm's Wrath z aspektem Ognisty Smok od Dragon Knighta nie kumulowała się z innymi źródłami zwiększonego obszaru działania.",
      "[*] Talent 20 poziomu: naprawiono błąd powodujący, że um. Sharpshooter od Hoodwink miała martwe punkty w polu widzenia.",
      "[*] Naprawiono błąd powodujący, że Invoker z Aghanim's Scepter zyskiwał więcej poziomów um. Quas, Wex lub Exort, niż było to zamierzone.",
      "[*] Naprawiono błąd powodujący, że um. Tether od Io nie leczyła uwiązanych celów z obrażeń otrzymanych od Aghanim's Shard.",
      "[*] Naprawiono błąd powodujący, że um. Earth Spike od Liona nie korzystała z premii do obszaru działania, jeśli premie do obszaru działania zostały zdobyte po podwyższeniu poziomu tej um.",
      "[*] Naprawiono błąd powodujący, że klony Monkey Kinga kradły złoto z przedmiotem Pirate Hat.",
      "[*] Naprawiono błąd powodujący, że um Adaptive Strike od Morphlinga z aspektem Flow nie ogłuszała celów, jeśli Morphling użył um. Morph podczas poruszania się.",
      "[*] Naprawiono błąd powodujący, że bariera od um Shield Crash od Pangoliera nakładała czas oczekiwania na um. Blink Dagger, gdy bariera całkowicie zablokowała obrażenia.",
      "[*] Naprawiono błąd powodujący, że um. Ferocity od Primal Beasta miała nieograniczone instancje w pewnych sytuacjach.",
      "[*] Naprawiono błąd powodujący, że Rubick mógł gromadzić instancje um. Arcane Accumulation z zakończenia projekcji um. Nothl Projection.",
      "[*] Naprawiono błąd powodujący, że Rubick posiadający Aghanim's Scepter nie otrzymywał z niego ulepszenia dla skradzionej um. Shackles.",
      "[*] Naprawiono błąd powodujący, że um. Phase Shift od Pucka była przerywana przez pewne polecenia.",
      "[*] Naprawiono błąd powodujący, że um. Tricks of the Trade od Rikiego była przerywana przez pewne polecenia.",
      "[*] Naprawiono błąd powodujący, że um. Minefield Sign od Techiesów posiadających Aghanim's Scepter była aktywowana podczas rzucania.",
      "[*] Naprawiono błąd powodujący, że osiągnięcie maksymalnego zasięgu ataku Templar Assassin z um. Meld z aspektem Ukryty Zasięg trwało dłużej, niż było to zamierzone.",
      "[*] Naprawiono błąd powodujący, że egzekucje z um. Killshot od Windranger były dokonywane nieco powyżej podanego progu.",
      "[*] Naprawiono błąd powodujący, że talent 25. poziomu od Windranger skracający czas oczekiwania o 18 s na zabójstwo z um. Focus Fire nie działał prawidłowo.",
      "[/list]"
    ],
    "commentcount": 229,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 8567,
    "votedowncount": 966,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1746059227,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 8567,
  "votes_down": 966,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}