{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Oppdatering til Dota 2 – 21. februar 2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Oppdatering til Dota 2 – 21. februar 2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "I løpet av de siste dagene har vi ordnet opp i følgende problemer:",
      "[list]",
      "[*] Fikset at helter i Ability Draft ikke hadde medfødte evner.",
      "[*] Fikset at tidene for lotusvann viste vanlige Dota-tider i turbomodus.",
      "[*] Fikset at ikoner på minikartet ikke ble vist for direkte tilskuere i spillervisning.",
      "[*] Fikset at noen leirområder var høyere enn høyden på Kunkkas Torrent.",
      "[*] Fikset at plageånder dukket opp på uønskede steder i demomodus.",
      "[*] Nøytrale verktøytips er bedre til å gjette fortryllelseskategori.",
      "[*] Fikset at Ironwood-tre ikke ga forlenget helbredelsesvarighet når de ble fortært med Tango.",
      "[*] Fikset at bruk av Ninja Gear mens man var røyklagt gjorde at man kunne påføre Smoke of Deceit på allierte om igjen.",
      "[*] Fikset at Phylactery ikke hemmet fiender.",
      "[*] Fikset at Pirate Hat førte til at verktøytipset med dødskostnaden viste feil beløp.",
      "[*] Fikset at Pyrrhic Cloak reflekterte reflektert skade.",
      "[*] Fikset at Revenant's Brooch på illusjoner gjorde mer skade enn tilsiktet.",
      "[*] Fikset et problem der Scurry og Death Pact kunne ha flere enn maks antall ladninger hvis det tilsvarende talentet ble valgt etter at evnen var oppgradert.",
      "[*] Fikset diverse problemer med Morphlings Morph.",
      "[*] Fikset diverse problemer med Winter Wyverns Winter's Curse.",
      "[*] Fikset at Anti-Mages Magebane's Mirror ikke reduserte mana når brukeren ikke hadde nok mana å bruke.",
      "[*] Fikset at Arc Wardens Flux med Aghanim's Scepter av og til stilnet selv om Flux var fordrevet.",
      "[*] Fikset at Crystal Maidens Blueheart Floe ikke gikk opp i nivå med Freezing Field.",
      "[*] Fikset at Dazzle ikke fikk Desolator-ladninger når han drepte fiender som en Nothlreisende.",
      "[*] Fikset at Dazzle ikke fikk Urn of Shadows-ladninger når han drepte fiender som en Nothlreisende.",
      "[*] Fikset at Dazzles Aghanim's Shard ikke ga helbredelsesstyrkelse i Nothlriket.",
      "[*] Fikset at Dazzles Nothl Projection ikke dro nytte av talentoppgraderingene til Poison Touch i visse situasjoner.",
      "[*] Fikset at Dazzles Nothl Projection fikk flere Town Portal Scrolls enn tilsiktet i visse situasjoner.",
      "[*] Fikset at Dazzles Nothl Projection satte Aeon Disk på nedkjøling.",
      "[*] Fikset at Dazzles Nothl Projection satte Refresher Orb på nedkjøling.",
      "[*] Fikset at svekkelsesvarigheten til Dazzles Poison Touch ikke ble økt når den brukes før bruk av ultimaten (og omvendt).",
      "[*] Fikset at Dazzles ånd kunne bruke Hand of Midas.",
      "[*] Fikset at formler og skade over tid fra Dragon Knights Corrosive Dragon ble blokkert av fysisk blokkering.",
      "[*] Fikset at Dragon Knights Wyrm's Wrath påførte svekkelser på lagkamerater ved berøvelse.",
      "[*] Fikset at Dragon Knights Wyrm's Wrath med fasetten Fire Dragon utilsiktet gjorde skade på tårn.",
      "[*] Fikset at Dragon Knights Wyrm's Wrath med fasetten Fire Dragon ble utløst to ganger per treff i drageform.",
      "[*] Fikset at ekstra virkeområde med Dragon Knights Wyrm's Wrath og fasetten Fire Dragon ikke ble stablet med andre kilder til ekstra virkeområde.",
      "[*] Fikset at Hoodwinks talent for Sharpshooter på nivå 20 hadde blindsoner i synsfeltet.",
      "[*] Fikset at Invoker med Aghanim's Scepter fikk flere nivåer av Quas, Wex eller Exort enn tilsiktet.",
      "[*] Fikset at Ios Tether ikke helbredet forbundne mål fra skade gjort med Aghanim's Shard.",
      "[*] Fikset at Lions Impale ikke dro nytte av ekstra virkeområder hvis dette ble anskaffet etter å ha oppgradert Impale.",
      "[*] Fikset at Monkey Kings kloner stjal gull med Pirate Hat.",
      "[*] Fikset at Morphlings Adaptive Strike med fasetten Flow ikke lammet mål hvis Morphling brukte Morph mens prosjektilet var på vei.",
      "[*] Fikset at barrieren fra Pangoliers Shield Crash satte Blink Dagger på nedkjøling når barrieren fullstendig blokkerer skaden.",
      "[*] Fikset at Primal Beasts maks stabler med Ferocity var ubegrenset i visse situasjoner.",
      "[*] Fikset at Rubick kunne få stabler med Arcane Accumulation fra Nothl Projections underevne End Projection.",
      "[*] Fikset at Rubick med Aghanim's Scepter ikke fikk Scepter-versjonen av en stjålen Shackles.",
      "[*] Fikset Pucks Phase Shift ble avbrutt av visse kommandoer.",
      "[*] Fikset Rikis Tricks of the Trade ble avbrutt av visse kommandoer.",
      "[*] Fikset at Techies' Minefield Sign med Aghanim's Scepter ble utløst i løpet av brukstiden.",
      "[*] Fikset at Templar Assassins Meld med fasetten Hidden Reach tok lengre tid enn forventet å nå maks angrepsrekkevidde.",
      "[*] Fikset at Windrangers Killshot drepte mål på litt høyere helse enn de angitte tersklene.",
      "[*] Fikset at Windrangers talent på nivå 25, «Focus Fire: 18 s fremskyndet nedkjøling ved drap», ikke fungerte ordentlig.",
      "[/list]"
    ],
    "commentcount": 229,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 8567,
    "votedowncount": 966,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1746059227,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 8567,
  "votes_down": 966,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}