{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualización de Dota 2 - 21/2/2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualización de Dota 2 - 21/2/2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "En los últimos días, hemos solucionado los siguientes problemas:",
      "[list]",
      "[*] Se corrigió que los héroes no tuvieran habilidades innatas en la selección de habilidades.",
      "[*] Se corrigió que los temporizadores de la Fuente de Loto mostrasen los tiempos del modo normal de Dota en el modo Turbo.",
      "[*] Los iconos del minimapa ya aparecen para los espectadores en directo en la vista de jugador.",
      "[*] Se corrigió que la zona de regeneración de algunos campamentos fuera más alta que el Torrente de Kunkka.",
      "[*] El Torturador ya no aparece en ubicaciones indeseadas en el modo de prueba de héroe.",
      "[*] Se mejoró la capacidad de calcular el nivel de encantamiento de las descripciones emergentes de los neutrales.",
      "[*] Se corrigió que los árboles creados con Rama Férrea no curasen durante más tiempo al consumirse con Tango.",
      "[*] Utilizar Equipamiento Ninja en un área con humo ya no permite reaplicar Humo del Engaño a los aliados.",
      "[*] Se corrigió que Filacteria no ralentizara a los enemigos al activarse.",
      "[*] Se corrigió que Sombrero Pirata provocase que la descripción emergente del coste por muerte mostrara una cantidad ligeramente incorrecta.",
      "[*] Capa Pírrica ya no refleja el daño reflejado.",
      "[*] Se corrigió que Broche del Renacido infligiera más daño del que debería a las ilusiones.",
      "[*] Se corrigió un problema por el que el número de cargas de Escabullida y Pacto Mortal superaba el máximo si el talento correspondiente se seleccionaba después de aprender la habilidad.",
      "[*] Se corrigieron varios problemas relacionados con Transformación de Morphling.",
      "[*] Se corrigieron varios problemas relacionados con Maldición del Invierno de Winter Wyvern.",
      "[*] Se corrigió que Espejo de Magebane de Anti‑Mage no redujera el maná cuando quien lanzaba el hechizo no tenía suficiente maná.",
      "[*] Se corrigió que Flujo de Arc Warden con el Cetro de Aghanim silenciase a veces incluso si se disipaba Flujo.",
      "[*] Témpano de Corazón Azul de Crystal Maiden ya sube de nivel con Campo Congelante.",
      "[*] Se corrigió que Dazzle no obtuviera cargas de Desoladora al matar héroes convertido en viajero de Nothl.",
      "[*] Se corrigió que Dazzle no obtuviera cargas de Urna de las Sombras al matar héroes convertido en viajero de Nothl.",
      "[*] Se corrigió que el Fragmento de Aghanim no proporcionase amplificación de curación a Dazzle cuando este estaba en el Reino de Nothl.",
      "[*] Se corrigió que Proyección de Nothl de Dazzle no se beneficiara de las mejoras de talentos de Toque Venenoso en determinadas situaciones.",
      "[*] Se corrigió que Proyección de Nothl de Dazzle otorgara más Pergaminos de Teletransporte de los que debería en determinadas situaciones.",
      "[*] Proyección de Nothl de Dazzle ya no inicia el tiempo de recarga de Disco del Eón.",
      "[*] Proyección de Nothl de Dazzle ya no inicia el tiempo de recarga de Orbe Revigorizante.",
      "[*] Se corrigió que la duración del efecto negativo de Toque Venenoso de Dazzle no aumentase al utilizarse antes de lanzar la habilidad definitiva (y viceversa).",
      "[*] El alma de Dazzle ya no puede utilizar Mano de Midas.",
      "[*] El bloqueo de daño físico ya no bloquea los hechizos y el daño con el tiempo de Dragón Corrosivo de Dragon Knight.",
      "[*] Se corrigió que Ira de Wyrm de Dragon Knight aplicara efectos negativos a los compañeros de equipo al denegar.",
      "[*] Ira de Wyrm en combinación con la faceta Dragón de Fuego de Dragon Knight ya no inflige daño a las torres incorrectamente.",
      "[*] Se corrigió que Ira de Wyrm en combinación con la faceta Dragón de Fuego de Dragon Knight se activase dos veces por impacto durante Forma de Dragón Ancestral.",
      "[*] Se corrigió que la bonificación de Ira de Wyrm en combinación con la faceta Dragón de Fuego de Dragon Knight no se acumulara con otras mejoras de área de efecto.",
      "[*] El talento de nivel 20 de Hoodwink «Tirador Certero proporciona visión mientras se carga» ya no tiene puntos ciegos en el campo de visión.",
      "[*] Se corrigió que Invoker obtuviera más niveles de Quas, Wex o Exort con el Cetro de Aghanim de los que debería.",
      "[*] Se corrigió que Vínculo de Io no curase el daño infligido con el Fragmento de Aghanim a los objetivos vinculados.",
      "[*] Se corrigió que Púa Terrenal de Lion no se beneficiara de las bonificaciones de área de efecto si estas se conseguían después de subir de nivel la habilidad.",
      "[*] Los clones de Monkey King ya no roban oro con el Sombrero Pirata.",
      "[*] Se corrigió que Golpe Adaptativo en combinación con la faceta Flujo de Morphling no aturdiera a los objetivos si Morphling se transformaba antes de que el proyectil alcanzase al objetivo.",
      "[*] La barrera de Salto Estruendoso de Pangolier ya no inicia el tiempo de recarga de Daga de Traslación cuando la barrera bloquea todo el daño.",
      "[*] Se corrigió que las acumulaciones de Ferocidad de Primal Beast no tuvieran límite en determinadas situaciones.",
      "[*] Rubick ya no puede obtener acumulaciones de Acumulación Arcana al finalizar la proyección de Proyección de Nothl.",
      "[*] Cuando Rubick roba Ataduras con el Cetro de Aghanim, ahora recibe la versión mejorada con el Cetro de Aghanim de esta habilidad.",
      "[*] Se corrigió que determinados comandos pudieran interrumpir Cambio de Fase de Puck.",
      "[*] Se corrigió que determinados comandos pudieran interrumpir Secretos del Oficio de Riki.",
      "[*] Se corrigió que Señal de Campo de Minas de los Techies con el Cetro de Aghanim se activara durante la animación de lanzamiento.",
      "[*] Se corrigió que Fusión en combinación con Alcance Oculto de Templar Assassin tardara más de lo que debería en alcanzar el alcance de ataque máximo.",
      "[*] Se corrigió que Disparo Mortal de Windranger ejecutara a los objetivos con umbrales de vida un poco más altos de los establecidos.",
      "[*] El talento de nivel 25 de Windranger «Las víctimas de Fuego Concentrado adelantan la recarga 18 s» ya funciona correctamente.",
      "[/list]"
    ],
    "commentcount": 228,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 8651,
    "votedowncount": 969,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1746741908,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 8651,
  "votes_down": 969,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "521957873571334328",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}