{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualizare Dota 2 – 21 februarie 2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualizare Dota 2 – 21 februarie 2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "Pe parcursul ultimelor zile am remediat următoarele probleme:",
      "[list]",
      "[*] A fost remediată problema în care modul de joc „Selecție de abilități” nu conținea abilități native.",
      "[*] A fost remediată problema în care, în modul de joc „Turbo”, temporizatoarele iazurilor cu lotuși afișau timpii din modul de joc standard.",
      "[*] A fost remediată problema în care pictogramele de pe minihartă nu erau afișate pentru spectatorii live în modul de vizualizare „Perspectivă jucător”.",
      "[*] A fost remediată problema în care zonele de apariție ale unor tabere erau mai înalte decât instanța abilității Torrent a lui Kunkka.",
      "[*] A fost remediată problema în care oprimatoarele apăreau în locații indezirabile în modul Demo.",
      "[*] Descrierile obiectelor neutre indică acum corect nivelurile farmecelor.",
      "[*] A fost remediată problema în care copacii creați de Iron Branch nu ofereau o durată de vindecare prelungită când erau consumați cu un Tango.",
      "[*] A fost remediată problema în care jucătorii care beneficiau de Smoke of Deceit puteau utiliza Ninja Gear pentru a reaplica Smoke of Deceit aliaților.",
      "[*] A fost remediată problema în care Phylactery nu încetinea inamicii atunci când se declanșa.",
      "[*] A fost remediată problema din cauza căreia descrierea artefactului Pirate Hat afișa o valoare ușor inexactă.",
      "[*] A fost remediată problema în care Pyrrhic Cloak reflecta daunele care erau reflectate deja.",
      "[*] A fost remediată problema în care obiectul Revenant's Brooch cauza mai multe daune decât trebuia atunci când era folosit de iluzii.",
      "[*] A fost remediată problema în care Scurry și Death Pact puteau avea mai multe încărcături decât maximul permis dacă talentul asociat era selectat după învățarea abilității.",
      "[*] Au fost remediate mai multe probleme aferente abilității Morph a lui Morphling.",
      "[*] Au fost remediate mai multe probleme aferente abilității Winter's Curse a eroinei Winter Wyvern.",
      "[*] A fost remediată problema în care fațeta Magebane's Mirror a lui Anti-Mage nu reducea mana dacă invocatorul nu mai avea destulă mana.",
      "[*] A fost remediată problema în care abilitatea Flux a lui Arc Warden îmbunătățită de Aghanim's Scepter amuțea uneori, chiar dacă efectul negativ era descântat.",
      "[*] A fost remediată problema în care abilitatea Blueheart Floe a eroinei Crystal Maiden nu creștea în nivel odată cu Freezing Field.",
      "[*] A fost remediată problema în care Dazzle nu primea încărcături pentru Desolator în timp ce folosea Nothl Projection.",
      "[*] A fost remediată problema în care Dazzle nu primea încărcături pentru Urn of Shadows în timp ce folosea Nothl Projection.",
      "[*] A fost remediată problema în care Aghanim's Shard nu-i oferea lui Dazzle amplificare pentru vindecare în timp ce folosea Nothl Projection.",
      "[*] A fost remediată problema în care Dazzle nu beneficia de talentele pentru Poison Touch în anumite situații în timp ce folosea Nothl Projection.",
      "[*] A fost remediat problema în care, în anumite situații, abilitatea Nothl Projection a lui Dazzle acorda mai multe obiecte Town Portal Scroll decât trebuia.",
      "[*] A fost remediată problema în care abilitatea Nothl Projection a lui Dazzle declanșa repausul obiectului Aeon Disk.",
      "[*] A fost remediată problema în care abilitatea Nothl Projection a lui Dazzle declanșa repausul obiectului Refresher Orb.",
      "[*] A fost remediată problema în care durata efectului negativ al abilității Poison Touch a lui Dazzle nu-și mărea durata atunci când era folosită înainte de invocarea abilității supreme (și invers).",
      "[*] A fost remediată problema în care Dazzle putea folosi Hand of Midas în timp ce folosea Nothl Projection.",
      "[*] A fost remediată problema în care vrăjile și efectele de daune de-a lungul timpului aferente fațetei Corrosive Dragon a lui Dragon Knight erau blocate de blocarea daunelor fizice.",
      "[*] A fost remediată problema în care abilitatea Wyrm's Wrath a lui Dragon Knight aplica efecte negative coechipierilor atunci când îi sacrifica.",
      "[*] A fost remediată problema în care abilitatea Wyrm's Wrath cu fațeta Fire Dragon a lui Dragon Knight cauza daune turnurilor în mod eronat.",
      "[*] A fost remediată problema în care abilitatea Wyrm's Wrath a lui Dragon Knight cu fațeta Fire Dragon se declanșa de două ori per lovitură în timp ce folosea Elder Dragon Form.",
      "[*] A fost remediată problema în care bonusul de zonă de efect oferit de fațeta Fire Dragon abilității Knight's Wyrm a lui Dragon Knight nu se cumula cu alte surse de mărire a zonei de efect.",
      "[*] A fost remediată problema în care talentul de la nivelul 20 pentru abilitatea Sharpshooter a eroinei Hoodwink avea unghiuri moarte în câmpul său vizual.",
      "[*] A fost remediată problema în care Invoker cu Aghanim's Scepter primea mai multe niveluri de Quas, Wex sau Exort decât trebuia.",
      "[*] A fost remediată problema în care abilitatea Tether a lui Io nu vindeca țintele legăturii cu daunele cauzate de abilitate cu Aghanim's Shard.",
      "[*] A fost remediată problema în care abilitatea Earth Spike a lui Lion nu beneficia de bonusurile pentru zona de efect dacă acele bonusuri erau obținute după mărirea nivelului abilității Earth Spike.",
      "[*] A fost remediată problema în care clonele lui Monkey King puteau fura aur cu Pirate Hat.",
      "[*] A fost remediată problema în care abilitatea Adaptive Strike cu fațeta Flow a lui Morphling nu năucea țintele dacă Morphling folosea Morph cât timp proiectilul era încă în zbor.",
      "[*] A fost remediată problema în care bariera creată de abilitatea Shield Crash a lui Pangolier declanșa repausul obiectului Blink Dagger atunci când bariera bloca daunele complet.",
      "[*] A fost remediată problema în care abilitatea Ferocity a lui Primal Beast nu avea o limită de suprapuneri în anumite situații.",
      "[*] A fost remediată problema în care Rubick putea obține uneori suprapuneri de Arcane Accumulation atunci când folosea subabilitatea End Projection a abilității Nothl Projection.",
      "[*] A fost remediată problema în care Rubick cu Aghanim's Scepter nu primea îmbunătățirea oferită de Aghanim's Scepter pentru o abilitate Shackles furată.",
      "[*] A fost remediată problema în care abilitatea Phase Shift a lui Puck era întreruptă de anumite comenzi.",
      "[*] A fost remediată problema în care abilitatea Tricks of the Trade a lui Riki era întreruptă de anumite comenzi.",
      "[*] A fost remediată problema în care abilitatea Minefield Sign a lui Techies îmbunătățită de Aghanim's Scepter se declanșa în timpul invocării.",
      "[*] A fost remediată problema în care abilitatea Meld cu fațeta Hidden Reach a eroinei Templar Assassin atingea maximul distanței de atac mult prea lent.",
      "[*] A fost remediată problema în care abilitatea Powershot cu fațeta Killshot a eroinei Windranger executa țintele la praguri mai mari decât cele menționate.",
      "[*] A fost remediată problema în care talentul de la nivelul 25 al eroinei Windranger care reduce repausul abilității Focus Fire în urma uciderilor nu funcționa corect.",
      "[/list]"
    ],
    "commentcount": 142,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 2161,
    "votedowncount": 220,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1740413766,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2161,
  "votes_down": 220,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}