{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Ενημέρωση Dota 2 – 21/2/2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ενημέρωση Dota 2 – 21/2/2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "Τις τελευταίες ημέρες διορθώσαμε τα ακόλουθα προβλήματα:",
      "[list]",
      "[*] Διορθώθηκε πρόβλημα όπου οι ήρωες στο Ability Draft δεν είχαν εγγενείς ικανότητες.",
      "[*] Διορθώθηκε πρόβλημα όπου τα χρονόμετρα των σιντριβανιών λωτών έδειχναν τους χρόνους του κανονικού τύπου παιχνιδιού Dota σε παιχνίδια τύπου Turbo.",
      "[*] Διορθώθηκε πρόβλημα όπου, στην όψη παίκτη, τα εικονίδια του μικρού χάρτη δεν εμφανίζονταν για τους θεατές σε ζωντανή μετάδοση.",
      "[*] Διορθώθηκε πρόβλημα όπου οι περιοχές αναβίωσης μερικών καταυλισμών ήταν πιο ψηλές από το ύψος του Torrent του Kunkka.",
      "[*] Διορθώθηκε πρόβλημα όπου, στη λειτουργία δοκιμής, το Tormentor αναβίωνε σε ανεπιθύμητες τοποθεσίες.",
      "[*] Το επίπεδο μάγευσης υπολογίζεται καλύτερα πλέον στις επεξηγήσεις ουδέτερων αντικειμένων.",
      "[*] Διορθώθηκε πρόβλημα όπου τα δέντρα του Iron Branch δεν παρείχαν εκτεταμένη διάρκεια θεραπείας όταν καταναλώνονταν με Tango.",
      "[*] Διορθώθηκε πρόβλημα όπου η χρήση του Ninja Gear υπό την επήρεια του Smoke of Deceit επέτρεπε την εκ νέου εφαρμογή του Smoke of Deceit στους συμμάχους σας.",
      "[*] Διορθώθηκε πρόβλημα όπου η ενεργοποίηση του Phylactery δεν επιβράδυνε τους εχθρούς.",
      "[*] Διορθώθηκε πρόβλημα όπου το Pirate Hat έκανε την επεξήγηση κόστους θανάτου να εμφανίζει ένα ελαφρώς λανθασμένο ποσό.",
      "[*] Διορθώθηκε πρόβλημα όπου το Pyrrhic Cloak επέστρεφε την αντανακλώμενη ζημιά.",
      "[*] Διορθώθηκε πρόβλημα όπου το Revenant's Brooch προκαλούσε περισσότερη ζημιά από την προβλεπόμενη σε ψευδαισθήσεις.",
      "[*] Διορθώθηκε πρόβλημα όπου το Scurry και το Death Pact μπορούσαν να έχουν περισσότερες φορτίσεις από τον μέγιστο αριθμό, αν γινόταν λήψη του αντίστοιχου ταλέντου μετά την αναβάθμιση της ικανότητας.",
      "[*] Διορθώθηκαν διάφορα προβλήματα με το Morph του Morphling.",
      "[*] Διορθώθηκαν διάφορα προβλήματα με το Winter's Curse της Winter Wyvern.",
      "[*] Διορθώθηκε πρόβλημα όπου το Magebane's Mirror του Anti-Mage δεν προκαλούσε μείωση της ενέργειας όταν ο εκτελεστής δεν είχε αρκετή ενέργεια να ξοδέψει.",
      "[*] Διορθώθηκε πρόβλημα όπου το Flux του Arc Warden με Aghanim's Scepter εξακολουθούσε ενίοτε να προκαλεί σιγή, ακόμα και αν το Flux είχε καταλυθεί.",
      "[*] Διορθώθηκε πρόβλημα όπου το Blueheart Floe της Crystal Maiden δεν αναβαθμιζόταν μαζί με το Freezing Field.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Dazzle δεν λάμβανε φορτίσεις Desolator, όταν σκότωνε ήρωες ενώ ταξίδευε στο Βασίλειο του Nothl.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Dazzle δεν λάμβανε φορτίσεις Urn of Shadows, όταν σκότωνε ήρωες ενώ ταξίδευε στο Βασίλειο του Nothl.",
      "[*] Διορθώθηκε πρόβλημα όπου το Aghanim's Shard του Dazzle δεν παρείχε ενίσχυση θεραπείας όσο βρισκόταν στο Βασίλειο του Nothl.",
      "[*] Διορθώθηκε πρόβλημα όπου, σε ορισμένες περιπτώσεις, το Nothl Projection του Dazzle δεν επωφελούνταν από τις αναβαθμίσεις ταλέντου του Poison Touch.",
      "[*] Διορθώθηκε πρόβλημα όπου, σε ορισμένες περιπτώσεις, το Nothl Projection του Dazzle παρείχε περισσότερα Town Portal Scroll από το επιθυμητό.",
      "[*] Διορθώθηκε πρόβλημα όπου το Nothl Projection του Dazzle έθετε το Aeon Disk σε επαναφόρτιση.",
      "[*] Διορθώθηκε πρόβλημα όπου το Nothl Projection του Dazzle έθετε το Refresher Orb σε επαναφόρτιση.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν αυξανόταν η διάρκεια απομείωσης του Poison Touch του Dazzle όταν χρησιμοποιούνταν πριν την εκτέλεση της απόλυτης ικανότητας (και το αντίστροφο).",
      "[*] Διορθώθηκε πρόβλημα όπου η ψυχή του Dazzle μπορούσε να χρησιμοποιήσει το Hand of Midas.",
      "[*] Διορθώθηκε πρόβλημα όπου τα ξόρκια και οι επιδράσεις ζημιάς διαρκείας του Corrosive Dragon του Dragon Knight παρεμποδίζονταν από το μπλοκάρισμα φυσικής ζημιάς.",
      "[*] Διορθώθηκε πρόβλημα όπου το Wyrm's Wrath του Dragon Knight εφάρμοζε απομειώσεις σε συμπαίκτες κατά την άρνηση.",
      "[*] Διορθώθηκε πρόβλημα όπου το Wyrm's Wrath του Dragon Knight με την όψη Fire Dragon προκαλούσε ακούσια ζημιά σε πύργους.",
      "[*] Διορθώθηκε πρόβλημα όπου το Wyrm's Wrath του Dragon Knight με την όψη Fire Dragon ενεργοποιούνταν δύο φορές ανά επίθεση όταν ήταν υπό τη μορφή δράκου.",
      "[*] Διορθώθηκε πρόβλημα όπου η επιπλέον περιοχή επίδρασης του Wyrm's Wrath του Dragon Knight με την όψη Fire Dragon δεν συσσωρευόταν με άλλες πηγές αύξησης της περιοχής επίδρασης.",
      "[*] Διορθώθηκε πρόβλημα όπου το ταλέντο επιπέδου 20 της Hoodwink για το Sharpshooter είχε τυφλά σημεία όρασης.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Invoker με Aghanim's Scepter λάμβανε περισσότερα επίπεδα Quas, Wex ή Exort από το προβλεπόμενο.",
      "[*] Διορθώθηκε πρόβλημα όπου το Tether του Io δεν θεράπευε στόχους που ήταν δεμένοι μαζί από ζημιά που προκαλούνταν με το Aghanim's Shard.",
      "[*] Διορθώθηκε πρόβλημα όπου το Earth Spike του Lion δεν επωφελούνταν από επαυξήσεις περιοχής επίδρασης, εάν η απόκτηση αυτών των επαυξήσεων γινόταν μετά την αναβάθμιση του Impale.",
      "[*] Διορθώθηκε πρόβλημα όπου οι κλώνοι του Monkey King έκλεβαν χρυσό με το Pirate Hat.",
      "[*] Διορθώθηκε πρόβλημα όπου το Adaptive Strike του Morphling με την όψη Flow δεν προκαλούσε σάστισμα σε στόχους, αν ο Morphling μεταμορφωνόταν καθώς το βλήμα βρισκόταν εν κινήσει.",
      "[*] Διορθώθηκε πρόβλημα όπου το φράγμα Shield Crash του Pangolier έθετε το Blink Dagger σε επαναφόρτιση, όταν το φράγμα μπλόκαρε τελείως τη ζημιά.",
      "[*] Διορθώθηκε πρόβλημα όπου, σε ορισμένες περιπτώσεις, δεν υπήρχε όριο στις συσσωρεύσεις του Ferocity του Primal Beast.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Rubick μπορούσε να συγκεντρώσει συσσωρεύσεις Arcane Accumulation από το End Projection του Nothl Projection.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Rubick με Aghanim's Scepter δεν λάμβανε την αναβάθμιση Aghanim's Scepter από ένα κλεμμένο Shackles.",
      "[*] Διορθώθηκε πρόβλημα όπου το Phase Shift του Puck μπορούσε να διακοπεί από ορισμένες εντολές.",
      "[*] Διορθώθηκε πρόβλημα όπου το Tricks of the Trade του Riki μπορούσε να διακοπεί από ορισμένες εντολές.",
      "[*] Διορθώθηκε πρόβλημα όπου το Minefield Sign των Techies με Aghanim's Scepter ενεργοποιούνταν κατά τη διάρκεια του χρόνου εκτέλεσης.",
      "[*] Διορθώθηκε πρόβλημα όπου το Meld της Templar Assassin με την όψη Hidden Reach χρειαζόταν περισσότερη ώρα από το προβλεπόμενο για να φτάσει στο μέγιστο βεληνεκές επίθεσης.",
      "[*] Διορθώθηκε πρόβλημα όπου το Killshot της Windranger σκότωνε ακαριαία εχθρούς σε ελαφρώς υψηλότερα όρια από τα καθορισμένα.",
      "[*] Διορθώθηκε πρόβλημα όπου το ταλέντο επιπέδου 25 της Windranger, «Οι σκοτωμοί με Focus Fire μειώνουν την επαναφόρτιση κατά 18 δευτ.», δεν λειτουργούσε σωστά.",
      "[/list]"
    ],
    "commentcount": 229,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 8567,
    "votedowncount": 966,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1746059227,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 8567,
  "votes_down": 966,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}