{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2 Güncellemesi - 21 Şubat 2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2 Güncellemesi - 21 Şubat 2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "Son birkaç gün içinde aşağıdaki sorunları çözdük:",
      "[list]",
      "[*] Yetenek Çekilişi'nde kahramanların doğal yeteneklerinin olmaması düzeltildi.",
      "[*] Turbo modunda Nilüfer Havuzu zamanlayıcılarının normal Dota oyun modu sürelerini göstermesi düzeltildi.",
      "[*] Mini harita simgelerinin oyunculara canlı izleyici sayısını göstermemesi düzeltildi.",
      "[*] Bazı kampların canlanma yerlerinin Kunkka'nın Torrent'inden daha yüksek olması düzeltildi.",
      "[*] Deneme modundayken İşkenceci'nin istenmeyen yerlerde ortaya çıkması düzeltildi.",
      "[*] Tarafsız eşya açıklamaları büyü seviyelerini daha iyi tahmin edecek.",
      "[*] Tango ile tüketildiğinde Iron Branch ağaçlarının uzun süreli iyileşme sağlamaması düzeltildi.",
      "[*] Smoke of Deceit etkisindeyken Ninja Gear kullanmanın dostlara tekrar Smoke of Deceit uygulanmasına izin vermesi düzeltildi.",
      "[*] Phylactery'nin etkinleştiğinde düşmanları yavaşlatmaması düzeltildi.",
      "[*] Pirate Hat eşyasından kaynaklanan ve ölüm bedeli açıklamasında yanlış tutarın gösterilmesine neden olan sorun düzeltildi.",
      "[*] Pyrrhic Cloak'un yansıtılan hasarı yansıtması düzeltildi.",
      "[*] Revenant's Brooch'un illüzyonlar üzerinde amaçlanandan daha fazla hasar vermesi düzeltildi.",
      "[*] Scurry ve Death Pact yeteneklerinin, ilgili hüner yetenek açıldıktan sonra alınmışsa, maksimum şarj sayısından daha fazlasına sahip olabildiği bir sorun düzeltildi.",
      "[*] Morphling'in Morph yeteneğiyle ilgili çeşitli sorunlar düzeltildi.",
      "[*] Winter Wyvern'ın Winter's Curse yeteneğiyle ilgili çeşitli sorunlar düzeltildi.",
      "[*] Anti-Mage'in Magebane's Mirror yükselticisinin kullananın harcayacak yeterli manası olmadığında mana azaltmaması düzeltildi.",
      "[*] Arc Warden'ın Aghanim's Scepter'lı Flux yeteneğinin etkisi geçirilmişse bile bazen susturmaya devam etmesi düzeltildi.",
      "[*] Crystal Maiden'ın Blueheart Floe yeteneğinin Freezing Field ile seviye atlamaması düzeltildi.",
      "[*] Dazzle'ın Nothl gezginiyken kahramanları öldürdüğünde Desolator şarjı almaması düzeltildi.",
      "[*] Dazzle'ın Nothl gezginiyken kahramanları öldürdüğünde Urn of Shadows şarjı almaması düzeltildi.",
      "[*] Dazzle Nothl âlemindeyken Aghanim's Shard'ın iyileştirme artırımı sağlamaması düzeltildi.",
      "[*] Dazzle'ın Nothl Projection yeteneğinin belirli durumlarda Poison Touch hüner yükseltmelerinden faydalanmaması düzeltildi.",
      "[*] Dazzle'ın Nothl Projection yeteneğinin belirli durumlarda istenenden daha fazla Town Portal Scroll vermesi düzeltildi.",
      "[*] Dazzle'ın Nothl Projection yeteneğinin Aeon Disk'i dolum süresine sokması düzeltildi.",
      "[*] Dazzle'ın Nothl Projection yeteneğinin Refresher Orb'u dolum süresine sokması düzeltildi.",
      "[*] Dazzle'ın Poison Touch yeteneği son yetenekten önce kullanıldığında (ve tam tersi durumda) zayıflatma süresinin artmaması düzeltildi.",
      "[*] Dazzle'ın ruhunun Hand of Midas'ı kullanabilmesi düzeltildi.",
      "[*] Dragon Knight'ın Corrosive Dragon büyülerinin ve zamanla hasar etkilerinin fiziksel hasar engellemeyle engellenmesi düzeltildi.",
      "[*] Dragon Knight'ın Wyrm's Wrath yeteneğinin reddetme sırasında takım arkadaşlarına zayıflatma uygulaması düzeltildi.",
      "[*] Dragon Knight'ın Fire Dragon yükselticisine sahip Wyrm's Wrath yeteneğinin kulelere hasar vermesi düzeltildi.",
      "[*] Dragon Knight'ın Fire Dragon yükselticisine sahip Wyrm's Wrath yeteneğinin Elder Dragon Form'dayken vuruş başına iki kez etkinleşmesi düzeltildi.",
      "[*] Dragon Knight'ın Fire Dragon yükselticisine sahip Wyrm's Wrath yeteneğinin etki alanı bonusunun diğer artırılmış etki alanı kaynaklarıyla istiflenmemesi düzeltildi.",
      "[*] Hoodwink'in Seviye 20 Sharpshooter hünerinin görüş yolunda kör noktalara sahip olması düzeltildi.",
      "[*] Invoker'ın Aghanim's Scepter ile amaçlanandan daha fazla Quas, Wex veya Exort seviyesi kazanması düzeltildi.",
      "[*] Io'nun Tether yeteneğinin, bağlı hedeflere Aghanim's Shard ile verilen hasarı iyileştirmemesi düzeltildi.",
      "[*] Lion'ın Earth Spike yeteneğinin, yetenek seviyesi yükseltildikten sonra elde edilen etki alanı bonuslarından faydalanmaması düzeltildi.",
      "[*] Monkey King klonlarının Pirate Hat ile altın çalması düzeltildi.",
      "[*] Morphling'in Flow yükselticisine sahip Adaptive Strike yeteneğinin, atış sırasında Morph kullanıldığında sersemletme uygulamaması düzeltildi.",
      "[*] Pangolier'in Shield Crash bariyerinin, hasarı tamamen engellediğinde Blink Dagger'ı dolum süresine sokması düzeltildi.",
      "[*] Belirli durumlarda Primal Beast'in sınırsız Ferocity istifine sahip olması düzeltildi.",
      "[*] Rubick'in Nothl Projection'ın End Projection alt yeteneğinden Arcane Accumulation istifi biriktirebilmesi düzeltildi.",
      "[*] Aghanim's Scepter'a sahip Rubick'in çaldığı Shackles yeteneğinden Aghanim's Scepter yükseltmesi almaması düzeltildi.",
      "[*] Puck'ın Phase Shift yeteneğinin belirli komutlar tarafından kesintiye uğraması düzeltildi.",
      "[*] Riki'nin Tricks of the Trade yeteneğinin belirli komutlar tarafından kesintiye uğraması düzeltildi.",
      "[*] Techies'in Aghanim's Scepter'lı Minefield Sign yeteneğinin kullanma zamanlaması sırasında tetiklenmesi düzeltildi.",
      "[*] Templar Assassin'in Hidden Reach yükselticisine sahip Meld yeteneğinin maksimum saldırı menziline ulaşmasının beklenenden daha uzun sürmesi düzeltildi.",
      "[*] Windranger'ın Killshot yükselticisine sahip Powershot yeteneğinin belirtilen eşik değerlerin biraz üstündeki hedefleri infaz etmesi düzeltildi.",
      "[*] Windranger'ın seviye 25 hüneri \"Focus Fire Leşleri Dolum Süresini 18 sn Azaltır\"ın düzgün çalışmaması düzeltildi.",
      "[/list]"
    ],
    "commentcount": 145,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 2276,
    "votedowncount": 235,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1740428955,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2275,
  "votes_down": 235,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}