{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Оновлення Dota 2 — 21 лютого 2025 року",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Оновлення Dota 2 — 21 лютого 2025 року",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "За останні дні ми виправили такі проблеми:",
      "[list]",
      "[*] Виправлено помилку, через яку в режимі Ability Draft у деяких героїв не було вроджених здібностей.",
      "[*] Виправлено таймери лотосів у турбо-режимі, які показували час для звичайного режиму.",
      "[*] Виправлено помилку, через яку піктограми на міні-мапі не показувалися під час перегляду без затримки очима гравця.",
      "[*] Виправлено помилку, через яку висота деяких таборів була зависокою для скиртування Струменем (Torrent) Кунки.",
      "[*] Виправлено помилку, через яку мучитель з’являвся в небажаних місцях у режимі демонстрації героя.",
      "[*] Підказки для нейтральних предметів тепер краще вказують на рівень зачарувань.",
      "[*] Виправлено помилку, через яку дерева від Залізної гілочки (Iron Branch), які були використані для танґо, давали звичайне лікування.",
      "[*] Виправлено помилку, через яку Приладдя ніндзя (Ninja Gear) дозволяло повторно застосувати Дим омани (Smoke of Deceit) на союзника, який уже був під його дією.",
      "[*] Виправлено помилку, через яку Філактерія (Phylactery) не сповільнювала ворогів після спрацювання.",
      "[*] Виправлено помилку, через яку підказка про втрату золота після смерті з Піратським капелюхом (Pirate Hat) показувала неправильну суму.",
      "[*] Виправлено помилку, через яку Піррова накидка (Pyrrhic Cloak) віддзеркалювала віддзеркалену шкоду.",
      "[*] Виправлено помилку, через яку ілюзії з Брошкою примари (Revenant's Brooch) завдавали більше шкоди, ніж потрібно.",
      "[*] Виправлено помилку, через яку Метушня (Scurry) та Смертельна угода (Death Pact) могли мати більше зарядів, ніж можливо, якщо талант на збільшення зарядів було вивчено після вивчення самої здібності.",
      "[*] Виправлено різні помилки, пов’язані з Морфом (Morph) Морфника.",
      "[*] Виправлено різні помилки, пов’язані з Прокляттям зими (Winter's Curse) Зимової Віверни.",
      "[*] Виправлено помилку, через яку грань Дзеркало губителя магів Антимага не спалювала ману ворога, якщо її було недостатньо.",
      "[*] Виправлено помилку, через яку Потік (Flux) Вартового зі Скіпетром Аґаніма міг застосовувати знемовлення навіть після розвіювання самого Потоку.",
      "[*] Виправлено помилку, через яку Крижина холодного серця (Blueheart Floe) Кришталевої Діви не збільшувала рівень разом із Морозним полем (Freezing Field).",
      "[*] Виправлено помилку, через яку Дазл не отримував заряди для Спустошувача (Desolator), якщо здійснював убивства під час дії Нотльської проекції (Nothl Projection).",
      "[*] Виправлено помилку, через яку Дазл не отримував заряди для Урни тіней (Urn of Shadows), якщо здійснював убивства під час дії Нотльської проекції (Nothl Projection).",
      "[*] Виправлено помилку, через яку Уламок Аґаніма у Дазла не збільшував лікування у королівстві Нотл.",
      "[*] Виправлено помилку, через яку Нотльська проекція (Nothl Projection) Дазла в деяких ситуаціях не отримувала переваг від покращення Отруйного дотику (Poison Touch) талантами.",
      "[*] Виправлено помилку, через яку Дазл міг у деяких ситуаціях отримати зайві портальні сувої (Town Portal Scrolls), якщо помирав у королівстві Нотл.",
      "[*] Виправлено помилку, через яку Дазл міг запустити зарядку Еонного диска (Aeon Disk) Нотльською проекцією (Nothl Projection).",
      "[*] Виправлено помилку, через яку Дазл міг запустити зарядку Сфери відновлення (Refresher Orb) Нотльською проекцією (Nothl Projection).",
      "[*] Виправлено помилку, через яку тривалість негативного ефекту від Отруйного дотику (Poison Touch) Дазла не збільшувалася, якщо його було застосовано до ультимативної здібності (і навпаки).",
      "[*] Виправлено помилку, через яку Дазл міг використовувати предмет Рука Мідаса (Hand of Midas) в королівстві Нотл.",
      "[*] Виправлено помилку, через яку отрута Лицаря-Дракона з гранню Ядучий дракон блокувалася ефектами блокування шкоди від фізичних атак.",
      "[*] Виправлено помилку, через яку Лицар-Дракон застосовував ефекти Гніву дракона (Wyrm's Wrath) на союзників, коли добивав їх.",
      "[*] Виправлено помилку, через яку ефекти від Гніву дракона (Wyrm's Wrath) Лицаря-Дракона з гранню Вогняний дракон завдавали магічну шкоду спорудам.",
      "[*] Виправлено помилку, через яку Гнів дракона (Wyrm's Wrath) Лицаря-Дракона з гранню Вогняний дракон завдавав магічну шкоду двічі за атаку у формі древнього дракона.",
      "[*] Виправлено помилку, через яку Гнів дракона (Wyrm's Wrath) Лицаря-Дракона з гранню Вогняний дракон не поєднувався з іншими джерелами збільшення області дії.",
      "[*] Виправлено помилку, через яку талант 20-го рівня Каптурниці давав огляд із проміжками.",
      "[*] Виправлено помилку, через яку Заклинач зі Скіпетром Аґаніма здобував більше рівнів Куасу, Вексу та Екзорту, ніж потрібно.",
      "[*] Виправлено помилку, через яку шкода від Прив’язі (Tether) Іо не лікувала з Уламком Аґаніма.",
      "[*] Виправлено помилку, через яку Земляні шипи (Earth Spike) Лайона не отримували переваг від збільшення області дії, якщо ці бонуси отримувалися після підвищення рівня Земляних шипів.",
      "[*] Виправлено помилку, через яку клони Мавпячого Короля з Піратським капелюхом (Pirate Hat) теж крали золото.",
      "[*] Виправлено помилку, через яку Адаптивний удар (Adaptive Strike) Морфника з гранню Приплив не приголомшував ціль, якщо під час польоту снаряду він застосував Морф (Morph).",
      "[*] Виправлено помилку, через яку бар’єр від Щитоламу (Shield Crash) Панґольєра ставив Стрибковий кинджал (Blink Dagger) на зарядку, коли бар’єр повністю блокував шкоду.",
      "[*] Виправлено помилку, через яку грань Жорстокість Первісного Звіра в деяких ситуаціях не мала обмеження на кількість ефектів.",
      "[*] Виправлено помилку, через яку Рубік міг здобувати бонуси грані Магічний збір, вручну завершуючи Нотльську проекцію (Nothl Projection) Дазла.",
      "[*] Виправлено помилку, через яку Рубік зі Скіпетром Аґаніма не отримував покращення до вкрадених Пут (Shackles).",
      "[*] Виправлено помилку, через яку деякі команди могли перервати Міжвимірний стрибок (Phase Shift) Пака.",
      "[*] Виправлено помилку, через яку деякі команди могли перервати Професійні хитрощі (Tricks of the Trade) Рікі.",
      "[*] Виправлено помилку, через яку Знак «Мінне поле» (Minefield Sign) зі Скіпетром Аґаніма починав працювати раніше часу.",
      "[*] Виправлено помилку, через яку Тамплієр-Убивця з гранню Таємний засяг занадто довго здобувала максимальний бонус до дальності атаки у Злитті (Meld).",
      "[*] Виправлено помилку, через яку Вітряна Рейнджер із гранню Вбивчий постріл убивала ворогів, здоров’я яких було дещо вище за поріг.",
      "[*] Виправлено помилку, через яку талант 25-го рівня Вітряної Рейнджер неправильно зменшував зарядку після вбивства.",
      "[/list]"
    ],
    "commentcount": 145,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 2256,
    "votedowncount": 232,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1740425408,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2256,
  "votes_down": 232,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}