{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualización de Dota 2 - 21/2/2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualización de Dota 2 - 21/2/2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "Abordamos los siguientes problemas en los últimos días:",
      "[list]",
      "[*] Se corrigió la selección de habilidades en héroes que no contaban con habilidades innatas.",
      "[*] Se corrigieron los temporizadores en las Fuentes de Loto que mostraban los tiempos comunes de juego en modo Turbo.",
      "[*] Se corrigieron los íconos del minimapa que no se mostraban a los espectadores en directo en modo vista del jugador.",
      "[*] Se corrigieron algunas zonas de regeneración en campamentos que eran más altas que la altura del Torrente de Kunkka.",
      "[*] Se corrigió la aparición del Torturador en ubicaciones indeseables al estar en modo Prueba de Héroe.",
      "[*] Las descripciones emergentes de los objetos neutrales son mejores adivinando el nivel de encantamiento.",
      "[*] Se corrigió que Árbol de Madera Férrea no proporcionara una mayor duración de curación al consumirse con Tango.",
      "[*] Se corrigió el uso de Equipamiento Ninja al estar en un área con humo, lo cual permitía volver a utilizar Humo del Engaño en tus aliados.",
      "[*] Se corrigió que Filacteria no ralentizaba a los enemigos al activarse.",
      "[*] Se corrigió Sombrero Pirata que provocaba que la descripción emergente sobre el costo por muerte mostrara una cantidad ligeramente incorrecta.",
      "[*] Se corrigió Capa Pírrica que reflejaba el daño reflejado.",
      "[*] Se corrigió Broche del Renacido en las ilusiones que infligen más daño del previsto.",
      "[*] Se corrigió un error en el que Escabullida y Pacto Mortal tendrían más que el número máximo de cargas si se tomaba el talento correspondiente después de que la habilidad fuera habilitada.",
      "[*] Se corrigieron varios problemas con Transformación de Morphling.",
      "[*] Se corrigieron varios problemas con Maldición del Invierno de Winter Wyvern.",
      "[*] Se corrigió Espejo de Magebane de Anti-Mage que no reducía el maná cuando el lanzador no tenía suficiente maná para usarlo.",
      "[*] Se corrigió Flujo con Cetro de Aghanim de Arc Warden que ocasionalmente continuaba silenciado, incluso si Flujo era disipado.",
      "[*] Se corrigió Flujo de Corazón Azul que no subía de nivel con Campo Congelante.",
      "[*] Se corrigió que Dazzle no recibiera cargas de Desoladora al matar héroes al estar en Viajero de Nothl.",
      "[*] Se corrigió que Dazzle no recibiera cargas de Urna de las Sombras al matar héroes al estar en Viajero de Nothl.",
      "[*] Se corrigió el Fragmento de Aghanim en Dazzle que no le proporcionaba amplificación de curación al estar en Reino de Nothl.",
      "[*] Se corrigió Proyección de Nothl de Dazzle que no se beneficiaba de Toque Venenoso en las mejoras de talento en ciertas situaciones.",
      "[*] Se corrigió Proyección de Nothl de Dazzle que otorgaba más Pergaminos de Teletransporte de los deseados en ciertas situaciones.",
      "[*] Se corrigió Proyección de Nothl que ponía al Disco del Eón en tiempo de recarga.",
      "[*] Se corrigió Proyección de Nothl que ponía a Orbe Vigorizante en tiempo de recarga.",
      "[*] Se corrigió que la duración del efecto negativo de Toque Venenoso de Dazzle no aumentaba cuando se usaba antes de lanzar la habilidad definitiva (y a la inversa).",
      "[*] Se corrigió el alma de Dazzle que podía usar Mano de Midas.",
      "[*] Se corrigió el bloqueo de daño físico que ya no bloquea los hechizos y el daño con el tiempo de Dragón Corrosivo de Dragon Knight.",
      "[*] Se corrigió Furia de Wyrm de Dragon Knight que aplicaba efectos negativos en los compañeros de equipo al denegar.",
      "[*] Se corrigió Furia de Wyrm de Dragon Knight con la faceta Dragón de Fuego que infligía daño involuntariamente a las torres.",
      "[*] Se corrigió Furia de Wyrm de Dragon Knight con la faceta Dragón de Fuego, que activaba dos golpes por lanzamiento al estar en Forma de Dragón Ancestral.",
      "[*] Se corrigió Furia de Wyrm de Dragon Knight con la faceta Dragón de Fuego, cuya área de efecto adicional no se acumulaba con otras fuentes de área de efecto aumentadas.",
      "[*] Se corrigió el talento de nivel 20 \"Tirador Certero\" de Hoodwink que tenía puntos ciegos en su campo de visión.",
      "[*] Se corrigió el Cetro de Aghanim para Invoker que obtenía más niveles de los previstos para Quas, Wex o Exort.",
      "[*] Se corrigió Vínculo de Io que no curaba a los objetivos vinculados del daño infligido con Fragmento de Aghanim.",
      "[*] Se corrigió Empalar de Lion que no se beneficiaba de las bonificaciones del área de efecto si ellas fueron adquiridas después de subir de nivel a Empalar.",
      "[*] Se corrigió que los clones de Monkey King robaran oro con Sombrero Pirata.",
      "[*] Se corrigió Golpe Adaptativo de Morphling con la faceta Flujo que no aturdía a los objetivos si Morphling se transformaba mientras el proyectil estaba en movimiento.",
      "[*] Se corrigió Salto Estruendoso de Pangolier que ponía Daga de Traslación en tiempo de recarga cuando la barrera bloqueaba por completo el daño.",
      "[*] Se corrigió que las acumulaciones de Ferocidad de Primal Beast no se limitaran en ciertas situaciones.",
      "[*] Rubick ya no puede obtener acumulaciones por Acumulación Arcana al finalizar Proyección de Nothl.",
      "[*] Cuando Rubick roba Ataduras con Cetro de Aghanim, ahora recibe la versión mejorada con el Cetro de Aghanim de esta habilidad.",
      "[*] Se corrigió el cambio de Fase de Puck que se interrumpía con ciertos comandos.",
      "[*] Se corrigió Secretos del Oficio de Riki que se interrumpía con ciertos comandos.",
      "[*] Se corrigió Señal de Campo de Minas de Techies con Cetro de Aghanim que se activaba con el punto de lanzamiento.",
      "[*] Se corrigió Fusión de Templar Assassin con Alcance Oculto que tomaba más de lo esperado al llegar al alcance de ataque máximo.",
      "[*] Se corrigió Muerte por Disparo de Windranger que asesinaba objetivos a umbrales ligeramente superiores a los establecidos.",
      "[*] El talento de nivel 25 de Windranger \"Víctimas de Fuego Concentrado adelantan la recarga 18 s\" ya funciona correctamente.",
      "[/list]"
    ],
    "commentcount": 229,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 8567,
    "votedowncount": 966,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1746059227,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 8567,
  "votes_down": 966,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}