{
  "gid": "521957873571334327",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2 – Atualização de 21 de fevereiro de 2025",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1740190800,
  "rtime32_end_time": 1740195001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1740190823
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1740190705
      }
    ],
    "clone_from_event_gid": "4442333890575598108",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "521957873571334328",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2 – Atualização de 21 de fevereiro de 2025",
    "posttime": 1740190829,
    "updatetime": 1740190829,
    "body": [
      "Ao longo dos últimos dias, corrigimos os seguintes problemas:",
      "[list]",
      "[*] Foi corrigido um problema que impedia os heróis de terem habilidades Inatas no modo de Seleção de Habilidades.",
      "[*] Foi corrigido um problema no modo Turbo, onde os temporizadores das Fontes de Lótus apresentavam os tempos usados no modo normal do Dota.",
      "[*] Foi corrigido um problema onde os ícones do minimapa não apareciam para espectadores na vista de jogador.",
      "[*] Foi corrigido um problema onde as \"spawnboxes\" de alguns acampamentos eram mais altas do que a altura da jorrada de água da habilidade Torrent (do Kunkka).",
      "[*] Foi corrigido um problema onde Tormentors podiam aparecer em locais indesejados no modo de demonstração.",
      "[*] Os textos descritivos de itens neutros deverão agora ser mais precisos quanto ao nível dos encantamentos.",
      "[*] Iron Branch: foi corrigido um problema onde árvores criadas com este item não curavam durante mais tempo depois de serem consumidas com um Tango.",
      "[*] Ninja Gear: foi corrigido um problema onde a utilização deste item enquanto sob o efeito de fumo permitia reaplicar Smoke of Deceit a aliados.",
      "[*] Phylactery: foi corrigido um caso onde a ativação deste item não abrandava inimigos.",
      "[*] Pirate Hat: foi corrigido um problema onde o item fazia com que o custo por morte mostrasse um valor ligeiramente incorreto.",
      "[*] Pyrrhic Cloak: foi corrigido um caso onde este item refletia dano refletido.",
      "[*] Revenant's Brooch: foi corrigido um problema onde os efeitos deste item causavam mais dano do que o pretendido contra ilusões.",
      "[*] Foi corrigido um problema onde as habilidades Scurry (da Hoodwink) e Death Pact (do Clinkz) podiam ter mais do que o número máximo de cargas se o talento correspondente fosse selecionado depois de a habilidade ter sido aprendida.",
      "[*] Morphling: foram corrigidos vários problemas com a habilidade Morph.",
      "[*] Winter Wyvern: foram corrigidos vários problemas com a habilidade Winter's Curse.",
      "[*] Anti-Mage: foi corrigido um problema onde a habilidade Magebane's Mirror não reduzia mana quando o utilizador não tinha mana suficiente.",
      "[*] Arc Warden: foi corrigido um problema com Flux + Aghanim's Scepter, que ainda silenciava ocasionalmente mesmo se os efeitos de Flux tivessem sido dissipados.",
      "[*] Crystal Maiden: foi corrigido um problema onde a habilidade Inata \"Blueheart Floe\" não subia de nível juntamente com Freezing Field.",
      "[*] Dazzle: foi corrigido um problema onde o Dazzle não recebia cargas de Desolator ao matar heróis enquanto sob o efeito de Nothl Projection.",
      "[*] Dazzle: foi corrigido um problema onde o Dazzle não recebia cargas de Urn of Shadows ao matar heróis enquanto sob o efeito de Nothl Projection.",
      "[*] Dazzle: foi corrigido um problema onde Aghanim's Shard não concedia amplificação de cura enquanto sob o efeito de Nothl Projection.",
      "[*] Dazzle's Nothl: foram corrigidos casos onde Nothl Projection não beneficiava de talentos que melhoram Poison Touch.",
      "[*] Dazzle: foi corrigido um problema com a habilidade Nothl Projection, que concedia mais Town Portal Scrolls do que o desejado.",
      "[*] Dazzle: foi corrigido um problema com a habilidade Nothl Projection, que fazia com que Aeon Disk entrasse em cooldown.",
      "[*] Dazzle: foi corrigido um problema com a habilidade Nothl Projection, que fazia com que Refresher Orb entrasse em cooldown.",
      "[*] Dazzle: foi corrigido um problema onde a duração do debuff de Poison Touch não era aumentada se a habilidade fosse usada antes do Ultimate (e vice‑versa).",
      "[*] Dazzle: foi corrigido um problema onde a alma do Dazzle podia usar o item Hand of Midas enquanto sob o efeito de Nothl Projection.",
      "[*] Dragon Knight - Corrosive Dragon: foi corrigido um bug que fazia com que os efeitos de habilidades e do dano ao longo do tempo fossem bloqueados por efeitos de bloqueio de dano físico.",
      "[*] Dragon Knight: foi corrigido um problema onde Wyrm's Wrath aplicava debuffs a companheiros de equipa após uma negação.",
      "[*] Dragon Knight - Fire Dragon: foi corrigido um problema onde Wyrm's Wrath causava dano não intencional a torres.",
      "[*] Dragon Knight - Fire Dragon: foi corrigido um problema onde Wyrm's Wrath se ativava duas vezes por golpe enquanto sob a forma de dragão.",
      "[*] Dragon Knight - Fire Dragon: foi corrigido um problema onde o aumento de áreas de efeito concedido por Wyrm's Wrath não se acumulava com outros aumentos de áreas de efeito.",
      "[*] Hoodwink: foi corrigido um problema com o talento de nível 20 \"Sharpshooter concede visão durante preparação\", onde havia pontos não visíveis no campo de visão.",
      "[*] Invoker: foi corrigido um problema onde Aghanim's Scepter concedia mais níveis do que o pretendido a Quas, Wex ou Exort.",
      "[*] Io: foi corrigido um problema com a habilidade Tether, que não curava aliados conectados com base no dano causado pela interação com Aghanim's Shard.",
      "[*] Lion: foi corrigido um caso onde Earth Spike não beneficiava de aumentos de áreas de efeito se esses efeitos tivessem sido adquiridos depois de aprender Earth Spike.",
      "[*] Monkey King: foi corrigido um problema onde clones também roubavam ouro com o item Pirate Hat.",
      "[*] Morphling - Flow: foi corrigido um problema onde Adaptive Strike não atordoava alvos se o Morphling usasse Morph enquanto o projétil ainda estava no ar.",
      "[*] Pangolier: foi corrigido um problema onde a barreira criada por Shield Crash fazia com que Blink Dagger entrasse em cooldown se a barreira bloqueasse o dano por completo.",
      "[*] Primal Beast: foram corrigidos casos onde não havia um limite no número de acumulações de Ferocity.",
      "[*] Rubick: foi corrigido um caso onde era possível gerar acumulações de Arcane Accumulation ao usar a sub‑habilidade que interrompe Nothl Projection.",
      "[*] Rubick: foi corrigido um problema na interação com Aghanim's Scepter, onde a versão roubada de Shackles não era a melhorada por Aghanim's Scepter.",
      "[*] Puck: foi corrigido um problema com a habilidade Phase Shift, que não era interrompida por certos comandos.",
      "[*] Riki: foi corrigido um problema com a habilidade Tricks of the Trade, que não era interrompida por certos comandos.",
      "[*] Techies: foi corrigido um problema onde os efeitos de Minefield Sign com Aghanim's Scepter eram ativados durante o tempo de conjuração.",
      "[*] Templar Assassin: foi corrigida a interação de Meld com a faceta Hidden Reach, que demorava mais do que o esperado a atingir o alcance de ataque máximo.",
      "[*] Windranger - Killshot: foi corrigido um problema onde a habilidade Powershot estava a matar instantaneamente alvos com vida um pouco acima dos limiares indicados.",
      "[*] Windranger: foi corrigido um problema com o talento de nível 25 \"Vítimas de Focus Fire avançam o cooldown em 18s\", que não estava a funcionar corretamente.",
      "[/list]"
    ],
    "commentcount": 80,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1740191446_0"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "601897008023769358",
    "event_gid": "521957873571334327",
    "voteupcount": 851,
    "votedowncount": 88,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "601897008023769358",
  "rtime32_last_modified": 1740234708,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1740191448,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 850,
  "votes_down": 87,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "601897008023769358",
  "clan_steamid_original": "103582791433224455"
}