{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Spilloppdatering 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Spilloppdatering 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Spilloppdatering 7.34d er ute nå. Se endringsloggen [url=https://www.dota2.com/patches/7.34d]her[/url]. ",
      "I løpet av de siste dagene har vi ordnet opp i flere spillproblemer:",
      "[list]",
      "[*] Fikset et område over fontenen til Radiant som helter kunne sette seg fast i.",
      "[*] Fikset at spillerperspektiv ikke alltid fungerte ordentlig som tilskuer.",
      "[*] Fikset flere problemer med illusjoner og hurtigtaster og kontrollgrupper.",
      "[*] Fikset at hurtigangrep ikke fungerte ordentlig når man trykket på toppfeltet i grensesnittet.",
      "[*] Fikset at å trykke på lotusvannet mange ganger på rad avbrøt kanaliseringen av lotusvannet.",
      "[*] Fikset inkonsekvente oppdateringer av kanaliseringsfeltet ved bruk av lotusvannet.",
      "[*] Fikset at skanningsknappen ikke viste gjenværende ladninger hvis det ikke var fullt.",
      "[*] Fikset at nedkjølingen til like gjenstander i oppakningen, som f.eks. Faerie Fire, av og til satte seg fast.",
      "[*] Fikset at partikkeleffektene til tvillingportene noen ganger avslørte bruken for fiender ved å spille av en partikkel ved helters sist kjente posisjon.",
      "[*] Fikset at Blade Mail ikke fungerte ordentlig på Nyx Assassin.",
      "[*] Fikset refleksjonsinteraksjonen til Lotus Orb med kanaliserte formler hvis den ble påført av en alliert.",
      "[*] Fikset at Specialist's Array påførte ekstra skade fra Crackshot når det kun fantes ett mål.",
      "[*] Fikset at effektene til Giant's Ring var synlige for fiender når brukeren var usynlig. La til et svekkelsesikon når man tar skade fra en fiendes Giant's Ring.",
      "[*] Fikset at bruk av Eul's Scepter på en svekkelsesimmun enhet førte til at de satte seg fast.",
      "[*] Fikset at Arc Wardens Tempest Double ikke beholdt begge ladningene av Hand of Midas når den ble tilkalt på nytt.",
      "[*] Fikset at Arc Wardens Tempest Double fikk ekstra erfaring fra kryp som berøves av fiender.",
      "[*] Fikset at Bounty Hunters Friendly Shadow (fra Aghanim's Shard) kostet for mye mana.",
      "[*] Fikset at Dawnbreakers Starbreaker ikke satte Harpoon på nedkjøling selv om den gjorde det for Echo Sabre.",
      "[*] Fikset at Dawnbreakers Solar Guardian av og til ble avbrutt hvis valgt alliert beveget seg ut av verden.",
      "[*] Fikset at Death Prophets frykt avbrøt kanalisering av formler gjennom svekkelsesimmunitet.",
      "[*] Fikset at Ember Spirit bare kunne bruke Sleight of Fist på høyre side ved bevegelse i Fire Remnant.",
      "[*] Fikset at Encantress' Little Friends ikke ble blokkert av Linken's Sphere.",
      "[*] Fikset at Shard-effekten til Invokers EMP ignorerte kollisjoner og lot enheter sette seg fast i hverandre.",
      "[*] Fikset at Kunkkas Torrent overstyrte målets animasjoner, selv om de var svekkelsesimmune.",
      "[*] Fikset visningen av Lichs talent for Chain Frost ved dødsfall i grensesnittet – styrkelsesikonet vises nå kun når du har talentet, og har nå et verktøytips.",
      "[*] Fikset at eieren til Lone Druids Spirit Bear ikke kunne demontere gjenstander på bjørnen.",
      "[*] Fikset interaksjonen til Lunas Aghanim's Shard med Silver Edge og Shadow Blade.",
      "[*] Fikset at Mars' Spear of Mars spiddet Lone Druids Spirit Bear.",
      "[*] Fikset et krasj forårsaket av Monkey Kings Mischief som fant sted når man avslørte treforkledningen til Monkey King samtidig med andre enheter. ",
      "[*] Fikset at Monkey Kings talent på nivå 25 for nødvendige treff med Jingu Mastery ikke ble påført på tilkalte soldater.",
      "[*] Fikset at oppgraderingen fra Aghanim's Scepter til Monkey Kings Wukong's Command ikke fungerte når Wukong's Command ikke er på nedkjøling.",
      "[*] Fikset at den fysiske formen til målet for Muertas Parting Shot kunne utføre handlinger hvis den fikk svekkelsesimmunitet.",
      "[*] Fikset at Pucks Dream Coil ble påvirket av statusresistens.",
      "[*] Fikset at effekten fra Pucks Dream Coil ble fjernet tidlig hvis en fiende ble påvirket av to ulike Dream Coil.",
      "[*] Fikset at skaden fra Queen of Pains Sonic Wave ikke ble påført fullstendig hvis brukt på et mål påvirket av Pulverize.",
      "[*] Fikset at Queen of Pains Sonic Wave av og til utførte en ekstra skadeforekomst, og ble avrundet feil når varigheten er påvirket av statusresistens.",
      "[*] Fikset at blindings-/hemmingseffekten til Sand Kings Sand Storm ble værende på stedet evnen opprinnelig ble brukt, heller enn å bevege seg.",
      "[*] Fikset at Slarks Pounce ble påført Lone Druids Spirit Bear.",
      "[*] Fikset at Templar Assassin av og til satte seg fast i usynlighet fra Meld hvis angrepsmålet ble ødelagt. ",
      "[*] Fikset at Treant Protector mistet styrkelsen fra Nature's Guise når han tok skade mens han beveget seg på Nature's Grasp. Har nå samme atferd som ved bevegelse i trær.",
      "[*] Fikset at Troll Warlord av og til kunne kontrolleres under Battle Trance.",
      "[*] Fikset at Vengeful Spirit fikk udødelighet fra fontenen hvis hun byttet plass med illusjonen fra Aghanim's Scepter utenfor fontenen.",
      "[*] Fikset interaksjonen til Vengeful Spirits Magic Missile (med Aghanim's Shard) med effekter som nullstiller nedkjøling og reflekterer skade.",
      "[*] Fikset at oppgraderingen fra Aghanim's Scepter for Warlocks Chaotic Offering skapte golemer uten reduserte attributter hvis Warlock flytter Aghanim's Scepter til ryggsekken under bruk.",
      "[*] Fikset at Shard av og til forårsaket at Weavers usynlighet fra Shukuchi ble fordrevet, særlig med talentet «Geminate Attack: +1 angrep» på nivå 25.",
      "[*] Fikset at Windranger noen ganger avbrøt angrep under bruk av Windrun etter Focus Fire med Aghanim's Scepter. ",
      "[*] Fikset at Wraith King ble nedlesset med «Kan ikke angripe» hvis et av skjelettene hans blir avvæpnet.",
      "[*] Fikset at Zeus' Lightning Hands ble påvirket av fordrivelser.",
      "[*] Fikset at Miranas talent på nivå 25 førte opp feil verdi for ekstra skade til Starstorm.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}