{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "แพตช์เกมเพลย์ 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "แพตช์เกมเพลย์ 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "แพตช์ 7.34d ออกเผยแพร่แล้ว คุณสามารถอ่านรายละเอียดได้[url=https://www.dota2.com/patches/7.34d]ที่นี่[/url] ",
      "ในช่วงสองสามวันที่ผ่านมา เราได้แก้ไขหลายปัญหาในเกมเพลย์ดังต่อไปนี้:",
      "[list]",
      "[*] แก้ไขพื้นที่เหนือน้ำพุ Radiant ที่ฮีโร่อาจติดค้างอยู่ได้",
      "[*] แก้ไขมุมมองของผู้เล่นที่บางครั้งทำงานไม่ถูกต้องเมื่อรับชม",
      "[*] แก้ไขปัญหาหลายอย่างเกี่ยวกับร่างเงา ปุ่มลัด และกลุ่มควบคุม",
      "[*] แก้ไขที่การโจมตีอย่างรวดเร็วทำงานไม่ถูกต้องเมื่อคลิกที่แถบด้านบนของ HUD",
      "[*] แก้ไขเมื่อคลิก Lotus Pool หลายครั้งติดต่อกันอย่างรวดเร็วจะขัดการยืนร่าย Lotus Pool",
      "[*] แก้ไขแถบยืนร่ายอัปเดตไม่สม่ำเสมอเมื่อทำงานกับ Lotus Pool",
      "[*] แก้ไขปุ่มสแกนไม่แสดงชาร์จที่เหลืออยู่หากชาร์จไม่เต็ม",
      "[*] แก้ไขคูลดาวน์ของไอเท็มที่ซ้ำกันในช่องเก็บของ เช่น Faerie Fire ที่บางครั้งจะไม่นับเวลาคูลดาวน์",
      "[*] แก้ไขเอฟเฟกต์อนุภาค Twin Gate บางครั้งเผยให้เห็นการกดใช้ต่อศัตรูโดยการแสดงอนุภาคในตำแหน่งฮีโร่สุดท้ายที่ทราบ",
      "[*] แก้ไข Blade Mail ทำงานไม่ถูกต้องเมื่อถือโดย Nyx Assassin",
      "[*] แก้ไขการทำงานสะท้อนของ Lotus Orb กับสกิลยืนร่ายหากสกิลร่ายโดยเพื่อนร่วมทีม",
      "[*] แก้ไขที่ Specialist's Array เพิ่มความเสียหายโบนัส Crackshot เมื่อมีเป้าหมายเดียว",
      "[*] แก้ไขที่ศัตรูมองเห็นเอฟเฟกต์ Giant's Ring เมื่อผู้สวมใส่ล่องหน เพิ่มไอคอนดีบัฟเมื่อได้รับความเสียหายจาก Giant's Ring ของศัตรู",
      "[*] แก้ไขที่การใช้ Eul's Scepter บนยูนิตที่ป้องกันดีบัฟทำให้เกิดการติดค้าง",
      "[*] แก้ไข Tempest Double ของ Arc Warden ไม่เก็บรักษา Hand of Midas ทั้ง 2 ชาร์จหากอัญเชิญร่างขึ้นมาใหม่",
      "[*] แก้ไขที่ Tempest Double ของ Arc Warden ได้รับค่าประสบการณ์จากครีปที่ถูก Deny โดยศัตรู",
      "[*] แก้ไข Friendly Shadow ที่อัปเกรดโดย Aghanim's Shard ของ Bounty Hunter ใช้มานามากกว่าปกติ",
      "[*] แก้ไข Starbreaker ของ Dawnbreaker ไม่ทำให้ Harpoon ติดคูลดาวน์เหมือนกับ Echo Sabre",
      "[*] แก้ไข Solar Guardian ของ Dawnbreaker บางครั้งได้รับการยกเลิกหากเพื่อนร่วมทีมเป้าหมายออกจากแผนที่",
      "[*] แก้ไขที่ระยะเวลาหวาดกลัวของ Death Prophet ขัดจังหวะสกิลยืนร่ายโดยทะลุการป้องกันดีบัฟ",
      "[*] แก้ไข Ember Spirit สามารถร่าย Sleight of Fist ทางด้านขวาเท่านั้นขณะพุ่งอยู่ในร่าง Fire Remnant",
      "[*] แก้ไข Little Friends ของ Enchantress ไม่ถูกบล็อคโดย Linken's Sphere",
      "[*] แก้ไขเอฟเฟกต์ Aghanim's Shard สกิล EMP ของ Invoker ไม่สนขนาดการชนกันของยูนิตและทำให้ยูนิตติดกันได้",
      "[*] แก้ไขที่ Torrent ของ Kunkka ทับแอนิเมชันของเป้าหมาย แม้ว่าจะเป็นเป้าหมายที่ป้องกันดีบัฟก็ตาม",
      "[*] แก้ไขการแสดงทักษะพิเศษร่าย Chain Frost เมื่อตายของ Lich บน HUD ซึ่งต่อจากนี้ไอคอนบัฟจะแสดงเมื่อคุณมีทักษะพิเศษเท่านั้น และจะมีคำอธิบายประกอบ",
      "[*] แก้ไขที่เจ้าของ Spirit Bear ของ Lone Druid ไม่สามารถแยกชิ้นส่วนไอเท็มบน Spirit Bear ได้",
      "[*] แก้ไขการทำงานระหว่าง Aghanim's Shard ของ Luna กับ Silver Edge และ Shadow Blade",
      "[*] แก้ไข Spear of Mars ของ Mars เสียบ Spirit Bear ของ Lone Druid",
      "[*] แก้ไขการแครชที่เกิดจาก Mischief ของ Monkey King ซึ่งเกิดขึ้นเมื่อเปิดเผย Monkey King ในร่างปลอมเป็นต้นไม้พร้อมกับยูนิตอื่นในเวลาเดียวกัน ",
      "[*] แก้ไขทักษะพิเศษเลเวล 25 ของ Monkey King: Jingu Mastery ไม่ลดจำนวนครั้งที่ต้องโจมตีของพลทหารที่อัญเชิญ",
      "[*] แก้ไข Wukong's Command ที่อัปเกรดโดย Aghanim's Scepter ของ Monkey King ไม่ทำงานเมื่อ Wukong's Command ติดคูลดาวน์",
      "[*] แก้ไข Parting Shot ของ Muerta ร่างหลักสามารถออกคำสั่งได้หากได้รับการป้องกันดีบัฟ",
      "[*] แก้ไข Dream Coil ของ Puck ได้รับผลจากความต้านทานสถานะ",
      "[*] แก้ไขเอฟเฟกต์ Dream Coil ของ Puck สิ้นสุดลงก่อนกำหนดหากศัตรูได้รับผลจาก Dream Coil 2 อันแยกต่างหากกัน",
      "[*] แก้ไข Sonic Wave ของ Queen of Pain ไม่สร้างความเสียหายเต็มจำนวนหากร่ายใส่เป้าหมายที่ได้รับผลจาก Pulverize",
      "[*] แก้ไข Sonic Wave ของ Queen of Pain บางครั้งสร้างความเสียหายมากกว่าปกติ และคำนวณปัดเศษไม่ถูกต้องหากระยะเวลาสกิลได้รับผลจากความต้านทานสถานะ",
      "[*] แก้ไขเอฟเฟกต์โจมตีพลาด/ลดความเร็ว Sand Storm ของ Sand King คงอยู่ในตำแหน่งร่ายเริ่มต้นแทนที่จะเคลื่อนที่ตามไปด้วย",
      "[*] แก้ไข Pounce ของ Slark ส่งผลต่อ Spirit Bear ของ Lone Druid",
      "[*] แก้ไข Templar Assassin บางครั้งติดอยู่ในสถานะล่องหนของ Meld หากเป้าหมายการโจมตีถูกทำลาย ",
      "[*] แก้ไข Treant Protector สูญเสียบัฟ Nature's Guise หากได้รับความเสียหายขณะเดินอยู่บน Nature's Grasp โดยต่อจากนี้จะมีพฤติกรรมเหมือนกับเมื่อเดินไปตามต้นไม้",
      "[*] แก้ไข Troll Warlord บางครั้งสามารถควบคุมได้ในระหว่าง Battle Trance",
      "[*] แก้ไข Vengeful Spirit ได้รับสถานะอมตะจากบ่อน้ำพุ หากเธอสลับตำแหน่งกับร่างเงา Aghanim's Scepter ของเธอนอกบ่อน้ำพุ",
      "[*] แก้ไขการทำงานระหว่าง Magic Missile ที่อัปเกรดโดย Aghanim's Shard ของ Vengeful Spirit กับการล้างคูลดาวน์และการสะท้อนสกิล",
      "[*] แก้ไข Chaotic Offering ที่อัปเกรดโดย Aghanim's Scepter ของ Warlock สร้างโกเลมโดยไม่มีค่าสถานะลดลงหาก Warlock ย้าย Scepter ของเขาเข้าไปในกระเป๋าระหว่างร่าย",
      "[*] แก้ไข Aghanim's Shard บางครั้งทำให้สถานะล่องหน Shukuchi ของ Weaver ถูกลบล้างได้ โดยเฉพาะอย่างยิ่งเมื่อมีทักษะพิเศษเลเวล 25 จำนวนการโจมตี Geminate +1 ครั้ง",
      "[*] แก้ไข Windranger บางครั้งยกเลิกการโจมตีเมื่อร่าย Windrun หลัง Focus Fire ที่อัปเกรดโดย Aghanim's Scepter ",
      "[*] แก้ไข Wraith King ได้รับข้อความ \"ไม่สามารถโจมตี\" หลายครั้งติดต่อกันหากหนึ่งในโครงกระดูกของเขาถูกปลดอาวุธ",
      "[*] แก้ไข Lightning Hands ของ Zeus ได้รับผลจากการลบล้างต่าง ๆ",
      "[*] แก้ไขที่ทักษะพิเศษเลเวล 25 ของ Mirana ระบุค่าที่ไม่ถูกต้องสำหรับความเสียหาย Starstorm",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}