{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Обновление 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Обновление 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Игра обновлена до версии 7.34d. Список изменений можно найти [url=https://www.dota2.com/patches/7.34d]здесь[/url]. ",
      "За недавнее время мы исправили несколько ошибок:",
      "[list]",
      "[*] Исправлена ошибка, из-за которой герои могли застрять в области над фонтаном сил Света.",
      "[*] Исправлена ошибка, из-за которой наблюдение глазами игрока иногда работало неправильно.",
      "[*] Исправлены ошибки, связанные с иллюзиями, горячими клавишами и подконтрольными группами.",
      "[*] Исправлена ошибка, из-за которой быстрая атака работала неправильно при нажатии на верхнюю панель интерфейса.",
      "[*] Исправлена ошибка, из-за которой многократное нажатие на пруд лотосов прерывало их получение.",
      "[*] Теперь при взаимодействии с прудом лотосов полоса применения обновляется правильно.",
      "[*] Исправлена ошибка, из-за которой на кнопке сканирования не отображались оставшиеся заряды, если их было меньше максимума.",
      "[*] Исправлена ошибка, из-за которой перезарядка копий складывающихся предметов (таких как Faerie Fire) иногда могла остановиться.",
      "[*] Исправлена ошибка, из-за которой можно было понять, что вражеский герой воспользовался Парным порталом, потому что на последнем месте, где героя видели, появлялся эффект телепортации.",
      "[*] Исправлена ошибка, из-за которой предмет Blade Mail неправильно работал у Nyx Assassin.",
      "[*] Исправлена ошибка, связанная с взаимодействием предмета Lotus Sphere и прерываемых способностей союзников.",
      "[*] Исправлена ошибка, из-за которой Crackshot у Specialist's Array увеличивала урон даже при атаке одной цели.",
      "[*] Исправлена ошибка, из-за которой эффекты предмета Giant's Ring были видны врагам, когда владелец был невидим. Добавлена иконка для отрицательного эффекта, обозначающего получение урона от предмета Giant's Ring.",
      "[*] Исправлена ошибка, из-за которой Eul's Scepter of Divinity можно было применять на невосприимчивые к эффектам цели, отчего они застревали.",
      "[*] Исправлена ошибка, из-за которой при повторном призыве копии Arc Warden у неё не сохранялись оба заряда предмета Hand of Midas.",
      "[*] Исправлена ошибка, из-за которой копия Tempest Double у Arc Warden получала опыт за не отданных врагами крипов.",
      "[*] Исправлена ошибка, из-за которой способность Friendly Shadow у Bounty Hunter расходовала слишком много маны.",
      "[*] Исправлена ошибка, из-за которой применение способности Starbreaker у Dawnbreaker не запускало перезарядку предмета Harpoon (как это происходит с Echo Sabre).",
      "[*] Исправлена ошибка, из-за которой применение способности Solar Guardian у Dawnbreaker иногда отменялось, если на выбранного целью союзника наложили эффект изгнания.",
      "[*] Исправлена ошибка, из-за которой страх от Spirit Siphon у Death Prophet с Aghanim's Shard мог останавливать прерываемые заклинания сквозь невосприимчивость к эффектам.",
      "[*] Исправлена ошибка, из-за которой летящий к своей копии Ember Spirit мог применять способность Sleight of Fist только вправо.",
      "[*] Исправлена ошибка, из-за которой способность Little Friends у Enchantress не блокировалась предметом Linken's Sphere.",
      "[*] Исправлена ошибка, из-за которой жертвы способности E.M.P. у Invoker с Aghanim's Shard игнорировали правила столкновений и могли застрять друг в друге",
      "[*] Исправлена ошибка, из-за которой Torrent у Kunkka меняла анимации у попавшихся врагов, даже если они невосприимчивы к эффектам.",
      "[*] Исправлено отображение таланта «Применение Chain Frost при смерти» в интерфейсе: теперь иконка эффекта отображается только при изучении этого таланта и имеет описание.",
      "[*] Исправлена ошибка, из-за которой владелец духа-медведя от Spirit Bear не мог разбирать его предметы.",
      "[*] Исправлено взаимодействие эффекта Aghanim's Shard у Luna с предметами Silver Edge и Shadow Blade.",
      "[*] Исправлена ошибка, из-за которой копьём от Spear of Mars у Mars можно было пригвоздить духа-медведя у Lone Druid.",
      "[*] Исправлена ошибка, приводившая к сбою, когда замаскировавшийся под дерево Monkey King попадал в обзор одновременно с другими существами. ",
      "[*] Исправлена ошибка, из-за которой талант 25 уровня для способности Jingu Mastery у Monkey King не действовал на призываемых солдат.",
      "[*] Исправлена ошибка, из-за которой эффект Aghanim's Scepter для способности Wukong's Command у Monkey King не действовал, когда она не перезаряжалась.",
      "[*] Исправлена ошибка, из-за которой физическое тело у цели способности Parting Shot у Muerta могло действовать, получив невосприимчивость к эффектам.",
      "[*] Исправлена ошибка, из-за которой на эффект способности Dream Coil у Puck влияло сопротивление эффектам.",
      "[*] Исправлена ошибка, из-за которой применённая дважды способность Dream Coil у Puck переставала действовать на жертву раньше нужного.",
      "[*] Исправлена ошибка, из-за которой урон от способности Sonic Wave у Queen of Pain наносился не полностью, если жертва находилась под эффектом способности Pulverize.",
      "[*] Исправлена ошибка, из-за которой Sonic Wave у Queen of Pain наносила увеличенный урон и имела неправильное округление, если длительность отталкивания уменьшалась сопротивлением к эффектам.",
      "[*] Исправлена ошибка, из-за которой эффект ослепления и замедления от таланта у Sand King оставался на месте первоначального применения Sand Storm, а не перемещался вместе с бурей.",
      "[*] Исправлена ошибка, из-за которой способность Pounce у Slark действовала на духа-медведя у Lone Druid.",
      "[*] Исправлена ошибка, из-за которой Templar Assassin не выходила из невидимости от способности Meld, если цель атаки была уничтожена. ",
      "[*] Исправлена ошибка, из-за которой Treant Protector терял эффект Nature's Guise, когда получал урон на лозах от способности Nature's Grasp. Теперь принцип действия такой же, как в деревьях.",
      "[*] Исправлена ошибка, из-за которой Troll Warlord под действием способности Battle Trance иногда позволял игроку управлять собой.",
      "[*] Исправлена ошибка, из-за которой Vengeful Spirit получала неуязвимость от фонтана за его пределами при воскрешении на месте иллюзии от Aghanim's Scepter.",
      "[*] Исправлена ошибка, связанная с взаимодействием Magic Missile у Vengeful Spirit и заклинаниями, сбрасывающими перезарядки и отражающими способности.",
      "[*] Исправлена ошибка, из-за которой способностью Chaotic Offering у Warlock можно было создать двух големов без уменьшенных характеристик, если во время применения способности убрать предмет Aghanim's Scepter в ранец.",
      "[*] Исправлена ошибка, из-за которой иногда невидимость от Shukuchi у Weaver с Aghanim's Shard могла развеяться сама, особенно с талантом 25 уровня на дополнительную атаку от Geminate Attack.",
      "[*] Исправлена ошибка, из-за которой Windranger переставала атаковать цель способности Focus Fire, применив Windrun с Aghanim's Scepter. ",
      "[*] Исправлена ошибка, из-за которой игрок Wraith King видел кучу ошибок о невозможности атаковать, когда на одного из его скелетов накладывали бессилие.",
      "[*] Исправлена ошибка, из-за которой эффект способности Lightning Hands у Zeus можно было развеять.",
      "[*] Исправлена ошибка, из-за которой у Mirana на таланте 25 уровня отображался неправильный бонус к урону от Starstorm.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}