{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Speluppdatering 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Speluppdatering 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Uppdatering 7.34d är ute nu. Kolla in uppdateringsanteckningarna [url=https://www.dota2.com/patches/7.34d]här[/url]. ",
      "Under de senaste dagarna har vi tagit itu med flera problem i spelet:",
      "[list]",
      "[*] Åtgärdade ett område ovanför Radiant-fontänen som hjältar kunde fastna i.",
      "[*] Åtgärdade att spelarperspektivet inte alltid fungerade för åskådare.",
      "[*] Åtgärdade flera problem med illusioner, snabbtangenter och kontrollgrupper.",
      "[*] Åtgärdade att snabbattacker inte fungerade korrekt när man klickade i det övre fältet i HUD:n.",
      "[*] Åtgärdade att kanaliseringen av lotusdammen avbröts när man klickade på den flera gånger i snabb följd.",
      "[*] Åtgärdade inkonsekventa uppdateringar av kanaliseringsfältet vid interaktion med lotusdammen.",
      "[*] Åtgärdade att skanningsknappen inte visade återstående laddningar om den inte var full.",
      "[*] Åtgärdade att cooldown av dubbletter i förrådet, som till exempel Faerie Fire, ibland fastnade.",
      "[*] Åtgärdade att partikeleffekter från tvillingportarna ibland avslöjade för fienden att de användes genom att lämna en partikel på den senaste platsen en hjälte befann sig på.",
      "[*] Åtgärdade att Blade Mail inte fungerade korrekt på Nyx Assassin.",
      "[*] Åtgärdade Lotus Orbs reflektionsinteraktion med kanaliserade förmågor om den tillämpades av en allierad.",
      "[*] Åtgärdade att Specialist's Array applicerade bonusskada från Crackshot när det bara fanns ett mål.",
      "[*] Åtgärdade att Giant's Ring-effekterna var synliga för fiender när användaren var osynlig. Lade till en debuffikon när man tar skada från en fiendes Giant's Ring.",
      "[*] Åtgärdade att användning av Eul's Scepter på en enhet som är immun mot debuffar ledde till att de fastnade.",
      "[*] Åtgärdade att Arc Wardens Tempest Double inte behöll båda laddningarna från Hand of Midas när den blev framkallad på nytt.",
      "[*] Åtgärdade att Arc Wardens Tempest Double fick extra XP från creeps som nekades av fiender.",
      "[*] Åtgärdade att Bounty Hunters Friendly Shadow med Aghanim's Shard kostade för mycket mana.",
      "[*] Åtgärdade att Dawnbreakers Starbreaker inte satte Harpoon på cooldown, men gjorde det för Echo Sabre.",
      "[*] Åtgärdade att Dawnbreakers Solar Guardian ibland avbröts om den valda allierade lämnade banan.",
      "[*] Åtgärdade att Death Prophets rädsla avbröt kanalisering av förmågor genom debuffimmunitet.",
      "[*] Åtgärdade att Ember Spirit bara kunde använda Sleight of Fist på högra sidan när han förflyttade sig i Fire Remnant.",
      "[*] Åtgärdade att Enchantress Little Friends inte blockerades av Linken's Sphere.",
      "[*] Åtgärdade att Shard-effekten för Invokers EMP ignorerade kollisioner och lät enheter sätta sig fast i varandra.",
      "[*] Åtgärdade att Kunkka Torrent åsidosatte målets animationer, även om de var immuna mot debuffar.",
      "[*] Åtgärdade att Lichs talang Chain Frost vid dödsfall visades i HUD. Buffikonen visas nu bara när man har talangen och har nu ett verktygstips",
      "[*] Åtgärdade att ägaren av Lone Druids Spirit Bear inte kunde ta isär föremål på björnen.",
      "[*] Åtgärdade interaktionen för Lunas Aghanim's Shard med Silver Edge och Shadow Blade.",
      "[*] Åtgärdade att Mars Spear of Mars spetsade Lone Druids Spirit Bear.",
      "[*] Åtgärdade en krasch som förorsakades av Monkey Kings Mischief, som skedde när man avslöjade Monkey Kings trädförklädning tillsammans med andra enheter. ",
      "[*] Åtgärdade att Monkey Kings talang på nivå 25 för nödvändig träff med Jingu Mastery inte applicerades på framkallade soldater.",
      "[*] Åtgärdade att Monkey Kings Wukong's Command med Aghanim's Scepter-uppgradering inte fungerade när  Wukong's Command inte längre var på cooldown.",
      "[*] Åtgärdade att den fysiska formen för målet för Muertas Parting Shot kunde agera om det fick debuffimmunitet.",
      "[*] Åtgärdade att Pucks Dream Coil påverkades av statusresistens.",
      "[*] Åtgärdade att Pucks Dream Coil-effekt togs bort tidigt om en fiende påverkades av två olika Dream Coil.",
      "[*] Åtgärdade att Queen of Pains skada med Sonic Wave inte applicerades helt om det användes på ett mål påverkat av Pulverize.",
      "[*] Åtgärdade att Queen of Pains Sonic Wave ibland gjorde extra skada, samt blev felaktigt avrundad när varaktigheten var påverkad av statusresistens.",
      "[*] Åtgärdade att förblindnings-och nedsaktningseffekten för Sand Kings Sand Storm stannade på platsen där förmågan användes istället för flytta sig.",
      "[*] Åtgärdade att Slarks Pounce applicerades på Lone Druids Spirit Bear.",
      "[*] Åtgärdade att Templar Assassin ibland fastnade i osynlighet från Meld ifall attackmålet blev förstört. ",
      "[*] Åtgärdade att Treant Protector förlorade buffen från Nature Guise när han tog skada medan han förflyttade sig på Nature's Grasp. Har nu samma beteende som vid förflyttning i träd.",
      "[*] Åtgärdade att Troll Warlord ibland kunde kontrolleras under Battle Trance.",
      "[*] Åtgärdade att Vengeful Spirit fick Fountain Invulnerability om hon bytte plats med sin Aghanim's Scepter-illusion utanför fontänen.",
      "[*] Åtgärdade interaktionen mellan Vengeful Spirits Magic Missile (med Aghanim's Shard) och Refreshing och Reflection.",
      "[*] Åtgärdade att uppgraderingen med Aghanim's Scepter för Warlocks Chaotic Offering skapade golems utan reducerade attribut om Warlock lade sin Scepter i ryggsäcken under användningen.",
      "[*] Åtgärdade att Aghanim's Shard ibland gjorde att Weavers osynlighet från Shukuchi blev avbruten, särskilt med nivå 25-talangen Germinate Attack: +1 extra attack.",
      "[*] Åtgärdade att Windranger ibland avbröt attacker vid användning av Windrun efter Focus Fire med Aghanim's Scepter. ",
      "[*] Åtgärdade att Wraith King blev bombarderad med ”Kan inte attackera”-meddelanden om ett av hans skelett avväpnades.",
      "[*] Åtgärdade att Zeus Lightning Hands påverkades av dispels.",
      "[*] Åtgärdade att Miranas nivå 25-talang visade fel värde för bonusskada från Starstorm.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}