{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Ενημέρωση παιχνιδιού 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Ενημέρωση παιχνιδιού 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Η ενημέρωση 7.34d κυκλοφόρησε. Μπορείτε να ρίξετε μια ματιά στις σημειώσεις [url=https://www.dota2.com/patches/7.34d]εδώ[/url]. ",
      "Τις τελευταίες ημέρες διορθώσαμε πολλά προβλήματα παιχνιδιού:",
      "[list]",
      "[*] Διορθώθηκε η περιοχή πάνω από το σιντριβάνι των Radiant, όπου μπορούσαν να κολλήσουν οι ήρωες.",
      "[*] Διορθώθηκε η όψη παίκτη που δεν λειτουργούσε μερικές φορές σωστά κατά την παρακολούθηση.",
      "[*] Διορθώθηκαν διάφορα προβλήματα με τις ψευδαισθήσεις, τα πλήκτρα και τις ομάδες ελέγχου.",
      "[*] Διορθώθηκε η γρήγορη επίθεση που δεν λειτουργούσε σωστά, όταν γινόταν κλικ στην πάνω μπάρα της διεπαφής.",
      "[*] Διορθώθηκε η διακοπή της διοχέτευσης στο σιντριβάνι λωτών, όταν γίνονταν κλικ πάνω του πολλές φορές.",
      "[*] Διορθώθηκαν οι ασυνεπείς ενημερώσεις της μπάρας διοχέτευσης κατά την αλληλεπίδραση με το σιντριβάνι λωτών.",
      "[*] Διορθώθηκε το κουμπί σάρωσης που δεν εμφάνιζε τις υπόλοιπες φορτίσεις, όταν δεν ήταν πλήρες.",
      "[*] Διορθώθηκε το περιστασιακό «κόλλημα» των επαναφορτίσεων στα διπλότυπα αντικείμενα στη λίστα αντικειμένων, όπως το Faerie Fire.",
      "[*] Διορθώθηκαν τα εφέ σωματιδίων των Δίδυμων Πυλών που μερικές φορές αποκάλυπταν τη χρήση τους στους εχθρούς, με αναπαραγωγή ενός σωματιδίου στην τελευταία γνωστή θέση του ήρωα.",
      "[*] Διορθώθηκε το Blade Mail που δεν λειτουργούσε σωστά στον Nyx Assassin.",
      "[*] Διορθώθηκε η αλληλεπίδραση της αντανάκλασης του Lotus Orb με διοχετεύσεις ξορκιών, όταν εφαρμόζονταν από κάποιον σύμμαχο.",
      "[*] Διορθώθηκε το Specialist Array που εφάρμοζε την επιπλέον ζημιά του Crackshot, όταν υπήρχε μόνο ένας στόχος.",
      "[*] Διορθώθηκαν οι επιδράσεις του Giant's Ring που ήταν ορατές στους εχθρούς όταν ο κομιστής ήταν αόρατος. Προστέθηκε εικονίδιο απομείωσης, όταν λαμβάνεται ζημιά από εχθρικό Giant's Ring.",
      "[*] Διορθώθηκε η χρήση του Eul's Scepter σε μονάδες με ατρωσία απομειώσεων, που τις έκανε να «κολλάνε».",
      "[*] Διορθώθηκε το Tempest Double του Arc Warden που δεν διατηρούσε και τις δύο φορτίσεις του Hand of Midas όταν κλητευόταν εκ νέου.",
      "[*] Διορθώθηκε το Tempest Double του Arc Warden, που λάμβανε εμπερία από κριπάκια τα οποία αρνούνταν οι εχθροί.",
      "[*] Διορθώθηκε το υπερβολικό κόστος ενέργειας του Friendly Shadow του Bounty Hunter από το Aghanim's Shard.",
      "[*] Διορθώθηκε το Starbreaker της Dawnbreaker που δεν έβαζε το Harpoon σε επαναφόρτιση, ενώ το έκανε για το Echo Sabre.",
      "[*] Διορθώθηκε το Solar Guardian της Dawnbreaker που ακυρωνόταν μερικές φορές, όταν ο σύμμαχος που στόχευε έβγαινε έξω από τον κόσμο.",
      "[*] Διορθώθηκε ο φόβος της Death Prophet, που διέκοπτε τη διοχέτευση ξορκιών μέσω της ατρωσίας απομειώσεων.",
      "[*] Διορθώθηκε ο Ember Spirit που μπορούσε να εκτελέσει το Sleight of Fist μόνο στη δεξιά πλευρά, ενώ ταξίδευε με το φλογερό είδωλο.",
      "[*] Διορθώθηκε το Little Friends της Enchantress, που δεν εξουδετερωνόταν από το Linken's Sphere.",
      "[*] Διορθώθηκε η επίδραση Aghanim's Shard στο E.M.P. του Invoker που αγνοούσε τις συγκρούσεις, με αποτέλεσμα οι μονάδες να «κολλούν» μεταξύ τους.",
      "[*] Διορθώθηκε το Torrent του Kunkka που παρέκαμπτε τις κινήσεις του στόχου, ακόμα και όταν είχε ατρωσία απομειώσεων.",
      "[*] Διορθώθηκε η εμφάνιση του ταλέντου «Chain Frost στον θάνατο» του Lich στη διεπαφή. Το εικονίδιο επαύξησης θα εμφανίζεται πλέον μόνο όταν έχετε το ταλέντο, ενώ έχει επίσης και επεξήγηση.",
      "[*] Διορθώθηκε η αδυναμία αποσυναρμολόγησης των αντικειμένων στην αρκούδα του Lone Druid από τον κάτοχό της.",
      "[*] Διορθώθηκε η αλληλεπίδραση του Aghanim's Shard της Luna με το Silver Edge και το Shadow Blade.",
      "[*] Διορθώθηκε το Spear of Mars του Mars που σούβλιζε την αρκούδα του Lone Druid.",
      "[*] Διορθώθηκε απρόσμενος τερματισμός που συνέβαινε όταν αποκαλύπτονταν ταυτόχρονα ο Monkey King, που είχε μεταμφιεστεί σε δέντρο από το Mischief, μαζί με άλλες μονάδες. ",
      "[*] Διορθώθηκε το ταλέντο επιπέδου 25 του Monkey King, -1 απαιτούμενα χτυπήματα Jingu Mastery, που δεν εφαρμοζόταν στους κλητευμένους στρατιώτες.",
      "[*] Διορθώθηκε η αναβάθμιση Aghanim's Scepter για το Wukong's Command του Monkey King, που δεν λειτουργούσε όταν το Wukong's Command ήταν εκτός επαναφόρτισης.",
      "[*] Διορθώθηκε η φυσική μορφή του στόχου του Parting Shot της Muerta που μπορούσε να δράσει σαν να λάμβανε ατρωσία απομειώσεων.",
      "[*] Διορθώθηκε το Dream Coil του Puck που επηρεαζόταν από την αντίσταση κατάστασης.",
      "[*] Διορθώθηκε η αφαίρεση της επίδρασης του Dream Coil του Puck νωρίτερα, όταν ένας εχθρός επηρεαζόταν από δύο ξεχωριστά Dream Coil.",
      "[*] Διορθώθηκε η ζημιά του Sonic Wave της Queen of Pain που δεν εφαρμοζόταν πλήρως, όταν εκτελούταν σε στόχους που ήταν επηρεασμένοι από το Pulverize.",
      "[*] Διορθώθηκε το Sonic Wave της Queen of Pain που προκαλούσε μερικές φορές μια επιπλέον επίδραση ζημιάς, όπως και η λανθασμένη στρογγυλοποίηση της διάρκειάς του, όταν επηρεαζόταν από την αντίσταση κατάστασης.",
      "[*] Διορθώθηκε η επίδραση τύφλωσης/επιβράδυνσης του Sand Storm του Sand King που παρέμενε στην τοποθεσία της αρχικής εκτέλεσης.",
      "[*] Διορθώθηκε το Pounce του Slark που εφαρμοζόταν στην αρκούδα του Lone Druid.",
      "[*] Διορθώθηκε η Templar Assassin, που μερικές φορές «κολλούσε» στην αορατότητα του Meld, όταν καταστρεφόταν ο στόχος επίθεσης. ",
      "[*] Διορθώθηκε ο Treant Protector που έχανε την επαύξηση του Nature's Guise, όταν δεχόταν ζημιά ενώ περπατούσε πάνω στα κλήματα του Nature's Grasp. Τώρα παρουσιάζει την ίδια συμπεριφορά όπως όταν περπατάει σε δέντρα.",
      "[*] Διορθώθηκε η περιστασιακή δυνατότητα ελέγχου του Troll Warlord κατά τη διάρκεια του Battle Trance.",
      "[*] Διορθώθηκε η Vengeful Spirit που λάμβανε την Ατρωσία Σιντριβανιού, όταν άλλαζε θέση με την ψευδαίσθηση Aghanim's Scepter της έξω από το σιντριβάνι.",
      "[*] Διορθώθηκε η αλληλεπίδραση του Magic Missile με Aghanim's Shard της Vengeful Spirit με επιδράσεις ανανέωσης και αντανάκλασης ξορκιών.",
      "[*] Διορθώθηκε η αναβάθμιση Aghanims Scepter του Chaotic Offering του Warlock που δημιουργούσε δαίμονες χωρίς μειωμένα στατιστικά, όταν ο Warlock μετακινούσε το Aghanim's Scepter του στο σακίδιο κατά τη διάρκεια της εκτέλεσης.",
      "[*] Διορθώθηκε το Aghanim's Shard που μερικές φορές προκαλούσε κατάλυση της αορατότητας του Weaver από το Shukuchi, συγκεκριμένα σε συνδυασμό με το ταλέντο επιπέδου 25, +1 επίθεση Geminate Attack.",
      "[*] Διορθώθηκε η περιστασιακή ακύρωση επιθέσεων της Windranger όταν εκτελούσε Windrun μετά από Focus Fire με Aghanim's Scepter. ",
      "[*] Διορθώθηκε ο Wraith King που λάμβανε καταιγισμό μηνυμάτων «Αδυναμία επίθεσης», όταν ένας από τους σκελετούς του αφοπλίζονταν.",
      "[*] Διορθώθηκε το Lightning Hands του Zeus που επηρεαζόταν από καταλύσεις",
      "[*] Διορθώθηκε το ταλέντο επιπέδου Level 25 της Mirana που είχε λανθασμένη τιμή για την επιπλέον ζημιά του Starstorm.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}