{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "7.34d Oynanış Güncellemesi",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "7.34d Oynanış Güncellemesi",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "7.34d Oynanış Güncellemesi çıktı. [url=https://www.dota2.com/patches/7.34d]Buradan[/url] tüm değişikliklere bakabilirsiniz. ",
      "Son birkaç gün içinde birkaç oynanış sorununu çözdük:",
      "[list]",
      "[*] Radiant kaynağının üzerinde kahramanların sıkışıp kalabildiği bir alan düzeltildi.",
      "[*] Oyuncu bakış açısının, oyunu izlerken bazen düzgün çalışmaması düzeltildi.",
      "[*] İllüzyonlar, kısayol tuşları ve kontrol gruplarıyla ilgili çeşitli sorunlar düzeltildi.",
      "[*] Göstergenin üst çubuğuna tıklandığında Hızlı Saldırı'nın düzgün çalışmaması düzeltildi.",
      "[*] Nilüfer Havuzu'na hızlı bir şekilde art arda tıklamanın, Nilüfer Havuzu yönlendirmesini kesintiye uğratması düzeltildi.",
      "[*] Nilüfer Havuzu ile etkileşim sırasında yönlendirme çubuğu güncellemelerinin tutarsız olması düzeltildi.",
      "[*] Tara butonunun dolu olmadığında kalan şarjı göstermemesi düzeltildi.",
      "[*] Envanterdeki Faerie Fire gibi kopya eşyaların dolum sürelerinin bazen takılı kalması düzeltildi.",
      "[*] İkiz geçitin parçacık efektlerinin, kahramanın son görüldüğü konumda parçacıkları göstererek düşmanlara geçitin kullanıldığını göstermesi sorunu düzeltildi.",
      "[*] Blade Mail'in Nyx Assassin üzerinde düzgün çalışmaması düzeltildi.",
      "[*] Bir dost tarafından uygulandığında Lotus Orb'un yönlendirilen büyülerle yansıma etkileşimi düzeltildi.",
      "[*] Specialist Array'in sadece tek bir hedef varken ilave Crackshot hasarı uygulaması düzeltildi.",
      "[*] Giant's Ring efektlerinin, eşyayı kuşanan kahraman görünmezken düşmana görünebilmesi düzeltildi. Düşman bir Giant's Ring'den hasar alırken görünecek bir güçsüzleştirme simgesi eklendi.",
      "[*] Eul's Scepter'ı güçsüzleştirme bağışıklığı olan bir birimde kullanmanın o birimin sıkışıp kalmasına neden olması düzeltildi.",
      "[*] Arc Warden'ın Tempest Double'ının yeniden çağrıldığında her iki Hand of Midas şarjını korumaması düzeltildi",
      "[*] Arc Warden'ın Tempest Double'ının düşmanlar tarafından reddedilmiş yaratıklardan tecrübe puanı kazanması düzeltildi.",
      "[*] Bounty Hunter'ın Shard yükseltmeli Friendly Shadow yeteneğinin çok fazla mana harcaması düzeltildi.",
      "[*] Dawnbreaker'ın Starbreaker yeteneğinin, Echo Sabre'ı dolum süresine sokması ancak Harpoon'u sokmaması düzeltildi.",
      "[*] Hedef dost, oyun alanının dışına çıktığında Dawnbreaker'ın Solar Guardian yeteneğinin bazen iptal edilmesi düzeltildi.",
      "[*] Death Prophet'in korkutma etkisinin güçsüzleştirme bağışıklığıyla korunan büyüleri bozması düzeltildi.",
      "[*] Ember Spirit'in Fire Remnant içinde ilerlerken Sleight of Fist yeteneğini yalnızca sağ tarafa kullanabilmesi düzeltildi.",
      "[*] Enchantress'in Little Friends yeteneğinin Linken's Sphere tarafından engellenmemesi düzeltildi.",
      "[*] Invoker'ın Shard'lı EMP efektinin çarpışmaları yok sayması ve birimlerin birbirine yapışmasına neden olması düzeltildi",
      "[*] Kunkka'nın Torrent yeteneğinin, güçsüzleştirme bağışıklığı olsa bile hedefin animasyonlarını geçersiz kılması düzeltildi.",
      "[*] Lich'in \"Öldüğünde Chain Frost Kullanır\" yeteneğinin göstergedeki gösterimi düzeltildi. Güçlendirme simgesi artık yalnızca yeteneğe sahip olduğunuzda görünecek ve artık bir açıklaması var",
      "[*] Lone Druid'in Spirit Bear'inin sahibinin Spirit Bear'deki eşyaları parçalarına ayıramaması düzeltildi.",
      "[*] Luna'nın Aghanim's Shard'ının Silver Edge ve Shadow Blade ile etkileşimi düzeltildi.",
      "[*] Mars'ın Spear of Mars yeteneğinin Lone Druid'in Spirit Bear'ini delmesi düzeltildi.",
      "[*] Monkey King ağaç kılığını diğer birimlerle birlikte aynı anda ortaya çıkarırken Monkey King'in Mischief yeteneğinin neden olduğu bir çökme düzeltildi. ",
      "[*] Monkey King'in Seviye 25 \"Jingu Mastery gerekli vuruş\" yeteneğinin çağrılan askerlere uygulanmaması düzeltildi.",
      "[*] Monkey King'in Wukong's Command yeteneği dolum süresinde değilken Aghanim's Scepter yükseltmesinin çalışmaması düzeltildi.",
      "[*] Muerta'nın Parting Shot hedefine ait fiziksel formun, güçsüzleştirme bağışıklığı alması durumunda hareket edebilmesi düzeltildi.",
      "[*] Puck'ın Dream Coil yeteneğinin durum direncinden etkilenmesi düzeltildi.",
      "[*] Bir düşman iki ayrı Dream Coil'den etkilendiğinde Puck'ın Dream Coil efektinin erken kaldırılması düzeltildi.",
      "[*] Queen of Pain'in Sonic Wave hasarının, Pulverize'den etkilenen bir hedefe kullanıldığında tam olarak uygulanmaması düzeltildi.",
      "[*] Queen of Pain'in Sonic Wave yeteneğinin bazen fazladan hasar vermesi ve durum direncinden etkilendiğinde süreyi yanlış yuvarlaması düzeltildi.",
      "[*] Sand King'in Sand Storm kör etme/yavaşlatma efektinin hareket etmek yerine ilk kullanıldığı yerde kalması düzeltildi.",
      "[*] Slark'ın Pounce yeteneğinin, Lone Druid'in Spirit Bear'ine uygulanması düzeltildi.",
      "[*] Saldırı hedefi yok edildiğinde Templar Assassin'in bazen Meld görünmezliğinde takılı kalması düzeltildi. ",
      "[*] Treant Protector'un, Nature's Grasp'te yürürken hasar aldığında Nature's Guise güçlendirmesini kaybetmesi düzeltildi. Artık ağaçların arasında yürürkenki davranışın aynısını gösteriyor.",
      "[*] Troll Warlord'un bazen Battle Trance sırasında kontrol edilebilir olması düzeltildi.",
      "[*] Vengeful Spirit'in, Aghanim's Scepter illüzyonuyla kaynağın yanında yer değiştirmesi durumunda Kaynak Dokunulmazlığı alması düzeltildi.",
      "[*] Vengeful Spirit'in Shard'lı Magic Missile yeteneğinin yenileme ve yansıma ile etkileşimi düzeltildi.",
      "[*] Warlock'un Chaotic Offering yeteneğinin Aghanims Scepter yükseltmesinin, Warlock kullanım ortasında Scepter'ını çantasına taşırsa, azaltılmamış istatistiklere sahip Golemler oluşturması düzeltildi.",
      "[*] Aghanim's Shard'ın bazen Weaver'ın Shukuchi görünmezliğinin kaldırılmasına neden olması düzeltildi (özellikle Seviye 25 +1 Geminate Attack hüneriyle).",
      "[*] Windranger'ın, Aghanim's Scepter ile Focus Fire'dan sonra Windrun kullandığında bazen saldırıları iptal etmesi düzeltildi. ",
      "[*] Wraith King'in iskeletlerinden birinin etkisiz kalması durumunda sürekli \"Saldırılamaz\" mesajları alması düzeltildi.",
      "[*] Zeus'un Lightning Hands yeteneğinin etki geçirmelerden etkilenmesi düzeltildi",
      "[*] Mirana'nın seviye 25 hünerinin Starstorm ilave hasarını yanlış bir şekilde listelemesi düzeltildi.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}