{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "7.34d játékmenet-frissítés",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "7.34d játékmenet-frissítés",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Megjelent a 7.34d frissítés. A frissítésjegyzéket [url=https://www.dota2.com/patches/7.34d]itt tudod megnézni[/url]. ",
      "Az elmúlt néhány napban számos játékmeneti problémát orvosoltunk:",
      "[list]",
      "[*] Javítottunk egy területet a Radiant Forrás felett, ahol a hősök beakadhattak.",
      "[*] Javítottuk, hogy a Játékos szemszöge mód néha nem működött megfelelően játéknézés közben.",
      "[*] Javítottunk különféle problémákat az illúziókkal, gyorsbillentyűkkel és vezérlőcsoportokkal kapcsolatban.",
      "[*] Javítottuk, hogy a Gyors támadás nem működött megfelelően a HUD felső sávjára kattintva.",
      "[*] Javítottuk, hogy a többször gyors egymásutánban a Lótuszmedencére kattintás megszakította a Lótuszmendence fenntartását.",
      "[*] Javítottuk a következetlen fenntartási sáv frissítéseket a Lótuszmedencével való interakciókor.",
      "[*] Javítottuk, hogy a Felderítés gomb nem mutatta a fennmaradó tölteteket, ha nem volt tele.",
      "[*] Javítottuk, hogy a felszerelésben többször szereplő tárgyak (például Faerie Fire) újratöltődési ideje néha beragadhatott.",
      "[*] Javítottuk, hogy az Ikerkapuk részecskeeffektjei néha felfedték a használatot az ellenségnek, részecske megjelenítésével az utolsó ismert hőspozíción.",
      "[*] Javítottuk, hogy a Blade Mail nem működött megfelelően Nyx Assassinen.",
      "[*] Javítottuk a Lotus Orb visszatükrözési interakcióját fenntartott varázslatokkal, ha azokat szövetséges alkalmazta.",
      "[*] Javítottuk, hogy a Specialist Array bónusz Crackshot sebzést okozott, amikor csak egy célpont volt.",
      "[*] Javítottuk, hogy a Giant's Ring effektjei láthatók voltak az ellenségeknek, amikor a viselője láthatatlan volt. Hozzáadtunk egy gyengítés ikont ellenség Giant's Ringjétől elszenvedett sebzéskor.",
      "[*] Javítottuk, hogy az Eul's Scepter gyengítésimmunis egységeken való használatától az egységek elakadtak.",
      "[*] Javítottuk, hogy Arc Warden Tempest Double-jének újraidézéskor nem maradt meg mindkét Hand of Midas töltete",
      "[*] Javítottuk, hogy Arc Warden Tempest Double-je tapasztalatot kapott ellenségek által beáldozott creepektől.",
      "[*] Javítottuk, hogy Bounty Hunter Friendly Shadow Shardos fejlesztése túl sok manába került.",
      "[*] Javítottuk, hogy Dawnbreaker Starbreakere nem tette újratöltődésre a Harpoont, míg az Echo Sabre-t igen.",
      "[*] Javítottuk, hogy Dawnbreaker Solar Guardianje néha megszakadt, ha a célzott szövetséges kilépett a világból.",
      "[*] Javítottuk, hogy Death Prophet megfélemlítés képessége megszakította a gyengítésimmunitáson keresztül fenntartott varázslatokat.",
      "[*] Javítottuk, hogy Ember Spirit csak jobb oldalra tudott Sleight of Fistet varázsolni a Fire Remnantben haladva.",
      "[*] Javítottuk, hogy Enchantress Little Friends képességét nem blokkolta a Linken's Sphere.",
      "[*] Javítottuk, hogy Invoker E.M.P. képességének Shard hatása figyelmen kívül hagyta az ütközést, és engedte, hogy az egységek összeragadjanak",
      "[*] Javítottuk, hogy Kunkka Torrentje felülírta a célpont animációit, akkor is, ha az gyengítésimmunis volt.",
      "[*] Javítottuk Lich „Chain Frost halálkor” Adottságának megjelenítését a HUD-on: az erősítés ikonja mostantól csak akkor jelenik meg, amikor rendelkezel az Adottsággal, és mostantól van elemleírása is",
      "[*] Javítottuk, hogy Lone Druid Spirit Bearjének tulajdonosa nem tudta szétszerelni a tárgyakat a Spirit Bearen.",
      "[*] Javítottuk Luna Aghanim's Shardos interakcióját a Silver Edge és a Shadow Blade tárgyakkal.",
      "[*] Javítottuk, hogy Mars Spear of Mars képessége felnyársalta Lone Druid Spirit Bearjét.",
      "[*] Javítottunk egy összeomlást Monkey King Mischief képessége kapcsán, ami Monkey King faálcájának más egységekkel egyidejű felfedésekor történt. ",
      "[*] Javítottuk, hogy Monkey King 25. szintű „Jingu Mastery szükséges találat” Adottsága nem alkalmazódott a megidézett katonákra.",
      "[*] Javítottuk, hogy Monkey King Wukong's Command képességének Aghanim's Scepteres fejlesztése nem működött, amikor a Wukong's Command nem volt újratöltődésen.",
      "[*] Javítottuk, hogy Muerta Parting Shot célpontjának fizikai formája cselekedni tudott, ha gyengítésimmunitást kapott.",
      "[*] Javítottuk, hogy Puck Dream Coil képességére hatással volt a hatásellenállás.",
      "[*] Javítottuk, hogy Puck Dream Coil képességének hatása túl korán távolítódott el, ha az ellenségre két különböző Dream Coil hatott.",
      "[*] Javítottuk, hogy Queen of Pain Sonic Wave képességének sebzése nem alkalmazódott teljesen, ha Pulverize hatása alatt álló célpontra lett varázsolva.",
      "[*] Javítottuk, hogy Queen of Pain Sonic Wave képessége néha egy plusz sebzéspéldányt okozott és helytelenül kerekítődött, amikor az időtartamot módosította a hatásellenállás.",
      "[*] Javítottuk, hogy Sand King Sand Storm képességének vakítási és lassítási hatása az eredeti varázslás területén maradt, és nem mozgott.",
      "[*] Javítottuk, hogy Slark Pounce képessége alkalmazódott Lone Druid Spirit Bearjére.",
      "[*] Javítottuk, hogy Templar Assassin néha a Meld láthatatlanságában ragadt, ha a támadott célpont megsemmisült. ",
      "[*] Javítottuk, hogy Treant Protector elvesztette a Nature's Guise erősítését, amikor sebzést szenvedett Nature's Graspon járáskor. Mostantól ugyanúgy viselkedik, mint fák közelében.",
      "[*] Javítottuk, hogy Troll Warlord néha irányítható volt Battle Trance közben.",
      "[*] Javítottuk, hogy Vengeful Spirit Forrás sérthetetlenséget kapott, ha helyet cserélt a Forráson kívüli Aghanim's Scepteres illúziójával.",
      "[*] Javítottuk Vengeful Spirit Shardos Magic Missile képességének interakcióját a frissítéssel és a visszatükrözéssel.",
      "[*] Javítottuk, hogy Warlock Chaotic Offering képességének Aghanim's Scepteres fejlesztése nem csökkentett értékekkel rendelkező gólemeket hozott létre, ha Warlock varázslás közben a hátizsákjába helyezte a Scepterét.",
      "[*] Javítottuk, hogy a Shard néha megszüntette Weaver Shukuchi képességének láthatatlanságát, különösképp a 25. szintű „+1 Geminate Attack támadás” Adottságnál.",
      "[*] Javítottuk, hogy Windranger néha abbahagyta a támadást Windrun varázslásakor Aghanim's Scepteres Focus Fire után. ",
      "[*] Javítottuk, hogy Wraith King „Nem tud támadni” üzenetekkel volt bombázva, ha az egyik csontváza le volt fegyverezve.",
      "[*] Javítottuk, hogy Zeus Lightning Hands képességét meg lehetett szüntetni",
      "[*] Javítottuk, hogy Mirana 25. szintű Adottsága rossz értéket tüntetett fel a Starstorm többletsebzésnél.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}