{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Parche de jugabilidad 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Parche de jugabilidad 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Ya está disponible el parche 7.34d. Puedes consultar las notas [url=https://www.dota2.com/patches/7.34d]aquí[/url]. ",
      "En los últimos días, abordamos varios problemas de jugabilidad:",
      "[list]",
      "[*] Se corrigió un área situada encima de la fuente de los Radiant en la que los héroes podían quedarse atorados.",
      "[*] Se corrigió la vista de jugador que algunas veces no funcionaba correctamente al ver partidas.",
      "[*] Se corrigieron varios problemas relacionados con las ilusiones, las teclas rápidas y los grupos de control.",
      "[*] Se corrigió el problema que hacía que el ataque rápido no funcionara correctamente al hacer clic en la barra superior del HUD.",
      "[*] Se corrigió el problema que hacía que se interrumpiera la canalización al hacer clic rápidamente varias veces en la Fuente de loto.",
      "[*] Se corrigió la inconsistencia en la barra de canalización que se actualizaba al interactuar con la Fuente de loto.",
      "[*] El botón \"Radar\" ya muestra las cargas restantes aun si no se recarga por completo.",
      "[*] Se corrigió el tiempo de recarga de los objetos duplicados en el inventario, como Fuego Feérico, que a veces se quedaba atascado.",
      "[*] Se corrigieron los efectos de partículas de Portales Gemelos, que a veces reproducían una partícula en la última posición conocida de un héroe y revelaban su uso al enemigo.",
      "[*] Se corrigió Malla de Cuchillas que no funcionaba correctamente en Nyx Assassin.",
      "[*] Se corrigió la interacción de hechizos canalizados con la redirección de Orbe de Loto si es aplicada por un aliado.",
      "[*] Se corrigió la aplicación de daño adicional de Tirador Experto con objeto neutral Equipo del Especialista cuando solo hay un objetivo.",
      "[*] Se corrigieron los efectos de Anillo del Gigante que eran visibles a los enemigos cuando el portador es invisible. Se agregó un ícono de efecto negativo que aparece al recibir daño del Anillo del Gigante de algún enemigo.",
      "[*] Se corrigió el uso de Cetro de Eul en una unidad inmune a efectos negativos; la unidad ya no se queda atorada.",
      "[*] Se corrigió el Duplicado de la Tempestad de Arc Warden que no conservaba ambas cargas de Mano de Midas cuando se volvía a invocar.",
      "[*] El Duplicado de la Tempestad de Arc Warden ya no recibe experiencia de los creeps denegados por los enemigos.",
      "[*] Se corrigió la mejora con el Fragmento de Aghanim para Sombra Amistosa de Bounty Hunter que costaba demasiado maná.",
      "[*] Se corrigió la habilidad Quebrantaestrellas de Dawnbreaker que no ponía a Arpón en tiempo de recarga, al igual que con Sable de Eco.",
      "[*] Se corrigió la habilidad Guardiana Solar de Dawnbreaker que algunas veces se cancelaba si el aliado objetivo desaparecía.",
      "[*] Se corrigió el Temor de Death Prophet; ya no interrumpe los hechizos canalizados de unidades inmunes a efectos negativos.",
      "[*] Se corrigió el problema por el cual Ember Spirit solo podía lanzar Destreza de Puño hacia la derecha al desplazarse a un Remanente de Fuego.",
      "[*] Se corrigió la habilidad Pequeños Amigos de Enchantress que no se bloqueaba por Esfera de Linken.",
      "[*] Se corrigió el efecto de la habilidad P.E.M. de Invoker con el Fragmento de Aghanim que ignoraba las colisiones y que permitía que las unidades se quedaran atascadas unas a las otras.",
      "[*] Se corrigió la anulación de las animaciones del objetivo al usar Torrente de Kunkka, aun si el objetivo es inmune a efectos negativos.",
      "[*] Se corrigió la representación en el HUD del talento \"Congelación en Cadena al morir\" de Lich. Ahora, el icono del efecto positivo solo se muestra al conseguir el talento y tiene una descripción emergente",
      "[*] Se corrigió un error por el cual el usuario no podía desmontar objetos del Espíritu Oso de Lone Druid.",
      "[*] Se corrigió la interacción del Cetro de Aghanim de Luna con Hoja Plateada y Hoja Sombría.",
      "[*] Se corrigió la Lanza de Mars que atravesaba al Espíritu Oso de Lone Druid.",
      "[*] Se corrigió un bloqueo causado por Travesura de Monkey King que ocurría al revelar un disfraz de Danza Arbórea junto con otras unidades al mismo tiempo. ",
      "[*] Se corrigió el talento de nivel 25 de Maestría Jingu que no se aplicaba correctamente a soldados invocados.",
      "[*] Se corrigió la mejora de Comando de Wukong de Monkey King con el Cetro de Aghanim que no funcionaba correctamente cuando la habilidad no estaba en tiempo de recarga.",
      "[*] Se corrigió que el objetivo de la forma física de Tiro de Despedida de Muerta pudiera actuar si recibía inmunidad a efectos negativos.",
      "[*] La resistencia a efectos negativos ya no afecta a la habilidad Espiral de Sueños de Puck.",
      "[*] Se corrigió el efecto de la habilidad Espiral de Sueños de Puck que desaparecía antes de tiempo si un enemigo era afectado por dos espirales de sueños distintas.",
      "[*] Se corrigió el daño de Onda Sónica de Queen of Pain que no se aplicaba por completo si se lanzaba sobre un objetivo afectado por Pulverizar.",
      "[*] Se corrigió que la Onda Sónica de Queen of Pain algunas veces infligiera una instancia de daño extra y se redondeaba incorrectamente cuando la duración se veía afectada por resistencia de estado.",
      "[*] Se corrigió el efecto Tormenta de Arena de Sand King que cegaba y ralentizaba y que permanecía en la ubicación del lanzamiento inicial en lugar de moverse.",
      "[*] Se corrigió la aplicación de Asalto de Slark a Espíritu Oso de Lone Druid.",
      "[*] Se corrigió que Templar Assassin a veces se quedaba atascada en la invisibilidad de Fusión si el objetivo del ataque era destruido. ",
      "[*] Se corrigió que Treant Protector perdiera el efecto positivo de Apariencia de la Naturaleza al recibir daño mientras caminaba con Agarre de la Naturaleza. Ahora tiene el mismo comportamiento que al caminar entre los árboles.",
      "[*] Se corrigió que Troll Warlord a veces era controlable durante Trance de Batalla.",
      "[*] Se corrigió que Vengeful Spirit recibiera Invulnerabilidad de la Fuente si cambiaba de lugar con su ilusión fuera de la fuente con el Cetro de Aghanim.",
      "[*] Se corrigió la interacción del Misil Mágico y mejora del Fragmento de Aghanim con restauraciones y reflejos de Vengeful Spirit.",
      "[*] Se corrigió que la mejora con el Cetro de Aghamin de Ofrenda del Caos de Warlock creara gólems con estadísticas no reducidas si Warlock movía su Cetro a la mochila a la mitad de un lanzamiento.",
      "[*] Se corrigió que el Fragmento de Aghanim algunas veces causara que la invisibilidad con Shukuchi de Weaver se disipara, en particular con el talento de nivel 25 con +1 de Ataque Geminado.",
      "[*] Windrunner ya no cancela los ataques al lanzar Correvientos después de Fuego Concentrado con Cetro de Aghanim. ",
      "[*] Se corrigió que Wraith King fuera bombardeado con mensajes \"No se puede atacar\" si uno de sus esqueletos era desarmado.",
      "[*] Se corrigió Manos Relámpago de Zeus que era afectada por disipaciones",
      "[*] Se corrigió el talento de nivel 25 de Mirana que mostraba un valor incorrecto para el daño adicional de Tormenta Estelar.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}