{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização de jogabilidade 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Atualização de jogabilidade 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "A atualização 7.34d foi lançada. Confira os detalhes [url=https://www.dota2.com/patches/7.34d]aqui[/url]. ",
      "Nos últimos dias, corrigimos vários problemas de jogabilidade:",
      "[list]",
      "[*] Correção de área acima da fonte dos Iluminados, onde os heróis podiam ficar presos.",
      "[*] Correção do não funcionamento ocasional da perspectiva do jogador ao assistir a partidas.",
      "[*] Correção de vários erros com ilusões, atalhos e controle de grupos.",
      "[*] Correção do não funcionamento esperado do ataque rápido ao clicar na barra superior da interface.",
      "[*] Fonte de Lótus: correção da interrupção da canalização ao clicá-la diversas vezes.",
      "[*] Fonte de Lótus: correção da atualização inconsistente da barra de canalização ao interagir.",
      "[*] Sonda: correção da não exibição das cargas restantes caso não estivesse cheia.",
      "[*] Correção do travamento ocasional dos intervalos entre usos de itens repetidos no inventário, como o Fogo de Fada.",
      "[*] Portais Gêmeos: correção dos efeitos de partículas sendo às vezes reproduzidos na última posição conhecida do herói, revelando o uso à equipe inimiga.",
      "[*] Cota de Lâminas: correção do não funcionamento quando usada pelo Nyx Assassin.",
      "[*] Orbe de Lótus: correção da interação da reflexão com habilidades canalizadas, quando aplicado por um aliado.",
      "[*] Kit do Especialista: correção da aplicação do dano adicional do Disparo Quebrado quando há apenas um alvo.",
      "[*] Anel do Gigante: correção da visibilidade do efeito para inimigos quando o portador está invisível. Adição de ícone de efeito negativo ao sofrer dano do Anel do Gigante de um inimigo.",
      "[*] Cetro de Eul: correção do uso em unidades imunes a efeitos, fazendo com que ficassem presas.",
      "[*] Arc Warden: correção da Duplicata Tempestuosa não preservar ambas as cargas de Mão de Midas quando reinvocada.",
      "[*] Arc Warden: correção da Duplicata Tempestuosa receber experiência por criaturas negadas por inimigos.",
      "[*] Bounty Hunter: correção do custo excessivo de mana da Sombra Aliada, concedida pelo Fragmento de Aghanim.",
      "[*] Dawnbreaker: correção de Quebra-Estrelas, que não estava colocando o Arpão em intervalo, embora o fizesse para o Sabre Ecoante.",
      "[*] Dawnbreaker: correção de Guardiã Solar, que às vezes era cancelada caso o aliado-alvo desaparecesse.",
      "[*] Death Prophet: correção do amedrontamento do Sifão Espiritual aprimorado pelo Fragmento de Aghanim, que estava interrompendo habilidades canalizadas por unidades imunes a efeitos.",
      "[*] Ember Spirit: correção dos Punhos Velozes, que só podiam ser usados para a direita quando viajando no Resquício Flamejante.",
      "[*] Enchantress: correção de Coleguinhas, que não eram bloqueados pela Esfera de Linken.",
      "[*] Invoker: correção do efeito do Fragmento de Aghanim para o Pulso Eletromagnético, que estava ignorando colisões e permitindo que unidades ficassem presas umas nas outras",
      "[*] Kunkka: correção do uso das animações da Torrente em alvos imunes a efeitos.",
      "[*] Lich: correção da exibição do talento \"Congelamento em Cadeia ao morrer\" na interface — o ícone do efeito só será exibido com o talento aprendido, e agora conta com uma descrição",
      "[*] Lone Druid: correção da impossibilidade de desmontar os itens do Espírito Urso.",
      "[*] Luna: correção da interação do Fragmento de Aghanim com a Lâmina das Sombras e Lâmina de Prata.",
      "[*] Marte: correção da Lança de Marte, que conseguia arrastar o Espírito Urso do Lone Druid.",
      "[*] Monkey King: correção de travamento causado ao revelar simultaneamente um Monkey King disfarçado de árvore com a Travessura junto a outras unidades. ",
      "[*] Monkey King: correção do Talento Nível 25 da Maestria do Jingu não se aplicar a soldados invocados.",
      "[*] Monkey King: correção do aprimoramento do Cetro de Aghanim para o Comando de Wukong, que não funcionava durante o intervalo entre usos da habilidade.",
      "[*] Muerta: correção da forma física do alvo do Disparo Desalmado, que podia agir caso recebesse imunidade a efeitos.",
      "[*] Puck: correção da Espiral dos Sonhos ser afetada por resistência estática.",
      "[*] Puck: correção do efeito da Espiral dos Sonhos, que estava sendo removido precocemente caso um inimigo fosse afetado por duas instâncias separadas da habilidade.",
      "[*] Queen of Pain: correção da Onda Sônica, cujo dano não estava sendo aplicado totalmente em aliados afetados por Pulverizar.",
      "[*] Queen of Pain: correção da Onda Sônica, que às vezes causava uma instância adicional de dano e arredondava a duração erroneamente quando sob efeito de resistência estática.",
      "[*] Sand King: correção do efeito de cegueira/retardo da Tempestade de Areia, que permanecia no local inicial em vez de acompanhar o movimento.",
      "[*] Slark: correção do Bote, que afetava o Espírito Urso do Lone Druid.",
      "[*] Templar Assassin: correção de problema ocasional que a fazia ficar presa na invisibilidade de Mesclar caso o alvo do ataque fosse destruído. ",
      "[*] Treant Protector: correção da perda do efeito de Forma da Natureza ao sofrer dano enquanto andava sob as Garras da Natureza. Agora, tem o mesmo comportamento de quando anda entre as árvores.",
      "[*] Troll Warlord: correção do Transe de Batalha, que às vezes ainda permitia o controle do herói.",
      "[*] Vengeful Spirit: correção do recebimento de Invulnerabilidade da Fonte ao trocar de lugar com a sua ilusão do Cetro de Aghanim fora da fonte.",
      "[*] Vengeful Spirit: correção da interação do aprimoramento do Fragmento de Aghanim para Míssil Mágico com restaurações e reflexões.",
      "[*] Warlock: correção do aprimoramento do Cetro de Aghanim para a Oferenda Caótica, que estava criando golens sem redução de atributos caso o Warlock movesse o Cetro para a mochila durante a animação.",
      "[*] Weaver: correção de interação do Fragmento de Aghanim, que às vezes fazia a invisibilidade de Shukuchi ser dissipada, especialmente com o Talento Nível 25 \"+1 Ataque Germinante\".",
      "[*] Windranger: correção de problema com Correr nos Ventos, que às vezes cancelava ataques ao usar após Disparos Concentrados com o aprimoramento do Cetro de Aghanim. ",
      "[*] Wraith King: correção da exibição incessante de mensagens de \"Não pode atacar\" caso um dos seus esqueletos fosse desarmado.",
      "[*] Zeus: correção das Mãos Eletrizantes, que eram afetadas por dissipações",
      "[*] Mirana: correção do dano adicional para Chuva Estelar listado no Talento Nível 25.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}