{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Pelipäivitys 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Pelipäivitys 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Pelipäivitys 7.34d on nyt saatavilla. Katso päivitystiedot [url=www.dota2.com/patches/7.34d]täältä[/url]. ",
      "Tuore päivitys korjaa useita pelaamiseen vaikuttavia ongelmia:",
      "[list]",
      "[*] Korjattiin Radiantin lähteen yläpuolella sijaitseva alue, johon sankarit saattoivat jäädä jumiin.",
      "[*] Korjattiin ongelma, jonka vuoksi pelaajanäkymä ei joskus toiminut katsojille.",
      "[*] Korjattiin useita harhoihin, pikanäppäimiin ja komentoryhmiin liittyviä ongelmia.",
      "[*] Korjattiin ongelma, jonka vuoksi pikahyökkäys ei toiminut kunnolla, kun käyttäjä klikkasi käyttöliittymän yläpalkkia.",
      "[*] Korjattiin ongelma, jonka vuoksi lootuslähteen usea perättäinen klikkaus keskeytti sen kanavoinnin.",
      "[*] Korjattiin lootuslähteen väärät kanavointiaikapäivitykset.",
      "[*] Korjattiin ongelma, jonka vuoksi luotauspainike ei näyttänyt jäljellä olevia latauksia niiden puuttuessa.",
      "[*] Korjattiin ongelma, jonka vuoksi joidenkin esineiden, kuten Faerie Firen, latausajat jäivät jumiin niiden kaksoiskappaletta käytettäessä.",
      "[*] Korjattiin ongelma, jonka vuoksi Kaksoisporttien hiukkastehosteet paljastivat vihollisten kulun näyttämällä hiukkaset vihollisen viimeksi nähdyssä sijainnissa.",
      "[*] Korjattiin ongelma, jonka vuoksi Nyx Assassinin käyttämä Blade Mail ei toiminut oikein.",
      "[*] Korjattiin Lotus Orbin kanavoitujen loitsujen heijastussäännöt liittolaiseen käytettäessä.",
      "[*] Korjattiin ongelma, jonka vuoksi Specialist Array antoi Crackshotin lisävahingon lisäkohteettomille hyökkäyksille.",
      "[*] Korjattiin ongelma, jonka vuoksi Giant's Ringin tehosteet näkyivät vihollisille käyttäjän ollessa näkymätön. Lisättiin heikennyskuvake ilmoittamaan vihollisen Giant's Ringin tekemästä vahingosta.",
      "[*] Korjattiin ongelma, jonka vuoksi heikennysimmuuniin viholliseen käytetty Eul's Scepter jumitti hänet paikoilleen.",
      "[*] Korjattiin ongelma, jonka vuoksi Arc Wardenin Tempest Double ei säilyttänyt molempia Hand of Midas -latauksia uudelleen kutsuttaessa.",
      "[*] Korjattiin ongelma, jonka vuoksi Arc Wardenin Tempest Double -klooni sai kokemusta vihollisten epäämistä kätyreistä.",
      "[*] Korjattiin Bounty Hunterin Shard-päivityksen Friendly Shadowin virheellinen manantarve.",
      "[*] Korjattiin ongelma, jonka vuoksi Dawnbreakerin Starbreaker ei laittanut Harpoonia jäähylle Echo Sabren tapaan.",
      "[*] Korjattiin ongelma, jonka vuoksi Dawnbreakerin Solar Guardian saattoi keskeytyä kohdeliittolaisen kadotessa pelikentältä.",
      "[*] Korjattiin ongelma, jonka vuoksi Death Prophetin Shard-päivitetyn Spirit Siphonin pelotus keskeytti vihollisten kanavoidut kyvyt heikennysimmuniteetin lävitse.",
      "[*] Korjattiin ongelma, jonka vuoksi Ember Spirit pystyi käyttämään Sleight of Fistiä vain oikealle puolelleen Fire Remnantiin siirtyessään.",
      "[*] Korjattiin ongelma, jonka vuoksi Linken's Sphere ei torjunut Enchantressin Little Friendsiä.",
      "[*] Korjattiin ongelma, jonka vuoksi Invokerin E.M.P:n Shard-päivitys ohitti mahdolliset hahmojen törmäykset ja saattoi jättää ne jumiin toistensa sisään.",
      "[*] Korjattiin ongelma, jonka vuoksi Kunkan Torrent ohitti heikennysimmuunien vihollisten animaatiot.",
      "[*] Korjattiin Lichin \"Kuolema loitsii Chain Frostin\" -taitopäivityksen käyttöliittymä: kykyvahvistus näkyy nyt vain, kun Lich valitsee taidon, ja nyt siinä lukee taidon kuvaus.",
      "[*] Korjattiin virhe, jonka vuoksi Lone Druidin pelaaja ei pystynyt purkamaan Spirit Bearinsa kantamia esineitä.",
      "[*] Korjattiin Lunan Shard-päivityksen ja Silver Edgen/Shadow Bladen virheellinen vuorovaikutus.",
      "[*] Korjattiin ongelma, jonka vuoksi Marsin Spear of Mars keihästi Lone Druidin Spirit Bearin.",
      "[*] Korjattiin Monkey Kingin Mischiefin aiheuttama kaatuminen, joka tapahtui Monkey Kingin puuvaleasun paljastuttua samaan aikaan muiden hahmojen kanssa. ",
      "[*] Korjattiin ongelma, jonka vuoksi Monkey Kingin tason 25 Jingu Masteryn taitopäivitys ei vaikuttanut Scepterin päivittämiin kopioihin.",
      "[*] Korjattiin ongelma, jonka vuoksi Monkey Kingin Wukong's Commandin Scepter-päivitys ei toiminut, kun Wukong's Command oli valmiina.",
      "[*] Korjattiin ongelma, jonka vuoksi Muertan Parting Shotin kohteen fyysistä olomuotoa pystyi ohjaamaan, jos se sai heikennysimmuniteetin.",
      "[*] Korjattiin ongelma, jonka vuoksi heikennysvastustus vaikutti Puckin Dream Coiliin.",
      "[*] Korjattiin ongelma, jonka vuoksi Puckin Dream Coil keskeytyi etuajassa, jos samaan viholliseen vaikutti kaksi erillistä Dream Coilia.",
      "[*] Korjattiin ongelma, jonka vuoksi Queen of Painin Sonic Wave ei tehnyt täyttä vahinkoa Pulverizen vaikuttamaan viholliseen.",
      "[*] Korjattiin ongelma, jonka vuoksi Queen of Painin Sonic Wave saattoi tehdä tavallista enemmän vahinkoa ja pyöristää sen väärin, jos heikennysvastustus vaikutti sen kestoon.",
      "[*] Korjattiin ongelma, jonka vuoksi Sand Kingin Sand Stormin sokaisu-/hidastustaitopäivitys pysyi Sand Stormin alkuperäisessä sijainnissa eikä seurannut sitä.",
      "[*] Korjattiin ongelma, jonka vuoksi Slarkin Pounce vaikutti Lone Druidin Spirit Beariin.",
      "[*] Korjattiin ongelma, jonka vuoksi Templar Assassin jäi näkymättömäksi, jos Meldin hyökkäyskohde tuhoutui ennen hyökkäyksen osumaa. ",
      "[*] Korjattiin ongelma, jonka vuoksi Treant Protector menetti Nature's Guisen vahvistuksen ottaessaan vahinkoa seisoessaan Nature's Graspin päällä. Vuorovaikutus täsmää nyt puiden kanssa.",
      "[*] Korjattiin ongelma, jonka vuoksi Troll Warlordia pystyi ohjaamaan Battle Trancen aikana.",
      "[*] Korjattiin ongelma, jonka vuoksi Vengeful Spirit sai lähteen tarjoaman haavoittumattomuuden, jos hän vaihtoi paikkaa lähteen ulkopuolella olevan Scepter-harhan kanssa.",
      "[*] Korjattiin Vengeful Spiritin Magic Missilen virheelliset vuorovaikutukset loitsuheijastuksen ja latausaikojen nollauksen kanssa.",
      "[*] Korjattiin ongelma, jonka vuoksi Warlockin Chaotic Offeringin Scepter-päivitys ei laskenut Golemien piirteitä, jos Warlock siirsi Scepterinsä reppuunsa kyvyn käyttöviiveen aikana.",
      "[*] Korjattiin ongelma, jonka vuoksi Weaverin Shard-päivitys saattoi keskeyttää Shukuchin näkymättömyyden, eritoten tason 25 Geminate Attack -taitopäivityksen kanssa.",
      "[*] Korjattiin ongelma, jonka vuoksi Windranger joskus perui hyökkäyskomentonsa käyttäessään Scepter-päivitettyä Windrunia Focus Firen jälkeen. ",
      "[*] Korjattiin ongelma, jonka vuoksi Wraith Kingiä ohjaava pelaaja sai loputtoman tulvan \"Ei voi hyökätä\" -viestejä, kun yksi hänen luurangoistaan riisuttiin aseista.",
      "[*] Korjattiin ongelma, jonka vuoksi puhdistukset vaikuttivat Zeuksen Lightning Handsiin.",
      "[*] Korjattiin Miranan tason 25 taitopäivityksen virheellinen Starstorm-vahinko.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}