{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualizarea de joc 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Actualizarea de joc 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Actualizarea de joc 7.34d este disponibilă acum. Consultă detaliile actualizării [url=https://www.dota2.com/patches/7.34d?l=romanian]aici[/url]. ",
      "Pe parcursul ultimelor zile am remediat diverse probleme de joc:",
      "[list]",
      "[*] A fost remediată o zonă deasupra fântânii Radiant unde eroii puteau rămâne blocați.",
      "[*] A fost remediată perspectiva jucătorului care uneori nu funcționa corect pentru spectatori.",
      "[*] Au fost remediate mai multe probleme privind iluziile, tastele rapide și grupurile de control.",
      "[*] A fost remediat faptul că atacul rapid nu funcționa corespunzător atunci când jucătorul făcea clic pe bara superioară a interfeței de joc.",
      "[*] A fost remediat faptul că clicurile multiple asupra iazului cu lotuși în succesiune rapidă întrerupeau concentrarea iazului cu lotuși.",
      "[*] Au fost remediată inconsecvența de actualizare a barei de concentrare la interacțiunea cu iazul de lotuși.",
      "[*] A fost remediat faptul că butonul de scanare nu indica numărul de utilizări rămase dacă nu era încărcat complet.",
      "[*] A fost remediat faptul că repausul pentru obiectele duplicate din inventar (precum mai multe instanțe de Faerie Fire) putea rămâne blocat.",
      "[*] A fost remediată problema unde efectele de particule ale portalurilor gemene dezvăluiau uneori inamicilor faptul că acestea erau folosite prin redarea particulelor la ultima locație cunoscută a eroului care a folosit portalul.",
      "[*] A fost remediat faptul că Blade Mail nu funcționa corect pe Nyx Assassin.",
      "[*] A fost remediată interacțiunea dintre reflectarea obiectului Lotus Orb și vrăjile cu concentrare care are loc atunci când efectul obiectului este aplicat de un aliat.",
      "[*] A fost remediat faptul că Specialist's Array acorda bonus pentru daunele produse de Crackshot atunci când nu avea decât o singură țintă.",
      "[*] A fost remediat faptul că efectele obiectului Giant's Ring erau vizibile pentru inamici deși purtătorul era invizibil. A fost adăugată o pictogramă de efect negativ care apare atunci când obiectul Giant's Ring al unui inamic cauzează daune.",
      "[*] A fost remediat faptul că utilizarea obiectului Eul's Scepter asupra unei unități imune la efecte negative cauza blocarea acesteia.",
      "[*] A fost remediat faptul că unitatea Tempest Double a lui Arc Warden nu menținea ambele încărcături ale obiectului Hand of Midas atunci când aceasta era reinvocată.",
      "[*] A fost remediat faptul că unitatea Tempest Double a lui Arc Warden primea puncte de experință de la creepii sacrificați de inamici.",
      "[*] A fost remediat faptul că abilitatea Friendly Shadow oferită de Aghanim's Shard lui Bountry Hunter avea un cost prea mare de mana.",
      "[*] A fost remediat faptul că abilitatea Starbreaker a eroinei Dawnbreaker nu pornea repausul pentru Harpoon, deși îl pornea pentru Echo Sabre.",
      "[*] A fost remediat faptul că abilitatea Solar Guardian a eroinei Dawnbreaker era anulată uneori dacă aliatul țintit era în afara lumii.",
      "[*] A fost remediat faptul că efectul de frică al abilității Spirit Siphon a lui Death Prophet întrerupea concentrarea vrăjilor pentru unitățile imune la efectele negative.",
      "[*] A fost remediat faptul că Ember Spirit putea invoca Sleight of Fist pe partea dreaptă atunci când traversa către un Fire Remnant.",
      "[*] A fost remediat faptul că abilitatea Little Friends a eroinei Enchantress nu era blocată de Linken's Sphere.",
      "[*] A fost remediat faptul că efectul acordat de Aghanim's Shard abilității E.M.P. a lui Invoker ignora coliziunile și permitea ca unitățile să fie lipite una de alta.",
      "[*] A fost remediat faptul că abilitatea Torrent a lui Kunkka înlocuia animațiile țintei, chiar dacă aceasta era imună la efecte negative.",
      "[*] A fost remediată afișarea în cadrul interfeței de joc a talentului pentru invocarea abilității Chain Frost în urma decesului lui Lich. Pictograma efectului pozitiv va fi afișată atunci când ai talentul și dispune acum și de o descriere care este afișată la trecerea cu mouse-ul peste pictogramă.",
      "[*] A fost remediat faptul că obiectele unității Spirit Bear a lui Lone Druid nu puteau fi dezasamblate.",
      "[*] A fost remediată interacțiunea dintre îmbunătățirea oferită de Aghanim's Shard Lunei cu Silver Edge și Shadow Blade.",
      "[*] A fost remediat faptul că abilitatea Spear of Mars a lui Mars proțăpea unitatea Spirit Bear a lui Lone Druid.",
      "[*] A fost remediată o cădere cauzată de abilitatea Mischief a lui Monkey King care avea loc atunci când o deghizare în copac a lui Monkey King era dezvăluită alături de alte unități simultan. ",
      "[*] A fost remediat faptul că talentul de la nivelul 25 al lui Monkey King care reduce numărul de lovituri necesare pentru Jingu Mastery nu era aplicat în cazul soldaților invocați.",
      "[*] A fost remediat faptul că îmbunătățirea oferită de Aghanim's Scepter pentru Wukong's Command nu funcționa atunci când abilitatea nu era în repaus.",
      "[*] A fost remediat faptul că abilitatea Parting Shot a eroinei Muerta permitea formei fizice a țintei să acționeze dacă primea imunitate la efecte negative.",
      "[*] A fost remediat faptul că abilitatea Dream Coil a lui Puck era afectată de rezistența la efecte negative.",
      "[*] A fost remediat faptul că efectul de la Dream Coil al lui Puck era eliminat devreme dacă un erou inamic era afectat de două instanțe diferite ale acestei abilități.",
      "[*] A fost remediat faptul că daunele cauzate de abilitatea Sonic Wave a eroinei Queen of Pain nu erau aplicate complet dacă abilitatea era invocată pe o țintă afectată de Pulverize.",
      "[*] A fost remediat faptul că abilitatea Sonic Wave a eroinei Queen of Pain cauza uneori o instanță suplimentară de daune și rotunjea în mod incorect atunci când durata era afectată de rezistența la efecte negative.",
      "[*] A fost remediat faptul că efectul de orbire/încetinire aplicat de abilitatea Sand Storm a lui Sand King rămânea la locația inițială a invocării în loc să se miște.",
      "[*] A fost remediat faptul că abilitatea Pounce a lui Slark se aplica unității Spirit Bear a lui Lone Druid.",
      "[*] A fost remediat faptul că uneori eroina Templar Assassin rămânea blocată în invizibilitatea aplicată Meld dacă ținta atacului era distrusă. ",
      "[*] A fost remediat faptul că Treant Protector pierdea efectul pozitiv de la Nature's Guise dacă încasa daune în timp ce mergea pe o instanță de Nature's Grasp. Acum are același comportament ca atunci când merge în copaci.",
      "[*] A fost remediat faptul că Troll Warlord putea fi controlat uneori în timp ce folosea Battle Trance.",
      "[*] A fost remediat faptul că eroina Vengeful Spirit păstra invulnerabilitatea oferită de fântână, dacă iluzia oferită eroinei de Aghanim's Spirit nu se afla lângă fântână, iar eroina se afla la fântână și-și schimba poziția cu cea a iluziei.",
      "[*] A fost remediată interacțiunea abilității Magic Missle îmbunătățite de Aghanim's Shard a eroinei Vengeful Spirit cu reîmprospătarea și reflectarea.",
      "[*] A fost remediat faptul că îmbunătățirea oferită de Aghanim's Scepter abilității Chaotic Offering a lui Warlock crea golemi cu atribute nereduse dacă Warlock transfera Aghanim's Scepter în rucsac în timpul invocării.",
      "[*] A fost remediat faptul că Aghanim's Shard uneori permitea ca invizibilitatea aplicată de abilitatea Shukuchi a lui Weaver să fie descântată, în special în cazul talentului de la nivelul 25 care oferă +1 atac pentru Geminate Attack.",
      "[*] A fost remediat faptul că uneori Windranger își oprea atacurile atunci când invoca Windrun după ce folosea abilitatea Focus Fire îmbunătățită de Aghanim's Scepter. ",
      "[*] A fost remediat faptul că Wraith King era bombardat cu mesaje de „Nu poate ataca” atunci când unul dintre scheletele sale era dezarmat.",
      "[*] A fost remediat faptul că abilitatea Lightning Hands a lui Zeus putea fi descântată",
      "[*] A fost remediat faptul că talentul de la nivelul 25 al lui Mirana afișa o valoare incorectă pentru bonusul de daune produse de Starstorm.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}