{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja rozgrywki 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Aktualizacja rozgrywki 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Aktualizacja 7.34d jest już dostępna. Listę zmian możecie sprawdzić [url=https://www.dota2.com/patches/7.34d]tutaj[/url]. ",
      "W ciągu ostatnich kilku dni zajęliśmy się wieloma problemami w rozgrywce:",
      "[list]",
      "[*] Naprawiono błąd powodujący, że bohaterowie mogli utknąć na obszarze nad fontanną Świetlistych.",
      "[*] Naprawiono błąd powodujący, że kamera z perspektywy gracza niekiedy nie działała poprawnie podczas oglądania meczu.",
      "[*] Naprawiono wiele problemów z iluzjami oraz skrótami klawiszowymi i grupami kontrolnymi.",
      "[*] Naprawiono błąd powodujący, że szybki atak nie działał poprawnie po kliknięciu górnego paska interfejsu.",
      "[*] Naprawiono błąd powodujący, że szybkie i wielokrotne klikanie na basen lotosu przerywało inkantację na basenie.",
      "[*] Naprawiono błąd powodujący niekonsekwentne aktualizowanie paska inkantacji podczas interakcji z basenem lotosu.",
      "[*] Naprawiono błąd powodujący, że przycisk do skanowania nie pokazywał pozostałych ładunków, jeśli umiejętność nie była gotowa do użycia.",
      "[*] Naprawiono błąd powodujący, że czas oczekiwania zduplikowanych przedmiotów w ekwipunku (np. Faerie Fire) czasami się zawieszał.",
      "[*] Naprawiono błąd powodujący, że efekty cząsteczkowe bliźniaczych bram niekiedy ujawniały korzystanie z nich wrogom poprzez odtworzenie efektu na ostatniej znanej pozycji bohatera.",
      "[*] Naprawiono błąd powodujący, że przedmiot Blade Mail nie działał poprawnie dla Nyx Assassina.",
      "[*] Naprawiono błąd interakcji odbicia przedmiotu Lotus Orb z inkantowanymi czarami, jeśli został użyty przez sojusznika.",
      "[*] Naprawiono błąd powodujący, że przedmiot Specialist's Array nakładał dodatkowe obrażenia um. Crackshot, kiedy w pobliżu był tylko jeden cel.",
      "[*] Naprawiono błąd powodujący, że efekty użycia przedmiotu Giant's Ring były widoczne dla wrogów, jeśli bohater posiadający przedmiot był niewidzialny. Dodano ikonę negatywnego efektu, która pojawia się podczas otrzymywania obrażeń od wroga posiadającego ten przedmiot.",
      "[*] Naprawiono błąd powodujący, że użycie przedmiotu Eul's Scepter of Divinity na jednostce niewrażliwej na negatywne efekty powodowało utknięcie jej w miejscu.",
      "[*] Naprawiono błąd powodujący, że um. Tempest Double od Arc Wardena nie zachowywała obu ładunków przedmiotu Hand of Midas przy ponownym przyzwaniu",
      "[*] Naprawiono błąd powodujący, że klon Arc Wardena z um. Tempest Double otrzymywał punkty doświadczenia od stworów dobijanych przez wrogów.",
      "[*] Naprawiono błąd powodujący, że koszt many um. Friendly Shadow przyznawanej Bounty Hunterowi przez Aghanim's Shard był zbyt wysoki.",
      "[*] Naprawiono błąd powodujący, że um. Starbreaker od Dawnbreaker nie aktywowała czasu oczekiwania przedmiotu Harpoon, a aktywowała go dla przedmiotu Echo Sabre.",
      "[*] Naprawiono błąd powodujący, że czasami um. Solar Guardian od Dawnbreaker była anulowana, jeśli sojusznik będący celem opuszczał świat.",
      "[*] Naprawiono błąd powodujący, że przerażenie z um. Spirit Siphon od Death Prophet przerywało inkantację czarów przez cele będące niewrażliwe na negatywne efekty.",
      "[*] Naprawiono błąd powodujący, że Ember Spirit mógł rzucić um. Sleight of Fist tylko na prawo, gdy przemieszczał się podczas um. Fire Remnant.",
      "[*] Naprawiono błąd powodujący, że um. Little Friends od Enchantress nie była blokowana przez przedmiot Linken's Sphere.",
      "[*] Naprawiono błąd powodujący, że um. E.M.P od Invokera po ulepszeniu przez Aghanim's Shard ignorowała geometrię i pozwalała na przyklejanie jednostek do siebie",
      "[*] Naprawiono błąd powodujący, że um. Torrent od Kunkki nadpisywała animacje celu, nawet jeśli był on niewrażliwy na negatywne efekty.",
      "[*] Naprawiono błąd w interfejsie z wyświetlaniem talentu Licha na 20. poziomie aktywującym um. Chain Frost po śmierci. Od teraz ikona premii będzie wyświetlana tylko, gdy wybraliście ten talent, a do tego ma on też wskazówkę",
      "[*] Naprawiono błąd powodujący, że przyzywający duchowego niedźwiedzia nie mógł rozłączać przedmiotów posiadanych przez niedźwiedzia.",
      "[*] Naprawiono interakcję um. Moon Glaives od Luny po ulepszeniu przez Aghanim's Shard z przedmiotami Silver Edge i Shadow Blade.",
      "[*] Naprawiono błąd powodujący, że um. Spear of Mars od Marsa przeszywała duchowego niedźwiedzia Lone Druida.",
      "[*] Naprawiono błąd z um. Mischief od Monkey Kinga powodujący nieoczekiwane zamknięcie gry, gdy bohater tracił postać drzewa i był ujawniany razem z innymi jednostkami w tym samym czasie. ",
      "[*] Naprawiono błąd powodujący, że talent Monkey Kinga na 25. poziomie zmniejszający wymaganą liczbę trafień dla um. Jingu Mastery nie miał zastosowania do przyzywanych żołnierzy.",
      "[*] Naprawiono błąd powodujący, że ulepszenie um. Wukong's Command od Monkey Kinga przez Aghanim's Scepter nie działało, gdy umiejętność była gotowa do użycia.",
      "[*] Naprawiono błąd powodujący, że fizyczna forma celu um. Parting Shot od Muerty była w stanie podejmować działania, jeśli otrzymała niewrażliwość na negatywne efekty.",
      "[*] Naprawiono błąd powodujący, że odporność na statusy miała wpływ na działanie um. Dream Coil od Pucka.",
      "[*] Naprawiono błąd powodujący, że efekt um. Dream Coil od Pucka był usuwany przedwcześnie, jeśli wróg był pod wpływem dwóch osobnych efektów tej umiejętności.",
      "[*] Naprawiono błąd powodujący, że obrażenia um. Sonic Wave od Queen of Pain nie były w pełni nakładane, jeśli rzucono ją na cel pod wpływem um. Pulverize od Primal Beasta.",
      "[*] Naprawiono błąd powodujący, że czasami um. Sonic Wave od Queen of Pain zadawała dodatkową instancję obrażeń oraz niepoprawnie zaokrąglała te obrażenia, jeśli odporność na statusy miała wpływ na jej czas trwania.",
      "[*] Naprawiono błąd powodujący, że efekt oślepienia/spowolnienia z um. Sand Storm od Sand Kinga pozostawał w miejscu jej rzutu zamiast przemieszczać się dalej.",
      "[*] Naprawiono błąd powodujący, że um. Pounce od Slarka miała wpływ na duchowego niedźwiedzia Lone Druida.",
      "[*] Naprawiono błąd powodujący, że czasami Templar Assassin pozostawała trwale niewidzialna po użyciu um. Meld, jeśli cel ataku został zniszczony przed zrzuceniem niewidzialności. ",
      "[*] Naprawiono błąd powodujący, że Treant Protector tracił premię um. Nature's Guise, jeśli odniósł obrażenia, chodząc po pnączach z um. Nature's Grasp. Od teraz umiejetność zachowuje się tak samo, gdy chodzi się po drzewach.",
      "[*] Naprawiono błąd umożliwiający kontrolowanie Trolla Warlorda podczas używania um. Battle Trance w niektórych przypadkach.",
      "[*] Naprawiono błąd powodujący, że Vengeful Spirit otrzymywała nietykalność z fontanny, jeśli zamieniła się ona miejscami ze swoją iluzją (z um. Vengeance Aura po ulepszeniu przez Aghanim's Scepter), będąc poza zasięgiem fontanny.",
      "[*] Naprawiono interakcję um. Magic Missile od Vengeful Spirit po ulepszeniu przez Aghanim's Shard z efektami odbijania i odświeżania czarów.",
      "[*] Naprawiono błąd powodujący, że um. Chaotic Offering od Warlocka po ulepszeniu przez Aghanim's Scepter tworzyła golemy z niezredukowanymi statystykami, jeśli Warlock przeniósł przedmiot do plecaka podczas rzucania umiejętności.",
      "[*] Naprawiono błąd powodujący, że czasami można było rozproszyć niewidzialność z um. Shukuchi od Weavera po ulepszeniu umiejętności przez Aghanim's Shard, zwłaszcza, gdy Weaver wybrał talent na 25. poziomie dodający kolejny atak do um. Geminate Attack.",
      "[*] Naprawiono błąd powodujący, że ataki Windranger były niekiedy anulowane po użyciu um. Windrun ulepszonej przez Aghanim's Scepter zaraz po użyciu um. Focus Fire. ",
      "[*] Naprawiono błąd powodujący, że Wraith King był bombardowany wiadomościami o braku możliwości ataku, jeśli jeden z jego szkieletów został rozbrojony.",
      "[*] Naprawiono błąd powodujący, że rozproszenia miały wpływ na um. Lightning Hands od Zeusa",
      "[*] Naprawiono błąd powodujący, że talent Mirany na 25. poziomie przyznający premię do obrażeń dla um. Starstorm wyświetlał niepoprawną wartość premii.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}