{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Ігроладне оновлення 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Ігроладне оновлення 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Оновлення 7.34d вже вийшло. Про всі зміни можна дізнатися [url=https://www.dota2.com/patches/7.34d]ось тут[/url]. ",
      "За останні дні ми виправили кілька ігроладних проблем:",
      "[list]",
      "[*] Виправлено помилку, внаслідок якої герої могли застрягати в зоні над фонтаном із боку Сяйва.",
      "[*] Виправлено помилку, внаслідок якої під час перегляду гри іноді не працювала як слід камера гравця.",
      "[*] Виправлено декілька помилок, пов’язаних з ілюзіями, гарячими клавішами та підконтрольними групами.",
      "[*] Виправлено помилку, внаслідок якої швидка атака не працювала як слід після натискання відповідної кнопки на верхній смузі.",
      "[*] Виправлено помилку, через яку швидкі численні натискання один за одним на ставки лотоса переривали чаклування ставка лотоса.",
      "[*] Виправлено непослідовні оновлення панелі каналу під час взаємодії зі ставком лотоса.",
      "[*] Виправлено помилку, через яку кнопка сканування не показувала заряди, які залишилися, якщо їх була не максимальна кількість.",
      "[*] Виправлено помилку, через яку перезарядка дублікатів предметів, як-от у Чарівного вогню (Faerie Fire), іноді застрягала.",
      "[*] Виправлено випадки, коли використання ефектів косметичних часток подвійних порталів розкривалося ворогові, якщо зіграти частку на останній відомій позиції героя.",
      "[*] Виправлено помилку, через яку Укольчуга (Blade Mail) не працювала належним чином у Нікса-Вбивці.",
      "[*] Виправлено взаємодію між Сферою лотоса (Lotus Orb) і чаклувальними заклинаннями, коли цей предмет використовувався союзником.",
      "[*] Виправлено помилку, через яку Набір професіонала (Specialist's Array) застосовував шкоду від Досконалого пострілу (Crackshot), якщо була тільки одна ціль.",
      "[*] Виправлено помилку, через яку ефекти від Персня велета (Giant's Ring) було видно ворогам, коли сам носій був невидимим. Додано піктограму негативного ефекту, що показує отримання шкоди від ворога з Перснем велета (Giant's Ring).",
      "[*] Виправлено помилку, через яку використання Скіпетра Еула (Eul's Scepter) на істот з імунітетом до негативних ефектів призводило до їхнього застрягання.",
      "[*] Виправлено помилку, через яку Буремний двійник (Tempest Double) Вартового не зберігав обидва заряди Руки Мідаса (Hand of Midas) під час повторного прикликання",
      "[*] Виправлено помилку, через яку Буремний двійник (Tempest Double) Вартового отримував досвід за кріпів, добитих ворогами.",
      "[*] Виправлено помилку, внаслідок якої покращення від Уламка Дружньої тіні (Friendly Shadow) Головоріза коштувало забагато мани.",
      "[*] Виправлено помилку, через яку Зорелам (Starbreaker) Світанкової не ставив Гарпун (Harpoon) на зарядку, хоча робив це для Шаблі відлуння (Echo Sabre).",
      "[*] Виправлено помилку, через яку Сонячна варта (Solar Guardian) Світанкової іноді скасовувалася, якщо союзна ціль залишала цей світ.",
      "[*] Виправлено помилку, через яку страх від Провісниці Смерті переривав чаклувальні заклинання попри імунітет до негативних ефектів.",
      "[*] Виправлено помилку, через яку Палючий Дух міг чаклувати Вихор ударів (Sleight of Fist) лише праворуч, коли переміщувався до вогняного боввана.",
      "[*] Виправлено помилку, через яку Маленькі друзі (Little Friends) Чарівниці не блокувалися Сферою Лінкена (Linken's Sphere).",
      "[*] Виправлено помилку, через яку ефект ЕМІ (EMP) з Уламком ігнорував зіткнення й дозволяв істотам застрягати одна в одній",
      "[*] Виправлено помилку, через яку Струмінь (Torrent) Кунки змінював анімації цілі, навіть якщо та мала імунітет до негативних ефектів.",
      "[*] Виправлено відображення таланту «Морозний ланцюг (Chain Frost) після смерті» в інтерфейсі. Тепер піктограма ефекту показується тільки тоді, коли ви маєте талант, а також має підказку",
      "[*] Виправлено помилку, через яку власник ведмедя-духа не міг розбирати на ньому предмети.",
      "[*] Виправлено взаємодію Уламка Аґаніма Луни зі Срібним клинком (Silver Edge) і Тіньовим клинком (Shadow Blade).",
      "[*] Виправлено помилку, через яку Спис Марса (Spear of Mars) Марса простромлював ведмедя-духа Самітного Друїда.",
      "[*] Виправлено аварійне завершення, яке траплялося, коли замаскований під дерево Мавпячий Король виявлявся одночасно з іншими істотами. ",
      "[*] Виправлено помилку, через яку талант 25-го рівня для Майстерності Цзиньґу (Jingu Mastery) не діяв на прикликаних солдатів.",
      "[*] Виправлено помилку, через яку покращення від Скіпетра Аґаніма для Загону Укуна (Wukong's Command) не діяло, коли здібність перезаряджалася.",
      "[*] Виправлено помилку, через яку фізична форма цілі Розлучного пострілу (Parting Shot) Муерти могла діяти, якщо отримувала імунітет до негативних ефектів.",
      "[*] Виправлено помилку, через яку на ефект від Уявної спіралі (Dream Coil) діяв опір ефектам.",
      "[*] Виправлено помилку, через яку двічі застосована Уявна спіраль (Dream Coil) Пака переставала діяти на ворожу ціль занадто рано.",
      "[*] Виправлено помилку, через яку шкода від Звукової хвилі (Sonic Wave) Королеви Болю не завдавалася повністю, якщо ціль була під дією Подрібнення (Pulverize).",
      "[*] Виправлено помилку, через яку Звукова хвиля (Sonic Wave) Королеви Болю завдавала посиленої шкоди й мала неправильне заокруглення, коли на її тривалість впливав опір ефектам.",
      "[*] Виправлено помилку, через яку ефект засліплення та сповільнення від Піщаної бурі (Sand Storm) Царя Пісків лишався на місці початкового застосування, а не пересувався разом із бурею.",
      "[*] Виправлено помилку, через яку Наскок (Pounce) Сларка діяв на ведмедя-духа Самітного Друїда.",
      "[*] Виправлено помилку, через яку Тамплієр-Убивця іноді застрягала в ефекті невидимості від Злиття (Meld), якщо ціль атаки була знищена. ",
      "[*] Виправлено помилку, через яку Ент-Захисник утрачав ефект Злиття з природою (Nature's Guise), якщо зазнавав шкоди від Влади природи (Nature's Grasp). Тепер поведінка така ж, як і під час ходіння серед дерев.",
      "[*] Виправлено помилку, через яку Троль-Воєвода під дією Бойового трансу (Battle Trance) іноді дозволяв гравцю керувати собою.",
      "[*] Виправлено помилку, через яку Мстива Душа отримувала невразливість від фонтану за його межами, якщо відроджувалася на місці ілюзії від Скіпетра Аґаніма.",
      "[*] Виправлено помилку взаємодії між Магічним снарядом (Magic Missile) Мстивої Душі з Уламком та оновленням зарядки й віддзеркаленням здібності.",
      "[*] Виправлено помилку, через яку Пожертва хаосу (Chaotic Offering) Чорнокнижника зі Скіпетром створювала ґолемів із незменшеними характеристиками, якщо під час застосування сховати Скіпетр у рюкзак.",
      "[*] Виправлено помилку, через яку іноді невидимість від Шукучі (Shukuchi) Ткача з Уламком могла розвіятися, особливо з талантом 25-го рівня на додаткову атаку від Подвійної атаки (Geminate Attack).",
      "[*] Виправлено помилку, через яку Вітряна Рейнджер переставала атакувати ціль Зосередженого Вогню (Focus Fire) після застосування Вітробігу (Windrun) зі Скіпетром Аґаніма. ",
      "[*] Виправлено помилку, через яку Король-Дух отримував безліч повідомлень «Не можна атакувати», якщо один з його скелетів ставав роззброєний.",
      "[*] Виправлено помилку, через яку ефект від Рук-блискавиць (Lightning Hands) Зевса можна було розвіяти",
      "[*] Виправлено неправильне значення додаткової шкоди Зорепаду (Starstorm) в Міраниному таланті 25-го рівня.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}