{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Aggiornamento di gioco 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Aggiornamento di gioco 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "L'aggiornamento 7.34d è ora disponibile. Puoi leggere le note [url=https://www.dota2.com/patches/7.34d]qui[/url]. ",
      "Nel corso degli ultimi giorni abbiamo risolto diversi problemi legati al gameplay:",
      "[list]",
      "[*] Risolto il problema per cui gli Eroi potevano restare bloccati in un'area sopra alla Fontana dei Radiant.",
      "[*] Risolto il problema per cui \"Vista del giocatore\" a volte non funzionava correttamente per gli spettatori.",
      "[*] Risolti diversi problemi con le illusioni, i tasti delle abilità e i gruppi di controllo.",
      "[*] Risolto il problema per cui l'attacco rapido non funzionava correttamente quando si cliccava sulla barra superiore dell'interfaccia.",
      "[*] Risolto il problema per cui cliccare più volte in rapida successione sugli Stagni di Loto ne interrompeva la canalizzazione.",
      "[*] Risolto il problema per cui la barra di canalizzazione degli Stagni di Loto si aggiornava in modo incoerente.",
      "[*] Risolto il problema per cui il pulsante del Radar non mostrava le cariche rimaste se non erano al massimo.",
      "[*] Risolto il problema per cui a volte il tempo di ricarica degli oggetti doppi nell'inventario, come il Fuoco Fatuo, si bloccava.",
      "[*] Risolto il problema per cui a volte gli effetti particellari dei Portali gemelli si attivavano nell'ultima posizione nota di un Eroe, rivelandone l'utilizzo ai nemici.",
      "[*] Risolto il problema per cui la Cotta di Lame non funzionava correttamente su Nyx Assassin.",
      "[*] Corretta l'interazione dell'abilità attiva del Loto Gemmato (applicata da un alleato) con gli incantesimi canalizzati.",
      "[*] Risolto il problema per cui il clone di Tempesta doppia di Arc Warden non manteneva entrambe le cariche della Mano di Mida quando veniva rievocato.",
      "[*] Risolto il problema per cui Ombra alleata di Bounty Hunter (abilità sbloccabile con il Frammento di Aghanim) aveva un costo in mana troppo elevato.",
      "[*] Risolto il problema per cui Schianto stellare di Dawnbreaker non mandava l'Arpione in ricarica, anche se questo accadeva per la Sciabola dell'Eco.",
      "[*] Risolto il problema per cui a volte il lancio di Guardiano solare di Dawnbreaker veniva annullato se il bersaglio alleato usciva dal mondo.",
      "[*] Risolto il problema per cui Ember Spirit poteva usare Raffica di pugni solo sul lato destro mentre viaggiava verso un Residuo di fuoco.",
      "[*] Risolto il problema per cui l'abilità Piccoli amici di Enchantress non veniva bloccata dalla Sfera di Linken.",
      "[*] Risolto il problema per cui E.M.P. di Invoker (migliorata con il Frammento di Aghanim) ignorava le collisioni e permetteva alle Unità di bloccarsi a vicenda.",
      "[*] Corretta la visualizzazione del talento di Lich \"Congelamento a catena dopo la morte\" sull'interfaccia: ora l'effetto positivo ha una descrizione e la relativa icona viene mostrata soltanto se il talento è stato effettivamente selezionato.",
      "[*] Corretta l'interazione del Frammento di Aghanim di Luna con la Lama Argentea e la Lama dell'Ombra.",
      "[*] Risolto il problema per cui Lancia di Marte di Mars infilzava lo Spirito Orso di Lone Druid.",
      "[*] Risolto un crash che si verificava rivelando un Monkey King travestito da albero (tramite l'abilità Marachella) insieme ad altre Unità contemporaneamente. ",
      "[*] Risolto il problema per cui il talento di livello 25 di Monkey King \"-1 al num. di colpi richiesti per Maestria del Jingu\" non veniva applicato ai soldati evocati.",
      "[*] Risolto il problema per cui il miglioramento dello Scettro di Aghanim per Ordine di Wukong di Monkey King non funzionava quando l'abilità era in ricarica.",
      "[*] Risolto il problema per cui il corpo fisico del bersaglio di Dipartita di Muerta non veniva stordito se diventava immune agli effetti negativi.",
      "[*] Risolto il problema per cui la resistenza agli stati alterati aveva effetto su Spirale onirica di Puck.",
      "[*] Risolto il problema per cui l'effetto di Spirale onirica di Puck veniva rimosso prematuramente se un nemico era affetto da due Spirali oniriche separate.",
      "[*] Risolto il problema per cui il danno di Onda sonica di Queen of Pain non veniva applicato completamente sui bersagli affetti da Annientamento.",
      "[*] Risolto il problema per cui a volte Onda sonica di Queen of Pain infliggeva un'istanza aggiuntiva di danno e arrotondava in modo errato quando la durata veniva modificata dalla resistenza agli stati alterati.",
      "[*] Risolto il problema per cui l'effetto di accecamento/rallentamento di Tempesta di sabbia di Sand King rimaneva nel punto di lancio iniziale invece di spostarsi.",
      "[*] Risolto il problema per cui gli effetti di Balzo di Slark venivano applicati allo Spirito Orso di Lone Druid.",
      "[*] Risolto il problema per cui a volte Templar Assassin non poteva più interrompere l'invisibilità di Mimetizzazione se il bersagio attaccato veniva distrutto. ",
      "[*] Risolto il problema per cui Treant Protector perdeva l'effetto positivo di Manto della natura quando veniva danneggiato mentre camminava sui rampicanti di Stretta della natura. Ora il comportamento è lo stesso di quando cammina attraverso gli alberi.",
      "[*] Risolto il problema per cui a volte Troll Warlord può essere controllato durante l'effetto di Estasi della battaglia.",
      "[*] Risolto il problema per cui Vengeful Spirit riceveva l'invulnerabilità della Fontana se si scambiava di posto con la sua illusione dello Scettro di Aghanim all'esterno della Fontana.",
      "[*] Corretta l'interazione di Missile magico di Vengeful Spirit (migliorato con il Frammento di Aghanim) con gli effetti di azzeramento dei tempi di ricarica e di riflessione del danno.",
      "[*] Risolto il problema per cui Estasi della battaglia di Warlock (migliorata con lo Scettro di Aghanim) creava dei Golem con attributi non ridotti se Warlock spostava lo Scettro nello zaino durante il lancio dell'abilità.",
      "[*] Risolto il problema per cui a volte il miglioramento del Frammento di Aghanim consentiva di dissipare l'invisibilità di Shukuchi di Weaver, specialmente con il talento di livello 25 \"+1 attacco aggiuntivo per Attacco appaiato\".",
      "[*] Risolto il problema per cui a volte gli attacchi di Windranger venivano annullati quando usava Soffio di vento dopo Tiro focalizzato con lo Scettro di Aghanim. ",
      "[*] Risolto il problema per cui Wraith King veniva bombardato con il messaggio \"Non può attaccare\" se uno dei suoi scheletri veniva disarmato.",
      "[*] Risolto il problema per cui l'abilità Mani elettrizzanti di Zeus poteva essere dissipata. ",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}