{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Gameplayupdate 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Gameplayupdate 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Gameplayupdate 7.34d is nu live. Bekijk de laatste wijzigingen [url=https://www.dota2.com/patches/7.34d]hier[/url]. ",
      "De afgelopen dagen hebben we verschillende problemen met de gameplay opgelost:",
      "[list]",
      "[*] Gebied boven de fontein van Radiant gecorrigeerd omdat helden er vast konden komen te zitten.",
      "[*] Probleem opgelost waarbij toeschouwen vanuit het perspectief van een speler niet altijd goed werkte.",
      "[*] Verschillende problemen opgelost met illusies, sneltoetsen en controlegroepen.",
      "[*] Probleem opgelost waarbij een snelle aanval niet correct werkte als er op de bovenste balk van de HUD werd geklikt.",
      "[*] Probleem opgelost waarbij verschillende keren snel klikken op de Lotus Pool het oproepen van de Lotus Pool onderbrak.",
      "[*] Probleem opgelost met inconsistente updates van de oproepbalk bij de interactie met de Lotus Pool.",
      "[*] Probleem opgelost waarbij de Scan-knop geen resterende ladingen liet zien als er al ladingen waren gebruikt.",
      "[*] Probleem opgelost waarbij de afkoeltijd van dubbele items in de inventaris, zoals Faerie Fire, soms vastliep.",
      "[*] Probleem opgelost waarbij de vijand soms kon zien dat de Twin Gates werden gebruikt omdat de Twin Gates een deeltjeseffect lieten zien op de laatst bekende locatie van de held.",
      "[*] Probleem opgelost waarbij Blade Mail niet correct werkte op Nyx Assassin.",
      "[*] Probleem opgelost met de interactie tussen de reflectie van Lotus Orb en opgeroepen spreuken bij het toepassen op een bondgenoot.",
      "[*] Probleem opgelost waarbij Specialist's Array bonusschade toekende voor Crackshot als er maar één doelwit was.",
      "[*] Probleem opgelost waarbij de effecten van Giant's Ring zichtbaar waren voor de vijand terwijl de drager onzichtbaar was. Er is een debuff-pictogram toegevoegd voor wanneer spelers schade ontvangen van de Giant's Ring van een vijand.",
      "[*] Probleem opgelost waarbij spelers vast konden komen te zitten als ze Eul's Scepter gebruikten op eenheden die immuun zijn voor debuffs.",
      "[*] Probleem opgelost waarbij de Tempest Double van Arc Warden niet beide ladingen van Hand of Midas vasthield als hij opnieuw werd opgeroepen.",
      "[*] Probleem opgelost waarbij Tempest Double van Arc Warden ervaring kreeg van creeps die door de vijand waren afgewezen.",
      "[*] Probleem opgelost waarbij Friendly Shadow van Bounty Hunter met Aghanim's Shard te veel mana kostte.",
      "[*] Probleem opgelost waarbij Starbreaker van Dawnbreaker geen afkoeltijd startte voor Harpoen maar wel voor Echo Sabre.",
      "[*] Probleem opgelost waarbij Solar Guardian van Dawnbreaker soms werd geannuleerd als de bondgenoot die het doelwit was de wereld verliet.",
      "[*] Probleem opgelost waarbij het angsteffect van Death Prophet oproepspreuken kon onderbreken ondanks debuff-immuniteit.",
      "[*] Probleem opgelost waarbij Ember Spirit de vaardigheid Sleight of Fist alleen naar rechts kon gebruiken tijdens het verplaatsen met Fire Remnant.",
      "[*] Probleem opgelost waarbij de Little Friends van Enchantress niet geblokkeerd werden door Linken's Sphere.",
      "[*] Probleem opgelost waarbij het effect van Aghanim's Shard voor E.M.P. van Invoker botsingen negeerde en eenheden aan elkaar vast konden komen te zitten.",
      "[*] Probleem opgelost waarbij Torrent van Kunkka de animaties van het doelwit verving, zelfs als het doelwit immuun was voor debuffs.",
      "[*] De weergave van het talent van Lich waarbij er bij zijn dood een Chain Frost wordt gebruikt, is gecorrigeerd voor de HUD. Het pictogram van deze buff wordt nu alleen weergegeven als je het talent hebt en heeft een tooltip gekregen.",
      "[*] Probleem opgelost waarbij de eigenaar van Spirit Bear van Lone Druid de items van de beer niet kon demonteren.",
      "[*] Probleem opgelost met de interactie tussen Aghanim's Shard van Luna met Silver Edge en Shadow Blade.",
      "[*] Probleem opgelost waarbij Spear of Mars van Mars de Spirit Bear van Lone Druid spiesde.",
      "[*] Probleem opgelost waarbij Mischief van Monkey King een crash veroorzaakte wanneer Monkey King's vermomming als boom op hetzelfde moment werd onthuld als andere eenheden. ",
      "[*] Probleem opgelost waarbij het talent op level 25 van Monkey King (vereiste treffers voor Jingu Mastery) niet werd toegepast op opgeroepen soldaten.",
      "[*] Probleem opgelost waarbij Monkey King's bonus van Aghanim's Scepter, Wukong's Command, niet werkte nadat de afkoeltijd voor Wukong's Command was afgelopen.",
      "[*] Probleem opgelost waarbij de fysieke vorm van het doelwit van Parting Shot van Muerta niet verlamd werd als deze debuff-immunity had.",
      "[*] Probleem opgelost waarbij Dream Coil van Puck werd beïnvloed door statusweerstand.",
      "[*] Probleem opgelost waarbij het Dream Coil-effect van Puck te vroeg werd verwijderd als een vijand door twee verschillende Dream Coils werd geraakt.",
      "[*] Probleem opgelost waarbij de schade die werd veroorzaakt door Sonic Wave van Queen of Pain niet volledig werd toegepast als deze vaardigheid werd gebruikt op een doelwit dat onder invloed was van Pulverize.",
      "[*] Probleem opgelost waarbij Sonic Wave van Queen of Pain soms meer schade veroorzaakte en de afronding niet klopte wanneer de duur werd beïnvloed door statusweerstand.",
      "[*] Probleem opgelost waarbij het effect voor verblinden/vertragen tijdens Sand Storm van Sand King soms op de locatie bleef hangen waar de spreuk was gebruikt, in plaats van met de zandstorm mee te bewegen.",
      "[*] Probleem opgelost waarbij Pounce van Slark werd toegepast op Spirit Bear van Lone Druid.",
      "[*] Probleem opgelost waarbij Templar Assassin soms vast kwam te zitten in de onzichtbaarheid van Meld als het doelwit was vernietigd. ",
      "[*] Probleem opgelost waarbij Treant Protector de buff Nature's Guise verloor als hij schade ontving tijdens het lopen met Nature's Grasp. Dit gedrag is nu hetzelfde als bij het lopen in bomen.",
      "[*] Probleem opgelost waarbij Troll Warlord soms niet bestuurbaar was tijdens een Battle Trance.",
      "[*] Probleem opgelost waarbij Vengeful Spirit Fountain Invulnerability kreeg als ze buiten de fontein van plaats verwisselde met haar Aghanim's Scepter-illusie.",
      "[*] De werking gecorrigeerd van Vengeful Spirit's Magic Missile, verbeterd met Aghanim's Shard, in combinatie met vernieuwen en reflecteren.",
      "[*] Probleem opgelost met de Aghanim's Scepter-upgrade van Chaotic Offering van Warlock waarbij golems met niet-gereduceerde stats verschenen als Warlock zijn scepter tijdens de spreuk weer in zijn rugzak doet.",
      "[*] Probleem opgelost waarbij Aghanim's Shard er soms voor zorgde dat de onzichtbaarheid bij Shukuchi van Weaver kon worden verdreven, met name bij het talent op Level 25 voor +1 Geminate Attack.",
      "[*] Probleem opgelost waarbij Windranger soms aanvallen annuleerde als ze Windrun gebruikte na Focus Fire met Aghanim's Scepter. ",
      "[*] Probleem opgelost waarbij Wraith King eindeloos vaak het bericht 'Kan niet aanvallen' kreeg als een van zijn skeletten werd ontwapend.",
      "[*] Probleem opgelost waarbij Lightning Hands van Zeus verdreven kon worden.",
      "[*] Probleem opgelost met het talent op level 25 van Mirana, waarbij niet de juiste waarde werd weergegeven voor de bonusschade van Starstorm.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}