{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Gameplay-Update 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Gameplay-Update 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Das Gameplay-Update 7.34d ist jetzt verfügbar. Die Patchnotizen dazu finden Sie [url=https://www.dota2.com/patches/7.34d]hier[/url]. ",
      "In den vergangenen Tagen haben wir einige Probleme behoben, die sich negativ auf das Gameplay auswirkten:",
      "[list]",
      "[*] Bereich über dem Brunnen der Radiant angepasst, in dem Helden stecken bleiben konnten.",
      "[*] Fehler behoben, durch den die Spieleransicht beim Zuschauen gelegentlich nicht ordnungsgemäß funktionierte.",
      "[*] Verschiedene Fehler hinsichtlich der Steuerung von Illusionen mit Hotkeys und Gruppenbefehlen behoben.",
      "[*] Fehler behoben, durch den der Schnellangriff nicht ordnungsgemäß funktionierte, wenn die obere Leiste im HUD angeklickt wurde.",
      "[*] Fehler behoben, durch den schnelles mehrfaches Klicken auf den Lotosbrunnen die Kanalisierung der Lotosblumen unterbrach.",
      "[*] Fehlerhafte Aktualisierungen der Kanalisierungsanzeige bei Interaktion mit dem Lotosbrunnen behoben.",
      "[*] Fehler behoben, durch den die Schaltfläche für die Scan-Fähigkeit nicht die verbleibenden Aufladungen anzeigte, wenn diese nicht den maximalen Aufladungen entsprachen.",
      "[*] Fehler behoben, durch die Abklingzeit von mehreren Exemplaren eines Gegenstands im Inventar (z. B. Faerie Fire) gelegentlich hängen blieb.",
      "[*] Fehler behoben, durch den Partikeleffekte der Zwillingstore gelegentlich dem Gegner deren Nutzung verrieten, indem die letzte bekannte Heldenposition von Partikeln umgeben wurde.",
      "[*] Fehler behoben, durch den Blade Mail nicht ordnungsgemäß für Nyx Assassin funktionierte.",
      "[*] Fehlerhafte Interaktion zwischen der Reflexion von Lotus Orb und kanalisierenden Zaubern behoben, falls diese durch einen Verbündeten gewirkt wurden.",
      "[*] Fehler behoben, durch den Specialist's Array Bonusschaden mit Spaltschuss verursachte, obwohl sich nur ein gültiges Ziel in Reichweite befand.",
      "[*] Fehler behoben, durch den die Effekte von Giant's Ring für Gegner sichtbar waren, obwohl der Träger unsichtbar war. Symbol für Schwächungseffekt hinzugefügt, wenn Schaden durch einen Gegner im Besitz von Giant's Ring erlitten wird.",
      "[*] Fehler behoben, durch den die Anwendung von Eul's Scepter of Divinity auf eine schwächungsimmune Einheit dazu führte, dass diese stecken blieb.",
      "[*] Fehler behoben, durch den Arc Wardens Doppelgänger nicht beide Aufladungen von Hand of Midas behielt, wenn er erneut beschworen wurde.",
      "[*] Fehler behoben, durch den Arc Wardens Doppelgänger Erfahrung von durch Gegner denyte Diener erhielt.",
      "[*] Fehler behoben, durch den Bounty Hunters Splitterfähigkeit Friendly Shadow zu viel Mana kostete.",
      "[*] Fehler behoben, durch den Dawnbreakers Starbreaker die Abklingzeit der Passivfähigkeit von Harpoon nicht aktivierte (obwohl dies für Echo Sabre der Fall war).",
      "[*] Fehler behoben, durch den Dawnbreakers Solar Guardian gelegentlich abgebrochen wurde, wenn das Ziel vom Schlachtfeld verschwand.",
      "[*] Fehler behoben, durch den der Furchteffekt von Death Prophets Spirit Siphon mit Splitterbonus kanalisierende Fähigkeiten trotz Schwächungsimmunität abbrechen konnte.",
      "[*] Fehler behoben, durch den Ember Spirit Sleight of Fist nur auf die rechte Seite wirken konnte, während er sich mit Fire Remnant fortbewegte.",
      "[*] Fehler behoben, durch den Enchantress’ Little Friends nicht von Linken's Sphere geblockt wurde.",
      "[*] Fehler behoben, durch den Invokers E.M.P. mit Splitterbonus die Kollision ignorierte und dafür sorgte, dass Einheiten aneinander haften blieben.",
      "[*] Fehler behoben, durch den Kunkkas Torrent die Animationen des Ziels überschrieb, auch wenn diese schwächungsimmun waren.",
      "[*] Fehlerhafte HUD-Anzeige von Lichs Level-20-Talent „Chain Frost bei Tod“ behoben. Das Symbol für den Stärkungseffekt wird jetzt nur angezeigt, wenn das Talent gewählt wurde, und verfügt jetzt ebenfalls über einen Beschreibungstext.",
      "[*] Fehler behoben, durch den die Gegenstände von Lone Druids Geisterbären nicht zerlegt werden konnten.",
      "[*] Fehlerhafte Interaktion zwischen Lunas Splitterbonus und Shadow Blade bzw. Silver Edge behoben.",
      "[*] Fehler behoben, durch den Mars’ Spear of Mars Lone Druids Geisterbären aufspießte.",
      "[*] Absturz in Zusammenhang mit Monkey Kings Mischief behoben, der auftrat, wenn Monkey Kings Verkleidung als Baum mit anderen Einheiten zur selben Zeit aufgedeckt wurde. ",
      "[*] Fehler behoben, durch den von Wukong's Command beschworene Soldaten nicht von Monkey Kings Level-25-Talent „−1 benötigte Treffer für Jingu Mastery“ profitierten.",
      "[*] Fehler behoben, durch den Monkey Kings Wukong's Command mit Zepterbonus nicht funktionierte, während die Fähigkeit abklang.",
      "[*] Fehler behoben, durch den der von Muertas Parting Shot erschaffene Heldenkörper des Ziels agieren konnte, wenn er Schadensimmunität erhielt.",
      "[*] Fehler behoben, durch den Pucks Dream Coil durch Statusresistenz beeinflusst wurde.",
      "[*] Fehler behoben, durch den der Effekt von Pucks Dream Coil frühzeitig entfernt wurde, falls ein Gegner von zwei unterschiedlichen Dream-Coil-Instanzen betroffen war.",
      "[*] Fehler behoben, durch den der Schaden von Queen of Pains Sonic Wave nicht vollständig zugefügt wurde, falls der Zauber auf ein von Pulverize betroffenes Ziel gewirkt wurde.",
      "[*] Fehler behoben, durch den Queen of Pains Sonic Wave gelegentlich eine zusätzliche Schadensinstanz zufügte und den Schaden falsch rundete, wenn die Dauer von Statusresistenz beeinflusst wurde.",
      "[*] Fehler behoben, durch den der Blendungs-/Verlangsamungseffekt Sand Kings Sand Storm am ursprünglichen Wirkungsort verharrte, anstatt sich mit dem Sandsturm fortzubewegen.",
      "[*] Fehler behoben, durch den Slarks Pounce auf Lone Druids Geisterbären wirkte.",
      "[*] Fehler behoben, durch den Templar Assassin gelegentlich in der von Meld gewährten Unsichtbarkeit feststeckte, wenn ihr Angriffsziel getötet wurde. ",
      "[*] Fehler behoben, durch den Treant Protector den Stärkungseffekt von Nature's Guise verlor, während er sich auf den Ranken von Nature's Grasp bewegte und dabei Schaden erlitt. Treant Protector verhält sich jetzt auf Ranken so, als würde er sich durch Bäume hindurchbewegen.",
      "[*] Fehler behoben, durch den Troll Warlord gelegentlich während Battle Trance kontrolliert werden konnte.",
      "[*] Fehler behoben, durch den Vengeful Spirit Brunnen-Unverwundbarkeit erhielt, wenn sie den Platz von der durch Vengeance Aura mit Zepterbonus geschaffenen Illusion außerhalb des Brunnens einnahm.",
      "[*] Fehlerhafte Interaktion zwischen Vengeful Spirits Magic Missile mit Splitterbonus und Gegenstandseffekten hinsichtlich dem Zurücksetzen der Abklingzeit bzw. der Zauberreflexion behoben.",
      "[*] Fehler behoben, durch den Warlocks Chaotic Offering mit Zepterbonus Golems mit nicht reduzierten Werten erschuf, wenn Warlock sein Aghanims Zepter während der Wirkung des Zaubers in den Rucksack packte.",
      "[*] Fehler behoben, durch den Weavers Shukuchi mit Splitterbonus gelegentlich die gewährte Unsichtbarkeit aufdeckte, insbesondere im Zusammenhang mit dem Level-25-Talent „+1 Angriff durch Geminate Attack“.",
      "[*] Fehler behoben, durch den Windranger gelegentlich Angriffe abbrach, wenn Windrun mit Zepterbonus nach Focus Fire gewirkt wurde. ",
      "[*] Fehler behoben, durch den Wraith King wiederholt die Meldung „Angreifen nicht möglich“ erhielt, wenn eines seiner Skelette entwaffnet wurde.",
      "[*] Fehler behoben, durch den Zeus’ Lightning Hands entzaubert werden konnte.",
      "[*] Fehler behoben, durch den Miranas Level-25-Talent den falschen Wert für den Bonusschaden mit Starstorm anzeigte.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}