{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização de jogabilidade 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Atualização de jogabilidade 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "A atualização 7.34d já está disponível e podes ler as notas [url=https://www.dota2.com/patches/7.34d]aqui[/url]. ",
      "Ao longo dos últimos dias, corrigimos vários problemas de jogabilidade:",
      "[list]",
      "[*] Foi corrigida uma área acima da Fonte dos Radiant, onde os heróis podiam ficar presos.",
      "[*] Foi corrigido um problema ocasional com a perspetiva dos jogadores, que não funcionava corretamente no modo de espectador.",
      "[*] Foram corrigidos vários problemas com ilusões, atalhos e grupos de controlo.",
      "[*] Foi corrigido um problema com o ataque rápido, que não funcionava corretamente ao clicar na barra superior da interface.",
      "[*] Foi corrigido um caso onde clicar na Fonte de Lótus várias vezes em rápida sucessão interrompia a concentração.",
      "[*] Foram corrigidos casos inconsistentes de atualizações da barra de concentração em interações com a Fonte de Lótus.",
      "[*] Foi corrigido um problema com o botão do Radar (Scan), que não mostrava as cargas restantes se não estivesse cheio.",
      "[*] Foi corrigido um caso onde o cooldown de itens repetidos no inventário, como Faerie Fire, podia ficar preso.",
      "[*] Foi corrigido um problema com os Portais Geminados, que podiam reproduzir efeitos de partículas na última posição conhecida de um herói, revelando a utilização à equipa inimiga.",
      "[*] Blade Mail: foi corrigido um problema que impedia este item de funcionar corretamente no Nyx Assassin.",
      "[*] Lotus Orb: foi corrigida a interação da habilidade ativa com feitiços que requerem concentração caso tenha sido aplicada por um aliado.",
      "[*] Specialist's Array: foi corrigido um problema com o efeito passivo deste item (Crackshot), que aplicava dano adicional quando havia apenas um alvo.",
      "[*] Giant's Ring: foi corrigido um bug que fazia com que inimigos pudessem ver os efeitos deste item quando o portador estava invisível. Foi também adicionado um ícone do debuff, que aparece ao sofrer dano de um inimigo com este item.",
      "[*] Eul's Scepter: foram corrigidos casos onde este item podia fazer com que alvos imunes a debuffs ficassem presos.",
      "[*] Arc Warden: foi corrigido um problema com o Tempest Double, que não preservava ambas as cargas de Hand of Midas quando voltava a ser invocado",
      "[*] Arc Warden: foi corrigido um bug que fazia com que o Tempest Double recebesse experiência de creeps negados por inimigos.",
      "[*] Bounty Hunter: foi corrigido um problema com a habilidade Friendly Shadow (concedida por Aghanim's Shard), que custava demasiada mana.",
      "[*] Dawnbreaker: foi corrigido um caso onde a habilidade Starbreaker não fazia com que o item Harpoon entrasse em cooldown, apesar de o mesmo acontecer com Echo Sabre.",
      "[*] Dawnbreaker: foi corrigido um problema ocasional com a habilidade Solar Guardian, que era cancelada se o alvo aliado saísse do mundo.",
      "[*] Death Prophet: foi corrigido um caso onde o efeito aterrorizante interrompia feitiços concentrados por unidades imunes a debuffs.",
      "[*] Ember Spirit: foi corrigido um problema com a habilidade Sleight of Fist, que só podia ser usada do lado direito ao correr para um Fire Remnant.",
      "[*] Enchantress: foi corrigido um problema com a habilidade Little Friends, que não era bloqueada por Linken's Sphere.",
      "[*] Invoker: foi corrigido um problema com a habilidade E.M.P. com Aghanim's Shard, que ignorava colisões e podia fazer com que unidades ficassem presas umas nas outras",
      "[*] Kunkka: foi corrigida a interação entre a habilidade Torrent e as animações de alvos imunes a debuffs.",
      "[*] Lich: foi corrigida a apresentação do talento \"Chain Frost é usado ao morrer\" na interface. Agora, o ícone do buff irá apenas aparecer se o Lich tiver o talento. O buff também recebeu uma descrição",
      "[*] Lone Druid: foi corrigido um problema que impedia o desmantelamento de itens do Spirit Bear.",
      "[*] Luna: foi corrigida a interação de Aghanim's Shard com os itens Silver Edge e Shadow Blade.",
      "[*] Mars: foi corrigido um caso onde Spear of Mars podia trespassar o Spirit Bear do Lone Druid.",
      "[*] Monkey King: foi corrigida uma falha crítica causada por Mischief, que ocorria ao revelar o disfarce com outras unidades ao mesmo tempo. ",
      "[*] Monkey King: foi corrigido um problema com o talento de nível 25 \"Jingu Mastery: -1 ao número de ataques para ativar\", que não estava a ser aplicado a soldados invocados.",
      "[*] Monkey King: foi corrigido um problema com o bónus de Aghanim's Scepter, que não funcionava se Wukong's Command estivesse em cooldown.",
      "[*] Muerta: foi corrigido um problema com o alvo da habilidade Parting Shot, cujo corpo físico não era atordoado se tivesse recebido imunidade a debuffs.",
      "[*] Puck: foi corrigido um caso onde a habilidade Dream Coil era afetada por resistência a debuffs.",
      "[*] Puck: foi corrigido um problema com a habilidade Dream Coil, cujo efeito era removido antes do pretendido se um inimigo estivesse afetado por duas Dream Coils diferentes.",
      "[*] Queen of Pain: foi corrigido um problema com a habilidade Sonic Wave, cujo dano não era aplicado totalmente se o alvo estivesse afetado por Pulverize.",
      "[*] Queen of Pain: foi corrigido um problema ocasional com a habilidade Sonic Wave, que causava uma instância adicional de dano e arredondava a duração incorretamente enquanto sob o efeito de resistência a debuffs.",
      "[*] Sand King: foi corrigido um problema com a habilidade Sand Storm, cujos efeitos cegantes e abrandantes permaneciam no local de conjuração inicial em vez de se deslocarem.",
      "[*] Slark: foi corrigido um caso onde os efeitos de Pounce se aplicavam ao Spirit Bear do Lone Druid.",
      "[*] Templar Assassin: foi corrigido um caso onde esta heroína podia permanecer invisível (via Meld) se o alvo do ataque tivesse sido destruído. ",
      "[*] Treant Protector: foi corrigido um caso onde o buff de Nature's Guise podia ser perdido se este herói sofresse dano ao andar no caminho criado por Nature's Grasp. Agora comporta‑se como se o herói estivesse a andar através de árvores.",
      "[*] Troll Warlord: foram corrigidos casos onde este herói podia ser controlado durante o uso de Battle Trance.",
      "[*] Vengeful Spirit: foi corrigido um caso onde esta heroína recebia o efeito de invulnerabilidade da Fonte se trocasse de lugar com uma ilusão criada via Aghanim's Scepter fora da Fonte.",
      "[*] Vengeful Spirit: foi corrigida a interação da habilidade Magic Missile + Aghanim's Shard com efeitos que restauram cooldowns e refletem dano.",
      "[*] Warlock: foi corrigido um problema com a versão de Chaotic Offering melhorada por Aghanim's Scepter, que criava Golems com atributos sem penalidades se o Warlock movesse o Scepter para a mochila durante a conjuração.",
      "[*] Weaver: foi corrigido um problema que fazia com que Aghanim's Shard tornasse dissipável a invisibilidade concedida por Shukuchi, especialmente com o talento de nível 25 \"Geminate Attack: +1\".",
      "[*] Windranger: foram corrigidos casos onde era possível cancelar ataques ao usar Windrun após Focus Fire com Aghanim's Scepter. ",
      "[*] Wraith King: foi corrigida a repetição excessiva da fala \"não posso atacar\" que ocorria se um dos esqueletos fosse desarmado.",
      "[*] Zeus: foi corrigido um problema que tornava dissipáveis os efeitos de Lightning Hands.",
      "[*] Mirana: foi corrigido um valor errado no talento de nível 25 \"Starstorm: +250 de dano\".",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}