{
  "gid": "3735230544064408127",
  "clan_steamid": "103582791433224455",
  "event_name": "Parche de jugabilidad 7.34d",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1696549200,
  "rtime32_end_time": 1696554001,
  "comment_count": 0,
  "creator_steamid": "76561198090269208",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "85b618b2e6baf4105027dfec4f28202e701a619d.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "localized_spotlight_image": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1696551429
      },
      {
        "strSteamID": "76561199547417290",
        "rtUpdated": 1696443268
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696603265
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1696549239
      }
    ],
    "clone_from_event_gid": "3675555405710742303",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "3735230544064408128",
    "clanid": "3703047",
    "posterid": "76561198090269208",
    "headline": "Parche de jugabilidad 7.34d",
    "posttime": 1696549241,
    "updatetime": 1696603265,
    "body": [
      "Ya está disponible el parche 7.34d. Puedes consultar las notas [url=https://www.dota2.com/patches/7.34d]aquí[/url]. ",
      "En los últimos días, hemos solucionado varios problemas de jugabilidad:",
      "[list]",
      "[*] Se corrigió un área situada encima de la fuente de los Radiant en la que los héroes podían quedarse atascados.",
      "[*] Se corrigió la «Vista de jugador» que a veces no funcionaba correctamente al ver partidas.",
      "[*] Se corrigieron varios problemas relacionados con las ilusiones, las teclas rápidas y los grupos de control.",
      "[*] Se corrigió el problema que hacía que el ataque rápido no funcionase correctamente al hacer clic en la barra superior del HUD.",
      "[*] Se corrigió el problema que hacía que se interrumpiera la canalización al hacer clic rápidamente varias veces en la Fuente de Loto.",
      "[*] La barra de canalización ya se actualiza de manera coherente al interactuar con la Fuente de Loto.",
      "[*] Se corrigió el botón «Radar», que no mostraba las cargas restantes cuando no estaba lleno.",
      "[*] Se corrigió el tiempo de recarga de los objetos duplicados en el inventario, como Fuego Feérico, que a veces se quedaba atascado.",
      "[*] Se corrigieron los efectos de partículas de los Portales Gemelos, que a veces reproducían una partícula en la última posición conocida de un héroe y revelaban su uso al enemigo.",
      "[*] Malla de Cuchillas ya funciona correctamente contra Nyx Assassin.",
      "[*] Se corrigió la interacción de los hechizos canalizados con la redirección de Orbe de Loto aplicada por un aliado.",
      "[*] El Equipo del Especialista ya no aplica daño adicional de Tirador Experto cuando solo hay un objetivo.",
      "[*] Los enemigos ya no pueden ver los efectos de Anillo del Gigante cuando el portador es invisible. Se añadió un icono de efecto negativo que aparece al recibir daño del Anillo del Gigante de un enemigo.",
      "[*] Al utilizar el Cetro de Eul en una unidad inmune a efectos negativos, la unidad ya no se queda atascada.",
      "[*] El Duplicado de la Tempestad de Arc Warden ya conserva ambas cargas de Mano de Midas cuando se vuelve a invocar",
      "[*] El Duplicado de la Tempestad de Arc Warden ya no recibe experiencia de los creeps denegados por los enemigos.",
      "[*] Se corrigió la habilidad Sombra Aliada de Bounty Hunter, concedida con el Fragmento de Aghanim, que costaba demasiado maná.",
      "[*] La habilidad Quebrantaestrellas de Dawnbreaker ya hace que Arpón entre en tiempo de recarga, al igual que ocurre con Sable de Eco.",
      "[*] La habilidad Guardiana Solar de Dawnbreaker ya no se cancela cuando el aliado objetivo se sale del mundo.",
      "[*] El temor de Death Prophet ya no interrumpe los hechizos canalizados de unidades inmunes a efectos negativos.",
      "[*] Se corrigió el problema por el cual Ember Spirit solo podía lanzar Destreza de Puño hacia la derecha al desplazarse a un Remanente de Fuego.",
      "[*] La Esfera de Linken ya bloquea la habilidad Pequeños Amigos de Enchantress.",
      "[*] El efecto de la habilidad P.E.M. de Invoker con el Fragmento de Aghanim ya no ignora las colisiones para evitar que las unidades se queden atascadas unas con otras",
      "[*] La habilidad Torrente de Kunkka ya no anula las animaciones del objetivo, incluso si el objetivo es inmune a efectos negativos.",
      "[*] Se corrigió la representación en el HUD del talento «Congelación en Cadena al morir» de Lich. Ahora, el icono del efecto positivo solo se muestra al haber conseguido el talento y tiene una descripción emergente",
      "[*] Se corrigió un problema que impedía desmontar objetos del Espíritu Oso de Lone Druid.",
      "[*] Se corrigió la interacción del Cetro de Aghanim de Luna con Hoja Plateada y Hoja Sombría.",
      "[*] La Lanza de Mars ya no atraviesa al Espíritu Oso de Lone Druid.",
      "[*] Se corrigió un bloqueo causado por Travesura de Monkey King que ocurría al revelar un disfraz de Danza Arbórea junto con otras unidades al mismo tiempo. ",
      "[*] El talento de nivel 25 «‑1 golpe necesario para realizar Maestría Jingu» ya se aplica correctamente a los soldados invocados.",
      "[*] La mejora de Comando de Wukong de Monkey King con el Cetro de Aghanim ya funciona correctamente aunque la habilidad no esté en tiempo de recarga.",
      "[*] Se corrigió el problema que hacía que la forma física del objetivo de la habilidad Disparo al Alma de Muerta pudiese actuar si recibía inmunidad a los efectos negativos.",
      "[*] La resistencia a efectos negativos ya no afecta a la habilidad Espiral de Sueños de Puck.",
      "[*] El efecto de la habilidad Espiral de Sueños de Puck ya no desaparece antes de tiempo cuando un enemigo está afectado por dos espirales de sueños diferentes.",
      "[*] El daño de la habilidad Onda Sónica de Queen of Pain ya se aplica en su totalidad cuando se lanza sobre un objetivo afectado por Pulverizar.",
      "[*] Se corrigió el problema que hacía que la habilidad Onda Sónica de Queen of Pain infligiese a veces una instancia adicional de daño y se redondease por error cuando la duración estaba afectada por la resistencia a efectos negativos.",
      "[*] Los efectos de ralentización y ceguera de la habilidad Tormenta de Arena de Sand King ya se desplazan correctamente, en lugar de permanecer en la ubicación del lanzamiento inicial.",
      "[*] La habilidad Asalto de Slark ya no se puede aplicar al Espíritu Oso de Lone Druid.",
      "[*] Templar Assassin ya no se queda atascada en la invisibilidad de Fusión cuando se destruye el objetivo del ataque. ",
      "[*] Se corrigió el problema que hacía que Treant Protector perdiese los efectos positivos de Apariencia de la Naturaleza al caminar sobre Agarre de la Naturaleza y recibir daño. Ahora se comporta igual que cuando camina entre los árboles.",
      "[*] Se corrigió un problema que hacía que Troll Warlord a veces no se pudiera controlar durante Trance de Batalla.",
      "[*] Vengeful Spirit ya no recibe invulnerabilidad de la Fuente cuando intercambia posiciones con la ilusión creada con el Cetro de Aghahim fuera de la fuente.",
      "[*] Se corrigió la interacción de los efectos que restablecen el uso y reflejan el daño con la habilidad Misil Mágico de Vengeful Spirit mejorada con el Fragmento de Aghanim.",
      "[*] La mejora con el Cetro de Aghamin de Ofrenda del Caos de Warlock ya no crea gólems con estadísticas completas si Warlock mueve el cetro a la mochila durante el lanzamiento de la habilidad.",
      "[*] El Fragmento de Aghanim ya no hace que se disipe la invisibilidad de la habilidad Shukuchi de Weaver, sobre todo, con el talento de nivel 25 «+1 de Ataque Geminado».",
      "[*] Windranger ya no cancela los ataques al lanzar Correvientos después de Fuego Concentrado con el Cetro de Aghanim. ",
      "[*] Wraith King ya no recibe un bombardeo de mensajes «No puedes atacar» cuando alguno de sus esqueletos queda desarmado.",
      "[*] Los efectos de la habilidad Manos Relámpago de Zeus ya no se pueden disipar",
      "[*] Se corrigió el talento de nivel 25 de Mirana, que mostraba un valor incorrecto para el daño adicional de Tormenta Estelar.",
      "[/list]"
    ],
    "commentcount": 225,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_441547739_1696550315_0",
      "ModAct_441547739_1696553563_4",
      "ModAct_873083815_1696605743_4"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "3884975231683734814",
    "event_gid": "3735230544064408127",
    "voteupcount": 4399,
    "votedowncount": 742,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884975231683734814",
  "rtime32_last_modified": 1700125630,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696605744,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4399,
  "votes_down": 742,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884975231683734814",
  "clan_steamid_original": "103582791433224455"
}