{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "Kez și actul IV din Căderea Coroanei au sosit",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731102908
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Kez și actul IV din Căderea Coroanei au sosit",
    "posttime": 1731032533,
    "updatetime": 1731102908,
    "body": [
      "[url=https://www.dota2.com/kez?l=romanian][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "Actualizarea de astăzi este cât se poate de măreață. Nu doar că lansăm cel de-al patrulea și ultimul act al epopeei noastre „Căderea Coroanei”, ci sărbătorim și debutul lui Kez, un erou complet nou!",
      "[h2]Eroul nezburătorilor[/h2]",
      "Dacă ai ajutat-o pe Vengeful Spirit în actul III din Căderea Coroanei, înseamnă că ai trecut deja prin tundrele glaciale ale Ținuturilor înghețate, l-ai întâlnit pe Kez, exilatul din Skywrath, și l-ai convins să se întoarcă acasă cu tine. În actul IV, acesta intenționează să reunească armata Kazurai și să te ajute să scapi de Imperia din Skywrath pentru totdeauna. Iar atunci când nu e ocupat să te ajute să comiți un regicid, e dispus să-și folosească lamele pe niște Antici pentru a mai câștiga câțiva bănuți. ",
      "Grație abilității native de a comuta între katana specifică armatei Kazurai și pumnalele tridente sai specifice Ordinului Shodo (obținând astfel mai multe abilități decât poți număra pe degetele de la o mână), acest kit de maestru în arte marțiale oferă o multitudine de opțiuni. Consultă [url=https://www.dota2.com/kez?l=romanian]pagina dedicată lui Kez[/url] pentru a afla mai multe despre tot ce poate face pe câmpul de luptă.",
      "[b][url=https://www.dota2.com/kez?l=romanian]Accesează pagina lui Kez[/url] [/b]",
      "[h2]Căderea Coroanei, actul IV: Pintenii din Skywrath[/h2]",
      "Prințesa Shen era prima în linia de succesiune la tronul regatului Skywrath atunci când tatăl său, Regele Tatrasiel, s-a îmbolnăvit și a murit. Sora sa mai mică, Imperia, a trădat-o și a aruncat-o din cel mai înalt turn al Cuibarului, lăsând-o pradă morții. Shen a fost însă găsită de zeița nezburătorilor, Scree'Auk, care i-a oferit puterile unui spirt răzbunător, iar aceasta a devenit Vengeful Spirit.",
      "  ",
      "Astăzi, renăscuta Shen se întoarce în Skywrath pentru a lupta cu sora ei și a decide soarta tronului. Și nu va fi singură. Toți eroii care au ajutat-o de-a lungul călătoriei sale, de la Dragonus la Axe, Kez, Crystal Maiden și mulți alții, își vor croi acum drumul prin trei căi separate către pintenii din Skywrath pentru a ajunge în Cuibarul Ghimpilor, locul în care Imperia așteaptă lupta finală.",
      "Actul IV din Căderea Coroanei este finalul epic al unei aventuri care ne-a purtat prin tot felul de locuri, de la modestele piețe din Târgul de Mijloc până la deșerturile roșii din Druud și Pustiul Ghețurilor din nord, iar, într-un final, în Cuibarul Ghimpilor, sala de judecată a reginei însăși, pentru o confruntare finală. Actul IV vine cu o nouă hartă impresionantă care oferă trei căi distincte cu misiuni, misiuni secundare, minijocuri și, în cele din urmă, șansa de a o înfrânge pe Imperia și a debloca noile stiluri alternative ale obiectelor Arcana pentru Skywrath Mage și Vengeful Spirit. Așa că pregătește-te să jefuiești vistieria regală în drumul tău spre palat.",
      "De asemenea, pachetul de expediție al actului IV vine cu noi recompense, precum turnuri tematice personalizate cu Scree'Auk și Avilliva, dar și noi obiecte Immortal. Am adăugat chiar și conținut bonus pentru deținătorii pachetelor de expediție pentru fiecare act. Îi poți face o vizită îmblânzitorului de șerpi din calea cu misiuni a eroinei Shen din actul IV pentru a revendica abțibildurile în ediție limitată cu personajele evenimentului Căderea Coroanei. ",
      "[h2]Rămâi la curent cu ce s-a întâmplat[/h2]",
      "Dacă ai jucat toate actele din Căderea Coroanei pe măsură ce au fost lansate și vrei să sari direct la conținutul nou al actului IV, nu uita să citești ultima bandă desenată introductivă, [url=https://www.dota2.com/crownfall/comic4?l=romanian]Căderea Coroanei[/url], înainte de toate. Iar dacă ai nevoie de o scurtă recapitulare cu toate cele întâmplate până acum, poți citi următoarele benzi desenate introductive: [url=https://www.dota2.com/crownfall/comic?l=romanian]Actul I – Ziua Ascensiunii[/url], [url=https://www.dota2.com/crownfall/comic2?l=romanian]Actul II – Bătălia de la Bazinul Iadului[/url] și „[url=https://www.dota2.com/crownfall/comic3?l=romanian]Actul III – Dragonul[/url]”. ",
      "[url=https://www.dota2.com/crownfall/comic?l=romanian][b]Bandă desenată – Actul I: Ziua Ascensiunii[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2?l=romanian][b]Bandă desenată – Actul II: Bătălia de la Bazinul Iadului[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3?l=romanian][b]Bandă desenată – Actul III: Dragonul[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4?l=romanian][b]Bandă desenată – Actul IV: Căderea Coroanei[/b][/url]",
      "[h2]Tot conținutul e disponibil acum![/h2]",
      "În cele din urmă, dacă te alături aventurii noastre abia acum, odată cu ultimul act din Căderea Coroanei... bun-venit! Toate actele anterioare sunt și vor rămâne disponibile până când evenimentul Căderea Coroanei se va încheia pe 15 ianuarie 2025, așa că încă ai la dispoziție destul timp pentru a începe aventura și a descoperi o mulțime de conținut care te așteaptă.",
      "Acest lucru e valabil și pentru toți ceilalți. Dacă ai așteptat ca tot conținutul să fie disponibil înainte de a te alătura acestei aventuri, ei bine, a venit momentul. Toate cele patru acte ale evenimentului Căderea Coroanei te așteaptă. Croiește-ți drumul prin toate hărțile, descoperă întreaga poveste, joacă toate jocurile și deblochează toate stilurile pentru Arcana. ",
      "...și, desigur, ia-ți ceva frumos cu monedele și bomboanele obținute. În caz că ai strâns la pușculiță câteva monede ale evenimentului Căderea Coroanei (sau intenționezi să strângi mai multe odată cu actul IV), nu uita să le folosești până pe 15 ianuarie, momentul în care evenimentul va lua sfârșit."
    ],
    "commentcount": 571,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1731033104_0",
      "mod_require_rereview"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 6975,
    "votedowncount": 548,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 2,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731102908,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1731033104,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 6968,
  "votes_down": 545,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}