{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "Представяме Kez и Crownfall — IV акт",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731102908
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Представяме Kez и Crownfall — IV акт",
    "posttime": 1731032533,
    "updatetime": 1731102908,
    "body": [
      "[url=https://www.dota2.com/kez][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "По-голямо от днешното обновление няма. Не само, че издаваме четвъртия и финален акт на нашата Crownfall епопея от множество части, но честваме и дебюта на Kez, съвсем нов герой за игра!",
      "[h2]Героят на нелетящите[/h2]",
      "Ако сте помогнали на Vengeful Spirit в Crownfall — акт III, вече сте преминали през мразовитите тундри на Ледоостанково, намерили сте скайратския изгнаник Kez и сте го убедили да се върне у дома с Вас. В акт IV той планира пак да обедини казураите и да Ви помогне да отървете Скайрат от Империя веднъж завинаги. А когато не помага на Вас да извършвате кралеубийство, той с радост заема остриетата си за мъничко работа на свободна практика, разпокъсвайки някой друг Ancient. ",
      "С вроденото умение да разменя стилове за сражение между своята катана от ордена на Казураите и сай от ордена на Шодо, отключвайки достъп до повече от половин дузина оръжейна мощ, комплектът на този майстор на бойните изкуства идва с купища опции. Разгледайте [url=https://www.dota2.com/kez]началната страница на Kez[/url], за да научите още относно всичко, с което той може да допринесе в сражението.",
      "[b][url=https://www.dota2.com/kez]Посетете началната страница на Kez[/url].[/b]",
      "[h2]Crownfall — IV акт: Шпиловете на Скайрат[/h2]",
      "Принцеса Шен била първа по ред за трона на Скайрат, когато баща ѝ, крал Татрасиел, се поболял и починал. Но нейната по-малка сестра Империя я предала, хвърляйки Шен от най-високата кула на Гнездото, и я оставила да умре. Тя била намерена от нелетящата богиня Скри Аук, която ѝ връчила мощта на Vengeful Spirit.",
      "  ",
      "Днес, възкръсналата Шен се завръща в Скайрат, за да се бори със своята сестра за съдбата на трона. И няма да е сама. Всички герои, които са ѝ помогнали по пътя, от Драгонус, през Axe и Kez, та чак до Crystal Maiden, редом с още други, ще си проправят пътя, борейки се по три отделни курса нагоре към шпиловете на Скайрат до Тръненото гнездо, където Империя ги очаква за финална битка.",
      "Четвъртият акт на Crownfall епопеята е епичният завършек на едно пътешествие, което ни преведе от скромните пазари на Средната порта, през червените пясъчните хълмове на Друуд, та чак до пустошта на замръзналия север, а най-сетне и до Тръненото гнездо — кралският двор на самата кралица, където ще се състои окончателният сблъсък. Акт IV се слави с масивна нова карта на света, имаща три ясно очертани курса за приключения, странични приключения, мини игри, а за финал и шанс да разгромите Империя. Така ще отключите нови алтернативни стилове на Arcana за Skywrath Mage и Vengeful Spirit. Така че се пригответе за предостатъчно плячкосване на кралската хазна по протежението на пътя към двореца.",
      "Също така разполагаме с нови специфични за акт IV награди за пътеводител, включващи персонализирани Crownfall кули с ликовете на Скрий Аук и Авилива, редом с нови Immortal артикули. Дори добавихме бонус съдържание за притежателите на пакети за пътеводител от всеки акт. Вече можете да посетите змиеукротителя в приключенския курс на Шен в акт IV, за да заявите Вашето ограничено издание на стикери за Crownfall персонажи. ",
      "[h2]Как да наваксате[/h2]",
      "Ако сте проигравали през всеки Crownfall акт при излизането му и искате да се впуснете направо към новото съдържание на четвъртата глава, не забравяйте да прочетете последния встъпителен комикс — [url=https://www.dota2.com/crownfall/comic4]„Падението на короната“[/url], преди да стартирате. А ако нямате нищо против от бързо опресняване относно това какво точно, по дяволите, става, не се колебайте да прочетете встъпителните комикси на акт I [url=https://www.dota2.com/crownfall/comic]„Денят на възшествието“[/url], акт II [url=https://www.dota2.com/crownfall/comic2]„Битката за Пъклената котловина“[/url] и акт III [url=https://www.dota2.com/crownfall/comic3]„Драконът“[/url]. ",
      "[url=https://www.dota2.com/crownfall/comic][b]Комикс за акт I — „Денят на възшествието“[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2][b]Комикс за акт II — „Битката за Пъклената котловина“[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3][b]Комикс за акт III — „Драконът“[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4][b]Комикс за акт IV — „Падението на короната“[/b][/url]",
      "[h2]Всичко това вече е пуснато![/h2]",
      "И накрая… Ако се присъединявате към нас чак сега за заключителния акт на Crownfall… Добре дошли! Всички предходни актове все още са достъпни и това ще е така до завършека на Crownfall на 15 януари 2025. Така че все още има предостатъчно време да започнете приключението, в което Ви очаква куп съдържание.",
      "Това се отнася и за всички останали от Вас. Ако сте се туткали с предходните актове, но сте изчаквали първо всичко да стане достъпно, не чакайте повече. Целият Crownfall вече е на Ваше разположение за проучване. Проправете си път през всички карти, разнищете цялата история, пуснете всички мини игри и отключете всичките стилове за Arcana. ",
      "… И, разбира се, похарчете всичките си монети и лакомства. За тези от Вас, които са се вкопчили в някакви Crownfall монети или онези сред Вас, които планират да спечелят още, проигравайки акт IV, помнете, че трябва да ги използвате, преди събитието да приключи на 15 януари."
    ],
    "commentcount": 571,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1731033104_0",
      "mod_require_rereview"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 6975,
    "votedowncount": 548,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 2,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731102908,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1731033104,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 6968,
  "votes_down": 545,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}