{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "Presentamos a Kez y el Acto IV de la Caída de la Corona",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731028418
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Presentamos a Kez y el Acto IV de la Caída de la Corona",
    "posttime": 1731032533,
    "updatetime": 1731032533,
    "body": [
      "[url=https://www.dota2.com/kez][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "La actualización de hoy no puede ser más impresionante. Además de lanzar el cuarto y último acto de nuestra épica Caída de la Corona, lo vamos a celebrar con la presentación de Kez, ¡un héroe completamente nuevo!",
      "[h2]Héroe de los no voladores[/h2]",
      "Si ayudaste a Vengeful Spirit en el Acto III de la Caída de la Corona, ya atravesaste las heladas tundras de Icewrack, encontraste a Kez, el exiliado de Skywrath, y lo convenciste para que volviera a casa contigo. En el Acto IV, quiere reagrupar a los Kazurai y ayudarte a liberar Skywrath del yugo de Imperia de una vez por todas. Y, cuando no te esté ayudando con el asesinato de la reina, estará encantado de prestar sus habilidades para destruir algún que otro Ancestro por su cuenta. ",
      "Con la habilidad innata de cambiar de estilo de arma, entre la katana Kazurai y los sai Shodo, desbloqueando más poderes que días tiene la semana, este kit de maestro de las artes marciales viene con opciones para dar y tomar. Echa un vistazo a la [url=https://www.dota2.com/kez]página principal de Kez[/url] para obtener más información sobre todo lo que aporta a la batalla.",
      "[b][url=https://www.dota2.com/kez]Visitar la página principal de Kez[/url] [/b]",
      "[h2]Acto IV de la Caída de la Corona: Las torres de Skywrath[/h2]",
      "La princesa Shen era la primera en la línea de sucesión al trono de Skywrath cuando su padre, el rey Tatrasiel, cayó enfermo y falleció. Pero su hermana menor, Imperia, la traicionó, la lanzó desde la torre más alta de la Ciudadela y la dio por muerta. Scree'Auk, diosa de los no voladores, la encontró y le concedió los poderes de un espíritu vengativo, Vengeful Spirit.",
      "  ",
      "Hoy, la resucitada Shen regresa a Skywrath para luchar contra su hermana por el destino del trono. Y no estará sola. Todos los héroes que la han ayudado a lo largo del camino, desde Dragonus hasta Axe, Kez o Crystal Maiden, entre otros, lucharán en tres rutas diferentes para avanzar por las torres de Skywrath y llegar al Nido de Espinas, donde les espera una batalla final con Imperia.",
      "El Acto IV de la Caída de la Corona es la épica conclusión a una aventura que nos ha llevado de los humildes mercados del Barrio Medio a las dunas rojas de Druud, a los páramos helados del norte y, por último, al Nido de Espinas, sala de audiencias de la mismísima reina, para un enfrentamiento final. El Acto IV incluye un nuevo mapa principal enorme con tres rutas distintas de misiones, misiones secundarias, minijuegos y, además, la posibilidad de derrotar a Imperia y desbloquear nuevos estilos alternativos de los Arcanos de Skywrath Mage y Vengeful Spirit. Así que prepárate para saquear el tesoro real de camino al palacio de la reina.",
      "También hemos incluido recompensas específicas para el Paquete de Exploración del Acto IV, que incluyen torres personalizadas de Scree'Auk y Avilliva e inmortales nuevos. Incluso hemos añadido contenido adicional para los propietarios del Paquete de Exploración de cada acto. Ya puedes ir al Encantador de Serpientes del conjunto de misiones de Shen en el Acto IV para reclamar las pegatinas de edición limitada de los personajes de la Caída de la Corona. ",
      "[h2]Ponte al día[/h2]",
      "Si has estado jugando a la Caída de la Corona a medida que se lanzaba cada acto y quieres ir directamente al nuevo contenido, no te olvides de leer primero el cómic de introducción al Acto IV, [url=https://www.dota2.com/crownfall/comic4]La caída de la corona[/url]. Y, si quieres refrescar la memoria rápidamente y enterarte de qué está pasando exactamente, puedes leer la introducción del Acto I ([url=https://www.dota2.com/crownfall/comic]El día de la coronación[/url]), del Acto II ([url=https://www.dota2.com/crownfall/comic2]La batalla de la Cuenca del Infierno[/url]) y del Acto III ([url=https://www.dota2.com/crownfall/comic3]El dragón[/url]). ",
      "[url=https://www.dota2.com/crownfall/comic][b]Cómic del Acto I: El día de la coronación[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2][b]Cómic del Acto II: La batalla de la Cuenca del Infierno[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3][b]Cómic del Acto III: El dragón[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4][b]Cómic del Acto IV: La caída de la corona[/b][/url]",
      "[h2]¡Ya está todo en el juego![/h2]",
      "Por último, si acabas de llegar a la Caída de la Corona en el último acto, ¡te damos la bienvenida! Todos los actos anteriores siguen disponibles y lo seguirán estando hasta que finalice la Caída de la Corona el 15 de enero de 2025, así que todavía tienes tiempo de sobra para empezar y un montón de contenido esperándote.",
      "Bueno, tanto tú como todo el mundo. Si has estado pasando el rato con los actos anteriores, pero en realidad estabas esperando a que se publicaran todos, la espera ha terminado. Ya puedes explorar a tus anchas la Caída de la Corona en su totalidad. Descubre todos los mapas, desenmaraña toda la historia, diviértete con todos los juegos y desbloquea todos los estilos arcanos. ",
      "Y, como no, gástate todas las monedas y caramelos. Quienes hayáis estado ahorrando monedas de la Caída de la Corona (o quienes tuvieran pensado conseguir más jugando al Acto IV), no os olvidéis de usarlas antes de que termine el evento el 15 de enero."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731032533,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}