{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "Der neue Held Kez und Thronsturz-Akt IV",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731102908
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Der neue Held Kez und Thronsturz-Akt IV",
    "posttime": 1731032533,
    "updatetime": 1731102908,
    "body": [
      "[url=https://www.dota2.com/kez][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "Das heutige Update hat es in sich. Wir veröffentlichen nicht nur den vierten und letzten Akt unseres mehrteiligen Thronsturz-Epos, sondern feiern auch das Debüt von Kez, einem neuen spielbaren Helden.",
      "[h2]Held der Fluglosen[/h2]",
      "Wenn Sie Vengeful Spirit in Thronsturz-Akt III dabei geholfen haben, sich durch die Gefrorene Einöde von Eismarsch zu kämpfen, haben Sie den Exilanten Kez bereits kennengelernt und ihn dazu überredet, gemeinsam mit Ihnen nach Himmelszorn zurückzukehren. In Akt IV beabsichtigt er, die Kazurai wieder zu vereinen und Himmelszorn ein für alle Mal von Imperia zu befreien. Und wenn er nicht gerade unterstützend beim Mord einer Königin eingreift, stellt er seine Klingen gerne zur Verfügung, um als Freiberufler ein paar Ancients zu zerstören. ",
      "Dank seiner Begabung, seine ausgerüstete Waffe zwischen dem Kazurai-Katana und dem Shodo-Sai wechseln zu können (wodurch mehr Fähigkeiten freigeschaltet werden, als es Wochentage gibt), ist dieser Kampfkünstler für alle möglichen Herausforderungen gewappnet. Weitere Informationen zu Kez und seinem Repertoire an Fähigkeiten finden Sie [url=https://www.dota2.com/kez]hier[/url].",
      "[b][url=https://www.dota2.com/kez]Zur Startseite von Kez[/url] [/b]",
      "[h2]Thronsturz-Akt IV: Die Spitzen von Himmelszorn[/h2]",
      "Prinzessin Shen stand an erster Stelle in der Thronfolge von Himmelszorn, als ihr Vater, König Tatrasiel, erkrankte und starb. Doch ihre jüngere Schwester Imperia beging Verrat: Sie ließ sie vom höchsten Turm des Dornennests werfen und für tot erklären. Shen wurde von der Göttin der Fluglosen, Scree’Auk, gefunden und erhielt von ihr die Kraft, als rachsüchtiger Geist fortzubestehen.",
      "  ",
      "Heute kehrt die wiederauferstandene Shen nach Himmelszorn zurück, um mit ihrer Schwester um das Schicksal des Throns zu kämpfen. Und sie ist nicht allein. Alle Helden, die ihr auf ihrem Weg zur Seite standen, von Dragonus über Axe bis hin zu Kez und Crystal Maiden, kämpfen sich auf drei verschiedenen Pfaden die Spitzen von Himmelszorn zum Dornennest hoch, wo der Endkampf gegen Imperia auf sie wartet.",
      "Thronsturz-Akt IV bildet den epischen Abschluss eines epischen Abenteuers, das uns von den bescheidenen Märkten der Mittleren Pforte über die Roten Sande von Druud und die Gefrorene Einöde von Eismarsch bis hin zum Dornennest, dem Palast der Königin in Himmelszorn, geführt hat. Dort steht unseren Helden der Endkampf bevor. Akt IV bietet eine riesige neue Gebietskarte und drei unterschiedliche Pfade mit Haupt- und Nebenquests, Minispielen und der Chance, Imperia zu besiegen und neue alternative Arkana-Stile für Skywrath Mage und Vengeful Spirit freizuschalten. Auf dem Weg zum Palast gibt es also reichlich Gelegenheit, die königlichen Schatzkammern zu plündern.",
      "Außerdem gibt es neue Belohnungen im Pfadfinderpaket für Akt IV, unter anderem angepasste Türme zu Ehren von Scree’Auk und Avilliva sowie neue Immortal-Gegenstände. Darüber hinaus dürfen sich Besitzer vorangegangener Pfadfinderpakete über zusätzliche Inhalte für jeden Akt freuen. Sie können jetzt den Schlangenbeschwörer auf Shens Questpfad in Akt IV besuchen, um zeitlich begrenzte Aufkleber der Thronsturz-Charaktere zu erhalten. ",
      "[h2]Der neueste Stand der Dinge[/h2]",
      "Wenn Sie bereits jeden Thronsturz-Akt nach seiner Veröffentlichung durchgespielt haben und direkt mit Akt IV loslegen möchten, sollten Sie davor noch unbedingt den Intro-Comic [url=https://www.dota2.com/crownfall/comic3]Thronsturz[/url] lesen. Wenn Sie eine kleine Auffrischung zur bisherigen Handlung benötigen, lesen Sie einfach die Intro-Comics zu Akt I ([url=https://www.dota2.com/crownfall/comic]Tag der Krönung[/url]), Akt II ([url=https://www.dota2.com/crownfall/comic2]Die Schlacht am Höllenkessel[/url]) und Akt III ([url=https://www.dota2.com/crownfall/comic3]Der Drache[/url]). ",
      "[url=https://www.dota2.com/crownfall/comic][b]Akt I: Tag der Krönung[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2][b]Akt II: Die Schlacht am Höllenkessel[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3][b]Akt III: Der Drache[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4][b]Akt IV: Thronsturz[/b][/url]",
      "[h2]Das gesamte Abenteuer wartet[/h2]",
      "Zu guter Letzt: Falls Sie erst jetzt zum letzten Akt auf das Thronsturz-Event aufmerksam werden … Herzlich willkommen! Alle vorangegangenen Akte sind weiterhin verfügbar und bleiben es auch bis zum Ende des Thronsturz-Events am 15. Januar 2025. Sie haben also noch ausreichend Zeit, um loszulegen. Lassen Sie sich die Fülle an tollen Inhalten nicht entgehen!",
      "Das gilt übrigens auch für alle Thronsturz-Veteranen. Falls Sie die vorangegangenen Akte bereits angespielt haben und doch lieber auf die vollständige Veröffentlichung warten wollten, dann ist jetzt der richtige Moment dafür. Das gesamte Thronsturz-Abenteuer kann nach Belieben erkundet werden: Bahnen Sie sich Ihren Weg durch die verschiedenen Gebiete, folgen Sie der spannenden Handlung, spielen Sie spaßige Minispiele und schalten Sie dabei alle Arkana-Stile frei. ",
      "Und – nicht zu vergessen – geben Sie alle Ihre Münzen und Bonbons aus. Diejenigen unter Ihnen, die Münzen horten (oder beim Durchspielen von Akt IV noch mehr verdienen), sollten nicht vergessen, diese vor Ende des Thronsturz-Events am 15. Januar einzutauschen."
    ],
    "commentcount": 571,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1731033104_0",
      "mod_require_rereview"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 6975,
    "votedowncount": 548,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 2,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731102908,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1731033104,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 6968,
  "votes_down": 545,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}