{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "Встречайте, Kez и четвёртый акт «Павшей короны»",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731102908
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Встречайте, Kez и четвёртый акт «Павшей короны»",
    "posttime": 1731032533,
    "updatetime": 1731102908,
    "body": [
      "[url=https://www.dota2.com/kez][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "Сегодняшнее обновление — больше некуда. В нём мы не только выпускаем финальный четвёртый акт эпической истории «Павшая корона», но и торжественно встречаем нового героя по имени Kez!",
      "[h2]Герой нелётных[/h2]",
      "Если вы помогали Шен в третьем акте, то уже должны были продраться сквозь ледяную тундру Айсрека, найти изгнанного из Айсрека Кеза и убедить его вместе с вами вернуться домой. В четвёртом акте он собирается вновь созвать казураев и помочь вам навсегда избавить Скайрас от Империи. А в свободное от цареубийства время он более чем рад предложить свои клинки к участию в битве Древних. ",
      "Мастер боевых искусств привнесёт в сражение немало разнообразия, ведь своей врождённой способностью он меняет не просто оружие, но и стиль боя, в результате чего ему в любой момент доступен солидный арсенал из восьми способностей (два по цене одного — налетай!). Посетите [url=https://www.dota2.com/kez]посвящённый Кезу сайт[/url], чтобы узнать всё о его боевых возможностях.",
      "[b][url=https://www.dota2.com/kez]Страница героя[/url] [/b]",
      "[h2]«Павшая корона», акт IV: Шпили Скайраса[/h2]",
      "Когда король Татрасиэль умер от болезни, его дочь Шен стояла первой в очереди наследования престола. Но её младшая сестра Империя пошла на предательство и скинула её с высочайшего шпиля Гнезда, обрекая на смерть. Богиня нелётных Скри'Ок нашла Шен и наделила силами, которые обратили её в мстительную душу, Vengeful Spirit.",
      "  ",
      "Сегодня воскрешённая Шен возвращается в Скайрас, чтобы сразиться за судьбу престола со своей сестрой. И возвращается она не в одиночестве. Все герои, которые поддерживали её — от Драгонуса до Акса, от Кеза до Кристальной Девы — с битвой прорвутся по трём разным путям до шпилей Тернового Гнезда, в котором Империя уже готовится к финальной битве.",
      "Четвёртый акт «Павшей короны» станет эпическим завершением путешествия, в ходе которого мы побывали на скромных улочках Межпутья, в обманчивых красных песках Друуда, посреди ледяных пустошей Айсрека и, наконец, доберёмся до тронного зала Тернового Гнезда, чтобы одолеть Империю. В этом акте вас ждёт обширная карта с тремя ветками повествования, дополнительными заданиями, минииграми и возможностью не просто остановить Империю, но ещё и открыть новые стили для Arcana-предметов на Skywrath Mage и Vengeful Spirit. Так что настраивайтесь на расхищение богатств королевства по пути к дворцу.",
      "Также мы заготовили награды для комплекта исследователя четвёртого акта, которые включают в себя новые особые башни Скри'Ок и Авилливы, а также новые Immortal-предметы. А обладатели комплектов исследователя каждого акта получат особый сюрприз. На карте четвёртого акта они смогут посетить заклинателя змей и получить эксклюзивные наклейки с персонажами из «Павшей короны». ",
      "[h2]К ознакомлению[/h2]",
      "Если вы неотрывно следили за сюжетом «Падшей короны» и готовы сразу приступать к четвёртому акту, не забудьте ознакомиться с комиксом [url=https://www.dota2.com/crownfall/comic4]«Падение короны»[/url]. Если же вам хотелось бы сначала освежить воспоминания, в этом вам помогут комиксы предыдущих актов: ",
      "[url=https://www.dota2.com/crownfall/comic][b]Акт I: День вознесения[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2][b]Акт II: Битва у Адской лощины[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3][b]Акт III: Дракон[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4][b]Акт IV: Падение короны[/b][/url]",
      "[h2]Доступно ВСЁ![/h2]",
      "И наконец, если вы к нам только-только присоединились — добро пожаловать! Все предыдущие акты открыты и закроются вместе со всем событием 15 января 2025 года, так что у вас полно времени приступить к прохождению события и ознакомиться со всем многообразием его контента.",
      "Впрочем, мы рады приветствовать не только новичков. Если вы не торопились проходить предыдущие акты в ожидании выхода последнего — ваш дозор окончен. Теперь вам открыты все просторы «Павшей короны». Исследуйте все карты, познайте все истории, наиграйтесь во все миниигры и откройте все стили для Arcana-предметов. ",
      "И обязательно потратьте все-все монеты и конфеты. Если вы потратили ещё не всё (или планировали заработать побольше в течение четвёртого акта), то вы сможете сделать это вплоть до 15 января."
    ],
    "commentcount": 571,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1731033104_0",
      "mod_require_rereview"
    ],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 6975,
    "votedowncount": 548,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 2,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731102908,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1731033104,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 6968,
  "votes_down": 545,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}