{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "ขอแนะนำ Kez และศึกบัลลังก์วิบัติบทที่ IV",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731028418
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "ขอแนะนำ Kez และศึกบัลลังก์วิบัติบทที่ IV",
    "posttime": 1731032533,
    "updatetime": 1731032533,
    "body": [
      "[url=https://www.dota2.com/kez][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "การอัปเดตของวันนี้ยิ่งใหญ่มาก นอกจากเราจะเผยแพร่บทสุดท้ายของมหากาพย์ศึกบัลลังก์วิบัติแล้ว เรายังเฉลิมฉลองด้วยการเปิดตัว \"Kez\" ฮีโร่ใหม่ที่พร้อมให้เล่นอีกด้วย!",
      "[h2]ฮีโร่ของชาวไร้บังเหิน[/h2]",
      "หากคุณได้ช่วยเหลือ Vengeful Spirit ในศึกบัลลังก์วิบัติบทที่ III ก็คงพอจำได้ว่าคุณได้เดินทางฝ่าดินแดนทุ่งน้ำแข็งไอซ์แร็กไปพบกับ Kez ผู้ถูกเนรเทศจากสกายแรธและชวนเขากลับบ้านไปด้วยกัน ในศึกบัลลังก์วิบัติบทที่ IV นี้ เขาวางแผนที่จะรื้อฟื้นกองทัพคาซูไรขึ้นมาใหม่และช่วยคุณกำจัดอิมพีเรียออกจากสกายแรธอย่างถาวร และเมื่อเขาว่างเว้นจากการช่วยคุณโค่นล้มราชวงศ์แล้ว เขาก็ยินดีที่จะใช้คมดาบของเขารับงานฟรีแลนซ์มาฟาดฟันศิลาโบราณ ",
      "จอมยุทธ์ผู้นี้มาพร้อมกับแนวทางที่หลากหลายด้วยสกิลประจำตัวที่สามารถสลับไปมาระหว่างดาบ Kazurai Katana และดาบ Shodo Sai (ที่มาพร้อมกับพลังมากมายเหลือคณานับ) เชิญเข้าไปดู[url=https://www.dota2.com/kez]หน้าแนะนำตัวของ Kez[/url] เพื่อเรียนรู้เพิ่มเติมเกี่ยวกับศักยภาพในด้านการต่อสู้ของเขาทั้งหมด",
      "[b][url=https://www.dota2.com/kez]เยี่ยมชมหน้าแนะนำตัวของ Kez[/url] [/b]",
      "[h2]ศึกบัลลังก์วิบัติบทที่ IV: ยอดแหลมแห่งสกายแรธ[/h2]",
      "เจ้าหญิงเชนคือทายาทองค์แรกที่พร้อมขึ้นครองราชบัลลังก์สกายแรธเมื่อ \"ราชาตาตราเซียล\" พระบิดาของเธอล้มป่วยและสิ้นพระชนม์ แต่แล้ว \"อิมพีเรีย\" ผู้เป็นน้องสาวได้ทรยศต่อเธอ ผลักเธอร่วงหล่นตกจากยอดหอคอยสูงแห่งเนสต์ออฟธอร์น ทิ้งให้เธอนอนรอความตาย เทพีสกรี'ออคได้ผ่านเข้ามาพบเธอ และประทานพลังแห่งวิญญาณผู้พยาบาทให้เธอ",
      "  ",
      "บัดนี้ เจ้าหญิงเชนผู้ฟื้นคืนพระชนม์ได้กลับมายังสกายแรธเพื่อตัดสินชะตากรรมของราชบัลลังก์ด้วยการห้ำหั่นกับน้องสาวของเธอ และเธอมิได้มาเพียงลำพัง เหล่าฮีโร่มากมายคอยช่วยเหลือเธอมาตลอดทาง ตั้งแต่ Dragonus ไปจนถึง Axe ไปจนถึง Kez ไปจนถึง Crystal Maiden และอีกมากมาย จะร่วมกันต่อสู้ฝ่าฟันผ่านเส้นทางสามสาย มุ่งหน้าไปทางยอดแหลมแห่งสกายแรธเพื่อเข้าสู่เนสต์ออฟธอร์น ที่ซึ่งอิมพีเรียเฝ้ารอรับมือกับสงครามครั้งสุดท้าย",
      "ศึกบัลลังก์วิบัติบทที่ IV คือบทสรุปอันยิ่งใหญ่ของมหากาพย์ที่พาเราเดินทางจากตลาดเล็ก ๆ แห่งมิดเกตไปสู่ดินแดนทะเลทรายแดงแห่งดรูดและผืนน้ำแข็งร้างทางตอนเหนือ จนในที่สุดก็มาถึงเนสต์ออฟธอร์นซึ่งเป็นห้องพิพากษาของราชินีเพื่อการเผชิญหน้าครั้งสุดท้าย ศึกบัลลังก์วิบัติบทที่ IV มาพร้อมกับแผนที่โลกขนาดใหญ่ที่มีเส้นทางภารกิจสุดเร้าใจ 3 เส้นทาง ภารกิจรอง มินิเกม และโอกาสที่รอคอยนั่นคือการพิชิตอิมพีเรียเพื่อปลดล็อก Arcana รูปแบบพิเศษใหม่ล่าสุดของ Skywrath Mage และ Vengeful Spirit เตรียมตัวให้พร้อมสำหรับการปล้นสะดมคลังหลวงมากมายระหว่างการเดินทางไปยังพระราชวัง",
      "เรายังมีรางวัลนักเบิกทางใหม่สำหรับบทที่ IV โดยเฉพาะด้วย เช่น ป้อมศึกบัลลังก์วิบัติแบบใหม่ \"สกรี'ออค\" และ \"อาวิลลิวา\" พร้อมทั้งไอเท็ม Immortal ใหม่ เรายังได้เพิ่มเนื้อหาพิเศษสำหรับผู้ครอบครองแพ็กนักเบิกทางในแต่ละบทอีกด้วย ตอนนี้คุณสามารถแวะไปหาหมองูในเส้นทางภารกิจของเชนในบทที่ IV เพื่อรับรางวัลสติกเกอร์ตัวละครศึกบัลลังก์วิบัติรุ่นพิเศษจำนวนจำกัด ",
      "[h2]ตามทันทุกเหตุการณ์[/h2]",
      "หากคุณเล่นศึกบัลลังก์วิบัติมาตลอดในขณะที่แต่ละบทเริ่มเผยแพร่ และต้องการกระโจนเข้าสู่เนื้อหาใหม่ของบทที่ IV เลยก็อย่าลืมอ่านการ์ตูนบทนำตอนล่าสุด \"[url=https://www.dota2.com/crownfall/comic4]ศึกบัลลังก์วิบัติ[/url]\" ก่อนที่จะเริ่ม และหากคุณต้องการทบทวนความจำอย่างรวดเร็วว่ากำลังเกิดอะไรขึ้นกันแน่ก็สามารถอ่านบทนำของบทที่ I \"[url=https://www.dota2.com/crownfall/comic]วันขึ้นครองราชย์[/url]\" บทนำของบทที่ II \"[url=https://www.dota2.com/crownfall/comic2]สงครามลานโลกันตร์[/url]\" และบทนำของบทที่ III \"[url=https://www.dota2.com/crownfall/comic3]มังกร[/url]\" ",
      "[url=https://www.dota2.com/crownfall/comic][b]การ์ตูนบทที่ I: วันขึ้นครองราชย์[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2][b]การ์ตูนบทที่ II: สงครามลานโลกันตร์[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3][b]การ์ตูนบทที่ III: มังกร[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4][b]การ์ตูนบทที่ IV: ศึกบัลลังก์วิบัติ[/b][/url]",
      "[h2]ทั้งหมดนี้พร้อมแล้ว![/h2]",
      "สุดท้ายนี้ หากคุณเพิ่งมีโอกาสได้เข้าร่วมกับเราในบทสรุปปิดฉากศึกบัลลังก์วิบัติแล้วล่ะก็... ยินดีต้อนรับ! เนื้อหาในบทก่อนหน้านี้ทั้งหมดยังคงเปิดให้เข้าเล่นได้ และจะยังคงอยู่ต่อไปจนกว่าศึกบัลลังก์วิบัติจะสิ้นสุดลงในวันที่ 15 มกราคม 2025 ดังนั้นจึงยังมีเวลามากเพียงพอที่จะเริ่มเล่น มีเนื้อหามากมายรอคุณอยู่",
      "พวกคุณที่เหลือก็เช่นกัน หากคุณได้ลองเล่นในบทก่อนหน้านี้มาบ้างแล้ว แต่รอคอยให้มีเนื้อหาทั้งหมดพร้อมให้เข้าถึงได้ก่อนก็ไม่ต้องรออีกต่อไป ตอนนี้เนื้อหาของศึกบัลลังก์วิบัติทั้งหมดพร้อมให้คุณได้สำรวจ ตะลุยผ่านด่านแผนที่ทั้งหมด ไขปริศนาเรื่องราวทั้งหมด เล่นมินิเกมทั้งหมด และปลดล็อกรูปแบบพิเศษสำหรับ Arcana ทั้งหมด ",
      "...และใช้เหรียญและลูกกวาดของคุณทั้งหมดด้วย สำหรับทุกคนที่ยังเก็บเหรียญบัลลังก์วิบัติไว้ (หรือใครที่วางแผนจะหาเหรียญเพิ่มจากการเล่นบทที่ IV) ก็อย่าลืมใช้เหรียญเหล่านั้นก่อนที่กิจกรรมจะสิ้นสุดในวันที่ 15 มกราคม"
    ],
    "commentcount": 2,
    "tags": [],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731032534,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}