{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "Apresentando Kez e o 4º Ato da Queda Coronal",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731028418
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Apresentando Kez e o 4º Ato da Queda Coronal",
    "posttime": 1731032533,
    "updatetime": 1731032533,
    "body": [
      "[url=https://www.dota2.com/kez][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "A atualização de hoje é das grandes. Ela inclui não apenas o quarto e último ato do nosso épico \"Queda Coronal\", mas também estamos comemorando com o lançamento de Kez, um inédito herói jogável!",
      "[h2]Herói dos ápteros[/h2]",
      "Se você ajudou a Vengeful Spirit no 3º Ato da Queda Coronal, então atravessou as tundras das Geleiras Devastadas, encontrou Kez — exilado de Celestifúria — e o convenceu a voltar para casa com você. No 4º Ato, ele planeja reagrupar os Kazurai e ajudar você a livrar Celestifúria de Impéria de uma vez por todas. E quando não está ajudando você a cometer regicídio, ele terá o prazer de emprestar as suas lâminas para ajudar no retalho de alguns Ancestrais. ",
      "Com a habilidade nativa de trocar entre a sua Katana dos Kazurai e a Sai dos Shodo (destravando mais poderes do que há dias na semana), esse mestre das artes marciais tem inúmeras opções de movimentos. Confira o [url=https://www.dota2.com/kez]site de Kez[/url] para saber mais sobre tudo o que ele traz para a batalha.",
      "[b][url=https://www.dota2.com/kez]Acesse a página de Kez[/url] [/b]",
      "[h2]Queda Coronal, 4º Ato: Os Pináculos de Celestifúria[/h2]",
      "A Princesa Shen era a primeira na fila de sucessão para o trono de Celestifúria quando o seu pai, Rei Tatrasiel, adoeceu e morreu. Mas ela foi traída pela sua irmã caçula, Imperia, que a matou jogando-a da torre mais alta do Poleiro. Ela foi encontrada por Scree'Auk, deusa dos ápteros, e recebeu os poderes de um Espírito Vingativo.",
      "  ",
      "Hoje, a Shen ressuscitada retorna a Celestifúria para enfrentar a sua irmã pelo destino do trono. E ela não estará sozinha. Todos os heróis que a ajudaram nessa jornada — incluindo Dragonus, Axe, Kez, Crystal Maiden e outros — batalharão para escalar três caminhos distintos dos pináculos de Celestifúria até o Poleiro de Espinhos, onde Imperia os aguarda para a batalha final.",
      "O 4º Ato da Queda Coronal é a conclusão épica de uma jornada que nos levou do humilde mercado do Tronco Velho até as vastas areias vermelhas de Druud e ao inóspito norte congelado, enfim chegando ao Poleiro de Espinhos, a corte da própria rainha, para o grande embate final. O 4º Ato da conta com um novo grande mapa que apresenta três caminhos principais distintos, missões secundárias, minijogos e, finalmente, a chance de derrotar Imperia e destravar novos estilos alternativos para os Arcanos do Skywrath Mage e da Vengeful Spirit. Então prepare-se para saquear os tesouros reais até o caminho para o palácio.",
      "Também temos recompensas específicas para o Pacote de Exploração do 4º Ato, incluindo torres personalizadas de Scree'Auk e Avilliva, bem como novos Imortais. Até adicionamos conteúdos adicionais para portadores dos pacotes de exploração de cada ato anterior. Você já pode visitar o encantador de serpentes na linha de missões de Shen no 4º Ato para resgatar os seus adesivos exclusivos dos personagens da Queda Coronal. ",
      "[h2]Acompanhando a história[/h2]",
      "Se você tem avançado pela Queda Coronal assim que cada ato é lançado e gostaria de ir direto para o novo conteúdo do 4º Ato, não se esqueça de ler a história em quadrinhos introdutória do ato, \"[url=https://www.dota2.com/crownfall/comic4]Queda Coronal[/url]\", antes de começar. E caso precise relembrar o que precisamente está acontecendo, recomendamos que leia as HQs introdutórias do 1º Ato, \"[url=https://www.dota2.com/crownfall/comic]Dia da Ascensão[/url]\", do 2º Ato, \"[url=https://www.dota2.com/crownfall/comic2]A Batalha da Bacia do Inferno[/url]\" e do 3º Ato, \"[url=https://www.dota2.com/crownfall/comic3]O Dragão[/url]\". ",
      "[url=https://www.dota2.com/crownfall/comic][b]HQ do 1º Ato: Dia da Ascensão[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2][b]HQ do 2º Ato: A Batalha da Bacia do Inferno[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3][b]HQ do 3º Ato: O Dragão[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4][b]HQ do 4º Ato: Queda Coronal[/b][/url]",
      "[h2]Está tudo no ar![/h2]",
      "Por último, caso você esteja se juntando a nós agora para o último ato da Queda Coronal... Seja bem-vindo! Todos os atos anteriores ainda estão disponíveis, e assim permanecerão até o término da Queda Coronal no dia 15 de janeiro de 2025, então ainda há muito tempo para começar e muitos conteúdos para aproveitar.",
      "Isso também vale para o resto de vocês. Se você estava aguardando o lançamento de tudo antes de mergulhar na Queda Coronal, chegou a sua hora. Todos os atos estão disponíveis para exploração. Explore todos os mapas, desvende toda a história, jogue todos os jogos e destrave todos os estilos dos Arcanos. ",
      "... E, claro, gaste todas as suas moedas e doces. Caso tenha algum saldo de moedas da Queda Coronal (ou planeje obter mais ao jogar o 4º Ato), lembre-se de usá-las antes do término do evento no dia 15 de janeiro."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731032533,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}