{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "Xin giới thiệu Kez cùng Crownfall hồi IV",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731028418
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Xin giới thiệu Kez cùng Crownfall hồi IV",
    "posttime": 1731032533,
    "updatetime": 1731032533,
    "body": [
      "[url=https://www.dota2.com/kez][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "Bản cập nhật hôm nay lớn hết mức có thể. Không những xuất bản Hồi IV, hồi cuối cùng trong sử thi Crownfall chương hồi thú vị, chúng ta cũng chào mừng sự ra mắt của Kez, một tướng hoàn toàn mới!",
      "[h2]Anh hùng của người chân đất[/h2]",
      "Nếu từng đồng hành với Vengeful Spirit trong Crownfall Hồi III, bạn hẳn đã lê chân qua những đài nguyên băng giá của Icewrack, rồi tìm thấy Kez - kẻ lưu vong xứ Skywrath, và thuyết phục hắn cùng trở về nhà. Trong hồi IV này, Kez sẽ lên kế hoạch tái hợp đội binh Kazurai và giúp bạn vĩnh viễn giải phóng Skywrath khỏi ách cai trị của nữ đế Imperia. Và khi không bận bịu giúp bạn diệt vua chém chúa, hắn sẽ hào hứng kiếm thêm thu nhập bằng tài vung gươm múa võ để phá hủy Ancient. ",
      "Với kỹ năng bẩm sinh hoán đổi giữa hai phong cách vũ khí Kazurai Katana và Shodo Sai (mở ra nhiều sức mạnh hơn cả số ngày có trong tuần), bộ bí kíp võ công đây không thiếu cái để chọn. Xem qua [url=https://www.dota2.com/kez]trang giới thiệu Kez[/url] để tìm hiểu vị tướng này sẽ thổi qua chiến trường làn gió mới gì.",
      "[b][url=https://www.dota2.com/kez]Truy cập trang đáp về Kez[/url] [/b]",
      "[h2]Hồi IV Crownfall: Tháp treo vùng Skywrath[/h2]",
      "Công chúa Shen là người đứng đầu trong hàng thừa kế ngai vàng Skywrath, khi phụ thân cô, đức vua Tatrasiel, đổ bệnh và qua đời. Nhưng em gái Imperia phản bội, đã đẩy cô từ tòa tháp cao nhất Vương Sào và để mặc cô chết. Cô được tìm thấy bởi nữ thần của người chân đất, Scree'Auk, và bà trao cô sức mạnh để trở thành Vengeful Spirit.",
      "  ",
      "Ngày hôm nay, Shen hồi sinh, trở về Skywrath để giao tranh với người em gái nhằm định đoạt số phận của ngai vàng. Và cô ấy không hề đơn độc. Tất cả tướng lĩnh đã giúp cô trên con đường này, từ Dragonus, Axe, Kez, Crystal Maiden và nhiều nữa, sẽ chiến đấu qua ba con đường khác nhau trên các tháp treo Skywrath để đến Vương Sào Gai Góc, nơi Imperia chờ đợi một trận quyết tử cuối cùng.",
      "Hồi IV Crownfall là cái kết hoành tráng cho hành trình đã đưa chúng ta đi qua khu chợ bình dân của Cổng Giữa, lặn lội đến miền cát đỏ xứ Druud, buốt lạnh trước hoang mạc băng giá miền bắc, cuối cùng có mặt ở Vương Sào Gai Góc nơi chính nữ đế ngự tọa, và đánh một trận chiến khai thiên lập địa. Hồi IV mang đến bản đồ khủng với ba đường sứ mệnh, nhiệm vụ phụ, trò chơi, và cuối cùng, cơ hội để đánh bại Imperia mà mở khóa kiểu dáng phụ cho Arcana của Skywrath Mage và Vengeful Spirit. Vì thế hãy may túi ba gang, sẵn sàng hốt vàng bạc châu báu hoàng gia trên đường đến cung điện.",
      "Còn có phần thưởng Người tìm đường mới dành riêng cho hồi IV, bao gồm trụ Crownfall Scree'Auk và Avilliva cùng vật phẩm bất diệt mới. Chúng tôi thậm chí bổ sung nội dung cho người sở hữu gói tìm đường của các hồi khác. Bạn giờ có thể ghé thăm Người Dụ Rắn trong tuyến nhiệm vụ của Shen ở hồi IV để lấy những hình dán nhân vật Crownfall phiên bản giới hạn. ",
      "[h2]Bắt kịp tình hình[/h2]",
      "Nếu đã chơi qua Crownfall khi mỗi hồi ra mắt và muốn nhảy ngay vào nội dung mới của Hồi IV, đừng quên đọc qua tập truyện tranh giới thiệu mới nhất, \"[url=https://www.dota2.com/crownfall/comic4]Phế đế[/url]\", trước khi bắt đầu. Nếu cần ôn lại truyện, để bắt kịp chuyện gì đang diễn ra, bạn có thể đọc phần mở đầu Hồi I \"[url=https://www.dota2.com/crownfall/comic]Ngày đăng quang[/url]\", Hồi II \"[url=https://www.dota2.com/crownfall/comic2]Đại chiến lòng chảo địa ngục[/url]\" và Hồi III \"[url=https://www.dota2.com/crownfall/comic3]Con rồng[/url]\". ",
      "[url=https://www.dota2.com/crownfall/comic][b]Hồi I: Ngày đăng quang[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2][b]Hồi II: Đại chiến lòng chảo địa ngục[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3][b]Hồi III: Con rồng[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4][b]Hồi IV: Phế đế[/b][/url]",
      "[h2]Tất cả đã ra mắt rồi đó![/h2]",
      "Cuối cùng, nếu bạn chỉ mới nhập cuộc để tận hưởng hồi kết của Crownfall... cũng chào mừng luôn! Tất cả hồi trước vẫn ở đó cho đến khi Crownfall khép lại vào 15/01/2025, vậy nên không thiếu thời gian để bắt đầu ngấu nghiến hàng tấn nội dung hấp dẫn.",
      "Mấy bạn khác cũng vậy nha. Nếu vẫn đang thong thả trong các hồi trước mà chờ cho tất cả ra mắt, thì đừng chần chừ nữa. Toàn bộ Crownfall đã sẵn sàng để bạn khám phá. Đánh hết bản đồ, khám phá toàn bộ cốt truyện, chơi toàn bộ trò và mở khóa tất cả kiểu dáng Arcana. ",
      "...Và dĩ nhiên, tiêu sạch xu và kẹo nhé. Với những ai đang để dành xu Crownfall (hoặc định kiếm thêm khi chơi Hồi IV), hãy nhớ dùng hết trước khi sự kiện kết thúc vào 15/01."
    ],
    "commentcount": 6,
    "tags": [],
    "language": 28,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731032545,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}