{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "Παρουσιάζουμε τον Kez και την Πράξη IV του Crownfall",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731028418
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Παρουσιάζουμε τον Kez και την Πράξη IV του Crownfall",
    "posttime": 1731032533,
    "updatetime": 1731032533,
    "body": [
      "[url=https://www.dota2.com/kez][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "Η σημερινή ενημέρωση πιο μεγάλη δε γίνεται. Δεν κυκλοφορούμε απλά την τέταρτη και τελευταία Πράξη του πολυσκελούς μας έπους «Crownfall», γιορτάζουμε και το ντεμπούτο του Kez, ενός ολοκαίνουριου ήρωα!",
      "[h2]Ήρωας των Απτήνων[/h2]",
      "Αν βοηθήσατε τη Vengeful Spirit στην Πράξη III του Crownfall, έχετε ήδη διασχίσει τις παγωμένες τούνδρες της Icewrack, βρήκατε τον εξόριστο Kez από τη Skywrath και τον πείσατε να επιστρέψει μαζί σας. Στην Πράξη IV, ο Kez σχεδιάζει να ανασυγκροτήσει τους Καζουράι και να σας βοηθήσει να απαλλάξετε τη Skywrath από την Ιμπίρια μια και καλή. Όταν δε σας βοηθά να διαπράξετε βασιλοκτονία, αναλαμβάνει με μεγάλη χαρά να λαξεύσει τα Αρχαία με τις λεπίδες του. ",
      "Με την εγγενή του ικανότητα να εναλλάσσει στιλ όπλων από την Κατάνα των Καζουράι στο Σάι των Σόντο (ξεκλειδώνοντας δυνάμεις να φαν κι οι κότες), αυτός ο αριστοτέχνης των πολεμικών τεχνών διαθέτει πάρα πολλές επιλογές. Ρίξτε μια ματιά στη [url=https://www.dota2.com/kez]σελίδα υποδοχής του Kez[/url] για να μάθετε τι μπορεί να κάνει στη μάχη.",
      "[b][url=https://www.dota2.com/kez]Επισκεφθείτε τη σελίδα υποδοχής του Kez[/url] [/b]",
      "[h2]Crownfall – Πράξη ΙV: Οι Πύργοι της Skywrath[/h2]",
      "Η πριγκίπισσα Σεν ήταν η πρώτη στη σειρά διαδοχής του θρόνου όταν ο πατέρας της, Βασιλιάς Τατράσιελ, αρρώστησε και πέθανε. Αλλά η μικρότερη αδερφή της, η Ιμπίρια, την πρόδωσε, την έριξε από τον υψηλότερο πύργο του Θρόνου των Αγκαθιών και την άφησε μισοπεθαμένη. Τη βρήκε η θεά των Απτήνων, η Σκρι-οκ, και την έκανε Εκδικητικό Πνεύμα (Vengeful Spirit) δίνοντάς της δυνάμεις.",
      "  ",
      "Σήμερα, η αναστημένη Σεν επιστρέφει στη Skywrath για να πολεμήσει την αδερφή της και να κριθεί η τύχη του θρόνου. Και δεν θα είναι μόνη της. Όλοι οι ήρωες που τη βοήθησαν στην πορεία της, από τον Ντραγκόνους μέχρι τον Αξ, τον Κεζ, τη Ράιλαϊ και άλλους, θα πολεμήσουν σε τρεις διαφορετικές διαδρομές μέσα από τους πύργους της Skywrath και προς τον Θρόνο των Αγκαθιών, όπου τους περιμένει η Ιμπίρια για την τελική μάχη.",
      "Η Πράξη IV του Crownfall είναι η επική κατάληξη ενός ταξιδιού που μας πήγε από τις ταπεινές αγορές του Μεσοθυρίου, στους κόκκινους αμμόλοφους του Ντρουούντ, στην παγωμένη έρημο του βορρά και τέλος στον Θρόνο των Αγκαθιών, για την τελική αναμέτρηση με τη βασίλισσα. Η Πράξη IV διαθέτει έναν τεράστιο χάρτη κόσμου με τρία ξεχωριστά μονοπάτια αποστολών, δευτερεύουσες αποστολές, μίνι παιχνίδια και, επιτέλους, την ευκαιρία να κατατροπώσετε την Ιμπίρια και να ξεκλειδώσετε νέα εναλλακτικά στιλ των Arcana του Skywrath Mage και της Vengeful Spirit. Ετοιμαστείτε για πολλά βασιλικά λάφυρα στη διαδρομή προς το παλάτι.",
      "Έχουμε επίσης νέες ανταμοιβές Ιχνηλάτη για την Πράξη IV, που περιλαμβάνουν προσαρμοσμένους πύργους Scree'Auk και Avilliva και νέα Immortal. Προσθέσαμε επίσης επιπλέον περιεχόμενο για τους κατόχους πακέτων Ιχνηλάτη κάθε Πράξης. Μπορείτε τώρα να επισκεφτείτε τον Γητευτή Φιδιών στη γραμμή αποστολών της Σεν στην Πράξη IV για να αποκτήσετε τα αυτοκόλλητα περιορισμένης έκδοσης των χαρακτήρων του Crownfall. ",
      "[h2]Η ιστορία μέχρι τώρα[/h2]",
      "Αν παίζετε το Crownfall καθώς κυκλοφορεί κάθε Πράξη και θέλετε να μπείτε κατευθείαν στο περιεχόμενο της Πράξης ΙV, μην ξεχάσετε να διαβάσετε το νέο εισαγωγικό κόμικ, «[url=https://www.dota2.com/crownfall/comic4]Crownfall[/url]», πριν ξεκινήσετε. Κι αν χρειάζεστε ένα μικρό φρεσκάρισμα για να δείτε ακριβώς τι στο καλό συμβαίνει, μη διστάσετε να διαβάσετε την εισαγωγή της Πράξης I, «[url=https://www.dota2.com/crownfall/comic]Άνοδος[/url]», της Πράξης II, «[url=https://www.dota2.com/crownfall/comic2]Η Μάχη της Κοιλάδας του Διαβόλου[/url]» και της Πράξης III, «[url=https://www.dota2.com/crownfall/comic3]Ο Δράκος[/url]». ",
      "[url=https://www.dota2.com/crownfall/comic][b]Κόμικ Πράξης Ι: Άνοδος[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2][b]Κόμικ Πράξης ΙΙ: Η Μάχη της Κοιλάδας του Διαβόλου[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3][b]Κόμικ Πράξης III: Ο Δράκος[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4][b]Κόμικ Πράξης IV: Crownfall[/b][/url]",
      "[h2]Έχουν κυκλοφορήσει όλα![/h2]",
      "Τέλος, αν έρχεστε τώρα στην παρέα μας, για την τελική πράξη του Crownfall... Καλώς ορίσατε! Όλες οι προηγούμενες Πράξεις είναι ακόμα διαθέσιμες και θα παραμείνουν μέχρι τη λήξη του Crownfall στις 15 Ιανουαρίου 2025, οπότε υπάρχει ακόμα αρκετός χρόνος για να ξεκινήσετε και σας περιμένει αρκετό περιεχόμενο.",
      "Αυτό ισχύει και για τους υπόλοιπους από εσάς. Αν παίζατε χαλαρά τις προηγούμενες Πράξεις και περιμένατε να γίνουν όλες διαθέσιμες, δεν χρειάζεται να περιμένετε άλλο. Ολόκληρο το Crownfall είναι τώρα δικό σας για να το εξερευνήσετε. Ανακαλύψτε όλους τους χάρτες, ξετυλίξτε ολόκληρη την ιστορία, παίξτε όλα τα παιχνίδια και ξεκλειδώστε όλα τα στιλ Arcana. ",
      "Και, φυσικά, ξοδέψτε όλα τα νομίσματα και τα γλυκά σας. Όσοι κρατάτε τα Νομίσματα Crownfall σας (ή όσοι σκοπεύετε να κερδίσετε περισσότερα παίζοντας την Πράξη IV), μην ξεχάσετε να τα χρησιμοποιήσετε πριν λήξει το συμβάν στις 15 Ιανουαρίου."
    ],
    "commentcount": 7,
    "tags": [],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 5,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731032607,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}