{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "Débuts de Kez et acte IV de La Chute de la couronne",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731028418
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Débuts de Kez et acte IV de La Chute de la couronne",
    "posttime": 1731032533,
    "updatetime": 1731032533,
    "body": [
      "[url=https://www.dota2.com/kez][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "La mise à jour d'aujourd'hui est phénoménale. Nous ne sortons pas seulement le quatrième et dernier acte de l'épopée de La Chute de la couronne, nous célébrons aussi les débuts de Kez, notre tout dernier héros !",
      "[h2]Héros des aptères[/h2]",
      "Si vous avez aidé Vengeful Spirit dans l'acte III de Crownfall, vous avez déjà fait un bout de chemin dans la toundra gelée des landes de Glace avec Falco, de son surnom Kez, qui s'était exilé loin de Skywrath. Et vous l'avez enfin convaincu de rentrer avec vous. Dans l'acte IV, il prévoit de reformer les Kazuraïs et de vous aider à débarrasser Skywrath d'Imperia une bonne fois pour toutes. Et quand il ne vous aidera pas à commettre un régicide, il sera ravi de mettre à disposition ses talents d'épéiste pour découper quelque Ancient. ",
      "Avec sa capacité innée qui lui permet de passer du Kazurai Katana aux Shodo Sai (et de débloquer plus de pouvoirs qu'il n'y a de jours dans la semaine), ce maitre des arts martiaux a toute une panoplie d'options. Rendez-vous sur la [url=https://www.dota2.com/kez]page de présentation de Kez[/url] pour en savoir plus sur tous ses atouts au combat.",
      "[b][url=https://www.dota2.com/kez]Se rendre sur la page de présentation de Kez[/url] [/b]",
      "[h2]La Chute de la Couronne, acte IV : Les Aiguilles de Skywrath[/h2]",
      "La princesse Shen était la première dans la ligne de succession du trône de Skywrath quand son père, le roi Tatrasiel, tomba malade et décéda. Hélas, sa petite sœur Imperia la trahit et la jeta dans le vide depuis la tour la plus haute du Nid, la laissant pour morte. Elle fut recueillie par Scree'Auk, la déesse des aptères et elle reçut les pouvoirs vengeurs de Vengeful Spirit.",
      "  ",
      "Désormais ressuscitée, Shen retourne à Skywrath pour affronter sa sœur, et remettre le sort du trône en jeu. Et elle n'est pas seule. Tous les héros et héroïnes qui l'ont aidée tout au long de son parcours, de Dragonus à Axe, en passant pas Kez (Falco) et Crystal Maiden, vont combattre à ses côtés pour se frayer un chemin parmi les trois voies possibles menant au sommet des aiguilles de Skywrath où est établi le Nid d'épines. C'est là qu'Imperia les attend pour la bataille finale.",
      "L'acte IV de La Chute de la couronne est la conclusion épique d'un périple au long cours : démarré sur les marchés de la Patte-d'Oie, il s'est continué dans le désert de sable rouge de Druud, puis dans les landes de Glace du Grand Nord, pour enfin se terminer au Nid d'épines, à la cour de la reine elle-même, pour une ultime confrontation. L'acte IV peut s'enorgueillir d'une nouvelle carte du monde impressionnante, avec trois chemins de quête distincts, des quêtes secondaires, des minijeux et enfin, une chance de vaincre Imperia et de débloquer les styles alternatifs des Arcanes de Skywrath Mage et de Vengeful Spirit. Alors, préparez-vous à vous remplir les poches de trésors royaux en chemin vers le palais.",
      "Nous avons également de nouvelles récompenses dans le pack d'expédition spécifique à l'acte IV, dont des tours tout spécialement pour Scree'Auk et Avilliva et de nouveaux objets immortels. Nous avons même ajouté du contenu bonus pour celles et ceux qui possèderont le pack d'expédition de chaque acte. Retrouvez le charmeur de serpent dans la quête principale de Shen dans l'acte IV pour récupérer vos autocollants des personnages de La Chute de la couronne en édition limitée. ",
      "[h2]Rattrapage[/h2]",
      "Si vous avez suivi avec ferveur les derniers actes de La Chute de la couronne et que vous voulez découvrir dès maintenant le nouveau contenu de l'acte IV, n'oubliez pas de lire sa BD d'introduction, « [url=https://www.dota2.com/crownfall/comic4]La Chute de la couronne[/url] » avant de commencer. Et si vous avez besoin de dépoussiérer tout ça pour vous souvenir précisément de ce qu'il se passe, n'hésitez pas à relire l'acte I d'introduction, « [url=https://www.dota2.com/crownfall/comic]Jour de l'Ascension[/url] », l'acte II, « [url=https://www.dota2.com/crownfall/comic2]La Bataille du bassin Infernal[/url] » et l'acte III, « [url=https://www.dota2.com/crownfall/comic3]Le Dragon[/url] ». ",
      "[url=https://www.dota2.com/crownfall/comic][b]BD de l'acte 1 : Jour de l'Ascension[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2][b]BD de l'acte II : La Bataille du bassin Infernal[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3][b]BD de l'acte III : Le Dragon[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4][b]BD de l'acte IV : La Chute de la couronne[/b][/url]",
      "[h2]Tout est en ligne ![/h2]",
      "Enfin, si vous nous rejoignez seulement maintenant pour l'acte de conclusion de La Chute de la couronne… nous vous souhaitons la bienvenue ! Tous les actes précédents restent disponibles, et ce, jusqu'à la clôture de La Chute de la couronne, le 15 janvier 2025. Vous avez donc largement le temps de commencer l'aventure et de parcourir une abondance de contenu.",
      "Ça vaut pour vous autres également. Si vous n'avez exploré que la surface des actes précédents dans l'expectative de l'histoire entière, n'attendez plus. Vous pouvez vous plonger dans La Chute de la couronne dans son intégralité. Parcourez toutes les cartes, découvrez toute l'histoire, jouez à tous les minijeux et débloquez tous les styles pour les Arcanes. ",
      "… Et bien sûr, dépensez toutes vos pièces et tous vos bonbons. S'il vous reste des pièces de la La Chute de la couronne, dépensez-les avant la fin de l'évènement le 15 janvier. Cela vaut pour les pièces gagnées en jouant à l'acte IV."
    ],
    "commentcount": 4,
    "tags": [],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731032534,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}