{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "Presentiamo Kez e l'Atto IV di Crownfall",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731028418
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Presentiamo Kez e l'Atto IV di Crownfall",
    "posttime": 1731032533,
    "updatetime": 1731032533,
    "body": [
      "[url=https://www.dota2.com/kez][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "L'aggiornamento di oggi è davvero da perdere la testa. Non solo pubblichiamo il quarto e ultimo atto della saga in più parti di Crownfall, ma festeggiamo anche il debutto di Kez, un nuovissimo Eroe giocabile!",
      "[h2]L'Eroe dei Tarpati[/h2]",
      "Se hai aiutato Vengeful Spirit nell'Atto III di Crownfall, avrai già attraversato le tundre ghiacciate del Deserto di Ghiaccio, avrai trovato Kez, l'esule di Skywrath, e lo avrai convinto a tornare a casa con te. Nell'Atto IV, progetta di riunire i Kazurai e di aiutarti a liberare Skywrath da Imperia una volta per tutte. E quando non ti aiuta a commettere un regicidio, sarà felicissimo di prestare le sue lame per un lavoretto da freelance, facendo a pezzetti qualche Antico. ",
      "Con la possibilità di cambiare l'arma in dotazione tra la sua katana Kazurai e i pugnali Sai Shodo (sbloccando più abilità di quanti giorni ci siano in una settimana), questo maestro delle arti marziali è pronto per ogni tipo di sfida. Dai un'occhiata alla [url=https://www.dota2.com/kez]pagina di Kez[/url] per saperne di più su ciò che può fare in battaglia.",
      "[b][url=https://www.dota2.com/kez]Visita la pagina di Kez[/url] [/b]",
      "[h2]Crownfall - Atto IV: Le Torri di Skywrath[/h2]",
      "La principessa Shen era la prima in linea di successione al trono di Skywrath quando suo padre, il re Tatrasiel, si ammalò e morì. Ma la sorella minore Imperia la tradì, gettandola dalla torre più alta del Nido e lasciandola per morta. Fu trovata dalla dea dei Tarpati Scree'Auk che le conferì i poteri di Vengeful Spirit.",
      "  ",
      "Oggi, la risuscitata Shen torna a Skywrath per combattere la sorella in nome del destino del trono. E non sarà sola. Tutti gli Eroi che si sono schierati al suo fianco lungo il cammino, da Dragonus ad Axe, Kez, Crystal Maiden e molti altri, combatteranno lungo le torri di Skywrath in tre diversi percorsi fino al Nido di Spine, dove li attenderà la battaglia finale contro Imperia.",
      "L'Atto IV di Crownfall è l'epica conclusione di un'avventura che ci ha portato dagli umili mercati dei Cancelli di mezzo alle dune di sabbia rossa di Druud alle lande gelate del nord, e infine al Nido di Spine, la sala delle udienze della regina stessa, dove ci sarà la resa dei conti finale. L'Atto IV introduce una nuova ed enorme mappa della regione con tre distinti Cammini di missioni, missioni secondarie, minigiochi, e infine la possibilità di sconfiggere Imperia e sbloccare i nuovi stili Arcani alternativi di Skywrath Mage e Vengeful Spirit. Quindi preparati a saccheggiare il tesoro del regno mentre ti dirigi verso il palazzo reale.",
      "Ci sono anche nuove ricompense nel Pacchetto Pioniere dell'Atto IV, tra cui torri personalizzate in onore di Scree'Auk e Avilliva, oltre a nuovi oggetti Immortali. Inoltre, i possessori del Pacchetto del Pioniere possono contare su contenuti aggiuntivi per ogni atto. Puoi ora visitare l'Incantatore di serpenti nella missione di Shen nell'Atto IV per riscattare gli adesivi in edizione limitata dei personaggi di Crownfall. ",
      "[h2]Punto della situazione[/h2]",
      "Se hai giocato a Crownfall man mano che ogni atto veniva pubblicato e vuoi tuffarti subito nei nuovi contenuti dell'Atto IV, non dimenticarti di leggere l'ultimo fumetto introduttivo, \"[url=https://www.dota2.com/crownfall/comic4]Crownfall[/url]\", prima di iniziare. E se invece hai voglia di un rapido ripasso su cosa diavolo stia succedendo esattamente, sentiti libero di leggere l'introduzione dell'Atto I \"[url=https://www.dota2.com/crownfall/comic]Il Giorno dell'Ascesa[/url]\", dell'Atto II \"[url=https://www.dota2.com/crownfall/comic2]La battaglia della Valle Infernale[/url]\" e dell'Atto III \"[url=https://www.dota2.com/crownfall/comic3]Il Drago[/url]\". ",
      "[url=https://www.dota2.com/crownfall/comic][b]Atto I del fumetto: Il Giorno dell'Ascesa[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2][b]Atto II del fumetto: La battaglia della Valle Infernale[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3][b]Atto III del fumetto: Il Drago[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4][b]Atto IV del fumetto: Crownfall[/b][/url]",
      "[h2]È tutto nel gioco![/h2]",
      "Ultimo ma non meno importante, se ti stai unendo a noi solo ora per l'atto finale di Crownfall... benvenuto! Tutti gli atti precedenti sono ancora disponibili e lo saranno fino alla conclusione di Crownfall, il 15 gennaio 2025, quindi hai ancora molto tempo per iniziare e un sacco di contenuti, non perderteli!",
      "Questo vale anche per gli altri. Se hai giocato con troppa calma in attesa che tutto fosse disponibile prima, non aspettare oltre. Crownfall è pronto a essere esplorato dall'inizio alla fine. Percorri tutte le mappe, svela l'intera storia, gioca a tutti i titoli e sblocca tutti gli stili Arcani. ",
      "...E, naturalmente, spendi tutte le tue monete e i tuoi dolci. Se hai ancora delle monete di Crownfall (o se pensi di guadagnarne altre giocando all'Atto IV), ricordati di usarle prima della fine dell'evento, il 15 gennaio."
    ],
    "commentcount": 6,
    "tags": [],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731032545,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}