{
  "gid": "4446834797838336420",
  "clan_steamid": "103582791433224455",
  "event_name": "Przedstawiamy Keza i akt IV Utraconej Korony",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1731032520,
  "rtime32_end_time": 1731036601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "3e9f7a865b5e4c842174387f2d991bed770d24a6.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1730848210
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1731031983
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1731028418
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1731032532
      }
    ]
  },
  "announcement_body": {
    "gid": "4446834797838336421",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Przedstawiamy Keza i akt IV Utraconej Korony",
    "posttime": 1731032533,
    "updatetime": 1731032533,
    "body": [
      "[url=https://www.dota2.com/kez][img]{STEAM_CLAN_LOC_IMAGE}/3703047/3e9f7a865b5e4c842174387f2d991bed770d24a6.png[/img][/url]",
      "Dzisiejsza aktualizacja jest tak ogromna, jak tylko się da. Nie tylko wydajemy czwarty i finalny akt naszej epickiej sagi o Utraconej Koronie, ale również świętujemy debiut Keza, całkowicie nowego grywalnego bohatera!",
      "[h2]Bohater Uziemionych[/h2]",
      "Jeżeli pomogliście Mściwej Duszy w akcie III Utraconej Korony, to już przetarliście sobie drogę przez mroźne tundry Lodowej Ruiny, znaleźliście wygnańca z Niebogniewia (Keza) i przekonaliście go, by wrócił z wami do domu. W akcie IV jego planem jest ponowne zwołanie Kazurajów do boju i pomóc wam pozbyć się Imperii i usunąć ją z Niebogniewia raz na zawsze. A gdy akurat nie będzie wam pomagać w popełnianiu królobójstwa, z ogromną chęcią użyczy wam swych ostrzy, by dorobić sobie na struganiu paru Starożytnych. ",
      "Dzięki swej umiejętności wrodzonej, która pozwala mu zmieniać styl broni między kazurajską kataną a dwoma sai z zakonu shodo (odblokowując przy tym więcej możliwości niż jest dni w tygodniu), ten mistrz sztuk walki oferuje tony opcji. Sprawdźcie [url=https://www.dota2.com/kez]stronę docelową Keza[/url], by dowiedzieć się więcej o wszystkim, co może wnieść do walki.",
      "[b][url=https://www.dota2.com/kez]Odwiedźcie stronę docelową Keza.[/url][/b]",
      "[h2]Akt IV Utraconej Korony: Iglice Niebogniewia[/h2]",
      "Księżniczka Shen była pierwsza w sukcesji do tronu Niebogniewia, gdy jej ojciec, król Tatrasiel, zachorował i umarł. Jednak jej młodsza siostra Imperia zdradziła ją, zrzucając ją z najwyższej wieży w Siedlisku i zostawiając ją na pastwę losu. Shen została znaleziona przez boginię Uziemionych, Scree'Auk i obdarowana mocą, która przeobraziła ją w Mściwą Duszę.",
      "  ",
      "Wskrzeszona Shen powraca dziś do Niebogniewia, by stoczyć bitwę z jej siostrą o los tronu. I nie będzie w tej walce osamotniona. Wszyscy bohaterowie, którzy pomogli jej podczas jej przygód, od Dragonusa, przez Kata i Keza, do Kryształowej Panny i wielu innych, wywalczą sobie drogę przez 3 odrębne ścieżki w górę iglic Niebogniewia aż po Siedlisko Cierni, w którym Imperia czeka na ostateczne starcie.",
      "Akt IV Utraconej Korony stanowi stosowną konkluzję do podróży na epicką skalę, która zabrała nas od skromnych targowisk Śródbramia przez czerwone piaski Druud i pustkowia zamarzniętej północy, aż po Siedlisko Cierni, salony samej królowej, gdzie czeka ona na ostateczne starcie. Akt IV oferuje nową, ogromną mapę świata z trzema odrębnymi ścieżkami zadań, misjami pobocznymi, minigrami i, wreszcie, szansą na pokonanie Imperii i odblokowanie nowych alternatywnych stylów arkanów dla Dragonusa i Shen. Przygotujcie się więc na obfite rabowanie królewskiego skarbca w drodze do pałacu.",
      "Przygotowaliśmy także nowe nagrody Pakietu Zwiadowcy specjalnie dla aktu IV, w tym niestandardowe wieże Utraconej Korony wzorowane na Scree'Auk i Avillivie, a także nowe przedmioty wiekopomne. Dodaliśmy nawet kolejne treści dla posiadaczy Pakietu Zwiadowcy w każdym akcie. Już teraz możecie odwiedzić zaklinacza węży w wątku fabularnym Shen w akcie IV, by odebrać naklejki postaci Utraconej Korony z limitowanej edycji. ",
      "[h2]Nadróbcie zaległości[/h2]",
      "Jeśli graliście na bieżąco w Utraconą Koronę w miarę wydawania kolejnych aktów i chcecie od razu przeskoczyć do zawartości aktu IV, nie zapomnijcie przeczytać najnowszego komiksu wprowadzającego do tegoż aktu, czyli [url=https://www.dota2.com/crownfall/comic4]Utraconej Korony[/url], zanim zaczniecie. A jeśli nie przeszkadzałoby wam małe odświeżenie pamięci o tym, co się dokładnie do czorta dzieje, śmiało przeczytajcie komiksy wprowadzające do aktu I, II i III, czyli odpowiednio [url=https://www.dota2.com/crownfall/comic]Dzień Wstąpienia[/url], [url=https://www.dota2.com/crownfall/comic2]Bitwa pod Kotliną Piekieł[/url] oraz [url=https://www.dota2.com/crownfall/comic3]Smok[/url]. ",
      "[url=https://www.dota2.com/crownfall/comic][b]Komiks aktu I: Dzień Wstąpienia[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic2][b]Komiks aktu II: Bitwa pod Kotliną Piekieł[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic3][b]Komiks aktu III: Smok[/b][/url]",
      "[url=https://www.dota2.com/crownfall/comic4][b]Komiks aktu IV: Utracona Korona[/b][/url]",
      "[h2]To wszystko już dostępne![/h2]",
      "Na koniec chcemy powiedzieć, że jeśli dopiero co do nas dołączacie na akt końcowy Utraconej Korony… witamy! Wszystkie poprzednie akty są wciąż dostępne i pozostaną do czasu zakończenia wydarzenia 15 stycznia 2025, więc wciąż macie sporo czasu na rozpoczęcie i zabawę z ogromem czekających na was treści.",
      "To się tyczy również reszty z was. Jeżeli obijaliście się przy poprzednich aktach i czekaliście, aż wszystko będzie najpierw gotowe, to nie musicie już czekać. Całość Utraconej Korony jest już gotowa na wasze odkrycie. Przejdźcie przez wszystkie mapy, odkryjcie całą historię, rozegrajcie wszystkie gry i odblokujcie wszystkie style arkanów. ",
      "...i rzecz jasna, wydajcie wszystkie swoje monety i cukierki. Niech ci z was, którzy wręcz siedzą na monetach Utraconej Korony (albo którzy planują zdobyć więcej poprzez grę w akt IV) pamiętają, by użyć ich przed zakończeniem wydarzenia 15 stycznia."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4628105513087796066",
    "event_gid": "4446834797838336420",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4628105513087796066",
  "rtime32_last_modified": 1731032533,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4628105513087796066",
  "clan_steamid_original": "103582791433224455"
}