// 5509.js

{
  "language": "korean",
  "aug23_title": "2023년 8월 업데이트",
  "aug23_title_main": "여름 클라이언트 업데이트",
  "aug23_title_sub_top": "2023 수집가의 무기함 포함",
  "aug23_title_sub_bottom": "새로운 무기고, 새로운 플레이어 행동 시스템, 새로운 렌더링 기능",
  "aug23_title_body": "치장 아이템부터 악의적 행동 신고 방법까지, 다양한 부분에서 여러 가지로 큰 개선이 이루어지면서 그 어느 때보다 더 멋진 게임이 되었습니다. 이를 기념하고자, 16가지 새로운 치장 세트가 담긴 2023 수집가의 무기함을 선보입니다.",
  "aug23_gameplay_title": "게임플레이 7.34 업데이트",
  "aug23_armory_title": "완전히 새롭게 달라진 무기고",
  "aug23_armory_title_sub": "이제 무기고는 도타의 모든 치장 아이템을 한 곳에서 모두 해결할 수 있는 통합 상점이 되었습니다.",
  "aug23_armory_body": "10년간 새로운 기능과 인터페이스를 추가해 온 게임의 부작용이라면... 뭐, 가끔은 이런저런 것들이 좀 복잡해진다는 점이죠. 그래서, 단순한 단일 인터페이스를 만들어 사고파는 일부터 미리 보기로 확인하고 장착하는 일까지 아이템으로 할 수 있는 모든 사항이 처리되도록 했습니다.",
  "aug23_armory_visuals_title": "시각적 개선",
  "aug23_armory_visuals_body": "우수한 품질의 그림자와 개선된 조명으로 더 자세하게 표현되는 영웅을 경험해 보세요.",
  "aug23_armory_browse_title": "가진 것은 찾아보고... 가지지 않은 것은 찾아내세요",
  "aug23_armory_browse_body": "해당 영웅이 사용할 수 있는 모든 치장 아이템을 살펴보세요. 소유하지 않은 아이템까지도 모두 가능합니다. 이미 소유한 아이템은 탐색 인터페이스로 쉽게 장착할 수 있습니다.",
  "aug23_armory_paperdoll_title": "아이템 조합 체험",
  "aug23_armory_paperdoll_body": "영웅 체험 모드에서, 소유 여부에 상관없이 영웅에게 치장 아이템을 다양하게 혼합하여 착용해 보고 가장 잘 맞는 조합을 만들 수 있습니다.",
  "aug23_armory_global_title": "공용 아이템 섹션 개편",
  "aug23_armory_global_body": "짐꾼, 와드, 로샨 교체 아이템 등 영웅용이 아닌 치장 아이템을 손쉽게 찾아 장착할 수 있습니다.",
  "aug23_armory_sort_title": "장터 가격순 정렬",
  "aug23_armory_sort_body": "전체 아이템 범주에서, 보관함 전체를 현재 장터 가격으로 정렬할 수 있습니다.",
  "aug23_armory_stack_title": "중복 사항 겹쳐 놓기",
  "aug23_armory_stack_body": "이미 보유한 아이템의 중복 항목은 같은 칸에 묶어 놓아 보관함에서 쓸데없이 많은 칸을 차지하지 않게 할 수 있습니다.",
  "aug23_armory_highlight_title": "아이템 자동 강조 표시기",
  "aug23_armory_highlight_body": "새로운 아이템 강조표시기로 각각의 세트 부위를 더 자세하게 살펴볼 수 있습니다.",
  "aug23_cc_title": "수집가의 무기함",
  "aug23_cc_sub": "지금 무기고에서 이용 가능",
  "aug23_cc_body": "무기고의 특선 섹션에서 새로운 수집가의 무기함 아이템을 만나보세요.",
  "aug23_cc_btn": "지금 %1$s 구매",
  "aug23_cc_treasure_name1": "영령 그림자",
  "aug23_cc_treasure_name2": "황소 기수",
  "aug23_cc_treasure_name3": "투르스타르쿠리 순례자",
  "aug23_cc_treasure_name4": "이계의 전령",
  "aug23_cc_treasure_name5": "데준의 독사",
  "aug23_cc_treasure_name6": "어둠숲 추모사",
  "aug23_cc_treasure_name7": "토모칸 보병",
  "aug23_cc_treasure_name8": "조상의 유산",
  "aug23_cc_treasure_name9": "바다 혼령",
  "aug23_cc_treasure_name10": "여제의 승전",
  "aug23_cc_treasure_name11": "빛나는 주먹",
  "aug23_cc_treasure_name12": "태고의 흉물",
  "aug23_cc_treasure_name13": "불달팽이",
  "aug23_cc_treasure_name14": "초승달 여사냥꾼",
  "aug23_cc_treasure_name15": "천둥 야수",
  "aug23_cc_treasure_name16": "장막의 독재자",
  "aug23_playerbehavior_title": "플레이어 행동",
  "aug23_playerbehavior_subtitle": "다 함께, 도타를 즐기기 더 좋은 곳으로 만들기",
  "aug23_playerbehavior_body": "당연한 얘기인지도 모르지만, 가장 좋은 도타 게임이라면 팀과 함께 손발을 맞춰 플레이하며 마찬가지로 합을 맞춰 대항하는 상대 팀과 맞서는 게임이라 할 수 있습니다. 가장 나쁜 도타 게임이라면 그 정반대가 됩니다. 아군은 적이 아니라 팀원과 싸우고, 적은 순간을 노려 적절하게 능력을 사용하는 것이 아니라 대화 메시지로 싸우는 상황이죠.<br><br>달리 표현할 말이 없습니다. 악의적이고 부정한 행동을 하는 사람들과 도타를 하면 멋진 경험이 될 법한 매치를 망쳐버릴 수 있습니다. 그래서, 새로 선보이는 플레이어 행동 기능으로 좋은 경험은 더 많이 하고 나쁜 경험은 더 적게 할 수 있도록 했습니다. 이를 염두에 두고 아래에 자세히 설명된 개선 사항을 살펴보시기 바랍니다.",
  "aug23_playerbehavior_matchmaking_title": "개별 맞춤형 매치메이킹",
  "aug23_playerbehavior_matchmaking_body": "이전에는 플레이어가 게임 후에 다른 플레이어를 추천할 수 있었지만, 추천 여부가 향후 매치메이킹에 영향을 미치지는 않았습니다. 이제, 누군가를 추천하면 이후 매치에서 해당 플레이어를 아군으로든 적으로든 만날 가능성이 커집니다.<br><br>아울러, '비선호 플레이어' 버튼을 추가하여 어떤 이유에서든 함께 플레이하고 싶지 않은 플레이어는 이후 매치에서 만날 가능성이 작아지도록 했습니다.",
  "aug23_playerbehavior_reporting_title": "새로운 신고 시스템",
  "aug23_playerbehavior_reporting_body": "함께 플레이하고 싶지 않은 플레이어와 명백하게 악의적으로 행동하는 플레이어 사이에는 커다란 차이가 있을 수 있습니다. 이제부터는 도타의 새로운 신고 시스템으로 악의적 대화, 악의적 음성 대화, 부계정 악용, 의도적 방해, 부정행위, 역할 오용을 신고하실 수 있습니다.<br><br>모든 신고는 자동으로 확실하고 객관적인 데이터를 광범위하게 고려합니다. 의도적 방해 신고가 들어오면 누군가 아이템을 고의로 파괴했는지를 파악하고, 부계정 악용 신고가 있을 때는 게임플레이어와 계정 속성을 고려합니다.<br><br>플레이어는 이제 게임 중이나 후나 언제든 악의적 행동을 신고할 수 있습니다. 또한, 새로운 신고 시스템에서는 신고 횟수 제한이 사라지며, 아군이나 적군 어느 쪽 플레이어든 신고할 수 있습니다. 새로운 신고 데이터를 바탕으로 저희는 유해 행위를 하는 플레이어에게 좀 더 확실한 조치를 취할 뿐만 아니라 가짜 신고를 더 잘 구별하여 고려 대상에서 제외할 수 있으리라 기대합니다.",
  "aug23_playerbehavior_chat_title": "실시간으로 처리되는 악의적 대화",
  "aug23_playerbehavior_chat_body": "게임 내 점수판으로 악의적 대화를 한 사람을 신고하면, 해당 대화 내용이 실시간으로 분석됩니다. 문자 대화가 악의적이라고 판단되면, 모든 플레이어를 대상으로 하는 해당 플레이어의 음성 및 문자 대화가 즉시 차단되며, 해당 매치가 끝날 때까지 차단 상태가 유지됩니다.<br><br>핑 신호, ALT 클릭 및 사전 설정된 휠 대화는 사용할 수 있긴 하지만, 일정 부분 제한됩니다. 문제가 되는 플레이어는 문자 및 음성 대화가 차단되며, 그 외 모든 소통 방법에는 30초의 쿨다운이 적용됩니다.",
  "aug23_playerbehavior_scores_title": "행동 및 소통 점수",
  "aug23_playerbehavior_scores_body": "모든 플레이어가 0에서 10,000 사이의 수치로 게임 내 행위 수준을 나타내는 행동 점수를 보유합니다. 이제 플레이어는 소통 점수도 보유하는데, 이는 게임 내 채팅 및 대화로 하는 상호작용의 수준을 나타냅니다. 현재 행동 점수는 새로운 시스템으로 이어지지만, 새로운 행동 점수 및 소통 점수 모두 한도가 12,000점으로 상향되었습니다.<br><br>이전에는 플레이어의 행동 점수가 누구를 매치에서 만나는지에만 영향을 미쳤습니다. 이제는, 게임 후 아이템 획득, 게임 일시 정지, 랭크 플레이 등과 같은 기능을 이용하는 데도 영향을 미칩니다. 마찬가지로, 소통 점수는 아군 능력 핑 신호, 멘토링, 수고비 주기, 문자 및 음성 대화에 영향을 미칩니다. 소통 점수가 일정 수준 아래이면, 해당 플레이어의 문자 및 음성 대화는 차단되며, 그 외 모든 소통 방법에는 30초의 쿨다운이 적용됩니다.",
  "aug23_playerbehavior_forward_title": "이후 사항",
  "aug23_playerbehavior_forward_body": "본 시스템은 대량의 데이터 축적이 관건이므로, 시간이 지날수록 정확도가 더 높아질 것이 분명합니다. 그 말인즉슨, 이러한 변경이 적용된 초기에는 조치를 취하는 데 좀 더 보수적으로 접근할 가능성이 높다는 뜻입니다.<br><br>저희는 언제나 가장 확신할 수 있는 데이터를 바탕으로 조처하고자 합니다. 필요한 확신이 설 때까지, 그리고 여러분의 신뢰가 쌓일 때까지 함께 기다려 주셨으면 합니다.",
  "aug23_playerbehavior_goodreport_title": "올바른 신고 인식",
  "aug23_playerbehavior_goodreport_body": "누군가와 게임 안에서 안 좋은 경험을 한 것보다 더 기분 나쁜 일이 있다면, 그런 사람들은 그 이후에도 똑같이 행동하며 변함없이 다른 플레이어의 게임을 망칠 것이라는 사실입니다. 새로운 시스템은 처음부터 나쁜 행위를 하는 사람뿐 아니라 좋은 행위를 하는 사람에게도 영향을 미치는 조치를 취할 수 있도록 구축되었습니다. 따라서, 신고로 해당 플레이어에게 조치가 취해질 때마다, 신고 내용이 인정되었으며 어떤 플레이어에게 조치가 내려졌는지 알려드리겠습니다.",
  "aug23_maprendering_title": "지도 렌더링 업데이트",
  "aug23_maprendering_subtitle": "렌더링 처리 구조 업데이트로 시각적 개선 도모",
  "aug23_maprendering_body": "그동안 더 멋진 게임으로 만들고자 여러 가지 작업이 진행되었는데, 얼마나 좋아졌는지 하나하나 자세히 말로 설명해 드리겠습니다. 아니, 그냥 농담 좀 해봤습니다. 아래 슬라이더를 보시기 바랍니다.",
  "aug23_maprendering_before": "변경 전",
  "aug23_maprendering_after": "변경 후",
  "aug23_maprendering_cloudshadows_title": "그림자",
  "aug23_maprendering_cloudshadows_body": "구름은 다시 한번 그림자를 드리우고, 해 그림자는 이제 더 높은 해상도로 드리워집니다.",
  "aug23_maprendering_particles_title": "입자 조명",
  "aug23_maprendering_particles_body": "이제 입자 빛 효과가 지형과 영웅에 더 선명하게 나타나며, 포탑 공격과 같은 새로운 출처에 빛 효과가 추가되었습니다",
  "aug23_maprendering_tonemap_title": "색조 매핑",
  "aug23_maprendering_tonemap_body": "더 어두운 지도 영역에서 대비가 향상되었습니다",
  "aug23_lion_title": "라이온",
  "aug23_lion_body": "변경 사항 없음",
  "aug23_maprendering_final_title": "마무리하며",
  "aug23_maprendering_final_body": "모든 내용을 종합해 보면, 차이점이 바로 보입니다",
  "aug23_lorem_title": "불휘 기픈 남간 바라매 아니 뮐쌔",
  "aug23_lorem_longbody": "해동 육룡이 나라샤​ 일마다 천복이시니 고성이 동부하시니. 불휘 기픈 남간 바라매 아니 뮐쌔 곶 됴코 여름 하나니 새미 기픈 므른 가마래 아니 그츨쌔 내히 이러 바라래 가나니. 주국 대왕이 빈곡애 사라샤 제업을 여르시니 우리 시조 경흥에 사라샤 왕업을 여르시니. 적인 서리예 가샤 적인이 갈외어늘 기산 올마샴도 하낧뜨디시니 야인 서리예 가샤 야인이 갈외어늘 덕원 올마샴도 하날뜨디시니.",
  "aug23_lorem_shortbody": "해동 육룡이 나라샤​ 일마다 천복이시니 고성이 동부하시니. 불휘 기픈 남간 바라매 아니 뮐쌔 곶 됴코 여름 하나니 새미 기픈 므른 가마래 아니 그츨쌔 내히 이러 바라래 가나니."
}