// 7970.js

{
  "language": "thai",
  "crownfallcomic_title_cover": "วันขึ้นครองราชย์ - หน้าปก",
  "crownfallcomic_title": "วันขึ้นครองราชย์ - หน้า %1$s",
  "crownfallcomic_help_text": "คลิกที่รูปภาพหรือกด Space Bar เพื่ออ่านต่อ",
  "crownfallcomic_return_button": "ย้อนกลับไปยังหน้าปก",
  "crownfall_title": "ศึกบัลลังก์วิบัติ",
  "crownfall_welcome": "เล่น Dota เพื่อปลดล็อคสถานที่แปลกใหม่ ตัวละครใหม่ และความลับซ่อนเร้นในกิจกรรมมหากาพย์ต่อเนื่องซึ่งเปี่ยมไปด้วยฮีโร่ในตำนานและรางวัลที่ไม่ซ้ำใคร ผู้เล่น Dota ทุกคนสามารถเล่นได้ฟรี",
  "crownfall_newstory_title": "ทวงคืนบัลลังก์",
  "crownfall_newstory_description": "เชนเดลแซร์ ราชินีโดยชอบธรรมแห่งสกายแรธได้ถูกปลดออกจากตำแหน่งอย่างโหดเหี้ยมโดยอิมพีเรีย น้องสาวของเธอ ในฐานะสมาชิกของกลุ่มนักเวทคุ้มกันชั้นสุดสูงของอิมพีเรีย พลังและชีวิตของดราโกนัสต้องตกอยู่ภายใต้ความเมตตาของเธอ แต่ตอนนี้ ด้วยความช่วยเหลือจากเทพีนามว่าสกรี'ออค ทั้งสองได้รับมอบพลังใหม่และโอกาสสุดท้ายในการล้างแค้น... และทวงคืนบัลลังก์",
  "crownfall_comic_title": "ความเดิมจากเรื่องราวก่อนหน้านี้",
  "crownfall_comic_description": "ราชินีอิมพีเรียได้บัญญัติกฎห้ามบูชาสักการะสกรี’ออค หลังจากเทพีผู้ถูกไล่ต้องเข้าไปหลบซ่อนตัวในสลัมแห่งมิดเกต เธอก็วางแผนแบบหลังชนฝาเพื่อยึดควบคุมสกายแรธกลับคืนมา",
  "crownfall_comic_button": "อ่านการ์ตูน",
  "crownfall_howtoplay_title": "การผจญภัยรอคุณอยู่",
  "crownfall_howtoplay_description": "นำทางเชนและดราโกนัสผ่านถนนอันพลุกพล่านของสกายแรธในภารกิจทวงคืนบัลลังก์! พบปะกับทั้งตัวละครหน้าใหม่และหน้าเก่าที่ทุกคนชื่นชอบ เปิดเผยความลับดำมืด ลุยในภารกิจรองสุดป่วน และแถมยังพักตกปลาได้เป็นครั้งคราว รับรางวัลมากขึ้นเมื่อคุณเจาะลึกดำดิ่งในแผนที่ที่เต็มไปด้วยรายละเอียดให้คุณได้มีส่วนร่วม",
  "crownfall_explainer_a_long": "[b]สำรวจ[/b] เล่นเกม Dota ในระหว่างกิจกรรมศึกบัลลังก์วิบัติเพื่อรับโทเคน หากเล่นฮีโร่หลายตัวจะทำให้คุณได้รับโทเคนประเภทแตกต่างกัน",
  "crownfall_explainer_b_long": "[b]ปลดล็อค[/b] ใช้โทเคนปลดล็อคเส้นทางบนแผนที่โลกเพื่อดำเนินเรื่องและรับรางวัล คอยสังเกตหาเหตุการณ์พิเศษ เช่นพ่อค้าโทเคนและคาราวานขนมหวาน!",
  "crownfall_explainer_c_long": "[b]ล้างแค้น[/b] สะสมสมบัติ ลูกกวาด เหรียญบัลลังก์วิบัติ และอื่น ๆ อีกมากมายในขณะที่คุณต่อสู้เพื่อกำจัดราชินีอิมพีเรียจอมชั่วร้าย",
  "crownfall_fouracts_title": "เปิดเผยเรื่องราว",
  "crownfall_fouracts_description": "ตลาดแห่งมิดเกตเป็นเพียงบทแรกของเรื่องราว 4 บทต่อเนื่องซึ่งจะครอบคลุมในอีกหลายเดือนข้างหน้า คุณจะสามารถเล่นบทใหม่ได้ทันทีที่เปิดให้เล่น แต่คุณยังสามารถเดินทางผจญภัยตามความสะดวกของคุณได้เช่นกัน เมื่อเริ่มบทใหม่แล้วจะไม่ทำให้บทก่อนหน้านี้สิ้นสุดลงแต่อย่างใด [br][br]หมายความว่าคุณจะสามารถใช้เวลานานเท่าที่คุณต้องการสำหรับสำรวจทุกเส้นทาง การท้าทาย และสิ่งเร้นลับในบทที่ I และถึงแม้ว่าจะมีสิ่งให้ค้นพบมากมายแล้ว กิจกรรมนี้เพิ่งแค่เริ่มต้นเท่านั้น ศึกบัลลังก์วิบัติจะยิ่งใหญ่และอลังการขึ้นเรื่อย ๆ เมื่อเรื่องราวเปิดเผยออกมาในช่วงหลายเดือนข้างหน้า โดยบทใหม่แต่ละบทจะมาพร้อมเรื่องราว ตัวละคร แผนที่โลกพิเศษเฉพาะ และรางวัลเอี่ยมอ่อง แถมยังอาจมีเซอร์ไพรส์สักอย่างสองอย่างระหว่างทางอีกด้วย",
  "crownfall_rewards_title": "รางวัล",
  "crownfall_rewards_a": "เหรียญบัลลังก์วิบัติ",
  "crownfall_rewards_a_long_new": "รับเหรียญบัลลังก์วิบัติโดยการสำรวจเส้นทางต่าง ๆ บนแผนที่ เก็บสะสมให้ครบ 10 เหรียญเพื่อแลกเป็นส่วนลดประมาณ %1$s สำหรับสินค้าใดก็ตามในร้านค้าบัลลังก์วิบัติที่มีราคาตั้งแต่ %1$s (จำนวนส่วนลดที่แน่นอนจะแตกต่างกันไปตามภูมิภาคและสกุลเงิน)",
  "crownfall_rewards_b": "สมบัติ",
  "crownfall_rewards_b_long": "บทที่ I มาพร้อมกับสมบัติที่แตกต่างกัน 2 หีบ รวมเป็นชุดเซ็ตไอเท็มใหม่ 24 ชุด คุณจะสามารถปลดล็อคบางชุดได้โดยเพียงแค่เล่นเกม!",
  "crownfall_rewards_c": "ถุงลูกกวาด",
  "crownfall_rewards_c_long": "ตามล่าหาคาราวานขนมหวานของซิธิลและเควิร์ตบนแต่ละแผนที่ศึกบัลลังก์วิบัติเพื่ออัปเกรดและแลกเปลี่ยนลูกกวาดของคุณเป็นชุดเซ็ตฮีโร่, Courier, Ward และอีกมากมาย (แถมยังมีโอกาสหายากที่จะได้ Arcana!)",
  "crownfall_rewards_andmanymore": "แต่ไม่ได้มีแค่นี้! มาร่วมค้นพบหน้าจอโหลดใหม่ล่าสุด แสดงความเป็นตัวคุณด้วยอีโมติคอน สเปรย์ และประโยควงล้อสนทนาใหม่ แต่งร่างฮีโร่ของคุณแบบจัดเต็มด้วยชุดเซ็ตไอเท็มพิเศษเฉพาะที่ค้นพบได้ในเส้นทางของเนื้อเรื่อง และอีกมากมาย เราสร้างโลกทั้งใบรอให้คุณสำรวจ",
  "crownfall_explorerpack_title": "แพ็คนักเบิกทางแห่งมิดเกต",
  "crownfall_explorerpack_description": "รางวัลทั้งหมดในเส้นทางเนื้อเรื่องหลักของศึกบัลลังก์วิบัติจะมีให้สำหรับผู้เล่นทุกคนได้ฟรี แต่สำหรับนักผจญภัยผู้ช่ำชองที่ต้องการเจาะเข้าไปในบทที่ I ให้ลึกขึ้น แพ็คนักเบิกทางแห่งมิดเกตจะมอบการสำรวจแผนที่เพิ่มเติม เรื่องราวที่มากขึ้น และรางวัลเยอะกว่าเดิม",
  "crownfall_explorerpack_description_long": "เมื่อสั่งซื้อแพ็คจะปลดล็อคภารกิจรองและรางวัลพิเศษบนแผนที่ นอกเหนือจากรางวัลที่มีให้บนเส้นทางฟรีแล้ว แพ็คนักเบิกทางยังมอบสมบัติเพิ่มเติม, ครีปศึกบัลลังก์วิบัติ, ไอเท็ม Immortal และไอเท็มเมื่อทำภารกิจสำเร็จ, เหรียญบัลลังก์วิบัติเพิ่มเติมซึ่งสามารถใช้ลดราคาไอเท็มในร้านค้า และอื่น ๆ อีกมากมาย",
  "crownfall_explorerpack_purchase_act1_a": "บทที่ I",
  "crownfall_explorerpack_purchase_act1_b": "แกสต์ลีเอียรีย์",
  "crownfall_explorerpack_purchase_act1_c": "แพ็คนักเบิกทางแห่งมิดเกต",
  "crownfall_explorerpack_purchase": "สั่งซื้อ %1$s",
  "crownfall_arcanas_title": "Arcana",
  "crownfall_arcanas_description": "เทพีสกรี'ออคที่กำลังจะตายได้มอบพลังสุดท้ายของเธอให้กับ Vengeful Spirit และ Skywrath Mage โดยแลกมาด้วยหนึ่งเงื่อนไข พวกเขาต้องใช้มนตร์ดำของเธอเพื่อโค่นล้มราชินีจอมทรยศแห่งสกายแรธ",
  "crownfall_arcana_sm_hero": "The Devotions of Dragonus",
  "crownfall_arcana_sm_a": "โมเดลและแท่นยืน",
  "crownfall_arcana_sm_a_long": "ดราโกนัสได้รับโมเดลใหม่หมดจดพร้อมชุดเซ็ตไอเท็มครบชุดให้เหมาะกับความจงรักภักดีที่แท้จริงของเขา รวมถึงแท่นยืนใหม่และรูปแบบพิเศษที่ปลดล็อคได้",
  "crownfall_arcana_sm_b": "แอนิเมชันและเอฟเฟกต์แบบพิเศษ",
  "crownfall_arcana_sm_b_long": "ประกอบไปด้วยแอนิเมชันและเอฟเฟกต์แสงชุดใหม่ทั้งหมด พร้อมกับไอคอนและเอฟเฟกต์ Arcane Bolt, Concussive Shot, Ancient Seal และ Mystic Flare แบบพิเศษ",
  "crownfall_arcana_sm_c": "ทรัพยากรฮีโร่แบบพิเศษ",
  "crownfall_arcana_sm_c_long": "มาพร้อมภาพย่อฮีโร่ ไอคอนแผนที่ย่อ และภาพย่อแถบด้านบนแบบใหม่ เอฟเฟกต์ใหม่ทั้งหมดสำหรับการโจมตี การสังหาร การตาย และการ Deny รวมถึงไอคอนไอเท็มและเอฟเฟกต์สำหรับ Rod of Atos และ Phylactery",
  "crownfall_arcana_sm_d": "ประโยคเสียง Arcana",
  "crownfall_arcana_sm_d_long": "ดราโกนัสได้เป็นอิสระจากเงื้อมมือของอิมพีเรีย และได้รับการพากย์เสียงใหม่ทั้งหมดเพื่อช่วยระบายความคับแค้นใจของเขา",
  "crownfall_arcana_sm_purchase": "สั่งซื้อ %1$s",
  "crownfall_arcana_sm_purchase_note": "ลดราคาได้ด้วยเหรียญบัลลังก์วิบัติ",
  "crownfall_arcana_sm_alternate_header": "พร้อมให้ปลดล็อค",
  "crownfall_arcana_sm_alternate_title": "รูปแบบพิเศษ",
  "crownfall_arcana_sm_alternate_desc": "ทำภารกิจหลักในบทที่ IV ให้สำเร็จเพื่อปลดล็อครูปแบบพิเศษสำหรับ Arcana ของ Skywrath Mage",
  "crownfall_arcana_vs_hero": "The Resurrection of Shen",
  "crownfall_arcana_vs_a": "โมเดลและแท่นยืน",
  "crownfall_arcana_vs_a_long": "เชนเดลแซร์ได้รับปีกกลับสู่ร่างเธออีกครั้ง ทำให้ได้รับโมเดลใหม่ทั้งหมดพร้อมชุดเซ็ตไอเท็มครบชุดให้สมกับฐานะราชวงศ์สกายแรธ รวมถึงแท่นยืนใหม่และรูปแบบพิเศษที่ปลดล็อคได้ 2 รูปแบบ",
  "crownfall_arcana_vs_b": "แอนิเมชันและเอฟเฟกต์แบบพิเศษ",
  "crownfall_arcana_vs_b_long": "ประกอบไปด้วยแอนิเมชันและเอฟเฟกต์แสงชุดใหม่ทั้งหมด พร้อมกับไอคอนและเอฟเฟกต์ Magic Missile, Wave of Terror และ Nether Swap แบบใหม่ และเอฟเฟกต์ร่างเงา Vengeful แบบพิเศษ",
  "crownfall_arcana_vs_c": "ทรัพยากรฮีโร่แบบพิเศษ",
  "crownfall_arcana_vs_c_long": "มาพร้อมภาพย่อฮีโร่ ไอคอนแผนที่ย่อ และภาพย่อแถบด้านบนแบบใหม่ เอฟเฟกต์ใหม่ทั้งหมดสำหรับการโจมตี การสังหาร การตาย และการ Deny รวมถึงไอคอนไอเท็มและเอฟเฟกต์สำหรับ Force Staff และไอคอนพิเศษสำหรับ Aghanim's Scepter",
  "crownfall_arcana_vs_d": "ประโยคเสียง Arcana",
  "crownfall_arcana_vs_d_long": "ด้วยปีกที่กลับคืนสู่ร่างและดวงตาที่จับจ้องบัลลังก์อันชอบธรรมของเธอ เชนเดลแซร์ได้รับการพากย์เสียงใหม่ทั้งหมดให้สัมผัสได้ถึงกายหยาบของเธอ",
  "crownfall_arcana_vs_purchase": "สั่งซื้อ %1$s",
  "crownfall_arcana_vs_purchase_note": "ลดราคาได้ด้วยเหรียญบัลลังก์วิบัติ",
  "crownfall_arcana_vs_alternate_header": "พร้อมให้ปลดล็อค",
  "crownfall_arcana_vs_alternate_title": "รูปแบบพิเศษ",
  "crownfall_arcana_vs_alternate_desc": "ทำภารกิจหลักในบทที่ IV ให้สำเร็จเพื่อปลดล็อครูปแบบพิเศษแบบแรก ทำภารกิจหลักและภารกิจรองในศึกบัลลังก์วิบัติให้สำเร็จทั้งหมดเพื่อปลดล็อครูปแบบพิเศษแบบที่สอง",
  "crownfall_treasures_title": "สมบัติ",
  "crownfall_treasures_description": "ชุดเซ็ตไอเท็มใหม่ล่าสุดสำหรับฮีโร่ที่คุณชื่นชอบ รวมถึงชุดหายากสำหรับ Wraith King, Crystal Maiden, Hoodwink และอีกมากมาย ชุดเซ็ต Meepo และ Drow Ranger มาพร้อมกับท่าเยาะเย้ยแบบใหม่",
  "crownfall_treasure_item_0_name": "Phalanx of the Bronze Eagle",
  "crownfall_treasure_item_0_hero": "สมบัติ I - ทั่วไป",
  "crownfall_treasure_item_1_name": "Ravencloak",
  "crownfall_treasure_item_1_sub": "มาพร้อมท่าเยาะเย้ยใหม่",
  "crownfall_treasure_item_2_name": "Blood Raven",
  "crownfall_treasure_item_2_hero": "สมบัติ I - ทั่วไป",
  "crownfall_treasure_item_3_name": "Thunderbird",
  "crownfall_treasure_item_3_hero": "สมบัติ II - หายาก",
  "crownfall_treasure_item_4_name": "Mocking Bird",
  "crownfall_treasure_item_4_hero": "สมบัติ I - หายากมาก",
  "crownfall_treasure_item_4_sub": "มาพร้อมท่าเยาะเย้ยใหม่",
  "crownfall_treasure_item_5_name": "Whispering Wings",
  "crownfall_treasure_item_5_hero": "สมบัติ I - หายาก",
  "crownfall_treasure_item_6_name": "Owly Bear",
  "crownfall_treasure_item_7_name": "Crown of the Condor",
  "crownfall_treasure_item_7_hero": "สมบัติ I - หายาก",
  "crownfall_treasure_item_8_name": "Verdant Swarm",
  "crownfall_treasure_item_8_hero": "สมบัติ I - ทั่วไป",
  "crownfall_treasure_item_9_name": "Birdfeed Bandit",
  "crownfall_treasure_item_9_hero": "สมบัติ II - หายาก",
  "crownfall_treasure_item_10_name": "Lionheart",
  "crownfall_treasure_item_10_hero": "สมบัติ II - ทั่วไป",
  "crownfall_treasure_item_11_name": "Servant of Scree'Auk Baby Roshan",
  "crownfall_treasure_item_11_hero": "สมบัติ I/II - หายากอย่างไพศาล",
  "crownfall_treasure_purchase_1": "สมบัติ I - %1$s",
  "crownfall_treasure_purchase_2": "สมบัติ II - %1$s",
  "crownfall_footer_act_1": "บทที่[br][b]I[/b]",
  "crownfall_footer_act_2": "บทที่[br][b]II[/b]",
  "crownfall_footer_act_3": "บทที่[br][b]III[/b]",
  "crownfall_footer_act_4": "บทที่[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "ตลาดแห่ง[br][b]มิดเกต[/b]",
  "crownfall_footer_act_2_name": "ทะเลทรายแห่ง[br][b]ดรูด[/b]",
  "crownfall_footer_act_3_name": "เทือกน้ำแข็งแห่ง[br][b]ไอซ์แร็ก[/b]",
  "crownfall_footer_act_4_name": "ยอดแหลมแห่ง[br][b]สกายแรธ[/b]",
  "crownfall_footer_act_play": "เล่นเลย",
  "crownfall_footer_act_unlocks_mid_may": "ปลดล็อคกลางเดือนพฤษภาคม",
  "crownfall_footer_act_locked": "ล็อค"
}