// 9364.js

{
  "language": "bulgarian",
  "crownfallcomic_title_cover": "Денят на възшествието — корица",
  "crownfallcomic_title": "Денят на възшествието — страница %1$s",
  "crownfallcomic_help_text": "Кликнете на изображението или използвайте интервала, за да продължите нататък",
  "crownfallcomic_return_button": "Връщане към корицата",
  "crownfallcomic_act1_intro_title_cover": "Денят на възшествието — корица",
  "crownfallcomic_act1_intro_title": "Денят на възшествието — страница %1$s",
  "crownfallcomic_act2_intro_title_cover": "Битката за Пъклената котловина — корица",
  "crownfallcomic_act2_intro_title": "Битката за Пъклената котловина — страница %1$s",
  "crownfallcomic_act3_intro_title_cover": "Драконът — корица",
  "crownfallcomic_act3_intro_title": "Драконът — страница %1$s",
  "crownfall_title": "Crownfall",
  "crownfall_welcome": "Играйте Dota 2, за да отключвате екзотични местонахождения, нови персонажи и мрачни тайни в едно продължително сюжетно събитие, изпълнено с легендарни герои и уникални награди. Вече достъпно безплатно за всички Dota 2 играчи.",
  "crownfall_newstory_title": "Възвърнете трона",
  "crownfall_newstory_description": "Шанделзейр, законната кралица на Скайрат, беше брутално детронирана от своята сестра, Империя. Като член на елитната гвардия от магове на Империя, мощта и животът на Драгонус зависеха от милостта ѝ. Сега, с помощта на богинята Скрий Аук, у двамата е вдъхната нова мощ и последен шанс да получат своята мъст… и трона.",
  "crownfall_comic_title": "Наваксайте предисторията",
  "crownfall_comic_description": "Кралица Империя е забранила поклонението пред Скрий Аук. Прокудена, криейки се из копторите на Средната порта, низвергнатата богиня крои отчаян заговор да си върне контрола над Скайрат.",
  "crownfall_comic_button": "Прочетете комикса",
  "crownfall_howtoplay_title": "Приключението Ви очаква",
  "crownfall_howtoplay_description": "Напътствайте Шен и Драгонус през оживените улици на Скайрат в приключението им да възвърнат трона! Взаимодействайте с ансамбъл от нови персонажи и стари любимци, разкривайте мрачни тайни, поемайте по нечувани странични приключения, а от време на време дори можете да отивате на риболов за костур. Придобивайте още награди, колкото повече се задълбочавате в подробната интерактивна карта на света.",
  "crownfall_explainer_a_long": "[b]ПРОУЧВАЙТЕ.[/b] Пускането на Dota 2 игри по време на Crownfall събитието, ще Ви печели жетони. Играенето като различни герои ще Ви печели разнообразни видове жетони.",
  "crownfall_explainer_b_long": "[b]ОТКЛЮЧВАЙТЕ.[/b] Използвайте жетони, за да отключите курсове из цялата световна карта, напредвайки в историята и печелейки награди. Бъдете нащрек за специални схватки като търговеца на жетони и керванът от леярната за лакомства!",
  "crownfall_explainer_c_long": "[b]ОТМЪСТЕТЕ.[/b] Събирайте съкровища, лакомства, Crownfall монети и още, докато се борите да детронирате злата кралица Империя.",
  "crownfall_fouracts_title": "Историята се разкрива",
  "crownfall_fouracts_description": "Пазарите на Средната порта са само първия акт от продължаващ разказ в четири действия, който ще обхване следващите няколко месеца. Ще бъдете способни да проигравате нови актове веднага щом стават достъпни, но също така ще можете да преминавате през приключението според темпото, което Вие желаете. Въвеждането на нов акт няма да затваря по-ранните такива.[br][br]Което означава, че можете да проучвате всеки възможен курс, предизвикателство и тайна в I акт толкова дълго, колкото желаете. А колкото и да има за намиране, това събитие тепърва започва. Crownfall ще продължава да се разраства, докато се развива през идните месеци, а всеки нов акт ще поднася своя собствена история, персонажи, уникална карта на света и съвсем нови награди. Възможно е дори да има някоя или друга изненада по протежението на пътя.",
  "crownfall_rewards_title": "Награди",
  "crownfall_rewards_a": "Crownfall монети",
  "crownfall_rewards_a_long_new": "Печелите Crownfall монети, като проучвате различни курсове по картата. Съберете 10 монети, така че да ги размените в Crownfall магазина за приблизително %1$s отстъпка за всеки артикул, струващ %1$s или повече. (Точната отстъпка варира според региона и валутата.)",
  "crownfall_rewards_b": "Съкровища",
  "crownfall_rewards_b_long": "I акт включва два различни сандъка със съкровища. Общо 24 нови набори с артикули. Ще бъдете способни да отключите някои от наборите, като просто играете!",
  "crownfall_rewards_c": "Торби с лакомства",
  "crownfall_rewards_c_long": "Намерете кервана от леярната за лакомства на Ситхил и Куирт на всяка от Crownfall картите, така че да подобрите и размените Вашите лакомства за набори на герои, куриери, Wards и още други. А дори има рядък шанс за Arcana артикули!",
  "crownfall_rewards_andmanymore": "А това не е всичко! Разкрийте съвсем нови екрани при зареждане. Изразете себе си с емотикони, спрейове и нови реплики за чат рулетката. Изтупайте своите герои с уникални набори от артикули, намерени по сюжетния курс, а дори и още други неща… Очаква Ви цял свят, който да проучвате.",
  "crownfall_explorerpack_title": "Пакет за пътеводител на Средната порта",
  "crownfall_explorerpack_description": "Всички награди в основния сюжетен курс на Crownfall ще бъдат достъпни безплатно за всички играчи. Но за калените приключенци, които биха искали да се задълбочат малко повече в I акт, „Пакетът за пътеводител на Средната порта“ предлага още проучване на картата, повече истории и допълнителни награди.",
  "crownfall_explorerpack_description_long": "Закупуването на пакета отключва странични приключения и специални награди на картата. В допълнение към тези, достъпни по безплатния курс, пакетът на пътеводителя предоставя и добавъчни съкровища, Crownfall крийпове, Immortal и артикули за завършване, екстра Crownfall монети, които могат да бъдат използвани за спестяване при покупки на артикули от магазина и още други.",
  "crownfall_explorerpack_purchase_act1_a": "I акт",
  "crownfall_explorerpack_purchase_act1_b": "Орловият полог",
  "crownfall_explorerpack_purchase_act1_c": "Пакетът за пътеводител на Средната порта",
  "crownfall_explorerpack_purchase": "Закупуване — %1$s",
  "crownfall_arcanas_title": "Arcana",
  "crownfall_arcanas_description": "Умиращата богиня Скрий Аук е надарила Vengeful Spirit и Skywrath Mage с последната от своята мощ, но това си има цена… Те трябва да използват нейната мрачна магия, за да детронират вероломната кралица на Скайрат.",
  "crownfall_arcana_sm_hero": "The Devotions of Dragonus",
  "crownfall_arcana_sm_a": "Модел и пиедестал",
  "crownfall_arcana_sm_a_long": "Драгонус си спечели съвсем нов модел с пълен набор от артикули, подобаващ на истинската му лоялност. Също така има нов пиедестал, както и алтернативен стил за отключване.",
  "crownfall_arcana_sm_b": "Персонализирани анимации и ефекти",
  "crownfall_arcana_sm_b_long": "Включва пълен набор от съвсем нови анимации, околни ефекти, персонализирани икони и ефекти за Arcane Bolt, Concussive Shot, Ancient Seal и Mystic Flare.",
  "crownfall_arcana_sm_c": "Персонализирани активи за герой",
  "crownfall_arcana_sm_c_long": "Включва нов портрет, икона за мини картата, портрет за горната лента, съвсем нови ефекти при атаки, убийства, умирания и отхвърляния. Плюс това съдържа икони и ефекти за Rod of Atos и Phylactery.",
  "crownfall_arcana_sm_d": "Arcana реплики",
  "crownfall_arcana_sm_d_long": "Освободен от влиянието на Империя, Драгонус разполага със съвсем ново изпълнение на озвучаването, което да му помогне да изрази оплакванията си.",
  "crownfall_arcana_sm_purchase": "Закупуване — %1$s",
  "crownfall_arcana_sm_purchase_note": "Отстъпката е достъпна при използване на Crownfall монети",
  "crownfall_arcana_sm_alternate_header": "Отключващ се",
  "crownfall_arcana_sm_alternate_title": "Алтернативен стил",
  "crownfall_arcana_sm_alternate_desc": "Завършете основното приключение в IV акт, за да отключите алтернативния Arcana стил на Skywrath Mage.",
  "crownfall_arcana_vs_hero": "The Resurrection of Shen",
  "crownfall_arcana_vs_a": "Модел и пиедестал",
  "crownfall_arcana_vs_a_long": "Шанделзейр си възвърна своите криле, предоставяйки ѝ съвсем нов модел с пълен набор от артикули, достоен за скайратска кралица. Включва нов пиедестал, както и два алтернативни стила за отключване.",
  "crownfall_arcana_vs_b": "Персонализирани анимации и ефекти",
  "crownfall_arcana_vs_b_long": "Включва пълен набор от съвсем нови анимации, околни ефекти, персонализирани икони и ефекти за Magic Missile, Wave of Terror и Nether Swap. Също така включва персонализиран ефект за илюзиите от Vengeance Aura.",
  "crownfall_arcana_vs_c": "Персонализирани активи за героя",
  "crownfall_arcana_vs_c_long": "Включва нов портрет, икона за мини картата, портрет за горната лента, съвсем нови ефекти при атаки, убийства, умирания и отхвърляния. Плюс това съдържа икони и ефекти за Force Staff, както и персонализирана икона за Aghanim's Scepter.",
  "crownfall_arcana_vs_d": "Arcana реплики",
  "crownfall_arcana_vs_d_long": "С възстановени крила и поглед към законния ѝ трон, Шанделзейр разполага със съвсем ново изпълнение на озвучаването, отразяващо осезаемата ѝ форма.",
  "crownfall_arcana_vs_purchase": "Закупуване — %1$s",
  "crownfall_arcana_vs_purchase_note": "Отстъпката е достъпна при използване на Crownfall монети",
  "crownfall_arcana_vs_alternate_header": "Отключващи се",
  "crownfall_arcana_vs_alternate_title": "Aлтернативни стилове",
  "crownfall_arcana_vs_alternate_desc": "Завършете основното приключение в IV акт, за да отключите първия алтернативен стил. Завършете всички основни и странични приключения в Crownfall, за да отключите втория алтернативен стил.",
  "crownfall_treasures_title": "Съкровища",
  "crownfall_treasures_description": "Изцяло нови набори с артикули за някои от любимите ви герои. Включително редки набори за Wraith King, Crystal Maiden, Hoodwink и още други. Наборите за Meepo и Drow Ranger идват с персонализирани присмехи.",
  "crownfall_treasure_item_0_name": "Phalanx of the Bronze Eagle",
  "crownfall_treasure_item_0_hero": "Съкровище I — обикновено",
  "crownfall_treasure_item_1_name": "Ravencloak",
  "crownfall_treasure_item_1_hero": "Съкровище II — много рядко",
  "crownfall_treasure_item_1_sub": "Включва персонализиран присмех",
  "crownfall_treasure_item_2_name": "Blood Raven",
  "crownfall_treasure_item_2_hero": "Съкровище I — обикновено",
  "crownfall_treasure_item_3_name": "Thunderbird",
  "crownfall_treasure_item_3_hero": "Съкровище II — рядко",
  "crownfall_treasure_item_4_name": "Mocking Bird",
  "crownfall_treasure_item_4_hero": "Съкровище I — много рядко",
  "crownfall_treasure_item_4_sub": "Включва персонализиран присмех",
  "crownfall_treasure_item_5_name": "Whispering Wings",
  "crownfall_treasure_item_5_hero": "Съкровище I — рядко",
  "crownfall_treasure_item_6_name": "Owly Bear",
  "crownfall_treasure_item_6_hero": "Съкровище II — ултра рядко",
  "crownfall_treasure_item_7_name": "Crown of the Condor",
  "crownfall_treasure_item_7_hero": "Съкровище I — рядко",
  "crownfall_treasure_item_8_name": "Verdant Swarm",
  "crownfall_treasure_item_8_hero": "Съкровище I — обикновено",
  "crownfall_treasure_item_9_name": "Birdfeed Bandit",
  "crownfall_treasure_item_9_hero": "Съкровище II — рядко",
  "crownfall_treasure_item_10_name": "Lionheart",
  "crownfall_treasure_item_10_hero": "Съкровище II — обикновено",
  "crownfall_treasure_item_11_name": "Servant of Scree'Auk Baby Roshan",
  "crownfall_treasure_item_11_hero": "Съкровище I/II — космически рядко",
  "crownfall_treasure_purchase_1": "Съкровище I — %1$s",
  "crownfall_treasure_purchase_2": "Съкровище II — %1$s",
  "crownfall_footer_act_1": "[b]I[/b][br]акт",
  "crownfall_footer_act_2": "[b]II[/b][br]акт",
  "crownfall_footer_act_3": "[b]III[/b][br]акт",
  "crownfall_footer_act_4": "[b]IV[/b][br]акт",
  "crownfall_footer_act_1_name": "Пазарите на[br][b]Средната порта[/b]",
  "crownfall_footer_act_2_name": "Пустините на[br][b]Друуд[/b]",
  "crownfall_footer_act_3_name": "Мразовете на[br][b]Ледоостанково[/b]",
  "crownfall_footer_act_4_name": "Шпиловете на[br][b]Скайрат[/b]",
  "crownfall_footer_act_play": "Пуснете сега",
  "crownfall_footer_act_unlocks_mid_may": "Отключва се през май",
  "crownfall_footer_act_locked": "Заключено"
}