// 528.js

{
  "language": "finnish",
  "crownfallcomic_title_cover": "Valtaannousu – kansilehti",
  "crownfallcomic_title": "Valtaannousu – sivu %1$s",
  "crownfallcomic_help_text": "Siirry eteenpäin klikkaamalla kuvaa tai painamalla välilyöntiä",
  "crownfallcomic_return_button": "Palaa kansilehdelle",
  "crownfall_title": "Kruununkaappaus",
  "crownfall_welcome": "Pelaa Dotaa avataksesi eksoottisia paikkoja, uusia hahmoja ja synkkiä salaisuuksia jatkuvassa tarinassa, joka on täynnä legendaarisia sankareita ja ainutlaatuisia palkintoja. Nyt ilmaiseksi kaikille Dota-pelaajille.",
  "crownfall_newstory_title": "Valtaistuimen valtaus",
  "crownfall_newstory_description": "Shendelzare on Taivaanlinnan oikea kuningatar, jonka sisar Imperia syöksi vallasta. Dragonus on Imperian alamainen ja vartija, ja hänen henkensä ja voimansa ovat Imperian käsissä. Kuningatar Scree'Aukin avulla kaksikko on saanut voimansa takaisin ja haluaa kostaa... ja napata kruunun takaisin.",
  "crownfall_comic_title": "Mistä kaikki alkoi",
  "crownfall_comic_description": "Kuningatar Imperia on kieltänyt Scree'Aukin palvomisen. Scree'Auk piileskelee Keskitullin slummeissa ja suunnittelee Taivaanlinnan valtaamista.",
  "crownfall_comic_button": "Lue sarjakuva",
  "crownfall_howtoplay_title": "Seikkailu odottaa",
  "crownfall_howtoplay_description": "Opasta Shen ja Dragonus halki Taivaanlinnan katujen vilinän ja kohti valtaistuinta. Tutustu uusiin hahmoihin ja tapaa vanhoja suosikkeja, paljasta synkkiä salaisuuksia, suorita hurjia sivutehtäviä ja pistäydy välillä kalassa. Mitä syvemmälle sukellat interaktiiviseen karttaan, sitä enemmän saat palkintoja.",
  "crownfall_explainer_a_long": "[b]TUTKI[/b] Ansaitset poletteja pelaamalla Kruununkaappaus-tapahtuman aikana. Eri sankareilla pelaaminen antaa eri poletteja.",
  "crownfall_explainer_b_long": "[b]AVAA[/b] Käytä poletteja strategiakartan polkujen avaamiseen, etene tarinassa ja ansaitse palkintoja. Pidä silmällä erityisiä kohtaamisia, kuten karkkikaravaaneja ja polettikauppiaita!",
  "crownfall_explainer_c_long": "[b]KOSTA[/b] Kerää aarteita, karkkia, Kruununkaappaus-kolikoita ja paljon muuta samalla, kun taistelet ilkeän kuningatar Imperian syrjäyttämiseksi.",
  "crownfall_fouracts_title": "Tarina jatkuu",
  "crownfall_fouracts_description": "Keskitullin markkinat on vasta ensimmäinen osa meneillään olevasta neliosaisesta, tulevina kuukausina julkaistavasta tarinasta. Voit pelata uusia osia heti, kun ne tulevat saataville. Tai edetä seikkailun läpi omaan tahtiisi, sillä uuden osan avaaminen ei sulje aikaisempia. [br][br]Voit siis viettää niin kauan kuin haluat tutkimalla kaikkia mahdollisia polkuja, haasteita ja salakauppoja ensimmäisessä osassa. Tutkittavaa riittää siinäkin mielin määrin, mutta se on vasta alkua. Kruununkaappaus laajenee tulevina kuukausina, ja jokainen uusi osa tuo mukanaan omat tarinansa, hahmonsa, ainutlaatuisen strategiakartan ja aivan uusia palkintoja. Matkan varrella voi olla jopa yllätys tai kaksi.",
  "crownfall_rewards_title": "Palkinnot",
  "crownfall_rewards_a": "Kruununkauppaus-kolikot",
  "crownfall_rewards_a_long_new": "Ansaitse Kruununkaappaus-kolikoita tutkimalla kartan ​​polkuja. Kerää kymmenen kolikkoa ja vaihda ne Kruununkaappauksen kaupassa, niin saat noin %1$s alennuksen kaikista tuotteista, jotka maksavat %1$s tai enemmän. (Tarkka alennus vaihtelee alueen ja valuutan mukaan.)",
  "crownfall_rewards_b": "Aarteet",
  "crownfall_rewards_b_long": "Osa I sisältää kaksi erilaista aarrearkkua, yhteensä 24 uutta esinekokoelmaa. Voit avata osan kokoelmista vain pelaamalla!",
  "crownfall_rewards_c": "Karkkipussit",
  "crownfall_rewards_c_long": "Löydä Sithil ja Quirtin Karkkikaravaani jokaiselta Kruununkaappaus-kartalta päivittääksesi sitä ja vaihtaaksesi karkkisi sankarikokoelmiin, kuriireihin, wardeihin ja muihin. (Sinulla on harvinainen mahdollisuus saada jopa salatieteellinen esine!)",
  "crownfall_rewards_andmanymore": "Eikä siinä vielä kaikki! Voit hankkia uusia latausnäyttöjä ja ilmaista itseäsi hymiöillä, graffiteilla ja chatrullan repliikeillä. Lisäksi pääset koristelemaan sankarisi tarinapolun uniikeilla esinekokoelmilla. Ja se oli vasta alkua. Dotan maailma on pullollaan upeita yllätyksiä, jotka odottavat löytäjäänsä.",
  "crownfall_explorerpack_title": "Keskitullin tienraivaajan paketti",
  "crownfall_explorerpack_description": "Kaikki Kruununkaappauksen päätarinan palkinnot ovat kaikkien pelaajien saatavilla ilmaiseksi. Kokeneille seikkailijoille, jotka haluavat sukeltaa hieman syvemmälle ensimmäiseen osaan, Tienraivaajan paketti tarjoaa enemmän kartan tutkimista, tarinoita ja palkintoja.",
  "crownfall_explorerpack_description_long": "Paketin ostaminen avaa sivutehtäviä ja erikoispalkintoja kartalla. Ilmaisella polulla saatavilla olevien palkintojen lisäksi Tienraivaajan paketti antaa myös lisää aarteita, Kruununkaappauksen kätyreitä, kuolemattomia esineitä, suorituspalkintoja ja ylimääräisiä, kaupassa käytettäviä Kruununkaappaus-kolikoita ja paljon muuta.",
  "crownfall_explorerpack_purchase_act1_a": "Osa 1",
  "crownfall_explorerpack_purchase_act1_b": "Kotkanpesä",
  "crownfall_explorerpack_purchase_act1_c": "Keskitullin tienraivaajan paketti",
  "crownfall_explorerpack_purchase": "Osta %1$s",
  "crownfall_arcanas_title": "Salatieteelliset",
  "crownfall_arcanas_description": "Scree'Auk, elämänsä loppua lähentyvä jumalatar antoi Vengeful Spiritille ja Skywrath Magelle viimeiset voimansa yhdellä ehdolla: kaksikon on syrjäytettävä Taivaanlinnan petollinen kuningatar.",
  "crownfall_arcana_sm_hero": "Dragonuksen antaumukset",
  "crownfall_arcana_sm_a": "Malli ja jalusta",
  "crownfall_arcana_sm_a_long": "Dragonus on saanut täysin uuden mallin täydellisellä, missioon sopivalla esinekokoelmalla sekä uuden jalustan ja avattavan vaihtoehtoisen tyylin.",
  "crownfall_arcana_sm_b": "Muokatut animaatiot ja tehosteet",
  "crownfall_arcana_sm_b_long": "Sisältää täyden kokoelman uusia animaatioita ja tunnelmatehosteita, kuten mukautetut kuvakkeet ja tehosteet Arcane Boltille, Concussive Shotille, Ancient Sealille ja Mystic Flarelle.",
  "crownfall_arcana_sm_c": "Räätälöity sankarigrafiikka",
  "crownfall_arcana_sm_c_long": "Sisältää uuden muotokuvan, minikarttakuvakkeen ja yläpalkin muotokuvan, täysin uudet tehosteet hyökkäyksiin, tappoihin, kuolemiin ja eväyksiin sekä esineiden kuvakkeet ja tehosteet Rod of Atosille ja Phylacterylle.",
  "crownfall_arcana_sm_d": "Salatieteellisten kokoelmien repliikit",
  "crownfall_arcana_sm_d_long": "Omat voimansa takaisin saanut Dragonus on saanut myös uudet repliikit, joilla hän voi kertoa vääryyksistä.",
  "crownfall_arcana_sm_purchase": "Osta %1$s",
  "crownfall_arcana_sm_purchase_note": "Alennus saatavilla Kruununkaappaus-kolikoilla",
  "crownfall_arcana_sm_alternate_header": "Avattava",
  "crownfall_arcana_sm_alternate_title": "Vaihtoehtoinen tyyli",
  "crownfall_arcana_sm_alternate_desc": "Suorita osan 4 päätehtävä avataksesi vaihtoehtoisen Skywrath Magen salatieteellisen tyylin.",
  "crownfall_arcana_vs_hero": "Shenin paluu",
  "crownfall_arcana_vs_a": "Malli ja jalusta",
  "crownfall_arcana_vs_a_long": "Shendelzare on saanut siipensä takaisin, ja tarjolla on täysi uusi malli ja Taivaanlinnan kuninkaallisen arvoinen esinekokoelma, joka sisältää muun muassa uuden jalustan ja kaksi avattavaa vaihtoehtoista tyyliä.",
  "crownfall_arcana_vs_b": "Muokatut animaatiot ja tehosteet",
  "crownfall_arcana_vs_b_long": "Sisältää täydellisen kokoelman uusia animaatioita ja tunnelmatehosteita, mukaan lukien mukautetut kuvakkeet ja tehosteet Magic Missilelle, Wave of Terrorille, Nether Swapille ja mukautettu Vengefulin harha -tehoste.",
  "crownfall_arcana_vs_c": "Räätälöity sankarigrafiikka",
  "crownfall_arcana_vs_c_long": "Sisältää uuden muotokuvan, minikarttakuvakkeen ja yläpalkin muotokuvan, täysin uudet tehosteet hyökkäyksiin, tappoihin, kuolemiin ja eväyksiin sekä esineiden kuvakkeet ja ja mukautetun kuvakkeen Aghanim's Scepterille.",
  "crownfall_arcana_vs_d": "Salatieteellisten kokoelmien repliikit",
  "crownfall_arcana_vs_d_long": "Shendelzarella on siivet, katse kiinni valtaistuimessa ja uudet, elolliseen muotoon sopivat repliikit.",
  "crownfall_arcana_vs_purchase": "Osta %1$s",
  "crownfall_arcana_vs_purchase_note": "Alennus saatavilla Kruununkaappaus-kolikoilla",
  "crownfall_arcana_vs_alternate_header": "Avattava",
  "crownfall_arcana_vs_alternate_title": "Vaihtoehtoiset tyylit",
  "crownfall_arcana_vs_alternate_desc": "Suorita osan 4 päätehtävä avataksesi ensimmäisen vaihtoehtoisen tyylin. Suorita kaikki Kruununkaappauksen päätehtävät ja sivutehtävät avataksesi toisen vaihtoehtoisen tyylin.",
  "crownfall_treasures_title": "Aarteet",
  "crownfall_treasures_description": "Täysin uudet esinekokoelmat suosikkisankareillesi, kuten harvinaiset kokoelmat Wraith Kingille, Crystal Maidenille, Hoodwinkille ja muille. Meepo- ja Drow Ranger -kokoelmissa on räätälöidyt pilkat.",
  "crownfall_treasure_item_0_name": "Pronssikotkan peitsivartio",
  "crownfall_treasure_item_0_hero": "Aarre I – Tavallinen",
  "crownfall_treasure_item_1_name": "Korpinkaapu",
  "crownfall_treasure_item_1_hero": "Aarre II – Erittäin harvinainen",
  "crownfall_treasure_item_1_sub": "Sisältää pilkan",
  "crownfall_treasure_item_2_name": "Verikaarne",
  "crownfall_treasure_item_2_hero": "Aarre I – Tavallinen",
  "crownfall_treasure_item_3_name": "Ukkoslintu",
  "crownfall_treasure_item_3_hero": "Aarre II – Harvinainen",
  "crownfall_treasure_item_4_name": "Kanakopla",
  "crownfall_treasure_item_4_hero": "Aarre I – Erittäin harvinainen",
  "crownfall_treasure_item_4_sub": "Sisältää pilkan",
  "crownfall_treasure_item_5_name": "Siivekäs hiiskaus",
  "crownfall_treasure_item_5_hero": "Aarre I – Harvinainen",
  "crownfall_treasure_item_6_name": "Pöllönalle",
  "crownfall_treasure_item_6_hero": "Aarre II – Äärimmäisen harvinainen",
  "crownfall_treasure_item_7_name": "Kondorien kuningas",
  "crownfall_treasure_item_7_hero": "Aarre I – Harvinainen",
  "crownfall_treasure_item_8_name": "Vehreä alfakuoriainen",
  "crownfall_treasure_item_8_hero": "Aarre I – Tavallinen",
  "crownfall_treasure_item_9_name": "Höyhenhäirikkö",
  "crownfall_treasure_item_9_hero": "Aarre II – Harvinainen",
  "crownfall_treasure_item_10_name": "Leijonasydän",
  "crownfall_treasure_item_10_hero": "Aarre II – Tavallinen",
  "crownfall_treasure_item_11_name": "Scree'Aukia palvova Roshan-vauva",
  "crownfall_treasure_item_11_hero": "Aarre I/II – Kosmisen harvinainen",
  "crownfall_treasure_purchase_1": "Aarre I – %1$s",
  "crownfall_treasure_purchase_2": "Aarre II – %1$s",
  "crownfall_footer_act_1": "Osa[br][b]1[/b]",
  "crownfall_footer_act_2": "Osa[br][b]2[/b]",
  "crownfall_footer_act_3": "Osa[br][b]3[/b]",
  "crownfall_footer_act_4": "Osa[br][b]4[/b]",
  "crownfall_footer_act_1_name": "[b]Keskitullin[/b][br]markkinat",
  "crownfall_footer_act_2_name": "[b]Druudin[/b][br]aavikot",
  "crownfall_footer_act_3_name": "[b]Jääraunioiden[/b][br]pakkaset",
  "crownfall_footer_act_4_name": "[b]Taivaanlinnan[/b][br]tornit",
  "crownfall_footer_act_play": "Pelaa nyt",
  "crownfall_footer_act_unlocks_mid_may": "Saatavilla toukokuun puolessa välissä",
  "crownfall_footer_act_locked": "Lukittu"
}