// 9922.js

{
  "language": "romanian",
  "crownfallcomic_title_cover": "Ziua Ascensiunii - Copertă",
  "crownfallcomic_title": "Ziua Ascensiunii - Pagina %1$s",
  "crownfallcomic_help_text": "Apasă pe imagine sau tasta spațiu pentru a continua",
  "crownfallcomic_return_button": "Întoarce-te la copertă",
  "crownfall_welcome": "Joacă Dota pentru a debloca locații exotice, personaje noi și secrete sumbre în cadrul unui eveniment a cărui poveste va fi dezvăluită pe parcursul mai multor luni și care este plină de eroi legendari și recompense unice. Eveniment disponibil acum în mod gratuit pentru toți jucătorii de Dota.",
  "crownfall_howtoplay_description": "Îndrumă-i pe Dragonus și pe Shen pe străzile aglomerate din Skywrath în încercarea lor de a recâștiga tronul! Întâlnește noi personaje și personaje mai vechi pe care le îndrăgești, descoperă secrete sumbre și aventurează-te în misiuni secundare incredibile și relaxează-te ocazional la pescuit. Obține mai multe recompense pe parcurs ce explorezi și mai mult harta interactivă.",
  "crownfall_fouracts_description": "„Piețele Târgului de Mijloc” reprezintă doar primul act al unei povești compuse din patru acte care se va desfășura în următoarele câteva luni. Vei putea juca noile acte de îndată ce acestea vor deveni disponibile, însă ai posibilitatea de a progresa în propriul tău ritm, deoarece actele precedente vor putea fi accesate în continuare atunci când un act nou va deveni disponibil. [br][br]Asta înseamnă că ai libertatea de a explora oricât de mult dorești fiecare traseu posibil, fiecare provocare și fiecare secret din primul act. Nu uita totuși că acesta reprezintă doar începutul. Mai mult conținut va deveni disponibil pe parcursul lunilor următoare, iar fiecare act nou va veni cu propria sa poveste, propriile personaje, o hartă unică a regiunii respective și recompense nou-nouțe. Este posibil să te aștepte și câteva surprize în acestă aventură.",
  "crownfall_rewards_a_long_new": "Obține monedele evenimentului explorând diverse trasee de pe hartă. Strânge 10 monede pentru a le oferi la schimb în magazinul Căderea Coroanei pentru o reducere de aproximativ %1$s pentru orice obiect care costă cel puțin %1$s. (Reducerea exactă variază în funcție de regiune și moneda locală.)",
  "crownfall_rewards_c_long": "Găsește atelierul de bomboane al lui Sithil și Quirt de pe fiecare hartă a evenimentului pentru a-l îmbunătăți și a-ți oferi bomboanele la schimb pentru seturi de obiecte, curieri, warduri și multe altele. (Ai inclusiv o șansă rară de a obține obiecte Arcana!)",
  "crownfall_explorerpack_description": "Toate recompensele disponibile pe traseul poveștii principale a evenimentului Căderea Coroanei vor fi disponibile tuturor jucătorilor în mod gratuit. Pentru aventurierii experimentați care-și doresc să cerceteze mai mult primul act, pachetul de expediție al Târgului de Mijloc le oferă acces extins la hartă, povești suplimentare și mai multe recompense.",
  "crownfall_arcanas_description": "Zeița muribundă Scree'Auk i-a înzestrat pe Vengeful Spirit și Skywrath Mage cu ultimele puteri ale sale, însă cu un preț: aceștia trebuie să folosească magia neagră a acesteia pentru a o detrona pe regina trădătoare a Skywrath.",
  "crownfall_arcana_sm_alternate_header": "Deblocabil",
  "crownfall_arcana_sm_alternate_title": "Stil alternativ",
  "crownfall_arcana_sm_alternate_desc": "Finalizează misiunea principală din actul IV pentru a debloca stilul alternativ pentru Arcana lui Skywrath Mage.",
  "crownfall_arcana_vs_alternate_header": "Deblocabile",
  "crownfall_arcana_vs_alternate_title": "Stiluri alternative",
  "crownfall_arcana_vs_alternate_desc": "Finalizează misiunea principală din actul IV pentru a debloca primul stil alternativ. Finalizează toate misiunile principale și toate misiunile secundare ale evenimentului Căderea Coroanei pentru a debloca al doilea stil alternativ.",
  "crownfall_treasure_item_11_name": "Servant of Scree'Auk Baby Roshan",
  "crownfall_footer_act_play": "Joacă acum",
  "crownfall_footer_act_unlocks_mid_may": "Jumătatea lunii mai"
}