// 4570.js

{
  "language": "portuguese",
  "crownfallcomic_title_cover": "Dia da Ascensão - Capa",
  "crownfallcomic_title": "Dia da Ascensão - Página %1$s",
  "crownfallcomic_help_text": "Clica na imagem ou usa a barra de espaços para avançar",
  "crownfallcomic_return_button": "Voltar à página da capa",
  "crownfallcomic_act1_intro_title_cover": "Dia da Ascensão - Capa",
  "crownfallcomic_act1_intro_title": "Dia da Ascensão - Página %1$s",
  "crownfallcomic_act2_intro_title_cover": "A Batalha do Vale do Inferno - Capa",
  "crownfallcomic_act2_intro_title": "A Batalha do Vale do Inferno - Página %1$s",
  "crownfallcomic_act3_intro_title_cover": "O Dragão - Capa",
  "crownfallcomic_act3_intro_title": "O Dragão - Página %1$s",
  "crownfallcomic_act4_intro_title_cover": "Crownfall - Capa",
  "crownfallcomic_act4_intro_title": "Crownfall - Página %1$s",
  "crownfall_title": "Crownfall",
  "crownfall_welcome": "Joga Dota para revelares locais exóticos, novas personagens e segredos sombrios num evento contínuo com uma história repleta de heróis lendários e recompensas exclusivas. Disponível gratuitamente para todos os jogadores.",
  "crownfall_newstory_title": "Reivindica o trono",
  "crownfall_newstory_description": "Shendelzare, a rainha legítima de Skywrath, foi brutalmente destronada pela sua irmã Imperia. Dragonus, um membro da guarda mágica de elite, teve os seus poderes e a sua vida à mercê de Imperia... até agora. Com a ajuda da deusa Scree'Auk, ambos receberam novos poderes e uma última oportunidade de obterem a vingança... e o trono.",
  "crownfall_comic_title": "A história até agora",
  "crownfall_comic_description": "A Rainha Imperia baniu a veneração à deusa Scree'Auk. Obrigada a esconder‑se nos bairros degradados de Midgate, a deusa enfraquecida engendra um plano desesperado para retomar o controlo de Skywrath.",
  "crownfall_comic_button": "Lê a história",
  "crownfall_howtoplay_title": "Uma aventura espera‑te",
  "crownfall_howtoplay_description": "Acompanha Shen e Dragonus pelas ruas movimentadas de Skywrath numa missão para retomar o trono! Interage com um elenco de novas personagens e heróis populares, desvenda segredos sombrios, aventura-te em curiosas missões secundárias e, só para desanuviar, vai à pesca! Quanto mais explorares o detalhado mapa interativo, mais recompensas ganharás.",
  "crownfall_explainer_a_long": "[b]EXPLORA.[/b] Jogar partidas de Dota durante o evento Crownfall irá conceder fichas. Jogar com heróis diferentes irá conceder tipos diferentes de fichas.",
  "crownfall_explainer_b_long": "[b]DESBLOQUEIA.[/b] Usa fichas para desbloqueares caminhos pelo mapa da região e assim avançares na história e receberes recompensas. Fica de olho em encontros especiais, como o colecionador de fichas e a Caravana da Doçaria!",
  "crownfall_explainer_c_long": "[b]VINGA-TE.[/b] Junta tesouros, doces, Moedas da Loja Crownfall e muito mais enquanto lutas para destronar a malvada Rainha Imperia.",
  "crownfall_fouracts_title": "O desenrolar da história",
  "crownfall_fouracts_description": "Os Mercados de Midgate são apenas o primeiro ato de uma história de quatro partes que será contada ao longo dos próximos meses. Poderás experimentar os novos atos assim que estiverem disponíveis, mas também podes seguir a aventura ao teu próprio ritmo: a chegada de um ato novo não irá bloquear os anteriores.[br][br]Por outras palavras, podes explorar com calma todos os caminhos, desafios e segredos possíveis no Ato I. E mesmo com tanto para descobrir, este evento só está a começar. Crownfall ficará cada vez maior durante os próximos meses, com cada ato novo acompanhado de uma nova história, mais personagens, um mapa de uma nova região e recompensas inéditas. Pode até haver uma surpresa ou outra entretanto.",
  "crownfall_rewards_title": "Recompensas",
  "crownfall_rewards_a": "Moedas da Loja Crownfall",
  "crownfall_rewards_a_long_new": "Explora caminhos diferentes do mapa para receberes Moedas da Loja Crownfall. Assim que juntares 10 Moedas, podes trocá‑las na Loja Crownfall por um desconto de cerca de %1$s em qualquer item que custe %1$s ou mais. (O desconto exato varia de acordo com a região e a moeda.)",
  "crownfall_rewards_b": "Tesouros",
  "crownfall_rewards_b_long": "O Ato I inclui dois tesouros diferentes que contêm um total de 24 novos conjuntos. Poderás obter alguns destes conjuntos só por jogar!",
  "crownfall_rewards_c": "Sacos de doces",
  "crownfall_rewards_c_long": "Encontra a Caravana da Doçaria, do Sithil e do Quirt, em cada mapa de Crownfall para a melhorares e trocares os teus doces por conjuntos, estafetas, wards e muito mais. (A caravana até tem uma probabilidade baixa de vender conjuntos Arcanos!)",
  "crownfall_rewards_andmanymore": "E há mais! Descobre ecrãs de loading inéditos, exprime-te com emoticons, sprays e novas falas para a Chat Wheel, equipa os teus heróis com os conjuntos exclusivos que desbloqueares ao longo do caminho da história e muito mais... temos um mundo inteiro à espera de ser explorado por ti.",
  "crownfall_explorerpack_title": "Pack do Pioneiro de Midgate",
  "crownfall_explorerpack_description": "Todas as recompensas no caminho da história principal de Crownfall estarão disponíveis gratuitamente para todos os jogadores. Mas para os aventureiros experientes que desejam explorar ainda mais o Ato I, o Pack do Pioneiro de Midgate oferece mais caminhos no mapa, mais histórias e mais recompensas.",
  "crownfall_explorerpack_description_long": "Comprar o pack irá desbloquear missões secundárias e recompensas especiais no mapa. Além das recompensas disponíveis no caminho grátis, o Pack do Pioneiro também concede tesouros adicionais, creeps exclusivos de Crownfall, itens Imortais e atribuídos por completar histórias, moedas da Loja Crownfall que podem ser usadas para obter descontos na loja e muito mais.",
  "crownfall_explorerpack_purchase_act1_a": "Ato I",
  "crownfall_explorerpack_purchase_act1_b": "Midgate",
  "crownfall_explorerpack_purchase_act1_c": "Pack do Pioneiro de Midgate",
  "crownfall_explorerpack_purchase": "Comprar - %1$s",
  "crownfall_arcanas_title": "Conjuntos Arcanos",
  "crownfall_arcanas_description": "A deusa moribunda Scree'Auk concedeu os seus últimos poderes a Vengeful Spirit e a Skywrath Mage, por um preço: ambos terão de usar a magia negra da deusa para derrubar a insidiosa rainha de Skywrath.",
  "crownfall_arcana_sm_hero": "The Devotions of Dragonus",
  "crownfall_arcana_sm_a": "Modelo e pedestal",
  "crownfall_arcana_sm_a_long": "Dragonus recebeu um modelo totalmente novo com um conjunto completo de itens adequados à sua verdadeira lealdade, assim como um novo pedestal e um estilo alternativo desbloqueável.",
  "crownfall_arcana_sm_b": "Animações e efeitos exclusivos",
  "crownfall_arcana_sm_b_long": "Inclui animações e efeitos de ambiente totalmente novos, assim como ícones e efeitos exclusivos para Arcane Bolt, Concussive Shot, Ancient Seal e Mystic Flare.",
  "crownfall_arcana_sm_c": "Novos elementos",
  "crownfall_arcana_sm_c_long": "Inclui um novo retrato, ícone no minimapa e retrato na barra superior, efeitos totalmente novos para ataques, vítimas, mortes e negações, além de ícones e efeitos para os itens Rod of Atos e Phylactery.",
  "crownfall_arcana_sm_d": "Falas exclusivas",
  "crownfall_arcana_sm_d_long": "Livre da influência da Rainha Imperia, Dragonus tem novas falas que o ajudam a exprimir as suas mágoas.",
  "crownfall_arcana_sm_purchase": "Comprar - %1$s",
  "crownfall_arcana_sm_purchase_note": "Desconto disponível com moedas de Crownfall",
  "crownfall_arcana_sm_alternate_header": "Desbloqueável",
  "crownfall_arcana_sm_alternate_title": "Estilo alternativo",
  "crownfall_arcana_sm_alternate_desc": "Completa a missão principal no Ato IV para desbloqueares o estilo alternativo do conjunto Arcano do Skywrath Mage.",
  "crownfall_arcana_vs_hero": "The Resurrection of Shen",
  "crownfall_arcana_vs_a": "Modelo e pedestal",
  "crownfall_arcana_vs_a_long": "Com as suas asas de volta, Shendelzare recebeu um modelo totalmente novo com um conjunto completo de itens dignos da realeza de Skywrath, assim como um novo pedestal e dois estilos alternativos desbloqueáveis.",
  "crownfall_arcana_vs_b": "Animações e efeitos exclusivos",
  "crownfall_arcana_vs_b_long": "Inclui animações e efeitos de ambiente totalmente novos, assim como ícones e efeitos exclusivos para Magic Missile, Wave of Terror, Nether Swap e a ilusão criada por Vengeance Aura.",
  "crownfall_arcana_vs_c": "Novos elementos",
  "crownfall_arcana_vs_c_long": "Inclui um novo retrato, ícone no minimapa e retrato na barra superior, efeitos totalmente novos para ataques, vítimas, mortes e negações, além de um ícone e efeitos para o item Force Staff e um ícone para Aghanim's Scepter.",
  "crownfall_arcana_vs_d": "Falas exclusivas",
  "crownfall_arcana_vs_d_long": "Com as asas restauradas e de olho no trono que é seu por direito, Shendelzare tem novas falas que refletem a nova forma corpórea.",
  "crownfall_arcana_vs_purchase": "Comprar - %1$s",
  "crownfall_arcana_vs_purchase_note": "Desconto disponível com moedas de Crownfall",
  "crownfall_arcana_vs_alternate_header": "Desbloqueável",
  "crownfall_arcana_vs_alternate_title": "Estilos alternativos",
  "crownfall_arcana_vs_alternate_desc": "Completa a missão principal no Ato IV para desbloqueares o primeiro estilo alternativo. Completa todas as missões principais e secundárias do evento Crownfall para desbloqueares o segundo estilo alternativo.",
  "crownfall_treasures_title": "Tesouros",
  "crownfall_treasures_description": "Novos conjuntos para alguns dos teus heróis favoritos, incluindo conjuntos raros para Wraith King, Crystal Maiden, Hoodwink e muitos mais. Os conjuntos para o Meepo e para a Drow Ranger incluem provocações exclusivas.",
  "crownfall_treasure_item_0_name": "Phalanx of the Bronze Eagle",
  "crownfall_treasure_item_0_hero": "Tesouro I - Comum",
  "crownfall_treasure_item_1_name": "Ravencloak",
  "crownfall_treasure_item_1_hero": "Tesouro II - Muito Raro",
  "crownfall_treasure_item_1_sub": "Inclui provocação exclusiva",
  "crownfall_treasure_item_2_name": "Blood Raven",
  "crownfall_treasure_item_2_hero": "Tesouro I - Comum",
  "crownfall_treasure_item_3_name": "Thunderbird",
  "crownfall_treasure_item_3_hero": "Tesouro II - Raro",
  "crownfall_treasure_item_4_name": "Mocking Bird",
  "crownfall_treasure_item_4_hero": "Tesouro I - Muito Raro",
  "crownfall_treasure_item_4_sub": "Inclui provocação exclusiva",
  "crownfall_treasure_item_5_name": "Whispering Wings",
  "crownfall_treasure_item_5_hero": "Tesouro I - Raro",
  "crownfall_treasure_item_6_name": "Owly Bear",
  "crownfall_treasure_item_6_hero": "Tesouro II - Ultra Raro",
  "crownfall_treasure_item_7_name": "Crown of the Condor",
  "crownfall_treasure_item_7_hero": "Tesouro I - Raro",
  "crownfall_treasure_item_8_name": "Verdant Swarm",
  "crownfall_treasure_item_8_hero": "Tesouro I - Comum",
  "crownfall_treasure_item_9_name": "Birdfeed Bandit",
  "crownfall_treasure_item_9_hero": "Tesouro II - Raro",
  "crownfall_treasure_item_10_name": "Lionheart",
  "crownfall_treasure_item_10_hero": "Tesouro II - Comum",
  "crownfall_treasure_item_11_name": "Servant of Scree'Auk Baby Roshan",
  "crownfall_treasure_item_11_hero": "Tesouro I e II - Cosmicamente Raro",
  "crownfall_treasure_purchase_1": "Tesouro I - %1$s",
  "crownfall_treasure_purchase_2": "Tesouro II - %1$s",
  "crownfall_footer_act_1": "Ato[br][b]I[/b]",
  "crownfall_footer_act_2": "Ato[br][b]II[/b]",
  "crownfall_footer_act_3": "Ato[br][b]III[/b]",
  "crownfall_footer_act_4": "Ato[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "Os Mercados de[br][b]Midgate[/b]",
  "crownfall_footer_act_2_name": "Os Desertos de[br][b]Druud[/b]",
  "crownfall_footer_act_3_name": "As Geadas de[br][b]Icewrack[/b]",
  "crownfall_footer_act_4_name": "As Torres de[br][b]Skywrath[/b]",
  "crownfall_footer_act_play": "Joga já",
  "crownfall_footer_act_unlocks_mid_may": "Em meados de maio",
  "crownfall_footer_act_locked": "Indisponível"
}