// 1.js

{
  "language": "swedish",
  "crownfallcomic_title_cover": "Upphöjelsedagen – framsida",
  "crownfallcomic_title": "Upphöjelsedagen – sida %1$s",
  "crownfallcomic_help_text": "Kicka på bilden eller använd mellanslagstangenten för att gå vidare",
  "crownfallcomic_return_button": "Tillbaka till framsidan",
  "crownfall_title": "Crownfall",
  "crownfall_welcome": "Spela Dota för att låsa upp exotiska platser, nya karaktärer och mörka hemligheter i ett pågående storyevent fyllt med legendariska hjältar och unika belöningar. Tillgängligt gratis nu för alla Dota-spelare.",
  "crownfall_newstory_title": "Återta tronen",
  "crownfall_newstory_description": "Shendelzare, den rättmätiga drottningen av Skywrath, har med brutalitet blivit avsatt av sin syster, Imperia. Dragonus krafter och liv var i imperias händer då han var medlem i hennes livgarde. Nu, med hjälp av gudinnan Scree'Auk, har båda fått nya krafter, och en sista chans att få sin hämnd ... och tronen.",
  "crownfall_comic_title": "Bakgrunden",
  "crownfall_comic_description": "Drottning Imperia har förbjudit dyrkan av Scree'Auk. Driven till att gömma sig i Midportens slumkvarter kläcker den avsatta gudinnan en desperat plan för att ta tillbaka kontrollen över Skywrath.",
  "crownfall_comic_button": "Läs serien",
  "crownfall_howtoplay_title": "Äventyret väntar",
  "crownfall_howtoplay_description": "Led Shen och Dragonus genom Skywraths livliga gator i deras strävan att ta tillbaka tronen! Interagera med en grupp nya karaktärer och gamla favoriter, avslöja mörka hemligheter, utför vanvettiga sidouppdrag och kanske lite abborrfiske av och till. Få fler belöningar ju mer du fördjupar dig i den detaljerade, interaktiva världskartan.",
  "crownfall_explainer_a_long": "[b]UTFORSKA.[/b] Du tjänar polletter för alla Dota-matcher du spelar under Crownfall-eventet. Olika hjältar ger dig olika pollettyper.",
  "crownfall_explainer_b_long": "[b]LÅS UPP.[/b] Använd polletter för att låsa upp vägar på övervärldskartan, göra framsteg i berättelsen och tjäna belöningar. Håll utkik efter speciella möten som till exempel Polletthandlaren och Godsaksvagnen!",
  "crownfall_explainer_c_long": "[b]HÄMNAS.[/b] Samla skatter, godis, Crownfall-mynt och mer när du kämpar för att avsätta den onda drottningen Imperia.",
  "crownfall_fouracts_title": "Berättelsen utvecklar sig",
  "crownfall_fouracts_description": "Midportens marknader är bara den första akten i en pågående berättelse i fyra akter som kommer att sträcka sig över de närmaste månaderna. Du kommer att kunna spela igenom nya akter så snart de blir tillgängliga, men du kan också gå igenom äventyret i din egen takt – introduktionen av en ny akt kommer inte att stänga en tidigare. [br][br]Vilket innebär att du kan ta så lång tid som du vill till utforska alla möjliga vägar, utmaningar och hemligheter i akt I. Det finns redan så mycket att hitta, men det här eventet har bara börjat. Crownfall kommer att fortsätta expandera allt eftersom storyn utvecklas under de kommande månaderna, där varje ny akt har en egen story, karaktärer, en unik övervärldskarta och helt nya belöningar. Det kan till och med dyka upp en överraskning eller två längs vägen.",
  "crownfall_rewards_title": "Belöningar",
  "crownfall_rewards_a": "Crownfall-mynt",
  "crownfall_rewards_a_long_new": "Tjäna Crownfall-mynt genom att utforska olika vägar på kartan. Samla 10 mynt för att byta dem i Crownfall-butiken mot en ungefärlig rabatt på %1$s på alla artiklar som kostar %1$s eller mer (exakt rabatt varierar beroende på region och valuta).",
  "crownfall_rewards_b": "Skatter",
  "crownfall_rewards_b_long": "Akt I innehåller två olika skattkistor med totalt 24 nya föremålsset. Du kommer att kunna låsa upp några av seten bara genom att spela!",
  "crownfall_rewards_c": "Godispåsar",
  "crownfall_rewards_c_long": "Hitta Sithils och Quirts godsaksvagn på varje Crownfall-karta för att uppgradera den och byta ditt godis mot hjälteset, kurirer, wards och mer (det finns till och med en sällsynt chans till arcana!).",
  "crownfall_rewards_andmanymore": "Och det är inte allt! Avtäck helt nya laddningsskärmar, uttryck dig med uttryckssymboler, sprejer och nya chatthjulsrepliker, dekorera dina hjältar med unika föremål som hittats längs berättelsens väg, och ännu mer – det finns en hel värld som väntar på att utforskas av dig.",
  "crownfall_explorerpack_title": "Midportens vägvisarpaket",
  "crownfall_explorerpack_description": "Alla belöningar i Crownfalls huvudberättelse kommer att vara tillgängliga för alla spelare gratis. Men för erfarna äventyrare som vill ta steget längre i akt I, erbjuder Midportens vägvisarpaket mer kartutforskning, fler berättelser och fler belöningar.",
  "crownfall_explorerpack_description_long": "Genom att köpa paketet låser du upp sidouppdrag och speciella belöningar på kartan. Utöver belöningarna som är tillgängliga på gratisvägen, ger vägvisarpaketet även ytterligare skatter, Crownfall-creeps, odödliga föremål och föremål för genomförande, extra Crownfall-mynt som kan användas för att spara på butiksartiklar och mer.",
  "crownfall_explorerpack_purchase_act1_a": "Akt I",
  "crownfall_explorerpack_purchase_act1_b": "Eyrie",
  "crownfall_explorerpack_purchase_act1_c": "Midportens vägvisarpaket",
  "crownfall_explorerpack_purchase": "Köp %1$s",
  "crownfall_arcanas_title": "Arcana",
  "crownfall_arcanas_description": "Den döende gudinnan Scree'Auk har försett Vengeful Spirit och Skywrath Mage med de sista av sina krafter, till ett pris: De måste använda hennes mörka magi för att störta den förrädiska drottningen av Skywrath.",
  "crownfall_arcana_sm_hero": "The Devotions of Dragonus",
  "crownfall_arcana_sm_a": "Modell och piedestal",
  "crownfall_arcana_sm_a_long": "Dragonus har fått en helt ny modell med ett komplett föremålsset som passar hans sanna lojalitet, samt en ny piedestal och upplåsbar alternativ stil.",
  "crownfall_arcana_sm_b": "Anpassade animationer och effekter",
  "crownfall_arcana_sm_b_long": "Innehåller ett komplett set av helt nya animationer och omgivningseffekter, inklusive anpassade ikoner och effekter för Arcane Bolt, Concussive Shot, Ancient Seal och Mystic Flare.",
  "crownfall_arcana_sm_c": "Anpassade hjälteresurser",
  "crownfall_arcana_sm_c_long": "Innehåller ett nytt porträtt, en minikartsikon och ett porträtt i det översta fältet, helt nya effekter för attacker, kills, dödsfall och nekanden, plus föremålsikoner och effekter för Rod of Atos och Phylactery.",
  "crownfall_arcana_sm_d": "Arcanarepliker",
  "crownfall_arcana_sm_d_long": "Dragonus är fri från Imperias inflytande och har fått helt nya repliker för att kunna framföra sina klagomål.",
  "crownfall_arcana_sm_purchase": "Köp %1$s",
  "crownfall_arcana_sm_purchase_note": "Rabatt tillgänglig med Crownfall-mynt",
  "crownfall_arcana_sm_alternate_header": "Upplåsningsbar",
  "crownfall_arcana_sm_alternate_title": "Alternativ stil",
  "crownfall_arcana_sm_alternate_desc": "Slutför huvuduppdraget i akt IV för att låsa upp den alternativa stilen för arcanan till Skywrath Mage.",
  "crownfall_arcana_vs_hero": "The Resurrection of Shen",
  "crownfall_arcana_vs_a": "Modell och piedestal",
  "crownfall_arcana_vs_a_long": "Shendelzare har återfått sina vingar och en helt ny modell med ett komplett föremålsset som är värdigt en Skywrath-kunglighet, inklusive en ny piedestal och två upplåsbara alternativa stilar.",
  "crownfall_arcana_vs_b": "Anpassade animationer och effekter",
  "crownfall_arcana_vs_b_long": "Innehåller ett komplett set med helt nya animationer och omgivningseffekter, inklusive anpassade ikoner och effekter för Magic Missile, Wave of Terror, Nether Swap och en anpassad Vengeful Illusion-effekt.",
  "crownfall_arcana_vs_c": "Anpassade hjälteresurser",
  "crownfall_arcana_vs_c_long": "Innehåller ett nytt porträtt, en minikartsikon och ett porträtt i översta fältet, helt nya effekter för attacker, kills, dödsfall och nekanden, plus en föremålsikon och effekter för Force Staff och en anpassad ikon för Aghanim's Scepter.",
  "crownfall_arcana_vs_d": "Arcanarepliker",
  "crownfall_arcana_vs_d_long": "Med vingarna tillbaka och ögonen riktade mot sin rättmätiga tron, har Shendelzare fått helt nya repliker som avspeglar hennes kroppsliga form.",
  "crownfall_arcana_vs_purchase": "Köp %1$s",
  "crownfall_arcana_vs_purchase_note": "Rabatt tillgänglig med Crownfall-mynt",
  "crownfall_arcana_vs_alternate_header": "Upplåsningsbar",
  "crownfall_arcana_vs_alternate_title": "Alternativa stilar",
  "crownfall_arcana_vs_alternate_desc": "Slutför huvuduppdraget i akt IV för att låsa upp den första alternativa stilen. Slutför alla huvuduppdrag och alla sidouppdrag i Crownfall för att låsa upp den andra alternativa stilen.",
  "crownfall_treasures_title": "Skatter",
  "crownfall_treasures_description": "Helt nya föremålsset för några av dina favorithjältar, inklusive sällsynta set för Wraith King, Crystal Maiden, Hoodwink och mer. Meepo och Drow Ranger-set har anpassade hån.",
  "crownfall_treasure_item_0_name": "Phalanx of the Bronze Eagle",
  "crownfall_treasure_item_0_hero": "Skatt I – vanlig",
  "crownfall_treasure_item_1_name": "Ravencloak",
  "crownfall_treasure_item_1_hero": "Skatt II – väldigt sällsynt",
  "crownfall_treasure_item_1_sub": "Innehåller anpassat hån",
  "crownfall_treasure_item_2_name": "Blood Raven",
  "crownfall_treasure_item_2_hero": "Skatt I – vanlig",
  "crownfall_treasure_item_3_name": "Thunderbird",
  "crownfall_treasure_item_3_hero": "Skatt II – sällsynt",
  "crownfall_treasure_item_4_name": "Mocking Bird",
  "crownfall_treasure_item_4_hero": "Skatt II – väldigt sällsynt",
  "crownfall_treasure_item_4_sub": "Innehåller anpassat hån",
  "crownfall_treasure_item_5_name": "Whispering Wings",
  "crownfall_treasure_item_5_hero": "Skatt I – sällsynt",
  "crownfall_treasure_item_6_name": "Owly Bear",
  "crownfall_treasure_item_6_hero": "Skatt II – ultrasällsynt",
  "crownfall_treasure_item_7_name": "Crown of the Condor",
  "crownfall_treasure_item_7_hero": "Skatt I – sällsynt",
  "crownfall_treasure_item_8_name": "Verdant Swarm",
  "crownfall_treasure_item_8_hero": "Skatt I – vanlig",
  "crownfall_treasure_item_9_name": "Birdfeed Bandit",
  "crownfall_treasure_item_9_hero": "Skatt II – sällsynt",
  "crownfall_treasure_item_10_name": "Lionheart",
  "crownfall_treasure_item_10_hero": "Skatt II – vanlig",
  "crownfall_treasure_item_11_name": "Servant of Scree'Auk Baby Roshan",
  "crownfall_treasure_item_11_hero": "Skatt I/II – ytterst sällsynt",
  "crownfall_treasure_purchase_1": "Skatt I – %1$s",
  "crownfall_treasure_purchase_2": "Skatt II – %1$s",
  "crownfall_footer_act_1": "Akt[br][b]I[/b]",
  "crownfall_footer_act_2": "Akt[br][b]II[/b]",
  "crownfall_footer_act_3": "Akt[br][b]III[/b]",
  "crownfall_footer_act_4": "Akt[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "Midportens[br][b]marknader[/b]",
  "crownfall_footer_act_2_name": "Druuds[br][b]öknar[/b]",
  "crownfall_footer_act_3_name": "Icewracks[br][b]frostmarker[/b]",
  "crownfall_footer_act_4_name": "Skywraths[br][b]spiror[/b]",
  "crownfall_footer_act_play": "Spela nu",
  "crownfall_footer_act_unlocks_mid_may": "Låses upp i mitten av maj",
  "crownfall_footer_act_locked": "Låst"
}