// 657.js

{
  "language": "greek",
  "crownfallcomic_title_cover": "Άνοδος – Εξώφυλλο",
  "crownfallcomic_title": "Άνοδος – Σελίδα %1$s",
  "crownfallcomic_help_text": "ΠΑΤΗΣΤΕ ΣΤΗΝ ΕΙΚΟΝΑ Ή ΧΡΗΣΙΜΟΠΟΙΗΣΤΕ ΤΟ ΠΛΗΚΤΡΟ ΔΙΑΣΤΗΜΑΤΟΣ ΓΙΑ ΣΥΝΕΧΕΙΑ",
  "crownfallcomic_return_button": "ΕΠΙΣΤΡΟΦΗ ΣΤΟ ΕΞΩΦΥΛΛΟ",
  "crownfallcomic_act1_intro_title_cover": "Άνοδος – Εξώφυλλο",
  "crownfallcomic_act1_intro_title": "Άνοδος – Σελίδα %1$s",
  "crownfallcomic_act2_intro_title_cover": "Η Μάχη της Κοιλάδας του Διαβόλου – Εξώφυλλο",
  "crownfallcomic_act2_intro_title": "Η Μάχη της Κοιλάδας του Διαβόλου – Σελίδα %1$s",
  "crownfallcomic_act3_intro_title_cover": "Ο Δράκος – Εξώφυλλο",
  "crownfallcomic_act3_intro_title": "Ο Δράκος – Σελίδα %1$s",
  "crownfall_title": "Crownfall",
  "crownfall_welcome": "Παίξτε Dota και ξεκλειδώστε εξωτικές τοποθεσίες, νέους χαρακτήρες και σκοτεινά μυστικά σε ένα συμβάν-ιστορία, γεμάτο με θρυλικούς ήρωες και μοναδικές ανταμοιβές. Διαθέσιμο τώρα δωρεάν σε όλους τους παίκτες Dota.",
  "crownfall_newstory_title": "ΠΑΡΤΕ ΠΙΣΩ ΤΟΝ ΘΡΟΝΟ",
  "crownfall_newstory_description": "Η Σεντελζάρ, η νόμιμη βασίλισσα της Skywrath, εκθρονίστηκε βίαια από την αδερφή της, την Ιμπίρια. Ο Ντραγκόνους, ως μέλος της επίλεκτης Βασιλικής Φρουράς της Ιμπίρια, βρίσκεται στο έλεός της τόσο για τις δυνάμεις του όσο και για τη ζωή του. Τώρα, με τη βοήθεια της θεάς Σκρι-οκ, αποκτούν και οι δύο νέες δυνάμεις, καθώς και μια ευκαιρία να πάρουν το αίμα τους… και τον θρόνο πίσω.",
  "crownfall_comic_title": "Μάθετε την ιστορία",
  "crownfall_comic_description": "Η Βασίλισσα Ιμπίρια έχει απαγορεύσει τη λατρεία της Σκρι-οκ. Αναγκασμένη να κρύβεται στις τρώγλες του Μεσοθυρίου, η εκδιωγμένη θεά καταστρώνει ένα απεγνωσμένο σχέδιο για να πάρει πίσω τον έλεγχο της Skywrath.",
  "crownfall_comic_button": "ΔΙΑΒΑΣΤΕ ΤΟ ΚΟΜΙΚ",
  "crownfall_howtoplay_title": "ΘΑ ΕΧΕΤΕ ΠΕΡΙΠΕΤΕΙΕΣ",
  "crownfall_howtoplay_description": "Καθοδηγήστε τη Σεν και τον Ντραγκόνους μέσα στους πολύβουους δρόμους της Skywrath, καθώς προσπαθούν να πάρουν πίσω τον θρόνο! Αλληλεπιδράστε με νέους αλλά και παλιούς αγαπημένους χαρακτήρες, αποκαλύψτε σκοτεινά μυστικά, αναλάβετε απίστευτες δευτερεύουσες αποστολές και, μια στο τόσο, ψαρέψτε και λιγάκι. Αποκτήστε όλο και περισσότερες ανταμοιβές καθώς προχωράτε στον λεπτομερή και διαδραστικό χάρτη του κόσμου.",
  "crownfall_explainer_a_long": "[b]ΕΞΕΡΕΥΝΗΣΤΕ.[/b] Όταν παίζετε αγώνες Dota κατά τη διάρκεια του Crownfall, θα κερδίζετε μάρκες. Όταν παίζετε με διαφορετικούς ήρωες, θα κερδίζετε διαφορετικούς τύπους μαρκών.",
  "crownfall_explainer_b_long": "[b]ΞΕΚΛΕΙΔΩΣΤΕ.[/b]Χρησιμοποιήστε μάρκες για να ξεκλειδώσετε μονοπάτια στον χάρτη περιοχής. Η ιστορία θα εξελίσσεται και θα κερδίζετε ανταμοιβές. Τα μάτια σας δεκατέσσερα για ειδικές συναντήσεις και ευρήματα, όπως ο «Έμπορος Μαρκών» ή το «Καραβάνι Γλυκών»!",
  "crownfall_explainer_c_long": "[b]ΕΚΔΙΚΗΘΕΙΤΕ.[/b]Συλλέξτε θησαυρούς, γλυκά, Νομίσματα Crownfall και πολλά άλλα, καθώς πολεμάτε για να εκθρονίσετε τη διαβολική Βασίλισσα Ιμπίρια.",
  "crownfall_fouracts_title": "Η ΙΣΤΟΡΙΑ ΞΕΤΥΛΙΓΕΤΑΙ",
  "crownfall_fouracts_description": "Η Αγορά του Μεσοθυρίου είναι η πρώτη Πράξη ενός διηγήματος τεσσάρων Πράξεων σε συνέχειες, που θα εξελιχθεί μέσα στους επόμενους μήνες. Θα μπορείτε να παίξετε τις νέες Πράξεις μόλις γίνονται διαθέσιμες, αλλά έχετε επίσης τη δυνατότητα να ζήσετε την περιπέτεια με τον δικό σας ρυθμό. Η έναρξη μιας νέας Πράξης δεν θα λήγει την επόμενη. [br][br]Αυτό σημαίνει ότι μπορείτε να πάρετε όσον χρόνο θέλετε για να εξερευνήσετε κάθε πιθανό μονοπάτι, πρόκληση και μυστικό στην Πράξη Ι. Και παρότι υπάρχουν πολλά πράγματα να ανακαλύψετε, αυτή είναι μόνο η αρχή. Το Crownfall θα συνεχίσει να επεκτείνεται μέσα στους επόμενους μήνες και κάθε νέα Πράξη θα φέρνει τη δική της ιστορία, χαρακτήρες, χάρτη περιοχής και ολοκαίνουριες ανταμοιβές. Ίσως να υπάρξουν και καμιά-δυο εκπληξούλες στην πορεία.",
  "crownfall_rewards_title": "ΑΝΤΑΜΟΙΒΕΣ",
  "crownfall_rewards_a": "Νομίσματα Crownfall",
  "crownfall_rewards_a_long_new": "Αποκτήστε Νομίσματα Crownfall, εξερευνώντας διαφορετικά μονοπάτια στον χάρτη. Συλλέξτε 10 Νομίσματα και ανταλλάξτε τα στο Κατάστημα Crownfall για έκπτωση αξίας περίπου %1$s σε οποιοδήποτε αντικείμενο κοστίζει %1$s και άνω. Η ακριβής έκπτωση διαφέρει ανά περιοχή και νόμισμα.",
  "crownfall_rewards_b": "Θησαυροί",
  "crownfall_rewards_b_long": "Η Πράξη Ι διαθέτει δύο διαφορετικά σεντούκια θησαυρού, με 24 νέα σετ αντικειμένων. Θα μπορείτε να ξεκλειδώσετε μερικά από τα σετ απλά παίζοντας!",
  "crownfall_rewards_c": "Σάκοι Γλυκών",
  "crownfall_rewards_c_long": "Βρείτε το Καραβάνι Γλυκών των Σίθιλ και Κουίρτ σε κάθε χάρτη Crownfall και αναβαθμίστε τον. Ανταλλάξτε τα γλυκά σας για σετ ηρώων, κούριερ, ματάκια (ward) και πολλά άλλα. Υπάρχει μια σπάνια πιθανότητα να κερδίσετε Arcana!",
  "crownfall_rewards_andmanymore": "Και δεν είναι μόνο αυτά! Ανακαλύψτε ολοκαίνουριες εικόνες φόρτωσης, εκφραστείτε με emoticon, σπρέι και νέες φωνητικές ατάκες, διακοσμήστε τους ήρωές σας με μοναδικά σετ αντικειμένων που θα βρείτε στο μονοπάτι της ιστορίας, και πολλά άλλα. Ένας ολόκληρος κόσμος περιμένει να τον εξερευνήσετε.",
  "crownfall_explorerpack_title": "ΠΑΚΕΤΟ ΙΧΝΗΛΑΤΗ ΜΕΣΟΘΥΡΙΟΥ",
  "crownfall_explorerpack_description": "Όλες οι ανταμοιβές στο μονοπάτι της κύριας ιστορίας του Crownfall θα είναι διαθέσιμες δωρεάν για όλους τους παίκτες. Αλλά για τους μπαρουτοκαπνισμένους εξερευνητές που θέλουν να ζήσουν λίγο εντονότερα την Πράξη Ι, το Πακέτο Ιχνηλάτη Μεσοθυρίου προσφέρει περισσότερη εξερεύνηση, περισσότερες ιστορίες και περισσότερες ανταμοιβές.",
  "crownfall_explorerpack_description_long": "Η αγορά του πακέτου ξεκλειδώνει δευτερεύουσες αποστολές και ειδικές ανταμοιβές στον χάρτη. Σε συνδυασμό με τις διαθέσιμες ανταμοιβές στο δωρεάν μονοπάτι, το Πακέτο Ιχνηλάτη δίνει επίσης επιπλέον θησαυρούς, κριπάκια Crownfall, αντικείμενα ολοκλήρωσης και Immortal, επιπλέον Νομίσματα Crownfall που μπορούν να χρησιμοποιηθούν για εκπτώσεις σε αντικείμενα του Καταστήματος, και πολλά άλλα.",
  "crownfall_explorerpack_purchase_act1_a": "ΠΡΑΞΗ I",
  "crownfall_explorerpack_purchase_act1_b": "Η ΦΩΛΕΑ",
  "crownfall_explorerpack_purchase_act1_c": "ΠΑΚΕΤΟ ΙΧΝΗΛΑΤΗ ΜΕΣΟΘΥΡΙΟΥ",
  "crownfall_explorerpack_purchase": "ΑΓΟΡΑ: %1$s",
  "crownfall_arcanas_title": "ARCANA",
  "crownfall_arcanas_description": "Η ετοιμοθάνατη θεά Σκρι-οκ έδωσε στην Vengeful Spirit και τον Skywrath Mage ό,τι είχε απομείνει από τις δυνάμεις της, με ένα τίμημα: Πρέπει να χρησιμοποιήσουν τη σκοτεινή της μαγεία για να ανατρέψουν τη διαβολική Βασίλισσα Ιμπίρια.",
  "crownfall_arcana_sm_hero": "The Devotions of Dragonus",
  "crownfall_arcana_sm_a": "ΜΟΝΤΕΛΟ ΚΑΙ ΒΑΘΡΟ",
  "crownfall_arcana_sm_a_long": "Ο Ντραγκόνους απέκτησε ολοκαίνουριο μοντέλο με πλήρες σετ αντικειμένων, που αρμόζει στην αληθινή του αφοσίωση, ένα νέο βάθρο και ένα εναλλακτικό στιλ με δυνατότητα ξεκλειδώματος.",
  "crownfall_arcana_sm_b": "ΠΡΟΣΑΡΜΟΣΜΕΝΕΣ ΚΙΝΗΣΕΙΣ ΚΑΙ ΕΦΕ",
  "crownfall_arcana_sm_b_long": "Διαθέτει ένα πλήρες σετ ολοκαίνουριων κινήσεων και εφέ περιβάλλοντος, μεταξύ των οποίων προσαρμοσμένα εικονίδια και εφέ για τα Arcane Bolt, Concussive Shot, Ancient Seal και Mystic Flare.",
  "crownfall_arcana_sm_c": "ΠΡΟΣΑΡΜΟΣΜΕΝΑ ΣΤΟΙΧΕΙΑ ΗΡΩΑ",
  "crownfall_arcana_sm_c_long": "Περιλαμβάνει νέο πορτρέτο, εικονίδιο μικρού χάρτη και πορτρέτο στην πάνω μπάρα, ολοκαίνουρια εφέ για επιθέσεις, σκοτωμούς, θανάτους και αρνήσεις, καθώς και εικονίδια και εφέ για το Rod of Atos και το Phylactery.",
  "crownfall_arcana_sm_d": "ΦΩΝΗΤΙΚΕΣ ΑΤΑΚΕΣ ARCANA",
  "crownfall_arcana_sm_d_long": "Ελεύθερος από την επιρροή της Ιμπίρια, ο Ντραγκόνους έχει ολοκαίνουρια φωνητική απόδοση για να εκφράσει τα παράπονά του.",
  "crownfall_arcana_sm_purchase": "ΑΓΟΡΑ: %1$s",
  "crownfall_arcana_sm_purchase_note": "Η έκπτωση διατίθεται με Νομίσματα Crownfall",
  "crownfall_arcana_sm_alternate_header": "ΞΕΚΛΕΙΔΩΝΕΤΑΙ",
  "crownfall_arcana_sm_alternate_title": "ΕΝΑΛΛΑΚΤΙΚΟ ΣΤΙΛ",
  "crownfall_arcana_sm_alternate_desc": "Ολοκληρώστε την κύρια αποστολή στην Πράξη IV για να ξεκλειδώσετε το εναλλακτικό στιλ Skywrath Mage Arcana.",
  "crownfall_arcana_vs_hero": "The Resurrection of Shen",
  "crownfall_arcana_vs_a": "ΜΟΝΤΕΛΟ ΚΑΙ ΒΑΘΡΟ",
  "crownfall_arcana_vs_a_long": "Η Σεντελζάρ ανέκτησε τα φτερά της και απέκτησε ολοκαίνουριο μοντέλο με πλήρες σετ αντικειμένων αντάξιο της βασιλικής οικογένειας της Skywrath, καθώς και ένα νέο βάθρο και δύο εναλλακτικά στιλ με δυνατότητα ξεκλειδώματος.",
  "crownfall_arcana_vs_b": "ΠΡΟΣΑΡΜΟΣΜΕΝΕΣ ΚΙΝΗΣΕΙΣ ΚΑΙ ΕΦΕ",
  "crownfall_arcana_vs_b_long": "Διαθέτει ένα πλήρες σετ ολοκαίνουριων κινήσεων και εφέ περιβάλλοντος, μεταξύ των οποίων προσαρμοσμένα εικονίδια για τα Magic Missile, Wave of Terror, Nether Swap και ένα προσαρμοσμένο εφέ Ψευδαίσθησης της Vengeful Spirit.",
  "crownfall_arcana_vs_c": "ΠΡΟΣΑΡΜΟΣΜΕΝΑ ΣΤΟΙΧΕΙΑ ΗΡΩΑ",
  "crownfall_arcana_vs_c_long": "Περιλαμβάνει νέο πορτρέτο, εικονίδιο μικρού χάρτη και πορτρέτο στην πάνω μπάρα, ολοκαίνουρια εφέ για επιθέσεις, σκοτωμούς, θανάτους και αρνήσεις, καθώς και εικονίδιο και εφέ για το Force Staff και προσαρμοσμένο εικονίδιο για το Aghanim's Scepter.",
  "crownfall_arcana_vs_d": "ΦΩΝΗΤΙΚΕΣ ΑΤΑΚΕΣ ARCANA",
  "crownfall_arcana_vs_d_long": "Η Σεντελζάρ, με τα φτερά της να έχουν αποκατασταθεί και το βλέμμα της στον θρόνο που της ανήκει δικαιωματικά, έχει ολοκαίνουρια φωνητική απόδοση που ταιριάζει με την υλική μορφή της.",
  "crownfall_arcana_vs_purchase": "ΑΓΟΡΑ: %1$s",
  "crownfall_arcana_vs_purchase_note": "Η έκπτωση διατίθεται με Νομίσματα Crownfall",
  "crownfall_arcana_vs_alternate_header": "ΞΕΚΛΕΙΔΩΝΕΤΑΙ",
  "crownfall_arcana_vs_alternate_title": "ΕΝΑΛΛΑΚΤΙΚΑ ΣΤΙΛ",
  "crownfall_arcana_vs_alternate_desc": "Ολοκληρώστε την κύρια αποστολή στην Πράξη IV για να ξεκλειδώσετε το πρώτο εναλλακτικό στιλ. Ολοκληρώστε όλες τις αποστολές στο Crownfall (κύριες και δευτερεύουσες), για να ξεκλειδώσετε το δεύτερο εναλλακτικό στιλ.",
  "crownfall_treasures_title": "ΘΗΣΑΥΡΟΙ",
  "crownfall_treasures_description": "Ολοκαίνουρια σετ αντικειμένων για μερικούς από τους αγαπημένους σας ήρωες, όπως σπάνια σετ για τον Wraith King, την Crystal Maiden, τη Hoodwink και άλλους. Τα σετ του Μeepo και της Drow Ranger έχουν μαζί και προσαρμοσμένους χλευασμούς.",
  "crownfall_treasure_item_0_name": "Phalanx of the Bronze Eagle",
  "crownfall_treasure_item_0_hero": "ΘΗΣΑΥΡΟΣ I – ΣΥΝΗΘΙΣΜΕΝΟΣ",
  "crownfall_treasure_item_1_name": "Ravencloak",
  "crownfall_treasure_item_1_hero": "ΘΗΣΑΥΡΟΣ II — ΠΟΛΥ ΣΠΑΝΙΟΣ",
  "crownfall_treasure_item_1_sub": "Περιλαμβάνει προσαρμοσμένο χλευασμό",
  "crownfall_treasure_item_2_name": "Blood Raven",
  "crownfall_treasure_item_2_hero": "ΘΗΣΑΥΡΟΣ I – ΣΥΝΗΘΙΣΜΕΝΟΣ",
  "crownfall_treasure_item_3_name": "Thunderbird",
  "crownfall_treasure_item_3_hero": "ΘΗΣΑΥΡΟΣ II — ΣΠΑΝΙΟΣ",
  "crownfall_treasure_item_4_name": "Mocking Bird",
  "crownfall_treasure_item_4_hero": "ΘΗΣΑΥΡΟΣ I — ΠΟΛΥ ΣΠΑΝΙΟΣ",
  "crownfall_treasure_item_4_sub": "Περιλαμβάνει προσαρμοσμένο χλευασμό",
  "crownfall_treasure_item_5_name": "Whispering Wings",
  "crownfall_treasure_item_5_hero": "ΘΗΣΑΥΡΟΣ I — ΣΠΑΝΙΟΣ",
  "crownfall_treasure_item_6_name": "Owly Bear",
  "crownfall_treasure_item_6_hero": "ΘΗΣΑΥΡΟΣ II — ΕΞΑΙΡΕΤΙΚΑ ΣΠΑΝΙΟΣ",
  "crownfall_treasure_item_7_name": "Crown of the Condor",
  "crownfall_treasure_item_7_hero": "ΘΗΣΑΥΡΟΣ I — ΣΠΑΝΙΟΣ",
  "crownfall_treasure_item_8_name": "Verdant Swarm",
  "crownfall_treasure_item_8_hero": "ΘΗΣΑΥΡΟΣ I – ΣΥΝΗΘΙΣΜΕΝΟΣ",
  "crownfall_treasure_item_9_name": "Birdfeed Bandit",
  "crownfall_treasure_item_9_hero": "ΘΗΣΑΥΡΟΣ II — ΣΠΑΝΙΟΣ",
  "crownfall_treasure_item_10_name": "Lionheart",
  "crownfall_treasure_item_10_hero": "ΘΗΣΑΥΡΟΣ II – ΣΥΝΗΘΙΣΜΕΝΟΣ",
  "crownfall_treasure_item_11_name": "Servant of Scree'Auk Baby Roshan",
  "crownfall_treasure_item_11_hero": "ΘΗΣΑΥΡΟΣ I/II - ΚΟΣΜΙΚΑ ΣΠΑΝΙΟΣ",
  "crownfall_treasure_purchase_1": "ΘΗΣΑΥΡΟΣ I — %1$s",
  "crownfall_treasure_purchase_2": "ΘΗΣΑΥΡΟΣ II — %1$s",
  "crownfall_footer_act_1": "ΠΡΑΞΗ[br][b]I[/b]",
  "crownfall_footer_act_2": "ΠΡΑΞΗ[br][b]II[/b]",
  "crownfall_footer_act_3": "ΠΡΑΞΗ[br][b]III[/b]",
  "crownfall_footer_act_4": "ΠΡΑΞΗ[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "Η ΑΓΟΡΑ ΤΟΥ[br][b]ΜΕΣΟΘΥΡΙΟΥ[/b]",
  "crownfall_footer_act_2_name": "Η ΕΡΗΜΟΣ ΤΟΥ[br][b]DRUUD[/b]",
  "crownfall_footer_act_3_name": "Ο ΠΑΓΕΤΟΣ ΤΗΣ[br][b]ICEWRACK[/b]",
  "crownfall_footer_act_4_name": "ΟΙ ΠΥΡΓΟΙ ΤΗΣ[br][b]SKYWRATH[/b]",
  "crownfall_footer_act_play": "ΠΑΙΞΤΕ ΤΩΡΑ",
  "crownfall_footer_act_unlocks_mid_may": "ΜΕΣΑ ΜΑΗ",
  "crownfall_footer_act_locked": "ΚΛΕΙΔΩΜΕΝΟ"
}