// 995.js

{
  "language": "german",
  "crownfallcomic_title_cover": "Tag der Krönung – Titelseite",
  "crownfallcomic_title": "Tag der Krönung – Seite %1$s",
  "crownfallcomic_help_text": "Zum Umblättern Bild anklicken oder Leertaste drücken",
  "crownfallcomic_return_button": "Zurück zur Titelseite",
  "crownfall_title": "Thronsturz",
  "crownfall_welcome": "Spielen Sie Dota, um exotische Orte, neue Charaktere und dunkle Geheimnisse in einer fortlaufenden Geschichte voller legendärer Helden zu entdecken und einzigartige Belohnungen freizuschalten. Ab sofort für alle Dota-Spieler kostenlos verfügbar.",
  "crownfall_newstory_title": "Die Rückforderung des Throns",
  "crownfall_newstory_description": "Shendelzare, die rechtmäßige Königin von Himmelszorn, wurde von ihrer Schwester Imperia auf brutale Weise gestürzt. Als Mitglied von Imperias auserlesenen Magiergarde lagen die Kräfte und das Leben von Dragonus in ihrer Hand. Nun haben beide mithilfe der Göttin Scree’Auk neue Kräfte erlangt und eine letzte Chance erhalten, sich zu rächen … und den Thron zurückzufordern.",
  "crownfall_comic_title": "Was bisher geschah …",
  "crownfall_comic_description": "Königin Imperia verbot die Verehrung von Scree’Auk. Versteckt in den Elendsvierteln der Mittleren Pforte schmiedet die ihrer Macht beraubte Göttin einen verzweifelten Plan, um die Kontrolle über Himmelszorn zurückzuerlangen.",
  "crownfall_comic_button": "Lesen Sie den Comic",
  "crownfall_howtoplay_title": "Das Abenteuer beginnt",
  "crownfall_howtoplay_description": "Begleiten Sie Shen und Dragonus durch die belebten Straßen der Mittleren Pforte in ihrem Bestreben, den Thron zurückzufordern! Interagieren Sie mit einer Reihe neuer und altbekannter Charaktere, decken Sie dunkle Geheimnisse auf, erledigen Sie abenteuerliche Nebenquests oder angeln Sie bei der passenden Gelegenheit sogar ein paar Barsche. Je tiefer Sie die detaillierte, interaktive Karte des Gebiets erkunden, desto mehr Belohnungen können Sie erhalten.",
  "crownfall_explainer_a_long": "[b]ERKUNDEN:[/b] Während des Thronsturz-Events erhalten Sie Marken für das Spielen von Dota-Partien. Diese Marken unterscheiden sich je nachdem, welchen Helden Sie spielen.",
  "crownfall_explainer_b_long": "[b]FREISCHALTEN:[/b] Benutzen Sie Marken, um Pfade auf der Karte des jeweiligen Gebiets freizuschalten, in der Geschichte voranzukommen und Belohnungen zu verdienen. Halten Sie Ausschau nach besonderen Begegnungen wie dem Markenhändler oder der Karawane des Bonbonladens!",
  "crownfall_explainer_c_long": "[b]RÄCHEN:[/b] Sammeln Sie Schätze, Bonbons, Thronsturz-Münzen und mehr während Ihres Kampfes zur Entthronung der bösen Königin Imperia.",
  "crownfall_fouracts_title": "Die Geschichte nimmt ihren Lauf",
  "crownfall_fouracts_description": "„Die Märkte der Mittleren Pforte“ ist lediglich der erste Akt einer fortlaufenden Geschichte in vier Akten, die sich über die nächsten Monate erstreckt. Sie können neue Akte durchspielen, sobald diese verfügbar werden. Aber lassen Sie sich dadurch nicht davon abhalten, das Abenteuer in Ihrem eigenen Tempo zu erleben: Durch die Veröffentlichung eines neuen Akts wird ein früherer nicht abgeschlossen.[br][br]Das bedeutet, Sie können sich so viel Zeit nehmen, wie Sie möchten, um alle möglichen Pfade, Herausforderungen und Geheimnisse in Akt I zu erkunden. Und obwohl es so viel zu entdecken gibt, hat dieses Event gerade erst begonnen. In den kommenden Monaten wird Thronsturz um viele neue Inhalte erweitert, wobei jeder neue Akt seine eigene Geschichte, Charaktere, eine einzigartige Karte und brandneue Belohnungen mit sich bringt. Und vielleicht gibt es zwischendurch sogar die eine oder andere Überraschung?",
  "crownfall_rewards_title": "Belohnungen",
  "crownfall_rewards_a": "Thronsturz-Münzen",
  "crownfall_rewards_a_long_new": "Verdienen Sie Thronsturz-Münzen, indem Sie die verschiedenen Pfade auf der Karte erkunden. Sammeln Sie 10 Münzen, um diese im Thronsturz-Laden gegen einen Rabatt von ungefähr %1$s auf jeden Gegenstand einzutauschen, der %1$s oder mehr kostet. (Der genaue Rabatt variiert je nach Region und Währung.)",
  "crownfall_rewards_b": "Schätze",
  "crownfall_rewards_b_long": "In Akt I können Sie zwei verschiedene Schatztruhen mit insgesamt 24 neuen Gegenstandssets verdienen. Einige dieser Sets können einfach durch Spielen freischaltet werden!",
  "crownfall_rewards_c": "Bonbonbeutel",
  "crownfall_rewards_c_long": "Finden Sie die Karawane von Sithil und Quirts Bonbonladen auf der Karte des jeweiligen Gebiets, um sie aufzuwerten und Ihre Bonbons gegen Heldensets, Kuriere, Wards und mehr einzutauschen. (Es besteht sogar die seltene Chance, ein Arkana zu erhalten!)",
  "crownfall_rewards_andmanymore": "Und das ist noch nicht alles! Entdecken Sie brandneue Ladebildschirme, drücken Sie sich mit Emoticons, Graffitis und neuen Chatradsprüchen aus, rüsten Sie Ihre Helden mit einzigartigen Gegenstandssets aus, die Sie entlang der Pfade der Geschichte finden, und noch mehr — eine ganze Welt wartet darauf, von Ihnen erkundet zu werden.",
  "crownfall_explorerpack_title": "Pfadfinderpaket der Mittleren Pforte",
  "crownfall_explorerpack_description": "Alle Belohnungen auf dem Pfad der Hauptgeschichte von Thronsturz stehen allen Spielern kostenlos zur Verfügung. Jedoch bietet das Pfadfinderpaket der Mittleren Pforte erfahrenen Abenteurern, die etwas tiefer in Akt I eintauchen möchten, mehr Möglichkeiten zur Kartenerkundung, mehr Geschichten und mehr Belohnungen.",
  "crownfall_explorerpack_description_long": "Durch den Kauf des Pakets werden Nebenquests und besondere Belohnungen auf der Karte freigeschaltet. Zusätzlich zu den Belohnungen, die auf dem freien Pfad verfügbar sind, gewährt das Pfadfinderpaket auch zusätzliche Schätze, die Thronsturz-Diener, Immortal-Gegenstände und Gegenstände für den Abschluss eines Pfads, zusätzliche Thronsturz-Münzen, die gegen einen Rabatt auf Gegenstände im Laden eingetauscht werden können, und vieles mehr.",
  "crownfall_explorerpack_purchase_act1_a": "Akt I",
  "crownfall_explorerpack_purchase_act1_b": "Mittlere Pforte",
  "crownfall_explorerpack_purchase_act1_c": "Pfadfinderpaket der Mittleren Pforte",
  "crownfall_explorerpack_purchase": "Für %1$s kaufen",
  "crownfall_arcanas_title": "Arkanas",
  "crownfall_arcanas_description": "Die sterbende Göttin Scree’Auk hat Vengeful Spirit und Skywrath Mage ihre letzten Kräfte überlassen, jedoch unter folgender Bedingung: Sie müssen ihre dunkle Magie einsetzen, um die verräterische Königin von Himmelszorn zu stürzen.",
  "crownfall_arcana_sm_hero": "Die Hingabe von Dragonus",
  "crownfall_arcana_sm_a": "Modell und Sockel",
  "crownfall_arcana_sm_a_long": "Dragonus hat ein brandneues Modell mit einem kompletten Satz an Gegenständen erhalten, die seine wahre Loyalität widerspiegeln, sowie einen neuen Sockel und einen freischaltbaren alternativen Stil.",
  "crownfall_arcana_sm_b": "Angepasste Animationen und Effekte",
  "crownfall_arcana_sm_b_long": "Enthält einen kompletten Satz brandneuer Animationen und Umgebungseffekte, inklusive angepasster Fähigkeitssymbole für Arcane Bolt, Concussive Shot, Ancient Seal und Mystic Flare.",
  "crownfall_arcana_sm_c": "Angepasste Heldenelemente",
  "crownfall_arcana_sm_c_long": "Enthält ein neues Heldenporträt, Minikartensymbol und Kopfleistenporträt, brandneue Effekte für Angriffe, Kills, Tode und Denys, sowie Gegenstandssymbole und Effekte für Rod of Atos und Phylactery.",
  "crownfall_arcana_sm_d": "Heldensprüche für Arkana",
  "crownfall_arcana_sm_d_long": "Frei von Imperias Einfluss erhält Dragonus eine brandneue Stimme, mit der er seinem Unmut Ausdruck verleihen kann.",
  "crownfall_arcana_sm_purchase": "Für %1$s kaufen",
  "crownfall_arcana_sm_purchase_note": "Rabatt verfügbar mit Thronsturz-Münzen",
  "crownfall_arcana_sm_alternate_header": "Freischaltbarer",
  "crownfall_arcana_sm_alternate_title": "Alternativer Stil",
  "crownfall_arcana_sm_alternate_desc": "Schließen Sie die Hauptquest in Akt IV ab, um den alternativen Stil für das Skywrath-Mage-Arkana freizuschalten.",
  "crownfall_arcana_vs_hero": "Die Wiederkehr von Shen",
  "crownfall_arcana_vs_a": "Modell und Sockel",
  "crownfall_arcana_vs_a_long": "Shendelzare hat ihre Flügel wiedererlangt und ein brandneues Modell mit einem kompletten Satz an Gegenständen erhalten, die der Königsfamilie von Himmelszorn würdig sind, sowie einen neuen Sockel und zwei freischaltbare alternative Stile.",
  "crownfall_arcana_vs_b": "Angepasste Animationen und Effekte",
  "crownfall_arcana_vs_b_long": "Enthält einen kompletten Satz brandneuer Animationen und Umgebungseffekte, inklusive angepasster Fähigkeitssymbole für Magic Missile, Wave of Terror und Nether Swap, sowie einen angepassten Effekt für die von Vengeance Aura erschaffene Illusion.",
  "crownfall_arcana_vs_c": "Angepasste Heldenelemente",
  "crownfall_arcana_vs_c_long": "Enthält ein neues Heldenporträt, Minikartensymbol und Kopfleistenporträt, brandneue Effekte für Angriffe, Kills, Tode und Denys, ein neues Gegenstandssymbol und Effekte für Force Staff, sowie ein angepasstes Gegenstandssymbol für Aghanims Zepter.",
  "crownfall_arcana_vs_d": "Heldensprüche für Arkana",
  "crownfall_arcana_vs_d_long": "Mit ihren wiedererlangten Flügeln und ihren rechtmäßigen Thron im Blick erhält Shendelzare eine brandneue Stimme, die ihrer körperlichen Form gerecht wird.",
  "crownfall_arcana_vs_purchase": "Für %1$s kaufen",
  "crownfall_arcana_vs_purchase_note": "Rabatt verfügbar mit Thronsturz-Münzen",
  "crownfall_arcana_vs_alternate_header": "Freischaltbare",
  "crownfall_arcana_vs_alternate_title": "Alternative Stile",
  "crownfall_arcana_vs_alternate_desc": "Schließen Sie die Hauptquest in Akt IV ab, um den ersten alternativen Stil für das Vengeful-Spirit-Arkana freizuschalten. Schließen Sie alle Hauptquests und alle Nebenquests von Thronsturz ab, um den zweiten alternativen Stil freizuschalten.",
  "crownfall_treasures_title": "Schätze",
  "crownfall_treasures_description": "Brandneue Gegenstandssets für einige Ihrer Lieblingshelden, inklusiv seltener Sets für Wraith King, Crystal Maiden, Hoodwink und viele mehr. Die Sets für Meepo und Drow Ranger enthalten einen angepassten Spott.",
  "crownfall_treasure_item_0_name": "Phalanx des Bronzeadlers",
  "crownfall_treasure_item_0_hero": "Schatz I – Gewöhnlich",
  "crownfall_treasure_item_1_name": "Federkleid des Raben",
  "crownfall_treasure_item_1_hero": "Schatz II – Sehr selten",
  "crownfall_treasure_item_1_sub": "Enthält angepassten Spott",
  "crownfall_treasure_item_2_name": "Blutrabe",
  "crownfall_treasure_item_2_hero": "Schatz I – Gewöhnlich",
  "crownfall_treasure_item_3_name": "Donnervogel",
  "crownfall_treasure_item_3_hero": "Schatz II – Selten",
  "crownfall_treasure_item_4_name": "Spottvogel",
  "crownfall_treasure_item_4_hero": "Schatz I — Sehr selten",
  "crownfall_treasure_item_4_sub": "Enthält angepassten Spott",
  "crownfall_treasure_item_5_name": "Flüsternde Flügel",
  "crownfall_treasure_item_5_hero": "Schatz I – Selten",
  "crownfall_treasure_item_6_name": "Eulenbär",
  "crownfall_treasure_item_6_hero": "Schatz II – Ultraselten",
  "crownfall_treasure_item_7_name": "Krone des Kondors",
  "crownfall_treasure_item_7_hero": "Schatz I – Selten",
  "crownfall_treasure_item_8_name": "Grüner Schwarm",
  "crownfall_treasure_item_8_hero": "Schatz I – Gewöhnlich",
  "crownfall_treasure_item_9_name": "Wildernde Banditin",
  "crownfall_treasure_item_9_hero": "Schatz II – Selten",
  "crownfall_treasure_item_10_name": "Löwenherz",
  "crownfall_treasure_item_10_hero": "Schatz II – Gewöhnlich",
  "crownfall_treasure_item_11_name": "Baby-Roshan: Diener von Scree’Auk",
  "crownfall_treasure_item_11_hero": "Schatz I/II – Kosmisch selten",
  "crownfall_treasure_purchase_1": "Schatz I – %1$s",
  "crownfall_treasure_purchase_2": "Schatz II – %1$s",
  "crownfall_footer_act_1": "Akt[br][b]I[/b]",
  "crownfall_footer_act_2": "Akt[br][b]II[/b]",
  "crownfall_footer_act_3": "Akt[br][b]III[/b]",
  "crownfall_footer_act_4": "Akt[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "Die Märkte der[br][b]Mittleren Pforte[/b]",
  "crownfall_footer_act_2_name": "Die Wüsten von[br][b]Druud[/b]",
  "crownfall_footer_act_3_name": "Die Gletscher von[br][b]Eismarsch[/b]",
  "crownfall_footer_act_4_name": "Die Spitzen von[br][b]Himmelszorn[/b]",
  "crownfall_footer_act_play": "Jetzt spielen",
  "crownfall_footer_act_unlocks_mid_may": "Verfügbar ab Mitte Mai",
  "crownfall_footer_act_locked": "Gesperrt"
}