// 8938.js

{
  "language": "norwegian",
  "crownfallcomic_title_cover": "Opphøyelsesdag – forside",
  "crownfallcomic_title": "Opphøyelsesdag – side %1$s",
  "crownfallcomic_help_text": "Trykk på bildet eller bruk mellomrom for å gå videre",
  "crownfallcomic_return_button": "Gå tilbake til forsiden",
  "crownfall_title": "Kronfallet",
  "crownfall_welcome": "Spill Dota for å låse opp eksotiske steder, nye karakterer og mørke hemmeligheter i en pågående historie fylt med legendariske helter og unike belønninger. Tilgjengelig nå for alle Dota-spillere gratis. ",
  "crownfall_newstory_title": "Vinn tronen tilbake",
  "crownfall_newstory_description": "Skjendel, den rettmessige dronningen av Skyvilden, er blitt brutalt avsatt av søsteren sin, Imperia. Som medlem av Imperias magikergarde var Dragonus' liv og krefter prisgitt hennes. Men med gudinnen Skri’alkes hjelp har begge fått nye krefter og en siste sjanse til å ta hevn … og tronen.",
  "crownfall_comic_title": "Få med deg bakgrunnshistorien",
  "crownfall_comic_description": "Dronning Imperia har forbudt tilbedelse av Skri’alke. Drevet i skjul i Midportens slum, klekker den avsatte gudinnen ut en desperat plan for å ta tilbake makten over Skyvilden.",
  "crownfall_comic_button": "Les tegneserien",
  "crownfall_howtoplay_title": "Nye eventyr venter",
  "crownfall_howtoplay_description": "Led Skjendel og Dragonus gjennom de travle gatene i Skyvilden i deres søken etter å ta tilbake tronen! Møt på en rekke nye karakterer og gamle favoritter, avdekk mørke hemmeligheter, begi deg ut på vanvittige sideoppdrag, og til og med litt fisking nå og da. Få flere belønninger jo dypere du vandrer inn i \\n et detaljert, interaktivt kart.",
  "crownfall_explainer_a_long": "[b]UTFORSK.[/b] Du får polletter av å spille kamper i Dota under Kronfallet, og å spille som forskjellige helter gir deg forskjellige typer polletter.",
  "crownfall_explainer_b_long": "[b]LÅS OPP.[/b] Bruk polletter for å låse opp stier på kartet, gå videre i historien og tjene belønninger. Se etter spesielle treff som polletthandleren og godtevognen!",
  "crownfall_explainer_c_long": "[b]TA HEVN.[/b] Samle skatter, godteri og kronfallmynter og mer når du kjemper for å styrte den onde dronning Imperia fra tronen.",
  "crownfall_fouracts_title": "Historien utfolder seg",
  "crownfall_fouracts_description": "Midportens marked er bare den første akten av en pågående fortelling over fire akter, som strekker seg over de neste månedene. Du får anledning til å spille gjennom nye akter så snart de blir tilgjengelige, men du kan også ta deg gjennom eventyret i ditt eget tempo – de foregående aktene blir ikke stengt når en ny akt kommer ut. [br][br]Dermed kan du ta den tiden du trenger for å utforske alle krinkelkroker, utfordringer og hemmeligheter i første akt. Og selv om det er mye å finne, er dette bare begynnelsen av begivenheten. Kronfallet fortsetter å vokse seg større mens det utfoldes over de neste månedene, der hver nye akt kommer med sin egen historie, karakterer, unike oversiktskart og helt nye belønninger. Det kan til og med dukke opp en overraskelse eller to underveis.",
  "crownfall_rewards_title": "Belønninger",
  "crownfall_rewards_a": "Kronfallmynter",
  "crownfall_rewards_a_long_new": "Tjen kronfallmynter ved å utforske ulike stier på kartet. Samle 10 mynter og bytt dem mot en rabatt på omtrent %1$s på alt i Kronfallbutikken som koster %1$s eller mer (nøyaktig rabatt varierer avhengig av region og valuta).",
  "crownfall_rewards_b": "Skatter",
  "crownfall_rewards_b_long": "Første akt har to forskjellige skattkister, med i alt 24 nye gjendstandssett. Du får anledning til å låse opp noen av settene bare ved å spille!",
  "crownfall_rewards_c": "Godteposer",
  "crownfall_rewards_c_long": "Finn Sithil og Quirts godtevogn på hvert kronfallkart for å oppgradere og bytte godteri mot heltesett, kurerer, varder og mer. (Det er til og med en sjelden sjanse for å få arkana!)",
  "crownfall_rewards_andmanymore": "Og det er ikke alt! Avduk helt nye lasteskjermer, uttrykk deg selv med uttrykksikoner, graffitier og helt nye replikker til samtalehjulet, pynt heltene med unike gjenstandssett du finner underveis i historien, og enda mer – det er en hel verden å utforske.",
  "crownfall_explorerpack_title": "Midportens stifinnerpakke",
  "crownfall_explorerpack_description": "Alle belønningene i Kronfallets hovedhistorie er tilgjengelig gratis for alle spillere. Men for hardbarkede eventyrere som vil utforske den første akten ytterligere, kan Midportens stifinnerpakke by på flere veier på kartet, flere historier og flere belønninger.",
  "crownfall_explorerpack_description_long": "Ved å kjøpe pakken låser du opp sideoppdrag og spesielle belønninger på kartet. I tillegg til belønningene som er tilgjengelige langs gratisstien, gir stifinnerpakken ytterligere skatter, Kronfallkryp, udødelige og fullførelsesgjenstander, ekstra kronfallmynter som kan brukes til å spare på butikkgjenstander, og mer.",
  "crownfall_explorerpack_purchase_act1_a": "Akt I",
  "crownfall_explorerpack_purchase_act1_b": "Vildredet",
  "crownfall_explorerpack_purchase_act1_c": "Midportens stifinnerpakke",
  "crownfall_explorerpack_purchase": "Kjøp %1$s",
  "crownfall_arcanas_title": "Arkana",
  "crownfall_arcanas_description": "Den døende gudinnen Skri’alke har gitt Vengeful Spirit og Skywrath Mage sine siste krefter, på en betingelse: De må bruke hennes mørke magi for å velte Skyvildens forræderske dronning.",
  "crownfall_arcana_sm_hero": "The Devotions of Dragonus",
  "crownfall_arcana_sm_a": "Modell og pidestall",
  "crownfall_arcana_sm_a_long": "Dragonus har fått en helt ny modell med et fullstendig gjenstandssett som passer til hans sanne lojalitet, samt en ny pidestall og alternativ stil som kan låses opp.",
  "crownfall_arcana_sm_b": "Egne animasjoner og effekter",
  "crownfall_arcana_sm_b_long": "Inneholder et fullstendig sett av nye animasjoner og omgivelseseffekter, samt tilpassede ikoner og effekter for Arcane Bolt, Concussive Shot, Ancient Seal og Mystic Flare.",
  "crownfall_arcana_sm_c": "Egne helteelementer",
  "crownfall_arcana_sm_c_long": "Kommer også med et nytt portrett, et minikartikon og portrett i toppfeltet, helt nye effekter for angrep, drap, dødsfall og berøvelser, samt gjenstandsikoner og effekter for Rod of Atos og Phylactery.",
  "crownfall_arcana_sm_d": "Arkanareplikker",
  "crownfall_arcana_sm_d_long": "Fri fra Imperias innflytelse har Dragonus helt nye replikker for å hjelpe med å lufte klagene sine.",
  "crownfall_arcana_sm_purchase": "Kjøp %1$s",
  "crownfall_arcana_sm_purchase_note": "Rabatt tilgjengelig ved å bruke kronfallmynter",
  "crownfall_arcana_sm_alternate_header": "Lås opp en ny stil",
  "crownfall_arcana_sm_alternate_title": "Alternativ stil",
  "crownfall_arcana_sm_alternate_desc": "Fullfør hovedoppdraget i 4. akt for å låse opp den alternative stilen for arkanaen til Skywrath Mage.",
  "crownfall_arcana_vs_hero": "The Resurrection of Shen",
  "crownfall_arcana_vs_a": "Modell og pidestall",
  "crownfall_arcana_vs_a_long": "Skjendel har fått vingene sine tilbake, og en helt ny modell med et fullstendig gjenstandssett verdig en kongelig fra Skyvilden, samt en ny pidestall og to alternative stiler som kan låses opp.",
  "crownfall_arcana_vs_b": "Egne animasjoner og effekter",
  "crownfall_arcana_vs_b_long": "Inneholder et fullstendig sett med helt nye animasjoner og omgivelseseffekter, samt tilpassede ikoner og effekter for Magic Missile, Wave of Terror, Nether Swap, og en tilpasset effekt for illusjonen fra Vengeance Aura.",
  "crownfall_arcana_vs_c": "Egne helteelementer",
  "crownfall_arcana_vs_c_long": "Kommer også med et nytt portrett, et minikartikon og portrett i toppfeltet, helt nye effekter for angrep, drap, dødsfall og berøvelser, samt gjenstandsikoner og effekter for Force Staff, og et tilpasset ikon for Aghanim's Scepter.",
  "crownfall_arcana_vs_d": "Arkanareplikker",
  "crownfall_arcana_vs_d_long": "Med vingene tilbake og øynene rettet mot sin rettmessige trone har Skjendel nå helt nye replikker som gjenspeiler den verdslige formen hennes.",
  "crownfall_arcana_vs_purchase": "Kjøp %1$s",
  "crownfall_arcana_vs_purchase_note": "Rabatt tilgjengelig ved å bruke kronfallmynter",
  "crownfall_arcana_vs_alternate_header": "Lås opp en ny stil",
  "crownfall_arcana_vs_alternate_title": "Alternative stiler",
  "crownfall_arcana_vs_alternate_desc": "Fullfør hovedoppdraget i 4. akt for å låse opp den første alternative stilen. Fullfør alle hovedoppdrag og alle sideoppdrag i Kronfallet for å låse opp den andre alternative stilen.",
  "crownfall_treasures_title": "Skatter",
  "crownfall_treasures_description": "Helt nye gjenstandssett til noen av yndlingsheltene dine, slik som sjeldne sett til Wraith King, Crystal Maiden, Hoodwink og flere. Settene til Meepo og Drow Ranger kommer med egne hån.",
  "crownfall_treasure_item_0_name": "Phalanx of the Bronze Eagle",
  "crownfall_treasure_item_0_hero": "Skatt I – vanlig",
  "crownfall_treasure_item_1_name": "Ravencloak",
  "crownfall_treasure_item_1_hero": "Skatt II – veldig sjelden",
  "crownfall_treasure_item_1_sub": "Inkluderer egen hån",
  "crownfall_treasure_item_2_name": "Blood Raven",
  "crownfall_treasure_item_2_hero": "Skatt I – vanlig",
  "crownfall_treasure_item_3_name": "Thunderbird",
  "crownfall_treasure_item_3_hero": "Skatt II – sjelden",
  "crownfall_treasure_item_4_name": "Mocking Bird",
  "crownfall_treasure_item_4_hero": "Skatt I – veldig sjelden",
  "crownfall_treasure_item_4_sub": "Inkluderer egen hån",
  "crownfall_treasure_item_5_name": "Whispering Wings",
  "crownfall_treasure_item_5_hero": "Skatt I – sjelden",
  "crownfall_treasure_item_6_name": "Owly Bear",
  "crownfall_treasure_item_6_hero": "Skatt II – ultrasjelden",
  "crownfall_treasure_item_7_name": "Crown of the Condor",
  "crownfall_treasure_item_7_hero": "Skatt I – sjelden",
  "crownfall_treasure_item_8_name": "Verdant Swarm",
  "crownfall_treasure_item_8_hero": "Skatt I – vanlig",
  "crownfall_treasure_item_9_name": "Birdfeed Bandit",
  "crownfall_treasure_item_9_hero": "Skatt II – sjelden",
  "crownfall_treasure_item_10_name": "Lionheart",
  "crownfall_treasure_item_10_hero": "Skatt II – vanlig",
  "crownfall_treasure_item_11_name": "Servant of Scree'Auk Baby Roshan",
  "crownfall_treasure_item_11_hero": "Skatt I/II – kosmisk sjelden",
  "crownfall_treasure_purchase_1": "Skatt I – %1$s",
  "crownfall_treasure_purchase_2": "Skatt II – %1$s",
  "crownfall_footer_act_1": "Akt[br][b]I[/b]",
  "crownfall_footer_act_2": "Akt[br][b]II[/b]",
  "crownfall_footer_act_3": "Akt[br][b]III[/b]",
  "crownfall_footer_act_4": "Akt[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "[b]Midportens[/b][br]marked",
  "crownfall_footer_act_2_name": "[b]Druuds[/b][br]ødemark",
  "crownfall_footer_act_3_name": "[b]Isbrakks[/b][br]kulde",
  "crownfall_footer_act_4_name": "[b]Skyvildens[/b][br]topper",
  "crownfall_footer_act_play": "Spill nå",
  "crownfall_footer_act_unlocks_mid_may": "Midten av mai",
  "crownfall_footer_act_locked": "Låst"
}