// 9105.js

{
  "language": "danish",
  "crownfallcomic_title_cover": "Kroningsdag – forside",
  "crownfallcomic_title": "Kroningsdag – side %1$s",
  "crownfallcomic_help_text": "Klik på billedet eller brug mellemrumstasten for at gå videre",
  "crownfallcomic_return_button": "Gå tilbage til forsiden",
  "crownfall_title": "Crownfall",
  "crownfall_welcome": "Spil Dota for at låse op for eksotiske steder, nye karakterer og mørke hemmeligheder i en løbende historie med legendariske helte og unikke belønninger. Tilgængeligt nu for alle Dota-spillere helt gratis.",
  "crownfall_newstory_title": "Vind tronen tilbage",
  "crownfall_newstory_description": "Shendelzare, Skywraths retmæssige dronning, er blevet brutalt afsat af sin søster, Imperia. Som medlem af Imperias elitemagikergarde var Dragonus' liv og kræfter indtil for nylig i hendes vold. Men med hjælp fra gudinden Scree'Auk har de nu begge fået nye kræfter og en sidste chance for at få hævn... og tronen.",
  "crownfall_comic_title": "Få hele baggrundshistorien",
  "crownfall_comic_description": "Dronning Imperia har gjort det forbudt at tilbede Scree'Auk. Den afsatte gudinde er blevet drevet i skjul i Midports slum og udtænker en desperat plan for at genvinde kontrollen over Skywrath.",
  "crownfall_comic_button": "Læs tegneserien",
  "crownfall_howtoplay_title": "Eventyret venter",
  "crownfall_howtoplay_description": "Led Shen og Dragonus gennem de travle gader i Skywrath i deres søgen efter at tage tronen tilbage! Mød en række nye karakterer og gamle favoritter, afslør mørke hemmeligheder, tag på vilde sideopgaver og på en fisketur i ny og næ. Få flere belønninger, jo længere du når på det detaljerede, interaktive verdenskort.",
  "crownfall_explainer_a_long": "[b]UDFORSK.[/b] Når du spiller Dota-kampe under Crownfall-begivenheden, optjener du poletter. Du får forskellige polettyper af at spille forskellige helte.",
  "crownfall_explainer_b_long": "[b]OPLÅS.[/b] Brug poletter til at låse op for stier på kortet og få fremskridt i historien og belønninger. Hold øje med særlige træf såsom Polethandleren og Slikvognen!",
  "crownfall_explainer_c_long": "[b]FÅ HÆVN.[/b] Saml skatte, slik, Crownfall-mønter m.m., mens du kæmper om at støde den onde Dronning Imperia fra tronen.",
  "crownfall_fouracts_title": "Historien udfolder sig",
  "crownfall_fouracts_description": "Midports marked er blot den første del af en løbende fortælling i fire dele, som udspiller sig de næste måneder. Du vil kunne spille gennem de nye dele, så snart de bliver tilgængelige, men du kan også spille gennem eventyret i dit eget tempo, da de nye dele ikke lukker for de forrige.[br][br]Det betyder, at du kan bruge så lang tid, du vil, på at udforske alle de mulige stier, udfordringer og hemmeligheder i del I. Selvom der er meget at opdage, er begivenheden kun lige begyndt. Crownfall udvides fortsat, efterhånden som historien udvikler sig i løbet af de kommende måneder, og hver nye del har sin helt egen historie, sine egne karakterer, et unikt spilkort og helt nye belønninger. Der er måske endda en overraskelse eller to undervejs.",
  "crownfall_rewards_title": "Belønninger",
  "crownfall_rewards_a": "Crownfall-mønter",
  "crownfall_rewards_a_long_new": "Optjen Crownfall-mønter ved at udforske forskellige stier på kortet. Saml 10 mønter og byt dem til en rabat på ca. %1$s på alt i Crownfall-butikken, som koster %1$s eller mere. (Den nøjagtige rabat varierer alt efter region og valuta).",
  "crownfall_rewards_b": "Skatte",
  "crownfall_rewards_b_long": "Del I har to forskellige skattekister med i alt 24 nye genstandssæt. Du vil kunne låse op for nogle af sættene bare ved at spille!",
  "crownfall_rewards_c": "Slikposer",
  "crownfall_rewards_c_long": "Find Sithil og Quirts slikvogn på hvert Crownfall-kort for at opgradere og bytte slik til heltesæt, kurérer, wards m.m. (Der er endda en sjælden chance for at få Arcana!)",
  "crownfall_rewards_andmanymore": "Og det er ikke det hele! Afslør helt nye indlæsningsskærme, udtryk dig med emotikoner, sprays og nye chathjulsreplikker, pynt dine helte med unikke genstandssæt, som du finder undervejs i historien, og meget mere. Der er en hel ny verden at udforske.",
  "crownfall_explorerpack_title": "Midports stifinderpakke",
  "crownfall_explorerpack_description": "Alle belønningerne i Crownfalls primære historie vil være tilgængelige for alle spillere gratis. Men for de erfarne eventyrere, som gerne vil dykke lidt længere ned i del I, byder Midports stifinderpakke på mere udforskning af kortet, flere historier og flere belønninger.",
  "crownfall_explorerpack_purchase_act1_a": "Del I",
  "crownfall_explorerpack_purchase_act1_b": "Eyrie",
  "crownfall_explorerpack_purchase_act1_c": "Midports stifinderpakke",
  "crownfall_explorerpack_purchase": "Køb %1$s",
  "crownfall_arcanas_title": "Arcana",
  "crownfall_arcanas_description": "Den døende gudinde Scree'Auk har givet sine sidste kræfter til Vengeful Spirit og Skywrath Mage, for en pris: De skal bruge hendes mørke magi til at vælte Skywraths forræderiske dronning.",
  "crownfall_arcana_sm_hero": "The Devotions of Dragonus",
  "crownfall_arcana_sm_a": "Model og piedestal",
  "crownfall_arcana_sm_a_long": "Dragonus har fået en ny model med et komplet genstandssæt, som sømmer sig for hans sande loyalitet, foruden en ny piedestal og en oplåselig alternativ stil.",
  "crownfall_arcana_sm_b": "Tilpassede animationer og effekter",
  "crownfall_arcana_sm_b_long": "Et komplet sæt af helt nye animationer og omgivende effekter, inklusive tilpassede ikoner og effekter til Arcane Bolt, Concussive Shot, Ancient Seal og Mystic Flare.",
  "crownfall_arcana_sm_c": "Tilpassede helteelementer",
  "crownfall_arcana_sm_c_long": "Indeholder et nyt portræt, ikon til minikortet og portræt i topbjælken, helt nye effekter til angreb, drab, dødsfald og nægtelser samt genstandsikoner og effekter til Rod of Atos og Phylactery.",
  "crownfall_arcana_sm_d": "Arcana-replikker",
  "crownfall_arcana_sm_d_long": "Fri fra Imperias indflydelse har Dragonus fået helt nye replikker, så han kan give udtryk for sine klager.",
  "crownfall_arcana_sm_purchase": "Køb %1$s",
  "crownfall_arcana_sm_purchase_note": "Rabat tilgængelig med Crownfall-mønter",
  "crownfall_arcana_sm_alternate_header": "Kan låses op",
  "crownfall_arcana_sm_alternate_title": "Alternativ stil",
  "crownfall_arcana_sm_alternate_desc": "Gennemfør hovedopgaven i del IV for at låse op for den alternative stil til Skywrath Mages Arcana.",
  "crownfall_arcana_vs_hero": "The Resurrection of Shen",
  "crownfall_arcana_vs_a": "Model og piedestal",
  "crownfall_arcana_vs_a_long": "Shendelzare har fået sine vinger tilbage og en ny model med et komplet genstandssæt, som er en kongelig fra Skywrath værdig, inklusive en ny piedestal og to oplåselige alternative stile.",
  "crownfall_arcana_vs_b": "Tilpassede animationer og effekter",
  "crownfall_arcana_vs_b_long": "Et komplet sæt af helt nye animationer og omgivende effekter, inklusive tilpassede ikoner og effekter til Magic Missile, Wave of Terror, Nether Swap og en tilpasset effekt til Vengeful Illusion.",
  "crownfall_arcana_vs_c": "Tilpassede helteelementer",
  "crownfall_arcana_vs_c_long": "Indeholder et nyt portræt, ikon til minikortet og portræt i topbjælken, helt nye effekter til angreb, drab, dødsfald og nægtelser samt et genstandsikon og effekter til Force Staff og et tilpasset ikon til Aghanim's Scepter.",
  "crownfall_arcana_vs_d": "Arcana-replikker",
  "crownfall_arcana_vs_d_long": "Med vinger igen og øjnene rettet mod sin retmæssige trone har Shendelzare fået helt nye replikker, som afspejler hendes legemlige form.",
  "crownfall_arcana_vs_purchase": "Køb %1$s",
  "crownfall_arcana_vs_purchase_note": "Rabat tilgængelig med Crownfall-mønter",
  "crownfall_arcana_vs_alternate_header": "Kan låses op",
  "crownfall_arcana_vs_alternate_title": "Alternative stile",
  "crownfall_arcana_vs_alternate_desc": "Gennemfør hovedopgaven i del IV for at låse op for den første alternative stil. Gennemfør alle hovedopgaverne og alle sideopgaverne i Crownfall for at låse op for den anden alternative stil.",
  "crownfall_treasures_title": "Skatte",
  "crownfall_treasure_item_0_hero": "Skat I – Almindelig",
  "crownfall_treasure_item_1_name": "Ravencloak",
  "crownfall_treasure_item_1_hero": "Skat II – Meget sjælden",
  "crownfall_treasure_item_1_sub": "Indeholder tilpasset hån",
  "crownfall_treasure_item_2_name": "Blood Raven",
  "crownfall_treasure_item_2_hero": "Skat I – Almindelig",
  "crownfall_treasure_item_3_name": "Thunderbird",
  "crownfall_treasure_item_3_hero": "Skat II – Sjælden",
  "crownfall_treasure_item_4_name": "Mocking Bird",
  "crownfall_treasure_item_4_hero": "Skat I – Meget sjælden",
  "crownfall_treasure_item_4_sub": "Indeholder tilpasset hån",
  "crownfall_treasure_item_5_name": "Whispering Wings",
  "crownfall_treasure_item_5_hero": "Skat I – Sjælden",
  "crownfall_treasure_item_6_name": "Owly Bear",
  "crownfall_treasure_item_6_hero": "Skat II – Ultrasjælden",
  "crownfall_treasure_item_7_name": "Crown of the Condor",
  "crownfall_treasure_item_7_hero": "Skat I – Sjælden",
  "crownfall_treasure_item_8_name": "Verdant Swarm",
  "crownfall_treasure_item_8_hero": "Skat I – Almindelig",
  "crownfall_treasure_item_9_name": "Birdfeed Bandit",
  "crownfall_treasure_item_9_hero": "Skat II – Sjælden",
  "crownfall_treasure_item_10_name": "Lionheart",
  "crownfall_treasure_item_10_hero": "Skat II – Almindelig",
  "crownfall_treasure_item_11_hero": "Skat I/II – Kosmisk sjælden",
  "crownfall_treasure_purchase_1": "Skat I – %1$s",
  "crownfall_treasure_purchase_2": "Skat II – %1$s",
  "crownfall_footer_act_1": "Del[br][b]I[/b]",
  "crownfall_footer_act_2": "Del[br][b]II[/b]",
  "crownfall_footer_act_3": "Del[br][b]III[/b]",
  "crownfall_footer_act_4": "Del[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "[b]Midports[/b][br]marked",
  "crownfall_footer_act_2_name": "[b]Druuds[/b][br]ødemark",
  "crownfall_footer_act_3_name": "[b]Icewracks[/b][br]kulde",
  "crownfall_footer_act_play": "Spil nu",
  "crownfall_footer_act_unlocks_mid_may": "Låses op midt i maj",
  "crownfall_footer_act_locked": "Låst"
}