// 4523.js

{
  "language": "brazilian",
  "crownfallcomic_title_cover": "Dia da Ascensão — Capa",
  "crownfallcomic_title": "Dia da Ascensão — Página %1$s",
  "crownfallcomic_help_text": "Clique na imagem ou use a barra de espaço para avançar",
  "crownfallcomic_return_button": "Retornar à capa",
  "crownfallcomic_act1_intro_title_cover": "Dia da Ascensão — Capa",
  "crownfallcomic_act1_intro_title": "Dia da Ascensão — Página %1$s",
  "crownfallcomic_act2_intro_title_cover": "A Batalha da Bacia do Inferno — Capa",
  "crownfallcomic_act2_intro_title": "A Batalha da Bacia do Inferno — Página %1$s",
  "crownfallcomic_act3_intro_title_cover": "O Dragão — Capa",
  "crownfallcomic_act3_intro_title": "O Dragão — Página %1$s",
  "crownfall_title": "Queda Coronal",
  "crownfall_welcome": "Jogue Dota para destravar locais deslumbrantes, novos personagens e segredos sombrios em um evento com uma história contínua repleta de heróis lendários e recompensas exclusivas. Já disponível gratuitamente para todos os jogadores de Dota.",
  "crownfall_newstory_title": "Reivindique o trono",
  "crownfall_newstory_description": "Shendelzare, a rainha legítima de Celestifúria, foi brutalmente deposta pela sua irmã, Imperia. Como membro da guarda de elite da coroa, os poderes e a vida de Dragonus estavam a mercê da monarca. Agora, com a ajuda da deusa Scree'Auk, ambos receberam novos poderes, bem como uma última chance de obter vingança... e o trono.",
  "crownfall_comic_title": "Como chegamos aqui?",
  "crownfall_comic_description": "A Rainha Imperia baniu o culto a Scree'Auk. Levada a se esconder na periferia do Tronco Velho, a deusa deposta trama um plano desesperado para retomar o controle de Celestifúria.",
  "crownfall_comic_button": "Leia a HQ",
  "crownfall_howtoplay_title": "A aventura espera por você",
  "crownfall_howtoplay_description": "Guie Shen e Dragonus pelas ruas movimentadas do Tronco Velho em uma missão para retomar o trono! Interaja com um grupo de novos personagens e velhos conhecidos, descubra segredos sombrios, conclua missões secundárias chocantes e relaxe pescando um pouco. Ganhe mais recompensas ao se aprofundar em um detalhado mapa interativo.",
  "crownfall_explainer_a_long": "[b]EXPLORE.[/b] Jogar partidas de Dota durante o evento da Queda Coronal concederá fichas. Jogar com heróis diferentes concederá tipos diferentes de fichas.",
  "crownfall_explainer_b_long": "[b]DESTRAVE.[/b] Use fichas para destravar caminhos ao redor do mapa geral, progredindo pela história e ganhando recompensas. Há encontros especiais, como o Negociante de Fichas e a Caravana do Empório!",
  "crownfall_explainer_c_long": "[b]VINGUE.[/b] Colete tesouros, doces, moedas da Queda Coronal e mais enquanto batalha para destronar a maligna Rainha Imperia.",
  "crownfall_fouracts_title": "O desenrolar da história",
  "crownfall_fouracts_description": "O Mercado do Tronco Velho é apenas o primeiro ato de uma narrativa em quatro partes, que se estenderá pelos próximos meses. Você poderá acompanhar os novos atos assim que forem disponibilizados, mas também pode seguir a aventura no seu próprio ritmo — a chegada de um novo ato não encerrará os anteriores.[br][br]Portanto, tome o tempo que quiser para explorar cada caminho, desafio e segredos do 1º Ato. E mesmo com tanta coisa para explorar, o evento está apenas começando. A Queda Coronal continuará se expandindo durante os próximos meses, com cada novo ato trazendo a sua própria história, personagens e um novo mapa de aventura com recompensas inéditas. Pode até haver uma surpresa ou outra pelo caminho.",
  "crownfall_rewards_title": "Recompensas",
  "crownfall_rewards_a": "Moedas da Queda Coronal",
  "crownfall_rewards_a_long_new": "Ganhe Moedas da Queda Coronal ao explorar diferentes caminhos do mapa. Colete 10 moedas para trocá-las na loja do evento por um desconto de aproximadamente %1$s em qualquer item a partir de %1$s (o desconto exato varia entre regiões e moedas).",
  "crownfall_rewards_b": "Tesouros",
  "crownfall_rewards_b_long": "O 1º Ato apresenta dois tesouros diferentes, totalizando 24 novos conjuntos de itens. Você poderá destravar alguns deles jogando!",
  "crownfall_rewards_c": "Sacos de doces",
  "crownfall_rewards_c_long": "Em cada mapa da Queda Coronal, encontre a Caravana do Empório, de Sithil e Quirt, para aprimorá-la e trocar os seus doces por conjuntos, entregadores, sentinelas e mais. (Há até uma chance rara de encontrar Arcanos!)",
  "crownfall_rewards_andmanymore": "E isso não é tudo! Encontre novas telas de carregamento, expresse-se com novos emoticons, pinturas e mensagens sonoras, vista os seus heróis com conjuntos exclusivos encontrados ao longo do caminho, e muito mais — há um mundo inteiro aguardando para ser explorado.",
  "crownfall_explorerpack_title": "Pacote de Exploração do Tronco Velho",
  "crownfall_explorerpack_description": "Todas as recompensas da história principal da Queda Coronal estarão disponíveis gratuitamente para todos os jogadores. Mas, para aventureiros experientes que desejarem se aprofundar ainda mais no 1º Ato, o Pacote de Exploração do Tronco Velho oferece novos caminhos, mais histórias e mais recompensas.",
  "crownfall_explorerpack_description_long": "A compra do pacote destrava missões secundárias e recompensas especiais no mapa. Além das recompensas disponíveis no caminho gratuito, o Pacote de Exploração também concede tesouros adicionais, criaturas de trilha da Queda Coronal, um Imortal, estilos alternativos, mais moedas para obter descontos na loja do evento, e mais.",
  "crownfall_explorerpack_purchase_act1_a": "1º Ato",
  "crownfall_explorerpack_purchase_act1_b": "O Ninho",
  "crownfall_explorerpack_purchase_act1_c": "Pacote de Exploração do Tronco Velho",
  "crownfall_explorerpack_purchase": "Comprar por %1$s",
  "crownfall_arcanas_title": "Arcanos",
  "crownfall_arcanas_description": "A deusa moribunda Scree'Auk concedeu o resto do seu poder para a Vengeful Spirit e o Skywrath Mage, com uma condição: eles precisam usar a sua magia sombria para derrubar a rainha traiçoeira de Celestifúria.",
  "crownfall_arcana_sm_hero": "Devoções de Dragonus",
  "crownfall_arcana_sm_a": "Modelo e pedestal",
  "crownfall_arcana_sm_a_long": "Dragonus recebeu um novo modelo, com um conjunto de itens condizente com a sua verdadeira lealdade, bem como um novo pedestal e um estilo alternativo destravável.",
  "crownfall_arcana_sm_b": "Animações e efeitos personalizados",
  "crownfall_arcana_sm_b_long": "Apresenta um conjunto completo de novas animações e efeitos ambientes, incluindo ícones e efeitos personalizados para Energia Arcana, Disparo Contusivo, Selo Ancestral e Relâmpagos Místicos.",
  "crownfall_arcana_sm_c": "Personalizações do herói",
  "crownfall_arcana_sm_c_long": "Inclui um novo retrato, ícone do minimapa e retrato da barra superior, novos efeitos para ataques, vítimas, mortes e negações, além de ícones e efeitos personalizados para os itens Bastão de Atos e Filactério.",
  "crownfall_arcana_sm_d": "Falas do Arcano",
  "crownfall_arcana_sm_d_long": "Livre da influência de Imperia, Dragonus tem uma nova voz para ajudar a transmitir as suas reivindicações.",
  "crownfall_arcana_sm_purchase": "Comprar por %1$s",
  "crownfall_arcana_sm_purchase_note": "Desconto disponível usando moedas da Queda Coronal",
  "crownfall_arcana_sm_alternate_header": "Destravável",
  "crownfall_arcana_sm_alternate_title": "Estilo alternativo",
  "crownfall_arcana_sm_alternate_desc": "Conclua a missão principal do 4º Ato para destravar o estilo alternativo do Arcano do Skywrath Mage.",
  "crownfall_arcana_vs_hero": "Ressurreição de Shen",
  "crownfall_arcana_vs_a": "Modelo e pedestal",
  "crownfall_arcana_vs_a_long": "Shendelzare obteve as suas asas de volta, conquistando um novo modelo e um conjunto de itens digno da realeza de Celestifúria, incluindo um novo pedestal e dois estilos alternativos destraváveis.",
  "crownfall_arcana_vs_b": "Animações e efeitos personalizados",
  "crownfall_arcana_vs_b_long": "Apresenta um conjunto completo de novas animações e efeitos ambientes, incluindo ícones e efeitos personalizados para Míssil Mágico, Onda Aterrorizante, Troca das Profundezas e um efeito personalizado para a Ilusão Vingativa.",
  "crownfall_arcana_vs_c": "Personalizações do herói",
  "crownfall_arcana_vs_c_long": "Inclui um novo retrato, ícone do minimapa e retrato da barra superior, novos efeitos para ataques, vítimas, mortes e negações, além de ícones e efeitos personalizados para o Cajado de Força, e um ícone personalizado para o Cetro de Aghanim.",
  "crownfall_arcana_vs_d": "Falas do Arcano",
  "crownfall_arcana_vs_d_long": "Com as asas restauradas e de olho no seu trono de direito, Shendelzare tem uma nova dublagem para refletir a sua forma corpórea.",
  "crownfall_arcana_vs_purchase": "Comprar por %1$s",
  "crownfall_arcana_vs_purchase_note": "Desconto disponível usando moedas da Queda Coronal",
  "crownfall_arcana_vs_alternate_header": "Destravável",
  "crownfall_arcana_vs_alternate_title": "Estilos alternativos",
  "crownfall_arcana_vs_alternate_desc": "Conclua a missão principal do 4º Ato para destravar o primeiro estilo alternativo. Conclua todas as missões principais e secundárias da Queda Coronal para destravar o segundo estilo alternativo.",
  "crownfall_treasures_title": "Tesouros",
  "crownfall_treasures_description": "Novos conjuntos para os seus heróis favoritos, incluindo conjuntos raros para o Wraith King, Crystal Maiden, Hoodwink e mais. Os conjuntos do Meepo e da Drow Ranger vêm com novas provocações.",
  "crownfall_treasure_item_0_name": "Falange da Águia Bronzeada",
  "crownfall_treasure_item_0_hero": "Tesouro I — Comum",
  "crownfall_treasure_item_1_name": "Corvinária",
  "crownfall_treasure_item_1_hero": "Tesouro II — Muito Raro",
  "crownfall_treasure_item_1_sub": "Inclui provocação personalizada",
  "crownfall_treasure_item_2_name": "Corvo Sanguíneo",
  "crownfall_treasure_item_2_hero": "Tesouro I — Comum",
  "crownfall_treasure_item_3_name": "Pássaro-Trovão",
  "crownfall_treasure_item_3_hero": "Tesouro II — Raro",
  "crownfall_treasure_item_4_name": "Galinheepo",
  "crownfall_treasure_item_4_hero": "Tesouro I — Muito Raro",
  "crownfall_treasure_item_4_sub": "Inclui provocação personalizada",
  "crownfall_treasure_item_5_name": "Asas Sussurrantes",
  "crownfall_treasure_item_5_hero": "Tesouro I — Raro",
  "crownfall_treasure_item_6_name": "Corursa",
  "crownfall_treasure_item_6_hero": "Tesouro II — Ultrarraro",
  "crownfall_treasure_item_7_name": "Coroa do Condor",
  "crownfall_treasure_item_7_hero": "Tesouro I — Raro",
  "crownfall_treasure_item_8_name": "Enxame Verdejante",
  "crownfall_treasure_item_8_hero": "Tesouro I — Comum",
  "crownfall_treasure_item_9_name": "Bandoleira Aviária",
  "crownfall_treasure_item_9_hero": "Tesouro II — Raro",
  "crownfall_treasure_item_10_name": "Coração de Leão",
  "crownfall_treasure_item_10_hero": "Tesouro II — Comum",
  "crownfall_treasure_item_11_name": "Bebê Roshan Servo de Scree'Auk",
  "crownfall_treasure_item_11_hero": "Tesouros I e II — Cosmicamente Raro",
  "crownfall_treasure_purchase_1": "Tesouro I — %1$s",
  "crownfall_treasure_purchase_2": "Tesouro II — %1$s",
  "crownfall_footer_act_1": "[b]1º[/b][br]Ato",
  "crownfall_footer_act_2": "[b]2º[/b][br]Ato",
  "crownfall_footer_act_3": "[b]3º[/b][br]Ato",
  "crownfall_footer_act_4": "[b]4º[/b][br]Ato",
  "crownfall_footer_act_1_name": "O Mercado do[br][b]Tronco Velho[/b]",
  "crownfall_footer_act_2_name": "Os Desertos de[br][b]Druud[/b]",
  "crownfall_footer_act_3_name": "As Geadas das[br][b]Geleiras Devastadas[/b]",
  "crownfall_footer_act_4_name": "Os Pináculos de[br][b]Celestifúria[/b]",
  "crownfall_footer_act_play": "Jogue já",
  "crownfall_footer_act_unlocks_mid_may": "Meados de maio",
  "crownfall_footer_act_locked": "Travado"
}