// 3247.js

{
  "language": "polish",
  "crownfallcomic_title_cover": "Dzień Wstąpienia – okładka",
  "crownfallcomic_title": "Dzień Wstąpienia – strona nr %1$s",
  "crownfallcomic_help_text": "Kliknij obraz albo użyj spacji, aby przejść dalej.",
  "crownfallcomic_return_button": "Wróć na stronę okładki",
  "crownfall_title": "Utracona Korona",
  "crownfall_welcome": "Rozgrywaj mecze w Dota 2, by odblokować egzotyczne miejsca, nowe postacie i ujawnić mroczne sekrety w tym ciągle rozwijanym wydarzeniu fabularnym, podczas którego napotkasz legendarnych bohaterów i zdobędziesz unikalne nagrody. Dostępne już teraz dla wszystkich graczy za darmo.",
  "crownfall_newstory_title": "Odzyskaj tron",
  "crownfall_newstory_description": "Shendelzare, prawowita królowa Niebogniewia, została brutalnie obalona przez swoją siostrę, Imperię. Moce i życie Dragonusa, będącego członkiem elitarnej straży Imperii, były skazane na łaskę okrutnej siostry. Teraz, z pomocą boginii Scree'Auk, Dragonus i Shen otrzymali nowe moce oraz ostatnią szansę na zemszczenie się... i zdobycie tronu.",
  "crownfall_comic_title": "Zapoznaj się z historią",
  "crownfall_comic_description": "Królowa Imperia zakazała oddawanie czci Scree'Auk. Odrzucona bogini, zmuszona do ukrywania się w dzielnicach nędzy Śródbramia, knuje teraz desperacki spisek, by przejąć kontrolę nad Niebogniewiem.",
  "crownfall_comic_button": "Przeczytaj komiks",
  "crownfall_howtoplay_title": "Przygoda czeka",
  "crownfall_howtoplay_description": "Prowadź Shen i Dragonusa przez ruchliwe ulice Niebogniewia w ich zadaniu odzyskania tronu! Rozmawiaj z mnóstwem nowych postaci i starych ulubieńców, odkryj mroczne sekrety, wykonaj ekstrawaganckie zadania poboczne i od czasu do czasu wybądź na ryby. Zdobądź tym więcej nagród, im dalej zajdziesz na interaktywnej i bogatej w szczegóły mapie świata.",
  "crownfall_explainer_a_long": "[b]ODKRYWAJ.[/b] Rozgrywanie meczów w Dota 2 podczas wydarzenia Utracona Korona nagrodzi cię żetonami. Za grę różnymi bohaterami otrzymasz różne rodzaje żetonów.",
  "crownfall_explainer_b_long": "[b]ODBLOKUJ.[/b] Używaj żetonów do odblokowania ścieżek biegnących przez mapę świata gry, pchając fabułę do przodu i zdobywając nagrody. Wypatruj specjalnych zdarzeń takich jak spotkanie z handlarzem żetonów lub natrafienie na karawanę Cukierkowni!",
  "crownfall_explainer_c_long": "[b]POMŚCIJ.[/b] Zbieraj skarby, cukierki, monety Utraconej Korony i wiele innych podczas swojej bitwy o zdetronizowanie złej królowej Imperii.",
  "crownfall_fouracts_title": "Historia się toczy",
  "crownfall_fouracts_description": "Targowiska Śródbramia to jedynie pierwszy z czterech aktów opowieści, która rozciągnie się na kolejne kilka miesięcy. Przechodzenie kolejnych aktów będzie możliwe od razu po ich udostępnieniu, ale wszystkim będzie dane przeżyć tę przygodę w swoim własnym tempie – wprowadzenie kolejnego aktu nie zamknie poprzedniego.[br][br]Oznacza to, że masz tyle czasu, ile chcesz, by odkryć każdą możliwą ścieżkę, wyzwanie i sekret w akcie I. Jest w nim sporo do znalezienia, ale Utracona Korona tak naprawdę dopiero się rozkręca. Wydarzenie będzie stawało się coraz większe wraz z rozwojem fabuły w nadchodzących miesiącach za sprawą nowych aktów, a każdy z nich niesie ze sobą swoją własną historię, postacie, unikalną mapę świata gry oraz całkowicie nowe nagrody. Być może po drodze pojawią się też jakieś niespodzianki.",
  "crownfall_rewards_title": "Nagrody",
  "crownfall_rewards_a": "Żetony Utraconej Korony",
  "crownfall_rewards_a_long_new": "Zdobywaj żetony Utraconej Korony poprzez odkrywanie różnych ścieżek na mapie. Zbierz 10 żetonów, by wymienić je w sklepie Utraconej Korony na zniżkę ok. %1$s na dowolny przedmiot kosztujący %1$s lub więcej (dokładna zniżka różni się w zależności od regionu i waluty).",
  "crownfall_rewards_b": "Skarby",
  "crownfall_rewards_b_long": "Akt I zawiera dwie różne skrzynie ze skarbami mające razem 24 nowe zestawy przedmiotów. Niektóre z nich można odblokować, po prostu grając!",
  "crownfall_rewards_c": "Worki z cukierkami",
  "crownfall_rewards_c_long": "Znajdź karawanę Cukierkowni Sithila i Quirta na każdej mapie Utraconej Korony, by ją ulepszyć oraz wymienić swoje cukierki na zestawy dla bohaterów, kurierów, stróżów i wiele innych. Masz nawet szansę na rzadkie arkana!",
  "crownfall_rewards_andmanymore": "I to nie wszystko! Odkryj całkowicie nowe ekrany ładowania, wyraź siebie emotikonami, sprayami i nowymi kwestiami koła czatu, wyposaż swoje postacie w unikalne zestawy przedmiotów zdobyte na ścieżce fabularnej oraz wiele innych – cały świat czeka na to, by go przemierzyć.",
  "crownfall_explorerpack_title": "Pakiet Zwiadowcy Śródbramia",
  "crownfall_explorerpack_description": "Wszystkie nagrody na ścieżce głównej historii Utraconej Korony będą dostępne dla wszystkich graczy za darmo. Jednak zaprawionym awanturnikom, którzy chcieliby zajść nieco dalej w akcie I, Pakiet Zwiadowcy Śródbramia oferuje więcej opcji odkrywania mapy, więcej opowieści i więcej nagród.",
  "crownfall_explorerpack_description_long": "Zakupienie pakietu odblokuje misje poboczne oraz specjalne nagrody na mapie. Dzięki Pakietowi Zwiadowcy gracze otrzymają nie tylko nagrody z darmowej ścieżki, ale również dodatkowe skarby, stwory Utraconej Korony, przedmioty wiekopomne i za ukończenie aktu, dodatkowe żetony Utraconej Korony, dzięki którym można zaoszczędzić na przedmiotach w sklepie gry oraz wiele innych.",
  "crownfall_explorerpack_purchase_act1_a": "Akt I",
  "crownfall_explorerpack_purchase_act1_b": "Gniazdo",
  "crownfall_explorerpack_purchase_act1_c": "Pakiet Zwiadowcy Śródbramia",
  "crownfall_explorerpack_purchase": "Kup za %1$s",
  "crownfall_arcanas_title": "Arkana",
  "crownfall_arcanas_description": "Umierająca bogini Scree'Auk obdarzyła Mściwą Duszę i Maga Niebogniewnych ostatkiem swoich mocy, lecz nie za darmo: muszą oni użyć jej mrocznej magii, by dokonać przewrotu w królestwie Niebogniewia.",
  "crownfall_arcana_sm_hero": "Poświęcenie Dragonusa",
  "crownfall_arcana_sm_a": "Model i piedestał",
  "crownfall_arcana_sm_a_long": "Dragonus otrzymał całkowicie nowy model wraz z zestawem przedmiotów właściwym jego prawdziwej lojalności oraz nowy piedestał i alternatywny styl do odblokowania.",
  "crownfall_arcana_sm_b": "Niestandardowe animacje i efekty",
  "crownfall_arcana_sm_b_long": "Pełny zestaw całkowicie nowych animacji i efektów otoczenia, w tym niestandardowe ikony i efekty dla umiejętności Arcane Bolt, Concussive Shot, Ancient Seal i Mystic Flare.",
  "crownfall_arcana_sm_c": "Niestandardowe zasoby bohatera",
  "crownfall_arcana_sm_c_long": "Zawiera nowy portret, ikonę minimapy i portret w pasku na górze, całkowicie nowe efekty dla ataków, zabójstw, śmierci i dobić, a także ikony przedmiotów i efektów dla Rod of Atos i Phylactery.",
  "crownfall_arcana_sm_d": "Kwestie dialogowe arkanów",
  "crownfall_arcana_sm_d_long": "Wolny od wpływów Imperii Dragonus ma całkowicie nowe kwestie dialogowe, które pomagają mu wyrazić swój żal.",
  "crownfall_arcana_sm_purchase": "Kup za %1$s",
  "crownfall_arcana_sm_purchase_note": "Zniżka dostępna po użyciu żetonów Utraconej Korony",
  "crownfall_arcana_sm_alternate_header": "Do odblokowania",
  "crownfall_arcana_sm_alternate_title": "Alternatywny styl",
  "crownfall_arcana_sm_alternate_desc": "Ukończ główne zadanie w akcie IV, by odblokować alternatywny styl arkanów dla Skywrath Mage'a.",
  "crownfall_arcana_vs_hero": "Wskrzeszenie Shen",
  "crownfall_arcana_vs_a": "Model i piedestał",
  "crownfall_arcana_vs_a_long": "Shendelzare odzyskała swe skrzydła, dając jej całkowicie nowy model z pełnym zestawem przedmiotów godnych niebogniewnej członkini rodziny królewskiej, w tym nowy piedestał i dwa alternatywne style do odblokowania.",
  "crownfall_arcana_vs_b": "Niestandardowe animacje i efekty",
  "crownfall_arcana_vs_b_long": "Pełny zestaw całkowicie nowych animacji i efektów otoczenia, w tym niestandardowe ikony i efekty dla umiejętności Magic Missile, Wave of Terror, Nether Swap oraz niestandardowy efekt dla umiejętności Vengeance Aura.",
  "crownfall_arcana_vs_c": "Niestandardowe zasoby bohaterki",
  "crownfall_arcana_vs_c_long": "Zawiera nowy portret, ikonę minimapy i portretu w pasku na górze, całkowicie nowe efekty dla ataków, zabójstw, śmierci i dobić, a także ikonę przedmiotu i efekty dla Force Staff oraz niestandardową ikonę dla Aghanim's Scepter.",
  "crownfall_arcana_vs_d": "Kwestie dialogowe arkanów",
  "crownfall_arcana_vs_d_long": "Shendelzare, z przywróconymi skrzydłami i wzrokiem skierowanym na swój prawowity tron, ma całkowicie nowe kwestie dialogowe, które odzwierciedlają jej cielesną formę.",
  "crownfall_arcana_vs_purchase": "Kup za %1$s",
  "crownfall_arcana_vs_purchase_note": "Zniżka dostępna po użyciu żetonów Utraconej Korony",
  "crownfall_arcana_vs_alternate_header": "Do odblokowania",
  "crownfall_arcana_vs_alternate_title": "Alternatywne style",
  "crownfall_arcana_vs_alternate_desc": "Ukończ główne zadanie w akcie IV, by odblokować pierwszy alternatywny styl. Ukończ wszystkie główne i poboczne zadania podczas wydarzenia, by odblokować drugi alternatywny styl.",
  "crownfall_treasures_title": "Skarby",
  "crownfall_treasures_description": "Całkowicie nowe zestawy przedmiotów dla twoich ulubionych bohaterów, w tym rzadkie zestawy dla Wraith Kinga, Crystal Maiden, Hoodwink i więcej. Do zestawów dla Meepo i Drow Ranger dołączono niestandardowe drwiny.",
  "crownfall_treasure_item_0_name": "Falanga Brązowego Orła",
  "crownfall_treasure_item_0_hero": "Skarb I – pospolity",
  "crownfall_treasure_item_1_name": "Kruczy Płaszcz",
  "crownfall_treasure_item_1_hero": "Skarb II – bardzo rzadki",
  "crownfall_treasure_item_1_sub": "Zawiera niestandardową drwinę.",
  "crownfall_treasure_item_2_name": "Krwawy Kruk",
  "crownfall_treasure_item_2_hero": "Skarb I – pospolity",
  "crownfall_treasure_item_3_name": "Ptak Gromu",
  "crownfall_treasure_item_3_hero": "Skarb II – rzadki",
  "crownfall_treasure_item_4_name": "Przedrzeźniacz",
  "crownfall_treasure_item_4_hero": "Skarb I – bardzo rzadki",
  "crownfall_treasure_item_4_sub": "Zawiera niestandardową drwinę.",
  "crownfall_treasure_item_5_name": "Szepczące Skrzydła",
  "crownfall_treasure_item_5_hero": "Skarb I – rzadki",
  "crownfall_treasure_item_6_name": "Sowi Niedźwiedź",
  "crownfall_treasure_item_6_hero": "Skarb II – ultrarzadki",
  "crownfall_treasure_item_7_name": "Korona Kondora",
  "crownfall_treasure_item_7_hero": "Skarb I – rzadki",
  "crownfall_treasure_item_8_name": "Zielona Chmara",
  "crownfall_treasure_item_8_hero": "Skarb I – pospolity",
  "crownfall_treasure_item_9_name": "Bandyta z Karmnika",
  "crownfall_treasure_item_9_hero": "Skarb II – rzadki",
  "crownfall_treasure_item_10_name": "Lwie Serce",
  "crownfall_treasure_item_10_hero": "Skarb II – pospolity",
  "crownfall_treasure_item_11_name": "Mały Roshan, Sługa Scree'Auk",
  "crownfall_treasure_item_11_hero": "Skarb I/II – kosmicznie rzadki",
  "crownfall_treasure_purchase_1": "Skarb I – %1$s",
  "crownfall_treasure_purchase_2": "Skarb II – %1$s",
  "crownfall_footer_act_1": "Akt[br][b]I[/b]",
  "crownfall_footer_act_2": "Akt[br][b]II[/b]",
  "crownfall_footer_act_3": "Akt[br][b]III[/b]",
  "crownfall_footer_act_4": "Akt[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "Targowiska[br][b]Śródbramia[/b]",
  "crownfall_footer_act_2_name": "Pustynie[br][b]Druud[/b]",
  "crownfall_footer_act_3_name": "Zmarzliny[br][b]Lodowej Ruiny[/b]",
  "crownfall_footer_act_4_name": "Iglice[br][b]Niebogniewia[/b]",
  "crownfall_footer_act_play": "Graj teraz",
  "crownfall_footer_act_unlocks_mid_may": "Premiera w połowie maja",
  "crownfall_footer_act_locked": "Zablokowane"
}