// 287.js

{
  "language": "french",
  "crownfallcomic_title_cover": "Jour de l'ascension − Couverture",
  "crownfallcomic_title": "Jour de l'ascension − Page %1$s",
  "crownfallcomic_help_text": "Cliquez sur l'image ou la barre d'espace pour avancer",
  "crownfallcomic_return_button": "Revenir à la page de couverture",
  "crownfallcomic_act1_intro_title_cover": "Jour de l'ascension − Couverture",
  "crownfallcomic_act1_intro_title": "Jour de l'ascension − Page %1$s",
  "crownfallcomic_act2_intro_title_cover": "La Bataille du bassin Infernal − Couverture",
  "crownfallcomic_act2_intro_title": "La Bataille du bassin Infernal − Page %1$s",
  "crownfallcomic_act3_intro_title_cover": "Le Dragon − Couverture",
  "crownfallcomic_act3_intro_title": "Le Dragon − Page %1$s",
  "crownfallcomic_act4_intro_title_cover": "La Chute de la couronne − Couverture",
  "crownfallcomic_act4_intro_title": "La Chute de la couronne − Page %1$s",
  "crownfall_title": "La Chute de la couronne",
  "crownfall_welcome": "Jouez à Dota pour débloquer des endroits inédits et de nouveaux personnages. En plus, faites toute la lumière sur une histoire des plus palpitantes qui s'agrémente de héros et héroïnes légendaires et de récompenses uniques. Maintenant disponible gratuitement !",
  "crownfall_newstory_title": "Un trône à reconquérir",
  "crownfall_newstory_description": "Shendelzare, reine légitime de Skywrath, a été brutalement destituée par sa sœur, Imperia. Les pouvoirs et la vie de Dragonus, membre de la garde d'élite d'Imperia, sont à la merci de cette dernière. Avec l'aide de la déesse Scree'Auk, Shendelzare et Dragonus ont obtenu de nouveaux pouvoirs : c'est leur ultime chance de se venger… et de récupérer le trône.",
  "crownfall_comic_title": "Précédemment…",
  "crownfall_comic_description": "La reine Imperia a interdit le culte de Scree'Auk. Contrainte de se cacher dans les taudis de la Patte-d'Oie, la déesse déchue manigance un plan, son seul espoir de reprendre le contrôle de Skywrath.",
  "crownfall_comic_button": "Lire la BD",
  "crownfall_howtoplay_title": "Partez à l'aventure",
  "crownfall_howtoplay_description": "Guidez Shen et Dragonus à travers les rues animées de Skywrath dans leur quête pour reprendre le trône ! Rencontrez une multitude de personnages plus ou moins familiers, révélez leurs secrets les plus enfouis, participez à des quêtes secondaires extravagantes… et mettez même à l'épreuve vos talents de pêche ! Plus vous avancerez dans l'histoire et progresserez sur la carte interactive, plus vous gagnerez de récompenses.",
  "crownfall_explainer_a_long": "[b]EXPLOREZ.[/b] Participez à des parties de Dota pendant l'évènement de La Chute de la couronne pour gagner des jetons. Selon l'unité héroïque que vous incarnerez, vous obtiendrez différents types de jetons.",
  "crownfall_explainer_b_long": "[b]DÉVERROUILLEZ.[/b] Utilisez vos jetons pour débloquer des voies sur la carte et faire avancer l'histoire. Restez à l'affut de rencontres spéciales, comme le marchand de jetons et le magasin de bonbons !",
  "crownfall_explainer_c_long": "[b]VENGEZ-VOUS.[/b] Amassez trésors, bonbons, pièces de l'échoppe et plus encore lors de votre périple pour détrôner la machiavélique reine Imperia.",
  "crownfall_fouracts_title": "Ce n'est que le début",
  "crownfall_fouracts_description": "« Les Marchés de la Patte-d'Oie » ne constitue que le premier acte d'un récit en quatre actes qui seront dévoilés au cours des prochains mois. Vous pourrez accéder aux nouveaux actes dès qu'ils seront disponibles, mais vous pouvez également progresser à votre propre rythme : à l'arrivée d'un nouvel acte, les actes précédents resteront ouverts.[br][br]Vous avez tout le loisir de découvrir les moindres recoins, défis et secrets de l'acte I ! En termes de contenu, l'évènement de La Chute de la couronne n'en est qu'à ses débuts : au fil des mois à venir, nombre de surprises vous attendent, et chaque acte amènera avec lui sa propre histoire, ses personnages, une carte d'aventure unique et des récompenses exclusives.",
  "crownfall_rewards_title": "Récompenses",
  "crownfall_rewards_a": "Pièces de l'échoppe",
  "crownfall_rewards_a_long_new": "Obtenez des pièces de La Chute de la couronne en explorant les différentes voies sur la carte. Récupérez-en dix pour les échanger dans l'échoppe de La Chute de la couronne contre une remise d'environ %1$s sur tout item coutant au moins %1$s. (La réduction exacte varie selon les zones géographiques et les devises.)",
  "crownfall_rewards_b": "Trésors",
  "crownfall_rewards_b_long": "L'acte I inclut deux trésors, qui contiennent à eux deux 24 nouveaux ensembles d'items. Vous pourrez obtenir certains des ensembles simplement en jouant.",
  "crownfall_rewards_c": "Sacs de bonbons",
  "crownfall_rewards_c_long": "Allez à la rencontre de la caravane des douceurs de Sithil et Quirt sur chaque carte de La Chute de la couronne pour l'améliorer et échanger vos bonbons contre des ensembles héroïques, des coursiers, des Wards et bien plus (même des Arcanes si vous avez de la chance !).",
  "crownfall_rewards_andmanymore": "Et ce n'est pas tout : découvrez des écrans de chargement inédits, exprimez-vous à l'aide des nouveaux graffitis, émoticônes et répliques, personnalisez vos unités héroïques avec des ensembles d'items uniques trouvés lors de votre aventure, et bien plus encore ! Une myriade de récompenses vous attend dans ce nouveau monde.",
  "crownfall_explorerpack_title": "Pack d'expédition de la Patte-d'Oie",
  "crownfall_explorerpack_description": "Toutes les récompenses de l'histoire principale de La Chute de la couronne sont disponibles gratuitement. Mais si le cœur vous en dit, vous pouvez vous offrir le pack d'expédition de la Patte-d'Oie pour découvrir tous les secrets de l'acte I, et ainsi accéder à davantage d'exploration, d'histoires et de récompenses.",
  "crownfall_explorerpack_description_long": "L'achat du pack permet de débloquer des quêtes secondaires et des récompenses spéciales sur la carte. En plus des récompenses disponibles sur la voie classique de l'histoire principale, vous obtiendrez également des trésors supplémentaires, des items exclusifs de La Chute de la couronne (creeps et items immortels, entre autres), des jetons de l'échoppe de l'évènement pour obtenir des réductions sur des items du magasin, et bien plus encore.",
  "crownfall_explorerpack_purchase_act1_a": "Acte I",
  "crownfall_explorerpack_purchase_act1_b": "Le Pinacle",
  "crownfall_explorerpack_purchase_act1_c": "Pack d'expédition de la Patte-d'Oie",
  "crownfall_explorerpack_purchase": "Acheter %1$s",
  "crownfall_arcanas_title": "Arcanes",
  "crownfall_arcanas_description": "La déesse mourante Scree'Auk a accordé à Vengeful Spirit et Skywrath Mage ses derniers pouvoirs, à un prix : il leur faut utiliser sa magie noire pour renverser la reine perfide de Skywrath.",
  "crownfall_arcana_sm_hero": "Dévotions de Dragonus",
  "crownfall_arcana_sm_a": "Modèle et piédestal",
  "crownfall_arcana_sm_a_long": "Dragonus profite maintenant d'un tout nouveau modèle avec un ensemble d'items qui met au jour sa dévotion, ainsi qu'un nouveau piédestal et un style alternatif à débloquer.",
  "crownfall_arcana_sm_b": "Animations et effets personnalisés",
  "crownfall_arcana_sm_b_long": "Cette Arcane inclut un tout nouvel ensemble d'animations et d'effets d'ambiance ainsi que de nouveaux effets pour Arcane Bolt, Concussive Shot, Ancient Seal et Mystic Flare.",
  "crownfall_arcana_sm_c": "Éléments héroïques personnalisés",
  "crownfall_arcana_sm_c_long": "Comprend un nouveau portrait héroïque, un nouveau portrait dans la barre supérieure, une icône de minicarte, de tout nouveaux effets pour les attaques, les victimes, les morts et les sacrifices, ainsi que des icônes et des effets spéciaux pour Rod of Atos et Phylactery.",
  "crownfall_arcana_sm_d": "Répliques exclusives",
  "crownfall_arcana_sm_d_long": "Libéré de l'influence d'Imperia, Dragonus fait maintenant entendre ses doléances sur l'ensemble du champ de bataille.",
  "crownfall_arcana_sm_purchase": "Acheter (%1$s)",
  "crownfall_arcana_sm_purchase_note": "Remise disponible en utilisant les pièces de La Chute de la couronne",
  "crownfall_arcana_sm_alternate_header": "À débloquer",
  "crownfall_arcana_sm_alternate_title": "Style alternatif",
  "crownfall_arcana_sm_alternate_desc": "Terminez la quête principale de l'acte IV pour débloquer le style alternatif pour l'Arcane de Skywrath Mage.",
  "crownfall_arcana_vs_hero": "Résurrection de Shen",
  "crownfall_arcana_vs_a": "Modèle et piédestal",
  "crownfall_arcana_vs_a_long": "Shendelzare a repris possession de ses ailes et obtient un tout nouveau modèle avec un ensemble d'items digne de la royauté de Skywrath, ainsi qu'un nouveau piédestal et deux styles alternatifs à débloquer.",
  "crownfall_arcana_vs_b": "Animations et effets personnalisés",
  "crownfall_arcana_vs_b_long": "Cette Arcane inclut un tout nouvel ensemble d'animations et d'effets d'ambiance ainsi que de nouveaux effets pour Magic Missile, Wave of Terror, Nether Swap et l'illusion de Vengeance Aura.",
  "crownfall_arcana_vs_c": "Éléments héroïques personnalisés",
  "crownfall_arcana_vs_c_long": "Comprend un nouveau portrait héroïque, un nouveau portrait dans la barre supérieure, une icône de minicarte, de tout nouveaux effets pour les attaques, les victimes, les morts et les sacrifices, ainsi qu'une icône personnalisée pour l'Aghanim's Scepter.",
  "crownfall_arcana_vs_d": "Répliques exclusives",
  "crownfall_arcana_vs_d_long": "À nouveau pourvue de ses ailes et en quête du trône qui lui revient, Shendelzare a changé de voix pour s'adapter à sa nouvelle forme charnelle.",
  "crownfall_arcana_vs_purchase": "Acheter (%1$s)",
  "crownfall_arcana_vs_purchase_note": "Remise disponible en utilisant les pièces de La Chute de la couronne",
  "crownfall_arcana_vs_alternate_header": "À débloquer",
  "crownfall_arcana_vs_alternate_title": "Styles alternatifs",
  "crownfall_arcana_vs_alternate_desc": "Terminez la quête principale de l'acte IV pour débloquer le premier style alternatif. Terminez toutes les quêtes principales et secondaires de La Chute de la couronne pour débloquer le deuxième style alternatif.",
  "crownfall_treasures_title": "Trésors",
  "crownfall_treasures_description": "Découvrez de tout nouveaux ensembles d'items pour vos unités héroïques préférées, y compris des ensembles rares pour Wraith King, Crystal Maiden, Hoodwink et bien plus encore. Les ensembles de Meepo et Drow Ranger incluent en plus des railleries personnalisées.",
  "crownfall_treasure_item_0_name": "Phalange de l'aigle de bronze",
  "crownfall_treasure_item_0_hero": "Trésor I (commun)",
  "crownfall_treasure_item_1_name": "Plumage du corbeau",
  "crownfall_treasure_item_1_hero": "Trésor II (très rare)",
  "crownfall_treasure_item_1_sub": "Inclut une raillerie personnalisée",
  "crownfall_treasure_item_2_name": "Corbeau écorché",
  "crownfall_treasure_item_2_hero": "Trésor I (commun)",
  "crownfall_treasure_item_3_name": "Aigle foudroyant",
  "crownfall_treasure_item_3_hero": "Trésor II (rare)",
  "crownfall_treasure_item_4_name": "Oiseau moqueur",
  "crownfall_treasure_item_4_hero": "Trésor I (très rare)",
  "crownfall_treasure_item_4_sub": "Inclut une raillerie personnalisée",
  "crownfall_treasure_item_5_name": "Murmure d'ailes",
  "crownfall_treasure_item_5_hero": "Trésor I (rare)",
  "crownfall_treasure_item_6_name": "Ours hibou",
  "crownfall_treasure_item_6_hero": "Trésor II (ultrarare)",
  "crownfall_treasure_item_7_name": "Couronne du condor",
  "crownfall_treasure_item_7_hero": "Trésor I (rare)",
  "crownfall_treasure_item_8_name": "Essaim verdoyant",
  "crownfall_treasure_item_8_hero": "Trésor I (commun)",
  "crownfall_treasure_item_9_name": "Bandit plumeur",
  "crownfall_treasure_item_9_hero": "Trésor II (rare)",
  "crownfall_treasure_item_10_name": "Cœur de lion",
  "crownfall_treasure_item_10_hero": "Trésor II (commun)",
  "crownfall_treasure_item_11_name": "Bébé Roshan, serviteur de Scree'Auk",
  "crownfall_treasure_item_11_hero": "Trésor I/II (rarissime)",
  "crownfall_treasure_purchase_1": "Trésor I (%1$s)",
  "crownfall_treasure_purchase_2": "Trésor II (%1$s)",
  "crownfall_footer_act_1": "Acte[br][b]I[/b]",
  "crownfall_footer_act_2": "Acte[br][b]II[/b]",
  "crownfall_footer_act_3": "Acte[br][b]III[/b]",
  "crownfall_footer_act_4": "Acte[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "Les Marchés de[br][b]la Patte-d'Oie[/b]",
  "crownfall_footer_act_2_name": "Les Déserts de[br][b]Druud[/b]",
  "crownfall_footer_act_3_name": "Les Étendues gelées des[br][b]landes de Glace[/b]",
  "crownfall_footer_act_4_name": "Les Aiguilles de[br][b]Skywrath[/b]",
  "crownfall_footer_act_play": "Disponible",
  "crownfall_footer_act_unlocks_mid_may": "Déverrouillé à la mi-mai",
  "crownfall_footer_act_locked": "Verrouillé"
}