// 8770.js

{
  "language": "latam",
  "crownfallcomic_title_cover": "Día de Ascención - Portada",
  "crownfallcomic_title": "Día de Ascención - Página %1$s",
  "crownfallcomic_help_text": "Haz clic en la imagen o utiliza la barra espaciadora para avanzar",
  "crownfallcomic_return_button": "Regresar a la portada",
  "crownfallcomic_act1_intro_title_cover": "Día de Ascensión - Portada",
  "crownfallcomic_act1_intro_title": "Día de Ascensión - Página %1$s",
  "crownfallcomic_act2_intro_title_cover": "La Batalla de la Cuenca del Infierno - Portada",
  "crownfallcomic_act2_intro_title": "La Batalla de la Cuenca del Infierno - Página %1$s",
  "crownfallcomic_act3_intro_title_cover": "El Dragón - Portada",
  "crownfallcomic_act3_intro_title": "El Dragón - Página %1$s",
  "crownfallcomic_act4_intro_title_cover": "Caída de la Corona — Portada",
  "crownfallcomic_act4_intro_title": "Caída de la Corona — Página %1$s",
  "crownfall_title": "La Caída de la Corona",
  "crownfall_welcome": "Juega Dota para desbloquear lugares exóticos, nuevos personajes y secretos oscuros en una historia repleta de héroes legendarios y recompensas únicas. Ya disponible y gratis para todos los jugadores de Dota.",
  "crownfall_newstory_title": "Reclama el trono",
  "crownfall_newstory_description": "Shendelzare, reina legítima de Skywrath, fue brutalmente destituida por su hermana Imperia. Como miembro élite de la guardia de la corona, los poderes y la vida de Dragonus estaban a merced de Imperia. Ahora, con la ayuda de la diosa Scree'Auk, ambos recibieron nuevos poderes y una última oportunidad para conseguir su venganza... y el trono.",
  "crownfall_comic_title": "Ponte al día con la historia",
  "crownfall_comic_description": "La Reina Imperia prohibió la adoración a Scree'Auk. Forzada a esconderse en los tugurios de Barrio Medio, la diosa derrocada crea un plan desesperado para volver a tomar el control de Skywrath.",
  "crownfall_comic_button": "Lee el cómic",
  "crownfall_howtoplay_title": "Te espera una aventura",
  "crownfall_howtoplay_description": "¡Guía a Shen y a Dragonus por las calles concurridas de Skywrath en su misión para recuperar el trono! Interactúa con un elenco de nuevos y viejos personajes favoritos, descubre oscuros secretos, sumérgete en misiones alternas y, ocasionalmente, relájate pescando róbalos. Obtén más recompensas mientras ahondas en un mapa detallado e interactivo.",
  "crownfall_explainer_a_long": "[b]EXPLORA.[/b] Jugar partidas de Dota durante el evento de la Caída de la Corona te otorgará fichas. Jugar con héroes diferentes te otorgará distintos tipos de fichas.",
  "crownfall_explainer_b_long": "[b]DESBLOQUEA.[/b] Usa fichas para desbloquear caminos en el mapa, avanzando en la historia y obteniendo recompensas. ¡Habrá encuentros especiales, como con el Comerciante de Fichas y la Caravana de la Caramelería!",
  "crownfall_explainer_c_long": "[b]VÉNGATE.[/b] Colecciona tesoros, caramelos, monedas de la Caída de la Corona y más, a medida que batallas para derrocar a la malvada Reina Imperia.",
  "crownfall_fouracts_title": "La historia se desarrolla",
  "crownfall_fouracts_description": "Los Mercados de Barrio Medio son solo el primer acto de una historia de cuatro partes que se extenderá durante los próximos meses. Podrás experimentar los nuevos actos tan pronto estén disponibles, pero también podrás seguir la aventura a tu propio ritmo; la llegada de un nuevo acto no finalizará el anterior. [br][br]Es decir, puedes demorarte tanto como quieras explorando cada camino posible, desafío y secretos del Acto I. Incluso con tanto para descubrir, esto apenas comienza. La Caída de la Corona se extenderá a medida que se desarrolle durante los próximos meses, con cada nuevo acto trayendo su propia historia, personajes, un exclusivo mapa y nuevas recompensas. Puede que haya una sorpresa o dos en el camino.",
  "crownfall_rewards_title": "Recompensas",
  "crownfall_rewards_a": "Monedas de la Caída de la Corona",
  "crownfall_rewards_a_long_new": "Obtén monedas de la Caída de la Corona al explorar diferentes caminos en el mapa. Colecciona 10 monedas para intercambiarlas en la tienda de la Caída de la Corona con un descuento aproximado de %1$s en cualquier objeto que cueste %1$s o más. (Los descuentos exactos varían dependiendo de la región y del tipo de cambio).",
  "crownfall_rewards_b": "Tesoros",
  "crownfall_rewards_b_long": "El Acto I incluye dos cofres del tesoro diferentes, con un total de 24 sets de objetos nuevos. ¡Podrás desbloquear algunos de los sets solo por jugar!",
  "crownfall_rewards_c": "Sacos de caramelos",
  "crownfall_rewards_c_long": "Encuentra la Caravana de la Caramelería de Sithil y Quirt en cada mapa de la Caída de la Corona para mejorarla e intercambiar tus caramelos por sets de héroes, mensajeros, guardianes y más. (¡Incluso hay una oportunidad poco común para obtener un Arcano!).",
  "crownfall_rewards_andmanymore": "¡Y eso no es todo! Descubre pantallas de carga completamente nuevas, exprésate con emoticonos, aerosoles y una rueda de chat con frases nuevas, decora a tu héroe con sets de objetos únicos que puedes encontrar a lo largo de la historia o incluso más; hay todo un mundo esperando a que lo explores.",
  "crownfall_explorerpack_title": "Paquete de explorador del Barrio Medio",
  "crownfall_explorerpack_description": "Todas las recompensas en la historia principal de la Caída de la Corona estarán disponibles, y gratis para todos los jugadores, pero para aquellos aventureros más experimentados que quieran profundizar un poco más en el Acto I, el paquete del explorador del Barrio Medio ofrece más exploración de mapas, más historias y más recompensas.",
  "crownfall_explorerpack_description_long": "La compra del paquete desbloquea misiones alternativas y recompensas especiales en el mapa. Además de las recompensas disponibles en el camino gratuito, el paquete del explorador del Barrio Medio también otorga tesoros adicionales, creeps de la Caída de la Corona, objetos inmortales y objetos por completar la historia, monedas adicionales de la Caída de la Corona que se pueden usar para ahorrar en objetos de la tienda y más.",
  "crownfall_explorerpack_purchase_act1_a": "Acto I",
  "crownfall_explorerpack_purchase_act1_b": "El Nido",
  "crownfall_explorerpack_purchase_act1_c": "El paquete de explorador del Barrio Medio",
  "crownfall_explorerpack_purchase": "Comprar %1$s",
  "crownfall_arcanas_title": "Arcanos",
  "crownfall_arcanas_description": "La diosa moribunda Scree'Auk concedió el resto de sus poderes a Vengeful Spirit y Skywrath Mage por un precio: ambos deberán usar magia oscura para derrocar a la corrupta reina de Skywrath.",
  "crownfall_arcana_sm_hero": "Las devociones de Dragonus",
  "crownfall_arcana_sm_a": "Modelo y pedestal",
  "crownfall_arcana_sm_a_long": "Dragonus se ganó un modelo completamente nuevo con un set completo de objetos que se ajusta a sus verdaderas lealtades, así como un pedestal nuevo y un estilo alternativo desbloqueable.",
  "crownfall_arcana_sm_b": "Animaciones y efectos personalizados",
  "crownfall_arcana_sm_b_long": "Cuenta con un set completo de animaciones y efectos ambientales completamente nuevos, incluyendo íconos y efectos personalizados para Proyectil Arcano, Disparo Conmocionador, Sello Ancestral y Destello Místico.",
  "crownfall_arcana_sm_c": "Recursos personalizados de héroe",
  "crownfall_arcana_sm_c_long": "Incluye un retrato nuevo, ícono de minimapa y retrato de la barra superior, efectos completamente nuevos para ataques, víctimas, muertes y denegaciones, además de íconos de objetos y efectos para Vara de Atos y Filactería.",
  "crownfall_arcana_sm_d": "Líneas de voz del Arcano",
  "crownfall_arcana_sm_d_long": "Libre de la influencia de Imperia, Dragonus tiene una voz completamente nueva para ayudarle a ventilar sus quejas.",
  "crownfall_arcana_sm_purchase": "Comprar %1$s",
  "crownfall_arcana_sm_purchase_note": "Descuento disponible usando las monedas de la Caída de la Corona",
  "crownfall_arcana_sm_alternate_header": "Desbloqueable",
  "crownfall_arcana_sm_alternate_title": "Estilo alternativo",
  "crownfall_arcana_sm_alternate_desc": "Completa la misión principal del Acto IV para desbloquear el estilo alternativo del Arcano de Skywrath Mage.",
  "crownfall_arcana_vs_hero": "La resurreción de Shen",
  "crownfall_arcana_vs_a": "Modelo y pedestal",
  "crownfall_arcana_vs_a_long": "Shendelzare recuperó sus alas, otorgando un modelo completamente nuevo con un set completo de objetos digno de la realeza Skywrathiana, que incluye un pedestal nuevo y dos estilos alternativos desbloqueables.",
  "crownfall_arcana_vs_b": "Animaciones y efectos personalizados",
  "crownfall_arcana_vs_b_long": "Cuenta con un set completo de animaciones y efectos ambientales completamente nuevos, incluyendo íconos y efectos personalizados para Misil Mágico, Oleada de Terror, Intercambio Abisal y un efecto de ilusión personalizado para Aura Vengativa.",
  "crownfall_arcana_vs_c": "Recursos personalizados de héroe",
  "crownfall_arcana_vs_c_long": "Incluye un retrato nuevo, ícono de minimapa y retrato de la barra superior, efectos completamente nuevos para ataques, víctimas, muertes y denegaciones, además de un ícono y efectos para Bastón de la Fuerza, así como un ícono personalizado para el Cetro de Aghanim.",
  "crownfall_arcana_vs_d": "Líneas de voz del Arcano",
  "crownfall_arcana_vs_d_long": "Con las alas restauradas y un ojo en su legítimo trono, Shendelzare tiene una interpretación de voz completamente nueva que refleja su forma física.",
  "crownfall_arcana_vs_purchase": "Comprar %1$s",
  "crownfall_arcana_vs_purchase_note": "Descuento disponible usando las monedas de la Caída de la Corona",
  "crownfall_arcana_vs_alternate_header": "Desbloqueable",
  "crownfall_arcana_vs_alternate_title": "Estilos alternativos",
  "crownfall_arcana_vs_alternate_desc": "Completa la misión principal del Acto IV para desbloquear el primer estilo alternativo. Completa las misiones principales y las misiones alternas en la Caída de la Corona para desbloquear el segundo estilo alternativo.",
  "crownfall_treasures_title": "Tesoros",
  "crownfall_treasures_description": "Sets de objetos completamente nuevos para algunos de tus héroes favoritos que incluyen sets raros para Wraith King, Crystal Maiden, Hoodwink y más. Los sets de Meepo y Drow Ranger vienen con burlas personalizadas.",
  "crownfall_treasure_item_0_name": "Falange del águila de bronce",
  "crownfall_treasure_item_0_hero": "Tesoro I - Común",
  "crownfall_treasure_item_1_name": "Capa de cuervo",
  "crownfall_treasure_item_1_hero": "Tesoro II - Muy raro",
  "crownfall_treasure_item_1_sub": "Incluye una burla personalizada",
  "crownfall_treasure_item_2_name": "Cuervo de sangre",
  "crownfall_treasure_item_2_hero": "Tesoro I - Común",
  "crownfall_treasure_item_3_name": "Ave del trueno",
  "crownfall_treasure_item_3_hero": "Tesoro II - Raro",
  "crownfall_treasure_item_4_name": "Sinsonte",
  "crownfall_treasure_item_4_hero": "Tesoro I - Muy raro",
  "crownfall_treasure_item_4_sub": "Incluye una burla personalizada",
  "crownfall_treasure_item_5_name": "Alas susurrantes",
  "crownfall_treasure_item_5_hero": "Tesoro I - Raro",
  "crownfall_treasure_item_6_name": "Oso búho",
  "crownfall_treasure_item_6_hero": "Tesoro II - Ultrarraro",
  "crownfall_treasure_item_7_name": "Corona del cóndor",
  "crownfall_treasure_item_7_hero": "Tesoro I - Raro",
  "crownfall_treasure_item_8_name": "Enjambre frondoso",
  "crownfall_treasure_item_8_hero": "Tesoro I - Común",
  "crownfall_treasure_item_9_name": "Ladrón de alpiste",
  "crownfall_treasure_item_9_hero": "Tesoro II - Raro",
  "crownfall_treasure_item_10_name": "Corazón de león",
  "crownfall_treasure_item_10_hero": "Tesoro II - Común",
  "crownfall_treasure_item_11_name": "Roshan Bebé, sirviente de Scree'Auk",
  "crownfall_treasure_item_11_hero": "Tesoro I/II - Cósmicamente raro",
  "crownfall_treasure_purchase_1": "Tesoro I - %1$s",
  "crownfall_treasure_purchase_2": "Tesoro II - %1$s",
  "crownfall_footer_act_1": "Acto[br][b]I[/b]",
  "crownfall_footer_act_2": "Acto[br][b]II[/b]",
  "crownfall_footer_act_3": "Acto[br][b]III[/b]",
  "crownfall_footer_act_4": "Acto[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "Los Mercados de [br][b]Barrio Medio[/b]",
  "crownfall_footer_act_2_name": "Los desiertos de[br][b]Druud[/b]",
  "crownfall_footer_act_3_name": "Las heladas de[br][b]Icewrack[/b]",
  "crownfall_footer_act_4_name": "Los chapiteles de[br][b]Skywrath[/b]",
  "crownfall_footer_act_play": "Juega ya",
  "crownfall_footer_act_unlocks_mid_may": "Disponible a mediados de mayo",
  "crownfall_footer_act_locked": "No disponible"
}