// 350.js

{
  "language": "italian",
  "crownfallcomic_title_cover": "Il giorno dell'ascesa - Copertina",
  "crownfallcomic_title": "Il giorno dell'ascesa - Pagina %1$s",
  "crownfallcomic_help_text": "Clicca sull'immagine o premi spazio per proseguire",
  "crownfallcomic_return_button": "Torna alla copertina",
  "crownfall_title": "Crownfall",
  "crownfall_welcome": "Gioca a Dota per sbloccare luoghi esotici, nuovi personaggi e oscuri segreti in un evento narrativo continuo pieno di Eroi leggendari e ricompense uniche. Disponibile ora gratuitamente per tutti i giocatori di Dota.",
  "crownfall_newstory_title": "Rivendica il trono",
  "crownfall_newstory_description": "Shendelzare, la regina legittima di Skywrath, è stata brutalmente deposta da sua sorella Imperia. In qualità di membro della guardia magica d'élite di Imperia, i poteri e la vita di Dragonus erano alla sua mercé. Ora, con l'aiuto della dea Scree'Auk, entrambi hanno ricevuto nuovi poteri e un'ultima possibilità di vendicarsi... e riconquistare il trono.",
  "crownfall_comic_title": "La storia finora",
  "crownfall_comic_description": "La Regina Imperia ha bandito il culto di Scree'Auk. Costretta a nascondersi nei bassifondi dei Cancelli di mezzo, la dea deposta escogita un piano disperato per riprendere il controllo di Skywrath.",
  "crownfall_comic_button": "Leggi il fumetto",
  "crownfall_howtoplay_title": "L'avventura ti aspetta",
  "crownfall_howtoplay_description": "Guida Shen e Dragonus lungo le affollate strade di Skywrath nella loro missione per riconquistare il trono! Interagisci con un cast di nuovi personaggi e vecchi amici, scopri oscuri segreti, intraprendi incredibili missioni secondarie e, di tanto in tanto, fai anche un po' di pesca alla spigola. Ottieni più ricompense man mano che approfondisci una mappa del mondo dettagliata e interattiva.",
  "crownfall_explainer_a_long": "[b]ESPLORA.[/b] Guadagna gettoni giocando a Dota durante l'evento di Crownfall. Giocare con Eroi diversi ti farà ottenere tipi di gettoni diversi.",
  "crownfall_explainer_b_long": "[b]SBLOCCA.[/b] Usa i gettoni per sbloccare nuovi percorsi sulla mappa della regione, progredendo nella storia e guadagnando ricompense. Occhi aperti per gli incontri speciali, come il commerciante di gettoni e la Carovana della Dolceria!",
  "crownfall_explainer_c_long": "[b]VENDICA.[/b] Raccogli tesori, dolci, monete di Crownfall e molto altro mentre combatti per detronizzare la malvagia Regina Imperia.",
  "crownfall_fouracts_title": "La storia continua",
  "crownfall_fouracts_description": "I Mercati dei Cancelli di mezzo sono solo il primo atto di una storia in quattro parti che si svolgerà nel corso di più mesi. Potrai giocare ai nuovi atti non appena verranno resi disponibili, ma avrai anche la possibilità di goderti l'avventura al tuo ritmo: l'arrivo di un nuovo atto non segnerà il termine dei precedenti. [br][br]Ciò significa che puoi esplorare con calma tutti i percorsi, le sfide e i segreti inclusi nel I Atto. Nonostante ci sia così tanto da scoprire, questo evento è solo all'inizio: nel corso dei prossimi mesi, ogni nuovo atto farà crescere Crownfall con l'arrivo di una storia diversa, personaggi mai incontrati prima, una mappa inedita e nuovissime ricompense. Lungo il cammino potrebbero anche esserci un paio di sorprese...",
  "crownfall_rewards_title": "Ricompense",
  "crownfall_rewards_a": "Monete di Crownfall",
  "crownfall_rewards_a_long_new": "Guadagna monete di Crownfall esplorando diversi percorsi sulla mappa. Raccogli 10 monete e spendile per ricevere uno sconto di %1$s circa su qualsiasi articolo che costa almeno %1$s (lo sconto esatto varia in base alla regione e alla valuta).",
  "crownfall_rewards_b": "Tesori",
  "crownfall_rewards_b_long": "Il I Atto include due tesori diversi, per un totale di 24 set di oggetti. Potrai sbloccare alcuni dei set semplicemente giocando!",
  "crownfall_rewards_c": "Sacchetti di dolci",
  "crownfall_rewards_c_long": "Trova la Carovana della Dolceria di Sithil e Quirt in ogni mappa di Crownfall per migliorarla e scambiare i tuoi dolci con set degli Eroi, Corrieri, Guardiani e altro ancora (con un pizzico di fortuna, hai anche la possibilità di trovare un set Arcano!)",
  "crownfall_rewards_andmanymore": "E non è tutto! Svela le nuovissime schermate di caricamento, esprimiti con emoticon, spray e nuove frasi per la chat radiale, addobba i tuoi Eroi con set di oggetti unici che troverai lungo il percorso della storia e molto altro ancora: c'è un mondo intero che aspetta di essere esplorato.",
  "crownfall_explorerpack_title": "Pacchetto Pioniere dei Cancelli di mezzo",
  "crownfall_explorerpack_description": "Tutte le ricompense lungo il cammino della storia principale di Crownfall saranno disponibili gratuitamente, ma per gli avventurieri esperti che intendono esplorare il I Atto ancora più a fondo, il Pacchetto Pioniere dei Cancelli di mezzo offre altri percorsi, storie e ricompense.",
  "crownfall_explorerpack_description_long": "L'acquisto del pacchetto sblocca missioni secondarie e ricompense speciali sulla mappa. Oltre alle ricompense disponibili lungo il cammino gratuito, il Pacchetto Pioniere consente di ottenere tesori aggiuntivi, i creep di Crownfall, oggetti Immortali e di completamento, monete di Crownfall da usare nel negozio e molto altro ancora.",
  "crownfall_explorerpack_purchase_act1_a": "Atto I",
  "crownfall_explorerpack_purchase_act1_b": "Il Nido Spettrale",
  "crownfall_explorerpack_purchase_act1_c": "Il Pacchetto Pioniere dei Cancelli di mezzo",
  "crownfall_explorerpack_purchase": "Acquista %1$s",
  "crownfall_arcanas_title": "Set Arcani",
  "crownfall_arcanas_description": "La dea morente Scree'Auk ha conferito i suoi ultimi poteri a Vengeful Spirit e Skywrath Mage ad un solo prezzo: usare la sua magia oscura per rovesciare l'infida regina di Skywrath.",
  "crownfall_arcana_sm_hero": "Le Devozioni di Dragonus",
  "crownfall_arcana_sm_a": "Modello e piedistallo",
  "crownfall_arcana_sm_a_long": "Dragonus ha ricevuto un nuovo modello con un set completo di oggetti adeguati alla sua vera lealtà, oltre ad un nuovo piedistallo e ad uno stile alternativo sbloccabile.",
  "crownfall_arcana_sm_b": "Animazioni ed effetti personalizzati",
  "crownfall_arcana_sm_b_long": "Include una serie di nuovissime animazioni ed effetti ambientali, tra cui icone esclusive per Dardo arcano, Colpo a concussione, Sigillo antico e Bagliore mistico.",
  "crownfall_arcana_sm_c": "Icone e ritratti personalizzati",
  "crownfall_arcana_sm_c_long": "Include un nuovo ritratto, un'icona della minimappa e un ritratto per la barra superiore, effetti esclusivi per gli attacchi, le uccisioni, le morti e le negazioni, oltre ad icone ed effetti speciali per il Bastone di Atos e il Filatterio.",
  "crownfall_arcana_sm_d": "Frasi esclusive",
  "crownfall_arcana_sm_d_long": "Libero dall'influenza di Imperia, Dragonus ha aggiornato il suo repertorio con nuove frasi per dare voce ai suoi malcontenti.",
  "crownfall_arcana_sm_purchase": "Acquista %1$s",
  "crownfall_arcana_sm_purchase_note": "Sconto disponibile utilizzando le monete di Crownfall",
  "crownfall_arcana_sm_alternate_header": "Sbloccabile",
  "crownfall_arcana_sm_alternate_title": "Stile alternativo",
  "crownfall_arcana_sm_alternate_desc": "Completa la missione principale nel IV Atto per sbloccare lo stile alternativo del set Arcano di Skywrath Mage.",
  "crownfall_arcana_vs_hero": "La Resurrezione di Shen",
  "crownfall_arcana_vs_a": "Modello e piedistallo",
  "crownfall_arcana_vs_a_long": "Dopo aver riacquistato le sue ali, Shendelzare ha ricevuto un nuovissimo modello con un set completo di oggetti degni della famiglia reale di Skywrath, oltre ad un nuovo piedistallo e due stili alternativi sbloccabili.",
  "crownfall_arcana_vs_b": "Animazioni ed effetti personalizzati",
  "crownfall_arcana_vs_b_long": "Include una serie di nuovissime animazioni ed effetti ambientali, tra cui icone ed effetti esclusivi per Missile magico, Onda di terrore, Scambio subdolo e l'illusione di Aura della vendetta.",
  "crownfall_arcana_vs_c": "Icone e ritratti personalizzati",
  "crownfall_arcana_vs_c_long": "Include un nuovo ritratto, un'icona della minimappa e un ritratto per la barra superiore, effetti esclusivi per gli attacchi, le uccisioni, le morti e le negazioni, oltre a un'icona ed effetti speciali per il Bastone della Forza e un'icona personalizzata per lo Scettro di Aghanim.",
  "crownfall_arcana_vs_d": "Frasi esclusive",
  "crownfall_arcana_vs_d_long": "Con le sue nuove ali e gli occhi puntati sul trono che le spetta di diritto, Shendelzare ha aggiornato il suo repertorio con nuove frasi che rispecchiano la sua forma corporea.",
  "crownfall_arcana_vs_purchase": "Acquista %1$s",
  "crownfall_arcana_vs_purchase_note": "Sconto disponibile utilizzando le monete di Crownfall",
  "crownfall_arcana_vs_alternate_header": "Sbloccabile",
  "crownfall_arcana_vs_alternate_title": "Stili alternativi",
  "crownfall_arcana_vs_alternate_desc": "Completa la missione principale nel IV Atto per sbloccare il primo stile alternativo. Completa tutte le missioni principali e tutte le missioni secondarie in Crownfall per sbloccare il secondo stile alternativo.",
  "crownfall_treasures_title": "Tesori",
  "crownfall_treasures_description": "Nuovissimi set di oggetti per alcuni dei tuoi Eroi preferiti, tra cui set rari per Wraith King, Crystal Maiden, Hoodwink e altri ancora. I set di Meepo e Drow Range includono una provocazione speciale.",
  "crownfall_treasure_item_0_name": "La Falange dell'Aquila di Bronzo",
  "crownfall_treasure_item_0_hero": "Tesoro I - Comune",
  "crownfall_treasure_item_1_name": "Il Travestimento Corvino",
  "crownfall_treasure_item_1_hero": "Tesoro II - Molto raro",
  "crownfall_treasure_item_1_sub": "Include una provocazione speciale",
  "crownfall_treasure_item_2_name": "Il Corvo Sanguinario",
  "crownfall_treasure_item_2_hero": "Tesoro I - Comune",
  "crownfall_treasure_item_3_name": "L'Uccello del Tuono",
  "crownfall_treasure_item_3_hero": "Tesoro II - Raro",
  "crownfall_treasure_item_4_name": "L'Uccello Beffardo",
  "crownfall_treasure_item_4_hero": "Tesoro I - Molto raro",
  "crownfall_treasure_item_4_sub": "Include una provocazione speciale",
  "crownfall_treasure_item_5_name": "Le Ali Sussurranti",
  "crownfall_treasure_item_5_hero": "Tesoro I - Raro",
  "crownfall_treasure_item_6_name": "L'Orso Gufo",
  "crownfall_treasure_item_6_hero": "Tesoro II - Ultra raro",
  "crownfall_treasure_item_7_name": "La Corona del Condor",
  "crownfall_treasure_item_7_hero": "Tesoro I - Raro",
  "crownfall_treasure_item_8_name": "Lo Sciame Verdeggiante",
  "crownfall_treasure_item_8_hero": "Tesoro I - Comune",
  "crownfall_treasure_item_9_name": "La Brigantessa Pennuta",
  "crownfall_treasure_item_9_hero": "Tesoro II - Raro",
  "crownfall_treasure_item_10_name": "Cuor di Leone",
  "crownfall_treasure_item_10_hero": "Tesoro II - Comune",
  "crownfall_treasure_item_11_name": "Piccolo Roshan Servitore di Scree'Auk",
  "crownfall_treasure_item_11_hero": "Tesoro I/II - Cosmicamente raro",
  "crownfall_treasure_purchase_1": "Tesoro I - %1$s",
  "crownfall_treasure_purchase_2": "Tesoro II - %1$s",
  "crownfall_footer_act_1": "Atto[br][b]I[/b]",
  "crownfall_footer_act_2": "Atto[br][b]II[/b]",
  "crownfall_footer_act_3": "Atto[br][b]III[/b]",
  "crownfall_footer_act_4": "Atto[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "I Mercati dei[br][b]Cancelli di mezzo[/b]",
  "crownfall_footer_act_2_name": "I Deserti di[br][b]Druud[/b]",
  "crownfall_footer_act_3_name": "Il Gelo del[br][b]Deserto di Ghiaccio[/b]",
  "crownfall_footer_act_4_name": "Le Torri di[br][b]Skywrath[/b]",
  "crownfall_footer_act_play": "Gioca ora",
  "crownfall_footer_act_unlocks_mid_may": "In arrivo a metà maggio",
  "crownfall_footer_act_locked": "Non disponibile"
}