// 4097.js

{
  "language": "spanish",
  "crownfallcomic_title_cover": "El día de la coronación — Portada",
  "crownfallcomic_title": "El día de la coronación — Página %1$s",
  "crownfallcomic_help_text": "Haz clic en la imagen o utiliza la barra espaciadora para avanzar",
  "crownfallcomic_return_button": "Volver a la portada",
  "crownfall_title": "La Caída de la Corona",
  "crownfall_welcome": "Juega a Dota para desbloquear sitios exóticos, personajes nuevos y oscuros secretos en un evento narrativo continuo, lleno de héroes legendarios y recompensas únicas. Disponible ya para todos los jugadores de Dota de forma gratuita.",
  "crownfall_newstory_title": "Reclama el trono",
  "crownfall_newstory_description": "Shendelzare, la auténtica reina de Skywrath, ha sido derrocada brutalmente por su hermana Imperia. Al pertenecer a la selecta guardia hechicera de Imperia, los poderes y la vida de Dragonus estaban completamente a merced de la reina. Pero, ahora, con la ayuda de la diosa Scree'Auk, ambos tienen nuevos poderes, así como una última oportunidad de vengarse... y hacerse con el trono.",
  "crownfall_comic_title": "Trasfondo de la historia",
  "crownfall_comic_description": "La reina Imperia ha prohibido el culto a Scree'Auk. Obligada a esconderse en las chabolas del Barrio Medio, la diosa proscrita trama un plan desesperado para volver a hacerse con el control de Skywrath.",
  "crownfall_comic_button": "Leer el cómic",
  "crownfall_howtoplay_title": "Vive la aventura",
  "crownfall_howtoplay_description": "¡Acompaña a Shen y a Dragonus por las concurridas calles de Skywrath en su misión para recuperar el trono! Interactúa con un elenco de nuevos personajes y favoritos de siempre, descubre oscuros secretos, completa curiosas misiones secundarias e incluso pesca un poco de vez en cuando. Cuanto más te adentres en el detallado mapa interactivo del mundo, más recompensas puedes conseguir.",
  "crownfall_explainer_a_long": "[b]EXPLORA.[/b] Juega partidas de Dota durante el evento de la Caída de la Corona para conseguir fichas. Al jugar con héroes distintos, conseguirás diferentes tipos de fichas.",
  "crownfall_explainer_b_long": "[b]DESBLOQUEA.[/b] Utiliza las fichas para desbloquear rutas en el mapa principal, avanzar en la historia y conseguir recompensas, y presta atención, porque habrá encuentros especiales como el Comerciante de Fichas y la Caramelería Ambulante.",
  "crownfall_explainer_c_long": "[b]VÉNGATE.[/b] Colecciona tesoros, caramelos, monedas del evento y mucho más mientras luchas por destronar a la malvada reina Imperia.",
  "crownfall_fouracts_title": "Sigue la historia",
  "crownfall_fouracts_description": "Al primer acto de la historia, [i]Los mercados del Barrio Medio[/i], le seguirán tres actos más en los próximos meses a los que podrás jugar en cuanto estén disponibles. Pero también puedes disfrutar de la aventura a tu propio ritmo, porque los actos anteriores seguirán estando disponibles aunque salga uno nuevo. [br][br]Por eso, puedes dedicar todo el tiempo que quieras a explorar todas las rutas, desafíos y secretos del Acto I. Y, a pesar de haber tanto que descubrir, este evento no ha hecho nada más que empezar. La Caída de la Corona seguirá desarrollándose durante los próximos meses, y cada acto presentará una historia propia, otros personajes, un mapa principal exclusivo y recompensas completamente nuevas. ¡Hasta puede que haya alguna que otra sorpresa por el camino!",
  "crownfall_rewards_title": "Recompensas",
  "crownfall_rewards_a": "Monedas de la Caída de la Corona",
  "crownfall_rewards_a_long_new": "Explora diferentes rutas del mapa para conseguir monedas de la Caída de la Corona. Junta 10 monedas y canjéalas en la tienda del evento por un descuento aproximado de %1$s en cualquier artículo que cueste como mínimo %1$s (los descuentos exactos dependen de la moneda y de la región).",
  "crownfall_rewards_b": "Tesoros",
  "crownfall_rewards_b_long": "El Acto I incluye dos cofres del tesoro diferentes, con un total de 24 sets de artículos nuevos. ¡Algunos de los sets se desbloquean con solo jugar!",
  "crownfall_rewards_c": "Sacos de Caramelos",
  "crownfall_rewards_c_long": "Encuentra la Caramelería Ambulante de Sithil y Quirt en cada mapa de la Caída de la Corona para mejorarla e intercambiar caramelos por sets de héroes, mensajeros, guardianes y mucho más. ¡Hasta hay una pequeña posibilidad de conseguir Arcanos!",
  "crownfall_rewards_andmanymore": "¡Y eso no es todo! Descubre pantallas de carga totalmente nuevas, exprésate con emoticonos, espráis y líneas nuevas de la rueda de chat, engalana a tus héroes con sets de artículos exclusivos que encontrarás a lo largo de la historia y mucho más. ¡Hay todo un mundo por descubrir!",
  "crownfall_explorerpack_title": "Paquete de Exploración del Barrio Medio",
  "crownfall_explorerpack_description": "Todas las recompensas de la historia principal de la Caída de la Corona estarán disponibles para todos los jugadores de forma gratuita, pero, para los aventureros con más experiencia que quieran profundizar un poco más en el Acto I, el Paquete de Exploración del Barrio Medio permite explorar aún más el mapa y descubrir más historias y recompensas.",
  "crownfall_explorerpack_description_long": "Al comprar el paquete, se desbloquean misiones secundarias y recompensas especiales en el mapa. Además de las recompensas disponibles en la ruta gratuita, el Paquete de Exploración concede tesoros adicionales, creeps exclusivos de la Caída de la Corona, artículos inmortales y por logros, monedas adicionales del evento que se pueden usar para ahorrar en artículos de la tienda y mucho más.",
  "crownfall_explorerpack_purchase_act1_a": "Acto I",
  "crownfall_explorerpack_purchase_act1_b": "El Nido Espectral",
  "crownfall_explorerpack_purchase_act1_c": "Paquete de Exploración del Barrio Medio",
  "crownfall_explorerpack_purchase": "Comprar por %1$s",
  "crownfall_arcanas_title": "Arcanos",
  "crownfall_arcanas_description": "La diosa moribunda Scree'Auk ha concedido el resto de sus poderes a Vengeful Spirit y Skywrath Mage a cambio de que usen su magia oscura para derrocar a la traidora reina de Skywrath.",
  "crownfall_arcana_sm_hero": "Las Devociones de Dragonus",
  "crownfall_arcana_sm_a": "Modelo y pedestal",
  "crownfall_arcana_sm_a_long": "Dragonus ha conseguido un modelo completamente nuevo con un set completo de artículos fieles a sus lealtades verdaderas, así como un pedestal nuevo y un estilo alternativo desbloqueable.",
  "crownfall_arcana_sm_b": "Animaciones y efectos personalizados",
  "crownfall_arcana_sm_b_long": "Incluye un set completo de animaciones y efectos ambientales completamente nuevos, incluyendo iconos personalizados y efectos para Proyectil Arcano, Disparo Conmocionador, Sello Ancestral y Destello Místico.",
  "crownfall_arcana_sm_c": "Recursos de héroe personalizados",
  "crownfall_arcana_sm_c_long": "Incluye un retrato nuevo, un icono del minimapa y un retrato de la barra superior, efectos completamente nuevos para ataques, víctimas, muertes y denegaciones, e iconos de artículos y efectos para Vara de Atos y Filacteria.",
  "crownfall_arcana_sm_d": "Líneas de voz del arcano",
  "crownfall_arcana_sm_d_long": "Libre del yugo de Imperia, Dragonus tiene una interpretación de voz completamente nueva con la que desahogarse a gusto.",
  "crownfall_arcana_sm_purchase": "Comprar por %1$s",
  "crownfall_arcana_sm_purchase_note": "Descuento disponible al usar monedas de la Caída de la Corona",
  "crownfall_arcana_sm_alternate_header": "Desbloqueable",
  "crownfall_arcana_sm_alternate_title": "Estilo alternativo",
  "crownfall_arcana_sm_alternate_desc": "Completa la misión principal del Acto IV para desbloquear el estilo alternativo del Arcano de Skywrath Mage.",
  "crownfall_arcana_vs_hero": "La Resurrección de Shen",
  "crownfall_arcana_vs_a": "Modelo y pedestal",
  "crownfall_arcana_vs_a_long": "Shendelzare ha recuperado sus alas y otorga un modelo completamente nuevo con un set completo de artículos de la realeza de los Furia Celeste, incluyendo un pedestal nuevo y dos estilos alternativos desbloqueables.",
  "crownfall_arcana_vs_b": "Animaciones y efectos personalizados",
  "crownfall_arcana_vs_b_long": "Incluye un set completo de animaciones y efectos ambientales completamente nuevos, incluidos iconos personalizados y efectos para Misil Mágico, Oleada de Terror, Intercambio Abisal y un efecto personalizado para la ilusión de Aura Vengativa.",
  "crownfall_arcana_vs_c": "Recursos de héroe personalizados",
  "crownfall_arcana_vs_c_long": "Incluye un retrato nuevo, un icono del minimapa y un retrato de la barra superior, efectos completamente nuevos para ataques, víctimas, muertes y denegaciones, un icono de artículo y efectos para Bastón de la Fuerza, y un icono personalizado para el Cetro de Aghanim.",
  "crownfall_arcana_vs_d": "Líneas de voz del arcano",
  "crownfall_arcana_vs_d_long": "Tras recuperar las alas y con la mirada puesta en su legítimo trono, Shendelzare cuenta con una interpretación de voz completamente nueva acorde con su forma física.",
  "crownfall_arcana_vs_purchase": "Comprar por %1$s",
  "crownfall_arcana_vs_purchase_note": "Descuento disponible al usar monedas de la Caída de la Corona",
  "crownfall_arcana_vs_alternate_header": "Desbloqueable",
  "crownfall_arcana_vs_alternate_title": "Estilos alternativos",
  "crownfall_arcana_vs_alternate_desc": "Completa la misión principal del Acto IV para desbloquear el primer estilo alternativo. El segundo estilo alternativo se desbloquea al completar todas las misiones principales y secundarias de la Caída de la Corona.",
  "crownfall_treasures_title": "Tesoros",
  "crownfall_treasures_description": "Sets de artículos completamente nuevos para algunos de tus héroes favoritos, incluidos sets raros para Wraith King, Crystal Maiden y Hoodwink, entre otros. Los sets para Meepo y Drow Ranger incluyen burlas personalizadas.",
  "crownfall_treasure_item_0_name": "Legión del Águila de Bronce",
  "crownfall_treasure_item_0_hero": "Tesoro I - Común",
  "crownfall_treasure_item_1_name": "Capa de Cuervo",
  "crownfall_treasure_item_1_hero": "Tesoro II - Muy raro",
  "crownfall_treasure_item_1_sub": "Incluye burla personalizada",
  "crownfall_treasure_item_2_name": "Cuervo Sanguinario",
  "crownfall_treasure_item_2_hero": "Tesoro I - Común",
  "crownfall_treasure_item_3_name": "Ave del Trueno",
  "crownfall_treasure_item_3_hero": "Tesoro II - Raro",
  "crownfall_treasure_item_4_name": "Sinsonte",
  "crownfall_treasure_item_4_hero": "Tesoro I - Muy raro",
  "crownfall_treasure_item_4_sub": "Incluye burla personalizada",
  "crownfall_treasure_item_5_name": "Alas Susurrantes",
  "crownfall_treasure_item_5_hero": "Tesoro I - Raro",
  "crownfall_treasure_item_6_name": "Oso Búho",
  "crownfall_treasure_item_6_hero": "Tesoro II - Ultrarraro",
  "crownfall_treasure_item_7_name": "Corona del Cóndor",
  "crownfall_treasure_item_7_hero": "Tesoro I - Raro",
  "crownfall_treasure_item_8_name": "Plaga Verdosa",
  "crownfall_treasure_item_8_hero": "Tesoro I - Común",
  "crownfall_treasure_item_9_name": "Ladrón de Alpiste",
  "crownfall_treasure_item_9_hero": "Tesoro II - Raro",
  "crownfall_treasure_item_10_name": "Corazón de León",
  "crownfall_treasure_item_10_hero": "Tesoro II - Común",
  "crownfall_treasure_item_11_name": "Roshan Bebé Siervo de Scree'Auk",
  "crownfall_treasure_item_11_hero": "Tesoro I y II - Inconcebiblemente raro",
  "crownfall_treasure_purchase_1": "Tesoro I - %1$s",
  "crownfall_treasure_purchase_2": "Tesoro II - %1$s",
  "crownfall_footer_act_1": "Acto[br][b]I[/b]",
  "crownfall_footer_act_2": "Acto[br][b]II[/b]",
  "crownfall_footer_act_3": "Acto[br][b]III[/b]",
  "crownfall_footer_act_4": "Acto[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "Los mercados del[br][b]Barrio Medio[/b]",
  "crownfall_footer_act_2_name": "Los desiertos de[br][b]Druud[/b]",
  "crownfall_footer_act_3_name": "Las heladas de[br][b]Icewrack[/b]",
  "crownfall_footer_act_4_name": "Las torres de[br][b]Skywrath[/b]",
  "crownfall_footer_act_play": "Jugar",
  "crownfall_footer_act_unlocks_mid_may": "Mediados de mayo",
  "crownfall_footer_act_locked": "Bloqueado"
}