// 5855.js

{
  "language": "vietnamese",
  "crownfallcomic_title_cover": "Ngày Đăng Quang - Bìa truyện",
  "crownfallcomic_title": "Ngày Đăng Quang - Trang %1$s",
  "crownfallcomic_help_text": "Nhấp ảnh hoặc dùng phím cách để đi tiếp",
  "crownfallcomic_return_button": "Trở về trang bìa",
  "crownfall_title": "Crownfall",
  "crownfall_welcome": "Chơi Dota để mở khóa những địa điểm xa lạ, nhân vật mới và bí mật đen tối theo cùng diễn biến của câu chuyện. Không chỉ ngập tràn tướng lĩnh anh hùng huyền thoại mà còn nhiều phần thưởng độc đáo. Đã ra mắt miễn phí cho tất cả người chơi Dota.",
  "crownfall_newstory_title": "Đoạt lại vương vị",
  "crownfall_newstory_description": "Shendelzare, nữ đế chính thống của Skywrath, đã bị phế truất một cách tàn bạo bởi chính người em gái Imperia. Thân là thành viên đội pháp sư hộ vệ tinh tú của Imperia, sức mạnh và sinh mệnh của Dragonus nằm trong tay ả. Giờ đây, với sự tương trợ từ nữ thần Scree'Auk, cả hai đã được ban quyền năng mới, và cơ hội cuối cùng để phục thù... và đoạt lại ngai vàng.",
  "crownfall_comic_title": "Ôn lại chuyện xưa",
  "crownfall_comic_description": "Nữ đế Imperia đã nghiêm cấm thờ phụng Scree'Auk. Bị đẩy đến đường phải ẩn mình trong khu ổ chuột của Cổng Giữa, nữ thần bị phế truất ấp ủ một âm mưu tuyệt vọng để giành lại quyền kiểm soát Skywrath.",
  "crownfall_comic_button": "Đọc truyện tranh",
  "crownfall_howtoplay_title": "Chuyến phiêu lưu đón chờ",
  "crownfall_howtoplay_description": "Dẫn Shen và Dragonus qua những cung đường sầm uất của Skywrath trong sứ mệnh giành lại ngai vàng! Tương tác với dàn nhân vật mới lẫn cũ, khám phá bí mật đen tối, thực hiện những nhiệm vụ phụ ảo tung chảo, và thi thoảng buông cần câu cá vược. Nhận thêm phần thưởng khi khám phá sâu vào bản đồ thế giới ngập tràn tình tiết.",
  "crownfall_explainer_a_long": "[b]KHÁM PHÁ.[/b] Chơi Dota trong sự kiện Crownfall sẽ cho bạn token. Chơi các tướng khác nhau để nhận nhiều loại token khác nhau.",
  "crownfall_explainer_b_long": "[b]MỞ KHÓA.[/b] Dùng token để mở khóa đường đi trên bản đồ thế giới, khám phá cốt truyện và nhận thưởng. Chú ý các sự kiện đặc biệt như Thương Gia Token và Lữ Hành Kẹo Phẩm!",
  "crownfall_explainer_c_long": "[b]BÁO THÙ.[/b] Thu thập kho báu, kẹo, xu Crownfall, cùng nhiều thứ khác trong cuộc chiến lật đổ Nữ Đế độc ác Imperia.",
  "crownfall_fouracts_title": "Mở ra câu chuyện",
  "crownfall_fouracts_description": "Khu chợ Cổng Giữa chỉ là hồi đầu tiên trong bốn hồi truyện sẽ diễn ra trong vài tháng tới. Bạn có thể chơi qua các hồi mới ngay khi ra mắt, nhưng cũng có thể thong thả khám phá theo tốc độ riêng của mình — một hồi mới trình làng không có nghĩa là hồi truyện trước đó sẽ khép lại. [br][br]Điều này có nghĩa là bạn có thể dành bao nhiêu thời gian tùy thích để khám phá từng con đường, thách thức và bí mật trong hồi I. Và dẫu có thật nhiều thứ để kiếm tìm, sự kiện này chỉ mới khởi đầu mà thôi. Crownfall sẽ tiếp tục mở rộng khi cốt truyện dần hé lộ trong những tháng tiếp theo, mỗi hồi mới mang đến câu chuyện, nhân vật, bản đồ riêng cũng như nhiều phần thưởng hoàn toàn mới. Thậm chí có vài bất ngờ dọc đường đi.",
  "crownfall_rewards_title": "Phần thưởng",
  "crownfall_rewards_a": "Xu Crownfall",
  "crownfall_rewards_a_long_new": "Nhận xu Crownfall bằng cách khám phá nhiều nẻo đường khác nhau trên bản đồ. Thu thập 10 xu để trao đổi trong cửa hàng Crownfall, nhận lấy ưu đãi ~%1$s trên bất kỳ vật phẩm nào có giá từ %1$s trở lên. (Mức giảm chính xác tùy theo khu vực và loại tiền tệ).",
  "crownfall_rewards_b": "Kho báu",
  "crownfall_rewards_b_long": "Hồi I gồm hai hòm kho báu khác nhau, với tổng cộng 24 bộ vật phẩm mới. Chỉ cần chơi thôi là bạn có thể mở khóa vài bộ trong số đó!",
  "crownfall_rewards_c": "Túi kẹo",
  "crownfall_rewards_c_long": "Tìm Lữ Hành Kẹo Phẩm của Sithil và Quirt trên mỗi bản đồ Crownfall để nâng cấp, và đổi kẹo của mình lấy bộ vật phẩm cho tướng, thú vận chuyển, mắt quan sát cùng nhiều món khác. (Thậm chí có cơ hội hiếm để nhận Arcana nữa cơ!)",
  "crownfall_rewards_andmanymore": "Vẫn còn nữa nhé! Chiêm ngưỡng màn hình chờ mới toanh, thể hiện cá tính bằng biểu tượng cảm xúc, sơn xịt và lời thoại vòng tán gẫu mới, chưng diện cho tướng của bạn bằng những bộ vật phẩm độc đáo đang chờ đón xuyên suốt lộ trình câu chuyện, và hơn thế nữa - có cả một thế giới đang chờ bạn khám phá.",
  "crownfall_explorerpack_title": "Gói Người Tìm Cổng Giữa",
  "crownfall_explorerpack_description": "Tất cả phần thưởng trong mạch truyện chính của Crownfall sẽ miễn phí cho tất cả người chơi. Nhưng với những nhà mạo hiểm sành sỏi muốn đào sâu vào hồi I, thì gói Người Tìm Cổng Giữa sẽ cho phép khám phá nhiều bản đồ và tình tiết truyện hơn, cũng như nhận thêm phần thưởng.",
  "crownfall_explorerpack_description_long": "Mua gói để mở khóa nhiệm vụ phụ và phần thưởng đặc biệt trên bản đồ. Ngoài phần thưởng có trên đường miễn phí, gói Người Tìm Đường cũng sẽ trao thêm kho báu, quái Crownfall, vật phẩm Bất Diệt và quà thưởng khi hoàn thành nhiệm vụ, thêm xu Crownfall để tiết kiệm khi mua sắm tại cửa hàng vật phẩm, cùng nhiều lợi ích khác.",
  "crownfall_explorerpack_purchase_act1_a": "Hồi I",
  "crownfall_explorerpack_purchase_act1_b": "Đỉnh Eyrie",
  "crownfall_explorerpack_purchase_act1_c": "Gói Người Tìm Cổng Giữa",
  "crownfall_explorerpack_purchase": "Mua %1$s",
  "crownfall_arcanas_title": "Arcana",
  "crownfall_arcanas_description": "Nữ thần Scree'Auk đang chết dần đã ban cho Vengeful Spirit và Skywrath Mage chút quyền năng cuối cùng, với một cái giá: Họ phải dùng tà thuật của bà để lật đổ nữ đế phản trắc của Skywrath.",
  "crownfall_arcana_sm_hero": "The Devotions of Dragonus",
  "crownfall_arcana_sm_a": "Mô hình & Bệ đài",
  "crownfall_arcana_sm_a_long": "Dragonus nhận một mô hình nhân vật hoàn toàn mới cùng trọn vẹn bộ vật phẩm xứng tầm với lòng tận trung của mình, đi kèm đó là bệ đài mới và kiểu dáng phụ có thể mở khóa.",
  "crownfall_arcana_sm_b": "Cử động và hiệu ứng riêng",
  "crownfall_arcana_sm_b_long": "Bao gồm loạt các cử động và hiệu ứng nền hoàn toàn mới, cũng như biểu tượng và hiệu ứng riêng cho Arcane Bolt, Concussive Shot, Ancient Seal, và Mystic Flare.",
  "crownfall_arcana_sm_c": "Tân trang toàn diện cho tướng",
  "crownfall_arcana_sm_c_long": "Gồm có chân dung, biểu tượng bản đồ nhỏ và chân dung thanh trên, cùng hiệu ứng hoàn toàn mới cho đòn tấn công, giết, chết, và chối bỏ, cộng thêm biểu tượng vật phẩm và hiệu ứng cho Rod of Atos và Phylactery.",
  "crownfall_arcana_sm_d": "Lời thoại phiên bản Arcana",
  "crownfall_arcana_sm_d_long": "Thoát khỏi khống chế của Imperia, Dragonus giờ cất lên chất giọng mới để giúp giải tỏa nỗi bất bình của mình.",
  "crownfall_arcana_sm_purchase": "Mua %1$s",
  "crownfall_arcana_sm_purchase_note": "Có giảm giá khi dùng xu Crownfall",
  "crownfall_arcana_sm_alternate_header": "Mở khóa được",
  "crownfall_arcana_sm_alternate_title": "Kiểu dáng phụ",
  "crownfall_arcana_sm_alternate_desc": "Hoàn thành nhiệm vụ chính trong hồi IV để mở khóa kiểu dáng phụ cho Arcana Skywrath Mage.",
  "crownfall_arcana_vs_hero": "The Resurrection of Shen",
  "crownfall_arcana_vs_a": "Mô hình & Bệ đài",
  "crownfall_arcana_vs_a_long": "Shendelzare lấy lại đôi cánh của mình, nhận được một mô hình hoàn toàn mới cùng trọn vẹn bộ vật phẩm xứng tầm hoàng gia Skywrath, gồm bệ đài mới và hai kiểu dáng phụ có thể mở khóa.",
  "crownfall_arcana_vs_b": "Cử động và hiệu ứng riêng",
  "crownfall_arcana_vs_b_long": "Bao gồm loạt các cử động và hiệu ứng nền hoàn toàn mới, cũng như biểu tượng và hiệu ứng riêng cho Magic Missile, Wave of Terror, Nether Swap, và hiệu ứng riêng cho phân thân Vengeful.",
  "crownfall_arcana_vs_c": "Tân trang toàn diện cho tướng",
  "crownfall_arcana_vs_c_long": "Gồm có chân dung, biểu tượng bản đồ nhỏ và chân dung thanh trên, cùng hiệu ứng hoàn toàn mới cho đòn tấn công, giết, chết, và chối bỏ, cộng thêm biểu tượng vật phẩm và hiệu ứng cho Force Staff, và biểu tượng riêng cho Aghanim's Scepter.",
  "crownfall_arcana_vs_d": "Lời thoại phiên bản Arcana",
  "crownfall_arcana_vs_d_long": "Với đôi cánh được phục hồi, mắt hướng về ngai vàng chính đáng, Shendelzare cất lên chất giọng mới, tương xứng với hình hài xác thịt hiện tại.",
  "crownfall_arcana_vs_purchase": "Mua %1$s",
  "crownfall_arcana_vs_purchase_note": "Có giảm giá khi dùng xu Crownfall",
  "crownfall_arcana_vs_alternate_header": "Mở khóa được",
  "crownfall_arcana_vs_alternate_title": "Kiểu dáng phụ",
  "crownfall_arcana_vs_alternate_desc": "Hoàn thành nhiệm vụ chính trong hồi IV để mở khóa kiểu dáng phụ đầu tiên. Hoàn thành tất cả nhiệm vụ chính và tất cả nhiệm vụ phụ trong Crownfall để mở khóa kiểu dáng phụ thứ hai.",
  "crownfall_treasures_title": "Kho báu",
  "crownfall_treasures_description": "Bộ vật phẩm hoàn toàn mới cho một số tướng yêu thích của bạn, gồm bộ vật phẩm hiếm cho Wraith King, Crystal Maiden, Hoodwink và nhiều nữa. Bộ vật phẩm cho Meepo và Drow Ranger đi cùng vật phẩm khiêu khích riêng.",
  "crownfall_treasure_item_0_name": "Phalanx of the Bronze Eagle",
  "crownfall_treasure_item_0_hero": "Kho báu I - Phổ biến",
  "crownfall_treasure_item_1_name": "Ravencloak",
  "crownfall_treasure_item_1_hero": "Kho báu II - Rất hiếm",
  "crownfall_treasure_item_1_sub": "Gồm vật phẩm khiêu khích riêng",
  "crownfall_treasure_item_2_name": "Blood Raven",
  "crownfall_treasure_item_2_hero": "Kho báu I - Phổ biến",
  "crownfall_treasure_item_3_name": "Thunderbird",
  "crownfall_treasure_item_3_hero": "Kho báu II - Hiếm",
  "crownfall_treasure_item_4_name": "Mocking Bird",
  "crownfall_treasure_item_4_hero": "Kho báu I - Rất hiếm",
  "crownfall_treasure_item_4_sub": "Gồm vật phẩm khiêu khích riêng",
  "crownfall_treasure_item_5_name": "Whispering Wings",
  "crownfall_treasure_item_5_hero": "Kho báu I - Hiếm",
  "crownfall_treasure_item_6_name": "Owly Bear",
  "crownfall_treasure_item_6_hero": "Kho báu II - Siêu hiếm",
  "crownfall_treasure_item_7_name": "Crown of the Condor",
  "crownfall_treasure_item_7_hero": "Kho báu I - Hiếm",
  "crownfall_treasure_item_8_name": "Verdant Swarm",
  "crownfall_treasure_item_8_hero": "Kho báu I - Phổ biến",
  "crownfall_treasure_item_9_name": "Birdfeed Bandit",
  "crownfall_treasure_item_9_hero": "Kho báu II - Hiếm",
  "crownfall_treasure_item_10_name": "Lionheart",
  "crownfall_treasure_item_10_hero": "Kho báu II - Phổ biến",
  "crownfall_treasure_item_11_name": "Baby Roshan - Người hầu của Scree'Auk",
  "crownfall_treasure_item_11_hero": "Kho báu I/II — Hiếm hy hữu",
  "crownfall_treasure_purchase_1": "Kho báu I - %1$s",
  "crownfall_treasure_purchase_2": "Kho báu II - %1$s",
  "crownfall_footer_act_1": "Hồi[br][b]I[/b]",
  "crownfall_footer_act_2": "Hồi[br][b]II[/b]",
  "crownfall_footer_act_3": "Hồi[br][b]III[/b]",
  "crownfall_footer_act_4": "Hồi[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "Khu chợ[br][b]Cổng Giữa[/b]",
  "crownfall_footer_act_2_name": "Sa mạc xứ[br][b]Druud[/b]",
  "crownfall_footer_act_3_name": "Băng giá[br][b]Icewrack[/b]",
  "crownfall_footer_act_4_name": "Tháp treo vùng[br][b]Skywrath[/b]",
  "crownfall_footer_act_play": "Chơi ngay",
  "crownfall_footer_act_unlocks_mid_may": "Mở khóa giữa tháng 5",
  "crownfall_footer_act_locked": "Đã khóa"
}