// 9831.js

{
  "language": "turkish",
  "crownfallcomic_title_cover": "Tahta Çıkma Günü - Kapak",
  "crownfallcomic_title": "Tahta Çıkma Günü - %1$s. sayfa",
  "crownfallcomic_help_text": "İLERLEMEK İÇİN RESME TIKLAYIN VEYA BOŞLUK TUŞUNU KULLANIN",
  "crownfallcomic_return_button": "Kapak sayfasına dön",
  "crownfall_title": "Tacın Düşüşü",
  "crownfall_welcome": "Dota oynayarak efsanevi kahramanlar ve benzersiz ödüllerle dolu hikâye etkinliğinde egzotik yerlerin, yeni karakterlerin ve karanlık sırların kilidini açın. Tüm Dota oyuncuları tarafından ücretsiz olarak erişilebilir.",
  "crownfall_newstory_title": "TAHTI GERİ ALIN",
  "crownfall_newstory_description": "Skywrath'ın meşru kraliçesi Shendelzare, kız kardeşi Imperia tarafından acımasızca tahtından indirildi. Imperia'nın seçkin büyücü muhafızlarının bir üyesi olan Dragonus'un gücü ve hayatı onun merhametine bağlıydı. Artık tanrıça Scree'Auk yardımıyla ikiliye yeni bir güç bahşedilmiş ve intikamlarını ve tahtı almak için son bir şansları olmuştur.",
  "crownfall_comic_title": "Hikâyenin arka planını öğrenin",
  "crownfall_comic_description": "Kraliçe Imperia, Scree'Auk'a tapınmayı yasakladı. Sürgün edilen ve Orta Geçit'in harabe manastırlarında saklanmak zorunda kalan tanrıça, Skywrath'ın kontrolünü yeniden ele geçirmek için son çare olarak bir komplo kurar.",
  "crownfall_comic_button": "ÇİZGİ ROMANI OKU",
  "crownfall_howtoplay_title": "MACERA SİZİ BEKLİYOR",
  "crownfall_howtoplay_description": "Shen ve Dragonus'a tahtı geri alma görevlerinde Skywrath'in kalabalık sokaklarında rehberlik edin! Yeni karakterler ve eski favorilerden oluşan bir kadroyla etkileşime geçin, karanlık sırları açığa çıkarın, sıra dışı yan görevleri yapın ve hatta ara sıra levrek tutmaya çıkın. Ayrıntılı ve etkileşimli dünya haritasında derinlere indikçe daha fazla ödül kazanın.",
  "crownfall_explainer_a_long": "[b]KEŞFEDİN.[/b] Tacın Düşüşü etkinliği süresince Dota oynayarak jetonlar kazanın. Farklı kahramanlarla oynamak farklı jeton türleri kazandırır.",
  "crownfall_explainer_b_long": "[b]KİLİDİNİ ​​AÇIN.[/b] Haritadaki yolların kilidini açmak, hikâyeyi ilerletmek ve ödüller kazanmak için jetonlarınızı kullanın. Jeton Tüccarı ve Şeker Dükkânı gibi önünüze çıkabilecek özel karşılaşmalara dikkat edin!",
  "crownfall_explainer_c_long": "[b]İNTİKAM ALIN.[/b] Şeytani kraliçe Imperia'yı tahtından etmek için savaşırken hazineler, şekerler, Tacın Düşüşü altınları ve daha fazlasını toplayın.",
  "crownfall_fouracts_title": "HİKÂYE ORTAYA ÇIKIYOR",
  "crownfall_fouracts_description": "Orta Geçit Pazarları, önümüzdeki birkaç aya yayılarak devam edecek dört bölümlük bir anlatının yalnızca ilk bölümüdür. Yeni bölümler yayınlandığı anda hemen oynayabilirsiniz ancak aynı zamanda macerada istediğiniz hızda da ilerleyebilirsiniz. Yeni bir bölümün başlaması, öncekileri kapatmaz. [br][br]Bu, ilk bölümde mümkün olan her rotayı, mücadeleyi ve sırrı istediğiniz kadar keşfedebileceğiniz anlamına gelir. Ve keşfedecek bu kadar çok şey olmasına rağmen bu etkinlik daha yeni başlıyor. Tacın Düşüşü önümüzdeki aylarda ilerledikçe daha da büyüyecek ve her yeni bölüm kendi hikâyesini, karakterlerini, benzersiz haritasını ve yepyeni ödülleri getirecek. Yol boyunca bir veya birkaç sürpriz de gerçekleşebilir.",
  "crownfall_rewards_title": "Ödüller",
  "crownfall_rewards_a": "Tacın Düşüşü Altınları",
  "crownfall_rewards_a_long_new": "Haritada farklı yolları keşfederek Tacın Düşüşü altınlarını kazanın. 10 adet altını Tacın Düşüşü mağazasından %1$s ve üzeri alışverişlerde kullanabileceğiniz %1$s değerinde indirim kuponu ile takas edebilirsiniz. (Kesin indirim miktarı bölgeye ve para birimine göre değişiklik gösterir.)",
  "crownfall_rewards_b": "HAZİNELER",
  "crownfall_rewards_b_long": "Birinci bölümde toplam 24 yeni eşya setini içeren iki farklı hazine bulunmaktadır. Bazı setleri sadece oynayarak açabileceksiniz!",
  "crownfall_rewards_c": "Şeker Çuvalları",
  "crownfall_rewards_c_long": "Her Tacın Düşüşü haritasında Sithil ve Quirt'in Şeker Karavanı'nı bulun, yükseltin ve şekerlerinizi setler, kuryeler, gözler ve daha fazlası ile değiştirin. (Nadiren gizemli eşyalar da bulunabilir!)",
  "crownfall_rewards_andmanymore": "Ve hepsi bu değil! Yepyeni yükleme ekranlarını keşfedin, ifadeler, spreyler ve yeni sohbet çarkı replikleriyle kendinizi ifade edin. Kahramanlarınızı hikâye yolları boyunca bulunan benzersiz eşya setleriyle donatın ve daha fazlasını yapın. Keşfetmeniz için koca bir dünya sizi bekliyor.",
  "crownfall_explorerpack_title": "ORTA GEÇİT KEŞİF PAKETİ",
  "crownfall_explorerpack_description": "Tacın Düşüşü'nün ana hikâyesindeki tüm ödüller ücretsiz olarak mevcuttur. Ancak birinci bölümün tüm sırlarını keşfetmek isteyen deneyimli maceracılar, Orta Geçit Keşif Paketi ile daha fazla hikâye, harita keşfi ve ödüllere erişebilir.",
  "crownfall_explorerpack_description_long": "Paketi satın almak haritadaki yan görevlerin ve özel ödüllerin kilidini açar. Keşif Paketi, ücretsiz olan ödüllere ek olarak hazineler, Tacın Tüşüşü yaratıkları, ölümsüz ve tamamlama eşyaları, mağaza eşyalarını indirimli almak için kullanılabilecek fazladan Tacın Düşüşü altınları ve daha fazlasını da verir.",
  "crownfall_explorerpack_purchase_act1_a": "Bölüm I",
  "crownfall_explorerpack_purchase_act1_b": "Yüksek Şato",
  "crownfall_explorerpack_purchase_act1_c": "Orta Geçit Keşif Paketi",
  "crownfall_explorerpack_purchase": "Satın Al: %1$s",
  "crownfall_arcanas_title": "GİZEMLİ EŞYALAR",
  "crownfall_arcanas_description": "Ölmek üzere olan tanrıça Scree'Auk, son gücünü Vengeful Spirit ve Skywrath Mage'e bir bedel karşılığında bahşetti: Skywrath'in hain kraliçesini devirmek için onun kara büyüsünü kullanmaları gerekiyor.",
  "crownfall_arcana_sm_hero": "Dragonus'un Sadakati",
  "crownfall_arcana_sm_a": "Model ve Taban",
  "crownfall_arcana_sm_a_long": "Dragonus, gerçek sadakatine yakışan tam bir eşya setiyle yepyeni bir modelin yanı sıra yeni bir taban ve açılabilir alternatif bir tarz kazandı.",
  "crownfall_arcana_sm_b": "ÖZEL ANİMASYONLAR VE EFEKTLER",
  "crownfall_arcana_sm_b_long": "Arcane Bolt, Concussive Shot, Ancient Seal ve Mystic Flare için özel simgeler ve efektler de dâhil olmak üzere, yepyeni bir animasyon ve çevre efektleri seti içerir.",
  "crownfall_arcana_sm_c": "Özel Kahraman Varlıkları",
  "crownfall_arcana_sm_c_long": "Yeni bir portre, mini harita simgesi ve üst çubuk portresinin yanı sıra saldırılar, öldürmeler, ölümler ve reddetmeler için yepyeni efektler ve Rod of Atos ve Phylactery için eşya simgeleri ve efektleri içerir.",
  "crownfall_arcana_sm_d": "GİZEMLİ EŞYA REPLİKLERİ",
  "crownfall_arcana_sm_d_long": "Imperia'nın etkisinden arınan Dragonus, şikâyetlerini dile getirmede yardımcı olacak yepyeni bir ses performansına sahip.",
  "crownfall_arcana_sm_purchase": "Satın Al: %1$s",
  "crownfall_arcana_sm_purchase_note": "Tacın Düşüşü altınları kullanılarak indirim yapılabilir.",
  "crownfall_arcana_sm_alternate_header": "AÇILABİLİR",
  "crownfall_arcana_sm_alternate_title": "ALTERNATİF TARZ",
  "crownfall_arcana_sm_alternate_desc": "Skywrath Mage'in alternatif gizemli eşya tarzını açmak için dördüncü bölümdeki ana görevi tamamlayın.",
  "crownfall_arcana_vs_hero": "Shen'in Dirilişi",
  "crownfall_arcana_vs_a": "Model ve Taban",
  "crownfall_arcana_vs_a_long": "Shendelzare kanatlarına yeniden kavuştu Skywrathli kraliyet ailesine layık yeni bir taban ve kilidi açılabilir iki alternatif tarzı da içeren tam bir eşya setine sahip yepyeni bir model kazandı.",
  "crownfall_arcana_vs_b": "ÖZEL ANİMASYONLAR VE EFEKTLER",
  "crownfall_arcana_vs_b_long": "Magic Missile, Wave of Terror, Nether Swap için özel simgeler ve efektlerin yanı sıra özel bir Vengeful Spirit illüzyonu efekti de dâhil olmak üzere, yepyeni bir animasyon ve çevre efektleri seti içerir.",
  "crownfall_arcana_vs_c": "Özel Kahraman Varlıkları",
  "crownfall_arcana_vs_c_long": "Yeni bir portre, mini harita simgesi ve üst çubuk portresinin yanı sıra saldırılar, öldürmeler, ölümler ve reddetmeler için yepyeni efektler ve Aghanim Scepter için özel simge ile Force Staff için eşya simgesi ve efektleri içerir.",
  "crownfall_arcana_vs_d": "GİZEMLİ EŞYA REPLİKLERİ",
  "crownfall_arcana_vs_d_long": "Kanatlarına yeniden kavuşan ve gözünü hakkı olan tahta diken Shendelzare, bedensel formunu yansıtan yepyeni bir ses performansına sahip.",
  "crownfall_arcana_vs_purchase": "Satın Al: %1$s",
  "crownfall_arcana_vs_purchase_note": "Tacın Düşüşü altınları kullanılarak indirim yapılabilir.",
  "crownfall_arcana_vs_alternate_header": "AÇILABİLİR",
  "crownfall_arcana_vs_alternate_title": "ALTERNATİF TARZLAR",
  "crownfall_arcana_vs_alternate_desc": "Dördüncü bölümdeki ana görevi tamamlayarak ilk alternatif tarzın kilidini açın. Tacın Düşüşü'ndeki tüm ana ve yan görevleri tamamlayarak ikinci alternatif tarzın kilidini açın.",
  "crownfall_treasures_title": "HAZİNELER",
  "crownfall_treasures_description": "Wraith King, Crystal Maiden, Hoodwink ve daha fazlası için nadir setler de dâhil olmak üzere en sevdiğiniz kahramanlardan bazıları için tamamen yeni eşya setleri. Meepo ve Drow Ranger setleri özel alay hareketleri içerir.",
  "crownfall_treasure_item_0_name": "Bronz Kartal Alayı",
  "crownfall_treasure_item_0_hero": "HAZİNE I - YAYGIN",
  "crownfall_treasure_item_1_name": "Kuzgun Pelerini",
  "crownfall_treasure_item_1_hero": "HAZİNE II - ÇOK NADİR",
  "crownfall_treasure_item_1_sub": "Özel Alay Hareketi İçerir",
  "crownfall_treasure_item_2_name": "Kan Kuzgunu",
  "crownfall_treasure_item_2_hero": "HAZİNE I - YAYGIN",
  "crownfall_treasure_item_3_name": "Yıldırım Kuşu",
  "crownfall_treasure_item_3_hero": "HAZİNE II - NADİR",
  "crownfall_treasure_item_4_name": "Alaycı Kuş",
  "crownfall_treasure_item_4_hero": "HAZİNE I - ÇOK NADİR",
  "crownfall_treasure_item_4_sub": "Özel Alay Hareketi İçerir",
  "crownfall_treasure_item_5_name": "Fısıldayan Kanatlar",
  "crownfall_treasure_item_5_hero": "HAZİNE I - NADİR",
  "crownfall_treasure_item_6_name": "Baykuş Ayı",
  "crownfall_treasure_item_6_hero": "HAZİNE II - ULTRA NADİR",
  "crownfall_treasure_item_7_name": "Akbabanın Tacı",
  "crownfall_treasure_item_7_hero": "HAZİNE I - NADİR",
  "crownfall_treasure_item_8_name": "Yeşil Sürü",
  "crownfall_treasure_item_8_hero": "HAZİNE I - YAYGIN",
  "crownfall_treasure_item_9_name": "Eşkıya Kuş",
  "crownfall_treasure_item_9_hero": "HAZİNE II - NADİR",
  "crownfall_treasure_item_10_name": "Aslan Yürek",
  "crownfall_treasure_item_10_hero": "HAZİNE II - YAYGIN",
  "crownfall_treasure_item_11_name": "Scree'Auk Hizmetkârı Bebek Roshan",
  "crownfall_treasure_item_11_hero": "HAZİNE I/II - KOZMİK DERECEDE NADİR",
  "crownfall_treasure_purchase_1": "Hazine I - %1$s",
  "crownfall_treasure_purchase_2": "Hazine II - %1$s",
  "crownfall_footer_act_1": "Bölüm[br][b]I[/b]",
  "crownfall_footer_act_2": "Bölüm[br][b]II[/b]",
  "crownfall_footer_act_3": "Bölüm[br][b]III[/b]",
  "crownfall_footer_act_4": "Bölüm[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "[b]ORTA GEÇİT[/b][br]PAZARLARI",
  "crownfall_footer_act_2_name": "[b]DRUUD[/b][br]ÇÖLLERİ",
  "crownfall_footer_act_3_name": "[b]Icewrack[/b][br]Buzulları",
  "crownfall_footer_act_4_name": "[b]SKYWRATH[/b][br]KULELERİ",
  "crownfall_footer_act_play": "ŞİMDİ OYNA",
  "crownfall_footer_act_unlocks_mid_may": "Mayıs Ortasında Açılacak",
  "crownfall_footer_act_locked": "KİLİTLİ"
}