// 6708.js

{
  "language": "romanian",
  "crownfallcomic_title_cover": "Ziua Ascensiunii - Copertă",
  "crownfallcomic_title": "Ziua Ascensiunii - Pagina %1$s",
  "crownfallcomic_help_text": "Apasă pe imagine sau tasta spațiu pentru a continua",
  "crownfallcomic_return_button": "Întoarce-te la copertă",
  "crownfallcomic_act1_intro_title_cover": "Ziua Ascensiunii - Copertă",
  "crownfallcomic_act1_intro_title": "Ziua Ascensiunii - Pagina %1$s",
  "crownfallcomic_act2_intro_title_cover": "Bătălia de la Bazinul Iadului - Copertă",
  "crownfallcomic_act2_intro_title": "Bătălia de la Bazinul Iadului - Pagina %1$s",
  "crownfallcomic_act3_intro_title_cover": "Dragonul - Copertă",
  "crownfallcomic_act3_intro_title": "Dragonul - Pagina %1$s",
  "crownfall_title": "Căderea Coroanei",
  "crownfall_welcome": "Joacă Dota pentru a debloca locații exotice, personaje noi și secrete sumbre în cadrul unui eveniment a cărui poveste va fi dezvăluită pe parcursul mai multor luni și care este plină de eroi legendari și recompense unice. Eveniment disponibil acum în mod gratuit pentru toți jucătorii de Dota.",
  "crownfall_newstory_title": "Revendică tronul",
  "crownfall_newstory_description": "Shendelzare, regina de drept din Skywrath, a fost detronată cu brutalitate de către sora sa, Imperia. În calitate de membru al gărzii de magi de elită a Imperiei, puterile și viața acestuia se aflau la mila ei. Acum, cu ajutorul zeiței Scree'Auk, Shendelzare și Dragonus au primit noi puteri și o ultimă șansă de a se răzbuna... și a recâștiga tronul.",
  "crownfall_comic_title": "Află cum s-a ajuns aici",
  "crownfall_comic_description": "Regina Imperia a interzis venerarea zeiței Scree'Auk. Forțată să se ascundă în mahalalele Târgului de Mijloc, zeița destituită elaborează un plan disperat pentru a recâștiga controlul asupra Skywrath.",
  "crownfall_comic_button": "Citește benzile desenate",
  "crownfall_howtoplay_title": "Aventura te așteaptă",
  "crownfall_howtoplay_description": "Îndrumă-i pe Dragonus și pe Shen pe străzile aglomerate din Skywrath în încercarea lor de a recâștiga tronul! Întâlnește noi personaje și personaje mai vechi pe care le îndrăgești, descoperă secrete sumbre și aventurează-te în misiuni secundare incredibile și relaxează-te ocazional la pescuit. Obține mai multe recompense pe parcurs ce explorezi și mai mult harta interactivă.",
  "crownfall_explainer_a_long": "[b]Explorează[/b] – meciurile de Dota pe care le joci pe durata evenimentului Căderea Coroanei îți vor acorda jetoane. Fiecare erou îți va oferi diferite tipuri de jetoane.",
  "crownfall_explainer_b_long": "[b]DEBLOCHEAZĂ[/b] – folosește jetoanele pentru a debloca trasee pe harta regiunii, a progresa în cadrul poveștii și a obține recompense. Atenție la întâlnirile speciale, precum cele cu negustorul de jetoane și cele cu caravana atelierului de bomboane!",
  "crownfall_explainer_c_long": "[b]RĂZBUNĂ-TE[/b] – obține comori, bomboane, monede pentru evenimentul Căderea Coroanei și multe altele pe parcurs ce lupți pentru a o detrona pe malefica Regină Imperia.",
  "crownfall_fouracts_title": "Povestea continuă",
  "crownfall_fouracts_description": "„Piețele Târgului de Mijloc” reprezintă doar primul act al unei povești compuse din patru acte care se va desfășura în următoarele câteva luni. Vei putea juca noile acte de îndată ce acestea vor deveni disponibile, însă ai posibilitatea de a progresa în propriul tău ritm, deoarece actele precedente vor putea fi accesate în continuare atunci când un act nou va deveni disponibil. [br][br]Asta înseamnă că ai libertatea de a explora oricât de mult dorești fiecare traseu posibil, fiecare provocare și fiecare secret din primul act. Nu uita totuși că acesta reprezintă doar începutul. Mai mult conținut va deveni disponibil pe parcursul lunilor următoare, iar fiecare act nou va veni cu propria sa poveste, propriile personaje, o hartă unică a regiunii respective și recompense nou-nouțe. Este posibil să te aștepte și câteva surprize în acestă aventură.",
  "crownfall_rewards_title": "Recompense",
  "crownfall_rewards_a": "Monedele evenimentului Căderea Coroanei",
  "crownfall_rewards_a_long_new": "Obține monedele evenimentului explorând diverse trasee de pe hartă. Strânge 10 monede pentru a le oferi la schimb în magazinul Căderea Coroanei pentru o reducere de aproximativ %1$s pentru orice obiect care costă cel puțin %1$s. (Reducerea exactă variază în funcție de regiune și moneda locală.)",
  "crownfall_rewards_b": "Comori",
  "crownfall_rewards_b_long": "Actul I include două cufere diferite cu comori, însumând în total 24 de seturi noi de obiecte. Vei putea juca meciuri pentru a debloca unele seturi!",
  "crownfall_rewards_c": "Săculeți cu bomboane",
  "crownfall_rewards_c_long": "Găsește atelierul de bomboane al lui Sithil și Quirt de pe fiecare hartă a evenimentului pentru a-l îmbunătăți și a-ți oferi bomboanele la schimb pentru seturi de obiecte, curieri, warduri și multe altele. (Ai inclusiv o șansă rară de a obține obiecte Arcana!)",
  "crownfall_rewards_andmanymore": "Și asta nu e tot! Obține ecrane de încărcare nou-nouțe, exprimă-te cu ajutorul emoticoanelor, graffitiurilor și replicilor pentru rotița de chat, echipează-ți eroii cu seturi unice de obiecte pe care le deblochezi parcurgând povestea și nu numai. O întreagă lume așteaptă să fie explorată.",
  "crownfall_explorerpack_title": "Pachetul de expediție al Târgului de Mijloc",
  "crownfall_explorerpack_description": "Toate recompensele disponibile pe traseul poveștii principale a evenimentului Căderea Coroanei vor fi disponibile tuturor jucătorilor în mod gratuit. Pentru aventurierii experimentați care-și doresc să cerceteze mai mult primul act, pachetul de expediție al Târgului de Mijloc le oferă acces extins la hartă, povești suplimentare și mai multe recompense.",
  "crownfall_explorerpack_description_long": "Achiziționând pachetul vei obține acces la misiuni secundare și recompense speciale de pe hartă. Pe lângă recompensele disponibile pe traseul gratuit, pachetul îți permite să revendici comori suplimentare, recompense cu tematica evenimentului (creepi, obiecte Immortal, obiecte pentru finalizarea misiunilor), monede suplimentare pentru magazinul Căderea Coroanei care pot fi utilizate pentru a beneficia de reduceri la obiectele din magazin și o mulțime de alte beneficii.",
  "crownfall_explorerpack_purchase_act1_a": "Actul I",
  "crownfall_explorerpack_purchase_act1_b": "Cuibul",
  "crownfall_explorerpack_purchase_act1_c": "Pachetul de expediție al Târgului de Mijloc",
  "crownfall_explorerpack_purchase": "Achiziționează - %1$s",
  "crownfall_arcanas_title": "Arcana",
  "crownfall_arcanas_description": "Zeița muribundă Scree'Auk i-a înzestrat pe Vengeful Spirit și Skywrath Mage cu ultimele puteri ale sale, însă cu un preț: aceștia trebuie să folosească magia neagră a acesteia pentru a o detrona pe regina trădătoare a Skywrath.",
  "crownfall_arcana_sm_hero": "The Devotions of Dragonus",
  "crownfall_arcana_sm_a": "Model și piedestal",
  "crownfall_arcana_sm_a_long": "Pentru devotamentul său, Dragonus a primit un model nou-nouț, un piedestal nou și un set complet de obiecte cu un stil alternativ ce poate fi deblocat.",
  "crownfall_arcana_sm_b": "Efecte și animații personalizate",
  "crownfall_arcana_sm_b_long": "Conține un set complet de animații și efecte ambientale nou-nouțe, inclusiv pictograme și efecte personalizate pentru Arcane Bolt, Concussive Shot, Ancient Seal și Mystic Flare.",
  "crownfall_arcana_sm_c": "Elemente grafice personalizate pentru erou",
  "crownfall_arcana_sm_c_long": "Include un portret nou, o pictogramă pentru minihartă, un portret pentru bara de sus a interfeței de joc, efecte nou-nouțe pentru atacuri, ucideri, decese și sacrificări, plus pictograme și efecte pentru obiectele Rod of Atos și Phylactery.",
  "crownfall_arcana_sm_d": "Replici exclusive",
  "crownfall_arcana_sm_d_long": "Eliberat de influența Imperiei, Dragonus beneficiază acum de o interpretare vocală complet nouă pentru a-și exprima nemulțumirile.",
  "crownfall_arcana_sm_purchase": "Achiziționează - %1$s",
  "crownfall_arcana_sm_purchase_note": "Reducere disponibilă în schimbul monedelor Căderea Coroanei",
  "crownfall_arcana_sm_alternate_header": "Deblocabil",
  "crownfall_arcana_sm_alternate_title": "Stil alternativ",
  "crownfall_arcana_sm_alternate_desc": "Finalizează misiunea principală din actul IV pentru a debloca stilul alternativ pentru Arcana lui Skywrath Mage.",
  "crownfall_arcana_vs_hero": "The Resurrection of Shen",
  "crownfall_arcana_vs_a": "Model și piedestal",
  "crownfall_arcana_vs_a_long": "Shendelzare și-a recăpătat aripile și a primit un model nou-nouț alături de set complet de obiecte demn de regalitatea Skywrath, inclusiv un piedestal nou și două stiluri alternative ce pot fi deblocate.",
  "crownfall_arcana_vs_b": "Efecte și animații personalizate",
  "crownfall_arcana_vs_b_long": "Conține un set complet de animații și efecte ambientale nou-nouțe, inclusiv pictograme și efecte personalizate pentru Magic Missile, Wave of Terror, Nether Swap și un efect personalizat pentru iluzia de la abilitatea Vengeful Aura.",
  "crownfall_arcana_vs_c": "Elemente grafice personalizate pentru eroină",
  "crownfall_arcana_vs_c_long": "Include un portret nou, o pictogramă pentru minihartă, un portret pentru bara de sus a interfeței de joc, efecte nou-nouțe pentru atacuri, ucideri, decese și sacrificări, plus o pictogramă și efecte pentru Force Staff, dar și o pictogramă personalizată pentru Aghanim's Scepter.",
  "crownfall_arcana_vs_d": "Replici exclusive",
  "crownfall_arcana_vs_d_long": "Cu aripile recăpătate și cu ochii pe tronul ei de drept, Shendelzare beneficiază acum de o interpretare vocală complet nouă care reflectă forma sa corporală din lumea reală.",
  "crownfall_arcana_vs_purchase": "Achiziționează - %1$s",
  "crownfall_arcana_vs_purchase_note": "Reducere disponibilă în schimbul monedelor Căderea Coroanei",
  "crownfall_arcana_vs_alternate_header": "Deblocabile",
  "crownfall_arcana_vs_alternate_title": "Stiluri alternative",
  "crownfall_arcana_vs_alternate_desc": "Finalizează misiunea principală din actul IV pentru a debloca primul stil alternativ. Finalizează toate misiunile principale și toate misiunile secundare ale evenimentului Căderea Coroanei pentru a debloca al doilea stil alternativ.",
  "crownfall_treasures_title": "Comori",
  "crownfall_treasures_description": "Seturi nou-nouțe de obiecte pentru câțiva dintre eroii tăi preferați, inclusiv seturi rare pentru Wraith King, Crystal Maiden, Hoodwink și mulți alții. Seturile de obiecte pentru Meepo și Drow Ranger vin cu batjocuri personalizate.",
  "crownfall_treasure_item_0_name": "Phalanx of the Bronze Eagle",
  "crownfall_treasure_item_0_hero": "Comoara I - Obișnuit",
  "crownfall_treasure_item_1_name": "Ravencloak",
  "crownfall_treasure_item_1_hero": "Comoara I - Foarte rar",
  "crownfall_treasure_item_1_sub": "Include o batjocură personalizată",
  "crownfall_treasure_item_2_name": "Blood Raven",
  "crownfall_treasure_item_2_hero": "Comoara I - Obișnuit",
  "crownfall_treasure_item_3_name": "Thunderbird",
  "crownfall_treasure_item_3_hero": "Comoara II - Rar",
  "crownfall_treasure_item_4_name": "Mocking Bird",
  "crownfall_treasure_item_4_hero": "Comoara I - Foarte rar",
  "crownfall_treasure_item_4_sub": "Include o batjocură personalizată",
  "crownfall_treasure_item_5_name": "Whispering Wings",
  "crownfall_treasure_item_5_hero": "Comoara I - Rar",
  "crownfall_treasure_item_6_name": "Owly Bear",
  "crownfall_treasure_item_6_hero": "Comoara II - Extrem de rar",
  "crownfall_treasure_item_7_name": "Crown of the Condor",
  "crownfall_treasure_item_7_hero": "Comoara I - Rar",
  "crownfall_treasure_item_8_name": "Verdant Swarm",
  "crownfall_treasure_item_8_hero": "Comoara I - Obișnuit",
  "crownfall_treasure_item_9_name": "Birdfeed Bandit",
  "crownfall_treasure_item_9_hero": "Comoara II - Rar",
  "crownfall_treasure_item_10_name": "Lionheart",
  "crownfall_treasure_item_10_hero": "Comoara II - Obișnuit",
  "crownfall_treasure_item_11_name": "Servant of Scree'Auk Baby Roshan",
  "crownfall_treasure_item_11_hero": "Comoara I/II - Foarte rcosmic de rar",
  "crownfall_treasure_purchase_1": "Comoara I - %1$s",
  "crownfall_treasure_purchase_2": "Comoara II - %1$s",
  "crownfall_footer_act_1": "Actul[br][b]I[/b]",
  "crownfall_footer_act_2": "Actul[br][b]II[/b]",
  "crownfall_footer_act_3": "Actul[br][b]III[/b]",
  "crownfall_footer_act_4": "Actul[br][b]IV[/b]",
  "crownfall_footer_act_1_name": "Piețele din[br][b]Târgul de Mijloc[/b]",
  "crownfall_footer_act_2_name": "Deșerturile din[br][b]Druud[/b]",
  "crownfall_footer_act_3_name": "Ghețarii din[br][b]Icewrack[/b]",
  "crownfall_footer_act_4_name": "Pintenii din[br][b]Skywrath[/b]",
  "crownfall_footer_act_play": "Joacă acum",
  "crownfall_footer_act_unlocks_mid_may": "Jumătatea lunii mai",
  "crownfall_footer_act_locked": "Blocat"
}