// 6330.js

{
  "language": "portuguese",
  "international2023_compendium_activity": "Atividade para proprietários do Compêndio",
  "international2023_update_title": "Comemoração do International 2023",
  "international2023_update_subtitle": "De fanáticos pela cena profissional a jogadores casuais, esta atualização tem algo para todos.",
  "international2023_update_body": "Quer sejas alguém que acompanha cada segundo intenso de todas as partidas do International ou alguém que mal sabe que há pessoas a jogar isto como se fosse um emprego e só quer apreciar o Dota em paz, continua a ler: esta atualização tem algo para ti.\\n\\nÉs fã de eSports? Cria o teu próprio plantel de jogadores profissionais na nova versão da <b>Liga de Sonho</b>. Preferes analisar números? Experimenta os prognósticos no <b>Desafio do Oracle</b>. Tens saudades dos jogos que jogavas com a tua tia‑avó? É que até temos <b>Bingo</b> este ano!\\n\\nMas talvez não sejas fã de nenhuma destas coisas. Talvez sejas apenas fã das coisas que fazes no Dota 2? Nesse caso, temos algo para ti também: a <b>Galeria do Perfil</b>. Agora, o teu perfil é um monumento interativo em tua homenagem, que destaca itens e façanhas do teu historial no Dota 2 que queiras apresentar.",
  "international2023_update_footer": "Chegaste ao fim da atualização. Bom trabalho!",
  "international2023_compendium": "Compêndio",
  "international2023_compendium_title": "Compêndio do International 2023",
  "international2023_compendium_intro": "O Compêndio é o teu companheiro digital interativo para <b>O Caminho para o International 2023</b> e o <b>International 2023</b>.\\n\\nJoga como um profissional no Desafio do Caminho para o TI. Escolhe os teus jogadores favoritos numa versão atualizada do Dota de Sonho. Testa os teus poderes de adivinhação nos prognósticos dos grupos e das fases do torneio. Vê se te sai a sorte grande nos novos cartões de Bingo.\\n\\nPensa no Compêndio como se fosse uma central de atividades, desafios e todas as recompensas relacionadas com o evento deste ano. Além disso, 25% dos lucros de todas as vendas irão contribuir para o prémio total do International 2023.",
  "international2023_showcase_title": "Galeria do Perfil",
  "international2023_showcase_subtitle": "Nova funcionalidade para todos os jogadores de Dota 2",
  "international2023_showcase_intro": "O perfil e o miniperfil foram totalmente remodelados para todos os utilizadores (ou melhor, para 98% dos jogadores, aqueles que têm uma pontuação de comunicação acima dos 6000). Agora, podes exibir todos os teus itens e façanhas do Dota 2 (literalmente qualquer coisa do teu inventário) com a nova Galeria do Perfil.\\n\\nQueres criar um altar para a tua equipa profissional favorita de 2016? Força. E que tal uma coleção dos teus conjuntos favoritos? Também podes. Ou uma montra com TODOS os pares de sapatos disponíveis para o Kunkka? Não vamos perguntar porque haverias de querer fazer isso, mas sim, é possível. Infelizmente.",
  "international2023_showcase_profile_title": "Perfil atualizado",
  "international2023_showcase_profile_desc": "Tu és Miguel Ângelo e o perfil é a tua tela. A tua imaginação (e um mínimo de bom senso) é o limite!",
  "international2023_showcase_mini_profile_title": "Miniperfil atualizado",
  "international2023_showcase_mini_profile_desc": "Os miniperfis são como os perfis, mas com uma diferença crucial: são mais pequenos. Desta não estavas à espera! Os outros jogadores irão ver o teu miniperfil sempre que passarem o cursor do rato sobre o teu nome.",
  "international2023_showcase_carousel_title": "Exemplos de galerias",
  "international2023_showcase_items_title": "Destaca itens",
  "international2023_showcase_items_desc": "Personaliza as tuas galerias com uma enorme seleção de todos os itens e recompensas que tens estado a colecionar ao longo dos anos.",
  "international2023_showcase_item_heroes_title": "Heróis",
  "international2023_showcase_item_trophies_title": "Troféus",
  "international2023_showcase_item_stickers_title": "Autocolantes",
  "international2023_showcase_item_stats_title": "Estatísticas",
  "international2023_showcase_item_chat_wheels_title": "Mensagens da Chat Wheel",
  "international2023_showcase_item_sprays_title": "Sprays",
  "international2023_showcase_item_items_title": "Itens do Arsenal",
  "international2023_showcase_item_emoticons_title": "Emoticons",
  "international2023_showcase_item_loading_screens_title": "Ecrãs de Loading",
  "international2023_showcase_item_couriers_title": "Estafetas",
  "international2023_showcase_item_wards_title": "Wards",
  "international2023_tournament_prize_pool": "Prémio total",
  "international2023_tournament_prize_pool_percent": "25% dos lucros de todas as vendas do Compêndio do International 2023 irão contribuir para o prémio total do International 2023.",
  "international2023_tournament_learn_more": "Fica a saber mais sobre o torneio",
  "international2023_quests_title": "Desafio do Caminho para o International",
  "international2023_quests_intro": "Viste os profissionais a jogar. Torceste por eles. Agora, joga como um. Senta‑te na cadeira gaming dos teus jogadores favoritos e recria os melhores momentos deles no ano passado. Vence com o mesmo herói de uma partida específica ou como um dos cinco heróis que eles usaram num dos meses da temporada. Ganhas pontos por cada desafio e ainda mais pontos por concluíres conjuntos de desafios.",
  "international2023_quests_match_title": "Desafios de partida",
  "international2023_quests_match_desc": "Vence com um herói de uma partida profissional real.",
  "international2023_quests_pro_title": "Desafios de jogador",
  "international2023_quests_pro_desc": "Vence com um dos heróis mais usados por um jogador profissional.",
  "international2023_quests_rewards_title": "Ganha recompensas",
  "international2023_quests_rewards_desc": "Ganha pontos do Compêndio para desbloqueares ainda mais recompensas.",
  "international2023_fantasy_title": "A evolução do Dota de Sonho",
  "international2023_fantasy_intro": "Cria uma equipa com os teus jogadores profissionais favoritos. Personaliza as estatísticas que acreditas serem mais valiosas. Compete com jogadores do mundo inteiro para veres quem consegue ganhar mais pontos. É o Dota de Sonho de que te lembras, mas completamente remodelado.",
  "international2023_fantasy_players_title": "Escolhe",
  "international2023_fantasy_players_desc": "Escolhe o teu Core, Mid e Support favoritos.",
  "international2023_fantasy_craft_title": "Personaliza",
  "international2023_fantasy_craft_desc": "Usa fichas de renovação obtidas entre as recompensas do Compêndio e tenta obter as melhores estatísticas para os teus jogadores. Mas pensa bem, pois algumas estatísticas são melhores para alguns jogadores do que outros.",
  "international2023_fantasy_compete_title": "Compete",
  "international2023_fantasy_compete_desc": "Cada fim de semana do torneio é uma ronda separada, logo terás várias oportunidades de competir contra os teus amigos e o resto do mundo. Podes ganhar pontos para o Compêndio e, se ficares entre os participantes com mais pontos, um troféu exclusivo.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Começas a ficar com as emoções ao rubro sempre que uma equipa profissional compra uma Divine Rapier? Quando já passam dos 80 minutos da partida e as coisas começam a ficar esquisitas? Ou então quando uma equipa de heróis com 16 pernas entrenta outra com apenas 4?\\n\\nBem, prepara‑te para fazer essas emoções render. O Bingo está aqui para que possas beneficiar de alguns eventos mesmo loucos.",
  "international2023_bingo_cards_title": "UM CARTÃO DE BINGO POR FIM DE SEMANA",
  "international2023_bingo_cards_desc": "Todos os proprietários de um Compêndio irão receber um cartão de bingo gerado aleatoriamente para cada fim de semana do torneio. Cada quadrado do cartão contém uma condição estranha ou uma situação interessante que vais torcer para que aconteça enquanto os profissionais competem.",
  "international2023_bingo_rewards_title": "Completa linhas e ganha pontos",
  "international2023_bingo_rewards_desc": "É isso mesmo, não te deixes enganar pelos deuses, demónios e animais silvestres armados até aos dentes: isto não é nada mais do que bingo. Quando completares uma linha, coluna ou diagonal no teu cartão de bingo, irás receber pontos do Compêndio como recompensa. Atenção: gritar \"BINGO\" é opcional, mas recomendado.",
  "international2023_predictions_title": "Desafio do Oracle",
  "international2023_predictions_intro": "O Oracle usa magia astral umbilical para ver o futuro. Não queremos arruinar‑te o dia, mas magia umbilical não existe. Vais ter de usar a tua astúcia, o teu conhecimento de eSports e, acima de tudo, os teus melhores palpites para alcançares o sucesso.\\n\\nPrevê (como o Oracle, mas sem a magia umbilical) quais das equipas irão avançar e quais serão eliminadas em cada fim de semana do torneio. Palpites corretos (queremos dizer, adivinhações dignas do Oracle) valem pontos do Compêndio.",
  "international2023_predictions_group_stage_title": "Faz palpites para a fase de grupos",
  "international2023_predictions_group_stage_desc": "Pela primeira vez, podes tentar prever a ordem das equipas em cada grupo.",
  "international2023_predictions_ingame_title": "Prognósticos no jogo",
  "international2023_predictions_ingame_desc": "Enquanto assistes no jogo ou no Twitch, testa os teus poderes de adivinhação antes do som de início da partida. Irás ganhar pontos do Compêndio por cada prognóstico certeiro, até a um máximo de seis por dia.",
  "international2023_rewards_title": "Recompensas do Compêndio",
  "international2023_rewards_intro": "Se és fã do mundo competitivo do Dota e de receber recompensas por seres fã do mundo competitivo do Dota, as recompensas deste ano são para ti. O Compêndio de 2023 é centrado exclusivamente no International 2023 e na cena profissional do Dota 2.",
  "international2023_rewards_physical_aegis_title": "Modelo físico da Égide",
  "international2023_rewards_physical_aegis_desc": "Uma réplica em liga de níquel à escala de 1:5 do famoso prémio dos campeões. Exibe‑a com orgulho! Exibe‑a só porque sim! Derrete‑a e cria a tua própria moeda!",
  "international2023_rewards_chat_wheels_title": "Sons da Chat Wheel permanentes",
  "international2023_rewards_chat_wheels_desc": "Ao contrário dos anos anteriores, todos os sons da Chat Wheel são agora permanentes. Como acabámos de dizer no título. Sim, esta descrição é um pouco redundante. Mas é bom podermos passar mais tempo contigo.",
  "international2023_rewards_stickers_title": "Autocolantes dos jogadores e das equipas",
  "international2023_rewards_stickers_desc": "\"Só autocolantes dos jogadores?\" Nem terminaste de ler o título, pois não? Também há autocolantes das equipas. Francamente, estes parágrafos são como plástico‑bolha que protege o título na entrega para os teus olhos.",
  "international2023_rewards_hud_title": "Tema de HUD do International 2023",
  "international2023_rewards_hud_desc": "O último parágrafo pode ter assustado algumas pessoas ao ponto de não quererem ler este. Por isso, se ainda não te foste embora, parabéns. Era tudo um teste e passaste. Porque temos umas informações que não estavam no título: o novo tema de HUD é inspirado no visual de vitrais deste ano.",
  "international2023_rewards_loading_screens_title": "Ecrãs de Loading",
  "international2023_rewards_loading_screens_desc": "Irás receber um ecrã de loading com o tema de vitrais para cada equipa, assim como algumas das imagens promocionais do International deste ano.",
  "international2023_rewards_materials_title": "Ferramentas no Dota de Sonho e no Desafio do Caminho para o TI",
  "international2023_rewards_materials_desc": "Usa ferramentas para criares jogadores melhores no Dota de Sonho ou progredires com mais facilidade no Desafio do Caminho para o TI.",
  "international2023_rewards_teleport_fx_title": "Efeitos de teletransporte da equipa favorita",
  "international2023_rewards_teleport_fx_desc": "Exibe a tua equipa favorita no jogo com efeitos de teletransporte exclusivos com três níveis diferentes.",
  "international2023_rewards_Types_title": "Tipos de recompensa",
  "international2023_rewards_Types_desc": "Cada tipo de recompensa tem a sua própria barra de progresso. Quando a barra de uma recompensa estiver cheia, podes reclamá‑la. Algumas barras podem ser preenchidas quantas vezes quiseres, enquanto outras têm um limite.",
  "international2023_rewards_Levels_title": "Níveis para o Compêndio",
  "international2023_rewards_Levels_desc": "Ganha níveis para o Compêndio ao participares nas atividades ou ao comprares packs de níveis. Aplica os níveis para aumentares a barra de progresso de TODOS os tipos de recompensas.",
  "international2023_rewards_Boosters_title": "Boosters",
  "international2023_rewards_Boosters_desc": "Os boosters são como os níveis para o Compêndio, mas só aumentam a barra de uma recompensa específica. Aplicar um booster a uma recompensa também concede progresso para a Égide de Colecionador.",
  "international2023_supporters_clubs_title": "Claques",
  "international2023_supporters_clubs_subtitle": "Apoia diretamente as tuas equipas favoritas",
  "international2023_supporters_clubs_intro": "As recompensas de Claques são como as alegrias da juventude: aproveita‑as enquanto podes, porque não duram para sempre. Ou duravam. Porque, a partir de agora, são permanentes! Agora podes aproveitá‑las eternamente. A não ser que um autocarro te atropele.\\n\\n Melhor ainda: 50% dos lucros de todas as vendas revertem a favor da equipa. Quer dizer, \"melhor ainda\", para as equipas. A primeira parte é que é melhor para ti.",
  "international2023_supporters_clubs_tiers_title": "Três níveis de apoio",
  "international2023_supporters_clubs_tiers_desc": "Escolhe o patamar de Bronze, Prata ou Ouro da Claque das tuas equipas favoritas para ganhares recompensas criadas por essas organizações.",
  "international2023_talent_title": "Autocolantes de talentos",
  "international2023_talent_subtitle": "Apoia diretamente os teus talentos favoritos",
  "international2023_talent_intro": "Comentar eventos de eSports em tempo real é difícil. Não tão difícil como trabalhar nas minas, claro, mas é mais difícil do que tricotar coisas no Etsy. Bem, depende. Aquelas camisolas coloridas de croché parecem complicadas de se fazer. \\n\\n Agora podes enviar uma mensagem para a tua personalidade favorita a dizer \"Ei... eu respeito o que fazes. Não tanto como respeito um mineiro, mas mais do que, tipo, 50% das pessoas no Etsy\". Por falar em 50%, metade das receitas provenientes da venda dos autocolantes de talentos revertem diretamente a favor da personalidade relacionada.",
  "international2023_talent_tiers_title": "Escolhe um patamar",
  "international2023_talent_tiers_desc": "Compra pacotes de recompensas dos teus talentos favoritos, que contêm autocolantes, mensagens de voz e autógrafos dependendo do patamar comprado.",
  "international2023_talent_coming_soon": "Os pacotes de talentos estarão disponíveis para compra assim que revelarmos os talentos.",
  "international2023_coming_soon": "Disponível em breve",
  "ti12_bp_countdown_header": "Até à fase de grupos",
  "ti12_bp_countdown_desc": "Assiste ao maior torneio de eSports do ano em direto de Seattle. A Égide dos Campeões está em jogo!",
  "ti12_bp_tournament_complete_desc": "Volta a viver o furor do maior torneio de eSports do ano. Toda a ação de Seattle está à distância de um clique.",
  "ti12_group_stage_venue": "Online",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Apoia o torneio",
  "ti12_compendium_header": "Compêndio do International 2023",
  "ti12_compendium_desc": "Desbloqueia ainda mais da temporada do torneio com o Compêndio do International 2023. Joga como um profissional no Desafio do Caminho para o TI. Cria um plantel com os teus jogadores favoritos numa versão atualizada do Dota de Sonho. Testa os teus poderes de adivinhação no Desafio do Oracle. E torce para que as equipas façam coisas esquisitas no inédito Bingo.\\n\\nGanha recompensas, como autocolantes dos jogadores e das equipas, sons para a Chat Wheel, um tema de HUD exclusivo e muito mais, até uma réplica física da Égide dos Campeões.\\n\\n25% dos lucros de todas as vendas do Compêndio irão contribuir diretamente para o prémio total do International.",
  "ti12_compendium_standard": "Compêndio Básico",
  "ti12_compendium_upgraded": "Compêndio Melhorado"
}