// 6684.js

{
  "language": "polish",
  "ringmastercomic_title_cover": "Kukła – okładka",
  "ringmastercomic_title": "Kukła – strona nr %1$s",
  "ringmastercomic_help_text": "Kliknij obraz albo użyj spacji, aby przejść dalej",
  "ringmastercomic_return_button": "Wróć na stronę okładki",
  "ti13_online": "Kopenhaga",
  "ti13_main_event_venue": "Royal Arena – Kopenhaga",
  "ti13_best_of_three": "Do 2 wygranych",
  "ti13_best_of_five": "Do 3 wygranych",
  "ti13_group_stage_sp_rules": "Faza grupowa – zasady rozstrzygania priorytetu",
  "ti13_group_stage_sp_game1": "Rzut monetą.",
  "ti13_group_stage_sp_game2": "Pierwsza gra: zwycięzca w rzucie monetą wybiera między doborem bohaterów a stroną.",
  "ti13_group_stage_sp_game3": "Druga gra: przegrany w rzucie monetą wybiera między doborem bohaterów a stroną.",
  "ti13_group_stage_sp_game4": "Trzecia gra (jeśli ma zastosowanie): nowy rzut monetą. Zwycięzca w rzucie monetą wybiera między doborem bohaterów a stroną.",
  "ti13_group_stage_tie_rules": "Faza grupowa – zasady meczów rozstrzygających",
  "ti13_first_second_tie": "Dwie drużyny remisują na 1. i 2. miejscu",
  "ti13_second_third_tie": "Dwie drużyny remisują na 2. i 3. miejscu",
  "ti13_third_fourth_tie": "Dwie drużyny remisują na 3. i 4. miejscu",
  "ti13_three_way_first_tie": "Trzy drużyny remisują na 1. miejscu",
  "ti13_three_way_second_tie": "Trzy drużyny remisują na 2. miejscu",
  "ti13_four_way_tie": "Cztery drużyny remisują na 1. miejscu",
  "ti13_tie_resolve_bo3": "Rozstrzygane poprzez mecz do 2 wygranych.",
  "ti13_tie_resolve_third_fourth": "Nie są rozgrywane żadne dalsze gry. Obydwie drużyny pozostają w remisie na 3. i 4. miejscu.",
  "ti13_tie_resolve_first_with_round_robin": "Rozstrzygnięcie 1. miejsca następuje poprzez rozgrywanie jednego meczu na zasadzie każdy z każdym do czasu, aż jedna drużyna wygra dwa razy.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Gra toczy się dalej do czasu, aż wszystkie drużyny zagrają ze sobą przynajmniej raz. Rezultat ostatniego meczu każdy z każdym zostaje wykorzystany do rozstrzygnięcia 2. i 3. miejsca.",
  "ti13_tie_resolve_second_with_round_robin": "Rozstrzygnięcie 2. miejsca następuje poprzez rozgrywanie jednego meczu na zasadzie każdy z każdym do czasu, aż jedna drużyna wygra dwa razy.",
  "ti13_tie_resolve_third_fourth_other": "Nie są rozgrywane żadne dalsze gry. Dwie pozostałe drużyny pozostają w remisie na 3. i 4. miejscu.",
  "ti13_tie_resolve_four_way_1": "Drużyny zostają połączone w pary losowo. Na potrzeby tych zasad są one nazywane Drużyną A, Drużyną B, Drużyną C i Drużyną D.",
  "ti13_tie_resolve_four_way_2": "Drużyna A gra jeden mecz przeciwko Drużynie B. Drużyna C gra jeden mecz przeciwko Drużynie D.",
  "ti13_tie_resolve_four_way_3": "Rozstrzygnięcie 1. miejsca następuje poprzez rozegranie jednego meczu między zwycięzcą z A/B oraz zwycięzcą z C/D.",
  "ti13_tie_resolve_four_way_4": "Rozstrzygnięcie 4. miejsca następuje poprzez rozegranie jednego meczu między przegranym z A/B oraz przegranym z C/D.",
  "ti13_tie_resolve_four_way_5": "Rozstrzygnięcie 2. i 3. miejsca następuje poprzez rozegranie jednego meczu między pozostałymi drużynami.",
  "ti13_seeding_decider_sp_rules": "Mecz decydujący o rozstawieniu – zasady rozstrzygania priorytetu",
  "ti13_seeding_decider_sp_rules_1": "Pierwsza gra: drużyna z wyższym rozstawieniem w fazie grupowej wybiera między doborem bohaterów a stroną.",
  "ti13_seeding_decider_sp_rules_2": "Druga gra: drużyna z niższym rozstawieniem w fazie grupowej wybiera między doborem bohaterów a stroną.",
  "ti13_seeding_decider_sp_rules_3": "Trzecia gra (jeśli ma zastosowanie): drużyna z wyższym rozstawieniem w fazie grupowej wybiera między doborem bohaterów a stroną.",
  "ti13_playoffs_and_ti_sp_rules": "Play-offy i The International – zasady rozstrzygania priorytetu",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Rzut monetą.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Pierwsza gra: zwycięzca w rzucie monetą wybiera między doborem bohaterów a stroną.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Druga gra: przegrany w rzucie monetą wybiera między doborem bohaterów a stroną.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Trzecia gra (jeśli ma zastosowanie): nowy rzut monetą. Zwycięzca w rzucie monetą wybiera między doborem bohaterów a stroną.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Pierwsza gra: zwycięzca górnej drabinki wybiera między doborem bohaterów a stroną.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Druga gra: zwycięzca dolnej drabinki wybiera między doborem bohaterów a stroną.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Trzecia gra: zwycięzca górnej drabinki wybiera między doborem bohaterów a stroną.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Czwarta gra (jeśli ma zastosowanie): zwycięzca dolnej drabinki wybiera między doborem bohaterów a stroną.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Piąta gra (jeśli ma zastosowanie): rzut monetą. Zwycięzca w rzucie monetą wybiera między doborem bohaterów a stroną.",
  "international2024_update_title": "The International 2024, Ringmaster i Kompendium",
  "ringmaster_hype": "„Licze i Liny, Slarki i Marci, ofiary w każdym wieku! Chwila, na którą czekaliście, nareszcie nadeszła.\\n\\n Zdawałoby się, że od jakiegoś roku znany byłem tylko z imienia – wypowiadanego tłumionym szeptem – byłem przyczajonym cieniem wyzierającym zza szkarłatnej kurtyny. Ale po długim oczekiwaniu (moim skromnym zdaniem zbyt długim) nareszcie przygłupy stojące na czele tej formacji poszły po rozum do głowy i pozwoliły mi zaszczycić was moją wspaniałością i zająć skromne miejsce w świetle reflektorów! Oto ja, Cogliostro Kettle – makabryczny maestro! Mroczny naganiacz potępionych! Jedyny i niepowtarzalny SZTUKMISTRZ! A w mym rękawie skrywam już kilka asów!”",
  "ringmaster_comic": "„Ale nie musicie wierzyć mi na słowo! Przeczytajcie może komiks o moim tragicznym pochodzeniu opowiedziany przez zaufanego anonimowego narratora?”",
  "ringmaster_comic_title": "Kukła",
  "ringmaster_comic_desc": "Przeczytajcie o początkach Sztukmistrza za czasów jego występów w objazdowym Mechanicznym Cyrku Kettle'a.",
  "ringmaster_guide": "„Poproszono mnie o przyjęcie roli waszego przewodnika po tegorocznym Kompendium – którą to ofertę przyjąłem z pocałowaniem ręki. Wszakże powinniśmy się wzajemnie poznać! [b]Zaczynamy?”[/b]",
  "ringmaster_introducing": "Przedstawiamy",
  "ringmaster_hero_detail_button": "Zobacz stronę szczegółów bohatera",
  "ringmaster_play_trailer_button": "Odtwórz zwiastun",
  "ringmaster_comic_button": "Przeczytaj komiks",
  "international2024_compendium": "Kompendium",
  "international2024_compendium_title": "Kompendium The International 2024",
  "international2024_effigies_title": "PODOBIZNY POSZCZEGÓLNYCH BOHATERÓW",
  "international2024_effigies_subtitle": "Ulepszona funkcja dostępna za darmo dla każdego",
  "international2024_effigies_intro": "„Był taki czas, przyjaciele, wcale nie tak dawno temu, kiedy te wspaniałe podobizny w istocie stanowiły nieczęsty widok! Ale już tak nie jest! Teraz na każdego mocarza wkraczającego lada chwila na pole bitwy czeka pomnik, niezależnie od tego, czy jest Sztukmistrzem, czy którymkolwiek z innych poślednich bohaterów!”",
  "international2024_effigies_desc": "Podobizny to statuy waszych ulubionych bohaterów, których ułożenie można zmieniać i chwalić się nimi w swojej bazie. Zamiast współdzielić pojedyczne globalne miejsce, od teraz każdy bohater ma swoje własne miejsce na podobiznę w zbrojowni.\\n\\nMożecie pozostać przy domyślnej podobiźnie dla każdego bohatera lub wytwórzcie i użyjcie swojej własnej.",
  "international2024_purchase_intro": "„Bogowie i potwory, dziwadła i stwory, podejdźcie bliżej i nacieszcie swoje fartowne oczy [b]najbardziej porywającą kolekcją gier, wydarzeń i nagród e-sportowych[/b] po tej stronie rzeki! Sprawdźcie swój spryt, farta i determinację podczas najwspanialszego święta e-sportowego w tej i każdej innej krainie!”",
  "international2024_activities": "OTO, CO DOSTANIECIE",
  "international2024_activities_subtitle": "Gry losowe, pokazy umiejętności i uciechy dla wszystkich grup wiekowych ",
  "international2024_activities_intro": "„Obiło mi się o uszy, że w odróżnieniu od waszego zrównoważonego umysłowo mistrza ceremonii, niektórzy z was potrzebują POWODU do zabijania. I dlatego każda rozegrana przez was gra przyzna wam punkty, przyjaciele! Więcej grania, więcej do zyskania, więc wskakujcie na ścieżki i patrzcie, jak rośnie wam kupka punktów!”",
  "international2024_activities_play_title": "Graj w Dota 2, zdobywaj punkty",
  "international2024_activities_play_desc": "W tym roku będziecie zdobywać punkty za niemal każdą grę, w którą zagracie w ramach wyzwania tygodniowego. Każdego dnia zdobędziecie również dodatkowe punkty za pierwszą wygraną.",
  "international2024_activities_fantasy_title": "Liga marzeń",
  "international2024_activities_fantasy_desc": "Rywalizujcie z waszymi znajomymi i graczami Dota 2 z całego świata. Wybierzcie najlepsze składy do waszej drużyny marzeń spośród waszych ulubionych zawodowców i utwórzcie niestandardowe karty ze statystykami dającymi więcej punktów.",
  "international2024_activities_oracles_title": "Wyzwanie Wyroczni",
  "international2024_activities_oracles_desc": "Przewidujcie, które drużyny awansują, a które odpadną i pławcie się w blasku trafności swoich prognoz (zakładając, że wyjdzie na wasze).",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Otrzymajcie losowo wygenerowane oraz wypełnione dziwacznymi warunkami i interesującymi sytuacjami karty bingo dla każdego etapu turnieju.",
  "international2024_activities_outro": "„Zapamiętajcie! Wygrana to nie tylko nagroda sama w sobie! Za każdym razem, gdy odniesiecie sukces w tych aktywnościach, zdobędziecie punkty! Przejdźcie się do budki z nagrodami poniżej, by przekonać się, jakie rarytasy możecie za nie otrzymać!”",
  "international2024_rewards_title": "Nagrody Kompendium",
  "international2024_rewards_subtitle": "Podejdźcie śmiało i podziwiajcie te oto nagrody",
  "international2024_rewards_intro": "„Ścielcie trupy gęsto i odbierzcie swoje nagrody! Ach, a JAKIEŻ TO nagrody na was czekają! Nie, nie w formie waszych rąk zaciśniętych na gardle nieszczęsnej bohaterzyny i obserwowanie, jak życie gaśnie mu w oczach! To nagroda SAMA W SOBIE! Te tutaj otrzymujecie PÓŹNIEJ!”",
  "international2024_rewards_physical_aegis_title": "Fizyczny model Egidy",
  "international2024_rewards_physical_aegis_desc": "Wypełnijcie tę egidokształtną dziurę na waszych półkach i w waszych sercach dzięki tej replice osławionego trofeum wykonanej ze stopu niklu w skali 1:5.",
  "international2024_rewards_hud_title": "Skórka interfejsu: The International 2024",
  "international2024_rewards_hud_desc": "Udekorujcie wasz interfejs w grze i nadajcie mu cyrkowego klimatu. Przerobiliśmy interfejs z myślą o tegorocznym motywie The International.",
  "international2024_rewards_versus_title": "Ekran wstępny 2024",
  "international2024_rewards_versus_desc": "Odświeżcie swojego ducha walki przed grą dzięki spersonalizowanemu ekranowi wstępnemu, który eksponuje miejsca na nowe podobizny bohaterów.",
  "international2024_rewards_chat_wheels_title": "Niewygasające koła czatu",
  "international2024_rewards_stickers_title": "Naklejki graczy i drużyn",
  "international2024_rewards_loading_screens_title": "Ekrany ładowania",
  "international2024_rewards_materials_title": "Wzmocnienia ligi marzeń i bingo",
  "international2024_rewards_teleport_fx_title": "Efekty teleportacji ulubionej drużyny",
  "international2024_rewards_effigy_title": "Bryła Podobizny 2024",
  "international2024_supporters_clubs_title": "Wspierajcie społeczność",
  "international2024_supporters_clubs_subtitle": "Pakiety ekspertów i klubu kibica",
  "international2024_supporters_clubs_intro": "„Szanowni dobroczyńcy! Filantropi w każdym wieku! Skromni mecenasi sztuki zabijania i sztuk z nią związanych! 50% z waszej wspaniałomyślnej hojności trafi prosto do waszych ulubionych drużyn i ekspertów! Kto jest tu prawdziwym bohaterem? Ja, oczywiście! I klaszczę w moje ogromne heroiczne dłonie dla WAS!”",
  "international2024_supporters_clubs_tiers_title": "Klub kibica drużyny",
  "international2024_supporters_clubs_tiers_desc": "Wybierzcie brązowy, srebrny lub złoty stopień wsparcia dla swoich ulubionych drużyn, aby zdobyć stworzone przez nie nagrody.",
  "international2024_talent_tiers_title": "Pakiety naklejek ekspertów",
  "international2024_talent_tiers_desc": "Kupcie pakiety nagród z waszymi ulubionymi ekspertami w rolach głównych. W skład pakietów wchodzą naklejki, kwestie dialogowe i autografy (w zależności od stopnia zakupionego pakietu).",
  "ti13_compendium_small_header": "Wspierajcie turniej",
  "ti13_compendium_header": "Kompendium The International 2024",
  "ti13_compendium_desc": "Kompendium jest waszym interaktywnym cyfrowym towarzyszem podczas The International 2024. Traktujcie Kompendium jako uniwersalne miejsce, gdzie znajdziecie wszystkie zadania, wyzwania i nagrody związane z tegorocznym wydarzeniem. Ponadto 25% wpływów ze sprzedaży trafia do puli nagród The International 2024.",
  "ti13_compendium_bp_btn": "Odwiedź stronę",
  "ti13_compendium_standard": "Standardowe Kompendium",
  "ti13_compendium_standard_subtitle": "Wszystkie funkcje i aktywności",
  "ti13_compendium_upgraded": "Ulepszone Kompendium",
  "ti13_compendium_upgraded_subtitle": "Wszystkie funkcje i aktywności oraz przyspieszone nagrody",
  "ti13_compendium_purchase_tp_fx": "Specjalny efekt teleportacji 1. stopnia (The International 2024)",
  "ti13_compendium_purchase_boosters_footnote": "Premie mogą odblokować wybraną przez was dodatkową zawartość.",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Premie mogą odblokować skórkę interfejsu The International 2024 lub wybraną przez was dodatkową zawartość.",
  "ti13_compendium_purchase_levels": "%1$s poziomów Kompendium",
  "ti13_compendium_purchase_booster_levels": "%1$s premii",
  "ti13_compendium_purchase_discount": "Zaoszczędź %1$s% na poziomach",
  "ti13_compendium_purchase_earn_the_following": "Poziomy Kompendium odblokują:",
  "ti13_compendium_contribution": "25% wpływów z każdej sprzedaży trafi do puli nagród The International 2024.",
  "ti13_compendium_purchase_all_access": "Dostęp do wszystkich funkcji Kompendium",
  "ti13_compendium_purchase_aegis_emoticon": "Emotikona: Egida",
  "ti13_compendium_purchase_bingo_tokens": "Żetony bingo (%1$s)",
  "ti13_compendium_purchase_fantasy_tokens": "Żetony losowania ligi marzeń (%1$s)",
  "ti13_compendium_purchase_one_player_sticker": "Pojemniki z naklejką gracza (1)",
  "ti13_compendium_purchase_player_stickers": "Pojemniki z naklejką gracza (%1$s)",
  "ti13_compendium_purchase_team_stickers": "Pojemniki z naklejką drużyny (%1$s)",
  "ti13_compendium_purchase_effigy_blocks": "Bryły Podobizny TI 2024 (%1$s)",
  "ti13_compendium_purchase_team_loading_screens": "Skarby z ekranami ładowania drużyny (%1$s)",
  "ti13_compendium_purchase_ti_loading_screens": "Skarby z ekranami ładowania The International (%1$s)",
  "international2024_tournament_learn_more": "Dowiedzcie się więcej o turnieju",
  "ringmaster_abilities_heading": "Umiejętności",
  "ringmaster_souvenirs_heading": "Pamiątki",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "INKANTACJA – Ringmaster bierze zamach swoim biczem, po czym nim trzaska. Wrogowie smagnięci biczem otrzymują obrażenia i uciekają w przerażeniu od Ringmastera. Czas inkantancji wykładniczo zwiększa obrażenia i wydłuża czas trwania, ale skraca promień.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster pakuje siebie lub sojuszniczego bohatera do mobilnej pozawymiarowej skrzyni. Jednostki w skrzyni zyskują ruch fazowy, odporność na spowolnienie oraz dodatkową odporność na magię i szybkość ruchu. Nie można ich też obrać za cel oraz są one wytłumione, uciszone oraz rozbrojone. Skrzynia otworzy się po wygaśnięciu efektu lub gdy bohater przemieści się poza promień działania.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster rzuca jednym ze swych sztyletów dokładnie w określony przez niego punkt. Jeśli trafi wroga, sztylet zadaje obrażenia od trafienia, chwilowo spowalnia trafioną jednostkę i zadaje obrażenia na sekundę równe pewnemu procentowi maksymalnego zdrowia ofiary.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster wtacza cudowne koło we wskazane miejsce, odtrącając na bok bohaterów po drodze. Gdy koło dotoczy się do celu, wrogowie w jego zasięgu otrzymują obrażenia okresowe oraz zostają spowolnieni. Wrogowie skierowani twarzą do koła dłużej niż 0,5 sekundy stają się nim zahipnotyzowani i lgną do niego. Pierwszy zahipnotyzowany wróg aktywuje czasomierz eksplozji koła. Jeśli czasomierz nie zostanie aktywowany, koło eksploduje samoczynnie po 8 sekundach.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster rzuca światło reflektora, które przeczesuje pewien obszar. Wrogowie znajdujący się w zasięgu światła mają szansę na chybienie swoimi atakami i zostają ujawnieni, jeśli są niewidzialni. Iluzje trafione snopem światła zanikają, tracąc pewien procent swojego maksymalnego zdrowia na sekundę.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ringmaster otrzymuje losową jednorazową pamiątkę z Mrocznego Festynu za każdym razem, gdy w pobliżu zginie wrogi bohater. Dodatkowe pamiątki są przechowywane jako ładunki. Jeśli Ringmaster nie ma pamiątki przy odrodzeniu, to otrzyma jedną sztukę. Pamiątki z Mrocznego Festynu obejmują Lustereczko z Gabinetu Krzywych Zwierciadeł, Tonik Mocarza i Poduszkę-pierdziuszkę.",
  "ringmaster_ability_funhouse_mirror": "Lustereczko z Gabinetu Krzywych Zwierciadeł",
  "ringmaster_ability_funhouse_mirror_Description": "Użycie: Proportion Distortion\\n\\nTworzy 1 niedoskonały obraz twojego bohatera, który trwa 18 sekund. Twoja iluzja zadaje 28% i przyjmuje 300% obrażeń.",
  "ringmaster_ability_whoopee_cushion": "Poduszka-pierdziuszka",
  "ringmaster_ability_whoopee_cushion_Description": "Użycie: Whoopsie\\n\\nWyrzuca twojego bohatera 400 jednostek do przodu. Zostawia za sobą chmurę smrodu o promieniu 200 jednostek na 3 sekundy, która spowalnia wrogów o 30%.",
  "ringmaster_ability_strongman_tonic": "Tonik Mocarza",
  "ringmaster_ability_strongman_tonic_Description": "Użycie: Forcefully Imbibe\\n\\nTymczasowo zwiększa Siłę sojuszniczego bohatera o 5 pkt. + 1,5 pkt. na poziom Ringmastera na 8 sekund. Efekt trwa 4 sekundy, a następnie zanika wraz z upływem czasu trwania."
}