// 5499.js

{
  "language": "english",
  "ringmastercomic_title_cover": "The Puppet - Cover",
  "ringmastercomic_title": "The Puppet - Page %1$s",
  "ringmastercomic_help_text": "Click image or use space bar to advance",
  "ringmastercomic_return_button": "Return to Cover Page",
  "NoCommaStub": "",
  "ti13_online": "Copenhagen",
  "ti13_main_event_venue": "Royal Arena - Copenhagen",
  "ti13_best_of_three": "Best of Three",
  "ti13_best_of_five": "Best of Five",
  "ti13_group_stage_sp_rules": "Group Stage - Selection Priority Rules",
  "ti13_group_stage_sp_game1": "Coin Toss.",
  "ti13_group_stage_sp_game2": "First Game: Coin Toss Winner chooses pick or side.",
  "ti13_group_stage_sp_game3": "Second Game: Coin Toss Loser chooses pick or side.",
  "ti13_group_stage_sp_game4": "Third Game (If Applicable): New Coin Toss. New Coin Toss Winner chooses pick or side.",
  "ti13_group_stage_tie_rules": "Group Stage - Tiebreaker Rules",
  "ti13_first_second_tie": "Two teams are tied for 1st and 2nd place",
  "ti13_second_third_tie": "Two teams are tied for 2nd and 3rd place",
  "ti13_third_fourth_tie": "Two teams are tied for 3rd and 4th place",
  "ti13_three_way_first_tie": "Three teams are tied for 1st place",
  "ti13_three_way_second_tie": "Three teams are tied for 2nd place",
  "ti13_four_way_tie": "Four teams are tied for 1st place",
  "ti13_tie_resolve_bo3": "Resolve with a Best of Three.",
  "ti13_tie_resolve_third_fourth": "No further games are played. The two teams stay tied for 3rd and 4th place.",
  "ti13_tie_resolve_first_with_round_robin": "Resolve 1st place by playing a round robin Best of One until one team wins twice.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Continue playing until all teams have played each other at least once. Use the most recent round robin results to resolve 2nd and 3rd place.",
  "ti13_tie_resolve_second_with_round_robin": "Resolve 2nd place by playing a round robin Best of One until one team wins twice.",
  "ti13_tie_resolve_third_fourth_other": "No further games are played. The two other teams stay tied for 3rd and 4th place.",
  "ti13_tie_resolve_four_way_1": "Pair the teams randomly. For the purposes of these rules, call these teams Team A, Team B, Team C, and Team D.",
  "ti13_tie_resolve_four_way_2": "Team A plays Team B in a Best of One. Team C plays Team D in a Best of One.",
  "ti13_tie_resolve_four_way_3": "Resolve 1st place by playing a Best of One between the winner of A/B and the winner of C/D.",
  "ti13_tie_resolve_four_way_4": "Resolve 4th place by playing a Best of One between the loser of A/B and the loser of C/D.",
  "ti13_tie_resolve_four_way_5": "Resolve 2nd and 3rd place by playing a Best of One between the remaining teams.",
  "ti13_seeding_decider_sp_rules": "Seeding Decider - Selection Priority Rules",
  "ti13_seeding_decider_sp_rules_1": "First Game: Higher seed from Group Stage chooses pick or side.",
  "ti13_seeding_decider_sp_rules_2": "Second Game: Lower seed from Group Stage chooses pick or side.",
  "ti13_seeding_decider_sp_rules_3": "Third Game (If Applicable): Higher seed from Group Stage chooses pick or side.",
  "ti13_playoffs_and_ti_sp_rules": "Playoffs and The International - Selection Priority Rules",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Coin Toss.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "First Map: Coin Toss Winner chooses pick or side.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Second Map: Coin Toss Loser chooses pick or side.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Third Map (If Applicable): New Coin Toss. New Coin Toss Winner chooses pick or side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "First Map: Upper Bracket Winner chooses pick or side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Second Map: Lower Bracket Winner chooses pick or side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Third Map: Upper Bracket Winner chooses pick or side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Fourth Map (If Applicable): Lower Bracket Winner chooses pick or side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Fifth Map (If Applicable): Coin Toss. Coin Toss Winner chooses pick or side.",
  "international2024_update_title": "TI 2024, The Ringmaster and The Compendium",
  "ringmaster_hype": "\"Liches and Linas, Slarks and Marcis, victims of all ages! The moment you’ve all been waiting for has finally arrived.\\n\\n For what seems like a year now, I have existed in name only — spoken of in hushed whispers, a lurking shadow behind the crimson curtain. But now, at long (too long, if you ask me) last, the imbeciles in charge of this outfit have found the sense to let me bless you with my magnificence, and take my humble place in the spotlight! It is I, Cogliostro Kettle — malevolent maestro! Dark barker of the damned! The one and only RINGMASTER! And I've got a few tricks up my sleeve!\"",
  "ringmaster_comic": "\"But don't take my word for it! Why not read a comic about my tragic origin story, as told by a trustworthy anonymous narrator?\"",
  "ringmaster_comic_title": "The Puppet",
  "ringmaster_comic_desc": "Read up on the Ringmaster's early days touring with the Kettles' clock-work circus.",
  "ringmaster_guide": "\"I have been asked to be your guide through this year's Compendium— an offer I gratefully accepted. After all, we should get to know each other! [b]Let's get started, shall we?\"[/b]",
  "ringmaster_introducing": "Introducing",
  "ringmaster_hero_detail_button": "View Hero Detail Page",
  "ringmaster_play_trailer_button": "Play Trailer",
  "ringmaster_comic_button": "Read The Comic",
  "international2024_compendium": "Compendium",
  "international2024_compendium_title": "The International 2024 Compendium",
  "international2024_effigies_title": "PER-HERO EFFIGIES",
  "international2024_effigies_subtitle": "Upgraded Feature, Free For Everyone",
  "international2024_effigies_intro": "\"There was a time, friends, not so long ago, when these grand effigies were rare sights indeed! No longer! Now there's a monument waiting for every titan about to enter the field of battle, whether they're the Ringmaster or all the other lesser heroes!\"",
  "international2024_effigies_desc": "Effigies are poseable statues of your favorite heroes to show off in your base. Instead of sharing a single global slot, each hero now has their own Effigy slot in the Armory loadout.\\n\\nYou can stick with the new default effigy for any hero, or craft and equip your own.",
  "international2024_purchase_intro": "\"Gods and monsters, creeps and critters, step right up and feast your lucky eyes on [b]the most thrilling collection of games, events, and esports rewards[/b] this side of the river! Test your wits, your luck, and your mettle in a celebration of the grandest esports event in this realm or any other!\"",
  "international2024_activities": "HERE'S WHAT YOU GET",
  "international2024_activities_subtitle": "Games of Chance, Feats of Skill and Delights for All Ages ",
  "international2024_activities_intro": "\"Unlike your stable-minded master of ceremonies, I'm told some of you need a REASON to kill. So every game you play is gonna earn you points, friend! The more you play, the more you gain, so launch yourself into the lanes and watch those points pile up!\"",
  "international2024_activities_play_title": "Play Dota: Earn Points",
  "international2024_activities_play_desc": "This year, you'll earn points for almost every game you play through the Weekly Challenge. You'll also earn bonus points for your first win of each day.",
  "international2024_activities_fantasy_title": "Fantasy",
  "international2024_activities_fantasy_desc": "Compete against your friends and Dota players around the world. Choose the best fantasy lineup of your favorite pros and craft custom cards with point-enhancing stats.",
  "international2024_activities_oracles_title": "Oracle's Challenge",
  "international2024_activities_oracles_desc": "Predict which teams will advance and which will fall, and bask in the accuracy of your prognostications (assuming you were right).",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Get Randomly generated Bingo cards for each stage of the tournment, crammed full of weird conditions and interesting situations.",
  "international2024_activities_outro": "\"Remember! Winning isn't just its own reward! Every time you succeed at one of these activities, you'll earn points! Wander over to Prize Booth below to find out what goodies you can get with them!\"",
  "international2024_rewards_title": "Compendium Rewards",
  "international2024_rewards_subtitle": "Step Right Up And Put Your Eyes on These Prizes",
  "international2024_rewards_intro": "\"Stack those bodies high and claim your prizes! Ahhh, and WHAT prizes await! No, not the prize of your hands around a throat, watching the life drain from a hapless hero's eyes. That's its OWN reward! This is what you get AFTER!\"",
  "international2024_rewards_physical_aegis_title": "Physical Aegis Model",
  "international2024_rewards_physical_aegis_desc": "Fill that Aegis-shaped hole on your shelf and in your heart with a 1/5th-scale nickel alloy replica of the famed champion's prize.",
  "international2024_rewards_physical_aegis_desc2": "",
  "international2024_rewards_hud_title": "The International 2024 HUD",
  "international2024_rewards_hud_desc": "Embellish your in-game interface with the spirit of the circus. We've revamped the HUD around this year's TI theme.",
  "international2024_rewards_versus_title": "2024 Versus Screen",
  "international2024_rewards_versus_desc": "Freshen up your pre-game fighting spirit with a custom Versus Screen that shows off the new hero Effigy slots.",
  "international2024_rewards_chat_wheels_title": "Permanent Chat Wheels",
  "international2024_rewards_stickers_title": "Player and Team Stickers",
  "international2024_rewards_loading_screens_title": "Loading Screens",
  "international2024_rewards_materials_title": "Fantasy and Bingo Powerups",
  "international2024_rewards_teleport_fx_title": "Favorite Team Teleport Effects",
  "international2024_rewards_effigy_title": "2024 Effigy Block",
  "international2024_supporters_clubs_title": "Support the Community",
  "international2024_supporters_clubs_subtitle": "Talent and Team Supporter Bundles",
  "international2024_supporters_clubs_intro": "\"Esteemed benefactors! Philanthropists of all ages! Humble patrons of the killing and killing-adjacent arts! 50% of your magnanimous munificence will go directly into your favorite teams and broadcast talents! Who's the real hero here? Me, obviously! Clapping my humongous heroic hands for YOU!\"",
  "international2024_supporters_clubs_tiers_title": "Team Supporters Clubs",
  "international2024_supporters_clubs_tiers_desc": "Choose Bronze, Silver or Gold support for your favorite teams to earn rewards designed by the teams themselves.",
  "international2024_talent_tiers_title": "Talent Sticker Packs",
  "international2024_talent_tiers_desc": "Purchase reward bundles starring your favorite talent. Bundles include a combination of stickers, voicelines, and autographs depending on the tier of the bundle purchased.",
  "ti13_compendium_small_header": "Support the Tournament",
  "ti13_compendium_header": "The International 2024 Compendium",
  "ti13_compendium_desc": "The Compendium is your interactive digital companion to The International. It's a one-stop shop of event-related activities, challenges, and all of this year's event-focused rewards. Plus, 25% of all sales will contribute to the prize pool of The International 2024.",
  "ti13_compendium_bp_btn": "Visit Website",
  "ti13_compendium_standard": "Standard Compendium",
  "ti13_compendium_standard_subtitle": "All Features and Activities",
  "ti13_compendium_upgraded": "Upgraded Compendium",
  "ti13_compendium_upgraded_subtitle": "All Features and Activities Plus Accelerated Rewards",
  "ti13_compendium_purchase_tp_fx": "Level 1 TI 2024 Teleport FX",
  "ti13_compendium_purchase_boosters_footnote": "Boosters can unlock additional content of your choice",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Boosters can unlock the International 2024 HUD, or additional content of your choice",
  "ti13_compendium_purchase_levels": "%1$s Compendium Levels",
  "ti13_compendium_purchase_booster_levels": "%1$s Boosters",
  "ti13_compendium_purchase_discount": "Save %1$s% on levels",
  "ti13_compendium_purchase_earn_the_following": "Compendium levels will unlock:",
  "ti13_compendium_contribution": "25% of all sales will contribute to the prize pool of The International 2024.",
  "ti13_compendium_purchase_all_access": "Access to all Compendium features",
  "ti13_compendium_purchase_aegis_emoticon": "Aegis Emoticon",
  "ti13_compendium_purchase_bingo_tokens": "%1$s Bingo Tokens",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s Fantasy Roll Tokens",
  "ti13_compendium_purchase_one_player_sticker": "1 Player Sticker Capsule",
  "ti13_compendium_purchase_player_stickers": "%1$s Player Sticker Capsules",
  "ti13_compendium_purchase_team_stickers": "%1$s Team Sticker Capsules",
  "ti13_compendium_purchase_effigy_blocks": "%1$s TI 2024 Effigy Blocks",
  "ti13_compendium_purchase_team_loading_screens": "%1$s Team Loading Screen Treasures",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s TI Loading Screen Treasures",
  "international2024_tournament_learn_more": "Learn More about the Tournament",
  "ringmaster_abilities_heading": "Abilities",
  "ringmaster_souvenirs_heading": "Souvenirs",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "CHANNELED - Ringmaster twirls his whip then cracks it. Whipped enemies are damaged and flee in fear from Ringmaster. Channel time exponentially increases damage and extends the fear duration, but reduces the radius.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster packs himself or an allied hero into a mobile, extradimensional box. Boxed units gain phased movement, slow resistance, bonus magic resistance, and bonus movement speed. They are also untargetable, muted, silenced, and disarmed. The box will pop open after the effect expires or the hero moves outside the radius.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster throws one of his daggers to a precise point of his choosing. If he strikes an enemy, the dagger deals impact damage, briefly slows the unit hit, and deals a percentage of the victim's maximum health in damage every second.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster rolls the Wheel of Wonder to the targeted location, knocking aside enemies along the way. After it reaches its target, enemies in range of the wheel take damage over time and are slowed. Enemies who face the wheel for more than 0.5 seconds are mesmerized and drawn towards it. The first enemy to be mesmerized triggers a timer for the wheel to explode. If the timer is not triggered, it will automatically explode after 8 seconds.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster shines a spotlight that sweeps over an area. Enemies in the light have a chance to miss their attacks and are revealed if invisible. Illusions hit by the beam fade away, losing a percentage of their maximum health each second.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ringmaster receives a random single-use Dark Carnival Souvenir whenever an enemy hero dies nearby. Additional Souvenirs are held as charges. If Ringmaster does not have a Souvenir when he respawns he will be granted one. Souvenirs of the Dark Carnival include a Funhouse Mirror, a Strongman Tonic, and a Whoopee Cushion.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Use: Proportion Distortion\\n\\nCreates 1 imperfect image of your hero that lasts 18 seconds. Your illusion deals 28% and takes 300% damage.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Use: Whoopsie\\n\\nPropels your hero forward 400 units. Leaves a 200 radius stink cloud behind for 3 seconds that slows enemies by 30%.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic",
  "ringmaster_ability_strongman_tonic_Description": "Use: Forcefully Imbibe\\n\\nTemporariliy increases an allied hero's Strength by 5 plus 1.5 per Ringmaster's level for 8 seconds. The effect holds for 4 seconds and then deteriorates over the duration."
}