// 8960.js

{
  "ti13_online": "København",
  "international2024_update_title": "TI 2024, Ringmaster og kompendiet",
  "ringmaster_hype": "\"Licher og Linaer, Slarker og Marcier, ofre i alle aldre! Øjeblikket, I alle har ventet på.\\n\\n I det, der virker som et år nu, har jeg kun eksisteret af navn – nævnt i stille hvisken, en lurende skygge bag det blodrøde tæppe. Men nu, langt (alt for langt, hvis I spørger mig) om længe, er de tåber, som står for det her foretagende, kommet til fornuft og har ladet mig velsigne jer med min pragt og ydmygt tage plads i rampelyset! Det er mig, Cogliostro Kettle – ondskabsfuld maestro! De fordømtes mørke rekommandør! Den uovertrufne RINGMASTER! Og jeg har nogle esser i ærmet!\"",
  "ringmaster_comic": "\"Men tag ikke mit ord for det! Hvorfor ikke læse en tegneserie om min tragiske oprindelseshistorie, berettet af en troværdig anonym fortæller?\"",
  "ringmaster_comic_title": "Dukken",
  "international2024_effigies_title": "AFBILDNINGER PER HELT",
  "international2024_effigies_subtitle": "Opgraderet funktion, gratis for alle",
  "international2024_effigies_intro": "\"Der var engang, venner, for ikke så længe siden, hvor disse storslåede afbildninger var et sjældent syn! Ikke længere! Nu venter der et monument til hver kæmpe, som skal ud på slagmarken, uanset om det er Ringmaster eller alle de andre mindreværdige helte!\"",
  "international2024_purchase_intro": "\"Guder og monstre, kryb og kravl, træd op og fryd jeres heldige øjne med den mest [b]spændende samling spil, begivenheder og e-sportsbelønninger[/b] på denne side af floden! Test jeres forstand, held og mod i en fest for den største e-sportsbegivenhed i dette rige eller et hvilket som helst andet!\"",
  "international2024_activities": "DET HER FÅR DU",
  "international2024_activities_subtitle": "Chancespil, bedrifter og herligheder for alle aldre ",
  "international2024_activities_intro": "\"I modsætning til jeres stabile ceremonimester har jeg hørt, at nogle af jer har behov for at have en GRUND til at dræbe. Så hver kamp, du spiller, giver point, ven! Jo mere du spiller, jo mere får du, så kast dig ud i lanerne, og se pointene hobe sig op!\"",
  "international2024_activities_play_desc": "I år optjener du point for næsten hver eneste kamp, du spiller i den ugentlige udfordring. Du får også bonuspoint for din første sejr hver dag.",
  "international2024_activities_fantasy_desc": "Konkurrer mod dine venner og Dota-spillere fra hele verden. Vælg den bedste fantasiopstilling bestående af dine favoritproffer, og lav tilpassede kort med pointøgende statistikker.",
  "international2024_activities_oracles_desc": "Forudsig, hvilke hold der går videre, og hvilke der ikke klarer sig, og nyd spådommenes nøjagtighed (forudsat at du havde ret).",
  "international2024_activities_bingo_desc": "Få tilfældigt genererede bingoplader for hver fase af turneringen, fyldt med mærkelige forhold og interessante situationer.",
  "international2024_activities_outro": "\"Husk! Sejr er ikke kun en belønning i sig selv! Hver gang du gennemfører en af disse aktiviteter, får du point! Gå til præmieboden nedenfor for at se, hvilke herligheder du kan få for dem!\"",
  "international2024_rewards_subtitle": "Træd nærmere og kast blikket på disse præmier",
  "international2024_rewards_intro": "\"Stabl ligene højt, og indløs dine præmier! Ahhh, og HVILKE præmier der venter! Nej, præmien er ikke at klemme hænderne om en hals og se livet forsvinde fra en ulykkelig helts øjne. Det er en belønning I SIG SELV! Det her får du BAGEFTER!\"",
  "international2024_rewards_physical_aegis_desc": "Fyld dit Aegis-formede hul på hylden og i hjertet med en kopi med nikkellegering af det berømte trofæ i målestoksforholdet 1:5.",
  "international2024_rewards_hud_desc": "Pynt grænsefladen i spillet med cirkusstemning. Vi har shinet HUD'en op inspireret af årets TI-tema.",
  "international2024_supporters_clubs_subtitle": "Supporterbundter for hold og talenter",
  "international2024_supporters_clubs_intro": "\"Ærede velgørere! Filantroper i alle aldre! Ydmyge velyndere af drabs- og drabsnærliggende kunst! 50% af jeres storsindede gavmildhed går direkte til de hold og broadcasttalenter, I bedst kan lide! Hvem er den virkelige helt her? Mig, selvfølgelig! Og jeg klapper i mine enorme heroiske hænder af JER!\"",
  "international2024_supporters_clubs_tiers_title": "Supporterklubber",
  "international2024_talent_tiers_title": "Klistermærkepakker for talenter",
  "ti13_compendium_standard_subtitle": "Alle funktioner og aktiviteter",
  "ti13_compendium_upgraded_subtitle": "Alle funktioner og aktiviteter + hurtigere belønninger",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic"
}