// 6654.js

{
  "language": "greek",
  "international2023_compendium_activity": "ΔΡΑΣΤΗΡΙΟΤΗΤΑ ΓΙΑ ΚΑΤΟΧΟΥΣ Compendium",
  "international2023_update_title": "Ο ΕΟΡΤΑΣΜΟΣ ΤΟΥ THE INTERNATIONAL 2023",
  "international2023_update_subtitle": "Από τους φαν της επαγγελματικής σκηνής μέχρι τους χαλαρούς παίκτες, αυτή η ενημέρωση esport έχει κάτι για όλους.",
  "international2023_update_body": "Είτε κάθε αγώνας του The International σάς καθηλώνει είτε δεν ξέρετε καν ότι η δουλειά κάποιων ανθρώπων είναι να παίζουν Dota, συνεχίστε να διαβάζετε: αυτή η ενημέρωση έχει κάτι για εσάς.\\n\\nΕίστε λάτρης των esport; Δημιουργήστε το δικό σας ρόστερ από επαγγελματίες παίκτες με το αναβαθμισμένο <b>Εικονικό Πρωτάθλημα.</b> Σας ενθουσιάζουν μήπως περισσότερο οι αναλύσεις; Απολαύστε τους ομίλους προβλέψεων της <b>Πρόκλησης του Oracle</b>. Ίσως σας αρέσουν πολύ τα παιχνίδια που παίζει η γιαγιά σας. Λοιπόν, έχουμε ακόμα και <b>Μπίνγκο</b> φέτος!\\n\\nΑλλά ίσως να μην είναι του γούστου σας τίποτα από αυτά. Ίσως θαυμάζετε απλά τον εαυτό σας. Ακόμα και για εσάς έχουμε κάτι: <b>την Παρουσίαση Προφίλ</b>. Το προφίλ σας αποτελεί πλέον διαδραστικό μνημείο του εαυτού σας, το οποίο προβάλλει τα αντικείμενα και τα κατορθώματα από το ιστορικό παιχνιδιού σας, που θέλετε να στριμώξετε εκεί.",
  "international2023_update_footer": "Φτάσατε στο τέλος της ενημέρωσης. Μπράβο!",
  "international2023_compendium": "Compendium",
  "international2023_compendium_title": "The International 2023 Compendium",
  "international2023_compendium_intro": "Το Compendium είναι ο διαδραστικός, ψηφιακός σας συνοδοιπόρος στον Δρόμο προς το The International 2023 και στο The International 2023.\\n\\nΠαίξτε σαν επαγγελματίας με την Πρόκληση «Δρόμος προς το TI». Επιλέξτε τους αγαπημένους σας παίκτες στην ανασχεδιασμένη και ενημερωμένη πρόκληση Εικονικού Πρωταθλήματος. Δοκιμάστε τις μαντικές σας ικανότητες στις Προβλέψεις Φάσης Ομίλων και στις Προβλέψεις Ομίλου. Τινάξτε την μπάνκα στον αέρα με τις ολοκαίνουριες κάρτες Μπίνγκο.\\n\\nΣκεφτείτε το Compendium σαν τον σταθμό σας για όλες τις δραστηριότητες και τις προκλήσεις που σχετίζονται με τη διοργάνωση, καθώς και για τις φετινές ανταμοιβές. Το 25% όλων των πωλήσεων πηγαίνουν στο χρηματικό έπαθλο του The International 2023.",
  "international2023_showcase_title": "Η ΠΑΡΟΥΣΙΑΣΗ ΠΡΟΦΙΛ",
  "international2023_showcase_subtitle": "ΝΕΟ ΧΑΡΑΚΤΗΡΙΣΤΙΚΟ ΓΙΑ ΟΛΟΥΣ ΤΟΥΣ ΠΑΙΚΤΕΣ DOTA",
  "international2023_showcase_intro": "Το προφίλ και το μίνι προφίλ ανασχεδιάστηκαν πλήρως για όλους (για να είμαστε ακριβείς, για το 98% από εσάς που έχετε βαθμολογία επικοινωνίας πάνω από 6000). Τώρα, μπορείτε να προβάλετε όλα τα αντικείμενα και τα κατορθώματά σας στο Dota –πραγματικά οτιδήποτε από τη λίστα αντικειμένων Dota—  με τη νέα Παρουσίαση Προφίλ.\\n\\nΘέλετε να δημιουργήσετε ένα μνημείο για την αγαπημένη σας επαγγελματική ομάδα από το 2016; Μπορείτε να το κάνετε. Τι θα λέγατε για μια συλλογή από τα αγαπημένα σας σετ ηρώων; Φυσικά και μπορείτε να το κάνετε. Κάθε ζευγάρι παπούτσια που μπορεί να φορέσει ο Kunkka; Δυστυχώς, ναι. Από τεχνικής άποψης, μπορείτε να το κάνετε.",
  "international2023_showcase_profile_title": "ΕΝΗΜΕΡΩΜΕΝΟ ΠΡΟΦΙΛ",
  "international2023_showcase_profile_desc": "Είστε ο Μιχαήλ Άγγελος, το προφίλ είναι τώρα ο καμβάς σας και το μόνο σας εμπόδιο είναι η ίδια σας η φαντασία (και το στοιχειώδες αίσθημα ευπρέπειας που σας διακατέχει).",
  "international2023_showcase_mini_profile_title": "ΕΝΗΜΕΡΩΜΕΝΟ ΜΙΝΙ ΠΡΟΦΙΛ",
  "international2023_showcase_mini_profile_desc": "Τα μίνι προφίλ μοιάζουν πολύ με τα προφίλ, με μια σημαντική διαφορά. Θέλω λίγο την προσοχή σας εδώ: Είναι μικρότερα. Οι άλλοι παίκτες θα βλέπουν το μίνι προφίλ σας όταν τοποθετούν τον δείκτη του ποντικιού πάνω στο όνομά σας.",
  "international2023_showcase_carousel_title": "ΔΕΙΓΜΑΤΑ ΠΑΡΟΥΣΙΑΣΗΣ",
  "international2023_showcase_items_title": "ΑΝΤΙΚΕΙΜΕΝΑ ΠΑΡΟΥΣΙΑΣΗΣ",
  "international2023_showcase_items_desc": "Προσαρμόστε τις παρουσιάσεις σας με την τεράστια ποικιλία των αντικειμένων που μαζεύατε όλα αυτά τα χρόνια.",
  "international2023_showcase_item_heroes_title": "ΗΡΩΕΣ",
  "international2023_showcase_item_trophies_title": "ΤΡΟΠΑΙΑ",
  "international2023_showcase_item_stickers_title": "ΑΥΤΟΚΟΛΛΗΤΑ",
  "international2023_showcase_item_stats_title": "ΣΤΑΤΙΣΤΙΚΑ",
  "international2023_showcase_item_chat_wheels_title": "ΗΧΗΤΙΚΑ ΡΟΔΕΛΑΣ",
  "international2023_showcase_item_sprays_title": "ΣΠΡΕΪ",
  "international2023_showcase_item_items_title": "ΑΝΤΙΚΕΙΜΕΝΑ ΟΠΛΟΣΤΑΣΙΟΥ",
  "international2023_showcase_item_emoticons_title": "ΦΑΤΣΟΥΛΕΣ",
  "international2023_showcase_item_loading_screens_title": "ΕΙΚΟΝΕΣ ΦΟΡΤΩΣΗΣ",
  "international2023_showcase_item_couriers_title": "ΜΕΤΑΦΟΡΕΙΣ",
  "international2023_showcase_item_wards_title": "WARD",
  "international2023_tournament_prize_pool": "ΧΡΗΜΑΤΙΚΟ ΕΠΑΘΛΟ",
  "international2023_tournament_prize_pool_percent": "Το 25% όλων των πωλήσεων του Compendium του International 2023 πηγαίνουν στο χρηματικό έπαθλο του The International 2023.",
  "international2023_tournament_learn_more": "ΜΑΘΕΤΕ ΠΕΡΙΣΣΟΤΕΡΑ ΓΙΑ ΤΟ ΤΟΥΡΝΟΥΑ",
  "international2023_quests_title": "Η ΠΡΟΚΛΗΣΗ «ΔΡΟΜΟΣ ΠΡΟΣ ΤΟ THE INTERNATIONAL»",
  "international2023_quests_intro": "Παρακολουθήσατε τους επαγγελματίες. Τους στηρίξατε με τις επευφημίες σας. Τώρα παίξτε σαν αυτούς. Καθίστε στην gaming καρέκλα των αγαπημένων σας επαγγελματιών παικτών esport και αναβιώστε τις καλύτερες στιγμές τους από πέρυσι. Κερδίστε με τους ήρωές τους από έναν συγκεκριμένο αγώνα ή με έναν από τους πέντε ήρωες που έπαιξαν κατά τη διάρκεια ενός μήνα στη σεζόν. Κερδίστε πόντους για κάθε πρόκληση και επιπλέον πόντους αν ολοκληρώσετε σύνολα προκλήσεων.",
  "international2023_quests_match_title": "ΠΡΟΚΛΗΣΕΙΣ ΑΓΩΝΑ",
  "international2023_quests_match_desc": "Κερδίστε παίζοντας με ήρωες από έναν πραγματικό επαγγελματικό αγώνα.",
  "international2023_quests_pro_title": "ΠΡΟΚΛΗΣΕΙΣ ΠΑΙΚΤΩΝ",
  "international2023_quests_pro_desc": "Κερδίστε ως ένας από τους πιο παιγμένους ήρωες ενός επαγγελματία παίκτη.",
  "international2023_quests_rewards_title": "ΚΕΡΔΙΣΤΕ ΑΝΤΑΜΟΙΒΕΣ",
  "international2023_quests_rewards_desc": "Ενισχύστε τις ανταμοιβές σας με τους Πόντους Compendium που κερδίζετε στην πορεία.",
  "international2023_fantasy_title": "ΕΞΕΛΙΓΜΕΝΟ ΕΙΚΟΝΙΚΟ ΠΡΩΤΑΘΛΗΜΑ",
  "international2023_fantasy_intro": "Επιλέξτε μια ομάδα με τους αγαπημένους σας επαγγελματίες παίκτες. Κατασκευάστε τα στατιστικά που θεωρείτε ότι θα είναι τα πιο πολύτιμα. Ανταγωνιστείτε με παίκτες από όλον τον κόσμο για να κερδίσετε τους περισσότερους πόντους. Είναι το Εικονικό Πρωτάθλημα Dota που θυμάστε, αλλά ανασχεδιασμένο.",
  "international2023_fantasy_players_title": "ΕΠΙΛΕΞΤΕ",
  "international2023_fantasy_players_desc": "Επιλέξτε τους αγαπημένους σας παίκτες, για πυρήνα, κέντρο και υποστήριξη.",
  "international2023_fantasy_craft_title": "ΚΑΤΑΣΚΕΥΑΣΤΕ",
  "international2023_fantasy_craft_desc": "Χρησιμοποιήστε τις μάρκες ανανέωσης που κερδίζετε μαζί με τις ανταμοιβές του Compendium, για να κατασκευάσετε τα καλύτερα στατιστικά για τους παίκτες σας. Επιλέξτε προσεκτικά, καθώς μερικά στατιστικά είναι καλύτερα σε κάποιους παίκτες παρά σε άλλους.",
  "international2023_fantasy_compete_title": "ΑΝΤΑΓΩΝΙΣΤΕΙΤΕ",
  "international2023_fantasy_compete_desc": "Κάθε Σαββατοκύριακο του τουρνουά είναι ένας ξεχωριστός γύρος του Εικονικού Πρωταθλήματος, οπότε θα έχετε πολλές ευκαιρίες να αγωνιστείτε εναντίον των φίλων σας, αλλά και ολόκληρου του κόσμου. Κερδίστε Πόντους Compendium και, αν έχετε αρκετά υψηλή θέση στον πίνακα κατάταξης, ένα μοναδικό τρόπαιο.",
  "international2023_bingo_title": "ΜΠΙΝΓΚΟ",
  "international2023_bingo_intro": "Ενθουσιάζεστε κάθε φορά που ένας επαγγελματίας αγοράζει ένα Divine Rapier; Ή όταν ένας αγώνας ξεπεράσει τα 80 λεπτά και όλα αρχίζουν να γίνονται λίγο παράξενα; Μήπως όταν μια ομάδα με 16 πόδια πολεμάει μια ομάδα με μόλις 4;\\n\\nΛοιπόν, ετοιμαστείτε επιτέλους να επωφεληθείτε από αυτόν τον ενθουσιασμό. Το Μπίνγκο είναι εδώ για να κερδίσετε από μερικά πραγματικά τρελά συμβάντα.",
  "international2023_bingo_cards_title": "ΜΙΑ ΚΑΡΤΑ ΜΠΙΝΓΚΟ ΚΑΘΕ ΣΑΒΒΑΤΟΚΥΡΙΑΚΟ",
  "international2023_bingo_cards_desc": "Όλοι οι κάτοχοι Compendium θα λάβουν μια νέα, τυχαία δημιουργημένη κάρτα Μπίνγκο για κάθε Σαββατοκύριακο του τουρνουά. Αυτή η κάρτα είναι γεμάτη τετράγωνα με παράξενες συνθήκες και ενδιαφέρουσες καταστάσεις που μπορεί να συμβούν όσο αναμετρώνται οι επαγγελματίες.",
  "international2023_bingo_rewards_title": "ΟΛΟΚΛΗΡΩΣΤΕ ΣΕΙΡΕΣ, ΚΕΡΔΙΣΤΕ ΠΟΝΤΟΥΣ",
  "international2023_bingo_rewards_desc": "Καλά ακούσατε, μην αφήσετε τους θεούς, τους δαίμονες και τα πονηρά πλάσματα του δάσους να σας ξεγελάσουν. Δεν είναι παρά ένα παιχνίδι Μπίνγκο. Κάθε φορά που ολοκληρώνετε μια σειρά, στήλη ή διαγώνια γραμμή στην κάρτα σας, θα αποκτάτε μια ανταμοιβή Πόντων Compendium. Σημείωση: Δεν χρειάζεται να φωνάξετε «Μπίνγκο», αλλά συνιστάται ανεπιφύλακτα.",
  "international2023_predictions_title": "Η ΠΡΟΚΛΗΣΗ ΤΟΥ ORACLE",
  "international2023_predictions_intro": "Ο Oracle χρησιμοποιεί αστρική ομφαλική μαγεία για να δει το μέλλον. Συγγνώμη που σας το χαλάμε, αλλά δεν υπάρχει ομφαλική μαγεία. Θα χρειαστεί να χρησιμοποιήσετε το μυαλό σας, τις γνώσεις σας για τα esport και, πάνω απ΄ όλα, τις καλύτερες εκτιμήσεις σας για να τα καταφέρετε.\\n\\nΠροβλέψτε σαν μάντης, αλλά χωρίς ομφαλική μαγεία, ποιες ομάδες θα προκριθούν και ποιες θα αποκλειστούν κάθε Σαββατοκύριακο του τουρνουά. Με σωστές εκτιμήσεις (συγγνώμη, μαγικές προφητείες) θα κερδίζετε Πόντους Compendium.",
  "international2023_predictions_group_stage_title": "ΠΡΟΒΛΕΨΕΙΣ ΦΑΣΗΣ ΟΜΙΛΩΝ",
  "international2023_predictions_group_stage_desc": "Για πρώτη φορά φέτος, προσπαθήστε να προβλέψετε τη σειρά των ομάδων σε κάθε όμιλο.",
  "international2023_predictions_ingame_title": "ΠΡΟΒΛΕΨΕΙΣ ΕΝΤΟΣ ΠΑΙΧΝΙΔΙΟΥ",
  "international2023_predictions_ingame_desc": "Όσο παρακολουθείτε, είτε εντός παιχνιδιού είτε στο Twitch, μπορείτε να δοκιμάσετε τις μαντικές σας δυνάμεις πριν ηχήσει το κέρας σε κάθε αγώνα. Θα κερδίσετε Πόντους Compendium για κάθε σωστή πρόβλεψη, με όριο τις έξι κάθε ημέρα.",
  "international2023_rewards_title": "ΑΝΤΑΜΟΙΒΕΣ COMPENDIUM",
  "international2023_rewards_intro": "Αν σας αρέσει να παρακολουθείτε το ανταγωνιστικό Dota και να λαμβάνετε ανταμοιβές ακριβώς γι' αυτό, τότε οι φετινές ανταμοιβές είναι για εσάς. Το Compendium 2023 είναι αφιερωμένο αποκλειστικά στο The International 2023 και την επαγγελματική σκηνή του Dota.",
  "international2023_rewards_physical_aegis_title": "ΡΕΠΛΙΚΑ ΤΟΥ AEGIS",
  "international2023_rewards_physical_aegis_desc": "Μια ρέπλικα από κράμα νικελίου σε κλίμακα 1:5 του φημισμένου επάθλου των πρωταθλητών. Δείξτε το με καμάρι! Χωρίς περιορισμούς! Λιώστε το και φτιάξτε το δικό σας νόμισμα!",
  "international2023_rewards_chat_wheels_title": "ΜΟΝΙΜΑ ΗΧΗΤΙΚΑ ΡΟΔΕΛΑΣ ΣΥΝΟΜΙΛΙΑΣ",
  "international2023_rewards_chat_wheels_desc": "Σε αντίθεση με τα προηγούμενα χρόνια, όλα τα ηχητικά ροδέλας συνομιλίας είναι τώρα μόνιμα. Ναι, όπως είπαμε στον τίτλο. Ναι, αυτό το κείμενο φαίνεται λίγο περιττό. Αλλά ήταν ευχάριστο που περάσαμε λίγο περισσότερο χρόνο μαζί.",
  "international2023_rewards_stickers_title": "ΑΥΤΟΚΟΛΛΗΤΑ ΠΑΙΚΤΩΝ ΚΑΙ ΟΜΑΔΩΝ",
  "international2023_rewards_stickers_desc": "«Μόνο αυτοκόλλητα ομάδων;» Δεν διαβάσατε καν τον τίτλο, έτσι δεν είναι; Θα λάβετε και αυτοκόλλητα παικτών. Για να είμαστε ειλικρινείς, αυτές οι παράγραφοι είναι σαν αεροπλάστ με σκοπό να προστατεύσουν τον τίτλο καθώς έρχεται στα μάτια σας.",
  "international2023_rewards_hud_title": "Η ΔΙΕΠΑΦΗ ΤΟΥ THE INTERNATIONAL 2023",
  "international2023_rewards_hud_desc": "Αυτή η τελευταία παράγραφος μπορεί να τρόμαξε τον κόσμο και τελικά να μην τη διάβασαν. Αν μείνατε, όμως, μπράβο σας. Ήταν ένα τεστ και το περάσατε. Επειδή τώρα έρχονται μερικές πληροφορίες που δεν συμπεριλαμβάνονται στον τίτλο: Η νέα διεπαφή είναι ειδικά σχεδιασμένη με το φετινό θέμα της υαλογραφίας.",
  "international2023_rewards_loading_screens_title": "ΕΙΚΟΝΕΣ ΦΟΡΤΩΣΗΣ",
  "international2023_rewards_loading_screens_desc": "Θα λάβετε μια ειδική εικόνα φόρτωσης για κάθε ομάδα, σε στιλ υαλογραφίας, καθώς και μέρος της τέχνης από το φετινό TI.",
  "international2023_rewards_materials_title": "ΕΝΙΣΧΥΣΕΙΣ",
  "international2023_rewards_materials_desc": "Χρησιμοποιήστε ειδικά εργαλεία για να κατασκευάσετε καλύτερους παίκτες στο Εικονικό Πρωτάθλημα ή για να ξεπεράσετε το ιδιαίτερα δύσκολο περιεχόμενο της Πρόκλησης «Δρόμος προς το TI».",
  "international2023_rewards_teleport_fx_title": "ΕΦΕ ΤΗΛΕΜΕΤΑΦΟΡΑΣ ΑΓΑΠΗΜΕΝΗΣ ΟΜΑΔΑΣ",
  "international2023_rewards_teleport_fx_desc": "Επιδείξτε την αγαπημένη σας ομάδα εντός παιχνιδιού με προσαρμοσμένα εφέ τηλεμεταφοράς, σε τρία διαφορετικά επίπεδα.",
  "international2023_rewards_Types_title": "ΤΥΠΟΙ ΑΝΤΑΜΟΙΒΩΝ",
  "international2023_rewards_Types_desc": "Κάθε τύπος ανταμοιβής έχει τον δικό της μετρητή προόδου. Όταν γεμίσει ο μετρητής, μπορείτε να αποκτήσετε την ανταμοιβή. Μερικοί μετρητές μπορούν να ξαναγεμίσουν όσες φορές θέλετε, ενώ άλλοι έχουν κάποιο όριο.",
  "international2023_rewards_Levels_title": "ΕΠΙΠΕΔΑ COMPENDIUM",
  "international2023_rewards_Levels_desc": "Κερδίστε Επίπεδα Compendium συμμετέχοντας σε δραστηριότητες του Compendium ή αγοράζοντας Πακέτα Επιπέδων. Εφαρμόστε τα Επίπεδα για να αυξήσετε τους μετρητές προόδου για ΟΛΟΥΣ τους τύπους ανταμοιβής.",
  "international2023_rewards_Boosters_title": "ΕΝΙΣΧΥΤΕΣ",
  "international2023_rewards_Boosters_desc": "Οι Ενισχυτές είναι σαν τα Επίπεδα Compendium, αλλά αυξάνουν μόνο μία συγκεκριμένη ανταμοιβή. Με την εφαρμογή ενός ενισχυτή σε μια ανταμοιβή ανεβάζετε επίσης την πρόοδο για το Collector's Aegis.",
  "international2023_supporters_clubs_title": "ΚΛΑΜΠ ΥΠΟΣΤΗΡΙΚΤΩΝ",
  "international2023_supporters_clubs_subtitle": "ΥΠΟΣΤΗΡΙΞΤΕ ΑΠΕΥΘΕΙΑΣ ΤΟ ΑΓΑΠΗΜΕΝΟ ΣΑΣ ΤΑΛΕΝΤΟ",
  "international2023_supporters_clubs_intro": "Οι ανταμοιβές του Κλαμπ Υποστηρικτών είναι σαν τις χαρές της νιότης – απολαύστε τις όσο μπορείτε, γιατί φεύγουν. Ή τουλάχιστον έφευγαν. Από τώρα θα είναι μόνιμες! Οπότε, μπορείτε να τις απολαύσετε για πάντα! Εκτός αν σας χτυπήσει λεωφορείο.\\n\\nΚαι το ακόμα καλύτερο είναι ότι το 50% των πωλήσεων πηγαίνουν απευθείας στην ομάδα. Αυτό βασικά είναι καλύτερο για αυτούς. Το πρώτο πράγμα είναι καλύτερο για εσάς.",
  "international2023_supporters_clubs_tiers_title": "ΤΡΕΙΣ ΒΑΘΜΙΔΕΣ ΥΠΟΣΤΗΡΙΞΗΣ",
  "international2023_supporters_clubs_tiers_desc": "Επιλέξτε Χάλκινη, Ασημένια ή Χρυσή βαθμίδα για τις αγαπημένες σας ομάδες, ώστε να κερδίσετε ανταμοιβές που έχουν σχεδιάσει οι ίδιες οι ομάδες.",
  "international2023_talent_title": "ΑΥΤΟΚΟΛΛΗΤΑ ΤΑΛΕΝΤΩΝ",
  "international2023_talent_subtitle": "ΥΠΟΣΤΗΡΙΞΤΕ ΑΠΕΥΘΕΙΑΣ ΤΟ ΑΓΑΠΗΜΕΝΟ ΣΑΣ ΤΑΛΕΝΤΟ",
  "international2023_talent_intro": "Η ζωντανή μετάδοση esport είναι δύσκολη δουλειά. Εντάξει, δεν είμαστε και ανθρακωρύχοι, αλλά σίγουρα είναι πιο δύσκολο από ένα χαλαρό τάβλι με φραπεδάκι στην παραλία. Ναι, προφανώς και εξαρτάται από τον εκάστοτε αντίπαλο. Κάποιες παρτίδες εξελίσσονται σε δράμα.\\n\\n Τώρα, μπορείτε να στείλετε ένα μήνυμα στο αγαπημένο σας Ταλέντο που θα λέει: «Γεια… σέβομαι αυτό που κάνεις. Όχι όσο σέβομαι τους ανθρακωρύχους, αλλά σίγουρα περισσότερο από το 50% των ταβλαδόρων». Μιας και μιλάμε για το 50%, τα μισά από τα έσοδα από τα αυτοκόλλητα Ταλέντων θα πάνε απευθείας στο Ταλέντο.",
  "international2023_talent_tiers_title": "ΕΠΙΛΕΞΤΕ ΤΗ ΒΑΘΜΙΔΑ ΣΑΣ",
  "international2023_talent_tiers_desc": "Αγοράστε πακέτα ανταμοιβών με πρωταγωνιστή το αγαπημένο σας Ταλέντο. Τα πακέτα περιλαμβάνουν έναν συνδυασμό από αυτοκόλλητα, φωνητικές ατάκες και αυτόγραφα, ανάλογα με τη βαθμίδα του πακέτου που αγοράζετε.",
  "international2023_talent_coming_soon": "Τα Πακέτα Ταλέντων θα είναι διαθέσιμα για αγορά αφού ανακοινωθούν τα Ταλέντα.",
  "international2023_coming_soon": "ΠΡΟΣΕΧΩΣ",
  "ti12_bp_countdown_header": "ΤΗ ΦΑΣΗ ΟΜΙΛΩΝ",
  "ti12_bp_countdown_desc": "Συντονιστείτε για το μεγαλύτερο τουρνουά esport της χρονιάς, ζωντανά από το Σιάτλ, όπου διακυβεύεται το Aegis of Champions.",
  "ti12_bp_tournament_complete_desc": "Ξαναζήστε τον ενθουσιασμό του μεγαλύτερου τουρνουά esport της χρονιάς. Όλη η δράση από το Σιάτλ στη διάθεσή σας με ένα μόνο κλικ.",
  "ti12_group_stage_venue": "Ζωντανά",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "ΥΠΟΣΤΗΡΙΞΤΕ ΤΟ ΤΟΥΡΝΟΥΑ",
  "ti12_compendium_header": "ΤΟ COMPENDIUM ΤΟΥ THE INTERNATIONAL 2023",
  "ti12_compendium_desc": "Ξεκλειδώστε ακόμα περισσότερα πράγματα από τη σεζόν του τουρνουά με το Compendium του The International 2023. Παίξτε σαν επαγγελματίας με την Πρόκληση «Δρόμος προς το TI». Επιλέξτε τους αγαπημένους σας παίκτες στο ανασχεδιασμένο Εικονικό Πρωτάθλημα. Δοκιμάστε τις μαντικές σας ικανότητες με την Πρόκληση του Oracle. Και κάντε την προσευχή σας ότι οι ομάδες θα κάνουν κάτι περίεργο με το ολοκαίνουριο χαρακτηριστικό του Μπίνγκο.\\n\\nΚερδίστε ανταμοιβές, όπως αυτοκόλλητα παικτών, αυτοκόλλητα ομάδων, ηχητικά ροδέλας συνομιλίας, μια προσαρμοσμένη διεπαφή και άλλα, με αποκορύφωμα μια ρέπλικα του Aegis.\\n\\nΤο 25% όλων των πωλήσεων του Compendium θα πάει απευθείας στο χρηματικό έπαθλο του The International.",
  "ti12_compendium_standard": "ΚΑΝΟΝΙΚΟ Compendium",
  "ti12_compendium_upgraded": "ΕΝΙΣΧΥΜΕΝΟ Compendium"
}