// 5362.js

{
  "language": "turkish",
  "international2023_compendium_activity": "DERGİ SAHİPLERİ İÇİN ETKİNLİK",
  "international2023_update_title": "The International 2023 Kutlaması",
  "international2023_update_subtitle": "Bu e-spor güncellemesinde profesyonel maç fanatiklerinden sıradan oyunculara kadar herkes için bir şeyler var.",
  "international2023_update_body": "İster The International'daki her maçın her saniyesini takip ediyor olun, ister bunu bir işmiş gibi oynayanlardan bihaber olup Dota'nın tadını huzur içinde çıkarmak isteyen biri olun: Bu güncellemede sizin için bir şeyler var.\\n\\nE-spor hayranı mısınız? Geliştirilmiş <b>Fantezi Ligi</b>'nde profesyonel oyunculardan oluşan kendi takımınızı oluşturun. Analiz yapmak daha çok mu ilginizi çekiyor? <b>Oracle'ın Mücadelesi</b>'ndeki tahminleri deneyin. Büyük teyzenizle oynadığınız oyunları mı özlüyorsunuz? Bu yıl <b>Bingo</b>'muz bile var!\\n\\nAma belki de bunların hiçbirinin hayranı değilsiniz. Belki sadece yaptığınız şeylerin hayranısınızdır. Bu durumda sizin için de bir şeyimiz var: <b>Profil Vitrini</b>. Artık profiliniz, Dota 2 geçmişinizden sergilemek istediğiniz öğeleri ve başarıları öne çıkaran etkileşimli bir anıttır.",
  "international2023_update_footer": "Güncellemenin sonuna kadar geldiniz. Tebrikler!",
  "international2023_compendium": "DERGİ",
  "international2023_compendium_title": "The International 2023 Dergisi",
  "international2023_compendium_intro": "Dergi, The International 2023 ve The International'a Doğru 2023 için etkileşimli dijital rehberinizdir.\\n\\nTI'a Doğru Mücadelesi ile bir profesyonel gibi oynayın. Yenilenmiş ve güncellenmiş Fantezi Mücadelesi ile favori oyuncularınızı seçin. Grup Aşaması ve Grup Tahminleri ile tahmin yeteneğinizi test edin. Yepyeni Bingo tablolarıyla büyük ikramiyeyi yakalayın.\\n\\nDergiyi, etkinlikle ilgili aktivitelerin, mücadelelerin ve bu yılın etkinlik odaklı tüm ödüllerinin tek adresi olarak düşünün. Ayrıca tüm satışların %25'i The International 2023 ödül havuzuna katkıda bulunacak.",
  "international2023_showcase_title": "PROFİL VİTRİNİ",
  "international2023_showcase_subtitle": "TÜM DOTA OYUNCULARI İÇİN YENİ ÖZELLİK",
  "international2023_showcase_intro": "Profil ve mini profil herkes için tamamen yeniden tasarlandı (yani iletişim puanı 6000'in üzerinde olan %98'iniz için). Artık yeni Profil Vitrini ile tüm Dota öğelerinizi, başarılarınızı ve Dota envanterinizdeki diğer her şeyi sergileyebilirsiniz.\\n\\n2016'daki favori profesyonel takımınız için bir mabet mi yapmak istiyorsunuz? Yapabilirsiniz. En sevdiğiniz kahraman setlerinden oluşan bir koleksiyona ne dersiniz? Kesinlikle yapabilirsiniz. Kunkka'nın ayakkabılarının mümkün olan her çeşidini? Ne yazık ki evet. Teknik olarak bunu da yapabilirsiniz.",
  "international2023_showcase_profile_title": "GÜNCELLENMİŞ PROFİL",
  "international2023_showcase_profile_desc": "Siz Michaelangelo'sunuz, profiliniz artık tuvaliniz ve yalnızca hayal gücünüzle (ve temel insani nezaket anlayışınızla) sınırlısınız.",
  "international2023_showcase_mini_profile_title": "GÜNCELLENMİŞ MİNİ PROFİL",
  "international2023_showcase_mini_profile_desc": "Mini profiller, profillere çok benzer. Tek önemli farkları, çok şaşıracaksınız, daha küçük olmaları. Diğer oyuncular adınızın üzerine geldiklerinde mini profilinizi görecekler.",
  "international2023_showcase_carousel_title": "ÖRNEK VİTRİNLER",
  "international2023_showcase_items_title": "VİTRİN ÖĞELERİ",
  "international2023_showcase_items_desc": "Yıllar boyunca topladığınız tüm öğeler ve ödüllerden oluşan geniş koleksiyonlarınızla vitrinlerinizi özelleştirin.",
  "international2023_showcase_item_heroes_title": "KAHRAMANLAR",
  "international2023_showcase_item_trophies_title": "KUPALAR",
  "international2023_showcase_item_stickers_title": "ÇIKARTMALAR",
  "international2023_showcase_item_stats_title": "İSTATİSTİKLER",
  "international2023_showcase_item_chat_wheels_title": "SOHBET ÇARKLARI",
  "international2023_showcase_item_sprays_title": "SPREYLER",
  "international2023_showcase_item_items_title": "CEPHANELİK ÖĞELERİ",
  "international2023_showcase_item_emoticons_title": "İFADELER",
  "international2023_showcase_item_loading_screens_title": "YÜKLEME EKRANLARI",
  "international2023_showcase_item_couriers_title": "KURYELER",
  "international2023_showcase_item_wards_title": "GÖZLER",
  "international2023_tournament_prize_pool": "Ödül Havuzu",
  "international2023_tournament_prize_pool_percent": "The International 2023 Dergisi satışlarından elde edilen gelirin %25'i, The International 2023 ödül havuzuna gider.",
  "international2023_tournament_learn_more": "TURNUVA HAKKINDA DAHA FAZLA BİLGİ EDİNİN",
  "international2023_quests_title": "THE INTERNATIONAL'A DOĞRU MÜCADELESİ",
  "international2023_quests_intro": "Profesyonelleri izledin. Onları destekledin. Şimdi onlar gibi oynama zamanı. Favori profesyonel e-spor oyuncularınızın oyun koltuğuna oturun ve geçen yılın en güzel anlarını yeniden yaratın. Belirli bir maçtaki kahramanlarıyla veya sezonun belirli bir ayında kullandıkları beş kahramandan biriyle maç kazanın. Tamamladığınız her mücadeleyle puan kazanın ve tüm mücadele setlerini tamamladığınızda fazladan puan kazanın.",
  "international2023_quests_match_title": "MAÇ MÜCADELELERİ",
  "international2023_quests_match_desc": "Gerçek bir profesyonel maçta oynanan kahramanlarla kazanın.",
  "international2023_quests_pro_title": "OYUNCU MÜCADELELERİ",
  "international2023_quests_pro_desc": "Profesyonel bir oyuncunun en çok seçtiği kahramanlardan biriyle kazanın.",
  "international2023_quests_rewards_title": "Ödüller Kazanın",
  "international2023_quests_rewards_desc": "Kazandığınız dergi puanları ile ödüllerinizi güçlendirin.",
  "international2023_fantasy_title": "EVRİMLEŞEN FANTEZİ MÜCADELESİ",
  "international2023_fantasy_intro": "En sevdiğiniz profesyonellerden bir takım oluşturun. En değerli olacağını düşündüğünüz istatistikleri seçin. En fazla puanı kazanmak için dünyanın dört bir yanındaki oyuncularla yarışın. Alıştığınız Dota Fantezi Ligi her yönden gelişti.",
  "international2023_fantasy_players_title": "SEÇİN",
  "international2023_fantasy_players_desc": "Favori temel, orta ve destek oyuncunuzu seçin.",
  "international2023_fantasy_craft_title": "OLUŞTURUN",
  "international2023_fantasy_craft_desc": "Dergi ödüllerinizi ve kazandığınız jetonları kullanarak oyuncularınız için en iyi özellikleri oluşturmaya çalışın. Seçiminizi dikkatli yapın; bazı özellikler bazı oyuncularda diğerlerinden daha iyidir.",
  "international2023_fantasy_compete_title": "YARIŞA KATILIN",
  "international2023_fantasy_compete_desc": "Turnuvanın her hafta sonu ayrı bir Fantezi turu olduğundan arkadaşlarınıza ve dünyaya karşı yarışmak için birden fazla şansınız olacak. Dergi Puanları ve sıralamanız yeterince yüksekse benzersiz bir kupa kazanın.",
  "international2023_bingo_title": "BİNGO",
  "international2023_bingo_intro": "Profesyonel bir takım her Divine Rapier satın aldığında biraz heyecanlanıyor musunuz? Ya da bir maç 80 dakikadan fazla sürdüğünde ve her şey biraz tuhaflaşmaya başladığında? Peki ya 16 ayaklı kahramanlardan oluşan bir takım sadece dört ayaklı kahramanlara sahip bir takımla kapıştığında?\\n\\nArtık bu heyecanla para kazanmaya hazır olun. Bingo, bazı çılgınca olaylardan faydalanmanıza yarayacak.",
  "international2023_bingo_cards_title": "HER HAFTA SONU BİR BİNGO KARTI",
  "international2023_bingo_cards_desc": "Tüm dergi sahipleri, turnuva sırasında her hafta sonu rastgele oluşturulmuş yeni bir Bingo kartı alacak. Bu kart, profesyoneller yarışırken gerçekleşmesini isteyeceğiniz tuhaf koşullar ve ilginç durumlar içeren karelerle dolu.",
  "international2023_bingo_rewards_title": "Sıraları Tamamlayın, Puan Kazanın",
  "international2023_bingo_rewards_desc": "Evet. Tanrılar, şeytanlar ve savaşmaya hazır orman yaratıklarına fazla aldanmayın, bu bildiğimiz Bingo millet. Bingo kartınızdaki bir yatay, dikey veya çapraz sırayı tamamladığınızda, dergi puanı ödülünü alabilirsiniz. Not: \"BİNGO\" diye bağırmak zorunda değilsiniz ama bağırsanız da fena olmaz.",
  "international2023_predictions_title": "ORACLE'IN MÜCADELESİ",
  "international2023_predictions_intro": "Oracle geleceği görmek için astral göbek bağı büyüsünü kullanıyor. Hevesinizi kaçırmak istemeyiz ama aslında göbek bağı büyüsü diye bir şey yok. Bu yüzden kazanmak için kurnazlığınızı, e-spor bilginizi ve hepsinden önemlisi en iyi tahminlerinizi kullanmanız gerekecek.\\n\\nTurnuvada her hafta sonu hangi takımların devam edeceği ve hangilerinin eleneceği (tıpkı Oracle gibi ancak göbek bağı kısmı olmadan) tahmin edin. Doğru tahminler, kehanet tahminlerini kastediyoruz, size Dergi Puanı kazandıracaktır.",
  "international2023_predictions_group_stage_title": "GRUP AŞAMASINI TAHMİN EDİN",
  "international2023_predictions_group_stage_desc": "Bu yıl her gruptaki takımların sırasını da tahmin edebileceksiniz.",
  "international2023_predictions_ingame_title": "OYUN İÇİ TAHMİNLER",
  "international2023_predictions_ingame_desc": "Oyun içinde veya Twitch'te izlerken, her maç savaş borusu çalmadan önce tahmin gücünüzü test edin. Her doğru tahmin için günde altıya kadar Dergi Puanı kazanacaksınız.",
  "international2023_rewards_title": "DERGİ ÖDÜLLERİ",
  "international2023_rewards_intro": "Rekabetçi Dota hayranıysanız ve rekabetçi Dota hayranı olduğunuz için ödüllendiriliyorsanız, bu yılın ödülleri tam size göre. 2023 Dergisi tamamen The International 2023 ve Dota Profesyonel sahnesine odaklanmıştır.",
  "international2023_rewards_physical_aegis_title": "FİZİKSEL AEGIS MODELİ",
  "international2023_rewards_physical_aegis_desc": "Ünlü şampiyon ödülünün 1/5 ölçekli nikel alaşımlı kopyası. Gururla sergileyin! İstediğiniz süreyle sergileyin! İsterseniz eritin ve kendi para biriminizi yaratın!",
  "international2023_rewards_chat_wheels_title": "Kalıcı Sohbet Çarkları",
  "international2023_rewards_chat_wheels_desc": "Önceki yıllardan farklı olarak artık tüm sohbet çarkları kalıcıdır. Tıpkı başlıkta da söylediğimiz gibi. Evet, bu metin biraz gereksiz geliyor. Ama sizinle biraz daha vakit geçirmek güzel.",
  "international2023_rewards_stickers_title": "Oyuncu ve Takım Çıkartmaları",
  "international2023_rewards_stickers_desc": "\"Yalnızca takım çıkartmaları mı?\" Başlığı bile okumadınız değil mi? Oyuncu çıkartmaları da var. Dürüst olmak gerekirse, bu paragraflar sadece başlığı gözlerinize taşırken korumak için kullanılan ambalaj köpüklerinden ibaret.",
  "international2023_rewards_hud_title": "The International 2023 Gösterge PANELİ",
  "international2023_rewards_hud_desc": "Son paragraf insanları bunu okumaya korkutmuş olabilir. Yani eğer buralarda kalmaya devam ettiyseniz oldukça akıllısınız. Bu bir sınavdı ve geçtiniz. Çünkü başlıkta yer almayan bazı bilgiler var: Yeni görünüm, bu yılın vitray teması kullanılarak özel olarak tasarlandı.",
  "international2023_rewards_loading_screens_title": "YÜKLEME EKRANLARI",
  "international2023_rewards_loading_screens_desc": "Her takım için özel vitray temalı bir yükleme ekranının yanı sıra bu yılki TI'ın önemli çizimlerinden bazılarını alacaksınız.",
  "international2023_rewards_materials_title": "FANTEZİ LİGİ VE TI'A DOĞRU MÜCADELE GÜÇLENDİRMELERİ",
  "international2023_rewards_materials_desc": "Fantezi Ligi Mücadelesi'nde daha iyi oyuncular yaratmak için özel araçları kullanın veya TI'a Doğru Mücadelesi'nde özellikle zorlu içerikler üzerinde çalışın.",
  "international2023_rewards_teleport_fx_title": "FAVORİ TAKIM IŞINLANMA EFEKTLERİ",
  "international2023_rewards_teleport_fx_desc": "Üç farklı seviyedeki özel ışınlanma efektleriyle favori takımınızı oyun içinde sergileyin.",
  "international2023_rewards_Types_title": "Ödül Türleri",
  "international2023_rewards_Types_desc": "Her ödül türünün kendi ilerleme göstergesi vardır. Gösterge dolduğunda bu ödülü alabilirsiniz. Bazı göstergeleri istediğiniz kadar tekrar doldurulabilirsiniz, bazılarını ise yalnızca belirli sayıda tekrar doldurulabilirsiniz.",
  "international2023_rewards_Levels_title": "Dergi Seviyesi",
  "international2023_rewards_Levels_desc": "Dergi etkinliklerine katılarak veya Seviye Paketleri satın alarak Dergi Seviyeleri kazanın. TÜM ödül türlerinin ilerleme göstergelerini artırmak için seviyeleri uygulayın.",
  "international2023_rewards_Boosters_title": "Güçlendiriciler",
  "international2023_rewards_Boosters_desc": "Güçlendiriciler, Dergi Seviyeleri gibidir ancak tek bir ödülü artırmak için kullanılır. Bir ödüle güçlendirici uygulamak, Koleksiyoncunun Kalkanı'nın ilerlemesini de artırır.",
  "international2023_supporters_clubs_title": "TARAFTAR KULÜPLERİ",
  "international2023_supporters_clubs_subtitle": "Favori Takımlarınızı Doğrudan Destekleyin",
  "international2023_supporters_clubs_intro": "Taraftar kulübü ödülleri gençlik eğlenceleri gibidir; fırsatınız varken tadını çıkarın çünkü geçicidirler. Yani en azından önceden geçiciydiler. Artık kalıcı oldular! Yani sonsuza kadar tadını çıkarabilirsiniz! Tabii otobüs çarpmazsa.\\n\\n Daha da iyisi: Tüm satışların %50'si doğrudan takıma gidiyor. Bu, onlar için daha iyi. İlk bahsettiğimiz ise sizin için daha iyi.",
  "international2023_supporters_clubs_tiers_title": "Üç Destek Sınıfı",
  "international2023_supporters_clubs_tiers_desc": "Favori takımlarınız için Bronz, Gümüş veya Altın sınıf desteğini seçin ve takımların bizzat tasarladıkları ödülleri kazanın.",
  "international2023_talent_title": "EKİP ÇIKARTMALARI",
  "international2023_talent_subtitle": "En Sevdiğiniz Ekip Üyesini Doğrudan Destekleyin",
  "international2023_talent_intro": "Canlı e-spor yayıncılığı zor bir iştir. Kömür madenciliği kadar zor değil tabii. Ama Etsy'de bir şeyler örmekten daha zor. Tabii ki tüm örgü türlerinden zor değil. Rengârenk kroşelenmiş hırkalardan bazıları oldukça karmaşık görünüyor. \\n\\n Artık en sevdiğiniz ekip üyesine şunu söyleyen bir mesaj gönderebilirsiniz: \"Merhaba… Yaptığın işe saygı duyuyorum. Bir madenci kadar olmasa da Etsy yaratıcılarının en az %50'sinden daha fazla saygı duyuyorum.\" %50'den bahsetmişken, ekip çıkartmalarından elde edilen gelirin yarısı doğrudan ekip üyesine gidiyor.",
  "international2023_talent_tiers_title": "SEVİYENİZİ SEÇİN",
  "international2023_talent_tiers_desc": "En sevdiğiniz ekip üyesini içeren ödül paketleri satın alın. Paketler, satın alınan paketin seviyesine bağlı olarak çıkartma, sesli mesaj ve imzalardan oluşan bir kombinasyonu içerir.",
  "international2023_talent_coming_soon": "Ekip paketleri, ekip üyeleri duyurulduktan sonra satın alınabilecek.",
  "international2023_coming_soon": "Pek Yakında",
  "ti12_bp_countdown_header": "Grup Aşamasına Doğru",
  "ti12_bp_countdown_desc": "Seattle'dan canlı yayınlanacak ve ucunda Şampiyonların Kalkanı bulunan yılın en büyük e-spor turnuvasını izleyin.",
  "ti12_bp_tournament_complete_desc": "Yılın en büyük e-spor turnuvasının coşkusunu yeniden yaşayın; Seattle'daki tüm heyecanlı anlar sadece bir tık uzakta.",
  "ti12_group_stage_venue": "ÇEVRİMİÇİ",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "TURNUVAYI DESTEKLEYİN",
  "ti12_compendium_header": "THE INTERNATIONAL 2023 DERGİSİ",
  "ti12_compendium_desc": "The International 2023 Dergisi ile turnuva sezonundan daha fazlasının kilidini açın. TI'a Doğru Mücadelesi ile bir profesyonel gibi oynayın. Yeniden tasarlanan Fantezi ligi ile favori profesyonel oyuncularınızdan oluşan bir kadro oluşturun. Tahmin becerilerinizi Oracle'ın Mücadelesi ile test edin. Ve umarım takımlar yepyeni Bingo özelliğiyle değişik şeyler yaparlar.\\n\\nOyuncu çıkartmaları, takım çıkartmaları, sohbet çarkları, özel bir görünüm ve daha fazlasının yanı sıra Aegis'in fiziksel kopyası gibi ödüller kazanın.\\n\\nTüm dergi satışlarının %25'i doğrudan The International'ın ödül havuzuna gidiyor.",
  "ti12_compendium_standard": "Standart Dergi",
  "ti12_compendium_upgraded": "Yükseltilmiş Dergi"
}