// 3698.js

{
  "language": "bulgarian",
  "international2023_compendium_activity": "Дейност за притежателите на Compendium",
  "international2023_update_title": "Честването на The International 2023",
  "international2023_update_subtitle": "От фанатици на професионалната сцена до неангажирани играчи, това е-спортно обновление има по нещо за всекиго.",
  "international2023_update_body": "Независимо дали сте грабнати от всяка шеметна секунда през всеки мач на The International, или пък едва ли сте наясно, че хората участват в това нещо, за да си изкарват прехраната и просто искате тихо и кротко да се насладите на играта, продължавайте да четете. В това обновление има нещичко за Вас.\\n\\nФанатични последователи ли сте на е-спорта? Създайте Ваш собствен състав от професионалисти с подобрената <b>въображаема лига</b>. Падате си повече ентусиаст по анализа? Впуснете се в <b>предизвикателството на Oracle</b> за прогнози в скобите. Може би сте големи почитатели на игрите, в които е вземала участие Вашата пралеля. Е, тази година имаме дори <b>бинго</b>!\\n\\nНо може би не сте почитател на нищо от тези неща. Може би просто сте големи почитатели на самите себе си. Имаме нещичко и за Вас — <b>профилното изложение</b>. Профилът Ви вече е интерактивен паметник на себе си, Вашият профил вече е интерактивен монумент на самите Вас, отличавайки всякакви артикули и постижения от игралната Ви историята в Dota 2, които искате да натикате там.",
  "international2023_update_footer": "Стигнахте до края на обновлението. Добра работа!",
  "international2023_compendium": "Compendium",
  "international2023_compendium_title": "Compendium за The International 2023",
  "international2023_compendium_intro": "The International 2023 Compendium е интерактивният Ви дигитален спътник по пътя към The International 2023 и на The International 2023.\\n\\nИграйте като професионалисти с предизвикателството „Пътя към TI“. Подберете своите любими играчи с преработено и обновено предизвикателство за въображаемата лига. Подложете на изпитание своя нрав с прогнозите за груповия етап и скобите. Ударете джакпота със съвсем новите табла за бинго.\\n\\nМислете за Compendium като единственото място, което Ви е нужно, за всякакви дейности и предизвикателства, свързани със събитието. Това също важи за всички от тазгодишните награди, съсредоточени към събитието. Плюс това 25% от приходите при всички продажби ще допринасят към наградния фонд на The International 2023.",
  "international2023_showcase_title": "Профилното изложение",
  "international2023_showcase_subtitle": "Нова характеристика за всички Dota 2 играчи",
  "international2023_showcase_intro": "Обичайният и мини профилът са изцяло преправени за всекиго (е, добре де… за 98% от Вас, които разполагат с комуникационен резултат над 6 000). Вече можете да се похвалите с всичките си артикули и постижения в Dota 2. Буквално всичко в Dota 2 инвентара Ви. Всичко това е възможно с новото профилно изложение.\\n\\nИскате да направите светилище на своя любим професионален отбор от 2016? Можете да го сторите. А какво ще кажете за колекция от любимите Ви набори за герои? Абсолютно можете да го сторите. По един от всеки възможен чифт обувки на Kunkka? За жалост, да. Технически можете да сторите и това.",
  "international2023_showcase_profile_title": "Обновен профил",
  "international2023_showcase_profile_desc": "Вие сте Микеланджело, а профилът Ви вече е Вашето платно. Ограничени сте само от своето въображение (и елементарното Ви чувство за човешко благоприличие).",
  "international2023_showcase_mini_profile_title": "Обновен мини профил",
  "international2023_showcase_mini_profile_desc": "Мини профилите много приличат на обичайните такива, с една съществена разлика… Дръжте се да не паднете… Те са по-малки. Другите играчи ще виждат мини профила Ви всеки път, когато задържат курсора на мишката над Вашето име.",
  "international2023_showcase_carousel_title": "Примерни изложения",
  "international2023_showcase_items_title": "Изложение за артикули",
  "international2023_showcase_items_desc": "Персонализирайте своите изложения с огромен асортимент от всички артикули и награди, които сте събирали през годините.",
  "international2023_showcase_item_heroes_title": "Герои",
  "international2023_showcase_item_trophies_title": "Трофеи",
  "international2023_showcase_item_stickers_title": "Стикери",
  "international2023_showcase_item_stats_title": "Статистики",
  "international2023_showcase_item_chat_wheels_title": "Чат рулетки",
  "international2023_showcase_item_sprays_title": "Спрейове",
  "international2023_showcase_item_items_title": "Артикули в оръжейната",
  "international2023_showcase_item_emoticons_title": "Емотикони",
  "international2023_showcase_item_loading_screens_title": "Екрани при зареждане",
  "international2023_showcase_item_couriers_title": "Куриери",
  "international2023_showcase_item_wards_title": "Wards",
  "international2023_tournament_prize_pool": "Награден фонд",
  "international2023_tournament_prize_pool_percent": "25% от приходите при всички продажби на The International 2023 Compendium ще допринасят към наградния фонд за The International 2023.",
  "international2023_tournament_learn_more": "Научете още относно турнира",
  "international2023_quests_title": "Предизвикателството за пътя към The International",
  "international2023_quests_intro": "Гледали сте професионалистите. Ликували сте за тях. Сега играйте като едни от тях. Пъхнете се в игралния стол на своите любими е-спортни професионалисти и пресъздайте най-великите им моменти от изминалата година. Спечелете като някой техен герой от специфичен мач или като един от петте, които са използвали през даден месец в сезона. Печелете точки за всяко предизвикателство и бонус такива за завършване на пълни набори от предизвикателства.",
  "international2023_quests_match_title": "Предизвикателства за мачове",
  "international2023_quests_match_desc": "Спечелете, използвайки герои от действителен мач на професионалист.",
  "international2023_quests_pro_title": "Предизвикателства за играчи",
  "international2023_quests_pro_desc": "Спечелете като един от най-избираните герои на даден професионалист.",
  "international2023_quests_rewards_title": "Печелете награди",
  "international2023_quests_rewards_desc": "Повишете мощта на своите награди със спечелените междувременно Compendium точки.",
  "international2023_fantasy_title": "Еволюирана въображаема лига",
  "international2023_fantasy_intro": "Изберете отбор от своите любими професионалисти. Създайте статистиките, които смятате, че ще бъдат най-ценни. Съревновавайте се с играчите по целия свят, за да спечелите най-много точки. Това е въображаемата Dota 2 лига, която помните, но преосмислена във всяко отношение.",
  "international2023_fantasy_players_title": "Избирайте",
  "international2023_fantasy_players_desc": "Подберете своите любими Core, Mid и Support играчи.",
  "international2023_fantasy_craft_title": "Изработвайте",
  "international2023_fantasy_craft_desc": "Използвайте преизбиранията, спечелени редом с Compendium наградите, за да се опитате да създадете най-добрите статистики за Вашите играчи. Избирайте внимателно! Дадени статистики са по-добри за някои играчи, отколкото други.",
  "international2023_fantasy_compete_title": "Съревновавайте се",
  "international2023_fantasy_compete_desc": "Всеки уикенд от турнира е отделен кръг на въображаемата лига. Ето защо ще разполагате с множество шансове да се съревновавате срещу приятелите си и света. Печелете Compendium точки, а ако рангът Ви в класацията е достатъчно висок, ще получите и уникален трофей.",
  "international2023_bingo_title": "Бинго",
  "international2023_bingo_intro": "Изпитвате ли лека тръпка всеки път, когато даден професионален отбор купи Divine Rapier? Или когато някой мач продължава над 80 минути и всичко започва да става малко странно? А какво ще кажете за това, когато отбор от герои с 16 крака се сражава с отбор само с четири?\\n\\nЕ, пригответе се най-сетне да спечелите от това вълнение. Бингото е тук, за да Ви позволи да извлечете печалба от някои наистина шантави събития.",
  "international2023_bingo_cards_title": "ПО ЕДНА БИНГО КАРТА ЗА УИКЕНД",
  "international2023_bingo_cards_desc": "Всички притежатели на Compendium ще получат нова произволно генерирана бинго карта за всяка семица от турнира. Тази карта е претъпкана с квадратчета, съдържаща странни условия и интересни ситуации, за които можете да тършувате, докато професионалистите се съревновават.",
  "international2023_bingo_rewards_title": "Завършвайте редове, печелете точки",
  "international2023_bingo_rewards_desc": "Точно така. Не позволявайте на боговете, демоните и винаги готовите за кавги горски създания да Ви заблудят. Това все още си е просто бинго, хорица. Когато завършвате цял ред, колона или диагонал на Вашата бинго карта, ще заявявате награда от Compendium точки. Забележка: Извикването на „БИНГО“ не е задължително, но се насърчава.",
  "international2023_predictions_title": "Предизвикателството на Oracle",
  "international2023_predictions_intro": "Oracle използва магията на астралната пъпна връв, за да вижда бъдещето. Е, не ни се ще да Ви разочароваме, но магията базирана на астралната пъпна връв не е истинска. Ще трябва да използвате своята лукавост, познания в е-спорта и най-важното, най-добрите си предположения, за да свършите работата.\\n\\nПрогнозирайте кои отбори ще напреднат или ще отпаднат по време на всеки турнирен уикенд досущ като Oracle, но без пъпна връв. Правилните предположения (имаме предвид гадания, наподобяващи тези на Oracle) ще Ви печелят Compendium точки.",
  "international2023_predictions_group_stage_title": "Прогнози за груповия етап",
  "international2023_predictions_group_stage_desc": "Ново за тази година, опитайте да направите прогнози за реда на отборите във всяка група.",
  "international2023_predictions_ingame_title": "Прогнози в играта",
  "international2023_predictions_ingame_desc": "Докато гледате в играта или по Twitch, подложете на изпитание мощта на своите предсказания преди рога за началото на всеки мач. Ще печелите Compendium точки за всяка правилна прогноза, до шест на ден.",
  "international2023_rewards_title": "Compendium награди",
  "international2023_rewards_intro": "Ако сте почитатели на съревнователната Dota 2 и бивате възнаграждавани за това, че сте такива, то тазгодишните награди са за Вас. Compendium 2023 е фокусиран изцяло върху The International 2023 и професионалната Dota 2 сцена.",
  "international2023_rewards_physical_aegis_title": "Физически модел на Aegis",
  "international2023_rewards_physical_aegis_desc": "Реплика от никелова сплав в мащаб 1/5 на прочутата шампионска награда. Излагайте я с гордост! Излагайте я с нежелание! Разтопете я и си направете своя собствена валута!",
  "international2023_rewards_chat_wheels_title": "Перманентни чат рулетки",
  "international2023_rewards_chat_wheels_desc": "За разлика от предходните години, всичките чат рулетки вече са перманентни. Точно както твърди заглавната част. Да, този текст ни се струва някак излишен. Но е хубаво да прекараме малко допълнително време с Вас.",
  "international2023_rewards_stickers_title": "Стикери на играчи и отбори",
  "international2023_rewards_stickers_desc": "„Само отборни стикери?“ Дори не сте прочели заглавието, а? Получавате и стикери на играчите. Честно казано, тези параграфи са просто уплътняващ материал, предназначен да защити заглавието, докато то преминава към очите Ви.",
  "international2023_rewards_hud_title": "The International 2023 проекционен дисплей",
  "international2023_rewards_hud_desc": "Този последен абзац може и да е изплашил хората да не прочетат настоящия. И така, ако сте се задържали… Доста находчиво. Това беше изпитание, което преминахте. Защото… Ето Ви малко информация, която не е включена в заглавието — новият проекционен дисплей е специално проектиран, използвайки тазгодишната стъклописна тематика.",
  "international2023_rewards_loading_screens_title": "Екрани при зареждане",
  "international2023_rewards_loading_screens_desc": "Ще получите персонализиран екран при зареждане със стъклописна тематика за всеки отбор, както и няколко от ключовите художествени творчества от тазгодишния TI.",
  "international2023_rewards_materials_title": "Повишаване на мощта за предизвикателства от въображаемата лига и пътят към TI",
  "international2023_rewards_materials_desc": "Използвайте персонализирани инструменти, така че да създадете по-добри играчи в предизвикателство от въображаемата лига или преодолейте особено трудното съдържание в „Пътя към TI“.",
  "international2023_rewards_teleport_fx_title": "Ефекти при телепортиране на любим отбор",
  "international2023_rewards_teleport_fx_desc": "Похвалете се със своя любим отбор в играта чрез персонализирани ефекти при телепортиране на три различни нива.",
  "international2023_rewards_Types_title": "Типове награди",
  "international2023_rewards_Types_desc": "Всеки тип награда разполага със свое собствено отчитане на напредъка. Когато то се запълни, можете да заявите тази награда. Някои отчитания на напредъка могат да бъдат запълвани толкова пъти, колкото искате, докато при други това може да става само определен брой пъти.",
  "international2023_rewards_Levels_title": "Compendium нива",
  "international2023_rewards_Levels_desc": "Печелете Compendium нива, като участвате в дейности от Compendium или закупувайте пакети с такива. Прилагайте нива, за да увеличите отчитането на напредъка за ВСИЧКИ типове награди.",
  "international2023_rewards_Boosters_title": "Подсилвания",
  "international2023_rewards_Boosters_desc": "Подсилванията са като Compendium нивата, но за увеличаване на една специфична награда. Прилагането на подсилване към дадена награда също дава напредък за Collector's Aegis.",
  "international2023_supporters_clubs_title": "Клубове на привържениците",
  "international2023_supporters_clubs_subtitle": "Подкрепяйте директно своите любими отбори",
  "international2023_supporters_clubs_intro": "Наградите от клуба на привържениците са като радостите на младостта. Наслаждавайте им се, докато можете, защото са мимолетни. Или поне бяха. Считано от сега, вече са перманентни! Ето защо вече можете да им се наслаждавате завинаги! Освен ако не Ви блъсне автобус.\\n\\nДори нещо по-добро. 50% от приходите при всички продажби отиват директно към отбора. Е, нещо по-добро за тях. Първото е по-добро за Вас.",
  "international2023_supporters_clubs_tiers_title": "Три поредици от подкрепа",
  "international2023_supporters_clubs_tiers_desc": "Изберете бронзова, сребърна или златна подкрепа за своите любими отбори, така че да спечелите награди, проектирани от самите отбори.",
  "international2023_talent_title": "Стикери на таланти",
  "international2023_talent_subtitle": "Подкрепяйте директно своите любими таланти",
  "international2023_talent_intro": "Живото предаване на е-спортни събития е трудоемко начинание. Не чак като въгледобива, очевидно. Но по-трудно от направата на плетива за продажба в някой уебсайт. Е, очевидно това не важи за всички плетива. Някои от тези колоритни плетени на една кука жилетки изглеждат доста сложнички.\\n\\nСега можете да изпратите съобщение до своя любим талант, което да гласи: „Хей… Уважавам това, което правите. Не толкова, колкото миньорската работа, но повече от поне 50% от творците в някой уебсайт за продажба на плетива.“ Като говорим за 50%, половината от всички приходи при продажбата на стикери за таланти отиват направо при тях.",
  "international2023_talent_tiers_title": "Изберете своята поредица",
  "international2023_talent_tiers_desc": "Закупувайте наградни комплекти с участието на любимия Ви талант. Комплектите включват комбинация от стикери, гласови реплики и автографи. Това зависи от поредицата за подкрепа на закупения комплект.",
  "international2023_talent_coming_soon": "Комплектите за таланти ще бъдат достъпни за покупка, след като талантите са били анонсирани.",
  "international2023_coming_soon": "Очаквайте скоро",
  "ti12_bp_countdown_header": "до груповия етап",
  "ti12_bp_countdown_desc": "Присъединете се към нас за най-големия е-спортен турнир на годината, излъчван на живо от Сиатъл, със заветната цел — Aegis of Champions.",
  "ti12_bp_tournament_complete_desc": "Преживейте отново вълненията от най-големия е-спортен турнир на годината — от всичкото действие в Сиатъл Ви дели само едно кликване.",
  "ti12_group_stage_venue": "На линия",
  "ti12_playoffs_venue": "Конгресният център Summit в Сиатъл",
  "ti12_main_event_venue": "Арената Climate Pledge",
  "ti12_compendium_small_header": "Подкрепете турнира",
  "ti12_compendium_header": "Compendium за The International 2023",
  "ti12_compendium_desc": "Отключете дори още повече от турнирния сезон с The International 2023 Compendium. Играйте като професионалист с предизвикателство „Пътя към TI“. Изгответе състав от любимите си професионалисти с преправената въображаема лига. Подложете на изпитание своите умения за прогнозиране с предизвикателството на Oracle. И се надявайте, че отборите ще направят някакви странни неща със съвсем новата бинго характеристика.\\n\\nПечелете награди като например: стикери за играчи или отбори, чат рулетки, персонализиран проекционен дисплей и още други, та чак до физическа реплика на Aegis.\\n\\n25% от приходите при всички продажби на Compendium отиват директно към наградния фонд за The International.",
  "ti12_compendium_standard": "Стандартен Compendium",
  "ti12_compendium_upgraded": "Подобрен Compendium"
}