// 3469.js

{
  "language": "danish",
  "international2023_compendium_activity": "Aktivitet for ejere af kompendiet",
  "international2023_update_title": "Fejring af The International 2023",
  "international2023_update_subtitle": "Den her e-sportsopdatering har noget for alle – lige fra de professionelle entusiaster til de afslappede spillere.",
  "international2023_update_body": "Uanset om du følger med i hvert nervepirrende sekund af The International, eller du bare vil nyde spillet i fred og ro og dårligt nok kender til den professionelle del af spillet, så læs videre! Den her opdatering er relevant for dig.\\n\\nEr du en e-sportsentusiast? Opret din egen holdopstilling af professionelle spillere i den opgraderede <b>fantasiliga</b>. Er du mere den analytiske type? Prøv kræfter med forudsigelserne i <b>Oraklets udfordring</b>. Måske elsker du spil, din bedstemor også spiller. I år kan du spille <b>bingo</b>!\\n\\nMen måske er du slet ikke fan af alt det der. Måske er du bare stor fan af dig selv. Til dig har vi også noget nyt: <b>Profilfremvisningen</b>. Din profil er nu et interaktivt monument til dig selv og kan fyldes med lige så mange genstande og bedrifter fra din spilhistorik, du har lyst til.",
  "international2023_update_footer": "Du er nået til slutningen af opdateringen. Godt gået!",
  "international2023_compendium": "Kompendium",
  "international2023_compendium_title": "The International 2023-kompendiet",
  "international2023_compendium_intro": "Kompendiet er din interaktive digitale følgesvend til Vejen til The International 2023 og selve The International 2023.\\n\\nSpil som en prof med Vejen til TI-udfordringen. Vælg dine yndlingsspillere med en omarbejdet og opdateret fantasiudfordring. Test din evne til at forudsige kampudfald med forudsigelser i gruppefasen og slutspillet. Få pladen fuld med helt nye bingoplader.\\n\\nI kompendiet finder du alt på ét sted: aktiviteter og udfordringer i forbindelse med begivenheden og alle belønningerne for årets begivenhed. Og 25% af salget bidrager til præmiepuljen for The International 2023.",
  "international2023_showcase_title": "Profilfremvisningen",
  "international2023_showcase_subtitle": "Ny funktion til alle Dota-spillere",
  "international2023_showcase_intro": "Profilen og miniprofilen er blevet fuldstændig omarbejdet for alle (eller rettere, de 98% af jer, som har en kommunikationsscore over 6000). Nu kan du vise alle dine bedrifter og bogstaveligt talt hvad som helst fra dit Dota-inventar med den nye profilfremvisning.\\n\\nVil du lave en hyldest til dit foretrukne professionelle hold fra 2016? Det kan du bare gøre. Hvad med en samling af dine foretrukne heltesæt? Det kan du helt sikkert bare gøre. Et af alle de mulige par af Kunkkas sko? Ja, desværre. Teknisk set kan du også bare gøre det.",
  "international2023_showcase_profile_title": "Opdateret profil",
  "international2023_showcase_profile_desc": "Du er Michelangelo – profilen er nu dit lærred, og kun fantasien sætter grænser. (Og grundlæggende menneskelig anstændighed).",
  "international2023_showcase_mini_profile_title": "Opdateret miniprofil",
  "international2023_showcase_mini_profile_desc": "Miniprofiler minder ret meget om profiler, men den største forskel er – og hold nu fast – at de er mindre. Andre spillere får din miniprofil at se, når du holder markøren over dit navn.",
  "international2023_showcase_carousel_title": "Eksempler på fremvisninger",
  "international2023_showcase_items_title": "Fremvis genstande",
  "international2023_showcase_items_desc": "Tilpas dine fremvisninger med et stort udvalg af alle genstandene og belønningerne, du har samlet i løbet af årene.",
  "international2023_showcase_item_heroes_title": "Helte",
  "international2023_showcase_item_trophies_title": "Trofæer",
  "international2023_showcase_item_stickers_title": "Klistermærker",
  "international2023_showcase_item_stats_title": "Statistikker",
  "international2023_showcase_item_chat_wheels_title": "Chathjulsreplikker",
  "international2023_showcase_item_sprays_title": "Sprays",
  "international2023_showcase_item_items_title": "Arsenalgenstande",
  "international2023_showcase_item_emoticons_title": "Emotikoner",
  "international2023_showcase_item_loading_screens_title": "Indlæsningsskærme",
  "international2023_showcase_item_couriers_title": "Kurérer",
  "international2023_showcase_item_wards_title": "Wards",
  "international2023_tournament_prize_pool": "Præmiepulje",
  "international2023_tournament_prize_pool_percent": "25% af salget af The International 2023-kompendiet bidrager til præmiepuljen for The International 2023.",
  "international2023_tournament_learn_more": "Læs mere om turneringen",
  "international2023_quests_title": "Vejen til The International-udfordringen",
  "international2023_quests_intro": "Du har set profferne. Du har heppet på dem. Nu kan du spille som en af dem. Sæt dig i de professionelle e-sportsspilleres gamingstole, og genskab deres største øjeblikke fra det forgangne år. Vind som deres helte fra en bestemt kamp eller som en af fem helte, de har brugt i en given måned i løbet af sæsonen. Optjen point for hver udfordring og bonuspoint for at gennemføre et helt sæt af udfordringer.",
  "international2023_quests_match_title": "Kampudfordringer",
  "international2023_quests_match_desc": "Vind med helte fra en rigtig professionel kamp.",
  "international2023_quests_pro_title": "Spillerudfordringer",
  "international2023_quests_pro_desc": "Vind som en af en professionel spillers mest spillede helte.",
  "international2023_quests_rewards_title": "Optjen belønninger",
  "international2023_quests_rewards_desc": "Gør belønningerne endnu bedre med kompendiumpoint, som du optjener undervejs.",
  "international2023_fantasy_title": "Fantasispillet har udviklet sig",
  "international2023_fantasy_intro": "Vælg et hold med professionelle spillere. Udvælg de statistikker, du tror vil være mest værdifulde. Konkurrer mod spillere fra hele verden om at optjene flest point. Det er den fantasiliga i Dota, du husker, men den er blevet genskabt på alle måder.",
  "international2023_fantasy_players_title": "Vælg",
  "international2023_fantasy_players_desc": "Vælg din foretrukne Core-, Mid- og Support-spiller.",
  "international2023_fantasy_craft_title": "Brug ombytninger",
  "international2023_fantasy_craft_desc": "Brug ombytninger optjent med kompendiumbelønninger til at prøve at finde de bedste statistikker for dine spillere. Vælg med omhu – nogle statistikker er bedre på visse spillere end andre.",
  "international2023_fantasy_compete_title": "Konkurrer",
  "international2023_fantasy_compete_desc": "Hver weekend i turneringen er en separat runde i fantasispillet, så du har flere chancer for at konkurrere mod dine venner og hele verden. Optjen kompendiumpoint, og hvis du kommer højt nok op på førertavlen, får du også et unikt trofæ.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Bliver du ekstra spændt, hver gang et professionelt hold køber en Divine Rapier? Eller når en kamp varer mere end 80 minutter, og alt begynder at føles lidt mærkeligt? Hvad med når et hold af helte med 16 ben kæmper mod et hold med kun fire ben?\\n\\nNu kan du endelig tjene på denne spænding. Du kan nemlig spille bingo og vinde på rigtig mange vanvittige scenarier.",
  "international2023_bingo_cards_title": "ÉN BINGOPLADE PER WEEKEND",
  "international2023_bingo_cards_desc": "Alle kompendiumejere får en ny tilfældigt genereret bingoplade for hver weekend i turneringen. Kvadraterne på pladen er fyldt med mærkelige forhold og interessante situationer, som du kan heppe på, mens de professionelle konkurrerer.",
  "international2023_bingo_rewards_title": "Udfyld rækker og optjen point",
  "international2023_bingo_rewards_desc": "Du læste rigtigt. Lad dig ikke narre af guder, dæmoner og skydegale skovvæsner, det er stadig den bingo, du kender. Når du udfylder en hel række vandret, lodret eller diagonalt på din bingoplade, får du kompendiumpoint som belønning. Bemærk: Du behøver ikke at råbe \"BINGO\", men vi opfordrer til det!",
  "international2023_predictions_title": "Oraklets udfordring",
  "international2023_predictions_intro": "Oraklet bruger overjordisk navlemagi til at se ind i fremtiden. Okay, vi er kede af at afsløre sandheden, men overjordisk navlemagi findes ikke i virkeligheden. Du er nødt til at bruge kløgt, din viden om e-sport og frem for alt dine bedste gæt.\\n\\nForudsig (i stil med Oraklet, men uden navlemagi), hvilke hold der går videre, og hvilke der ikke klarer sig, i hver turneringsweekend. Korrekte gæt (vi mener orakelagtige spådomme) giver dig kompendiumpoint.",
  "international2023_predictions_group_stage_title": "Forudsig gruppefasen",
  "international2023_predictions_group_stage_desc": "Som noget nyt år kan du prøve at forudsige holdenes placering indenfor hver gruppe.",
  "international2023_predictions_ingame_title": "Forudsigelser i spillet",
  "international2023_predictions_ingame_desc": "Når du ser på i spillet eller på Twitch, kan du teste dine forudsigelsesevner, før hornet lyder i hver kamp. Du optjener kompendiumpoint for hver korrekte forudsigelse, op til seks per dag.",
  "international2023_rewards_title": "Kompendiumbelønninger",
  "international2023_rewards_intro": "Hvis du er fan af Dota på konkurrenceplan og af at blive belønnet for at være fan af Dota på konkurrenceplan, så er årets belønninger lige noget for dig. Kompendiet 2023 fokuserer udelukkende på The International 2023 og professionelt Dota.",
  "international2023_rewards_physical_aegis_title": "Fysisk Aegis-model",
  "international2023_rewards_physical_aegis_desc": "En kopi med nikkellegering i 1:5-skala af den berømte præmie til mestrene. Vis den frem med stolthed! Vis den frem uden forpligtelser! Omsmelt den, og lav din egen valuta!",
  "international2023_rewards_chat_wheels_title": "Permanente chathjulsreplikker",
  "international2023_rewards_chat_wheels_desc": "I modsætning til tidligere år er alle chathjulsreplikkerne nu permanente. Præcis som vi nævnte det i overskriften. Ja, denne tekst føles en smule overflødig. Men det er nu rart at bruge lidt ekstra tid sammen med dig.",
  "international2023_rewards_stickers_title": "Spiller- og holdklistermærker",
  "international2023_rewards_stickers_desc": "\"Kun holdklistermærker?\" Du læste slet ikke overskriften, gjorde du? Du får også spillerklistermærker. Ærlig talt er disse afsnit bare flamingochips, som beskytter overskriften på dens vej til dine øjne.",
  "international2023_rewards_hud_title": "The International 2023 – HUD",
  "international2023_rewards_hud_desc": "Det sidste afsnit kan have gjort nogle folk bange for at læse dette, så det var ret klogt af dig at blive hængende. Det var en test, og du bestod. Her kommer der lidt mere information, som ikke fremgår af overskriften: Det nye HUD er udformet som et glasmaleri, hvilket er årets tema.",
  "international2023_rewards_loading_screens_title": "Indlæsningsskærme",
  "international2023_rewards_loading_screens_desc": "Du får en tilpasset indlæsningsskærm med glasmaleritema for hvert hold samt nogle af de centrale motiver fra årets TI.",
  "international2023_rewards_materials_title": "Værktøjer til fantasispillet og Vejen til TI-udfordringen",
  "international2023_rewards_materials_desc": "Brug tilpassede værktøjer for at skabe bedre spillere i fantasiudfordringen, eller arbejd dig igennem særligt svært indhold i Vejen til TI-udfordringen.",
  "international2023_rewards_teleport_fx_title": "Yndlingsholdets teleporteffekter",
  "international2023_rewards_teleport_fx_desc": "Fremvis dit yndlingshold i spillet med tilpassede teleporteffekter i tre forskellige levels.",
  "international2023_rewards_Types_title": "Belønningstyper",
  "international2023_rewards_Types_desc": "Hver belønningstype har sin egen fremskridtsindikator. Når indikatoren er fuld, kan du indløse belønningen. Nogle indikatorer kan fyldes lige så mange gange, du vil, mens andre kun kan fyldes et bestemt antal gange.",
  "international2023_rewards_Levels_title": "Kompendiumlevels",
  "international2023_rewards_Levels_desc": "Optjen kompendium-levels ved at deltage i kompendiumaktiviteter eller købe level-pakker. Brug levels til at øge fremskridt for ALLE belønningstyper.",
  "international2023_rewards_Boosters_title": "Boostere",
  "international2023_rewards_Boosters_desc": "Boostere er ligesom kompendium-levels, men bruges til at øge en bestemt belønning. Når en booster bruges på en belønning, øges fremskridtet også på Collector's Aegis.",
  "international2023_supporters_clubs_title": "Supporterklubber",
  "international2023_supporters_clubs_subtitle": "Støt dit yndlingshold direkte",
  "international2023_supporters_clubs_intro": "Belønningerne fra supporterklubber er som ungdommens glæder – de er flygtige, så nyd dem, mens du kan. Eller de VAR flygtige. Fra nu af er de permanente! Så nu kan du nyde dem for evigt! Medmindre du bliver kørt over af en bus.\\n\\nOg noget, som er endnu bedre, er, at 50% af salget går direkte til holdet. Eller ja, det er bedre for holdet. Den første del om belønningerne er bedre for dig.",
  "international2023_supporters_clubs_tiers_title": "Tre niveauer af støtte",
  "international2023_supporters_clubs_tiers_desc": "Vælg bronze, sølv eller guld for at støtte dine yndlingshold og optjene belønninger, som er designet af holdene selv.",
  "international2023_talent_title": "Talentklistermærker",
  "international2023_talent_subtitle": "Støt dit yndlingstalent direkte",
  "international2023_talent_intro": "Det er hårdt arbejde at lave direkte e-sportsbroadcasts. Selvfølgelig ikke lige så hårdt som kulbrydning.\\n\\nNu kan du sende en besked til dit yndlingstalent og sige: \"Hej, jeg respekterer det, du laver. Ikke helt så meget som en minearbejders slid og slæb, men alligevel.\" Og 50% af indtægterne fra salg af talentklistermærker går direkte til talentet.",
  "international2023_talent_tiers_title": "Vælg dit niveau",
  "international2023_talent_tiers_desc": "Køb belønningsbundter med dit yndlingstalent. Bundter indeholder en kombination af klistermærker, stemmereplikker og autografer, alt efter hvilket niveau af bundtet der købes.",
  "international2023_talent_coming_soon": "Talentbundter kan købes, når talentet er blevet annonceret.",
  "international2023_coming_soon": "Kommer snart",
  "ti12_bp_countdown_header": "Til gruppefasen",
  "ti12_bp_countdown_desc": "Følg med i årets største e-sportsturnering, som broadcastes direkte fra Seattle. Aegis of Champions står på spil.",
  "ti12_bp_tournament_complete_desc": "Genoplev spændingen fra årets største e-sportsturnering – alle kampene fra Seattle er kun et klik væk.",
  "ti12_group_stage_venue": "Online",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Støt turneringen",
  "ti12_compendium_header": "The International 2023-kompendiet",
  "ti12_compendium_desc": "Lås op for endnu mere fra turneringssæsonen med kompendiet til The International 2023. Spil som en prof med Vejen til TI-udfordringen. Lav en holdopstilling bestående af dine yndlingsproffer med det omdesignede fantasispil. Test dine forudsigelsesevner med Oraklets udfordring. Og kryds fingre for, at holdene kommer med nogle skøre påfund med den helt nye bingofunktion.\\n\\nOptjen belønninger såsom spillerklistermærker, holdklistermærker, chathjulsreplikker, et tilpasset HUD og meget mere – måske tilmed en fysisk kopi af Aegis of Champions.\\n\\n25% af kompendiumsalget går direkte til præmiepuljen til The International.",
  "ti12_compendium_standard": "Standardkompendium",
  "ti12_compendium_upgraded": "Opgraderet kompendium"
}