// 4498.js

{
  "language": "swedish",
  "ringmastercomic_title_cover": "Dockan – framsida",
  "ringmastercomic_title": "Dockan – sida %1$s",
  "ringmastercomic_help_text": "Kicka på bilden eller använd mellanslagstangenten för att gå vidare",
  "ringmastercomic_return_button": "Tillbaka till framsidan",
  "ti13_online": "Köpenhamn",
  "ti13_main_event_venue": "Royal Arena – Köpenhamn",
  "ti13_best_of_three": "Bäst av tre",
  "ti13_best_of_five": "Bäst av fem",
  "ti13_group_stage_sp_rules": "Gruppspel – regler för valprioritet",
  "ti13_group_stage_sp_game1": "Myntkastning.",
  "ti13_group_stage_sp_game2": "Första matchen: Myntkastningsvinnaren väljer valprioritet eller sida.",
  "ti13_group_stage_sp_game3": "Andra matchen: Myntkastningsförloraren väljer valprioritet eller sida.",
  "ti13_group_stage_sp_game4": "Tredje matchen (om relevant): Nytt myntkast. Den nya myntkastningsvinnaren väljer valprioritet eller sida.",
  "ti13_group_stage_tie_rules": "Gruppspel – regler vid oavgjort",
  "ti13_first_second_tie": "Två lag på delad förstaplats",
  "ti13_second_third_tie": "Två lag på delad andraplats",
  "ti13_third_fourth_tie": "Två lag på delad tredjeplats",
  "ti13_three_way_first_tie": "Tre lag på delad förstaplats",
  "ti13_three_way_second_tie": "Tre lag på delad andraplats",
  "ti13_four_way_tie": "Fyra lag på delad förstaplats",
  "ti13_tie_resolve_bo3": "Avgör med bäst av tre.",
  "ti13_tie_resolve_third_fourth": "Inga ytterligare matcher spelas. De två lagen förblir på delad tredje plats.",
  "ti13_tie_resolve_first_with_round_robin": "Avgör första plats genom att alla spelar bäst av en mot varandra tills ett lag vinner två gånger.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Fortsätt att spela tills alla lag har spelat mot varandra minst en gång. Använd de senaste alla mot alla-resultaten för att avgöra andra och tredje plats.",
  "ti13_tie_resolve_second_with_round_robin": "Avgör andra plats genom att alla spelar bäst av en mot varandra tills ett lag vinner två gånger.",
  "ti13_tie_resolve_third_fourth_other": "Inga ytterligare matcher spelas. De två lagen förblir på delad tredje plats.",
  "ti13_tie_resolve_four_way_1": "Para ihop lagen slumpmässigt. Vi kallar lagen Lag A, Lag B, Lag C och Lag D i detta exempel på reglerna.",
  "ti13_tie_resolve_four_way_2": "Lag A spelar mot Lag B i bäst av en. Lag C spelar mot Lag D i bäst av en.",
  "ti13_tie_resolve_four_way_3": "Avgör första plats genom att spela en bäst av en-match mellan vinnaren av A/B och vinnaren av C/D.",
  "ti13_tie_resolve_four_way_4": "Avgör fjärde plats genom att spela en bäst av en-match mellan förloraren av A/B och förloraren av C/D.",
  "ti13_tie_resolve_four_way_5": "Avgör andra och tredje plats genom att spela en bäst av en-match mellan de återstående lagen.",
  "ti13_seeding_decider_sp_rules": "Seedingavgörande – valprioritetsregler",
  "ti13_seeding_decider_sp_rules_1": "Första matchen: Det högre seedade laget från gruppspelet väljer valprioritet eller sida.",
  "ti13_seeding_decider_sp_rules_2": "Andra matchen: Det lägre seedade laget från gruppspelet väljer valprioritet eller sida.",
  "ti13_seeding_decider_sp_rules_3": "Tredje matchen (om relevant): Det högre seedade laget från gruppspelet väljer valprioritet eller sida.",
  "ti13_playoffs_and_ti_sp_rules": "Slutspel och The International – valprioritetsregler",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Myntkastning.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Första matchen: Myntkastningsvinnaren väljer valprioritet eller sida.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Andra matchen: Myntkastningsförloraren väljer valprioritet eller sida.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Tredje matchen (om relevant): Nytt myntkast. Den nya myntkastningsvinnaren väljer valprioritet eller sida.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Första matchen: Vinnaren av den övre gruppen väljer valprioritet eller sida.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Andra matchen: Vinnaren av den nedre gruppen väljer valprioritet eller sida.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Tredje matchen: Vinnaren av den övre gruppen väljer valprioritet eller sida.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Fjärde matchen: Vinnaren av den nedre gruppen väljer valprioritet eller sida.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Femte matchen (om relevant): Myntkast. Myntkastningsvinnaren väljer valprioritet eller sida.",
  "international2024_update_title": "TI 2024, Ringmaster och kompendiet",
  "ringmaster_hype": "”Lich och Lina, Slark och Marci, offer i alla åldrar! Ögonblicket ni alla har väntat på är äntligen här.\\n\\n I ett år nu, så känns det i alla fall, har jag endast existerat vid namn. Jag har blivit omtalad i tysta viskningar som en lurande skugga bakom den blodröda ridån. Men nu, sent (för sent om du frågar mig) om sider, har idioterna som ansvarar för det här spektaklet tagit sitt förnuft till fånga och låtit mig välsigna er med min storhet och ta min ödmjuka plats i rampljuset! Det är jag, Cogliostro Kettle, den illvilliga maestron! De fördömdas talman! Självaste RINGMASTER! Och jag har några ess i ärmen!”",
  "ringmaster_comic": "”Men ta mig inte på ordet! Varför inte läsa en serie om min tragiska ursprungshistoria, berättad av en pålitlig, anonym berättare?”",
  "ringmaster_comic_title": "Dockan",
  "ringmaster_comic_desc": "Läs om Ringmasters tidiga turnerande med Kettles mekaniska cirkus.",
  "ringmaster_guide": "”Jag har blivit ombedd att vara din guide genom årets kompendium – ett erbjudande som jag tacksamt tackade ja till. När allt kommer omkring borde vi lära känna varandra! [b]Vad sägs om att sätta igång?[/b]”",
  "ringmaster_introducing": "Vi presenterar",
  "ringmaster_hero_detail_button": "Visa hjältesida",
  "ringmaster_play_trailer_button": "Spela trailern",
  "ringmaster_comic_button": "Läs serien",
  "international2024_compendium": "kompendium 2015",
  "international2024_compendium_title": "International 2024-kompendiet",
  "international2024_effigies_title": "STATYER PER HJÄLTE",
  "international2024_effigies_subtitle": "Uppgraderad funktion, gratis för alla",
  "international2024_effigies_intro": "”En gång i tiden, mina vänner, för inte så värst längesedan, var dessa storslagna statyer verkligen en sällsynt syn! Nu finns det ett monument som väntar på varje titan som är på väg att beträda stridsfältet, vare sig de är Ringmaster eller någon av de andra sämre hjältarna!”",
  "international2024_effigies_desc": "Du kan forma statyer av favorithjältarna att visa fram i basen. Istället för en delad global plats har varje hjälte nu sin egen plats för statyer i vapenförrådet.\\n\\nDu kan välja att hålla dig till standardstatyn för hjälten eller skapa och utrusta hur du själv vill.",
  "international2024_purchase_intro": "”Gudar och monster, kryp och djur, kom fram och vila ögonen på [b]den mest spännande samlingen av spel, event och e-sportbelöningar[/b] på denna sida av floden! Testa ditt förnuft, din tur och ditt mod i ett firande av det största e-sporteventet i detta rike och alla andra!”",
  "international2024_activities": "DET HÄR FÅR DU",
  "international2024_activities_subtitle": "Chansspel, skicklighetsbedrifter och nöjen för alla åldrar ",
  "international2024_activities_intro": "”Till skillnad från den stabila ceremonimästaren har jag fått höra att en del av er behöver en ANLEDNING till att döda, så därför får du poäng för varje match som du spelar! Ju mer du spelar, desto mer tjänar du, så kasta dig ut på vägarna så ska du se hur snabbt poängen samlas in!”",
  "international2024_activities_play_title": "Spela Dota: tjäna poäng",
  "international2024_activities_play_desc": "I år får du poäng för nästan varje match som du spelar under veckans utmaning. Du får också bonuspoäng för dagens första vinst.",
  "international2024_activities_fantasy_title": "Fantasiliga",
  "international2024_activities_fantasy_desc": "Tävla mot vänner och Dota-spelare från hela världen. Välj den bästa fantasiuppställningen med dina favoritproffs och skapa personanpassade kort med attribut som förbättrar poängen.",
  "international2024_activities_oracles_title": "Oraklets utmaning",
  "international2024_activities_oracles_desc": "Förutse vilka lag som går vidare och vilka som inte klarar sig, och njut av noggrannheten av dina prognoser (förutsatt att du hade rätt).",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Få slumpmässigt genererade bingokort under varje etapp i turneringen, fulla av konstiga villkor och intressanta situationer.",
  "international2024_activities_outro": "”Kom ihåg! Att vinna är inte bara en belöning i sig själv! Du tjänar poäng varje gång du lyckas med en av aktiviteterna! Ta dig över till prisbåset nedan och ta reda på allt det roliga som du kan få för dem!”",
  "international2024_rewards_title": "Kompendiebelöningar",
  "international2024_rewards_subtitle": "Kom närmare och ta en titt på priserna",
  "international2024_rewards_intro": "”Stapla liken högt och hämta dina priser! Ahhh, och VILKA priser som väntar! Nej, priset är inte att gripa händerna om en hals och se livet rinna ur en olycklig hjältes ögon. Det är en belöning i sig SJÄLV! Detta är vad du får EFTERÅT!”",
  "international2024_rewards_physical_aegis_title": "Fysisk Aegis-modell",
  "international2024_rewards_physical_aegis_desc": "Fyll det Aegis-formade tomrummet på hyllan och i hjärtat med en nickelkopia av den berömda trofén i 1:5-skala.",
  "international2024_rewards_hud_title": "HUD till The International 2024",
  "international2024_rewards_hud_desc": "Försköna gränssnittet i spelet i cirkusens anda. Vi har piffat upp HUD:n kring årets TI-tema.",
  "international2024_rewards_versus_title": "Versusskärm 2024",
  "international2024_rewards_versus_desc": "Piffa till din kämpaglöd innan spelstart med en anpassad versusskärm som visar upp de nya statyplatserna för hjältar.",
  "international2024_rewards_chat_wheels_title": "Permanenta chatthjul",
  "international2024_rewards_stickers_title": "Spelar- och lagklistermärken",
  "international2024_rewards_loading_screens_title": "Laddningsskärmar",
  "international2024_rewards_materials_title": "Fantasi- och bingoverktyg",
  "international2024_rewards_teleport_fx_title": "Favoritlagets teleporteringseffekter",
  "international2024_rewards_effigy_title": "Statyblock 2024",
  "international2024_supporters_clubs_title": "Stöd gemenskapen",
  "international2024_supporters_clubs_subtitle": "Supporterbuntar för spelare och lag",
  "international2024_supporters_clubs_intro": "”Ärade välgörare! Filantroper i alla åldrar! Ödmjuka fantaster av konsten att döda och närliggande aktiviteter! 50 % av er storsinnade generositet går direkt till era favoritlag och sändningstalanger! Vem är den riktiga hjälten här? Jag, såklart! Jag klappar mina enorma, heroiska händer åt DIG!”",
  "international2024_supporters_clubs_tiers_title": "Supporterklubbar",
  "international2024_supporters_clubs_tiers_desc": "Välj brons, silver eller guld som stöd för dina favoritlag och tjäna belöningar designade av lagen själva.",
  "international2024_talent_tiers_title": "Paket med talangklistermärken",
  "international2024_talent_tiers_desc": "Köp belöningsbuntar med din favorittalang i huvudrollen. Buntar innehåller en kombination av klistermärken, röstrepliker och autografer beroende på det köpta paketets nivå.",
  "ti13_compendium_small_header": "Stöd turneringen",
  "ti13_compendium_header": "International 2024-kompendiet",
  "ti13_compendium_desc": "Kompendiet är din interaktiva digitala följeslagare till The International. I kompendiet hittar du all på en och samma plats: eventrelaterade aktiviteter, utmaningar och årets alla eventfokuserade belöningar. Dessutom kommer 25 % av all försäljning att bidra till prispotten för The International 2024.",
  "ti13_compendium_bp_btn": "Besök webbplatsen",
  "ti13_compendium_standard": "Standardkompendium",
  "ti13_compendium_standard_subtitle": "Alla funktioner och aktiviteter",
  "ti13_compendium_upgraded": "Uppgraderat kompendium",
  "ti13_compendium_upgraded_subtitle": "Alla funktioner och aktiviteter plus påskyndade belöningar",
  "ti13_compendium_purchase_tp_fx": "TI 2024 – teleporteringseffekt (nivå 1)",
  "ti13_compendium_purchase_boosters_footnote": "Boosters kan låsa upp ytterligare innehåll som du väljer",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Boosters kan låsa upp HUD för The International 2024 eller annat innehåll som du väljer.",
  "ti13_compendium_purchase_levels": "%1$s kompendienivåer",
  "ti13_compendium_purchase_booster_levels": "%1$s boosters",
  "ti13_compendium_purchase_discount": "Spara %1$s % på nivåer",
  "ti13_compendium_purchase_earn_the_following": "Kompendienivåer låses upp:",
  "ti13_compendium_contribution": "25 % av all försäljning bidrar till prispotten för The International 2024.",
  "ti13_compendium_purchase_all_access": "Tillgång till alla kompendiefunktioner",
  "ti13_compendium_purchase_aegis_emoticon": "Uttryckssymbol: Aegis ",
  "ti13_compendium_purchase_bingo_tokens": "%1$s bingopolletter",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s bytespolletter till fantasiligan",
  "ti13_compendium_purchase_one_player_sticker": "En kapsel med spelarklistermärken",
  "ti13_compendium_purchase_player_stickers": "%1$s kapslar med spelarklistermärken",
  "ti13_compendium_purchase_team_stickers": "%1$s kapslar med lagklistermärken",
  "ti13_compendium_purchase_effigy_blocks": "%1$s statyblock – The International 2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s skatter med lagladdningsskärm",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s skatter med laddningsskärm",
  "international2024_tournament_learn_more": "Läs mer om turneringen",
  "ringmaster_abilities_heading": "Förmågor",
  "ringmaster_souvenirs_heading": "Souvenirer",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "KANALISERAD – Ringmaster snurrar sin piska och snärtar den sedan. Piskade fiender skadas och flyr i fruktan från Ringmaster. Kanaliseringstiden ökar exponentiellt skadan och förlänger fruktans varaktighet, men minskar radien.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster packar sig själv eller en allierad hjälte i en flyttbar, överdimensionerad låda. Nedpackade enheter får obehindrad förflyttning, nedsaktningsresistens, extra magiresistens och extra förflyttningshastighet. De är också otillgängliga som attackmål, dämpade, tystade och avväpnade. Lådan öppnas efter att effekten upphört eller hjälten rör sig utanför radien.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster kastar en av sina dolkar till en exakt punkt som han själv väljer. Om han träffar en fiende orsakar dolken träffskada, den träffade enheten saktas ned för en kort stund och gör en procentandel av offrets maximala HP i skada varje sekund.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster rullar Wheel of Wonder till vald plats och knuffar undan fiender längs vägen. När den har nått sitt mål tar fiender inom hjulets räckvidd skada med tiden och saktas ned. Fiender som möter hjulet i mer än 0,5 sekunder trollbinds och dras mot det. Den första fienden som blir trollbunden utlöser en timer för att hjulet ska explodera. Om timern inte utlöses kommer den automatiskt att explodera efter 8 sekunder.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster lyser med en strålkastare som sveper över ett område. Fiender i ljuset har en chans att missa sina attacker och avslöjas om de är osynliga. Illusioner som träffas av strålen försvinner och förlorar en procentandel av sin maximala HP varje sekund.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ringmaster får en slumpmässig Dark Carnival-souvenir för engångsbruk närhelst en fiendehjälte dör i närheten. Ytterligare souvenirer sparas som laddningar. Om Ringmaster inte har en souvenir när han skapas kommer han att få en. Souvenirer från Dark Carnival inkluderar en Funhouse Mirror, en Strongman Tonic och en Whoopee Cushion.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Användning: Proportion Distortion\\n\\nSkapar 1 ofullständig bild av din hjälte som varar i 18 sekunder. Din illusion gör 28 % och tar 300 % skada.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Användning: Whoopsie\\n\\nDriver din hjälte framåt 400 enheter. Efterlämnar ett stinkmoln med en radie på 200 i 3 sekunder som saktar ned fiender med 30 %.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic",
  "ringmaster_ability_strongman_tonic_Description": "Användning: Forcefully Imbibe\\n\\nÖkar tillfälligt en allierad hjältes styrka med 5 plus 1,5 per Ringmaster-nivå i 8 sekunder. Effekten varar i 4 sekunder, och därefter försämras den under varaktigheten."
}