// 3515.js

{
  "language": "greek",
  "ringmastercomic_title_cover": "Η Κούκλα – Εξώφυλλο",
  "ringmastercomic_title": "Η Κούκλα – Σελίδα %1$s",
  "ringmastercomic_help_text": "ΠΑΤΗΣΤΕ ΣΤΗΝ ΕΙΚΟΝΑ Ή ΧΡΗΣΙΜΟΠΟΙΗΣΤΕ ΤΟ ΠΛΗΚΤΡΟ ΔΙΑΣΤΗΜΑΤΟΣ ΓΙΑ ΝΑ ΣΥΝΕΧΙΣΕΤΕ",
  "ringmastercomic_return_button": "ΕΠΙΣΤΡΟΦΗ ΣΤΟ ΕΞΩΦΥΛΛΟ",
  "ti13_online": "Κοπεγχάγη",
  "ti13_main_event_venue": "Royal Arena – Κοπεγχάγη",
  "ti13_best_of_three": "ΣΤΙΣ ΔΥΟ ΝΙΚΕΣ",
  "ti13_best_of_five": "ΣΤΙΣ ΤΡΕΙΣ ΝΙΚΕΣ",
  "ti13_group_stage_sp_rules": "Φάση ομίλων – Κανόνες προτεραιότητας επιλογής",
  "ti13_group_stage_sp_game1": "Ρίψη νομίσματος.",
  "ti13_group_stage_sp_game2": "Πρώτος αγώνας: Ο νικητής στη ρίψη νομίσματος επιλέγει πρώτος ήρωες ή διαλέγει πλευρά.",
  "ti13_group_stage_sp_game3": "Δεύτερος αγώνας: Ο ηττημένος στη ρίψη νομίσματος επιλέγει πρώτος ήρωες ή διαλέγει πλευρά.",
  "ti13_group_stage_sp_game4": "Τρίτος αγώνας (εάν υπάρξει): Νέα ρίψη νομίσματος. Ο νέος νικητής στη ρίψη νομίσματος επιλέγει πρώτος ήρωες ή διαλέγει πλευρά.",
  "ti13_group_stage_tie_rules": "Φάση ομίλων – Κανόνες τάι μπρέικ",
  "ti13_first_second_tie": "Δύο ομάδες είναι ισόπαλες για την 1η και 2η θέση",
  "ti13_second_third_tie": "Δύο ομάδες είναι ισόπαλες για τη 2η και 3η θέση",
  "ti13_third_fourth_tie": "Δύο ομάδες είναι ισόπαλες για την 3η και 4η θέση",
  "ti13_three_way_first_tie": "Τρεις ομάδες είναι ισόπαλες για την 1η θέση",
  "ti13_three_way_second_tie": "Τρεις ομάδες είναι ισόπαλες για τη 2η θέση",
  "ti13_four_way_tie": "Τέσσερις ομάδες είναι ισόπαλες για την 1η θέση",
  "ti13_tie_resolve_bo3": "Ανάδειξη νικητή μέσω αγώνα στις δύο νίκες.",
  "ti13_tie_resolve_third_fourth": "Δεν πραγματοποιούνται άλλοι αγώνες. Οι δύο ομάδες είναι ισόπαλες για την 3η και 4η θέση.",
  "ti13_tie_resolve_first_with_round_robin": "Καθορισμός της 1ης θέσης μέσω αγώνων εκ περιτροπής που θα κρίνονται στη μία νίκη, μέχρι μια ομάδα να κερδίσει δύο φορές.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Συνέχιση της διαδικασίας μέχρι όλες οι ομάδες να έχουν παίξει μεταξύ τους τουλάχιστον μία φορά. Θα χρησιμοποιηθούν τα πιο πρόσφατα αποτελέσματα των αγώνων εκ περιτροπής για την απόφαση της 2ης και 3ης θέσης.",
  "ti13_tie_resolve_second_with_round_robin": "Καθορισμός της 2ης θέσης μέσω αγώνων εκ περιτροπής που θα κρίνονται στη μία νίκη, μέχρι μια ομάδα να κερδίσει δύο φορές.",
  "ti13_tie_resolve_third_fourth_other": "Δεν πραγματοποιούνται άλλοι αγώνες. Οι δύο άλλες ομάδες είναι ισόπαλες για την 3η και 4η θέση.",
  "ti13_tie_resolve_four_way_1": "Οι αναμετρήσεις των ομάδων θα καθοριστούν τυχαία. Στο πλαίσιο αυτών των κανόνων, οι ομάδες αποκαλούνται Ομάδα Α, Ομάδα Β, Ομάδα Γ και Ομάδα Δ.",
  "ti13_tie_resolve_four_way_2": "Η Ομάδα Α αγωνίζεται με την Ομάδα Β σε παιχνίδι της μίας νίκης. Η Ομάδα Γ αγωνίζεται με την Ομάδα Δ σε παιχνίδι της μίας νίκης.",
  "ti13_tie_resolve_four_way_3": "Καθορισμός της 1ης θέσης μέσω ενός αγώνα της μίας νίκης, μεταξύ του νικητή του αγώνα των Α/Β και του νικητή του αγώνα των Γ/Δ.",
  "ti13_tie_resolve_four_way_4": "Καθορισμός της 4ης θέσης μέσω ενός αγώνα της μίας νίκης, μεταξύ του ηττημένου του αγώνα των Α/Β και του ηττημένου του αγώνα των Γ/Δ.",
  "ti13_tie_resolve_four_way_5": "Καθορισμός της 2ης και 3ης θέσης μέσω ενός αγώνα της μίας νίκης για τις ομάδες που απομένουν.",
  "ti13_seeding_decider_sp_rules": "Καθορισμός ομάδων ομίλων – Κανόνες προτεραιότητας επιλογής",
  "ti13_seeding_decider_sp_rules_1": "Πρώτος αγώνας: Η ομάδα που τερμάτισε στην υψηλότερη θέση στη φάση των ομίλων επιλέγει πρώτη ήρωες ή διαλέγει πλευρά.",
  "ti13_seeding_decider_sp_rules_2": "Δεύτερος αγώνας: Η ομάδα που τερμάτισε στη χαμηλότερη θέση στη φάση των ομίλων επιλέγει πρώτη ήρωες ή διαλέγει πλευρά.",
  "ti13_seeding_decider_sp_rules_3": "Τρίτος αγώνας (εάν υπάρξει): Η ομάδα που τερμάτισε στην υψηλότερη θέση στη φάση των ομίλων επιλέγει πρώτη ήρωες ή διαλέγει πλευρά.",
  "ti13_playoffs_and_ti_sp_rules": "Πλέι-οφ και το The International – Κανόνες προτεραιότητας επιλογής",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Ρίψη νομίσματος.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Πρώτος χάρτης: Ο νικητής στη ρίψη νομίσματος επιλέγει πρώτος ήρωες ή διαλέγει πλευρά.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Δεύτερος χάρτης: Ο ηττημένος στη ρίψη νομίσματος επιλέγει πρώτος ήρωες ή διαλέγει πλευρά.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Τρίτος χάρτης (εάν υπάρξει): Νέα ρίψη νομίσματος. Ο νέος νικητής στη ρίψη νομίσματος επιλέγει πρώτος ήρωες ή διαλέγει πλευρά.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Πρώτος χάρτης: Ο νικητής του Άνω Ομίλου επιλέγει πρώτος ήρωες ή διαλέγει πλευρά.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Δεύτερος χάρτης: Ο νικητής του Κάτω Ομίλου επιλέγει πρώτος ήρωες ή διαλέγει πλευρά.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Τρίτος χάρτης: Ο νικητής του Άνω Ομίλου επιλέγει πρώτος ήρωες ή διαλέγει πλευρά.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Τέταρτος χάρτης (εάν υπάρξει): Ο νικητής του Κάτω Ομίλου διαλέγει πρώτος ήρωες ή επιλέγει πλευρά.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Πέμπτος χάρτης (εάν υπάρξει): Ρίψη νομίσματος. Ο νέος νικητής της ρίψης νομίσματος διαλέγει πρώτος ήρωες ή επιλέγει πλευρά.",
  "international2024_update_title": "THE INTERNATIONAL 2024, RINGMASTER ΚΑΙ ΤΟ COMPENDIUM",
  "ringmaster_hype": "«Λιτς και Λίνα, Σλαρκ και Μάρσι και θύματα όλων των ηλικιών! Η στιγμή που περιμένατε επιτέλους έφτασε.\\n\\n Πάει ένας χρόνος περίπου που υπάρχω μόνο σαν όνομα, ακούγομαι σε σιωπηλούς ψιθύρους, μια σκιά που παραμονεύει πίσω από μια κόκκινη κουρτίνα. Αλλά τώρα, επιτέλους (και πολύ άργησε, αν με ρωτάτε), οι ελαφρόμυαλοι που είναι υπεύθυνοι για αυτόν τον θίασο ήρθαν στα σύγκαλά τους και μου επέτρεψαν σας τιμήσω με τη μεγαλοπρεπή μου παρουσία και να πάρω την ταπεινή θέση μου στο κέντρο της σκηνής! Εγώ, ο Κογκλιόστρο Κετλ, ο κακόβουλος μαέστρος! Σκοτεινός κράχτης των καταραμένων! Ο ένας και μοναδικός RINGMASTER! Και έχω κάποιους άσσους κρυμμένους στο μανίκι μου!»",
  "ringmaster_comic": "«Κι αν δεν με πιστεύετε, γιατί δεν διαβάζετε ένα κόμικ για την τραγική ιστορία προέλευσής μου, από έναν αξιόπιστο και ανώνυμο αφηγητή;»",
  "ringmaster_comic_title": "Η ΚΟΥΚΛΑ",
  "ringmaster_comic_desc": "Διαβάστε για τις πρώτες περιοδείες του Ringmaster με το κουρδιστό τσίρκο του Κετλ.",
  "ringmaster_guide": "«Μου ζήτησαν να είμαι ο οδηγός σας στο φετινό Compendium. Αποδέχτηκα με ευγνωμοσύνη την προσφορά. Εξάλλου, πρέπει να γνωριστούμε! [b]Ας αρχίσουμε, τι λέτε;»[/b]",
  "ringmaster_introducing": "ΠΑΡΟΥΣΙΑΖΟΥΜΕ ΤΟΝ",
  "ringmaster_hero_detail_button": "ΠΡΟΒΟΛΗ ΣΕΛΙΔΑΣ ΛΕΠΤΟΜΕΡΕΙΩΝ ΗΡΩΑ",
  "ringmaster_play_trailer_button": "ΑΝΑΠΑΡΑΓΩΓΗ ΤΡΕΪΛΕΡ",
  "ringmaster_comic_button": "ΔΙΑΒΑΣΤΕ ΤΟ ΚΟΜΙΚ",
  "international2024_compendium": "Compendium",
  "international2024_compendium_title": "ΤΟ COMPENDIUM ΤΟΥ THE INTERNATIONAL 2024",
  "international2024_effigies_title": "ΟΜΟΙΩΜΑΤΑ ΑΝΑ ΗΡΩΑ",
  "international2024_effigies_subtitle": "ΑΝΑΒΑΘΜΙΣΜΕΝΟ ΧΑΡΑΚΤΗΡΙΣΤΙΚΟ, ΔΩΡΕΑΝ ΓΙΑ ΟΛΟΥΣ",
  "international2024_effigies_intro": "«Υπήρχε μια εποχή, φίλοι μου, όχι πολύ καιρό πριν, που αυτά τα σπουδαία ομοιώματα ήταν πράγματι σπάνια θεάματα! Όχι πια! Τώρα ένα μνημείο περιμένει κάθε τιτάνα που πρόκειται να εισέλθει στο πεδίο της μάχης, είτε είναι ο Ringmaster είτε όλοι οι άλλοι υποδεέστεροι ήρωες!»",
  "international2024_effigies_desc": "Τα ομοιώματα είναι αγάλματα των αγαπημένων σας ηρώων, με δυνατότητα επεξεργασίας της στάσης τους, τα οποία μπορείτε να προβάλετε στη βάση σας. Αντί να μοιράζονται μία κοινή καθολική υποδοχή, κάθε ήρωας διαθέτει πλέον τη δική του υποδοχή ομοιώματος στον εξοπλισμό στο Οπλοστάσιο.\\n\\nΜπορείτε να κρατήσετε το νέο προεπιλεγμένο ομοίωμα για κάθε ήρωα ή να κατασκευάσετε και να εξοπλίσετε το δικό σας.",
  "international2024_purchase_intro": "«Θεοί και τέρατα, κριπάκια και πλασματάκια, για περάστε και δείτε [b]την πιο συναρπαστική συλλογή παιχνιδιών, συμβάντων και ανταμοιβών[/b] από αυτήν την πλευρά του ποταμού! Δοκιμάστε την ευφυΐα σας, την τύχη σας, καθώς και τα κότσια σας, γιορτάζοντας τη μεγαλύτερη διοργάνωση esport σε αυτό το βασίλειο και σε οποιοδήποτε άλλο!»",
  "international2024_activities": "ΟΡΙΣΤΕ ΤΙ ΘΑ ΛΑΒΕΤΕ",
  "international2024_activities_subtitle": "ΠΑΙΧΝΙΔΙΑ ΤΥΧΗΣ, ΑΘΛΟΙ ΔΕΞΙΟΤΗΤΩΝ ΚΑΙ ΑΠΟΛΑΥΣΕΙΣ ΓΙΑ ΟΛΕΣ ΤΙΣ ΗΛΙΚΙΕΣ ",
  "international2024_activities_intro": "«Σε αντίθεση με τον σώφρονα οικοδεσπότη σας, μου είπαν ότι ορισμένοι από εσάς χρειάζεστε έναν ΛΟΓΟ για να σκοτώσετε. Για αυτό λοιπόν, θα κερδίζετε πόντους με κάθε παιχνίδι που παίζετε! Όσο περισσότερο παίζετε, τόσο περισσότερο κερδίζετε, οπότε ξεχυθείτε στα μέτωπα και δείτε τους πόντους να ανεβαίνουν!»",
  "international2024_activities_play_title": "ΠΑΙΞΤΕ DOTA: ΚΕΡΔΙΣΤΕ ΠΟΝΤΟΥΣ",
  "international2024_activities_play_desc": "Φέτος, θα κερδίζετε πόντους σχεδόν για κάθε ένα παιχνίδι που παίζετε μέσω της Εβδομαδιαίας Πρόκλησης. Θα κερδίζετε επίσης επιπλέον πόντους για την πρώτη νίκη της κάθε ημέρας.",
  "international2024_activities_fantasy_title": "ΕΙΚ. ΠΡΩΤΑΘΛΗΜΑ",
  "international2024_activities_fantasy_desc": "Αναμετρηθείτε με φίλους σας και παίκτες Dota σε όλο τον κόσμο. Επιλέξτε το καλύτερο εικονικό ρόστερ των αγαπημένων σας επαγγελματιών και δημιουργήστε ειδικές κάρτες με στατιστικά που ενισχύουν τους πόντους.",
  "international2024_activities_oracles_title": "ΠΡΟΚΛΗΣΗ ΤΟΥ ORACLE",
  "international2024_activities_oracles_desc": "Προβλέψτε ποιες ομάδες θα προκριθούν και ποιες θα αποκλειστούν και απολαύστε την ακρίβεια των προγνωστικών σας (εάν υποθέσουμε ότι είχατε δίκιο).",
  "international2024_activities_bingo_title": "ΜΠΙΝΓΚΟ",
  "international2024_activities_bingo_desc": "Αποκτήστε κάρτες Μπίνγκο για κάθε στάδιο του τουρνουά. Οι κάρτες αυτές δημιουργούνται τυχαία και είναι γεμάτες με παράξενες συνθήκες και ενδιαφέρουσες καταστάσεις.",
  "international2024_activities_outro": "«Να θυμάστε ότι νίκη δεν είναι η μόνη ανταμοιβή! Κάθε φορά που επιτυγχάνετε σε μία από αυτές τις δραστηριότητες, θα κερδίζετε πόντους! Μεταβείτε παρακάτω στον Πάγκο Ανταμοιβών για να ανακαλύψετε τι καλούδια μπορείτε να πάρετε με τους πόντους!»",
  "international2024_rewards_title": "ΑΝΤΑΜΟΙΒΕΣ COMPENDIUM",
  "international2024_rewards_subtitle": "ΓΙΑ ΠΕΡΑΣΤΕ, ΓΙΑ ΠΕΡΑΣΤΕ ΚΑΙ ΔΕΙΤΕ ΑΥΤΑ ΤΑ ΒΡΑΒΕΙΑ",
  "international2024_rewards_intro": "«Στοιβάξτε ψηλά τα πτώματα και διεκδικήστε τις ανταμοιβές σας! Αχ, και ΤΙ ανταμοιβές σας περιμένουν! Όχι, όχι το να σφίξετε τα χέρια σας γύρω από έναν λαιμό και να βλέπετε τη ζωή ενός κακόμοιρου ήρωα να σβήνει από τα μάτια του. Αυτό είναι ανταμοιβή από ΜΟΝΗ της! Εδώ μιλάμε για το τι θα πάρετε ΜΕΤΑ!»",
  "international2024_rewards_physical_aegis_title": "ΡΕΠΛΙΚΑ ΤΟΥ AEGIS",
  "international2024_rewards_physical_aegis_desc": "Γεμίστε το κενό του Aegis στο ράφι σας αλλά και στην καρδιά σας με ένα αντίγραφο του φημισμένου βραβείου των πρωταθλητών από κράμα νικελίου σε κλίμακα 1 προς 5.",
  "international2024_rewards_hud_title": "ΔΙΕΠΑΦΗ ΤΟΥ THE INTERNATIONAL 2024",
  "international2024_rewards_hud_desc": "Διακοσμήστε τη διεπαφή σας εντός παιχνιδιού στο πνεύμα του τσίρκου. Ανανεώσαμε τη διεπαφή με θέμα το φετινό The International.",
  "international2024_rewards_versus_title": "ΠΡΟΒΟΛΗ ΕΝΑΝΤΙΟΝ 2024",
  "international2024_rewards_versus_desc": "Αναζωογονήστε το αγωνιστικό σας πνεύμα πριν το παιχνίδι με μια προσαρμοσμένη «Προβολή εναντίον», που αναδεικνύει τις νέες υποδοχές ομοιωμάτων των ηρώων.",
  "international2024_rewards_chat_wheels_title": "ΜΟΝΙΜΑ ΗΧΗΤΙΚΑ ΡΟΔΕΛΑΣ ΣΥΝΟΜΙΛΙΑΣ",
  "international2024_rewards_stickers_title": "ΑΥΤΟΚΟΛΛΗΤΑ ΠΑΙΚΤΩΝ ΚΑΙ ΟΜΑΔΩΝ",
  "international2024_rewards_loading_screens_title": "ΕΙΚΟΝΕΣ ΦΟΡΤΩΣΗΣ",
  "international2024_rewards_materials_title": "ΕΝΙΣΧΥΣΕΙΣ ΕΙΚ. ΠΡΩΤΑΘΛΗΜΑΤΟΣ ΚΑΙ ΜΠΙΝΓΚΟ",
  "international2024_rewards_teleport_fx_title": "ΕΦΕ ΤΗΛΕΜΕΤΑΦΟΡΑΣ ΑΓΑΠΗΜΕΝΗΣ ΟΜΑΔΑΣ",
  "international2024_rewards_effigy_title": "ΚΟΜΜΑΤΙ ΟΜΟΙΩΜΑΤΟΣ 2024",
  "international2024_supporters_clubs_title": "ΥΠΟΣΤΗΡΙΞΤΕ ΤΗΝ ΚΟΙΝΟΤΗΤΑ",
  "international2024_supporters_clubs_subtitle": "ΠΑΚΕΤΑ ΥΠΟΣΤΗΡΙΞΗΣ ΤΑΛΕΝΤΩΝ ΚΑΙ ΟΜΑΔΩΝ",
  "international2024_supporters_clubs_intro": "«Αξιότιμοι ευεργέτες! Φιλάνθρωποι όλων των ηλικιών! Ταπεινοί προστάτες των φονικών τεχνών, καθώς και των παρεμφερών τεχνών! Το 50% της γενναιόδωρης προσφοράς σας θα πάει απευθείας στις αγαπημένες σας ομάδες και ταλέντα μετάδοσης! Ποιος είναι στα αλήθεια ήρωας εδώ; Εγώ, προφανώς! Και χειροκροτώ με τα τεράστια ηρωικά μου χέρια ΕΣΑΣ!»",
  "international2024_supporters_clubs_tiers_title": "ΚΛΑΜΠ ΥΠΟΣΤΗΡΙΚΤΩΝ ΟΜΑΔΩΝ",
  "international2024_supporters_clubs_tiers_desc": "Επιλέξτε Χάλκινη, Ασημένια ή Χρυσή βαθμίδα για τις αγαπημένες σας ομάδες, ώστε να κερδίσετε ανταμοιβές που έχουν σχεδιάσει οι ίδιες οι ομάδες.",
  "international2024_talent_tiers_title": "ΠΑΚΕΤΑ ΑΥΤΟΚΟΛΛΗΤΩΝ ΤΑΛΕΝΤΩΝ",
  "international2024_talent_tiers_desc": "Αγοράστε πακέτα ανταμοιβών με πρωταγωνιστή το αγαπημένο σας Ταλέντο. Τα πακέτα περιλαμβάνουν έναν συνδυασμό από αυτοκόλλητα, φωνητικές ατάκες και αυτόγραφα, ανάλογα με τη βαθμίδα του πακέτου που αγοράζετε.",
  "ti13_compendium_small_header": "ΥΠΟΣΤΗΡΙΞΤΕ ΤΟ ΤΟΥΡΝΟΥΑ",
  "ti13_compendium_header": "COMPENDIUM ΤΟΥ THE INTERNATIONAL 2024",
  "ti13_compendium_desc": "Το Compendium είναι ο διαδραστικός σας σύντροφος για το The International. Είναι ο μοναδικός σας προορισμός για τις δραστηριότητες, τις προκλήσεις και τις ανταμοιβές που σχετίζονται με τη φετινή διοργάνωση. Επίσης, το 25% όλων των πωλήσεων πηγαίνει στο χρηματικό έπαθλο του The International 2024.",
  "ti13_compendium_bp_btn": "ΙΣΤΟΣΕΛΙΔΑ",
  "ti13_compendium_standard": "ΚΑΝΟΝΙΚΟ COMPENDIUM",
  "ti13_compendium_standard_subtitle": "Όλα τα χαρακτηριστικά και τις δραστηριότητες",
  "ti13_compendium_upgraded": "ΕΝΙΣΧΥΜΕΝΟ COMPENDIUM",
  "ti13_compendium_upgraded_subtitle": "Όλα τα χαρακτηριστικά και τις δραστηριότητες συν επιταχυνόμενες ανταμοιβές",
  "ti13_compendium_purchase_tp_fx": "Εφέ τηλεμεταφοράς TI 2024 επιπέδου 1",
  "ti13_compendium_purchase_boosters_footnote": "Οι ενισχυτές μπορούν να ξεκλειδώσουν επιπλέον περιεχόμενο της επιλογής σας",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Οι ενισχυτές μπορούν να ξεκλειδώσουν τη διεπαφή International 2024 ή επιπλέον περιεχόμενο της επιλογής σας",
  "ti13_compendium_purchase_levels": "%1$s επίπεδα Compendium",
  "ti13_compendium_purchase_booster_levels": "%1$s Ενισχυτές",
  "ti13_compendium_purchase_discount": "ΕΚΠΤΩΣΗ %1$s% ΣΕ ΕΠΙΠΕΔΑ",
  "ti13_compendium_purchase_earn_the_following": "ΤΑ ΕΠΙΠΕΔΑ COMPENDIUM ΘΑ ΞΕΚΛΕΙΔΩΣΟΥΝ:",
  "ti13_compendium_contribution": "Το 25% όλων των πωλήσεων πηγαίνει στο χρηματικό έπαθλο του The International 2024.",
  "ti13_compendium_purchase_all_access": "Πρόσβαση σε όλα τα χαρακτηριστικά του Compendium",
  "ti13_compendium_purchase_aegis_emoticon": "Φατσούλα Aegis",
  "ti13_compendium_purchase_bingo_tokens": "%1$s ΜΑΡΚΕΣ ΜΠΙΝΓΚΟ",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s Μάρκες ανανέωσης εικ. πρωταθλήματος",
  "ti13_compendium_purchase_one_player_sticker": "1 κάψουλα αυτοκόλλητων παικτών",
  "ti13_compendium_purchase_player_stickers": "%1$s κάψουλες αυτοκόλλητων παικτών",
  "ti13_compendium_purchase_team_stickers": "%1$s κάψουλες αυτοκόλλητων ομάδων",
  "ti13_compendium_purchase_effigy_blocks": "%1$s Κομμάτια Ομοιώματος TI 2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s θησαυροί εικόνων φόρτωσης ομάδων",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s θησαυροί εικόνων φόρτωσης TI",
  "international2024_tournament_learn_more": "ΜΑΘΕΤΕ ΠΕΡΙΣΣΟΤΕΡΑ ΓΙΑ ΤΟ ΤΟΥΡΝΟΥΑ",
  "ringmaster_abilities_heading": "ΙΚΑΝΟΤΗΤΕΣ",
  "ringmaster_souvenirs_heading": "ΣΟΥΒΕΝΙΡ",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "ΔΙΟΧΕΤΕΥΣΗ – Ο Ringmaster περιστρέφει το μαστίγιό του και έπειτα χτυπά. Οι μαστιγωμένοι εχθροί δέχονται ζημιά και φεύγουν από φόβο μακριά από τον Ringmaster. Ο χρόνος διοχέτευσης αυξάνει εκθετικά τη ζημιά και παρατείνει τη διάρκεια του φόβου, αλλά μειώνει την εμβέλεια.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ο Ringmaster κρύβει τον εαυτό του ή κάποιον συμμαχικό ήρωα σε ένα φορητό κουτί από άλλη διάσταση. Οι μονάδες εντός του κουτιού αποκτούν διαπεραστική κίνηση, αντίσταση επιβράδυνσης, επιπλέον μαγική αντίσταση και επιπλέον ταχύτητα κίνησης. Επίσης, δεν μπορούν να γίνουν στόχος και έχουν αχρήστευση, σιγή και αφοπλισμό. Το κουτί θα ανοίξει όταν λήξει η διάρκεια της επίδρασης ή αν ο ήρωας μετακινηθεί εκτός της εμβέλειας.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ο Ringmaster πετάει ένα από τα στιλέτα του σε ένα ακριβές σημείο της επιλογής του. Αν πλήξει κάποιον εχθρό, προκαλεί ζημιά σύγκρουσης, επιβραδύνει προσωρινά τον στόχο και προκαλεί ζημιά ανά δευτερόλεπτο ισοδύναμη με ένα ποσοστό της μέγιστης ζωής του θύματος.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ο Ringmaster κάνει τον Τυχερό Τροχό να κατρακυλήσει προς τη στοχευμένη περιοχή, απωθώντας εχθρούς στο πέρασμά του. Αφού φτάσει τον στόχο του, οι εχθροί εντός του βεληνεκούς του τροχού λαμβάνουν ζημιά διαρκείας και επιβράδυνση. Οι εχθροί που είναι στραμμένοι προς τον τροχό για περισσότερο από 0,5 δευτερόλεπτα μαγεύονται και έλκονται προς αυτόν. Ο πρώτος εχθρός που θα μαγευτεί ενεργοποιεί ένα χρονόμετρο που θα ανατινάξει τον τροχό. Αν δεν ενεργοποιηθεί το χρονόμετρο, θα ανατιναχθεί αυτόματα μετά από 8 δευτερόλεπτα.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ο Ringmaster φωτίζει μια περιοχή με έναν προβολέα. Οι εχθροί που βρίσκονται στο φως έχουν πιθανότητα να αστοχήσουν στις επιθέσεις τους και αποκαλύπτονται, αν είναι αόρατοι. Οι ψευδαισθήσεις που φωτίζει η ακτίνα εξαφανίζονται σιγά σιγά, χάνοντας ένα ποσοστό της μέγιστης ζωής τους ανά δευτερόλεπτο.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ο Ringmaster λαμβάνει ένα τυχαίο σουβενίρ Σκοτεινού Πανηγυριού μίας χρήσης κάθε φορά που πεθαίνει ένας εχθρικός ήρωα κοντά του. Τα επιπλέον σουβενίρ αποθηκεύονται ως φορτίσεις. Αν ο Ringmaster δεν έχει κάποιο σουβενίρ όταν αναβιώσει, τότε θα λάβει ένα. Τα σουβενίρ του Σκοτεινού Πανηγυριού περιλαμβάνουν τα Funhouse Mirror, Strongman Tonic και Whoopee Cushion.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Χρήση: Παραμόρφωση Αναλογιών\\n\\nΔημιουργεί 1 ατελή εικόνα του ήρωά σας που διαρκεί 18 δευτερόλεπτα. Η ψευδαίσθησή σας προκαλεί 28% ζημιά και λαμβάνει 300% ζημιά.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Χρήση: Ουίου\\n\\nΩθεί τον ήρωά σας εμπρός κατά 400 απόσταση. Αφήνει πίσω του ένα βρωμερό σύννεφο 200 εμβέλειας για 3 δευτερόλεπτα που επιβραδύνει εχθρούς κατά 30%.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic",
  "ringmaster_ability_strongman_tonic_Description": "Χρήση: Εξαναγκαστική Κατάποση\\n\\nΑυξάνει προσωρινά τη δύναμη του συμμαχικού ήρωα κατά 5, συν 1,5 για κάθε επίπεδο του Ringmaster για 8 δευτερόλεπτα. Η επίδραση διαρκεί για 4 δευτερόλεπτα και επιδεινώνεται για την υπόλοιπη διάρκεια."
}