// 5110.js

{
  "language": "vietnamese",
  "international2023_compendium_activity": "Hoạt động cho người sở hữu Compendium",
  "international2023_update_title": "Chào mừng The International 2023",
  "international2023_update_subtitle": "Từ những fan cuồng đấu trường chuyên nghiệp đến người chơi thông thường, bản cập nhật esport này sẽ đều có thứ để chiều bàn dân thiên hạ.",
  "international2023_update_body": "Dù đang hồi hộp dõi theo từng giây phút của mỗi trận đấu tại The International, hay chẳng hay biết rằng có người xem trò chơi này là sự nghiệp và bạn thì chỉ muốn thong dong thưởng thức trận đấu, thì cũng cứ đọc nhé: Bản cập nhật này chắc chắn có gì đấy cho bạn.\\n\\nBạn là fan cuồng đấu trường chuyên nghiệp? Tập hợp đội hình chuyên nghiệp với <b>giải đấu Fantasy</b> đã nâng cấp. Còn nếu bạn thích trổ tài phân tích gia cát dự? Tham gia ngay dự đoán nhánh đấu của <b>Thử thách Oracle</b>. Hay biết đâu bạn là fan của trò chơi mà bà con ta mùa Tết hay chiến. Năm nay tụi này có <b>lô tô</b> đấy!\\n\\nNhưng có lẽ bạn không phải là fan của mấy thứ này. Có khi người bạn hâm mộ nhất chính là bản thân. Thì chúng tôi cũng chiều luôn: <b>Quầy trưng bày hồ sơ</b>. Hồ sơ giờ sẽ là một tượng đài mà bạn có thể tương tác, khoe bất kỳ vật phẩm hay chiến tích nào trong lịch sử chơi.",
  "international2023_update_footer": "Bạn đã đọc hết bản cập nhật rồi đó. Giỏi quá!",
  "international2023_compendium": "Compendium",
  "international2023_compendium_title": "Compendium giải The International 2023",
  "international2023_compendium_intro": "Compendium là bạn đồng hành số hóa có thể tương tác cho sự kiện Đường tới International 2023 và The International 2023.\\n\\nChơi như dân pro với thử thách Đường tới TI. Tuyển người chơi bạn yêu thích và tham dự thử thách Fantasy nay đã được cải biên và cập nhật. Trổ tài bói toán với dự đoán vòng bảng và nhánh đấu. Đánh trúng phần thưởng với bảng lô tô hoàn toàn mới.\\n\\nHãy nghĩ Compendium như một cửa hàng dừng chân cho tất cả hoạt động liên quan đến sự kiện, thử thách, và phần thưởng cho giải đấu năm nay. Ngoài ra, 25% doanh số sẽ góp trực tiếp vào tổng giải thưởng The International 2023.",
  "international2023_showcase_title": "Quầy trưng bày hồ sơ",
  "international2023_showcase_subtitle": "Tính năng mới cho tất cả người chơi Dota",
  "international2023_showcase_intro": "Hồ sơ và hồ sơ thu nhỏ đã được thiết kế mới hoàn toàn cho tất cả mọi người (à thì cho 98% trong số các bạn với điểm giao tiếp trên 6000 thôi). Bạn giờ có thể khoe tất cả vật phẩm Dota của mình cùng với chiến tích — đúng nghĩa đen là bất kỳ thứ gì trong kho đồ Dota luôn — với quầy trưng bày hồ sơ mới.\\n\\nMuốn lập đền để thờ đội pro mình yêu thích từ 2016? Làm được nhé. Hay khoe các bộ sưu tập tướng bạn yêu thích? Chúng tôi bao luôn. Từng cặp giày mà Kunkka mà có thể đi? Nghe xàm nhưng tới luôn bác tài. Về kỹ thuật chắc chắn làm được.",
  "international2023_showcase_profile_title": "Hồ sơ cập nhật",
  "international2023_showcase_profile_desc": "Bạn là Michaelangelo, hồ sơ nay chính là khung vẽ và chỉ có trí tưởng tượng mới có thể ngăn cản bạn. (Nhưng đừng vẽ những gì thiếu đứng đắn nhé).",
  "international2023_showcase_mini_profile_title": "Hồ sơ nhỏ cập nhật",
  "international2023_showcase_mini_profile_desc": "Hồ sơ nhỏ cũng giống hồ sơ thường, với một khác biệt tối quan trọng — nghe cho kỹ nha — đó là chúng nhỏ hơn. Người chơi khác sẽ thấy hồ sơ nhỏ của bạn mỗi khi di chuột lên tên bạn.",
  "international2023_showcase_carousel_title": "Ví dụ về hồ sơ",
  "international2023_showcase_items_title": "Trưng bày vật phẩm",
  "international2023_showcase_items_desc": "Biến tấu quầy trưng bày với hằng hà loại vật phẩm và phần thưởng khác nhau mà bạn đã sưu tầm trong nhiều năm qua.",
  "international2023_showcase_item_heroes_title": "Tướng",
  "international2023_showcase_item_trophies_title": "Chiến tích",
  "international2023_showcase_item_stickers_title": "Hình dán",
  "international2023_showcase_item_stats_title": "Chỉ số",
  "international2023_showcase_item_chat_wheels_title": "Vòng tán gẫu",
  "international2023_showcase_item_sprays_title": "Sơn xịt",
  "international2023_showcase_item_items_title": "Vật phẩm trong kho đồ",
  "international2023_showcase_item_emoticons_title": "Biểu tượng cảm xúc",
  "international2023_showcase_item_loading_screens_title": "Màn hình chờ",
  "international2023_showcase_item_couriers_title": "Thú vận chuyển",
  "international2023_showcase_item_wards_title": "Mắt",
  "international2023_tournament_prize_pool": "Tổng giải thưởng",
  "international2023_tournament_prize_pool_percent": "25% doanh số Compendium International 2023 sẽ góp vào tổng giải thưởng The International 2023.",
  "international2023_tournament_learn_more": "Tìm hiểu thêm về giải đấu",
  "international2023_quests_title": "Thử thách Đường tới The International",
  "international2023_quests_intro": "Bạn đã xem dân chuyên nghiệp trổ tài. Bạn đã cổ vũ họ nồng hậu. Giờ chơi chuyên nghiệp luôn xem sao. Hãy đặt người xuống chiếc ghế gaming mà các tuyển thủ chuyên nghiệp yêu mến và tái dựng những khoảnh khắc hoành tráng nhất trong năm qua. Chiến thắng khi chơi tướng của họ từ một trận nào đó, hoặc chơi một trong 5 tướng họ dùng trong một tháng bất kỳ của mùa đấu. Nhận điểm thưởng với mỗi thử thách, và nhận điểm thưởng thêm khi hoàn thành đầy đủ các thử thách.",
  "international2023_quests_match_title": "Thử thách trận đấu",
  "international2023_quests_match_desc": "Thắng bằng các tướng từ một trận đấu chuyên nghiệp thực sự.",
  "international2023_quests_pro_title": "Thử thách người chơi",
  "international2023_quests_pro_desc": "Thắng bằng tướng được tuyển thủ chuyên nghiệp chọn nhiều nhất.",
  "international2023_quests_rewards_title": "Nhận thưởng",
  "international2023_quests_rewards_desc": "Nâng cấp phần thưởng với điểm Compendium nhận được khi tham gia hoạt động.",
  "international2023_fantasy_title": "Fantasy cải tiến",
  "international2023_fantasy_intro": "Chọn ra đội hình với các tuyển thủ bạn mến mộ. Đặt chỉ số bạn cho là quan trọng nhất. Tranh tài cùng người chơi khác trên khắp thế giới để nhận nhiều điểm nhất. Đây là giải đấu fantasy Dota mà bạn quen thuộc, nhưng theo cách hoàn toàn mới.",
  "international2023_fantasy_players_title": "Chọn",
  "international2023_fantasy_players_desc": "Chọn người chơi yêu thích cho vị trí core, đường giữa, và hỗ trợ.",
  "international2023_fantasy_craft_title": "Chế tác",
  "international2023_fantasy_craft_desc": "Dùng lượt quay nhận cùng các phần thưởng Compendium để tạo chỉ số tốt nhất cho tuyển thủ của bạn. Chọn cẩn thận nha—chỉ số xịn nhưng phải đúng tuyển thủ mới phát huy hết tiềm năng.",
  "international2023_fantasy_compete_title": "Tranh tài",
  "international2023_fantasy_compete_desc": "Mỗi cuối tuần của giải đấu là một lần đấu Fantasy, vậy nên bạn sẽ có nhiều dịp để tranh tài cùng bạn bè và thế giới. Nhận điểm Compendium, và nếu thứ tự trên bảng xếp hạng của bạn đủ cao, thì nhận ngay một chiếc cúp độc đáo.",
  "international2023_bingo_title": "Lô tô",
  "international2023_bingo_intro": "Bạn có thót tim mỗi khi đội chuyên nghiệp mua Divine Rapier? Hay trận đấu quá 80 phút và mọi thứ bỗng trở nên hơi kỳ lạ? Hoặc giả như khi một đội gồm dàn tướng có 16 chân đấu với một đội chỉ có 4?\\n\\nChà, vậy thì hãy sẵn sàng thuốc trợ tim đi. Xin ra mắt lô tô để bạn hóng chờ những sự kiện thực sự điên rồ.",
  "international2023_bingo_cards_title": "MỖI TUẦN MỘT THẺ LÔ TÔ",
  "international2023_bingo_cards_desc": "Tất cả người sở hữu Compendium sẽ nhận một thẻ lô tô được tạo ngẫu nhiên với mỗi cuối tuần của giải đấu. Thẻ này ngập tràn những ô vuông với điều kiện kỳ quái và tình huống thú vị cho bạn hóng khi xem dân pro thi đấu.",
  "international2023_bingo_rewards_title": "Cày xong hàng, nhận điểm thưởng",
  "international2023_bingo_rewards_desc": "Phải đó — chớ để ma quỷ thánh thần lừa phỉnh, đây vẫn chỉ là lô tô mà thôi, bạn thân mến. Khi hoàn thành được toàn bộ một hàng, cột, hay đường chéo trên thẻ lô tô, bạn sẽ nhận được điểm Compendium. Lưu ý: Không bắt buộc phải hét \"KINH\" nhưng chúng tôi khuyến khích.",
  "international2023_predictions_title": "Thử thách Oracle",
  "international2023_predictions_intro": "Oracle dùng ma phép bùa ngải tinh tú để thấy tương lai. Ờm, chúng tôi phải thú thực với bạn, bùa ngải không có thật đâu ạ. Bạn phải dùng trí khôn, kiến thức esport, và quan trọng nhất, tinh thần gia cát dự để hoàn thành công việc.\\n\\nDự đoán, như Oracle nhưng không có bùa ngải, xem đội nào sẽ đi tiếp và lụi bại trong mỗi cuối tuần của giải đấu. Đoán trúng (tức bói như Oracle) thì sẽ nhận được điểm Compendium.",
  "international2023_predictions_group_stage_title": "Dự đoán vòng bảng",
  "international2023_predictions_group_stage_desc": "Điều mới trong năm nay, dự đoán thứ tự của các đội trong mỗi bảng.",
  "international2023_predictions_ingame_title": "Dự đoán trong trận đấu",
  "international2023_predictions_ingame_desc": "Khi xem trong trò chơi hay trên Twitch, thử tài bói toán trước khi tiếng tù và phát lên mỗi trận đấu. Bạn sẽ nhận điểm Compendium với mỗi dự đoán đúng, tối đa 6 lần trong một ngày.",
  "international2023_rewards_title": "Phần thưởng Compendium",
  "international2023_rewards_intro": "Nếu bạn là fan của Dota chuyên nghiệp và muốn nhận quà cho điều đó, thì phần thưởng năm nay tìm đúng người rồi. Compendium 2023 hoàn toàn tập trung vào The International 2023 và đấu trường Dota chuyên nghiệp.",
  "international2023_rewards_physical_aegis_title": "Aegis hàng tươi thóc thật",
  "international2023_rewards_physical_aegis_desc": "Một bản sao tỷ lệ 1/5 làm bằng hợp kim niken của giải thưởng vô địch ai cũng thèm khát. Trưng bày một cách tự hào! Trưng bày ngay không cần nghĩ! Nấu chảy nó và tạo ra tiền tệ của riêng bạn!",
  "international2023_rewards_chat_wheels_title": "Vòng tán gẫu vĩnh viễn",
  "international2023_rewards_chat_wheels_desc": "Khác với năm trước, tất cả vòng tán gẫu giờ sẽ được nhận vĩnh viễn. Y hệt như tiêu đề. Ừ thì câu này hơi thừa. Nhưng thêm chút thời gian với bạn thì cũng tốt mà.",
  "international2023_rewards_stickers_title": "Hình dán tuyển thủ và đội tuyển",
  "international2023_rewards_stickers_desc": "“Chỉ có hình dán của đội”? Chắc chưa đọc kỹ tiêu đề phải không nào? Bạn có luôn cả hình dán của tuyển thủ đó. Nói thật, mấy đoạn văn bản này chỉ dùng để lấp đầy chỗ cho các tiêu đề không trơ trọi một mình thôi.",
  "international2023_rewards_hud_title": "Giao diện The International 2023",
  "international2023_rewards_hud_desc": "Đoạn văn trước có thể làm nhiều người bỗng sinh bệnh lười đọc đoạn này. Vậy nên nếu bạn còn ở đây: Giỏi. Đây là một bài kiểm và bạn đã đậu. Vì sau đây là thông tin mật mà tiêu đề không có: Giao diện mới được chế tác riêng bằng chủ đề họa tiết kính của năm nay.",
  "international2023_rewards_loading_screens_title": "Màn hình chờ",
  "international2023_rewards_loading_screens_desc": "Bạn sẽ nhận màn hình chờ chủ đề kính hoa văn cho mỗi đội, cũng như ảnh key art cho TI năm nay.",
  "international2023_rewards_materials_title": "Fantasy và tăng lực cho thử thách Đường tới TI",
  "international2023_rewards_materials_desc": "Dùng công cụ tùy biến để tạo nên tuyển thủ xịn hơn trong thử thách Fantasy, hoặc nai lưng để vượt qua nội dung khó nhằn trong thử thách Đường tới TI.",
  "international2023_rewards_teleport_fx_title": "Hiệu ứng thành phù với đội tuyển yêu thích",
  "international2023_rewards_teleport_fx_desc": "Khoe đội tuyển yêu thích của mình cùng hiệu ứng thành phù riêng biệt với ba cấp độ khác nhau.",
  "international2023_rewards_Types_title": "Kiểu phần thưởng",
  "international2023_rewards_Types_desc": "Mỗi loại phần thưởng có đồng hồ đo tiến độ riêng. Khi đồng hồ đầy, bạn có thể nhận phần thưởng. Một số đồng hồ có thể được nạp lại bao nhiêu lần tùy ý, nhưng vài đồng hồ khác chỉ có thể được nạp lại một số lần nhất định.",
  "international2023_rewards_Levels_title": "Cấp độ Compendium",
  "international2023_rewards_Levels_desc": "Thăng cấp Compendium bằng cách tham gia vào các hoạt động Compendium, hoặc mua gói cấp độ. Dùng cấp độ để tăng tiến độ nhận TẤT CẢ loại phần thưởng.",
  "international2023_rewards_Boosters_title": "Gói bổ trợ",
  "international2023_rewards_Boosters_desc": "Gói bổ trợ cũng giống như cấp bậc Compendium, nhưng dùng để tăng một phần thưởng cụ thể. Áp dụng gói bổ trợ cho phần thưởng cũng tăng tiến độ nhận khiên Aegis sưu tầm.",
  "international2023_supporters_clubs_title": "Câu lạc bộ ủng hộ",
  "international2023_supporters_clubs_subtitle": "Trực tiếp ủng hộ đội tuyển yêu thích",
  "international2023_supporters_clubs_intro": "Phần thưởng câu lạc bộ ủng hộ tựa như niềm vui tuổi thanh xuân — phải tận hưởng khi chúng còn đó, bởi vì chúng chóng vánh lắm. Hay ít ra chuyện xưa là thế. Từ nay, các phần thưởng là vĩnh cửu! Để bạn thưởng thức chúng suốt đời! Trừ phi bạn bị gank ngoài đời thật.\\n\\n Trên cả tuyệt vời: 50% doanh thu sẽ gửi trực tiếp cho đội tuyển. Ờ thì tuyệt cho họ. Nhưng ý đầu thì đúng là bạn được số hưởng còn gì.",
  "international2023_supporters_clubs_tiers_title": "Ba bậc ủng hộ",
  "international2023_supporters_clubs_tiers_desc": "Từ Đồng, Bạc, cho đến Vàng, ủng hộ đội tuyển mình yêu thích để nhận phần thưởng do chính các đội đó thiết kế.",
  "international2023_talent_title": "Hình dán khách mời",
  "international2023_talent_subtitle": "Trực tiếp ủng hộ khách mời bạn yêu thích",
  "international2023_talent_intro": "Phát sóng trực tiếp esport là một công việc nặng nhọc. Dĩ nhiên không nặng bằng cày ruộng cuốc đất. Nhưng chắc chắn cực hơn đan len trên Etsy. À, tất nhiên không phải tất cả kiểu đan len. Có vài kiểu áo cardigan đan móc màu mè trông cũng phức tạp lắm. \\n\\n Giờ bạn có thể gửi thông điệp tới khách mời yêu thích để nói rằng “Này… mình nể đằng ấy lắm. Tuy không bằng dân cày cuốc, nhưng ít ra hơn 50% các nghệ nhân Etsy\". Nhân tiện nhắc 50%, một nửa doanh thu hình dán khách mời sẽ được chuyển trực tiếp tới họ.",
  "international2023_talent_tiers_title": "Chọn bậc của bạn",
  "international2023_talent_tiers_desc": "Mua gói thưởng của khách mời bạn yêu mến. Gói bao gồm hình dán, lời thoại, và chữ ký tùy theo cấp độ bậc của gói được mua.",
  "international2023_talent_coming_soon": "Gói sẽ được mở bán sau khi danh sách khách mời được công bố.",
  "international2023_coming_soon": "Sắp ra mắt",
  "ti12_bp_countdown_header": "Đến vòng bảng",
  "ti12_bp_countdown_desc": "Đón xem giải đấu esports lớn nhất năm — phát sóng trực tiếp từ Seattle, với giải thưởng chung cuộc là Aegis of Champions.",
  "ti12_bp_tournament_complete_desc": "Hồi tưởng lại sự phấn khích từ giải đấu esport lớn nhất trong năm - tất cả diễn biến tại Seattle chỉ trong một cú nhấp chuột.",
  "ti12_group_stage_venue": "Trên mạng",
  "ti12_playoffs_venue": "Trung tâm hội nghị Seattle (Seattle Convention Center)",
  "ti12_main_event_venue": "Sân vận động Climate Pledge (Climate Pledge Arena)",
  "ti12_compendium_small_header": "Ủng hộ giải đấu",
  "ti12_compendium_header": "Compendium The International 2023",
  "ti12_compendium_desc": "Mở khóa thêm nhiều tính năng từ mùa giải đấu với Compendium The International 2023. Chơi như tuyển thủ chuyên nghiệp với thử thách Đường tới TI. Xây dựng đội hình với tuyển thủ chuyên nghiệp mình yêu thích cùng Fantasy phiên bản mới. Thử tài dự đoán với thử thách Oracle. Và hy vọng các đội sẽ làm chuyện lạ đời nào đó với tính năng Lô Tô hoàn toàn mới.\\n\\nNhận nhiều phần thưởng như hình dán tuyển thủ và đội tuyển, vòng tán gẫu, giao diện tùy biến, và thêm thật nhiều điều khác cho tới bản sao Aegis.\\n\\n25% doanh thu Compendium sẽ trực tiếp góp vào tổng giải thưởng The International.",
  "ti12_compendium_standard": "Compendium tiêu chuẩn",
  "ti12_compendium_upgraded": "Compendium nâng cấp"
}