// 8426.js

{
  "language": "russian",
  "international2023_compendium_activity": "Для владельцев компендиума",
  "international2023_update_title": "Празднование The International 2023",
  "international2023_update_subtitle": "Это киберспортивное обновление порадует и ярых фанатов профессиональной сцены, и казуальных игроков.",
  "international2023_update_body": "Вы ни на секунду не можете оторваться от напряжённых игр на The International? Или, наоборот, даже не подозреваете, что люди зарабатывают Дотой себе на жизнь, и просто хотите играть в тишине и покое? В любом случае читайте дальше: в этом обновлении найдётся что-нибудь для вас.\\n\\nПоклонники киберспорта смогут создать свою собственную команду в обновлённой <b>фэнтези-лиге</b>. Любителей аналитики порадует <b>испытание Оракула</b> с прогнозами на турнирную сетку. А для больших поклонников игр, в которые играет ваша двоюродная бабушка, у нас даже есть <b>бинго</b>!\\n\\nНо, возможно, ничего из этого вас не прельщает. Возможно, вас прельщают исключительно ваши заслуги. Тогда позвольте представить <b>витрину профиля</b> — интерактивный памятник себе любимому, где можно выставить напоказ любые предметы и достижения из игрового досье.",
  "international2023_update_footer": "Вы долистали до конца страницы обновления! Отличная работа!",
  "international2023_compendium": "Компендиум",
  "international2023_compendium_title": "Компендиум The International 2023",
  "international2023_compendium_intro": "Компендиум — это ваш интерактивный цифровой компаньон на время всех этапов The International 2023.\\n\\nИграйте как профессионал в испытании «Дорога на TI». Выбирайте своих любимых игроков в обновлённой и улучшенной фэнтези-лиге. Проверьте свои предсказательные навыки в прогнозах на турнир. Сорвите джекпот в совершенно новом формате бинго.\\n\\nВ компендиуме вы найдёте все связанные с турниром активности, испытания и награды. А ещё 25% от продаж идут в призовой фонд The International 2023.",
  "international2023_showcase_title": "Витрина профиля",
  "international2023_showcase_subtitle": "Для всех игроков",
  "international2023_showcase_intro": "Профили и мини-профили полностью преобразились для всех игроков (если точнее, для тех 98%, чья вежливость превышает 6000). Теперь вы можете демонстрировать свои предметы и достижения — буквально всё накопленное за время игры — в новой витрине профиля.\\n\\nХотите воздвигнуть алтарь любимой профессиональной команде из 2016 года? Без проблем. Похвастаться любимыми наборами? Тем более без проблем. Выставить напоказ полную коллекцию сапогов Кункки? К сожалению, с этим проблем тоже не возникнет.",
  "international2023_showcase_profile_title": "Обновлённый профиль",
  "international2023_showcase_profile_desc": "Вы — Микеланджело, а профиль — ваш холст. Вас ограничивает только воображение (и общечеловеческие правила приличия).",
  "international2023_showcase_mini_profile_title": "Обновлённый мини-профиль",
  "international2023_showcase_mini_profile_desc": "Мини-профили — это как профили, но с одним важным отличием: они (только никому не говорите) меньше. Другие игроки видят ваш мини-профиль каждый раз, когда наводят курсор на ваше имя.",
  "international2023_showcase_carousel_title": "Примеры витрин",
  "international2023_showcase_items_title": "Чем похвастаетесь?",
  "international2023_showcase_items_desc": "Украшайте свои витрины всевозможными предметами и наградами, полученными за годы игры.",
  "international2023_showcase_item_heroes_title": "Герои",
  "international2023_showcase_item_trophies_title": "Трофеи",
  "international2023_showcase_item_stickers_title": "Наклейки",
  "international2023_showcase_item_stats_title": "Статистика",
  "international2023_showcase_item_chat_wheels_title": "Звуки для колеса чата",
  "international2023_showcase_item_sprays_title": "Граффити",
  "international2023_showcase_item_items_title": "Предметы из арсенала",
  "international2023_showcase_item_emoticons_title": "Смайлики",
  "international2023_showcase_item_loading_screens_title": "Загрузочные экраны",
  "international2023_showcase_item_couriers_title": "Курьеры",
  "international2023_showcase_item_wards_title": "Варды",
  "international2023_tournament_prize_pool": "Призовой фонд",
  "international2023_tournament_prize_pool_percent": "25% от продаж компендиума идут напрямую в призовой фонд The International 2023.",
  "international2023_tournament_learn_more": "Узнать больше о турнире",
  "international2023_quests_title": "Испытание «Дорога на The International»",
  "international2023_quests_intro": "Вы наблюдали за профессионалами, болели за них... Теперь пора играть как они. Представьте, что вы оказались в геймерском кресле своего любимого киберспортсмена, и воссоздайте его достижения за прошедший год. Побеждайте за героев из конкретной игры или за тех, на ком конкретный профессионал играл чаще всего в течение месяца. Очки компендиума даются не только за отдельные задания, но и за выполнение всех испытаний, связанных с определённым месяцем.",
  "international2023_quests_match_title": "Задание избранной игры",
  "international2023_quests_match_desc": "Побеждайте за героев из настоящей профессиональной игры.",
  "international2023_quests_pro_title": "Задание избранного игрока",
  "international2023_quests_pro_desc": "Побеждайте за героев, которых чаще всего выбирал профессиональный игрок.",
  "international2023_quests_rewards_title": "Получайте награды",
  "international2023_quests_rewards_desc": "Зарабатывайте награды за полученные очки компендиума.",
  "international2023_fantasy_title": "Эволюция фэнтези-лиги",
  "international2023_fantasy_intro": "Составьте команду из своих любимых профессионалов. Подбирайте для них наиболее ценные параметры. Соревнуйтесь с командами со всего мира и получайте очки компендиума. Это всё та же фэнтези-лига, только переосмысленная.",
  "international2023_fantasy_players_title": "Выбирайте",
  "international2023_fantasy_players_desc": "Выберите своих любимых игроков основы, центра и поддержки.",
  "international2023_fantasy_craft_title": "Улучшайте",
  "international2023_fantasy_craft_desc": "Изменяйте характеристики своих игроков с помощью жетонов замены, полученных за повышение уровня компендиума. Выбирайте с умом — подходящие игроку показатели зависят от его стиля игры.",
  "international2023_fantasy_compete_title": "Соревнуйтесь",
  "international2023_fantasy_compete_desc": "Каждые выходные будет проходить отдельная фэнтези-лига, так что у вас будет не одна возможность посоревноваться с друзьями и с остальным миром! Заработайте очки компендиума и, если окажетесь среди лидеров, уникальный трофей.",
  "international2023_bingo_title": "Бинго",
  "international2023_bingo_intro": "Покрываетесь мурашками, когда кто-то в профессиональной игре покупает рапиру? Волнуетесь, когда игра затягивается на 80 минут и всё становится каким-то странным? Находите забавным, что у одной команды шестнадцать ног, а у другой — всего четыре?\\n\\nЧто ж, мы добавили бинго, которое наконец позволит вам заработать на этих и других поистине безумных событиях.",
  "international2023_bingo_cards_title": "НОВОЕ БИНГО КАЖДУЮ НЕДЕЛЮ ТУРНИРА",
  "international2023_bingo_cards_desc": "Владельцы компендиума будут получать новое случайное бинго на каждый этап турнира. Карточка заполнена полями со странными событиями и необычными ситуациями, которые могут произойти на турнире.",
  "international2023_bingo_rewards_title": "Получайте очки за линии",
  "international2023_bingo_rewards_desc": "У нас тут, конечно, и боги, и демоны, и мохнатые лесные арбалетчицы, но бинго — оно и в Айсреке бинго. Вы получите очки компендиума, когда заполните линию из 5 полей по горизонтали, вертикали или диагонали. Примечание: кричать «БИНГО!» не обязательно, но рекомендуется.",
  "international2023_predictions_title": "Испытание Оракула",
  "international2023_predictions_intro": "Чтобы видеть будущее, Оракул использует свою астральную пуповину. Увы, мы живём в реальном мире с обыкновенными, ни капли не магическими пупками, так что придётся довольствоваться размышлениями, познаниями в киберспорте и, конечно, догадками.\\n\\nПредставьте себя в шкуре Оракула (пупок не трожьте!) и предскажите, какие команды добьются успеха на турнире, а какие — даже не пройдут в следующий этап. Верные прогнозы (или, если хотите, оракульские откровения) принесут вам очки компендиума.",
  "international2023_predictions_group_stage_title": "Прогнозы на групповой этап",
  "international2023_predictions_group_stage_desc": "В этом году у вас впервые есть возможность предсказать порядок команд в каждой группе.",
  "international2023_predictions_ingame_title": "Прогнозы на игры",
  "international2023_predictions_ingame_desc": "Во время просмотра игр в клиенте или на Twitch у вас тоже есть шанс проверить свои предсказательские навыки. Делайте прогнозы до начального горна и получайте очки компендиума за первые шесть верных предсказаний каждый день.",
  "international2023_rewards_title": "Награды компендиума",
  "international2023_rewards_intro": "Если вы любите соревновательную Доту и награды за любовь к соревновательной Доте, тогда компендиум этого года вас точно порадует. Все награды завязаны исключительно на The International и профессиональной сцене.",
  "international2023_rewards_physical_aegis_title": "Копия эгиды чемпионов",
  "international2023_rewards_physical_aegis_desc": "Реплика прославленного чемпионского трофея из никелевого сплава в масштабе 1:5. Демонстрируйте её с гордостью! Или без особых эмоций! Или переплавьте её в свою собственную валюту!",
  "international2023_rewards_chat_wheels_title": "Фразы колеса чата... навсегда",
  "international2023_rewards_chat_wheels_desc": "В отличие от предыдущих лет, все фразы для колеса чата останутся с вами навсегда. Да, заголовок это уже передал. Да, это описание немного бесполезное. Нам просто нравится с вами беседовать.",
  "international2023_rewards_stickers_title": "Наклейки игроков и команд",
  "international2023_rewards_stickers_desc": "«Наклейки команд? И всё?!» — спросите вы. «Вы что, не читали заголовок?» — спросим мы в ответ. Наклейки игроков тоже есть. Серьёзно, эти описания — просто пупырчатая плёнка, защищающая заголовок на пути к вашему мозгу.",
  "international2023_rewards_hud_title": "Стиль интерфейса The International 2023",
  "international2023_rewards_hud_desc": "Наверняка после предыдущего описания никто не захочет читать дальше. Вы ещё с нами? Разумно. Вы прошли наше испытание с блеском. Наградой будет деталь, не указанная в заголовке — стиль интерфейса оформлен под витражную тематику турнира.",
  "international2023_rewards_loading_screens_title": "Загрузочные экраны",
  "international2023_rewards_loading_screens_desc": "Мы сделали для каждой команды особые загрузочные экраны в виде витража, а также особые иллюстрации для турнира этого года.",
  "international2023_rewards_materials_title": "Награды для фэнтези-лиги и «Дороги на TI»",
  "international2023_rewards_materials_desc": "Используйте эти инструменты, чтобы улучшать своих игроков в фэнтези-лиге или преодолевать особо тяжёлые задания в испытании «Дорога на TI».",
  "international2023_rewards_teleport_fx_title": "Эффект телепортации любимой команды",
  "international2023_rewards_teleport_fx_desc": "Покажите всем свою любовь к какой-либо команде, используя её эффект телепортации одного из трёх уровней.",
  "international2023_rewards_Types_title": "Типы наград",
  "international2023_rewards_Types_desc": "У каждого типа награды есть свой индикатор прогресса. Когда он заполнится, вы сможете получить эту награду. Некоторые индикаторы можно заполнить только определённое число раз, а у других наград ограничений нет.",
  "international2023_rewards_Levels_title": "Уровни компендиума",
  "international2023_rewards_Levels_desc": "Зарабатывайте уровни компендиума, участвуя или покупая комплекты уровней. Активировав уровни, вы повысите прогресс ВСЕХ типов наград.",
  "international2023_rewards_Boosters_title": "Усилители",
  "international2023_rewards_Boosters_desc": "Усилители — это как уровни компендиума, но для получения одной награды на ваш выбор. Активировав усилитель, вы также повысите прогресс получения коллекционной эгиды.",
  "international2023_supporters_clubs_title": "Клубы поддержки",
  "international2023_supporters_clubs_subtitle": "Поддержите любимые команды напрямую",
  "international2023_supporters_clubs_intro": "Комплекты из клубов поддержки — словно радости юных лет... Надо было ими довольствоваться, пока была возможность. Только теперь они никуда не денутся! С этого момента все награды клубов поддержки останутся с вами навсегда! Если только вас не собьёт автобус.\\n\\n Ещё одна приятная новость: 50% от продаж идут непосредственно команде. Ну, эта новость приятна командам. Наверное, предыдущий абзац порадовал вас сильнее.",
  "international2023_supporters_clubs_tiers_title": "Три разряда поддержки",
  "international2023_supporters_clubs_tiers_desc": "Выберите уровень поддержки, который подходит вам. Контент во всех трёх разрядах создали сами команды.",
  "international2023_talent_title": "Наклейки студии",
  "international2023_talent_subtitle": "Поддержите любимых работников напрямую",
  "international2023_talent_intro": "Нелегко освещать киберспортивные мероприятия в прямом эфире. Конечно, это не так тяжело, как работать на заводе, но вот вязать и продавать одежду на «Авито» куда легче. Впрочем, не всегда. Видели мы пару цветных кардиганов с такими узорами, что голова кругом... \\n\\n Так вот, теперь вы можете напрямую заявить своему любимому работнику студии: «Эй, я ценю твой труд. Не так сильно, как труд заводчан, но всё же посильнее, чем труд половины продавцов с \"Авито\"». Кстати про половину — работник получает 50% от продаж его комплекта.",
  "international2023_talent_tiers_title": "Выберите свой разряд",
  "international2023_talent_tiers_desc": "Приобретайте комплекты наград от своих любимых работников студии. В зависимости от разряда комплекта он может содержать наклейки, фразы для колеса чата и автографы.",
  "international2023_talent_coming_soon": "Комплекты работников студии можно будет купить, когда мы объявим их список.",
  "international2023_coming_soon": "Скоро",
  "ti12_bp_countdown_header": "До группового этапа",
  "ti12_bp_countdown_desc": "Следите за прямым эфиром из Сиэтла, где команды борются за Эгиду чемпионов на крупнейшем киберспортивном турнире года.",
  "ti12_bp_tournament_complete_desc": "Вспомните, как проходил крупнейший киберспортивный турнир этого года. Все битвы Сиэтла — на расстоянии одного клика.",
  "ti12_group_stage_venue": "Онлайн",
  "ti12_playoffs_venue": "Сиэтлский конференц-центр",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Поддержать турнир",
  "ti12_compendium_header": "Компендиум The International 2023",
  "ti12_compendium_desc": "Получите максимум от соревновательного сезона с компендиумом The International 2023. Играйте как профессионал в испытании «Дорога на TI». Создайте команду мечты в обновлённой фэнтези-лиге. Проверьте свои навыки прогнозирования в испытании Оракула. Надейтесь, что команды что-нибудь учудят и помогут вам заполнить новые карточки бинго.\\n\\nВас ждут такие награды, как наклейки игроков, фразы для колеса чата, особый стиль интерфейса и многое другое, включая миниатюрную копию эгиды.\\n\\n25% от продаж, связанных с компендиумом, идут в призовой фонд The International 2023.",
  "ti12_compendium_standard": "Стандартный компендиум",
  "ti12_compendium_upgraded": "Улучшенный компендиум"
}