// 1716.js

{
  "language": "dutch",
  "international2023_compendium_activity": "Activiteit voor compendium-bezitters",
  "international2023_update_title": "The International 2023: feest!",
  "international2023_update_subtitle": "Van professionele fanatiekelingen tot hobbyspelers: deze update heeft voor elk wat wils.",
  "international2023_update_body": "Of je nu iedere seconde van The International op het puntje van je stoel zit, of je je nauwelijks realiseert dat er mensen zijn die van dit spel hun beroep maken en gewoon rustig een potje wilt spelen, lees verder: deze update heeft ook iets voor jou.\\n\\nBen je bezeten door e-sport? Stel dan je eigen team samen met de upgrade van de <b>Fantasy-league.</b> Meer een fan van analyses? Voorspel de uitkomst van wedstrijden bij de <b>Oracle's Challenge</b>. Of misschien word je helemaal enthousiast over spelletjes die je op de lagere school speelde. Nou, in dat geval hebben we zelfs <b>bingo</b> dit jaar!\\n\\nHet kan ook zijn dat je maar van één iets (iemand) wild wordt: jezelf. In dat geval hebben we speciaal voor jou de <b>profielshowcase</b>. Jouw profiel is nu een interactief eerbetoon aan jezelf, met alle items en prestaties uit je speelgeschiedenis die je wilt tentoonstellen.",
  "international2023_update_footer": "Je hebt het einde van de update bereikt. Goed gedaan!",
  "international2023_compendium": "Compendium",
  "international2023_compendium_title": "Het compendium van The International 2023",
  "international2023_compendium_intro": "Het compendium is je interactieve digitale reisgezel voor 'De weg naar The International 2023' en The International 2023.\\n\\nSpeel als een pro met de Road to TI Challenge. Stel je eigen team samen met je favoriete spelers met deze upgrade van de Fantasy-league. Test je helderziendheid en voorspel de resultaten van de groepsfase en de rondes. Win de prijzenpot met onze gloednieuwe bingokaarten.\\n\\nMet het compendium heb je alles handig op één plek: alle activiteiten, challenges en beloningen van het evenement. Bovendien gaat 25% van elke aankoop naar de prijzenpot van The International 2023.",
  "international2023_showcase_title": "De profielshowcase",
  "international2023_showcase_subtitle": "Nieuwe functie voor alle Dota-spelers",
  "international2023_showcase_intro": "Het profiel en het miniprofiel werden volledig opnieuw vormgegeven voor iedereen (oké, voor de 98% van jullie die een communicatiescore boven de 6000 heeft).  Met de nieuwe profielshowcase kun je nu letterlijk alles uit je inventaris tonen: al je Dota-items en -prestaties.\\n\\nWil je een eerbetoon maken aan je favoriete pro-team van 2016? Dat kan. Wil je je verzameling geliefde heldensets tonen? Ga je gang. De hele collectie schoenen van Kunkka? Helaas, ja. Zelfs dat kan.",
  "international2023_showcase_profile_title": "Bijgewerkt profiel",
  "international2023_showcase_profile_desc": "Je bent Michaelangelo en je profiel is je canvas. De enige limiet is je verbeelding (en je gezond verstand).",
  "international2023_showcase_mini_profile_title": "Bijgewerkt miniprofiel",
  "international2023_showcase_mini_profile_desc": "Miniprofielen lijken sterk op profielen, met één groot verschil: ze zijn kleiner (die zag je vast niet aankomen). Andere spelers krijgen iedere keer als ze over je naam bewegen je miniprofiel te zien.",
  "international2023_showcase_carousel_title": "Showcase-voorbeelden",
  "international2023_showcase_items_title": "Showcase-items",
  "international2023_showcase_items_desc": "Personaliseer je showcase met een wijd assortiment aan items en beloningen die je door de jaren heen hebt verzameld.",
  "international2023_showcase_item_heroes_title": "Helden",
  "international2023_showcase_item_trophies_title": "Trofeeën",
  "international2023_showcase_item_stickers_title": "Stickers",
  "international2023_showcase_item_stats_title": "Statistieken",
  "international2023_showcase_item_chat_wheels_title": "Chatwielen",
  "international2023_showcase_item_sprays_title": "Graffiti",
  "international2023_showcase_item_items_title": "Arsenaalitems",
  "international2023_showcase_item_emoticons_title": "Emoticons",
  "international2023_showcase_item_loading_screens_title": "Laadschermen",
  "international2023_showcase_item_couriers_title": "Koeriers",
  "international2023_showcase_item_wards_title": "Wards",
  "international2023_tournament_prize_pool": "Prijzenpot",
  "international2023_tournament_prize_pool_percent": "25% van elke aankoop van het compendium van The International 2023 gaat direct naar de prijzenpot van The International 2023.",
  "international2023_tournament_learn_more": "Kom meer te weten over het toernooi",
  "international2023_quests_title": "The Road to The International Challenge",
  "international2023_quests_intro": "Je hebt naar de pro's gekeken. Je hebt ze aangemoedigd. Speel nu net als hen. Neem plaats in de gamestoel van je favoriete e-sporters en herbeleef hun mooiste momenten van het voorbije jaar. Win als hun helden uit een specifieke wedstrijd of als een van de vijf helden waarmee ze tijdens een bepaalde maand van het seizoen speelden. Win punten voor iedere uitdaging en bonuspunten als je een volledige reeks uitdagingen afwerkt.",
  "international2023_quests_match_title": "Wedstrijd­uitdagingen",
  "international2023_quests_match_desc": "Win met helden die je kiest uit een echte professionele wedstrijd.",
  "international2023_quests_pro_title": "Spelers­uitdagingen",
  "international2023_quests_pro_desc": "Win als één van de meestgekozen helden van een pro.",
  "international2023_quests_rewards_title": "Verdien beloningen",
  "international2023_quests_rewards_desc": "Geef je beloningen een boost met je compendiumpunten.",
  "international2023_fantasy_title": "De evolutie van Fantasy",
  "international2023_fantasy_intro": "Stel een team samen met je favoriete pro's. Pas de weging van de statistieken aan in jouw voordeel. Speel tegen spelers van over de hele wereld en verdien de meeste punten. Het is de Dota Fantasy-league zoals je ze al kende, alleen veel beter.",
  "international2023_fantasy_players_title": "Kiezen",
  "international2023_fantasy_players_desc": "Kies je favoriete Cores, Mids en Supports.",
  "international2023_fantasy_craft_title": "Ontwerpen",
  "international2023_fantasy_craft_desc": "Gebruik ruilkansen die je hebt verdiend als compendiumbeloningen om de beste statistieken voor je spelers samen te stellen. Denk twee keer na voor je kiest — sommige statistieken zijn beter dan andere voor bepaalde spelers.",
  "international2023_fantasy_compete_title": "Strijden",
  "international2023_fantasy_compete_desc": "Elk weekend van het toernooi is er een aparte Fantasy-ronde, dus je hebt verschillende kansen om tegen je vrienden en de rest van de wereld te spelen. Verdien compendiumpunten en, als je plaats in het klassement hoog genoeg is, een unieke trofee.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Klopt je hart stiekem wat sneller als een professioneel team een Divine Rapier koopt? Of wanneer een wedstrijd langer duurt dan 80 minuten en er allerlei vreemde dingen beginnen te gebeuren? Of wanneer een heldenteam met 16 benen vecht tegen een heldenteam met slechts vier?\\n\\nDan kun je nu open kaart spelen! Geniet van de gekheid én verdien punten met onze gloednieuwe bingo!",
  "international2023_bingo_cards_title": "ÉÉN BINGOKAART PER WEEKEND",
  "international2023_bingo_cards_desc": "Alle compendium-bezitters krijgen voor elk weekend van het toernooi een nieuwe willekeurig gegenereerde bingokaart. Deze kaart staat vol vakjes met vreemde voorwaarden en interessante situaties waar je naar uit kunt kijken tijdens de wedstrijden van de pro's.",
  "international2023_bingo_rewards_title": "Maak een rij, verdien punten",
  "international2023_bingo_rewards_desc": "Ja, je hebt het juist gelezen. Laat je niet misleiden door goden, demonen en op hol geslagen boswezens. Dit is bingo. Als in: een rijtje vol maken (horizontaal, verticaal of diagonaal) op je bingokaart en daarmee compendiumpunten opeisen. Opmerking: 'Bingo' schreeuwen is volledig optioneel maar wordt wel aangemoedigd.",
  "international2023_predictions_title": "De Oracle's Challenge",
  "international2023_predictions_intro": "Het Oracle gebruikt astrale navelmagie om de toekomst te voorspellen. Het enige nadeel is dat astrale navelmagie helemaal niet bestaat. Dus je moet gewoon je allerbeste e-sportkennis naar boven halen en vooral goed gokken om de klus te klaren.\\n\\nVoorspel ieder weekend van het toernooi welke teams verder gaan en welke afvallen (met of zonder behulp van je navel). Juist geraden? Dan verdien je compendiumpunten.",
  "international2023_predictions_group_stage_title": "De groepsfase voorspellen",
  "international2023_predictions_group_stage_desc": "Nieuw dit jaar: probeer de volgorde van de teams binnen elke groep te voorspellen.",
  "international2023_predictions_ingame_title": "Voorspellingen tijdens het spel",
  "international2023_predictions_ingame_desc": "Test je helderziendheid als je een wedstrijd in het spel of op Twitch kijkt en voorspel het resultaat vóór het eindsignaal. Iedere juiste voorspelling levert je compendiumpunten op, tot zes per dag.",
  "international2023_rewards_title": "Compendiumbeloningen",
  "international2023_rewards_intro": "Als je fan bent van competitieve Dota én fan bent van beloningen, dan is dit jouw jaar. Het Compendium 2023 is volledig gericht op The International 2023 en de Dota Pro-gemeenschap.",
  "international2023_rewards_physical_aegis_title": "Replica van de Aegis",
  "international2023_rewards_physical_aegis_desc": "Een replica van de beroemde kampioensprijs, gemaakt van nikkel op schaal 1: 5. Geef je eigen Aegis een ereplek! Of gewoon een bescheiden plaatsje ergens in huis. Of smelt hem en sla je eigen munten!",
  "international2023_rewards_chat_wheels_title": "Permanente chatwielen",
  "international2023_rewards_chat_wheels_desc": "In tegenstelling tot vorige jaren zijn nu alle chatwielen permanent. Zoals we dat in de titel al zeiden. Ja, dit tekstje voelt nu een beetje overbodig. Maar het is altijd fijn om wat extra tijd met jullie door te brengen.",
  "international2023_rewards_stickers_title": "Speler- en teamstickers",
  "international2023_rewards_stickers_desc": "'Alleen teamstickers?' Lees de titel nog een keer. Zie je wel: je krijgt ook spelerstickers. Eerlijk gezegd zijn deze tekstjes gewoon wat kersjes op de taart. Om ervoor te zorgen dat je de taart eet.",
  "international2023_rewards_hud_title": "The International 2023-HUD",
  "international2023_rewards_hud_desc": "Die laatste alinea heeft mensen waarschijnlijk afgeschrikt om verder te lezen. Als je dit toch dapper leest: best slim. Het was een test en je bent geslaagd. Want hier komt wat informatie die niet in de titel staat: de nieuwe HUD is helemaal op maat ontworpen met het glas-in-loodthema van dit jaar.",
  "international2023_rewards_loading_screens_title": "Laadschermen",
  "international2023_rewards_loading_screens_desc": "Voor elk team krijg je een aangepast laadscherm met het glas-in-loodthema, evenals sommige van de voornaamste illustraties van TI 2023.",
  "international2023_rewards_materials_title": "Power-ups voor Fantasy en de Road to TI Challenge",
  "international2023_rewards_materials_desc": "Gebruik aangepaste tools om betere spelers samen te stellen in de Fantasy Challenge of om je door uitdagende inhoud van de Road to TI Challenge te slaan.",
  "international2023_rewards_teleport_fx_title": "Teleportatie-effecten van je favoriete team",
  "international2023_rewards_teleport_fx_desc": "Toon trots je steun aan je favoriete team in het spel met aangepaste teleportatie-effecten op drie verschillende levels.",
  "international2023_rewards_Types_title": "Soorten beloningen",
  "international2023_rewards_Types_desc": "Elke soort beloning heeft zijn eigen voortgangsmeter. Is de meter vol, dan kun je je beloning opeisen. Sommige meters kun je eindeloos blijven hervullen, terwijl op andere een limiet staat.",
  "international2023_rewards_Levels_title": "Compendiumlevels",
  "international2023_rewards_Levels_desc": "Verdien compendiumlevels door deel te nemen aan compendiumactiviteiten of door levelpakketten te kopen. Gebruik levels om je voortgangsmeters te doen stijgen voor álle soorten beloningen.",
  "international2023_rewards_Boosters_title": "Boosters",
  "international2023_rewards_Boosters_desc": "Boosters lijken op compendiumlevels, maar gebruik je enkel om een specifieke beloning te verhogen. Als je een booster gebruikt voor een beloning, telt die ook mee in je voortgang om de replica van de Aegis te verdienen.",
  "international2023_supporters_clubs_title": "Fanclubs",
  "international2023_supporters_clubs_subtitle": "Steun rechtstreeks je favoriete teams",
  "international2023_supporters_clubs_intro": "Beloningen van de fanclub: geniet ervan zolang het kan, want ze zijn even vluchtig als je jeugd. Of tenminste, dat waren ze. Want vanaf nu zijn ze permanent! Je kunt er eeuwig van genieten! En eeuwig jong blijven!\\n\\nNog beter: 50% van iedere aankoop gaat rechtstreeks naar het team. Dat is dus beter voor het team. Dat eeuwige is beter voor jou.",
  "international2023_supporters_clubs_tiers_title": "Drie rangen voor steun",
  "international2023_supporters_clubs_tiers_desc": "Kies bronzen, zilveren of gouden rang om je favoriete teams te steunen en verdien beloningen die ontworpen zijn door de teams zelf.",
  "international2023_talent_title": "Talentenstickers",
  "international2023_talent_subtitle": "Steun rechtstreeks je favoriete talent",
  "international2023_talent_intro": "Het live uitzenden van e-sportwedstrijden is geen eenvoudige klus. Oké, het is niet zo zwaar als steenkool uit de mijnen halen. Maar laten we zeggen dat het net iets uitdagender is dan je creaties verkopen op Etsy. Waarmee we niet willen zeggen dat breien of haken makkelijk is.\\n\\nDit alles om aan te kondigen dat je vanaf nu een bericht kunt sturen naar je favoriete talent. Iets zoals 'Hé, knap wat je daar doet!' (zelfs al komt er geen steenkool aan te pas, en ook geen mooie gebreide trui). En 50% van elke verkoop van talentenstickers gaat rechtstreeks naar het talent.",
  "international2023_talent_tiers_title": "Kies je rang",
  "international2023_talent_tiers_desc": "Koop beloningsbundels met je favoriete talent in de hoofdrol. In een bundel zit een combinatie van stickers, uitspraken en handtekeningen afhankelijk van de rang van de gekochte bundel.",
  "international2023_talent_coming_soon": "Talentenbundels zijn te koop vanaf het moment dat het talent wordt aangekondigd.",
  "international2023_coming_soon": "Binnenkort verwacht",
  "ti12_bp_countdown_header": "Naar de groepsfase",
  "ti12_bp_countdown_desc": "Kijk mee naar het grootste toernooi van het jaar! Live uitgezonden vanuit Seattle, met de Aegis of Champions op het spel.",
  "ti12_bp_tournament_complete_desc": "Herbeleef de spanning van het grootse e-sporttoernooi van het jaar – ga met één klik op de knop terug naar alle actie in Seattle.",
  "ti12_group_stage_venue": "Online",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Steun het toernooi",
  "ti12_compendium_header": "Het compendium van The International 2023",
  "ti12_compendium_desc": "Geniet nog meer van het wedstrijdseizoen met het compendium van The International 2023. Speel als een pro bij de Road to TI Challenge. Stel je eigen team samen met je favoriete spelers met de vernieuwde Fantasy-league. Test je helderziendheid met de Oracle's Challenge. En hoop dat de teams rare dingen doen zodat je kunt winnen met onze gloednieuwe bingokaarten.\\n\\nVerdien beloningen zoals spelerstickers, teamstickers, chatwielen, een gepersonaliseerde HUD en meer. Je kunt zelfs een fysieke replica van de Aegis winnen.\\n\\n25% van elke aankoop gaat rechtstreeks naar de prijzenpot van The International 2023.",
  "ti12_compendium_standard": "Compendium – standaard",
  "ti12_compendium_upgraded": "Compendium – upgrade"
}