// 9405.js

{
  "language": "latam",
  "international2023_compendium_activity": "Actividad para propietarios del Compendio",
  "international2023_update_title": "Celebración The International 2023",
  "international2023_update_subtitle": "Desde fanáticos de la escena profesional hasta jugadores casuales, esta actualización de eSports tiene algo para todos.",
  "international2023_update_body": "Ya sea que estés al pendiente de cada segundo de cada partida de The International, como si apenas eres consciente de que hay gente que se gana la vida jugando a esto y solo quieres disfrutar del juego en paz, sigue leyendo: esta actualización tiene algo para ti.\\n\\n¿Eres fanático de los eSports? Crea tu propia alineación de profesionales con esta mejora de <b>Liga Fantasía.</b>¿Más bien eres entusiasta de los análisis? Sumérgete en las predicciones sobre grupos del <b>Desafío del Oráculo</b>. Tal vez eres un gran fanático de los juegos que jugaba tu bisabuela. Bueno, ¡incluso tenemos <b>Bingo</b> este año!\\n\\nPero tal vez no seas fanático de ninguna de esas cosas. Tal vez solo eres fanático y se acabó. Tenemos algo para ti también: la <b>Galería de perfil</b>. Ahora tu perfil es un monumento interactivo para ti mismo, presentando cualquier objeto y logro en tu historial de juego para que lo pongas ahí.",
  "international2023_update_footer": "Llegaste al final de la actualización. ¡Buen trabajo!",
  "international2023_compendium": "Compendio",
  "international2023_compendium_title": "Compendio de The International 2023",
  "international2023_compendium_intro": "El Compendio es tu compañero digital interactivo de El camino a The International 2023 y The International 2023.\\n\\nJuega como un profesional con el Desafío en El camino a The International. Selecciona a tus jugadores favoritos con un reto de liga de fantasía modificado y actualizado. Pon a prueba tu valor predictivo con las Predicciones de la fase de grupos y sus puestos. Gánate el premio mayor con los nuevos cartones de Bingo.\\n\\nPiensa en el Compendio como tu ventanilla única de actividades relacionadas con eventos, desafíos y todas las recompensas centradas en eventos de este año. Además, el 25 % de todas las ventas contribuirán al premio total en The International 2023.",
  "international2023_showcase_title": "Galería del perfil",
  "international2023_showcase_subtitle": "Nueva característica para todos los jugadores de Dota",
  "international2023_showcase_intro": "Se rediseñaron por completo el perfil y el miniperfil. Ahora puedes presumir todos tus objetos y logros de Dota, literalmente cualquier cosa en tu inventario de Dota con la nueva galería del perfil.\\n\\n¿Quieres hacer un altar para tu equipo profesional favorito del 2016? Puedes hacerlo. ¿Qué tal una colección de tus sets de héroes favoritos? Por supuesto que lo puedes hacer. ¿Mostrar cada posible par de zapatos de Kunkka? Tristemente, también se puede. Técnicamente, también puedes hacer eso.",
  "international2023_showcase_profile_title": "Perfil actualizado",
  "international2023_showcase_profile_desc": "Eres Miguel Ángel, ahora tu perfil es tu lienzo y solo estás limitado por tu imaginación (y tu sentido básico de decencia humana).",
  "international2023_showcase_mini_profile_title": "Miniperfil actualizado",
  "international2023_showcase_mini_profile_desc": "Los miniperfiles se parecen mucho a los perfiles con una distinción crucial (redoble de tambores): son más pequeños. Otros jugadores verán tu miniperfil cuando pasen el mouse sobre tu nombre.",
  "international2023_showcase_carousel_title": "Galerías de muestra",
  "international2023_showcase_items_title": "Mostrar objetos",
  "international2023_showcase_items_desc": "Personaliza tus galerías con una enorme variedad de todos los objetos y recompensas que has coleccionado a lo largo de los años.",
  "international2023_showcase_item_heroes_title": "Héroes",
  "international2023_showcase_item_trophies_title": "Trofeos",
  "international2023_showcase_item_stickers_title": "Calcomanías",
  "international2023_showcase_item_stats_title": "Estadísticas",
  "international2023_showcase_item_chat_wheels_title": "Ruedas de chat",
  "international2023_showcase_item_sprays_title": "Aerosoles",
  "international2023_showcase_item_items_title": "Objetos de la armería",
  "international2023_showcase_item_emoticons_title": "Emoticonos",
  "international2023_showcase_item_loading_screens_title": "Pantallas de carga",
  "international2023_showcase_item_couriers_title": "Mensajeros",
  "international2023_showcase_item_wards_title": "Guardianes",
  "international2023_tournament_prize_pool": "Premio total",
  "international2023_tournament_prize_pool_percent": "El 25 % de todas las ganancias del Compendio de The International 2023 contribuirán al premio total en The International 2023.",
  "international2023_tournament_learn_more": "Conoce más sobre el torneo",
  "international2023_quests_title": "El desafío de El camino a The International",
  "international2023_quests_intro": "Ya viste jugar a los profesionales. Los vitoreaste. Ahora juega como uno. Deslízate a la silla de juegos de tus jugadores favoritos de eSports y recrea sus mejores momentos del año pasado. Gana como sus héroes de una partida específica, o como uno de los cinco héroes que usaron durante un mes determinado de la temporada. Gana puntos por cada desafío y puntos de bonificación por completar conjuntos completos de desafíos.",
  "international2023_quests_match_title": "Desafíos de las partidas",
  "international2023_quests_match_desc": "Gana usando héroes de una partida profesional real.",
  "international2023_quests_pro_title": "Desafíos de jugadores",
  "international2023_quests_pro_desc": "Gana como uno de los héroes más seleccionados de un profesional.",
  "international2023_quests_rewards_title": "Obtén recompensas",
  "international2023_quests_rewards_desc": "Mejora tus recompensas ganando Puntos del Compendio a lo largo del camino.",
  "international2023_fantasy_title": "Liga Fantasía evolucionada",
  "international2023_fantasy_intro": "Selecciona un equipo de tus profesionales favoritos. Elabora las estadísticas que crees serán las más valiosas. Compite con jugadores de todo el mundo para obtener la mayor cantidad de puntos. Es la Liga Fantasía de Dota que recuerdas, pero rediseñada en todos los sentidos.",
  "international2023_fantasy_players_title": "Seleccionar",
  "international2023_fantasy_players_desc": "Selecciona a tu principal, medio y soporte favoritos.",
  "international2023_fantasy_craft_title": "Fabricar",
  "international2023_fantasy_craft_desc": "Usa renovaciones de fichas ganadas con tus recompensas del Compendio para intentar fabricar las mejores estadísticas para tus jugadores. Selecciona cuidadosamente algunas estadísticas; algunas son mejores en algunos jugadores que en otros.",
  "international2023_fantasy_compete_title": "Compite",
  "international2023_fantasy_compete_desc": "Cada fin de semana del torneo es una ronda de Fantasía por separado, por lo que tendrás oportunidades múltiples de competir contra tus amigos y el mundo. Gana Puntos del Compendio y, si tu lugar en la tabla de clasificación es lo suficientemente alta, ganarás un trofeo único.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "¿Te emocionas un poco cada vez que un equipo profesional compra un Estoque Divino?, ¿o con una partida que dura más de 80 minutos y todo empieza a ponerse un poco raro?, ¿qué tal cuando un equipo de héroes con 16 piernas pelea contra un equipo con apenas cuatro?\\n\\nBueno, prepárate para finalmente sacarle provecho a esa emoción. Bingo está aquí para que puedas capitalizar algunos eventos verdaderamente locos.",
  "international2023_bingo_cards_title": "UNA TARJETA DE BINGO POR CADA FIN DE SEMANA",
  "international2023_bingo_cards_desc": "Todos los propietarios del Compendio obtendrán un nuevo cartón de Bingo generado aleatoriamente para cada fin de semana del torneo. Este cartón está repleto de recuadros con condiciones raras y situaciones interesantes para que puedas vitorear mientras los profesionales compiten.",
  "international2023_bingo_rewards_title": "Completa filas, gana puntos",
  "international2023_bingo_rewards_desc": "Así es, no dejes que los dioses, los demonios y las criaturas del bosque con disparador te engañen, sigue siendo solo Bingo, amigos. Cuando completes una fila, columna o diagonal en tu cartón de Bingo, reclamarás una recompensa de Puntos del Compendio. Nota: gritar “BINGOOO” es opcional, pero se recomienda.",
  "international2023_predictions_title": "El Desafío del Oráculo",
  "international2023_predictions_intro": "El Oráculo utiliza la magia del ombligo astral para ver el futuro. Bueno, odiamos decírtelo así, pero la magia de base umbilical no es real. Vas a tener que usar tu astucia, tus conocimientos sobre eSports, y lo más importante, tus mejores conjeturas para cumplir el objetivo.\\n\\nPredice (de manera similar a un Oráculo, pero sin cordones umbilicales) qué equipos avanzarán y cuáles caerán durante cada fin de semana de torneo. Las conjeturas correctas (nos referimos a adivinaciones parecidas a las del Oráculo) te harán ganar Puntos del Compendio.",
  "international2023_predictions_group_stage_title": "Predice la fase de grupos",
  "international2023_predictions_group_stage_desc": "Intenta predecir el orden de los equipos en cada grupo (algo nuevo este año).",
  "international2023_predictions_ingame_title": "Predicciones dentro del juego",
  "international2023_predictions_ingame_desc": "Mientras ves la partida dentro del juego o en Twitch, pon a prueba tu poder predictivo antes de que suene el cuerno en cada partida. Obtendrás Puntos del Compendio por cada predicción correcta, hasta seis por día.",
  "international2023_rewards_title": "Recompensas del Compendio",
  "international2023_rewards_intro": "Si eres fanático del Dota competitivo y de obtener recompensas por ser fanático del mismo, las recompensas de este año son para ti. El Compendio 2023 está enfocado por completo en The International 2023 y la escena profesional de Dota.",
  "international2023_rewards_physical_aegis_title": "Modelo físico de la Égida",
  "international2023_rewards_physical_aegis_desc": "Una réplica a escala 1:5 hecha con aleación de níquel del famoso trofeo de campeones. ¡Muéstralo con orgullo! ¡Presúmelo sin compromiso! ¡Derrítelo y crea tu propia moneda!",
  "international2023_rewards_chat_wheels_title": "Ruedas de chat permanentes",
  "international2023_rewards_chat_wheels_desc": "A diferencia de años pasados, todas las ruedas de chat ahora son permanentes. Tal como lo dijimos en el título. Sí, este texto se siente un poco redundante, pero es agradable pasar un tiempo extra contigo.",
  "international2023_rewards_stickers_title": "Calcomanías de jugadores y equipos",
  "international2023_rewards_stickers_desc": "“¿Solo calcomanías de equipo?” Ni siquiera leíste el título, ¿verdad? También recibes calcomanías de jugadores. Honestamente, estos párrafos son solo empacar cacahuates destinados a proteger el título en camino a tus ojitos pajaritos.",
  "international2023_rewards_hud_title": "HUD de The International 2023",
  "international2023_rewards_hud_desc": "Ese último párrafo podría haber asustado a la gente para que no leyera este. Entonces, si seguiste leyendo: eres bastante inteligente. Fue una prueba y pasaste porque aquí hay alguna información no incluida en el título: el nuevo HUD está diseñado a la medida utilizando el tema de vitrales de este año.",
  "international2023_rewards_loading_screens_title": "Pantallas de carga",
  "international2023_rewards_loading_screens_desc": "Recibirás una pantalla de carga personalizada con temática de vitrales para cada equipo, así como algunas de las obras clave de TI de este año.",
  "international2023_rewards_materials_title": "Potenciadores de la Liga Fantasía y El camino a TI",
  "international2023_rewards_materials_desc": "Usa herramientas personalizadas para crear mejores jugadores en el Desafío Fantasía, o trabaja a través de contenido particularmente complicado en el Desafío de El camino a TI.",
  "international2023_rewards_teleport_fx_title": "Efectos de teletransportación de tu equipo favorito",
  "international2023_rewards_teleport_fx_desc": "Presume a tu equipo favorito dentro del juego con efectos de teletransportación personalizados en tres niveles diferentes.",
  "international2023_rewards_Types_title": "Tipos de recompensas",
  "international2023_rewards_Types_desc": "Cada tipo de recompensa tiene su propio medidor de progreso. Cuando se llene el medidor, podrás reclamar la recompensa. Algunos medidores se pueden rellenar tantas veces como quieras, mientras que otros tienen un límite de veces.",
  "international2023_rewards_Levels_title": "Niveles del Compendio",
  "international2023_rewards_Levels_desc": "Gana Niveles del Compendio participando en actividades del Compendio o comprando Lotes de Niveles. Aplica niveles para rellenar los medidores de progreso para TODOS los tipos de recompensas.",
  "international2023_rewards_Boosters_title": "Potenciadores",
  "international2023_rewards_Boosters_desc": "Los potenciadores son como Niveles del Compendio, pero para aumentar el progreso hacia una recompensa específica. El aplicar un potenciador también avanza el progreso de la Égida del Coleccionista.",
  "international2023_supporters_clubs_title": "Clubs de seguidores",
  "international2023_supporters_clubs_subtitle": "Apoya directamente a tus equipos favoritos",
  "international2023_supporters_clubs_intro": "Las recompensas del Club de seguidores son como las alegrías de la juventud: disfrútalas mientras puedas, porque pasan volando o al menos lo fueron. A partir de ahora, ¡son permanentes! ¡Así que ahora puedes disfrutarlas para siempre! A menos que te atropelle un autobús.\\n\\n Aún mejor: el 50 % de todas las ventas van directamente al equipo. Bueno, incluso mejor para ellos. Lo primero es mejor para ti.",
  "international2023_supporters_clubs_tiers_title": "Tres niveles de apoyo",
  "international2023_supporters_clubs_tiers_desc": "Selecciona el apoyo de bronce, plata u oro para tus equipos favoritos para obtener recompensas diseñadas por los propios equipos.",
  "international2023_talent_title": "Calcomanías de talentos",
  "international2023_talent_subtitle": "Apoya directamente a tus talentos favoritos",
  "international2023_talent_intro": "La retransmisión de eSports en directo es un trabajo duro. No tan difícil como el trabajo en una mina de carbón, obviamente, pero es más duro que tejer cosas en Etsy. Bueno, obviamente no hablamos de todos los tejidos, algunos de esos coloridos cárdigans tejidos se ven bastante complicados. \\n\\n Ahora puedes mandar un mensaje a tu talento favorito que diga: “Oye, respeto lo que haces, no tanto como a un minero, pero sí más que al 50 % de los creadores de Etsy”. Hablando del 50 %, la mitad de todas las ganancias de las calcomanías de talentos van directamente a ellos.",
  "international2023_talent_tiers_title": "Selecciona tu nivel",
  "international2023_talent_tiers_desc": "Compra lotes de recompensas de tus talentos favoritos. Los lotes incluyen una combinación de calcomanías, líneas de voz y autógrafos dependiendo del nivel del paquete que compres.",
  "international2023_talent_coming_soon": "Los lotes de talento estarán disponibles para su compra cuando se anuncien los talentos.",
  "international2023_coming_soon": "Próximamente",
  "ti12_bp_countdown_header": "A la fase de grupos",
  "ti12_bp_countdown_desc": "Sintoniza el mayor torneo de eSports del año con retransmisiones en directo desde Seattle con la batalla por la Égida de los Campeones de por medio.",
  "ti12_bp_tournament_complete_desc": "Revive la emoción del mayor torneo de eSports del año. Toda la acción de Seattle está solo a un clic de distancia.",
  "ti12_group_stage_venue": "En línea",
  "ti12_playoffs_venue": "En el Seattle Convention Center",
  "ti12_main_event_venue": "En el Climate Pledge Arena",
  "ti12_compendium_small_header": "Apoya el Torneo",
  "ti12_compendium_header": "Compendio de The International 2023",
  "ti12_compendium_desc": "Desbloquea aún más de la temporada de torneos con el Compendio de The International 2023. Juega como un profesional con el Desafío de El camino a TI. Haz una lista de tus profesionales favoritos con la Liga Fantasía rediseñada. Pon a prueba tus habilidades predictivas con el Desafío del Oráculo. Y con la esperanza de que los equipos hagan algunas cosas raras con una nueva función de Bingo.\\n\\nObtén recompensas como calcomanías de jugadores, calcomanías de equipos, ruedas de chat, un HUD personalizado y más, hasta una réplica física de la Égida.\\n\\nEl 25 % de todas las ventas del Compendio van directamente al premio total en The International.",
  "ti12_compendium_standard": "Compendio estándar",
  "ti12_compendium_upgraded": "Compendio mejorado"
}