// 1378.js

{
  "language": "russian",
  "ringmastercomic_title_cover": "«Марионетка» — обложка",
  "ringmastercomic_title": "«Марионетка» — стр. %1$s",
  "ringmastercomic_help_text": "Листайте нажатием мыши или клавишей пробела",
  "ringmastercomic_return_button": "Вернуться к обложке",
  "ti13_online": "Копенгаген",
  "ti13_main_event_venue": "«Роял Арена», Копенгаген",
  "ti13_best_of_three": "До двух побед",
  "ti13_best_of_five": "До трёх побед",
  "ti13_group_stage_sp_rules": "Групповой этап — правила очерёдности выбора",
  "ti13_group_stage_sp_game1": "Происходит бросок монеты.",
  "ti13_group_stage_sp_game2": "Первая игра: команда, победившая в новом броске, выбирает очерёдность или сторону.",
  "ti13_group_stage_sp_game3": "Вторая игра: команда, проигравшая в броске, выбирает очерёдность или сторону.",
  "ti13_group_stage_sp_game4": "Третья игра (при необходимости): происходит новый бросок монеты; победившая в нём команда выбирает очерёдность или сторону.",
  "ti13_group_stage_tie_rules": "Групповой этап — правила переигровок",
  "ti13_first_second_tie": "Две команды делят 1-е и 2-е места",
  "ti13_second_third_tie": "Две команды делят 2-е и 3-е места",
  "ti13_third_fourth_tie": "Две команды делят 3-е и 4-е места",
  "ti13_three_way_first_tie": "Три команды делят 1-е место",
  "ti13_three_way_second_tie": "Три команды делят 2-е место",
  "ti13_four_way_tie": "Четыре команды делят 1-е место",
  "ti13_tie_resolve_bo3": "Ничья разрешается игрой до двух побед.",
  "ti13_tie_resolve_third_fourth": "Дальнейшие игры не проводятся. Команды остаются в положении ничьей за 3-е и 4-е места.",
  "ti13_tie_resolve_first_with_round_robin": "1-е место определяется матчами до одной победы по круговой системе, пока одна команда не победит дважды.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Матчи продолжаются, пока каждая команда не сыграет с каждой хотя бы один раз. 2-е и 3-е места определяются по результатам последнего матча по круговой системе.",
  "ti13_tie_resolve_second_with_round_robin": "2-е место определяется матчами до одной победы по круговой системе, пока одна команда не победит дважды.",
  "ti13_tie_resolve_third_fourth_other": "Дальнейшие игры не проводятся. Оставшиеся команды остаются в положении ничьей за 3-е и 4-е места.",
  "ti13_tie_resolve_four_way_1": "Команды случайным образом распределяются по парам. В рамках этих правил команды называются «Командой A», «Командой B», «Командой C» и «Командой D».",
  "ti13_tie_resolve_four_way_2": "Команда A играет с командой B до одной победы. Команда C играет с командой D до одной победы.",
  "ti13_tie_resolve_four_way_3": "1-е место определяется матчем до одной победы между победителями пары A/B и пары C/D.",
  "ti13_tie_resolve_four_way_4": "4-е место определяется матчем до одной победы между проигравшими пары A/B и пары C/D.",
  "ti13_tie_resolve_four_way_5": "2-е и 3-е места определяются матчем до одной победы между оставшимися командами.",
  "ti13_seeding_decider_sp_rules": "Решающий матч посева — правила очерёдности выбора",
  "ti13_seeding_decider_sp_rules_1": "Первая игра: команда, занявшая более высокое место в групповом этапе, выбирает очерёдность или сторону.",
  "ti13_seeding_decider_sp_rules_2": "Вторая игра: команда, занявшая менее высокое место в групповом этапе, выбирает очерёдность или сторону.",
  "ti13_seeding_decider_sp_rules_3": "Третья игра (при необходимости): команда, занявшая более высокое место в групповом этапе, выбирает очерёдность или сторону.",
  "ti13_playoffs_and_ti_sp_rules": "Плей-офф и The International — правила очерёдности выбора",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Происходит бросок монеты.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Первая игра: команда, победившая в броске, выбирает очерёдность или сторону.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Вторая игра: команда, проигравшая в броске, выбирает очерёдность или сторону.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Третья игра (при необходимости): происходит новый бросок монеты; победившая в нём команда выбирает очерёдность или сторону.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Первая игра: победитель верхней сетки выбирает очерёдность или сторону.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Вторая игра: победитель нижней сетки выбирает очерёдность или сторону.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Третья игра: победитель верхней сетки выбирает очерёдность или сторону.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Четвёртая игра (при необходимости): победитель нижней сетки выбирает очерёдность или сторону.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Пятая игра (при необходимости): происходит бросок монеты; победившая в нём команда выбирает очерёдность или сторону.",
  "international2024_update_title": "TI 2024, Ringmaster и компендиум",
  "ringmaster_hype": "«Личи и Лины, Сларки и Марси, жертвы всех возрастов! Наконец-то наступил момент, которого вы все так ждали.\\n\\n Уже почти год я существую лишь на словах, произносимых едва слышным шёпотом, и остаюсь незаметен — словно тень за пурпурным занавесом. Но теперь, выдержав (неприлично долгую, как мне кажется) паузу, бестолочи во главе этого балагана наконец позволили мне почтить вас своим великолепием, и вот я скромно занимаю своё место в свете софитов! Это я, Колиостро Кеттл, маэстро мучений! Тёмный глашатай проклятых! Единственный и неповторимый Магистр манежа! И у меня в рукаве припасена пара фокусов!»",
  "ringmaster_comic": "«Но не верьте мне на слово! Почему бы вам не узнать о моём трагическом происхождении от достойного доверия анонимного рассказчика?»",
  "ringmaster_comic_title": "«Марионетка»",
  "ringmaster_comic_desc": "Узнайте о былых гастролях Колиостро с «Заводным цирком Кеттла».",
  "ringmaster_guide": "«Меня попросили стать вашим гидом по компендиуму этого года, и я с благодарностью согласился. В конце концов, нам нужно узнать друг друга поближе! [b]Приступим же![/b]»",
  "ringmaster_introducing": "Встречайте,",
  "ringmaster_hero_detail_button": "Информация о герое",
  "ringmaster_play_trailer_button": "Трейлер",
  "ringmaster_comic_button": "Комикс",
  "international2024_compendium": "Компендиум",
  "international2024_compendium_title": "Компендиум The International 2024",
  "international2024_effigies_title": "СТАТУЯ ДЛЯ КАЖДОГО ГЕРОЯ",
  "international2024_effigies_subtitle": "Улучшенная функция, доступная каждому",
  "international2024_effigies_intro": "«В не таком далёком прошлом, мои дорогие друзья, эти величественные статуи были настоящими диковинками! Но довольно! Теперь собственный монумент ждёт каждого гиганта, готового ступить на поле брани, — будь то ваш покорный слуга или остальные, не столь именитые герои!»",
  "international2024_effigies_desc": "Статуя — это настраиваемая скульптура любимого героя, которая будет украшать вашу базу. Раньше она выбиралась в разделе «Окружение» для всех героев одновременно, но теперь у каждого из них есть своя ячейка в арсенале и личная статуя для неё.\\n\\nВы можете как ограничиться новой стандартной статуей, так и создать свою собственную.",
  "international2024_purchase_intro": "«Боги и чудовища, служки и зверушки, подходите и возрадуйтесь возможности взглянуть на [b]самый захватывающий сборник игр, событий и киберспортивных наград[/b] по эту сторону реки! Проверьте свою смекалку, удачливость и стойкость на самом грандиозном празднестве киберспорта в этом мире и за его пределами!»",
  "international2024_activities": "ВОТ ЧТО ВЫ ПОЛУЧИТЕ",
  "international2024_activities_subtitle": "Игры на удачу, битвы за награды и радости для всех возрастов ",
  "international2024_activities_intro": "«Мне подсказывают, что некоторые из вас, в отличие от вашего уравновешенного распорядителя, не убивают без ПРИЧИНЫ. Так что, друзья, вам будет приносить очки каждая игра! А чем больше играешь — тем больше получаешь, поэтому поспешите на линии и приумножьте свои очки!»",
  "international2024_activities_play_title": "Зарабатывайте очки за игру",
  "international2024_activities_play_desc": "В этом году еженедельное испытание будет давать вам очки почти за каждую игру — и это не считая бонуса за первую победу дня.",
  "international2024_activities_fantasy_title": "Фэнтези-лига",
  "international2024_activities_fantasy_desc": "Создавайте усиленные карточки и соберите лучший фэнтези-состав из своих любимых профессионалов, чтобы посоревноваться со своими друзьями и со всем миром.",
  "international2024_activities_oracles_title": "Испытание Оракула",
  "international2024_activities_oracles_desc": "Предскажите, какие команды покинут каждый этап турнира, а какие пройдут дальше, и упивайтесь славой великого предсказателя (если вы оказались правы, конечно же).",
  "international2024_activities_bingo_title": "Бинго",
  "international2024_activities_bingo_desc": "На каждом этапе турнира вы получите случайную карточку бинго, полную странных условий и необычных ситуаций.",
  "international2024_activities_outro": "«Помните: не только победы приносят радость! За каждый свой успех в этих играх вы будете получать очки! Заходите в палатку с призами ниже и узнайте, что вас ждёт!»",
  "international2024_rewards_title": "Награды компендиума",
  "international2024_rewards_subtitle": "Проходите, не стесняйтесь, и в наградах искупайтесь",
  "international2024_rewards_intro": "«Множьте гору трупов и зарабатывайте награды! Да ещё КАКИЕ! Ваши руки, сжимающие горло незадачливого героя, в глазах которого угасает жизнь — это лишь ПОЛОВИНА удовольствия! А вот что вы получите ПОСЛЕ!»",
  "international2024_rewards_physical_aegis_title": "Копия эгиды чемпионов",
  "international2024_rewards_physical_aegis_desc": "Миниатюра прославленного чемпионского трофея из никелевого сплава в масштабе 1:5 избавит вас от дефицита эгид в жизни и на полке.",
  "international2024_rewards_hud_title": "Стиль интерфейса The International 2024",
  "international2024_rewards_hud_desc": "Мы обновили внутриигровой интерфейс в соответствии с тематикой этого года, чтобы вы могли придать своей игре атмосферу цирка.",
  "international2024_rewards_versus_title": "Новый экран соперников",
  "international2024_rewards_versus_desc": "Подкрепите свой предыгровой боевой дух с особым экраном соперников этого года, который представит статуи вашей команды.",
  "international2024_rewards_chat_wheels_title": "Постоянные фразы колеса чата",
  "international2024_rewards_stickers_title": "Наклейки игроков и команд",
  "international2024_rewards_loading_screens_title": "Загрузочные экраны",
  "international2024_rewards_materials_title": "Награды для фэнтези-лиги и бинго",
  "international2024_rewards_teleport_fx_title": "Эффект телепортации любимой команды",
  "international2024_rewards_effigy_title": "Новый блок для статуи",
  "international2024_supporters_clubs_title": "Поддержите сообщество",
  "international2024_supporters_clubs_subtitle": "Комплекты от команд и работников студии",
  "international2024_supporters_clubs_intro": "«Уважаемые благотворители! Филантропы всех возрастов! Скромные покровители убийств и смежных с ним видов искусств! 50% ваших великодушных воздаяний получат непосредственно ваши любимые команды и работники студии! Кто здесь настоящий герой? Конечно же, я! Ведь это мои грандиозные геройские руки аплодируют ВАМ!»",
  "international2024_supporters_clubs_tiers_title": "Клубы поддержки команд",
  "international2024_supporters_clubs_tiers_desc": "Выберите уровень поддержки, который подходит вам. Контент во всех трёх разрядах создали сами команды.",
  "international2024_talent_tiers_title": "Комплекты с наклейками работников",
  "international2024_talent_tiers_desc": "Приобретайте комплекты наград от своих любимых работников студии. В зависимости от разряда комплекта он может содержать наклейки, фразы для колеса чата и автографы.",
  "ti13_compendium_small_header": "Поддержите турнир",
  "ti13_compendium_header": "Компендиум The International 2024",
  "ti13_compendium_desc": "Компендиум — это ваш интерактивный цифровой проводник в мир заданий, конкурсов и наград, приуроченных к турниру этого года. Кроме того, 25% от всех продаж идут в призовой фонд The International 2024.",
  "ti13_compendium_bp_btn": "Открыть сайт",
  "ti13_compendium_standard": "Стандартный компендиум",
  "ti13_compendium_standard_subtitle": "Все функции и возможности",
  "ti13_compendium_upgraded": "Улучшенный компендиум",
  "ti13_compendium_upgraded_subtitle": "Все функции и возможности с ускоренным получением наград",
  "ti13_compendium_purchase_tp_fx": "Эффект телепортации 1-го уровня",
  "ti13_compendium_purchase_boosters_footnote": "Усилители открывают награды на ваш выбор",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "С помощью усилителей можно быстрее получить особый интерфейс или другие награды на ваш выбор",
  "ti13_compendium_purchase_levels": "%1$s уровней компендиума",
  "ti13_compendium_purchase_booster_levels": "%1$s усилителей",
  "ti13_compendium_purchase_discount": "Экономия на уровнях: %1$s%",
  "ti13_compendium_purchase_earn_the_following": "С уровнями вы получите:",
  "ti13_compendium_contribution": "25% от всех продаж идут в призовой фонд The International 2024.",
  "ti13_compendium_purchase_all_access": "Доступ ко всем функциям компендиума",
  "ti13_compendium_purchase_aegis_emoticon": "Смайлик c эгидой",
  "ti13_compendium_purchase_bingo_tokens": "Жетоны бинго (%1$s шт.)",
  "ti13_compendium_purchase_fantasy_tokens": "Замены для фэнтези-лиги (%1$s шт.)",
  "ti13_compendium_purchase_one_player_sticker": "Капсулу с наклейками игроков",
  "ti13_compendium_purchase_player_stickers": "Капсулы с наклейками игроков (%1$s шт.)",
  "ti13_compendium_purchase_team_stickers": "Капсулы с наклейками команд (%1$s шт.)",
  "ti13_compendium_purchase_effigy_blocks": "Блок для статуи TI 2024 (%1$s шт.)",
  "ti13_compendium_purchase_team_loading_screens": "Сокровищницы с экранами команд (%1$s шт.)",
  "ti13_compendium_purchase_ti_loading_screens": "Сокровищницы с экранами турнира (%1$s шт.)",
  "international2024_tournament_learn_more": "Узнать больше о турнире",
  "ringmaster_abilities_heading": "Способности",
  "ringmaster_souvenirs_heading": "Сувениры",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "ПРЕРЫВАЕМАЯ — герой замахивается кнутом, чтобы затем ударить им по выбранной области. Оказавшиеся в ней враги получают урон и в страхе убегают от владельца способности. Чем дольше замах, тем больше урон и длительность страха, но меньше радиус удара.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ненадолго помещает владельца или союзного героя в передвижной внепространственный ящик, который позволяет цели проходить сквозь существ, а также увеличивает её скорость передвижения и сопротивление магии и замедлениям. Помимо этого, героя внутри ящика нельзя выбрать целью, но и он не может атаковать, применять способности или использовать предметы. Ящик откроется преждевременно, если выйдет за радиус действия.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Герой бросает один из своих кинжалов в выбранном направлении. Попав во врага, кинжал ненадолго замедляет его и наносит ему первичный урон, после чего каждую секунду наносит урон, зависящий от максимального здоровья жертвы.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Герой запускает в указанную точку колесо чудес, которое расталкивает врагов на пути, а по достижении цели начинает наносить урон всем врагам вокруг и замедлять их. Колесо завораживает и манит к себе вражеских героев, которые смотрят на него дольше 0,5 секунды. Как только оно заворожит хоть одну жертву, активируется таймер взрыва, который нанесёт урон в области действия. Если колесо никого не заворожит за 8 секунд, оно взорвётся автоматически.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Герой призывает луч прожектора, который гуляет по выбранной области, раскрывая невидимость врагов и вынуждая их промахиваться частью атак. Иллюзии под светом луча постепенно тают, каждую секунду теряя долю от максимального здоровья.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Герой получает один случайный карнавальный сувенир — уникальный одноразовый расходник — каждый раз, когда неподалёку погибает вражеский герой. Если у героя уже есть неиспользованный сувенир, новые продолжают накапливаться в виде зарядов способности. Если при возрождении у героя нет сувениров, то он получит один просто так.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Использование: Proportion Distortion\\n\\nСоздаёт иллюзию владельца, которая существует 18 секунд. Она получает 300% урона и наносит 28% от урона владельца.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Использование: Whoopsie\\n\\nТолкает владельца вперёд на расстояние в 400 и на 3 секунды создаёт вонючее облако радиусом 200, которое замедляет врагов на 30%.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic",
  "ringmaster_ability_strongman_tonic_Description": "Использование: Forcefully Imbibe\\n\\nВременно увеличивает силу выбранного союзного героя на 5 + 1,5 за уровень владельца. Максимальный эффект сохраняется 4 секунды, а затем постепенно угасает, пока не исчезнет полностью через 8 секунд с момента применения."
}