// 7535.js

{
  "language": "swedish",
  "international2023_compendium_activity": "Aktivitet för kompendieägare",
  "international2023_update_title": "Firandet av The International 2023",
  "international2023_update_subtitle": "E-sportuppdateringen har något för alla – oavsett om du är proffs eller amatör.",
  "international2023_update_body": "Oavsett om du följer varje nervkittlande sekund av varje match under The International eller om du knappt är medveten om att det finns folk som spelar Dota som heltidsjobb och du bara vill titta på matcherna i lugn och ro, läs vidare för den här uppdateringen är relevant för dig.\\n\\nÄr du e-sportfanatiker? Skapa en egen laguppställning av proffs med den uppgraderade <b>fantasiligan.</b> Är du mer analytiskt lagd? Försök att förutsäga slutspelsresultatet i <b>Oraklets utmaning</b>. Kanske är du ett stort fan av spel som spelas av din gammelfaster? Vi erbjuder till och med <b>bingo</b> i år!\\n\\nEller så kanske inget av det där faller dig i smaken. Kanske är du mest ett stort fan av dig själv. Vi har något för dig också: <b>profilmontern</b>. Din profil är nu ett interaktivt monument av dig själv, och du kan fylla det med så många föremål och prestationer från din spelhistorik som du har lust med.",
  "international2023_update_footer": "Du har kommit till slutet av uppdateringen. Snyggt jobbat!",
  "international2023_compendium": "Kompendium",
  "international2023_compendium_title": "International 2023-kompendiet",
  "international2023_compendium_intro": "Kompendiet är din digitala följeslagare under Vägen till The International och The International 2023.\\n\\nSpela som ett proffs i Vägen till The International-utmaningen. Samla ihop ett lag med dina favoritspelare till den förnyade och uppdaterade fantasiutmaningen. Testa din klärvoajans med förutsägelser för grupp- och slutspel. Kamma hem storvinsten med de helt nya bingobrickorna.\\n\\nTänk på kompendiet som en kontaktpunkt för eventrelaterade aktiviteter, utmaningar och alla belöningar relaterade till årets turnering. Dessutom kommer 25 % av alla intäkter från försäljningen att gå till prispotten för The International 2023.",
  "international2023_showcase_title": "Profilmontern",
  "international2023_showcase_subtitle": "Ny funktion för alla Dota-spelare",
  "international2023_showcase_intro": "Profilen och miniprofilen har ny design för alla spelare (eller för 98 % av er spelare som har en kommunikationspoäng på över 6 000). Nu kan du visa upp alla dina Dota-föremål och -prestationer – bokstavligen vad som helst från ditt Dota-förråd – med den nya profilmontern.\\n\\nVill du skapa en helgedom åt ditt favoritlag från 2016? Du kan göra det. Vad sägs om en samling av dina favoritset? Du kan absolut göra det med. Ett av alla möjliga par av Kunkkas skor? Tyvärr, ja. Tekniskt sett kan du också göra det.",
  "international2023_showcase_profile_title": "Uppdaterad profil",
  "international2023_showcase_profile_desc": "Du är Michelangelo – din profil är nu din målarduk och det är bara fantasin som sätter gränser (och grundläggande mänsklig anständighet).",
  "international2023_showcase_mini_profile_title": "Uppdaterad miniprofil",
  "international2023_showcase_mini_profile_desc": "Miniprofiler påminner mycket om profiler, men det finns en viktig skillnad – håll i dig nu – de är mindre. Andra spelare ser miniprofilen när de hovrar över ditt namn.",
  "international2023_showcase_carousel_title": "Exempel på montrar",
  "international2023_showcase_items_title": "Visa upp föremål",
  "international2023_showcase_items_desc": "Anpassa montrarna med ett stort urval av alla föremål och belöningar som du har samlat på dig under åren.",
  "international2023_showcase_item_heroes_title": "Hjältar",
  "international2023_showcase_item_trophies_title": "Troféer",
  "international2023_showcase_item_stickers_title": "Klistermärken",
  "international2023_showcase_item_stats_title": "Statistik",
  "international2023_showcase_item_chat_wheels_title": "Chatthjul",
  "international2023_showcase_item_sprays_title": "Sprejer",
  "international2023_showcase_item_items_title": "Vapenförrådsföremål",
  "international2023_showcase_item_emoticons_title": "Uttryckssymboler",
  "international2023_showcase_item_loading_screens_title": "Laddningsskärmar",
  "international2023_showcase_item_couriers_title": "Kurirer",
  "international2023_showcase_item_wards_title": "Wards",
  "international2023_tournament_prize_pool": "Prispott",
  "international2023_tournament_prize_pool_percent": "25 % av alla intäkter från The International 2023-kompendiet går till prispotten för The International 2023.",
  "international2023_tournament_learn_more": "Läs mer om turneringen",
  "international2023_quests_title": "Vägen till The International-utmaningen",
  "international2023_quests_intro": "Du har sett proffsen. Du har hejat på dem. Nu är det din tur att spela som ett proffs. Slå dig ner i proffsspelarnas stolar och återskapa deras största ögonblick från det senaste året. Vinn som hjältarna de spelade under en särskild match eller som en av fem hjältar de använde under en viss månad under säsongen. Få poäng för varje utmaning och extrapoäng när du slutför ett set med utmaningar.",
  "international2023_quests_match_title": "Matchutmaningar",
  "international2023_quests_match_desc": "Vinn med hjältar från en riktig proffsmatch.",
  "international2023_quests_pro_title": "Spelarutmaningar",
  "international2023_quests_pro_desc": "Vinn som en av proffsens mest spelade hjältar.",
  "international2023_quests_rewards_title": "Tjäna belöningar",
  "international2023_quests_rewards_desc": "Förbättra belöningarna med kompendiepoäng som du tjänar längs vägen.",
  "international2023_fantasy_title": "Utvecklad fantasi",
  "international2023_fantasy_intro": "Välj ett lag bestående av dina favoritproffs. Bestäm vilken statistik du tror kommer att betyda mest. Tävla mot spelare från hela världen för att tjäna flest poäng. Det är Dota-fantasiligan du kommer ihåg, men den har omarbetats på alla möjliga sätt.",
  "international2023_fantasy_players_title": "Välj",
  "international2023_fantasy_players_desc": "Välj din favoritroll: Core, mid och support.",
  "international2023_fantasy_craft_title": "Tillverka",
  "international2023_fantasy_craft_desc": "Använd intjänade rullar med dina kompendiebelöningar och försök att avgöra den bästa statistiken för spelarna. Välj med omsorg – en del statistik passar vissa spelare bättre än andra.",
  "international2023_fantasy_compete_title": "Tävla",
  "international2023_fantasy_compete_desc": "Varje helg under turneringen hålls en separat fantasirunda så du har flera chanser att tävla mot vänner och världen. Tjäna kompendiumpoäng och få en unik trofé – om du tar dig tillräckligt högt på ledartavlan.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Blir du lite spänd varje gång ett proffslag köper en Divine Rapier? Eller när en match varar i över 80 minuter och allt börjar kännas lite konstigt? Hur känns det när ett lag bestående av hjältar med 16 ben slåss mot ett lag med bara fyra?\\n\\nDå kan du äntligen göra dig redo att inkassera på den spänningen. Bingo är här för att låta dig vinna på riktigt vanvettiga händelser.",
  "international2023_bingo_cards_title": "EN BINGOBRICKA VARJE HELG",
  "international2023_bingo_cards_desc": "Alla som har ett kompendium får en ny, slumpmässigt genererad bingobricka varje helg under turneringen. Brickan är proppfylld med rutor med märkliga villkor och intressanta situationer som du kan heja på medan proffsen tävlar.",
  "international2023_bingo_rewards_title": "Fyll rader och tjäna poäng",
  "international2023_bingo_rewards_desc": "Det stämmer – låt inte gudarna, demonerna och skjutglada skogsvarelser lura dig. Det är fortfarande bara bingo, gott folk. När du fyller i en hel rad, kolumn eller diagonal på bingobrickan får du kompendiepoäng som belöning. Det är valfritt att ropa ”BINGO” men det uppmuntras.",
  "international2023_predictions_title": "Oraklets utmaning",
  "international2023_predictions_intro": "Oraklet använder astral navelmagi för att se in i framtiden. Vi hatar att avslöja det för dig men astral navelmagi finns inte på riktigt. Du måste använda dina kloka kunskaper om e-sport och viktigast av allt: gissa dig till resultatet.\\n\\nFörutse på navellöst orakelvis vilka lag som går vidare och vilka som inte klarar sig under varje turneringshelg. Rätta gissningar (och med det menar vi orakelaktiga spådomar) ger dig kompendiepoäng.",
  "international2023_predictions_group_stage_title": "Förutse gruppspelet",
  "international2023_predictions_group_stage_desc": "Nytt för i år är att du kan göra ett försök att förutse lagens placering i varje grupp.",
  "international2023_predictions_ingame_title": "Förutsägelser i spelet",
  "international2023_predictions_ingame_desc": "När du tittar i spelet eller på Twitch kan du testa hur bra du är på förutsägelser innan hornet ljuder i varje match. Du får kompendiepoäng för upp till sex korrekta förutsägelser per dag.",
  "international2023_rewards_title": "Kompendiebelöningar",
  "international2023_rewards_intro": "Om du gillar tävlingsinriktad Dota och att få belöningar för att gilla tävlingsinriktad Dota, då är årets belöningar något för dig. 2023 års kompendium fokuserar nämligen fullständigt på The International 2023 och professionell Dota.",
  "international2023_rewards_physical_aegis_title": "Fysisk Aegis-modell",
  "international2023_rewards_physical_aegis_desc": "En kopia i nickellegering i 1:5-skala av det berömda mästarpriset. Visa upp den med stolthet! Visa upp den utan förpliktelser! Smält den och skapa en egen valuta!",
  "international2023_rewards_chat_wheels_title": "Permanenta chatthjul",
  "international2023_rewards_chat_wheels_desc": "Till skillnad från tidigare år är alla chatthjul permanenta nu. Precis som vi nämnde i rubriken. Ja, den här texten känns lite överflödig. Men det är ju alltid trevligt att få tillbringa lite extra tid med dig.",
  "international2023_rewards_stickers_title": "Spelar- och lagklistermärken",
  "international2023_rewards_stickers_desc": "Endast lagklistermärken? Läste du ens rubriken? Du får spelarklistermärken också. Ärligt talat, de här styckena är bara förpackningsmaterial menat att beskydda rubriken under transporten till dina ögon.",
  "international2023_rewards_hud_title": "HUD till The International 2023",
  "international2023_rewards_hud_desc": "Det föregående stycket kan ha skrämt bort en del från att läsa detta, så det var ganska smart av dig att bli kvar. Det var ett test och du klarade det. Här kommer lite information som inte finns med i rubriken: Den nya HUD:en är utformad som ett glasmåleri, vilket är årets tema.",
  "international2023_rewards_loading_screens_title": "Laddningsskärmar",
  "international2023_rewards_loading_screens_desc": "Du får en laddningsskärm med glasmålningsmotiv för varje lag, samt några av de centrala motiven från årets TI.",
  "international2023_rewards_materials_title": "Verktyg för fantasispel och utmaningen Vägen till The International",
  "international2023_rewards_materials_desc": "Använd anpassade verktyg för att skapa bättre spelare i fantasiutmaningen eller jobba dig igenom särskilt svårt innehåll i Vägen till TI-utmaningen.",
  "international2023_rewards_teleport_fx_title": "Favoritlagets teleporteringseffekter",
  "international2023_rewards_teleport_fx_desc": "Visa upp favoritlaget i spelet med anpassade teleporteringseffekter på tre olika nivåer.",
  "international2023_rewards_Types_title": "Belöningstyper",
  "international2023_rewards_Types_desc": "Varje belöningstyp har sin egen framstegsmätare. När mätaren fylls kan du hämta belöningen. Vissa mätare kan fyllas på hur många gånger som helst medan andra bara kan fyllas på ett visst antal gånger.",
  "international2023_rewards_Levels_title": "Kompendienivåer",
  "international2023_rewards_Levels_desc": "Tjäna kompendienivåer genom att delta i kompendieaktiviteter eller genom att köpa nivåpaket. Använd nivåer för att öka framstegsmätaren för ALLA belöningstyper.",
  "international2023_rewards_Boosters_title": "Boosters",
  "international2023_rewards_Boosters_desc": "Boosters är som kompendienivåer men används till att öka en särskild belöning. När en booster används på en belöning ökar också framstegen på Collector's Aegis.",
  "international2023_supporters_clubs_title": "Supporterklubbar",
  "international2023_supporters_clubs_subtitle": "Stöd dina favoritlag direkt",
  "international2023_supporters_clubs_intro": "Belöningar från supporterklubbar är som ungdomens glädje – de är flyktiga så ta del av dem medan du kan. Eller rättare sagt: De brukade vara flyktiga, men från och med i år varar de för evigt! Så nu kan du glädjas åt dem för alltid ... så länge du inte trillar av pinn.\\nNågot som är ännu bättre är att 50 % av intäkterna går direkt till laget. Eller ja, det är bättre för dem. Den första grejen om belöningar från supporterklubbar är bättre för dig.",
  "international2023_supporters_clubs_tiers_title": "Tre nivåer av stöd",
  "international2023_supporters_clubs_tiers_desc": "Välj brons, silver eller guld som stöd för dina favoritlag och tjäna belöningar designade av lagen själva.",
  "international2023_talent_title": "Talangklistermärken",
  "international2023_talent_subtitle": "Stöd din favorittalang direkt",
  "international2023_talent_intro": "Direktsändning av e-sport är ett tufft jobb. Ja, inte så tufft som att bryta kol såklart. Men tuffare än att sälja grytlappar på Tradera. Eller ja, inte alla grytlappar förstås. Såna virkade med olika färger och mönster ser rätt komplicerade ut. \\n\\nNu kan du skicka ett meddelande till din favorittalang som säger, ”Hej du, jag respekterar vad du gör. Inte lika mycket som en gruvarbetare men minst 50 % mer än grytlappssäljare på Tradera”. På tal om 50 % går hälften av alla intäkter från talangklistermärken direkt till talangen.",
  "international2023_talent_tiers_title": "Välj nivå",
  "international2023_talent_tiers_desc": "Köp belöningsbuntar med din favorittalang i huvudrollen. Buntar inkluderar en kombination av klistermärken, röstrepliker och autografer beroende på det köpta paketets nivå.",
  "international2023_talent_coming_soon": "Talangbuntar kommer att finnas tillgängliga för köp efter att talangerna har tillkännagivits.",
  "international2023_coming_soon": "Kommer snart",
  "ti12_bp_countdown_header": "Till gruppspelet",
  "ti12_bp_countdown_desc": "Ta del av årets största e-sportturnering som sänds live från Seattle. Aegis of Champions står på spel.",
  "ti12_bp_tournament_complete_desc": "Återupplev spänningen från årets största e-sportevent – all action i Seattle är bara ett klick bort.",
  "ti12_group_stage_venue": "Online",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Stöd turneringen",
  "ti12_compendium_header": "International 2023-kompendiet",
  "ti12_compendium_desc": "Ta del av ännu mer av turneringssäsongen med kompendiet för The International 2023. Spela som ett proffs i Vägen till TI-utmaningen. Sätt ihop en laguppställning bestående av dina favoritspelare i den omarbetade fantasiligan. Testa förusägelseförmågorna i Oraklets utmaning. Och hoppas på att lagen kommer med något kul påfund i den helt nya bingofunktionen.\\n\\nTjäna belöningar som spelarklistermärken, lagklistermärken, chatthjul, anpassad HUD och mer – kanske till och med en fysisk kopia av Aegis!\\n\\n25 % av alla intäkter från kompendieförsäljningen går direkt till prispotten för The International.",
  "ti12_compendium_standard": "Standardkompendium",
  "ti12_compendium_upgraded": "Uppgraderat kompendium"
}