// 6338.js

{
  "language": "french",
  "international2023_compendium_activity": "Activité du Compendium",
  "international2023_update_title": "Célébration de The International 2023",
  "international2023_update_subtitle": "Des fans de la scène professionnelle aux joueuses et joueurs occasionnels, il y en a pour tous les gouts dans cette mise à jour.",
  "international2023_update_body": "Peu importe si vous suivez ardemment les matchs de The International ou si vous découvrez en lisant ces lignes que des personnes gagnent leur vie en jouant à Dota : cette mise à jour est faite pour vous.\\n\\nSi vous êtes fan de la scène e-sport, découvrez le nouveau <b>défi Fantasy</b> et composez l'équipe de vos rêves. Vous préférez faire de l'analyse ? Prédisez le déroulement du tournoi grâce au <b>défi d'Oracle</b>. Vous êtes plutôt du genre à jouer à des jeux de société en pantoufles avec votre grand-mère ? Bonne nouvelle, on a ajouté un <b>bingo</b> rien que pour vous !\\n\\nEt si rien de tout cela ne vous intéresse, vous pouvez toujours profiter de la nouvelle <b>vitrine de profil</b> pour flatter votre égo. Ces vitrines vous permettent de mettre en avant sur votre profil vos items et vos accomplissements en jeu.",
  "international2023_update_footer": "Vous avez atteint la fin de cette page de mise à jour. Bravo !",
  "international2023_compendium": "Compendium",
  "international2023_compendium_title": "Compendium de The International 2023",
  "international2023_compendium_intro": "Le Compendium vous accompagne pendant toute la durée de la route vers The International 2023 ainsi que de l'évènement principal.\\n\\nJouez comme les pros en participant au défi de la route vers The International. Composez l'équipe dont vous avez toujours rêvé avec la nouvelle version du défi Fantasy. Mettez à l'épreuve vos talents d'oracle en prédisant la phase de groupes et le classement du tournoi. Et enfin, tentez de gagner le jackpot grâce au nouveau bingo.\\n\\nLe Compendium, c'est votre porte d'entrée vers une myriade d'activités, de défis et de récompenses pour le plus grand tournoi de l'année. 25 % de toutes les ventes contribueront à la cagnotte de The International 2023.",
  "international2023_showcase_title": "Vitrine de profil",
  "international2023_showcase_subtitle": "Nouvelle fonctionnalité pour tout le monde",
  "international2023_showcase_intro": "Le profil et le miniprofil ont tous deux été entièrement repensés pour tout le monde (enfin, les 98 % des joueurs et joueuses avec une note de communication au-delà de 6 000). Avec la nouvelle vitrine de profil, libre à vous de faire montre de vos accomplissements en jeu ainsi que de tout ce qui se trouve dans votre inventaire Dota.\\n\\nVous voulez rendre hommage à votre équipe favorite de 2016 ? C'est possible. Faire un étalage de vos ensembles héroïques préférés ? Aucun problème. Mettre en avant toutes les paires de chaussures de Kunkka que vous avez accumulées dans votre inventaire… Attendez, quoi ? Après tout, qui sommes-nous pour vous en empêcher ?",
  "international2023_showcase_profile_title": "Profil mis à jour",
  "international2023_showcase_profile_desc": "Voyez votre nouveau profil comme une toile : la seule limite, c'est votre imagination (et votre décence).",
  "international2023_showcase_mini_profile_title": "Miniprofil mis à jour",
  "international2023_showcase_mini_profile_desc": "Les miniprofils ressemblent beaucoup aux profils, mais ils ont une différence majeure (accrochez-vous bien) : ils sont plus petits ! Les autres personnes verront votre miniprofil quand elles survoleront votre nom.",
  "international2023_showcase_carousel_title": "Exemples de vitrines",
  "international2023_showcase_items_title": "Mettez en avant vos items",
  "international2023_showcase_items_desc": "Personnalisez vos vitrines à l'aide de tous les items et récompenses que vous collectionnez depuis des années.",
  "international2023_showcase_item_heroes_title": "Unités héroïques",
  "international2023_showcase_item_trophies_title": "Trophées",
  "international2023_showcase_item_stickers_title": "Autocollants",
  "international2023_showcase_item_stats_title": "Statistiques",
  "international2023_showcase_item_chat_wheels_title": "Répliques",
  "international2023_showcase_item_sprays_title": "Graffitis",
  "international2023_showcase_item_items_title": "Items dans l'armurerie",
  "international2023_showcase_item_emoticons_title": "Émoticônes",
  "international2023_showcase_item_loading_screens_title": "Écrans de chargement",
  "international2023_showcase_item_couriers_title": "Coursiers",
  "international2023_showcase_item_wards_title": "Wards",
  "international2023_tournament_prize_pool": "Cagnotte",
  "international2023_tournament_prize_pool_percent": "25 % de toutes les ventes du Compendium de The International 2023 contribueront à la cagnotte de The International 2023.",
  "international2023_tournament_learn_more": "Plus d'informations sur le tournoi",
  "international2023_quests_title": "Défi de la route vers The International",
  "international2023_quests_intro": "Vous avez suivi les pros. Vous avez été leur premier soutien. Maintenant, c'est à vous d'endosser leur rôle. Installez-vous confortablement dans le fauteuil de bureau de vos pros de prédilection et recréez leurs plus grands moments de l'année dernière. Gagnez avec la même unité héroïque jouée lors d'un match professionnel en particulier, ou avec l'une des cinq unités les plus jouées au cours d'un mois donné lors de la saison. Chaque défi vous rapporte des points, et vous obtenez des points bonus après avoir terminé les séries de défis.",
  "international2023_quests_match_title": "Défis de matchs",
  "international2023_quests_match_desc": "Gagnez avec des unités héroïques incarnées lors de matchs professionnels.",
  "international2023_quests_pro_title": "Défis de pros",
  "international2023_quests_pro_desc": "Gagnez avec les unités héroïques les plus choisies par les pros.",
  "international2023_quests_rewards_title": "Obtenez des récompenses",
  "international2023_quests_rewards_desc": "Gagnez des points du Compendium afin d'améliorer la barre de progression des récompenses.",
  "international2023_fantasy_title": "Nouveau défi Fantasy",
  "international2023_fantasy_intro": "Composez une équipe avec les pros de votre choix. Sélectionnez les statistiques qui vous paraissent les plus importantes. Rivalisez avec d'autres personnes du monde entier pour obtenir le plus de points. C'est le défi Fantasy que vous connaissez, mais amélioré en tous points.",
  "international2023_fantasy_players_title": "Composez votre équipe",
  "international2023_fantasy_players_desc": "Votre équipe est composée de trois rôles : Core, Mid et Support.",
  "international2023_fantasy_craft_title": "Utilisez les jetons de mutation",
  "international2023_fantasy_craft_desc": "Utilisez les jetons de mutation obtenus dans le Compendium pour tenter d'obtenir les meilleures statistiques pour les membres de votre équipe. Faites preuve de discernement : selon les pros, mieux vaut privilégier certaines statistiques.",
  "international2023_fantasy_compete_title": "Rivalisez avec la communauté",
  "international2023_fantasy_compete_desc": "Chaque weekend du tournoi constitue une phase distincte du défi Fantasy : c'est d'autant plus de chances d'affronter vos contacts et la communauté mondiale. En fonction de votre classement, obtenez des points du Compendium, voire un trophée unique.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Vous aussi, vous avez des frissons quand une équipe achète Divine Rapier ? Ou quand un match va au-delà des 80 minutes et que tout commence à devenir un peu bizarre ? Et quand une équipe d'unités héroïques avec seize jambes en affronte une qui n'en a que quatre ?\\n\\nPréparez-vous à rentabiliser ces émotions : le nouveau bingo vous permet de gagner une myriade de points en fonction du résultat d'évènements totalement saugrenus.",
  "international2023_bingo_cards_title": "UNE GRILLE TOUS LES WEEKENDS",
  "international2023_bingo_cards_desc": "Toutes les personnes en possession du Compendium recevront une nouvelle grille de bingo générée aléatoirement chaque weekend pendant la durée du tournoi. Celle-ci sera composée de cases listant un certain nombre de conditions loufoques ou de situations intéressantes que vous pourrez espérer rencontrer au fil des matchs.",
  "international2023_bingo_rewards_title": "Complétez les rangées et gagnez des points",
  "international2023_bingo_rewards_desc": "Ne vous laissez pas berner, ni par les dieux, les démons ou toute autre créature sylvestre à la gâchette rapide. Ça reste un simple bingo. Une fois que vous aurez terminé une ligne, une colonne ou une diagonale sur votre grille de bingo, vous obtiendrez des points du Compendium. Remarque : crier « BINGO » est facultatif, mais recommandé.",
  "international2023_predictions_title": "Défi d'Oracle",
  "international2023_predictions_intro": "Oracle utilise la magie de l'ombilic astral pour entrevoir le futur… oh et puis zut, la magie ombilicale, ça n'existe pas ! Vous allez devoir vous reposer sur votre ruse, vos connaissances en matière d'e-sport et surtout, votre talent de prévisionniste.\\n\\nPrédisez, comme Oracle mais sans la force ombilicale, quelles équipes progresseront et lesquelles seront éliminées chaque weekend du tournoi. Les bonnes prédictions (par « bonnes », comprenez « prophétiques ») vous rapporteront des points du Compendium.",
  "international2023_predictions_group_stage_title": "Faites vos prédictions sur la phase de groupes",
  "international2023_predictions_group_stage_desc": "C'est la nouveauté de l'année ! Essayez de prédire l'ordre des équipes au sein de chaque groupe.",
  "international2023_predictions_ingame_title": "Prédictions en jeu",
  "international2023_predictions_ingame_desc": "Lorsque vous regardez un match en jeu ou sur Twitch, mettez vos capacités de divination à l'épreuve avant que ne résonne le cor de début de match. Vous gagnerez des points du Compendium pour chaque prédiction correcte, jusqu'à six par jour.",
  "international2023_rewards_title": "Récompenses du Compendium",
  "international2023_rewards_intro": "Vous savez ce qui est encore mieux que de soutenir la scène compétitive Dota ? Se voir offrir des cadeaux parce que vous soutenez la scène compétitive Dota ! Ça tombe à pic : le Compendium de 2023 et ses récompenses sont entièrement consacrés à The International 2023 et à la scène professionnelle de Dota.",
  "international2023_rewards_physical_aegis_title": "Réplique de l'Aegis",
  "international2023_rewards_physical_aegis_desc": "Une réplique en alliage de nickel à l'échelle 1/5 du célèbre prix de The International. Exposez-la fièrement, où vous voulez ! Ou faites-la fondre pour en faire votre propre monnaie…",
  "international2023_rewards_chat_wheels_title": "Roues des dialogues permanentes",
  "international2023_rewards_chat_wheels_desc": "Contrairement aux années précédentes, toutes les roues des dialogues sont désormais permanentes. Comme c'est dit dans le titre. Oui, ce texte semble un peu redondant. Mais c'est agréable de passer un peu plus de temps avec vous.",
  "international2023_rewards_stickers_title": "Autocollants de pro et d'équipe",
  "international2023_rewards_stickers_desc": "« Des autocollants d'équipe ? C'est tout ? » Vous n'avez même pas lu le titre, c'est ça ? Il y a aussi des autocollants de pro. Pour être honnête, ces petits paragraphes ne sont que des prétextes pour vous rappeler de lire le titre.",
  "international2023_rewards_hud_title": "HUD de The International 2023",
  "international2023_rewards_hud_desc": "Le dernier paragraphe a peut-être dissuadé la plupart de gens de lire celui-ci. Vous êtes toujours là ? Pas bête ! C'était un test et vous avez réussi. Voici quelques informations qui ne sont pas incluses dans le titre : le nouveau HUD a été conçu sur mesure et s'inspire des vitraux, clin d'œil à la direction artistique de l'édition de cette année.",
  "international2023_rewards_loading_screens_title": "Écrans de chargement",
  "international2023_rewards_loading_screens_desc": "Vous obtiendrez un écran de chargement stylisé façon vitrail pour chaque équipe, ainsi que certaines des illustrations principales de cette édition de The International.",
  "international2023_rewards_materials_title": "Défis Fantasy et de la route vers TI",
  "international2023_rewards_materials_desc": "Utilisez les mutations pour personnaliser vos cartes lors du défi Fantasy, ou venez à bout du contenu particulièrement exigeant du défi de la route vers TI.",
  "international2023_rewards_teleport_fx_title": "Effets de téléportation de votre équipe préférée",
  "international2023_rewards_teleport_fx_desc": "Affichez votre soutien pour votre équipe préférée en jeu avec les effets de téléportation personnalisés proposés à trois niveaux différents.",
  "international2023_rewards_Types_title": "Types de récompenses",
  "international2023_rewards_Types_desc": "Chaque type de récompense a sa propre barre de progression. Pour récupérer une récompense, remplissez entièrement sa barre de progression.Certaines barres de progression peuvent être remplies autant de fois que vous le souhaitez, tandis que d'autres disposent d'une limite.",
  "international2023_rewards_Levels_title": "Niveaux du Compendium",
  "international2023_rewards_Levels_desc": "Obtenez des niveaux du Compendium en participant aux activités associées ou en achetant des bundles de niveaux. Appliquez des niveaux pour augmenter la barre de progression de TOUS les types de récompenses.",
  "international2023_rewards_Boosters_title": "Boosters",
  "international2023_rewards_Boosters_desc": "Les boosters sont similaires aux niveaux de Compendium, mais peuvent être utilisés pour augmenter le niveau d'une récompense en particulier. Tout booster que vous utilisez vous rapproche également de l'Aegis de collection.",
  "international2023_supporters_clubs_title": "Clubs de fans",
  "international2023_supporters_clubs_subtitle": "Soutenez directement vos équipes préférées",
  "international2023_supporters_clubs_intro": "Les récompenses des clubs de fans sont comme les joies de la jeunesse : profitez-en tant que vous le pouvez, car elles sont éphémères. Ou du moins, c'était comme ça avant. À partir de maintenant, elles sont permanentes ! Vous pouvez ainsi en profiter pour toujours ! Sauf si vous vous faites renverser par un bus.\\n\\n Mieux encore : 50 % des recettes sont directement reversées à l'équipe en question. Enfin, ça, c'est surtout tant mieux pour les équipes… mais les récompenses permanentes, c'est tant mieux pour vous !",
  "international2023_supporters_clubs_tiers_title": "Trois niveaux de soutien",
  "international2023_supporters_clubs_tiers_desc": "Apportez un soutien de niveau bronze, argent ou or à vos équipes préférées pour gagner des récompenses conçues par les équipes elles-mêmes.",
  "international2023_talent_title": "Autocollants de personnalités",
  "international2023_talent_subtitle": "Soutenez directement vos personnalités préférées",
  "international2023_talent_intro": "Commenter des évènements e-sport en direct n'a rien d'un métier facile. Certes, on n'est pas au niveau du travail dans les mines de charbon, mais c'est plus difficile que de vendre ses tricots sur Etsy. Cela dit, il y a tricot et tricot… Certains gilets réalisés au crochet ont l'air particulièrement coton. \\n\\n Vous pouvez maintenant envoyer un message à votre personnalité préférée déclarant « Salut, ton travail m'impressionne. Pas autant que le travail des mineurs de fond, mais plus que 50 % des créations sur Etsy. » D'ailleurs, en parlant de 50 %, la moitié des recettes des autocollants de personnalités seront reversées aux personnalités concernées.",
  "international2023_talent_tiers_title": "Choisissez votre niveau",
  "international2023_talent_tiers_desc": "Achetez les bundles de récompenses de votre personnalité favorite. Le contenu des bundles dépend de leur niveau : ils peuvent comprendre des autocollants, des répliques et des autographes.",
  "international2023_talent_coming_soon": "Les bundles de personnalités seront disponibles à l'achat une fois les personnalités connues.",
  "international2023_coming_soon": "Prochainement",
  "ti12_bp_countdown_header": "Cap sur la phase de groupes",
  "ti12_bp_countdown_desc": "Suivez le plus grand tournoi e-sport de l'année, diffusé en direct de Seattle : l'Aegis of Champions est en jeu !",
  "ti12_bp_tournament_complete_desc": "Revenez sur les moments les plus forts du plus grand tournoi e-sport de l'année, organisé à Seattle, en consultant les archives.",
  "ti12_group_stage_venue": "En ligne",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Soutenez le tournoi",
  "ti12_compendium_header": "Compendium de The International 2023",
  "ti12_compendium_desc": "Débloquez encore plus de contenus de la saison du tournoi avec le Compendium de The International 2023. Jouez comme les pros avec le défi de la route vers TI. Composez votre équipe dans le tournoi Fantasy revu de fond en comble. Mettez vos prédictions à l'épreuve lors du défi d'Oracle et guettez le moindre évènement inattendu avec la toute nouvelle fonctionnalité Bingo.\\n\\nRemportez des récompenses, comme des autocollants de pro ou d'équipe, des roues des dialogues, un HUD personnalisé et plus encore, jusqu'à une réplique de l'Aegis.\\n\\n25 % des ventes du Compendium sont directement reversées dans la cagnotte de The International.",
  "ti12_compendium_standard": "Compendium standard",
  "ti12_compendium_upgraded": "Compendium amélioré"
}