// 9689.js

{
  "language": "norwegian",
  "international2023_compendium_activity": "Aktivitet for eiere av kompendiet",
  "international2023_update_title": "Feiring av The International 2023",
  "international2023_update_subtitle": "Denne oppdateringen har noe for alle – uansett om du følger e-sporten tett eller har et avslappet forhold til det hele.",
  "international2023_update_body": "Om du følger hvert neglebitende sekund av hver kamp under The International, eller du kanskje ikke er kjent med at folk spiller det her som en heltidsjobb og bare ønsker å slappe av med spillet, les videre: Denne oppdateringen har noe for enhver smak.\\n\\nEr du en e-sportfanatiker? Sett opp en lagoppstilling av proffer med den oppgraderte <b>Fantasiligaen.</b> Er du mer analytisk anlagt? Hopp inn i forutsigelser om sluttspillet i <b>Orakelets utfordring</b>. Kanskje du er en stor tilhenger av spill som grandtanten din brukte å spille. Da skulle vel <b>bingo</b> være midt i blinken for deg!\\n\\nEller kanskje du ikke synes noe om alt dette. Kanskje du bare er en kjempefan av deg selv. Vi har noe for deg også: <b>Profilutstillingen</b>. Profilen er nå et interaktivt monument til deg selv, med alle gjenstandene og prestasjonene i spillhistorikken din som du vil stappe inn.",
  "international2023_update_footer": "Du har nådd slutten av oppdateringen. Bra jobba!",
  "international2023_compendium": "Kompendium",
  "international2023_compendium_title": "The International 2023-kompendiet",
  "international2023_compendium_intro": "Kompendiet er den interaktive digitale følgesvennen til Veien til The International 2023 og selve The International 2023.\\n\\nSpill som en proff med Veien til The International-utfordringen. Velg favorittspillerne til et fornyet og oppdatert fantasispill. Sett spådomsevnene på prøve med forutsigelser for gruppe- og sluttspillet. Få full uttelling med helt nye bingobrett!\\n\\nI kompendiet finner du alt på ett sted – aktiviteter og utfordringer knyttet til begivenheten, og alle belønningene for årets begivenhet. Dessuten bidrar 25 % av alle salg til premiepotten til  The International 2023.",
  "international2023_showcase_title": "Profilutstillingen",
  "international2023_showcase_subtitle": "Ny funksjon for alle Dota-spillere",
  "international2023_showcase_intro": "Profilen og miniprofilen er blitt fullstendig redesignet for alle (i alle fall de 98 prosentene av dere som har over 6000 kommunikasjonspoeng). Nå kan du vise frem alle Dota-gjenstandene og bragdene dine – bokstavelig talt alt i Dota-lageret ditt – med den nye profilutstillingen.\\n\\nVil du å bygge en hyllest til favorittlaget fra 2016? Det kan du gjøre. Eller hva med en samling over heltesettene du liker best? Det kan du absolutt gjøre. Et av alle de mulige skoparene til Kunkka? Ja, dessverre. Teknisk sett kan du gjøre det også.",
  "international2023_showcase_profile_title": "Oppdatert profil",
  "international2023_showcase_profile_desc": "Du er Michelangelo – profilen er nå lerretet, og du begrenses bare av fantasien. (Og grunnleggende menneskelig anstendighet.)",
  "international2023_showcase_mini_profile_title": "Oppdatert miniprofil",
  "international2023_showcase_mini_profile_desc": "Miniprofiler ligner veldig på profiler, men med en viktig forskjell – heng med oss her – de er mindre. Andre spillere kan se miniprofilen når de holder over navnet ditt.",
  "international2023_showcase_carousel_title": "Ustillingseksempler",
  "international2023_showcase_items_title": "Still ut gjenstander",
  "international2023_showcase_items_desc": "Tilpass utstillingen med et stort utvalg av alle gjenstandene og belønningene du har samlet opp gjennom årene.",
  "international2023_showcase_item_heroes_title": "Helter",
  "international2023_showcase_item_trophies_title": "Trofeer",
  "international2023_showcase_item_stickers_title": "Klistremerker",
  "international2023_showcase_item_stats_title": "Statistikk",
  "international2023_showcase_item_chat_wheels_title": "Samtalehjul",
  "international2023_showcase_item_sprays_title": "Graffitier",
  "international2023_showcase_item_items_title": "Gjenstander fra arsenalet",
  "international2023_showcase_item_emoticons_title": "Uttrykksikoner",
  "international2023_showcase_item_loading_screens_title": "Lasteskjermer",
  "international2023_showcase_item_couriers_title": "Kurerer",
  "international2023_showcase_item_wards_title": "Varder",
  "international2023_tournament_prize_pool": "Premiepott",
  "international2023_tournament_prize_pool_percent": "25 % av alle salg av The International 2023-kompendiet bidrar til premiepotten til The International 2023.",
  "international2023_tournament_learn_more": "Les mer om turneringen",
  "international2023_quests_title": "Veien til The International-utfordringen",
  "international2023_quests_intro": "Du har sett på proffene. Du har heiet dem frem. Nå kan du spille som en. Sett deg i spillstolen til proffspillerne og gjenskap deres største øyeblikk fra året som gikk. Vinn som heltene deres fra en bestemt kamp, eller som en av de fem heltene de brukte under en gitt måned i sesongen. Tjen poeng for hver utfordring, og ekstrapoeng for å fullføre et sett med utfordringer.",
  "international2023_quests_match_title": "Kamputfordringer",
  "international2023_quests_match_desc": "Vinn ved hjelp av helter fra en faktisk proffkamp.",
  "international2023_quests_pro_title": "Spillerutfordringer",
  "international2023_quests_pro_desc": "Vinn som en av de mest spilte heltene til en proffspiller.",
  "international2023_quests_rewards_title": "Motta belønninger",
  "international2023_quests_rewards_desc": "Forsyn belønningene med kompendiumpoeng opptjent langs veien.",
  "international2023_fantasy_title": "Videreutviklet fantasi",
  "international2023_fantasy_intro": "Velg et lag med proffer. Utform statistikkene du tror kommer til å ha mest nytteverdi. Konkurrer mot spillere fra hele verden om å tjene flest poeng. Det er fantasiligaen du husker, men gjenskapt på alle mulige måter.",
  "international2023_fantasy_players_title": "Velg",
  "international2023_fantasy_players_desc": "Velg en kjerne-, midt- og støttespiller.",
  "international2023_fantasy_craft_title": "Utform",
  "international2023_fantasy_craft_desc": "Bruk bytter opptjent sammen med kompendiets belønninger for å prøve å utforme de beste statistikkene for spillerne dine. Velg med omhu – noen statistikker er bedre på enkelte spillere enn andre.",
  "international2023_fantasy_compete_title": "Konkurrer",
  "international2023_fantasy_compete_desc": "Hver helg under turneringen er en egen fantasirunde, så du har flere sjanser til å konkurrere mot venner og verden. Tjen kompendiumpoeng, og få et unikt trofé – hvis du kommer høyt nok på ledertavlen.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Blir du ekstra spent hver gang et profflag kjøper en Divine Rapier? Eller når en kamp varer i over 80 minutter og alt begynner å føles litt merkelig? Hva med når et lag bestående av helter med 16 bein slåss mot et lag med bare fire?\\n\\nDa kan du endelig gjøre deg klar til å innkassere på den spenningen. Bingoen er nemlig her for å la deg utnytte noen virkelig vanvittige hendelser.",
  "international2023_bingo_cards_title": "Ett bingobrett hver helg",
  "international2023_bingo_cards_desc": "Alle eiere av kompendiet får et nytt og tilfeldig generert bingobrett hver helg under turneringen. Dette brettet er proppfullt av ruter med merkelige vilkår og interessante situasjoner du kan heie fram mens proffene kappes.",
  "international2023_bingo_rewards_title": "Fyll rader, tjen poeng",
  "international2023_bingo_rewards_desc": "Det stemmer – ikka la gudene, demoner og skyteglade skogsskapninger lure deg, det er fortsatt bare bingo, folkens. Når du fyller en hel rad, kolonne eller diagonal på bingobrettet, får du kompendiumpoeng som belønning. Merk: Å rope «BINGO» er valgfritt, men oppfordret.",
  "international2023_predictions_title": "Orakelets utfordring",
  "international2023_predictions_intro": "Orakelet bruker overjordisk navlemagi til å se fremtiden. Vi hater å måtte røpe det for deg, men overjordisk navlemagi finnes ikke på ekte. Du blir nødt til å bruke kløkt, kunnskap om e-sport og aller viktigst – dine beste gjetninger for å få jobben unnagjort.\\n\\nForutse, på orakelvis, men navleløst, hvilke lag som går videre og hvilke som faller fra under hver av turneringshelgene. Riktige gjetninger (vi mener orakelaktige spådommer) gir deg kompendiumpoeng.",
  "international2023_predictions_group_stage_title": "Forutsi gruppespillet",
  "international2023_predictions_group_stage_desc": "I år kan du gjøre et forsøk på å forutsi rekkefølgen på lag i hver gruppe.",
  "international2023_predictions_ingame_title": "Forutsigelser i spillet",
  "international2023_predictions_ingame_desc": "Mens du ser på i spillet eller på Twitch, kan du teste hvor god du er til å forutsi før hornet gjaller i hver kamp. Du mottar kompendiumpoeng for hver riktig forutsigelse, opptil seks hver dag.",
  "international2023_rewards_title": "Kompendiumbelønninger",
  "international2023_rewards_intro": "Hvis du er en tilhenger av konkurransespilling i Dota og å motta belønninger for å være en tilhenger av konkurransespilling i Dota, er årets belønninger noe for deg. Kompendiet 2023 har fullstendig fokus på The International 2023 og proffmiljøet i Dota.",
  "international2023_rewards_physical_aegis_title": "Fysisk Aegis-modell",
  "international2023_rewards_physical_aegis_desc": "En kopi i nikkellegering av den berømte mesterpremien i skalaen 1:5. Vis den med stolthet! Vis den helt uforpliktet! Smelt den om, og lag din egen valuta!",
  "international2023_rewards_chat_wheels_title": "Permanente samtalehjul",
  "international2023_rewards_chat_wheels_desc": "Til forskjell fra tidligere år er samtalehjulene nå permanente. Akkurat som nevnt i overskriften. Ja, denne teksten føles litt overflødig, men det er hyggelig å få tilbrakt mer tid sammen med deg.",
  "international2023_rewards_stickers_title": "Klistremerker for spillere og lag",
  "international2023_rewards_stickers_desc": "«Bare lagklistremerker?» Leste du ikke engang overskriften? Du får spillerklistremerker også. Ærlig talt, disse avsnittene er bare isoporkuler ment for å beskytte overskriften under transport til øynene dine.",
  "international2023_rewards_hud_title": "The International 2023 – Grensesnitt",
  "international2023_rewards_hud_desc": "Forrige avsnitt kan ha skremt folk bort fra å lese dette. Så hvis du fremdeles er her: lurt. Det var en test, og du bestod. For her har du litt informasjon som ikke finnes i overskriften: Det nye grensesnittet er designet som et glassmaleri, som er årets tema.",
  "international2023_rewards_loading_screens_title": "Lasteskjermer",
  "international2023_rewards_loading_screens_desc": "Du får en tilpasset lasteskjerm med glassmaleritema for hvert lag, samt noen av hovedbildene fra årets TI.",
  "international2023_rewards_materials_title": "Verktøy til fantasispillet og Veien til TI-utfordringen",
  "international2023_rewards_materials_desc": "Bruk tilpassede verktøy for å utforme bedre spillere i fantasispillet, eller jobb deg gjennom spesielt vanskelig innhold i Veien til TI-utfordringen.",
  "international2023_rewards_teleport_fx_title": "Favorittlagets teleporteffekter",
  "international2023_rewards_teleport_fx_desc": "Vis frem favorittlaget i spillet med tilpassede teleporteffekter på tre forskjellige nivå.",
  "international2023_rewards_Types_title": "Belønningstyper",
  "international2023_rewards_Types_desc": "Hver belønningstype har sin egen fremdriftsmåler. Når måleren fylles, kan du gjøre krav på belønningen. Noen målere kan fylles igjen så mange ganger du vil, mens andre kun kan fylles et visst antall ganger.",
  "international2023_rewards_Levels_title": "Kompendiumnivå",
  "international2023_rewards_Levels_desc": "Tjen kompendiumnivå ved å delta i aktiviteter i kompendiet, eller ved å kjøpe nivåpakker. Ta i bruk nivåene for å øke fremdriftsmålerne for ALLE belønningstyper.",
  "international2023_rewards_Boosters_title": "Boostere",
  "international2023_rewards_Boosters_desc": "Boostere er som kompendiumnivå, men for å øke en bestemt belønning. Når du bruker en booster på en belønning, økes også fremgangen mot Aegis-samleobjektet.",
  "international2023_supporters_clubs_title": "Supporterklubber",
  "international2023_supporters_clubs_subtitle": "Støtt favorittlagene direkte",
  "international2023_supporters_clubs_intro": "Belønninger fra supporterklubbene er som ungdommens gleder – de er flyktige, så nyt dem så lenge de varer. Eller, de pleide å være det. Fra og med i år varer de evig! Nå kan du nyte dem for alltid! Så lenge du ikke blir overkjørt av en buss.\\n\\n Enda bedre: 50 % av alle salgene går direkte til laget. Enda bedre for dem, ja. Belønningene er bedre for deg.",
  "international2023_supporters_clubs_tiers_title": "Tre nivå med støtte",
  "international2023_supporters_clubs_tiers_desc": "Velg bronse, sølv eller gull som støtte for favorittlagene og motta belønninger designet av lagene selv.",
  "international2023_talent_title": "Ekspertklistremerker",
  "international2023_talent_subtitle": "Støtt favorittekspertene direkte",
  "international2023_talent_intro": "Direktesending av e-sport er en vanskelig jobb. Ikke gruvearbeid, selvsagt, men vanskeligere enn å strikke ting på Etsy. Det vil si, kanskje ikke all strikking. Noen av de heklede genserne ser veldig kompliserte ut.\\n\\n Nå kan du si til favoritteksperten at «Hei, jeg har respekt for det du gjør. Ikke like mye som for en gruvearbeider, men mer enn minst 50 % av skapere på Etsy.» Apropos 50 %, halvparten av all salgsinntekt fra ekspertklistremerker går direkte til eksperten.",
  "international2023_talent_tiers_title": "Velg nivå",
  "international2023_talent_tiers_desc": "Kjøp belønningspakker med favoritteksperten i hovedrollen. Pakker innholder en kombinasjon av klistremerker, replikker og autografer avhengig av nivået på pakken som er kjøpt.",
  "international2023_talent_coming_soon": "Ekspertpakker kan kjøpes etter at ekspertene er blitt kunngjort.",
  "international2023_coming_soon": "Kommer snart",
  "ti12_bp_countdown_header": "Til gruppespillet",
  "ti12_bp_countdown_desc": "Følg med på årets største e-sportturnering – direktesendt fra Seattle – der Aegis of Champions står på spill.",
  "ti12_bp_tournament_complete_desc": "Gjenopplev spenningen fra årets største e-sportturnering – alt fra Seattle er bare et klikk unna.",
  "ti12_group_stage_venue": "På nett",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Støtt turneringen",
  "ti12_compendium_header": "The International 2023-kompendiet",
  "ti12_compendium_desc": "Lås opp enda mer fra turneringssesongen med kompendiet for The International 2023. Spill som en proff med Veien til TI-utfordringen. Sett opp en lagoppstilling bestående av favorittspillerne i det omdesignede fantasispillet. Sett forutsigelsesevnene dine på prøve med Orakelets utfordring. Og sats på at lagene kommer med noen rare påfunn med den helt nye bingofunksjonen.\\n\\nTjen belønninger som spillerklistremerker, lagklistremerker, samtalehjul, tilpasset grensesnitt og mer, helt opp til en fysisk kopi av Aegis.\\n\\n25 % av alle kompendiumsalg går direkte til premiepotten til The International.",
  "ti12_compendium_standard": "Standard kompendium",
  "ti12_compendium_upgraded": "Oppgradert kompendium"
}