// 6753.js

{
  "language": "ukrainian",
  "international2023_compendium_activity": "Заняття для власників компендіуму",
  "international2023_update_title": "Святкування The International 2023",
  "international2023_update_subtitle": "Це кіберспортивне оновлення має щось для кожного — від фанатів професійної сцени до звичайних гравців.",
  "international2023_update_body": "Незалежно від того, чи ви схвильовано стежите за кожною секундою всіх матчів на The International, чи взагалі не чули, що хтось заробляє цією грою собі на життя, і просто хочете спокійно порозважатися: це оновлення має дещо для вас.\\n\\nВи — шанувальник кіберспорту? Створюйте власну команду професійних гравців у покращеній <b>фентезі-лізі</b>. Любите аналітику? Занурюйтеся у <b>випробування Оракула</b> й робіть прогнози на сітку. Можливо ви в захваті від ігор, у які грає сестра вашої бабусі? Що ж, цього року ми маємо ще й <b>бінґо</b>!\\n\\nА якщо вам не подобається це все? Якщо вам подобаєтеся лише ви самі? Є щось і для вас: <b>вітрина профілю</b>. Ваш профіль тепер стане пам’ятником вам і ви, якщо захочете, зможете показати там будь-які предмети і здобутки за всю вашу ігрову історію.",
  "international2023_update_footer": "Ви дочитали до кінця цієї сторінки! Чудова робота!",
  "international2023_compendium": "Компендіум",
  "international2023_compendium_title": "Компендіум The International 2023",
  "international2023_compendium_intro": "Компендіум — це ваш інтерактивний цифровий компаньйон для Шляху до The International 2023 та власне The International 2023.\\n\\nГрайте мов професіонал у випробуваннях Шляху до The International. Збирайте команду з улюблених гравців у переробленій і оновленій фентезі-грі. Перевіряйте свою інтуїцію в передбаченнях на груповий етап і сітку. Виграйте джекпот на нових дошках бінґо.\\n\\nСприймайте компендіум як місце для всіх занять, випробувань і нагород, пов’язаних із цьогорічною подією. Окрім цього, 25% від усіх продажів поповнюватимуть призовий фонд The International 2023.",
  "international2023_showcase_title": "Вітрина профілю",
  "international2023_showcase_subtitle": "Нова функція для всіх гравців у Dota",
  "international2023_showcase_intro": "Профіль і мініпрофіль були цілковито перероблені для всіх (точніше для 98% із вас, у кого оцінка спілкування вища за 6000). Тепер ви можете показати всі свої предмети та здобутки в Dota у вітрині профілю — буквально будь-що з вашого інвентарю.\\n\\nХочете зробити святилище, присвячене вашій улюбленій професійній команді з 2016 року? Ви можете це зробити. А як щодо колекції ваших улюблених наборів для героїв? І це можливо. Всі до єдиного черевики для Кунки? На жаль, так. Технічно ви можете зробити й це.",
  "international2023_showcase_profile_title": "Оновлений профіль",
  "international2023_showcase_profile_desc": "Ви — Мікеланджело, а профіль — це ваше полотно. І обмежені ви лише вашою уявою (та базовою пристойністю).",
  "international2023_showcase_mini_profile_title": "Оновлений мініпрофіль",
  "international2023_showcase_mini_profile_desc": "Мініпрофілі загалом схожі на профілі, але мають одну суттєву відмінність (увага!) — вони менші. Інші гравці бачать ваш мініпрофіль під час наведення вказівника миші на ваше ім’я.",
  "international2023_showcase_carousel_title": "Зразки вітрин",
  "international2023_showcase_items_title": "Вітрина предметів",
  "international2023_showcase_items_desc": "Персоналізуйте свої вітрини за допомогою великого асортименту предметів і нагород, які ви збирали впродовж років.",
  "international2023_showcase_item_heroes_title": "Герої",
  "international2023_showcase_item_trophies_title": "Трофеї",
  "international2023_showcase_item_stickers_title": "Наліпки",
  "international2023_showcase_item_stats_title": "Статистика",
  "international2023_showcase_item_chat_wheels_title": "Колеса чату",
  "international2023_showcase_item_sprays_title": "Графіті",
  "international2023_showcase_item_items_title": "Предмети зброярні",
  "international2023_showcase_item_emoticons_title": "Смайлики",
  "international2023_showcase_item_loading_screens_title": "Заставки",
  "international2023_showcase_item_couriers_title": "Кур’єри",
  "international2023_showcase_item_wards_title": "Варди",
  "international2023_tournament_prize_pool": "Призовий фонд",
  "international2023_tournament_prize_pool_percent": "25% від усіх продажів компендіуму поповнюватимуть призовий фонд The International 2023.",
  "international2023_tournament_learn_more": "Докладніше про турнір",
  "international2023_quests_title": "Випробування Шляху до The International",
  "international2023_quests_intro": "Ви спостерігали за професійними гравцями. Ви їх підбадьорювали. А тепер зіграйте за одного з них. Сідайте в ігрове крісло свого улюбленого кіберспортсмена й відтворіть його найкращі моменти з минулого року. Виграйте за його героя в певному матчі, або за одного з п’яти героїв, за яких він грав упродовж певного місяця сезону. Заробляйте очки за кожне випробування й додаткові очки за виконання повних наборів випробувань.",
  "international2023_quests_match_title": "Випробування матчів",
  "international2023_quests_match_desc": "Виграйте за героя з реального професійного матчу.",
  "international2023_quests_pro_title": "Випробування гравців",
  "international2023_quests_pro_desc": "Виграйте за одного з героїв, яких професійний гравець найчастіше обирав.",
  "international2023_quests_rewards_title": "Заробляйте нагороди",
  "international2023_quests_rewards_desc": "Посилюйте нагороди з допомогою зароблених очок компендіуму.",
  "international2023_fantasy_title": "Удосконалена фентезі-ліга",
  "international2023_fantasy_intro": "Зберіть команду своїх улюблених професійних гравців. Підберіть характеристики, які, на вашу думку, будуть найкориснішими. Змагайтеся з гравцями з усього світу, щоби заробити якнайбільше очок. Це та ж фентезі-ліга Dota, яку ви пам’ятаєте, але вдосконалена з усіх боків.",
  "international2023_fantasy_players_title": "Обирайте",
  "international2023_fantasy_players_desc": "Оберіть своїх улюблених гравців основи, центру й підтримки.",
  "international2023_fantasy_craft_title": "Персоналізуйте",
  "international2023_fantasy_craft_desc": "Використовуйте заміни, отримані серед нагород компендіуму, щоби спробувати підібрати якнайкращі характеристики для своїх гравців. Обирайте уважно — деякі характеристики підходять одним гравцям краще, ніж іншим.",
  "international2023_fantasy_compete_title": "Змагайтеся",
  "international2023_fantasy_compete_desc": "Кожні вихідні впродовж турніру — це окремий раунд фентезі-ліги, тож ви матимете кілька шансів позмагатися зі своїми друзями й зі світом. Заробляйте очки компендіуму і, якщо ваше місце в таблиці лідерів буде достатньо високим, унікальний трофей.",
  "international2023_bingo_title": "Бінґо",
  "international2023_bingo_intro": "Відчуваєте захват щоразу, коли професійна команда купує Божественну рапіру? Чи коли матч триває понад 80 хвилин і все стає дещо дивним? А якщо команда з 16 ногами бореться проти команди лише з чотирма?\\n\\nЩо ж, настав час нажитися на цьому. Бінґо дозволить вам отримати вигоду з деяких зовсім божевільних подій.",
  "international2023_bingo_cards_title": "ОДНА КАРТКА БІНҐО НА ВИХІДНІ",
  "international2023_bingo_cards_desc": "Усі власники компендіуму отримуватимуть одну випадково згенеровану картку бінґо на кожні вихідні впродовж турніру. Ця картка заповнена квадратами з дивними умовами й цікавими ситуаціями, за якими ви можете стежити, поки професійні гравці змагаються.",
  "international2023_bingo_rewards_title": "Завершуйте ряди, отримуйте очки",
  "international2023_bingo_rewards_desc": "Саме так — не дозволяйте богам, демонам і нахабним лісовим створінням обдурити вас, це все ще бінґо. Заповнивши повний рядок, стовпчик або діагональ на своїй картці бінґо, ви отримаєте нагороду очками компендіуму. Примітка: вигукувати «БІНҐО» не обов’язково, але бажано.",
  "international2023_predictions_title": "Випробування Оракула",
  "international2023_predictions_intro": "Оракул може бачити майбутнє за допомогою астральної магії… Не хочеться вас розчаровувати, але насправді астральної магії не існує. Тож якщо хочете досягти успіху в змаганнях із прогнозами, вам доведеться покладатися на свій гострий розум, знання кіберспорту та, перш за все, на свою інтуїцію.\\n\\nЗокрема, ви можете робити прогнози на те, які команди переможуть і які команди поїдуть додому, під час кожних вихідних турніру. Правильні припущення (тобто оракульні прозріння) дадуть вам очки компендіуму.",
  "international2023_predictions_group_stage_title": "Прогнози на груповий етап",
  "international2023_predictions_group_stage_desc": "Цього року ви вперше можете спробувати передбачити порядок команд у кожній групі.",
  "international2023_predictions_ingame_title": "Внутрішньоігрові прогнози",
  "international2023_predictions_ingame_desc": "Під час перегляду в ігровому клієнті чи на Twitch перевіряйте свою силу передбачення до початку звуку сурми в кожному матчі. За кожен правильний прогноз (до шести на день) ви зароблятимете очки компендіуму.",
  "international2023_rewards_title": "Нагороди компендіуму",
  "international2023_rewards_intro": "Якщо ви шанувальник змагальної Dota й полюбляєте отримувати нагороди за це, то цьогорічні нагороди саме для вас. Компендіум 2023 року цілковито зосереджений на The International 2023 і професійній сцені Dota.",
  "international2023_rewards_physical_aegis_title": "Фізична копія Еґіди",
  "international2023_rewards_physical_aegis_desc": "Зменшена вп’ятеро нікелева репродукція легендарного чемпіонського трофея. Показуйте її з гордістю! Показуйте її без зобов’язань! Розплавте її і зробіть із неї власну валюту!",
  "international2023_rewards_chat_wheels_title": "Постійні колеса чату",
  "international2023_rewards_chat_wheels_desc": "На відміну від попередніх років, тепер усі фрази колеса чату постійні. Як і пишеться в заголовку. Так, цей текст видається трохи зайвим. Але приємно провести з вами додатковий час.",
  "international2023_rewards_stickers_title": "Наліпки гравців і команд",
  "international2023_rewards_stickers_desc": "«Тільки командні наліпки»? Навіть не читали назву, еге ж? Тепер ви отримаєте ще й наліпки для гравців. Чесно кажучи, ці абзаци — це просто безпечне пакування, яке має вберегти заголовок під час його транспортування до ваших очей.",
  "international2023_rewards_hud_title": "Інтерфейс The International 2023",
  "international2023_rewards_hud_desc": "Попередній абзац міг відлякати від читання цього. Та якщо ви продовжили, то вчинили розумно. Це був іспит, і ви його пройшли. Бо ось інформація, яку не включено в заголовок: новий стиль інтерфейсу спеціально розроблено з використанням цьогорічної теми вітражів.",
  "international2023_rewards_loading_screens_title": "Заставки",
  "international2023_rewards_loading_screens_desc": "Ви отримаєте нестандартну вітражну заставку для кожної команди, а також деякі ключові зображення цьогорічного TI.",
  "international2023_rewards_materials_title": "Підсилення для фентезі-ліги й Шляху до TI",
  "international2023_rewards_materials_desc": "Використовуйте спеціальні інструменти для створення кращих гравців у фентезі-змаганні, або ж для складних випробувань Шляху до The International.",
  "international2023_rewards_teleport_fx_title": "Ефекти телепортації улюбленої команди",
  "international2023_rewards_teleport_fx_desc": "Покажіть свою улюблену команду в грі за допомогою нестандартних ефектів телепортації, що мають три різні рівні.",
  "international2023_rewards_Types_title": "Типи нагород",
  "international2023_rewards_Types_desc": "Кожен тип нагороди має власний лічильник поступу. Коли лічильник заповнюється, ви можете забрати нагороду. Деякі лічильники можуть заповнюватися скільки завгодно разів, а деякі мають обмеження на кількість.",
  "international2023_rewards_Levels_title": "Рівні компендіуму",
  "international2023_rewards_Levels_desc": "Заробляйте рівні компендіуму участю в заняттях компендіуму або купуючи набори рівнів. Застосовуйте рівні для збільшення лічильників поступу ВСІХ типів нагород.",
  "international2023_rewards_Boosters_title": "Посилювачі",
  "international2023_rewards_Boosters_desc": "Посилювачі — це ніби рівні компендіуму, але для збільшення лічильника однієї нагороди. Застосування посилювача до нагороди також збільшує поступ до колекційної Еґіди.",
  "international2023_supporters_clubs_title": "Клуби підтримки",
  "international2023_supporters_clubs_subtitle": "Безпосередньо підтримайте свою улюблену команду",
  "international2023_supporters_clubs_intro": "Нагороди клубів підтримки — мов радощі юності. Насолоджуйтеся ними, поки можете, бо вони швидкоплинні. Були. Відтепер вони постійні! Тож можете насолоджуватися ними вічно! Якщо тільки вас не зіб’є автобус.\\n\\nІ навіть краще: 50% від усіх продажів іде безпосередньо команді. Ну, для команди краще. А постійність — краще для вас.",
  "international2023_supporters_clubs_tiers_title": "Три ступені підтримки",
  "international2023_supporters_clubs_tiers_desc": "Обирайте бронзовий, срібний чи золотий ступінь підтримки улюблених команд, щоб отримати нагороди, створені самими командами.",
  "international2023_talent_title": "Наліпки талантів",
  "international2023_talent_subtitle": "Безпосередньо підтримайте свого улюбленого таланта",
  "international2023_talent_intro": "Кіберспортивні трансляції — це важка робота. Звісно, це не видобуток вугілля. Та це важче, ніж продавати старий мотлох в Інтернеті. Безперечно, мова не про будь-який мотлох — деякий антикваріат простіше пожертвувати музею, ніж намагатися продати людям, що не знаються на старожитностях.\\n\\nТепер ви можете надіслати таке повідомлення своєму улюбленому таланту: «Агов… Поважаю вас за те, що робите. Не так сильно, як шахтаря, але більше ніж 50% продавців старого мотлоху в Інтернеті». І раз мова зайшла про 50%, то саме половина всіх прибутків із продажу наліпок талантів ітиме безпосередньо талантам.",
  "international2023_talent_tiers_title": "Оберіть свій ступінь",
  "international2023_talent_tiers_desc": "Купуйте комплекти нагород зі своїм улюбленим талантом. Комплекти містять набір наліпок, голосових фраз і автографів, залежно від ступеня придбаного комплекту.",
  "international2023_talent_coming_soon": "Комплекти талантів будуть доступні для придбання після оголошення списку талантів.",
  "international2023_coming_soon": "Незабаром",
  "ti12_bp_countdown_header": "До групового етапу",
  "ti12_bp_countdown_desc": "Приєднуйтеся до найбільшого кіберспортивного турніру року в трансляції наживо з Сієтла, де відбуватиметься змагання за Еґіду чемпіонів.",
  "ti12_bp_tournament_complete_desc": "Переживіть захоплення від найбільшого кіберспортивного турніру року — усі події із Сієтла на відстані одного натискання.",
  "ti12_group_stage_venue": "У мережі",
  "ti12_playoffs_venue": "Конференц-центр Сієтла",
  "ti12_main_event_venue": "Арена «Клаймат Пледж»",
  "ti12_compendium_small_header": "Підтримайте турнір",
  "ti12_compendium_header": "Компендіум The International 2023",
  "ti12_compendium_desc": "Компендіум The International 2023 року розблоковує ще більше турнірного сезону. Грайте мов професіонал у випробуваннях Шляху до The International. Відбирайте улюблених гравців у переробленій фентезі-грі. Перевіряйте свою інтуїцію в передбаченнях випробування Оракула. І сподівайтеся на дивацтва команд у цілковито новій мінігрі бінґо.\\n\\nЗаробляйте нагороди, як-от наліпки гравців, наліпки команд, фрази колеса чату, нестандартний стиль інтерфейсу та інші, аж до фізичної копії Еґіди чемпіонів.\\n\\n25% від усіх продажів компендіуму безпосередньо поповнюватимуть призовий фонд The International 2023.",
  "ti12_compendium_standard": "Стандартний компендіум",
  "ti12_compendium_upgraded": "Покращений компендіум"
}