// 1954.js

{
  "language": "bulgarian",
  "ringmastercomic_title_cover": "Куклата — корица",
  "ringmastercomic_title": "Куклата — страница %1$s",
  "ringmastercomic_help_text": "Кликнете на изображението или използвайте интервала, за да продължите нататък",
  "ringmastercomic_return_button": "Връщане към корицата",
  "ti13_online": "Копенхаген",
  "ti13_main_event_venue": "„Роял арена“ — Копенхаген",
  "ti13_best_of_three": "Най-добри от три;",
  "ti13_best_of_five": "Най-добри от пет;",
  "ti13_group_stage_sp_rules": "Групов етап | Правила относно приоритет за избор",
  "ti13_group_stage_sp_game1": "Хвърляне на монета;",
  "ti13_group_stage_sp_game2": "Първа игра — победителите от хвърлянето на монетата избират подбор или страна;",
  "ti13_group_stage_sp_game3": "Втора игра — загубилите от хвърлянето на монетата избират подбор или страна;",
  "ti13_group_stage_sp_game4": "Трета игра (ако е приложимо) — ново хвърляне на монета. Победителите от новото хвърляне на монетата избират подбор или страна.",
  "ti13_group_stage_tie_rules": "Групов етап | Правила за тайбрек",
  "ti13_first_second_tie": "Два отбора са наравно за I и II място;",
  "ti13_second_third_tie": "Два отбора са наравно за II и III място;",
  "ti13_third_fourth_tie": "Два отбора са наравно за III и IV място;",
  "ti13_three_way_first_tie": "Три отбора са наравно за I място;",
  "ti13_three_way_second_tie": "Три отбора са наравно за II място;",
  "ti13_four_way_tie": "Четири отбора са наравно за I място;",
  "ti13_tie_resolve_bo3": "Разрешаване с най-добри от три.",
  "ti13_tie_resolve_third_fourth": "Не се провеждат по-нататъшни игри. Двата отбора остават наравно за III и IV място.",
  "ti13_tie_resolve_first_with_round_robin": "Разрешаване на I място, като се изиграе рунд всеки срещу всеки до най-добри от една, докато един отбор спечели два пъти;",
  "ti13_tie_resolve_second_and_third_place_bo1": "Продължава да се играе, докато всички отбори не се изправят едни срещу други поне веднъж. Използват се най-скорошните резултати от рунда всеки срещу всеки, за да се разреши II и III място.",
  "ti13_tie_resolve_second_with_round_robin": "Разрешаване на II място, като се изиграе рунд всеки срещу всеки до най-добри от една, докато един отбор спечели два пъти;",
  "ti13_tie_resolve_third_fourth_other": "Не се провеждат по-нататъшни игри. Другите два отбора остават наравно за III и IV място.",
  "ti13_tie_resolve_four_way_1": "Произволно сдвояване на отбори. За целите на тези правила, нека да наречем тези отбори „Отбор А“, „Отбор Б“, „Отбор В“ и „Отбор Г“;",
  "ti13_tie_resolve_four_way_2": "„Отбор А“ играе срещу „Отбор Б“ до най-добри от една. „Отбор В“ играе срещу „Отбор Г“ до най-добри от една;",
  "ti13_tie_resolve_four_way_3": "Разрешаване на I място, като се играе до най-добри от една между победителите от „А“ с/у „Б“ и „В“ с/у „Г“;",
  "ti13_tie_resolve_four_way_4": "Разрешаване на IV място, като се играе до най-добри от една между загубилите от „А“ с/у „Б“ и „В“ с/у „Г“;",
  "ti13_tie_resolve_four_way_5": "Разрешаване на II и III място, като се играе до най-добри от една между останалите отбори.",
  "ti13_seeding_decider_sp_rules": "Решително отсяване | Правила относно приоритет за избор",
  "ti13_seeding_decider_sp_rules_1": "Първа игра — по-високо отсетите от груповия етап избират подбор или страна;",
  "ti13_seeding_decider_sp_rules_2": "Втора игра — по-ниско отсетите от груповия етап избират подбор или страна;",
  "ti13_seeding_decider_sp_rules_3": "Трета игра (ако е приложимо) — по-високо отсетите от груповия етап избират подбор или страна.",
  "ti13_playoffs_and_ti_sp_rules": "Плейофи и The International | Правила относно приоритет за избор",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Хвърляне на монета;",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Първа игра — победителите от хвърлянето на монетата избират подбор или страна;",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Втора игра — загубилите от хвърлянето на монетата избират подбор или страна;",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Трета игра (ако е приложимо) — ново хвърляне на монета. Победителите от новото хвърляне на монетата избират подбор или страна.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Първа игра — победителите от горната скоба избират подбор или страна;",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Втора игра — победителите от долната скоба избират подбор или страна;",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Трета игра — победителите от горната скоба избират подбор или страна;",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Четвърта игра (ако е приложимо) — победителите от долната скоба избират подбор или страна;",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Пета игра (ако е приложимо) — хвърляне на монета. Победителите от хвърлянето на монетата избират подбор или страна.",
  "international2024_update_title": "TI 2024, Ringmaster и Compendium",
  "ringmaster_hype": "„Liches и Linas, Sparks и Marcis, жертви на всякакви възрасти! Мигът, който всички очаквахте, най-сетне настъпи.\\n\\nСтрува ми се, че вече от година насам аз съществувам само поименно — изричано с приглушен шепот, дебнеща сянка иззад пурпурната завеса. Но сега (след прекалено дълго чакане, ако питате мен), най-после, глупците, отговорни за тази одежда, проявиха разума да ми позволят да Ви благословя с великолепието си и да заема своето скромно място под светлината на прожекторите! Това съм аз, Коглиостро Кетъл, злонамереният маестро! Мрачният глашатай на прокълнатите! Единственият и неповторимият — RINGMASTER! И разполагам с няколко тайни номера!“",
  "ringmaster_comic": "„Но не вземайте думите ми за чиста монета! Защо не прочетете комикса относно историята за моя трагичен произхода, разказана от надежден анонимен повествовател?“",
  "ringmaster_comic_title": "Куклата",
  "ringmaster_comic_desc": "Прочетете за ранните дни на Ringmaster, докато е бил на турне в цирка с часовников механизъм на Осберт Кетъл.",
  "ringmaster_guide": "„Помолиха ме да бъда Ваш пътеводител през тазгодишния Compendium… Предложение, което приех с признателност. В крайна сметка би трябвало да се опознаем! [b]Нека да започваме, става ли?[/b]“",
  "ringmaster_introducing": "Представяме",
  "ringmaster_hero_detail_button": "Прегледайте страницата с подробности за героя",
  "ringmaster_play_trailer_button": "Пускане на трейлъра",
  "ringmaster_comic_button": "Прочетете комикса",
  "international2024_compendium": "Compendium",
  "international2024_compendium_title": "The International 2024 Compendium",
  "international2024_effigies_title": "СТАТУИ ЗА ОТДЕЛНИ ГЕРОИ",
  "international2024_effigies_subtitle": "Подобрена характеристика, безплатна за всекиго",
  "international2024_effigies_intro": "„Имаше време, приятели мои, не толкова отдавна, когато тези грандиозни статуи бяха наистина бяха рядко срещани! Това вече не е така! Сега има паметник, очакващ всеки титан, който се кани да влезе на бойното поле, независимо дали това е Ringmaster или всеки от останалите по-низши герои!“",
  "international2024_effigies_desc": "Статуите са фигури на любимите Ви герои, позволяващи позиране, с които можете да се хвалите в базата си. Вместо да споделят един глобален слот, вече всички герои имат свой собствен такъв за статуя в снаряжението на оръжейната.\\n\\nМожете да се придържате към новата статуя по подразбиране за всеки герой или да създадете и екипирате Ваша собствена.",
  "international2024_purchase_intro": "„Богове и чудовища, крийпове и създанийца… Пристъпете насам и се насладете на възможността да зърнете [b]най-вълнуващата колекция от игри, събития и награди за електронни спортове[/b] от тази страна на реката! Изпробвайте своята съобразителност, късмета и нрава си в честване на най-грандиозното събитие за електронни спортове в това или което и да е друго царство!“",
  "international2024_activities": "ЕТО КАКВО ПОЛУЧАВАТЕ",
  "international2024_activities_subtitle": "Игри на късмета, постижения на уменията и удоволствия за всякакви възрасти",
  "international2024_activities_intro": "„За разлика от Вашия здравомислещ церемониалмайстор, беше ми казано, че някои от Вас се нуждаят от ПРИЧИНА, за да убиват. Ето защо всяка игра, която пускате, ще Ви носи точки, приятелю! Колкото повече играете, толкова повече придобивате, така че се впуснете в алеите и гледайте как тези точки се трупат!“",
  "international2024_activities_play_title": "Играйте Dota 2, печелете точки",
  "international2024_activities_play_desc": "Тази година ще печелите точки за почти всяка игра, която пускате посредством ежеседмичното предизвикателство. Също така ще печелите и бонус точки за първата Ви победа през всеки ден.",
  "international2024_activities_fantasy_title": "Въображаема лига",
  "international2024_activities_fantasy_desc": "Съревновавайте се с Вашите приятели и Dota 2 играчите по цял свят. Изберете най-добрия въображаем състав от любимите Ви професионалисти и изгответе персонализирани карти със статистики, подобряващи точките.",
  "international2024_activities_oracles_title": "Предизвикателството на Oracle",
  "international2024_activities_oracles_desc": "Прогнозирайте кои отбори ще напреднат и кои ще отпаднат, а после се наслаждавайте на точността на своите предсказателки способности… Допускайки, че сте били прави.",
  "international2024_activities_bingo_title": "Бинго",
  "international2024_activities_bingo_desc": "Получавате произволно генерирана бинго карта за всеки етап от турнира. Тази карта е претъпкана със странни условия и интересни ситуации.",
  "international2024_activities_outro": "„Помнете! Побеждаването не е само награда само по себе си! Всеки път, когато успеете в някоя от тези дейности, ще печелите точки! Пребродете до щанда с награди по-долу, за да разберете какви благини можете да получите с тях!“",
  "international2024_rewards_title": "Compendium награди",
  "international2024_rewards_subtitle": "Пристъпете насам и хвърлете око на тези награди",
  "international2024_rewards_intro": "„Трупайте телесата до небесата и заявете своите награди! Аххх, а КАКВИ награди Ви очакват! Не… Не наградата да увиете ръцете си около нечие гърло, гледайки как животът се процежда от очите на злочест герой. Тази част САМА ПО СЕБЕ СИ е награда! Това е наградата, която получавате ПОСЛЕ!“",
  "international2024_rewards_physical_aegis_title": "Физически модел на Aegis",
  "international2024_rewards_physical_aegis_desc": "Попълнете тази празнота в рафта и сърцето Ви с формата на Aegis с Ваше собствено копие от сплав с никелово покритие в мащаб 1/5 на прославената шампионска награда.",
  "international2024_rewards_hud_title": "The International 2024 проекционен дисплей",
  "international2024_rewards_hud_desc": "Разкрасете своя игрален интерфейс с цирковия дух. Преработихме проекционният дисплей около тазгодишната тематика на TI.",
  "international2024_rewards_versus_title": "Екран за съперници 2024",
  "international2024_rewards_versus_desc": "Освежете своя боен дух преди игра с персонализиран екран за съперници, където да се похвалите с новите слотове за героични статуи.",
  "international2024_rewards_chat_wheels_title": "Перманентни чат рулетки",
  "international2024_rewards_stickers_title": "Стикери на играчи и отбори",
  "international2024_rewards_loading_screens_title": "Екрани при зареждане",
  "international2024_rewards_materials_title": "Повишаване на мощта за въображаемата лига и бингото",
  "international2024_rewards_teleport_fx_title": "Ефекти при телепортиране на любим отбор",
  "international2024_rewards_effigy_title": "Блок за статуя 2024",
  "international2024_supporters_clubs_title": "Подкрепете общността",
  "international2024_supporters_clubs_subtitle": "Комплекти за таланти и отборни привърженици",
  "international2024_supporters_clubs_intro": "„Почитаеми благодетели! Филантропи на всякакви възрасти! Скромни покровители на убийствата и непосредствени до убийствата изкуства! 50% от великодушната Ви щедрост ще отиде директно към Вашите любими отбори и коментаторски таланти! Кой е истинският герой тук? Аз, очевидно! Ръкопляскайки с моите огромни героични длани за ВАС!“",
  "international2024_supporters_clubs_tiers_title": "Отборни клубове на привържениците",
  "international2024_supporters_clubs_tiers_desc": "Изберете бронзова, сребърна или златна подкрепа за своите любими отбори, така че да спечелите награди, проектирани от самите отбори.",
  "international2024_talent_tiers_title": "Пакети със стикери за таланти",
  "international2024_talent_tiers_desc": "Закупувайте наградни комплекти с участието на любимия Ви талант. Комплектите включват комбинация от стикери, гласови реплики и автографи. Това зависи от поредицата за подкрепа на закупения комплект.",
  "ti13_compendium_small_header": "Подкрепете турнира",
  "ti13_compendium_header": "The International 2024 Compendium",
  "ti13_compendium_desc": "TI 2024 Compendium е интерактивният Ви дигитален спътник към The International. TI Compendium е единственото място, което Ви е нужно, за всякакви дейности и предизвикателства, свързани със събитието. Това също важи за всички от тазгодишните награди, съсредоточени към събитието. Плюс това 25% от приходите при всички продажби ще допринасят към наградния фонд на The International 2024.",
  "ti13_compendium_bp_btn": "Посетете уебсайта",
  "ti13_compendium_standard": "Стандартен Compendium",
  "ti13_compendium_standard_subtitle": "Всички характеристики и дейности",
  "ti13_compendium_upgraded": "Подобрен Compendium",
  "ti13_compendium_upgraded_subtitle": "Всички характеристики и дейности плюс ускорено придобиване на награди",
  "ti13_compendium_purchase_tp_fx": "TI 2024 ефект за телепортиране (ниво 1)",
  "ti13_compendium_purchase_boosters_footnote": "Подсилванията могат да отключат допълнително съдържани по Ваш избор",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Подсилванията могат да отключат проекционния дисплей за The International 2024 или допълнително съдържани по Ваш избор",
  "ti13_compendium_purchase_levels": "%1$s Compendium нива",
  "ti13_compendium_purchase_booster_levels": "%1$s подсилвания",
  "ti13_compendium_purchase_discount": "Спестете %1$s% за нива",
  "ti13_compendium_purchase_earn_the_following": "Compendium нивата ще отключват:",
  "ti13_compendium_contribution": "25% от приходите при всички продажби ще допринасят към наградния фонд на The International 2024.",
  "ti13_compendium_purchase_all_access": "Достъп до всички Compendium характеристики",
  "ti13_compendium_purchase_aegis_emoticon": "Aegis емотикона",
  "ti13_compendium_purchase_bingo_tokens": "%1$s бинго жетона",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s преизбирания във въображаемата лига",
  "ti13_compendium_purchase_one_player_sticker": "1 капсула със стикери на играчи",
  "ti13_compendium_purchase_player_stickers": "%1$s капсули със стикери на играчи",
  "ti13_compendium_purchase_team_stickers": "%1$s капсули с отборни стикери",
  "ti13_compendium_purchase_effigy_blocks": "%1$s TI 2024 блока за статуи",
  "ti13_compendium_purchase_team_loading_screens": "%1$s съкровища с отборен екран при зареждане",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s съкровища с TI екран при зареждане",
  "international2024_tournament_learn_more": "Научете още относно турнира",
  "ringmaster_abilities_heading": "Умения",
  "ringmaster_souvenirs_heading": "Сувенири",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "ИЗПЪЛНЯВАЩО СЕ — Ringmaster засуква камшика си, а след това изплющява с него. Бичуваните врагове поемат щети и бягат заради всятия страх от Ringmaster. Времето на изпълняването експоненциално увеличава щетите и удължава продължителността на всявания страх, но понижава радиуса.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster натиква себе си или съюзнически герой в мобилна, междупространствена кутия. Единиците в нея придобиват сфазирано движение, устойчивост срещу забавяния, бонус магическа устойчивост и бонус скорост за движение. Също така не позволяват прицелване, а редом с това са безмълвни, заглушени и обезоръжени. Кутията ще се отвори, след като ефектът изтече или героят се придвижи извън радиуса.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster хвърля един от своите кинжали към определена точка по негов избор. Ако удари враг, кинжалът нанася щети при попадението, за кратко забавя ударената единица и нанася процент от максималното здраве на жертвата в щети през всяка секунда.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster търкулва Wheel of Wonder до целевото местонахождение, отблъсквайки настрани враговете по протежението на пътя му. След като достигне целта си, враговете в обсега на колелото поемат щети през време и са забавени. Враговете, които се изправят срещу колелото за повече от 0,5 секунди, стават запленени и привлечени към него. Първият враг, който бъде запленен, задейства брояч за експлодирането на колелото. Ако броячът не е задействан, колелото ще експлодира автоматично след 8 секунди.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster осветява с прожектор, който преминава върху площта. Враговете в светлината разполагат с шанс да пропускат атаките си и се разкриват, ако са невидими. Илюзиите, ударени от лъча, избледняват, губейки процент от своето максимално здраве през всяка секунда.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ringmaster получава произволен Dark Carnival сувенир за еднократна употреба всеки път, когато вражески герой умре наблизо. Допълнителните сувенири се държат като заряди. Ако Ringmaster не разполага със сувенир, когато се прероди, ще му бъде предоставен такъв. Сувенирите от Dark Carnival включват Funhouse Mirror, Strongman Tonic и Whoopee Cushion.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Употреба: Proportion Distortion\\n\\nСъздава 1 несъвършено изображение на Вашия герой, което трае 18 секунди. Илюзията Ви нанася 28% и поема 300% щети.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Употреба: Whoopsie\\n\\nТласка героя Ви напред на разстояние от 400. След себе си оставя смрадлив облак с радиус от 200 за 3 секунди, който забавя враговете с 30%.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic",
  "ringmaster_ability_strongman_tonic_Description": "Употреба: Forcefully Imbibe\\n\\nВременно увеличава силата на съюзнически герой с 5 плюс 1,5 за ниво на Ringmaster за 8 секунди. Ефектът се задържа за 4 секунди, а след това се влошава с течение на времетраенето."
}