// 7726.js

{
  "language": "vietnamese",
  "ringmastercomic_title_cover": "Con rối - Trang bìa",
  "ringmastercomic_title": "Con rối - Trang %1$s",
  "ringmastercomic_help_text": "Nhấp ảnh hoặc dùng phím cách để đi tiếp",
  "ringmastercomic_return_button": "Trở về trang bìa",
  "ti13_online": "Copenhagen",
  "ti13_main_event_venue": "Royal Arena - Copenhagen",
  "ti13_best_of_three": "BO3",
  "ti13_best_of_five": "BO5",
  "ti13_group_stage_sp_rules": "Vòng bảng - Điều lệ ưu tiên quyền chọn",
  "ti13_group_stage_sp_game1": "Tung đồng xu.",
  "ti13_group_stage_sp_game2": "Trận đầu: Đội tung đồng xu thắng sẽ có quyền chọn tướng hoặc phe.",
  "ti13_group_stage_sp_game3": "Trận hai: Đội tung đồng xu thua sẽ có quyền chọn tướng hoặc phe.",
  "ti13_group_stage_sp_game4": "Trận ba (nếu có): Tung đồng xu lần nữa. Đội tung đồng xu thắng sẽ có quyền chọn tướng hoặc phe.",
  "ti13_group_stage_tie_rules": "Vòng bảng - Điều lệ trận quyết định",
  "ti13_first_second_tie": "Hai đội đồng hạng 1 và 2",
  "ti13_second_third_tie": "Hai đội đồng hạng 2 và 3",
  "ti13_third_fourth_tie": "Hai đội đồng hạng 3 và 4",
  "ti13_three_way_first_tie": "Ba đội đồng hạng 1",
  "ti13_three_way_second_tie": "Ba đội đồng hạng 2",
  "ti13_four_way_tie": "Bốn đội đồng hạng 1",
  "ti13_tie_resolve_bo3": "Giải quyết bằng đấu BO3.",
  "ti13_tie_resolve_third_fourth": "Không chơi thêm trận nào khác. Hai đội vẫn đồng hạng 3 và 4.",
  "ti13_tie_resolve_first_with_round_robin": "Giải quyết hạng 1 bằng cách đấu vòng tròn tính điểm BO1 cho đến khi một đội thắng hai lần.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Tiếp tục chơi cho đến khi tất cả các đội đã đấu với nhau ít nhất một lần. Dùng kết quả đấu vòng tròn tính điểm gần đây nhất để giải quyết vị trí hạng 2 và 3.",
  "ti13_tie_resolve_second_with_round_robin": "Giải quyết hạng 2 bằng cách đấu vòng tròn tính điểm BO1 cho đến khi một đội thắng hai lần.",
  "ti13_tie_resolve_third_fourth_other": "Không chơi thêm trận nào khác. Hai đội kia vẫn đồng hạng 3 và 4.",
  "ti13_tie_resolve_four_way_1": "Bắt cặp đấu ngẫu nhiên. Theo như luật này, hãy gọi các đội này là đội A, đội B, đội C, và đội D.",
  "ti13_tie_resolve_four_way_2": "Đội A đấu đội B theo BO1. Đội C đấu đội D theo BO1.",
  "ti13_tie_resolve_four_way_3": "Giải quyết vị trí hạng 1 bằng cách đấu BO1 giữa đội thắng cặp đấu A/B và cặp đấu C/D.",
  "ti13_tie_resolve_four_way_4": "Giải quyết vị trí hạng 4 bằng cách đấu BO1 giữa đội thua cặp đấu A/B và cặp đấu C/D.",
  "ti13_tie_resolve_four_way_5": "Giải quyết vị trí hạng 2 và 3 bằng cách đấu BO1 giữa các đội còn lại.",
  "ti13_seeding_decider_sp_rules": "Vòng xếp hạt giống - Điều lệ ưu tiên quyền chọn",
  "ti13_seeding_decider_sp_rules_1": "Trận đầu: Hạt giống cao hơn từ vòng bảng có quyền chọn tướng hoặc phe.",
  "ti13_seeding_decider_sp_rules_2": "Trận hai: Hạt giống thấp hơn từ vòng bảng có quyền chọn tướng hoặc phe.",
  "ti13_seeding_decider_sp_rules_3": "Trận ba (nếu có): Hạt giống cao hơn từ vòng bảng có quyền chọn tướng hoặc phe.",
  "ti13_playoffs_and_ti_sp_rules": "Vòng loại trực tiếp và The International - Điều lệ ưu tiên quyền chọn",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Tung đồng xu.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Trận đầu: Đội tung đồng xu thắng sẽ có quyền chọn tướng hoặc phe.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Trận hai: Đội tung đồng xu thua sẽ có quyền chọn tướng hoặc phe.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Trận ba (nếu có): Tung đồng xu lần nữa. Đội tung đồng xu thắng sẽ có quyền chọn tướng hoặc phe.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Trận đầu: Đội thắng nhánh trên có quyền chọn tướng hoặc phe.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Trận hai: Đội thắng nhánh dưới có quyền chọn tướng hoặc phe.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Trận ba: Đội thắng nhánh trên có quyền chọn tướng hoặc phe.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Trận bốn (nếu có): Đội thắng nhánh dưới có quyền chọn tướng hoặc phe.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Trận năm (nếu có): Tung đồng xu. Đội tung đồng xu thắng sẽ có quyền chọn tướng hoặc phe.",
  "international2024_update_title": "TI 2024, tướng Ringmaster và Compendium",
  "ringmaster_hype": "\"Hỡi các Lich và Lina, các Slark và Marci, nạn nhân đủ mọi lứa tuổi! Thời khắc các bạn mong chờ giờ đã tới.\\n\\n Tưởng chừng gần một năm qua, tôi đây như hữu danh vô thực — tên chỉ cất lên trong tiếng thì thầm vội vã, khác chi bóng người dưng sau tấm rèm đỏ thẫm. Nhưng giờ đây, cuối cùng thì (tui thấy là quá lâu luôn đó), những kẻ khờ phụ trách công cuộc này đã tìm thấy trí khôn để cho phép tôi đây chúc phúc các bạn với bản thể vĩ đại này, dưới ánh đèn sân khấu rực sáng đầy khiêm tốn! Là ta đây, Cogliostro Kettle — nhạc trưởng tàn bạo! Người khua chiêng múa trống mời gọi kẻ đọa đày! RINGMASTER độc nhất vô nhị! Và ta đây không thiếu mánh khóe giấu ống tay",
  "ringmaster_comic": "\"Nhưng tin lời ta làm chi! Sao không đọc qua mẩu truyện tranh về nguồn gốc bi kịch của ác nhân này, dưới lời kể người dẫn chuyện vô danh?\"",
  "ringmaster_comic_title": "Con rối",
  "ringmaster_comic_desc": "Đọc những ngày đầu lưu diễn của Ringmaster với rạp xiếc cơ khí Kettle.",
  "ringmaster_guide": "\"Ta đã được giao trọng trách hướng dẫn quý vị trải nghiệm Compendium năm nay — một đề nghị ta đây hân hoan chấp thuận, cùng làm quen nào! [b]Bắt đầu nhé?[/b]\"",
  "ringmaster_introducing": "Xin giới thiệu",
  "ringmaster_hero_detail_button": "Xem trang tướng chi tiết",
  "ringmaster_play_trailer_button": "Phát trailer",
  "ringmaster_comic_button": "Đọc truyện tranh",
  "international2024_compendium": "Compendium",
  "international2024_compendium_title": "Compendium The International 2024",
  "international2024_effigies_title": "TƯỢNG THEO MỖI TƯỚNG",
  "international2024_effigies_subtitle": "Tính năng nâng cấp miễn phí cho mọi người",
  "international2024_effigies_intro": "\"Đã từng có thời, hỡi bà con cô bác, cũng cách đây không lâu, khi mà những tượng đá hoành tráng hiếm như lông cóc! Giờ thì hết rồi! Giờ đây có một bệ đài chờ đón người khổng lồ bước chân vào chiến trường, dù đấy là Ringmaster hay các tướng kém cỏi hơn!\"",
  "international2024_effigies_desc": "Tượng được tạc theo tư thế tướng yêu thích của bạn để đặt khoe trong căn cứ đội nhà. Thay vì chỉ có một ô trang bị chung, mỗi tướng giờ có một ô trang bị tượng riêng trong kho vũ khí.\\n\\nDùng tượng mặc định mới cho bất kỳ tướng nào, hoặc chế tác và tự trang bị theo cách của riêng bạn.",
  "international2024_purchase_intro": "\"Thần thánh và quái vật, quái đường và đám nhãi nhép, hãy bước lên ngắm thỏa con mắt [b]bộ sưu tập các trò chơi, sự kiện, và phần thưởng esport hào hứng nhất[/b] bên bờ sông này! Thách thức trí khôn, vận may, và bản lĩnh để chào mừng sự kiện esport khủng nhất cõi giới này và nhiều cõi giới khác!\"",
  "international2024_activities": "ĐÂY LÀ NHỮNG GÌ BẠN CÓ",
  "international2024_activities_subtitle": "Trò chơi may rủi, tài không đợi tuổi, mọi người cùng vui ",
  "international2024_activities_intro": "\"Khác với người dẫn chương trình có đầu óc ổn định là ta đây, nghe đồn vài người trong quý vị cần LÝ DO để đồ sát. Vì thế cứ chơi trận nào là có điểm trận đó nha bạn tôi ơi! Chơi càng nhiều, nhận càng nhiều, vậy nên tung mình vào làn đường và tích cóp điểm đi nào!\"",
  "international2024_activities_play_title": "Chơi Dota: Nhận điểm",
  "international2024_activities_play_desc": "Năm nay, bạn sẽ kiếm điểm cho gần như mỗi trận đấu với thử thách hàng tuần. Bạn cũng sẽ nhận thêm điểm cho trận thắng đầu tiên mỗi ngày.",
  "international2024_activities_fantasy_title": "Fantasy",
  "international2024_activities_fantasy_desc": "Tranh tài với bạn bè và người chơi Dota trên toàn cầu. Chọn đội hình fantasy tốt nhất với các tuyển thủ chuyên nghiệp yêu thích và chế tác thẻ bài để có chỉ số cải thiện.",
  "international2024_activities_oracles_title": "Thử thách Oracle",
  "international2024_activities_oracles_desc": "Dự đoán chuyện thành bại của các đội, và tận hưởng cảm giác làm nhà tiên tri (nếu bạn đoán đúng).",
  "international2024_activities_bingo_title": "Lô tô",
  "international2024_activities_bingo_desc": "Nhận thẻ lô tô ngẫu nhiên cho mỗi vòng của giải đấu, khám phá các ô lô tô với điều kiện kỳ quái và tình huống oái oăm.",
  "international2024_activities_outro": "\"Nhớ nè! Bản thân chiến thắng không phải là phần thưởng duy nhất! Mỗi khi thành công một trong các hoạt động này, bạn sẽ nhận được điểm! Hãy đến ngay quầy thưởng bên dưới để xem mình mang về được món nào nha!\"",
  "international2024_rewards_title": "Phần thưởng Compendium",
  "international2024_rewards_subtitle": "Bà con cô bác mau tới đây và chiêm ngưỡng phần thưởng đi nào",
  "international2024_rewards_intro": "\"Xếp mấy cái xác đó thật cao để lấy quà nào! À, mà quà có thể là GÌ đây! Hông, chả phải phần thưởng được dùng tay bóp cổ, ngắm nghía sinh lực bị siết cạn từ mắt của một vị tướng bất hạnh nào đó đâu. BẢN THÂN VIỆC ĐÓ là một món quà riêng! Đây là kiểu quà mà bạn nhận SAU khi làm thế cơ!\"",
  "international2024_rewards_physical_aegis_title": "Aegis hàng tươi thóc thật",
  "international2024_rewards_physical_aegis_desc": "Lấp đầy lỗ trống hình Aegis trên kệ sách và trái tim của bạn với bản sao phần thưởng danh giá của nhà vô địch làm bằng hợp kim niken tỉ lệ 1/5.",
  "international2024_rewards_hud_title": "Giao diện HUD The International 2024",
  "international2024_rewards_hud_desc": "Tô điểm giao diện trong trận đấu với tinh thần rạp xiếc. Chúng tôi đã tân trang giao diện này theo chủ đề TI năm nay.",
  "international2024_rewards_versus_title": "Màn hình thách đấu 2024",
  "international2024_rewards_versus_desc": "Vực lại tinh thần trước khi vào trận với màn hình thách đấu tùy chỉnh và flex nhẹ ô trang bị tượng mới cho tướng.",
  "international2024_rewards_chat_wheels_title": "Vòng tán gẫu vĩnh viễn",
  "international2024_rewards_stickers_title": "Hình dán tuyển thủ và đội tuyển",
  "international2024_rewards_loading_screens_title": "Màn hình chờ",
  "international2024_rewards_materials_title": "Tăng lực cho Fantasy và Lô tô",
  "international2024_rewards_teleport_fx_title": "Hiệu ứng thành phù với đội tuyển yêu thích",
  "international2024_rewards_effigy_title": "Đá tạc tượng 2024",
  "international2024_supporters_clubs_title": "Ủng hộ cộng đồng",
  "international2024_supporters_clubs_subtitle": "Gói ủng hộ khách mời và đội tuyển",
  "international2024_supporters_clubs_intro": "\"Nhà hảo tâm đáng kính! Nhà hào kiệt ở mọi lứa tuổi! Nhà bảo trợ của việc chém giết và nghệ thuật đồ sát! 50% tấm lòng rộng lượng quảng đại của bạn sẽ được gửi trực tiếp đến đội tuyển và bình luận viên khách mời yêu thích. Vậy ai mới là người hùng thực thụ nè? Tui chứ ai! Vỗ bàn tay đậm chất anh hùng của tôi để mừng BẠN nè!\"",
  "international2024_supporters_clubs_tiers_title": "Câu lạc bộ ủng hộ đội tuyển",
  "international2024_supporters_clubs_tiers_desc": "Từ Đồng, Bạc, cho đến Vàng, ủng hộ đội tuyển mình yêu thích để nhận phần thưởng do chính các đội đó thiết kế.",
  "international2024_talent_tiers_title": "Gói hình dán khách mời",
  "international2024_talent_tiers_desc": "Mua gói thưởng của khách mời bạn yêu mến. Gói bao gồm hình dán, lời thoại, và chữ ký tùy theo cấp độ bậc của gói được mua.",
  "ti13_compendium_small_header": "Ủng hộ giải đấu",
  "ti13_compendium_header": "Compendium giải The International 2024",
  "ti13_compendium_desc": "Compendium là bạn đồng hành số cho sự kiện The International. Đây là điểm dừng chân cho tất tần tật mọi hoạt động sự kiện, thử thách, và các phần thưởng liên quan đến sự kiện năm nay. Thêm vào đó, 25% doanh thu sẽ góp thẳng vào tổng giải thưởng The International 2024.",
  "ti13_compendium_bp_btn": "Truy cập trang web",
  "ti13_compendium_standard": "Compendium tiêu chuẩn",
  "ti13_compendium_standard_subtitle": "Tất cả tính năng và hoạt động",
  "ti13_compendium_upgraded": "Compendium nâng cấp",
  "ti13_compendium_upgraded_subtitle": "Tất cả các tính năng và hoạt động kèm theo gia tăng tốc độ nhận thưởng",
  "ti13_compendium_purchase_tp_fx": "Hiệu ứng thành phù TI 2024 cấp 1",
  "ti13_compendium_purchase_boosters_footnote": "Gói bổ trợ có thể mở khóa thêm nội dung tùy ý",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Gói bổ trợ có thể mở khóa giao diện The International 2024, hoặc thêm nội dung khác tùy ý",
  "ti13_compendium_purchase_levels": "%1$s cấp Compendium",
  "ti13_compendium_purchase_booster_levels": "%1$s gói bổ trợ",
  "ti13_compendium_purchase_discount": "Tiết kiệm %1$s% khi mua cấp",
  "ti13_compendium_purchase_earn_the_following": "Cấp Compendium sẽ mở khóa:",
  "ti13_compendium_contribution": "25% doanh thu sẽ góp thẳng vào tổng giải thưởng The International 2024.",
  "ti13_compendium_purchase_all_access": "Truy cập toàn bộ tính năng Compendium",
  "ti13_compendium_purchase_aegis_emoticon": "Biểu tượng cảm xúc Aegis",
  "ti13_compendium_purchase_bingo_tokens": "%1$s token lô tô",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s token chọn Fantasy",
  "ti13_compendium_purchase_one_player_sticker": "1 gói hình dán tuyển thủ",
  "ti13_compendium_purchase_player_stickers": "%1$s gói hình dán tuyển thủ",
  "ti13_compendium_purchase_team_stickers": "%1$s gói hình dán đội tuyển",
  "ti13_compendium_purchase_effigy_blocks": "%1$s đá tạc tượng TI 2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s kho báu màn hình chờ đội tuyển",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s kho báu màn hình chờ TI",
  "international2024_tournament_learn_more": "Tìm hiểu thêm về giải đấu",
  "ringmaster_abilities_heading": "Kỹ năng",
  "ringmaster_souvenirs_heading": "Lưu niệm",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "VẬN PHÁP - Ringmaster múa roi lên rồi quất nó. Kẻ địch bị quất sẽ nhận sát thương và hoảng sợ bỏ chạy khỏi Ringmaster. Thời gian vận pháp tăng đáng kể sát thương và kéo dài thời gian hoảng sợ, nhưng giảm bán kính.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster đóng gói bản thân hoặc một tướng đồng minh vào hộp lưu động ở chiều không gian khác. Đơn vị trong hộp di chuyển xuyên vật thể, kháng làm chậm, thêm kháng phép và tốc độ chạy. Chúng không thể bị chọn làm mục tiêu, bị cấm đồ, khóa phép và cấm đánh. Hộp sẽ mở sau khi hết thời gian hiệu ứng, hoặc khi tướng di chuyển ra ngoài bán kính.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster ném dao chuẩn xác đến một điểm mình chọn. Nếu ném trúng kẻ địch, dao gây sát thương va chạm, làm chậm thoáng chốc, và gây sát thương mỗi giây theo phần trăm máu tối đa của nạn nhân.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster lăn vòng xoay kỳ diệu đến vị trí mục tiêu, đẩy kẻ địch ra trên đường đi. Sau khi đến mục tiêu, kẻ địch trong tầm của vòng xoay sẽ nhận sát thương theo thời gian và bị làm chậm. Kẻ địch đối mặt với vòng quay hơn 0.5 giây sẽ bị mê hoặc và kéo về phía nó. Kẻ địch đầu tiên bị mê hoặc sẽ kích hoạt đếm ngược phát nổ cho vòng xoay. Nếu thời gian đếm ngược không được kích hoạt, vòng xoay sẽ tự động phát nổ sau 8 giây.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster chiếu đèn sân khấu quét qua một khu vực. Kẻ địch trong vùng sáng có tỉ lệ đánh trượt và bị lộ tàng hình. Phân thân trúng ánh đèn sẽ mờ đi, mất một lượng phần trăm máu tối đa mỗi giây.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ringmaster nhận ngẫu nhiên quà lưu niệm Dark Carnival dùng một lần mỗi khi tướng địch chết gần đó. Quà lưu niệm thêm được giữ dưới dạng lượt dùng. Ringmaster sẽ nhận một quà lưu niệm nếu không có món nào khi hồi sinh. Quà Dark Carnival gồm Funhouse Mirror, Strongman Tonic, và Whoopee Cushion.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Sử dụng: Biến dạng tỉ lệ\\n\\nTạo 1 phân thân không hoàn hảo cho tướng của bạn, tồn tại 18 giây. Phân thân gây 28% và nhận 300% sát thương.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Sử dụng: Xì hơi\\n\\nPhóng tướng của bạn tới trước 400 đơn vị. Để lại đằng sau hơi thối có bán kính 200 đơn vị trong 3 giây, làm chậm kẻ địch 30%.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic"
}