// 1547.js

{
  "language": "german",
  "ringmastercomic_title_cover": "Die Marionette – Titelseite",
  "ringmastercomic_title": "Die Marionette – Seite %1$s",
  "ringmastercomic_help_text": "Zum Umblättern Bild anklicken oder Leertaste drücken",
  "ringmastercomic_return_button": "Zurück zur Titelseite",
  "ti13_online": "Kopenhagen",
  "ti13_main_event_venue": "Royal Arena, Kopenhagen",
  "ti13_best_of_three": "Best-of-Three",
  "ti13_best_of_five": "Best-of-Five",
  "ti13_group_stage_sp_rules": "Gruppenphase – Regeln der Auswahlpriorität",
  "ti13_group_stage_sp_game1": "Münzwurf.",
  "ti13_group_stage_sp_game2": "Erste Partie: Der Gewinner des Münzwurfs entscheidet, ob er zuerst die Helden oder die Seite wählt.",
  "ti13_group_stage_sp_game3": "Zweite Partie: Der Verlierer des Münzwurfs entscheidet, ob er zuerst die Helden oder die Seite wählt.",
  "ti13_group_stage_sp_game4": "Dritte Partie (wenn benötigt): Neuer Münzwurf. Der Gewinner dieses Münzwurfs entscheidet, ob er zuerst die Helden oder die Seite wählt.",
  "ti13_group_stage_tie_rules": "Gruppenphase – Regeln der Entscheidung bei Gleichstand",
  "ti13_first_second_tie": "Zwei Teams teilen sich punktgleich den 1. und 2. Platz:",
  "ti13_second_third_tie": "Zwei Teams teilen sich punktgleich den 2. und 3. Platz:",
  "ti13_third_fourth_tie": "Zwei Teams teilen sich punktgleich den 3. und 4. Platz:",
  "ti13_three_way_first_tie": "Drei Teams teilen sich punktgleich den 1. Platz:",
  "ti13_three_way_second_tie": "Drei Teams teilen sich punktgleich den 2. Platz:",
  "ti13_four_way_tie": "Vier Teams teilen sich punktgleich den 1. Platz:",
  "ti13_tie_resolve_bo3": "Die Entscheidung fällt in einem Best-of-Three.",
  "ti13_tie_resolve_third_fourth": "Es werden keine weiteren Partien gespielt. Die beiden Teams teilen sich weiterhin den 3. und 4. Platz.",
  "ti13_tie_resolve_first_with_round_robin": "Die Entscheidung über den 1. Platz fällt, indem die Teams ein kleines Rundenturnier aus Best-of-Ones austragen, bis ein Team zweimal gewonnen hat.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Die Partien werden ausgetragen, bis alle Teams mindestens einmal gegeneinander gespielt haben. Diese Ergebnisse werden für die Entscheidung über den 2. und 3. Platz herangezogen.",
  "ti13_tie_resolve_second_with_round_robin": "Die Entscheidung über den 2. Platz fällt, indem die Teams ein kleines Rundenturnier aus Best-of-Ones austragen, bis ein Team zweimal gewonnen hat.",
  "ti13_tie_resolve_third_fourth_other": "Es werden keine weiteren Partien gespielt. Die beiden anderen Teams teilen sich weiterhin den 3. und 4. Platz.",
  "ti13_tie_resolve_four_way_1": "Die Teams treten nach dem Zufallsprinzip gegeneinander an. Der Einfachheit halber werden diese Teams in diesen Regeln als Team A, Team B, Team C und Team D bezeichnet.",
  "ti13_tie_resolve_four_way_2": "Team A tritt gegen Team B in einem Best-of-One an. Team C tritt gegen Team D in einem Best-of-One an.",
  "ti13_tie_resolve_four_way_3": "Die Entscheidung über den 1. Platz fällt, indem die Gewinner der Begegnungen A/B und C/D in einem Best-of-One gegeneinander antreten.",
  "ti13_tie_resolve_four_way_4": "Die Entscheidung über den 4. Platz fällt, indem die Verlierer der Begegnungen A/B und C/D in einem Best-of-One gegeneinander antreten.",
  "ti13_tie_resolve_four_way_5": "Die Entscheidung über den 2. und 3. Platz fällt, indem die übrigen Teams in einem Best-of-One gegeneinander antreten.",
  "ti13_seeding_decider_sp_rules": "Entscheidung über die Platzierung – Regeln der Auswahlpriorität",
  "ti13_seeding_decider_sp_rules_1": "Erste Partie: Das höher platzierte Team der Gruppenphase entscheidet, ob es zuerst die Helden oder die Seite wählt.",
  "ti13_seeding_decider_sp_rules_2": "Zweite Partie: Das niedriger platzierte Team der Gruppenphase entscheidet, ob es zuerst die Helden oder die Seite wählt.",
  "ti13_seeding_decider_sp_rules_3": "Dritte Partie (wenn benötigt): Das höher platzierte Team der Gruppenphase entscheidet, ob es zuerst die Helden oder die Seite wählt.",
  "ti13_playoffs_and_ti_sp_rules": "Play-offs und The International – Regeln der Auswahlpriorität",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Münzwurf.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Erste Partie: Der Gewinner des Münzwurfs entscheidet, ob er zuerst die Helden oder die Seite wählt.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Zweite Partie: Der Verlierer des Münzwurfs entscheidet, ob er zuerst die Helden oder die Seite wählt.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Dritte Partie (wenn benötigt): Neuer Münzwurf. Der Gewinner dieses Münzwurfs entscheidet, ob er zuerst die Helden oder die Seite wählt.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Erste Partie: Der Gewinner des Oberen Brackets entscheidet, ob er zuerst die Helden oder die Seite wählt.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Zweite Partie: Der Gewinner des Unteren Brackets entscheidet, ob er zuerst die Helden oder die Seite wählt.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Dritte Partie: Der Gewinner des Oberen Brackets entscheidet, ob er zuerst die Helden oder die Seite wählt.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Vierte Partie (wenn benötigt): Der Gewinner des Unteren Brackets entscheidet, ob er zuerst die Helden oder die Seite wählt.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Fünfte Partie (wenn benötigt): Münzwurf. Der Gewinner dieses Münzwurfs entscheidet, ob er zuerst die Helden oder die Seite wählt.",
  "international2024_update_title": "TI 2024, Ringmaster und das Kompendium",
  "ringmaster_hype": "„Liches und Linas, Slarks und Marcis, Opfer jeden Alters! Der Moment, auf den ihr alle gewartet habt, ist endlich gekommen.\\n\\nSeit einem Jahr, so scheint es, existiere ich nur dem Namen nach: Man spricht nur flüsternd über mich, ein lauernder Schatten hinter einem blutroten Vorhang. Aber jetzt, endlich (es hat viel zu lange gedauert, wenn ihr mich fragt), haben die Schwachköpfe, die für die Planung meiner Tournee verantwortlich sind, mir eine angemessene Bühne bereitgestellt, um euch mit meiner Pracht zu beglücken und meinen bescheidenen Platz im Rampenlicht einzunehmen! Manege frei für Cogliostro Kettle, der bösartige Maestro! Der Direktor des Dunklen Zirkus! Der einzigartige RINGMASTER! Und ich habe noch ein paar weitere Tricks auf Lager!“",
  "ringmaster_comic": "„Aber nehmt mein Wort nicht für bare Münze! Warum lest ihr nicht den Comic über meine tragische Entstehungsgeschichte, erzählt von einem vertrauenswürdigen und gänzlich unbefangenen Erzähler?“",
  "ringmaster_comic_title": "Die Marionette",
  "ringmaster_comic_desc": "Lesen Sie mehr über die Anfänge von Ringmaster, als er noch mit dem Zirkus Kettle auf Tournee ging.",
  "ringmaster_introducing": "Manege frei für",
  "ringmaster_hero_detail_button": "Heldenseite anzeigen",
  "ringmaster_play_trailer_button": "Trailer abspielen",
  "ringmaster_comic_button": "Comic lesen",
  "international2024_compendium": "Kompendium",
  "international2024_compendium_title": "Kompendium zu The International 2024",
  "international2024_effigies_title": "STATUEN FÜR JEDEN HELDEN",
  "international2024_effigies_subtitle": "Überarbeitete Funktion, kostenlos für alle Spieler",
  "international2024_effigies_intro": "„Vor nicht allzu langer Zeit, geschätzte Freunde, waren diese prächtigen Statuen noch ein seltener Anblick! Aber diese Zeiten sind vorbei! Jetzt steht für jeden Titanen, der das Schlachtfeld betritt, ein solches Monument bereit, ganz gleich, ob es sich dabei um den Ringmaster höchstselbst oder einen der anderen unbedeutenden Helden handelt!“",
  "international2024_activities": "DAS WARTET AUF SIE",
  "international2024_activities_subtitle": "Spiele des Glücks, Geschicks und Vergnügens für Groß und Klein",
  "international2024_activities_intro": "„Anders als euer voll zurechnungsfähiger Showmaster brauchen einige von euch einen GRUND zum Töten. Jede Partie, die ihr spielt, bringt euch daher Kompendium-Punkte ein, meine Freunde! Je mehr ihr spielt, desto mehr verdient ihr, also stürzt euch in die Pfade und seht dabei zu, wie sich die Punkte nur so anhäufen!“",
  "international2024_activities_play_title": "Dota spielen, Punkte verdienen",
  "international2024_activities_play_desc": "In diesem Jahr erhalten Sie für fast jede Partie, die Sie im Rahmen der Wöchentlichen Herausforderung spielen, Kompendium-Punkte. Außerdem erhalten Sie Bonuspunkte für den ersten Sieg des Tages.",
  "international2024_activities_fantasy_title": "Fantasy",
  "international2024_activities_fantasy_desc": "Treten Sie gegen Ihre Freunde und Dota-Spieler aus der ganzen Welt an. Stellen Sie den besten Fantasy-Kader bestehend aus Ihren Lieblingsprofispielern zusammen und passen Sie die Statistiken deren Kriegsbanner entsprechend Ihrer Wünsche an, um noch mehr Kompendium-Punkte zu verdienen.",
  "international2024_activities_oracles_title": "Oracles Herausforderung",
  "international2024_activities_oracles_desc": "Sagen Sie vorher, welche Teams in die nächste Turnierphase einziehen und welche ausscheiden werden. Sie erhalten Kompendium-Punkte basierend auf der Genauigkeit Ihrer Prognosen.",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Erhalten Sie zufällig generierte Bingokarten für jede Turnierphase, vollgepackt mit seltsamen Anforderungen und interessanten Spielsituationen.",
  "international2024_activities_outro": "„Denkt daran! Gewinnen ist nicht Belohnung genug! Jedes Mal, wenn ihr eine dieser Aktivitäten erfolgreich abschließt, erhaltet ihr Punkte! Werft einen Blick auf den Belohnungsstand weiter unten, um herauszufinden, was für tolle Sachen euch erwarten!“",
  "international2024_rewards_title": "Kompendium-­Belohnungen",
  "international2024_rewards_subtitle": "Treten Sie vor und werfen Sie einen Blick auf diese Belohnungen",
  "international2024_rewards_intro": "„Bahnt euch euren Weg durch all die Leichen und holt euch eure Belohnungen! Ahhh, und WAS FÜR BELOHNUNGEN auf euch warten! Nein, nicht etwa die Belohnung, dabei zuzusehen, wie eure Hände einen Hals umklammern und das Leben aus den Augen eines unglückseligen Helden entweicht. Das ist eine Belohnung EINER ANDEREN ART! Hier seht ihr, was ihr DANACH bekommt!“",
  "international2024_rewards_physical_aegis_title": "Physische Replik der Ägis",
  "international2024_rewards_physical_aegis_desc": "Füllen Sie das Ägis-förmige Loch in Ihrem Regal und Herzen mit einer Replik der berühmten Trophäe der Champions, hergestellt aus einer Nickellegierung im Maßstab 1:5.",
  "international2024_rewards_hud_title": "HUD zu The International 2024",
  "international2024_rewards_hud_desc": "Verleihen Sie Ihrer Benutzeroberfläche im Spiel den Flair des Zirkus. Das HUD wurde in Anlehnung an das diesjährige TI-Thema gestaltet.",
  "international2024_rewards_versus_title": "Versus-Bildschirm 2024",
  "international2024_rewards_stickers_title": "Spieler- und Teamaufkleber",
  "international2024_rewards_loading_screens_title": "Ladebildschirme",
  "international2024_rewards_materials_title": "Power-Ups für Fantasy und Bingo",
  "international2024_rewards_effigy_title": "Statuenblock 2024",
  "international2024_supporters_clubs_title": "Unterstützung der Community",
  "international2024_supporters_clubs_subtitle": "Unterstützerpakete für Talente und Teams",
  "international2024_supporters_clubs_intro": "„Geschätzte Wohltäter! Philanthropen jeden Alters! Bescheidene Förderer der Kunst des Tötens und des Folterns! 50 % eurer großzügigen Spenden fließen direkt an eure Lieblingsteams und Lieblingstalente! Wer sind hier also die wahren Helden? Nur ich, natürlich! Aber ich applaudiere EUCH mit meinen riesigen heldenhaften Händen!“",
  "international2024_supporters_clubs_tiers_title": "Fanclubs für Teams",
  "international2024_supporters_clubs_tiers_desc": "Zeigen Sie Ihre Unterstützung für Ihre Lieblingsteams mittels Bronze-, Silber- oder Goldstufe und erhalten Sie Belohnungen, die von den Teams selbst entworfen wurden.",
  "international2024_talent_tiers_title": "Talentaufkleberpakete",
  "international2024_talent_tiers_desc": "Kaufen Sie Belohnungspakete Ihres Lieblingstalents. Die Pakete enthalten je nach Stufe des gekauften Pakets eine Kombination aus Aufklebern, Chatradsprüchen und Autogrammen.",
  "ti13_compendium_small_header": "Turnier unterstützen",
  "ti13_compendium_header": "Kompendium zu The International 2024",
  "ti13_compendium_desc": "Das Kompendium ist Ihr digitaler Begleiter während The International und dient als zentrale Anlaufstelle für eventbezogene Aktivitäten, Herausforderungen und alle Belohnungen rund um das diesjährige Turnier. Außerdem fließen 25 % aller Erlöse aus dem Verkauf in das Preisgeld von The International 2024 ein.",
  "ti13_compendium_bp_btn": "Website besuchen",
  "ti13_compendium_standard": "Standard-Kompendium",
  "ti13_compendium_standard_subtitle": "Alle Funktionen und Aktivitäten",
  "ti13_compendium_upgraded": "Aufgewertetes Kompendium",
  "ti13_compendium_upgraded_subtitle": "Alle Funktionen und Aktivitäten plus schnellere Belohnungen",
  "ti13_compendium_purchase_tp_fx": "Teleportationseffekt zu TI 2024 (Level 1)",
  "ti13_compendium_purchase_boosters_footnote": "Booster können zusätzliche Inhalte Ihrer Wahl freischalten.",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Booster können das HUD zu The International 2024 oder zusätzliche Inhalte Ihrer Wahl freischalten.",
  "ti13_compendium_purchase_levels": "%1$s Kompendium-Level",
  "ti13_compendium_purchase_booster_levels": "%1$s Booster",
  "ti13_compendium_purchase_discount": "Sparen Sie %1$s % auf Level",
  "ti13_compendium_purchase_earn_the_following": "Kompendium-Level schalten frei:",
  "ti13_compendium_purchase_all_access": "Zugriff auf alle Funktionen des Kompendiums",
  "ti13_compendium_purchase_aegis_emoticon": "Ägis-Emoticon",
  "ti13_compendium_purchase_bingo_tokens": "%1$s Bingomarken",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s Würfelmarken (Fantasy)",
  "ti13_compendium_purchase_one_player_sticker": "1 Spieleraufkleberkapsel",
  "ti13_compendium_purchase_player_stickers": "%1$s Spieleraufkleberkapseln",
  "ti13_compendium_purchase_team_stickers": "%1$s Teamaufkleberkapseln",
  "ti13_compendium_purchase_effigy_blocks": "%1$s Statuenblöcke (TI 2024)",
  "international2024_tournament_learn_more": "Weitere Informationen zum Turnier",
  "ringmaster_abilities_heading": "Fähigkeiten",
  "ringmaster_souvenirs_heading": "Souvenirs",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster lässt sich selbst oder einen verbündeten Helden in einer beweglichen, außerdimensionalen Kiste verschwinden. Helden in der Kiste können sich durch Einheiten hindurchbewegen und erhalten Verlangsamungsresistenz, Bonusmagieresistenz und Bonusbewegungstempo. Außerdem können diese nicht anvisiert, geknebelt, verstummt und entwaffnet werden. Die Kiste öffnet sich, nachdem die Wirkungsdauer abgelaufen ist oder wenn sich der Held aus dem Wirkungsbereich bewegt.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster wirft einen seiner Dolche mit höchster Präzision in die Richtung seiner Wahl. Wenn er einen Gegner trifft, fügt der Dolch Aufprallschaden zu, verlangsamt die getroffene Einheit für kurze Zeit und lässt diese einen Prozentsatz ihrer max. Lebenspunkte als Schaden pro Sekunde erleiden.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster rollt das Rad der Wunder zum Zielort, wobei Gegner auf dessen Weg zur Seite gestoßen werden. Nachdem das Rad seinen Zielort erreicht hat, erleiden Gegner im Wirkungsbereich kontinuierlich Schaden und werden verlangsamt. Gegner, die dem Rad länger als 0,5 Sekunden zugewandt sind, werden hypnotisiert und zu diesem herangezogen. Der erste hypnotisierte Gegner löst einen Timer aus, der das Rad explodieren lässt. Falls der Timer nicht ausgelöst wird, explodiert das Rad automatisch nach 8 Sekunden.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster lässt ein Scheinwerferlicht über einen Bereich wandern. Vom Licht erfasste Gegner verfehlen ihre Angriffe mit einer bestimmten Chance und werden aufgedeckt, falls sie unsichtbar waren. Vom Licht erfasste Illusionen schwinden dahin und erleiden einen Prozentsatz ihrer max. Lebenspunkte als Schaden pro Sekunde.",
  "ringmaster_ability_dark_carnival_trinkets": "Direktor des Dunklen Zirkus",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Immer wenn ein gegnerischer Held in der Nähe von Ringmaster stirbt, erhält er ein zufälliges Souvenir des Dunklen Zirkus mit einmaliger Anwendung. Falls weitere Helden sterben und Ringmaster das Souvenir noch nicht benutzt hat, erhält er zusätzliche Aufladungen. Falls Ringmaster beim Wiedereinstieg kein Souvenir besitzt, wird ihm eines gewährt. Zu den Souvenirs des Dunklen Zirkus gehören der Zerrspiegel, das Muskelmann-Tonikum und das Furzkissen.",
  "ringmaster_ability_funhouse_mirror": "Zerrspiegel",
  "ringmaster_ability_funhouse_mirror_Description": "Benutzen: Optische Täuschung\\n\\nErschafft 1 unvollkommene Illusion des Anwenders, die für 18 Sekunden bestehen bleibt. Diese Illusion fügt 28 % des Schadens zu, erleidet aber auch 300 % des Schadens.",
  "ringmaster_ability_whoopee_cushion": "Furzkissen",
  "ringmaster_ability_whoopee_cushion_Description": "Benutzen: Maleur\\n\\nStößt den Anwender 400 Einheiten nach vorne. Hinterlässt für 3 Sekunden eine Stinkwolke mit einem Radius von 200 Einheiten, die Gegner um 30 % verlangsamt.",
  "ringmaster_ability_strongman_tonic": "Muskelmann-Tonikum"
}