// 7092.js

{
  "language": "portuguese",
  "ringmastercomic_title_cover": "Olhar para o Boneco - Capa",
  "ringmastercomic_title": "Olhar para o Boneco - Página %1$s",
  "ringmastercomic_help_text": "Clica na imagem ou usa a barra de espaços para avançar",
  "ringmastercomic_return_button": "Voltar à página da capa",
  "ti13_online": "Copenhaga",
  "ti13_main_event_venue": "Royal Arena - Copenhaga",
  "ti13_best_of_three": "Melhor de 3",
  "ti13_best_of_five": "Melhor de 5",
  "ti13_group_stage_sp_rules": "Fase de Grupos - Regras de prioridade de seleção",
  "ti13_group_stage_sp_game1": "Lançamento de moeda.",
  "ti13_group_stage_sp_game2": "Primeira partida: a equipa que ganhar no lançamento de moeda escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_group_stage_sp_game3": "Segunda partida: a equipa que perder no lançamento de moeda escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_group_stage_sp_game4": "Terceira partida (se aplicável): novo lançamento de moeda. A equipa que ganhar no lançamento de moeda escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_group_stage_tie_rules": "Fase de Grupos - Regras de desempate",
  "ti13_first_second_tie": "Duas equipas estão empatadas pelo 1.º e 2.º lugar",
  "ti13_second_third_tie": "Duas equipas estão empatadas pelo 2.º e 3.º lugar",
  "ti13_third_fourth_tie": "Duas equipas estão empatadas pelo 3.º e 4.º lugar",
  "ti13_three_way_first_tie": "Três equipas estão empatadas pelo 1.º lugar",
  "ti13_three_way_second_tie": "Três equipas estão empatadas pelo 2.º lugar",
  "ti13_four_way_tie": "Quatro equipas estão empatadas pelo 1.º lugar",
  "ti13_tie_resolve_bo3": "Empate resolvido com uma série \"melhor de 3\".",
  "ti13_tie_resolve_third_fourth": "Mais nenhuma partida será jogada. As duas equipas continuam empatadas pelo 3.º e 4.º lugar.",
  "ti13_tie_resolve_first_with_round_robin": "O 1.º lugar é determinado ao jogar uma série \"melhor de 1\" no formato \"round robin\" até que uma equipa vença duas vezes.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Partidas serão jogadas até que todas as equipas tenham jogado umas contra as outras pelo menos uma vez. São usados os resultados das partidas mais recentes da série \"round robin\" para determinar o 2.º e 3.º lugar.",
  "ti13_tie_resolve_second_with_round_robin": "O 2.º lugar é determinado ao jogar uma série \"melhor de 1\" no formato \"round robin\" até que uma equipa vença duas vezes.",
  "ti13_tie_resolve_third_fourth_other": "Mais nenhuma partida será jogada. As duas outras equipas continuam empatadas pelo 3.º e 4.º lugar.",
  "ti13_tie_resolve_four_way_1": "As equipas são emparelhadas aleatoriamente. Para efeitos do presente regulamento, chamaremos estas equipas de Equipa A, Equipa B, Equipa C e Equipa D.",
  "ti13_tie_resolve_four_way_2": "A Equipa A joga contra a Equipa B numa série \"melhor de 1\". A Equipa C joga contra a Equipa D numa série \"melhor de 1\".",
  "ti13_tie_resolve_four_way_3": "O 1.º lugar é determinado ao jogar uma partida \"melhor de 1\" entre a equipa vencedora da partida entre A/B e a equipa vencedora da partida entre C/D.",
  "ti13_tie_resolve_four_way_4": "O 4.º lugar é determinado ao jogar uma partida \"melhor de 1\" entre a equipa que perdeu a partida entre A/B e a equipa que perdeu a partida entre C/D.",
  "ti13_tie_resolve_four_way_5": "O 2.º e 3.º lugar são determinados ao jogar uma partida \"melhor de 1\" entre as equipas restantes.",
  "ti13_seeding_decider_sp_rules": "Decisão de distribuição - Regras de prioridade de seleção",
  "ti13_seeding_decider_sp_rules_1": "Primeira partida: a equipa com melhor desempenho na Fase de Grupos escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_seeding_decider_sp_rules_2": "Segunda partida: a equipa com pior desempenho na Fase de Grupos escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_seeding_decider_sp_rules_3": "Terceira partida (se aplicável): a equipa com melhor desempenho na Fase de Grupos escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules": "Playoffs e International - Regras de prioridade de seleção",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Lançamento de moeda.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Primeira partida: a equipa que ganhar no lançamento de moeda escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Segunda partida: a equipa que perder no lançamento de moeda escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Terceira partida (se aplicável): novo lançamento de moeda. A equipa que ganhar no lançamento de moeda escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Primeira partida: a equipa vencedora no Grupo Superior escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Segunda partida: a equipa vencedora no Grupo Inferior escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Terceira partida: a equipa vencedora no Grupo Superior escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Quarta partida (se aplicável): a equipa vencedora no Grupo Inferior escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Quinta partida (se aplicável): lançamento de moeda. A equipa que ganhar no lançamento de moeda escolhe entre definir a ordem na fase de seleção de heróis ou o lado do mapa.",
  "international2024_update_title": "TI 2024, Ringmaster e Compêndio",
  "ringmaster_hype": "\"Liches e Linas, Slarks e Marcis, vítimas de todas as idades! O momento por que todos esperavam finalmente chegou.\\n\\n Durante praticamente um ano, não tenho sido nada mais do que um nome: mencionado em sussurros silenciosos, como uma sombra sorrateira atrás da cortina carmesim. Mas agora, finalmente (já não era sem tempo), os imbecis responsáveis por esta turné ganharam o bom senso de me deixar abençoar o público com o meu esplendor e subir ao palco com toda a minha humildade! Sim, sou eu, Cogliostro Kettle: o maestro malévolo! O malabarista macabro dos malditos! O único e incomparável RINGMASTER! E acreditem, eu tenho uns truques na manga!\"",
  "ringmaster_comic": "\"Mas não precisam de acreditar em mim! Podem ler a história sobre as minhas origens trágicas, contada por um narrador anónimo absolutamente fidedigno!\"",
  "ringmaster_comic_title": "Olhar para o Boneco",
  "ringmaster_comic_desc": "Fica a conhecer os bons velhos tempos de turnés do Ringmaster com o Circo Mecânico de Osbert Kettle.",
  "ringmaster_guide": "\"Foi-me pedido que vos guiasse pelo Compêndio deste ano; uma proposta que aceitei de bom grado. Afinal, temos de nos conhecer melhor! [b]Vamos começar?[/b]\"",
  "ringmaster_introducing": "O Dota 2 apresenta:",
  "ringmaster_hero_detail_button": "Vê a página de detalhes do herói",
  "ringmaster_play_trailer_button": "Ver trailer",
  "ringmaster_comic_button": "Lê a história",
  "international2024_compendium": "Compêndio",
  "international2024_compendium_title": "Compêndio do International 2024",
  "international2024_effigies_title": "EFÍGIES POR HERÓI",
  "international2024_effigies_subtitle": "Funcionalidade melhorada, grátis para todos",
  "international2024_effigies_intro": "\"Houve uma altura, meus amigos, não muito tempo atrás, em que era raro ver estas efígies grandiosas! Não mais! Agora há um monumento à espera de todos os titãs prestes a entrar no campo de batalha, sejam eles o Ringmaster ou todos os outros heróis de menor importância!\"",
  "international2024_effigies_desc": "As Efígies são estátuas dos teus heróis favoritos, com poses personalizáveis, que podem ser exibidas na tua base. Agora, em vez de Efígies serem equipadas num único compartimento global, cada herói tem um compartimento separado para uma Efígie no menu de equipamento no Arsenal.\\n\\nPodes usar a Efígie padrão para qualquer herói ou podes criar e equipar uma personalizada.",
  "international2024_purchase_intro": "\"Deuses e monstros, creeps e criaturas, venham todos e regalem os vossos olhos sortudos com [b]a coleção mais incrível de jogos, eventos e recompensas de esports[/b] deste lado do rio! Testem a vossa perspicácia, sorte e coragem numa comemoração do maior evento de esports nesta ou em qualquer outra dimensão!\"",
  "international2024_activities": "EIS O QUE TE ESPERA",
  "international2024_activities_subtitle": "Jogos de azar, façanhas de habilidade e regalos para todas as idades ",
  "international2024_activities_intro": "\"Ouvi dizer que alguns de vocês precisam de uma RAZÃO para matar, ao contrário do vosso mestre de cerimónias mentalmente estável. Então, cada partida que jogarem irá conceder-vos pontos! Quanto mais jogarem, mais pontos irão ganhar! Por isso, atirem-se já para as lanes e vejam esses pontos a acumular!\"",
  "international2024_activities_play_title": "Joga Dota, ganha pontos",
  "international2024_activities_play_desc": "Este ano, ganharás pontos por quase todas as partidas que jogares através do Desafio Semanal. Também irás ganhar pontos adicionais pela tua primeira vitória de cada dia.",
  "international2024_activities_fantasy_title": "Dota de Sonho",
  "international2024_activities_fantasy_desc": "Compete com os teus amigos e os jogadores de Dota do mundo inteiro. Forma o melhor plantel de sonho com os teus jogadores profissionais favoritos e cria cartas personalizadas com atributos que resultam em mais pontos.",
  "international2024_activities_oracles_title": "Desafio do Oracle",
  "international2024_activities_oracles_desc": "Tenta prever as equipas que irão avançar e delicia-te com a precisão dos teus prognósticos (se acertares, claro).",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Recebe um cartão de bingo gerado aleatoriamente para cada fase do torneio. Cada quadrado do cartão contém uma condição estranha ou uma situação interessante.",
  "international2024_activities_outro": "\"Lembrem-se! Ganhar não é tudo! Sempre que forem bem-sucedidos numa destas atividades, receberão pontos! Vamos agora ver aqui na Barraca dos Prémios o que podem fazer com esses pontos, sim?\"",
  "international2024_rewards_title": "Recompensas do Compêndio",
  "international2024_rewards_subtitle": "Mais uma fichinha, mais uma voltinha",
  "international2024_rewards_intro": "\"Empilhem corpos e ganhem prémios! E QUE prémios, meus amigos! Não, não me refiro a ter as vossas mãos à volta de um pescoço, a ver a vida a escorrer dos olhos de um herói desgraçado. Só isso já é uma recompensa à parte! Mas não, o que vocês querem é ISTO!\"",
  "international2024_rewards_physical_aegis_title": "Modelo físico da Égide",
  "international2024_rewards_physical_aegis_desc": "Uma réplica em liga de níquel à escala de 1:5 do famoso prémio dos campeões, pronta a decorar a tua prateleira.",
  "international2024_rewards_hud_title": "Tema de HUD - The International 2024",
  "international2024_rewards_hud_desc": "Enfeita a interface das tuas partidas com o espírito do circo, o tema do TI deste ano.",
  "international2024_rewards_versus_title": "Ecrã Versus 2024",
  "international2024_rewards_versus_desc": "Revigoriza o teu espírito de luta antes de qualquer partida com um novo Ecrã Versus que exibe a Efígie, que agora pode ser equipada em cada herói.",
  "international2024_rewards_chat_wheels_title": "Sons da Chat Wheel permanentes",
  "international2024_rewards_stickers_title": "Autocolantes dos jogadores e das equipas",
  "international2024_rewards_loading_screens_title": "Ecrãs de Loading",
  "international2024_rewards_materials_title": "Powerups do Dota de Sonho e do Bingo",
  "international2024_rewards_teleport_fx_title": "Efeitos de teletransporte da equipa favorita",
  "international2024_rewards_effigy_title": "Bloco de Efígie 2024",
  "international2024_supporters_clubs_title": "Apoia a comunidade",
  "international2024_supporters_clubs_subtitle": "Pacotes de Claques e de Talentos",
  "international2024_supporters_clubs_intro": "\"Estimados benfeitores! Filantropos de todas as idades! Humildes patrocinadores da arte da matança e de todas as artes relacionadas! 50% da vossa magnânima munificência reverte diretamente a favor das equipas e talentos! Quem é o verdadeiro herói aqui? Eu, obviamente! Enquanto aplaudo o VOSSO apoio com as minhas mãos hiperbolicamente heroicas!\"",
  "international2024_supporters_clubs_tiers_title": "Claques de equipas",
  "international2024_supporters_clubs_tiers_desc": "Escolhe o patamar de Bronze, Prata ou Ouro da Claque das tuas equipas favoritas para ganhares recompensas criadas por essas organizações.",
  "international2024_talent_tiers_title": "Pacotes de autocolantes de talentos",
  "international2024_talent_tiers_desc": "Compra pacotes de recompensas dos teus talentos favoritos, que contêm autocolantes, mensagens de voz e autógrafos dependendo do patamar comprado.",
  "ti13_compendium_small_header": "Apoia o torneio",
  "ti13_compendium_header": "Compêndio do International 2024",
  "ti13_compendium_desc": "O Compêndio é o teu companheiro digital interativo para o International. É uma central de atividades, desafios e todas as recompensas relacionadas com o evento deste ano. Além disso, 25% dos lucros de todas as vendas irão contribuir para o prémio total do International 2024.",
  "ti13_compendium_bp_btn": "Visitar site",
  "ti13_compendium_standard": "Compêndio Básico",
  "ti13_compendium_standard_subtitle": "Todas as funcionalidades e atividades",
  "ti13_compendium_upgraded": "Compêndio Melhorado",
  "ti13_compendium_upgraded_subtitle": "Todas as funcionalidades e atividades, com acesso mais rápido a recompensas",
  "ti13_compendium_purchase_tp_fx": "Efeito de teletransporte do International 2024 (Nível 1)",
  "ti13_compendium_purchase_boosters_footnote": "Boosters podem desbloquear conteúdo adicional à tua escolha",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Boosters podem desbloquear o tema de HUD do International 2024 ou conteúdo adicional à tua escolha",
  "ti13_compendium_purchase_levels": "%1$s níveis para o Compêndio",
  "ti13_compendium_purchase_booster_levels": "%1$s boosters",
  "ti13_compendium_purchase_discount": "Poupa %1$s% em níveis",
  "ti13_compendium_purchase_earn_the_following": "Os níveis do Compêndio irão desbloquear:",
  "ti13_compendium_contribution": "25% dos lucros de todas as vendas irão contribuir para o prémio total do International 2024.",
  "ti13_compendium_purchase_all_access": "Acesso a todas as funcionalidades do Compêndio",
  "ti13_compendium_purchase_aegis_emoticon": "Emoticon - Aegis",
  "ti13_compendium_purchase_bingo_tokens": "%1$s fichas do Bingo",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s Fichas de Renovação (Dota de Sonho)",
  "ti13_compendium_purchase_one_player_sticker": "1 Cápsula de Autocolantes de Jogadores",
  "ti13_compendium_purchase_player_stickers": "%1$s Cápsulas de Autocolantes de Jogadores",
  "ti13_compendium_purchase_team_stickers": "%1$s Cápsulas de Autocolantes de Equipas",
  "ti13_compendium_purchase_effigy_blocks": "%1$s Blocos de Efígie do TI 2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s Tesouros com Ecrãs de Loading de Equipas",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s Tesouros com Ecrãs de Loading do TI",
  "international2024_tournament_learn_more": "Fica a saber mais sobre o torneio",
  "ringmaster_abilities_heading": "Habilidades",
  "ringmaster_souvenirs_heading": "Souvenirs",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "REQUER CONCENTRAÇÃO - Após uma breve concentração, Ringmaster bate com um chicote numa área. Os inimigos chicoteados sofrem dano e fogem do Ringmaster, aterrorizados. Quanto mais longo for o tempo de concentração, maior será o dano e a duração do estado aterrorizado, mas o raio será reduzido.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Fecha um herói aliado numa caixa móvel extradimensional. Enquanto o aliado estiver na caixa, este poderá deslocar-se através de unidades e obstáculos, além de receber mais resistência a magia, resistência a abrandamentos e um bónus de rapidez de movimento. O aliado também estará inselecionável, emudecido, silenciado e desarmado. O aliado irá surgir da caixa assim que o efeito terminar ou se sair da área.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster lança um punhal numa direção específica. Se um inimigo for atingido, o punhal causa dano no impacto, abrandando o alvo por breves momentos e causa dano por segundo igual a uma percentagem do máximo de vida do alvo.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster rola uma roda para o local selecionado, empurrando inimigos no caminho. Assim que a roda chegar ao destino, todos os inimigos por perto irão sofrer dano ao longo do tempo e serão abrandados. Os inimigos virados para a roda durante mais de 0,5 segundos ficarão mesmerizados e serão atraídos para a roda. O primeiro inimigo mesmerizado dará início a uma contagem decrescente de autodestruição da roda. Se a contagem decrescente não for iniciada, a roda irá explodir automaticamente após 8 segundos.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Invoca as luzes da ribalta numa área. Inimigos iluminados pela luz terão uma probabilidade de falhar ataques e, se estiverem invisíveis, serão revelados. Ilusões atingidas pela luz irão perder uma percentagem da sua vida máxima por segundo, até desaparecerem.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Sempre que um herói inimigo morrer perto do Ringmaster, este recebe um Souvenir aleatório, que só pode ser usado uma vez. Se o Ringmaster já tiver um, Souvenirs adicionais serão convertidos em cargas. Ringmaster recebe um Souvenir se não tiver um quando reentrar em jogo. Souvenirs possíveis: Funhouse Mirror, Strongman Tonic e Whoopee Cushion.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Uso: Proportion Distortion\\n\\nCria 1 cópia imperfeita do teu herói que dura 18 segundos. A ilusão causa 28% e sofre 300% do dano.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Uso: Whoopsie\\n\\nLança o teu herói 400 unidades para a frente. Deixa para trás uma nuvem de gás com um raio de 200 unidades, durante 3 segundos, que abranda inimigos em 30%.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic"
}