// 6987.js

{
  "language": "polish",
  "international2023_compendium_activity": "Zadania dla posiadaczy Kompendium",
  "international2023_update_title": "Świętowanie The International 2023",
  "international2023_update_subtitle": "Od fanatyków zawodowej sceny aż po amatorskich graczy – ta e-sportowa aktualizacja ma w sobie coś dla każdego.",
  "international2023_update_body": "Niezależnie od tego, czy łapczywie chłoniecie każdą trzymającą w napięciu minutę każdego meczu The International, czy ledwo zdajecie sobie sprawę z tego, że ludzie żyją z grania w tę grę i po prostu chcecie w spokoju cieszyć się waszymi meczami, to czytajcie dalej: ta aktualizacja ma w sobie coś dla każdego.\\n\\nJesteście fanatykami e-sportu? Stwórzcie własny skład zawodowców ze zaktualizowaną <b>ligą marzeń.</b> Może bardziej kręci was analityka? Przejdźcie do typowania drabinki w <b>Wyzwaniu Wyroczni</b>. A może jesteście wielkimi fanami gier, w które grała wasza cioteczna babcia. Cóż, w tym roku mamy nawet <b>bingo</b>!\\n\\nA może po prostu nic z tych rzeczy was nie interesuje. Może jesteście zagorzałymi fanami samych siebie. Mamy też coś i dla was: <b>gablotę profilu</b>. Wasz profil jest teraz interaktywnym pomnikiem waszych osób przedstawiającym wszystkie przedmioty i osiągnięcia z waszej historii gry, które chcecie tam umieścić.",
  "international2023_update_footer": "Dotarliście do końca aktualizacji. Świetna robota!",
  "international2023_compendium": "Kompendium",
  "international2023_compendium_title": "Kompendium The International 2023",
  "international2023_compendium_intro": "Kompendium jest waszym interaktywnym cyfrowym towarzyszem Drogi do The International 2023 i samego The International 2023. \\n\\nGrajcie jak zawodowcy w ramach Wyzwania Drogi do The International. Wybierzcie ulubionych graczy dzięki przerobionej i zaktualizowanej lidze marzeń. Sprawdźcie swoje umiejętności przewidywania w typowaniu fazy grupowej i drabinki. Zagarnijcie nagrody dzięki zupełnie nowym kartom do bingo.\\n\\nTraktujcie Kompendium jako uniwersalne miejsce, gdzie znajdziecie wszystkie zadania, wyzwania i nagrody związane z tegorocznym wydarzeniem. Ponadto 25% zysków ze sprzedaży trafia do puli nagród The International 2023.",
  "international2023_showcase_title": "Gablota profilu",
  "international2023_showcase_subtitle": "Nowa funkcja dla wszystkich graczy Dota 2",
  "international2023_showcase_intro": "Profil i miniprofil zostały zaprojektowane całkowicie od nowa dla wszystkich (no prawie dla wszystkich, dla 98% z was, którzy mieli oceny zachowania i komunikacji powyżej 6000). Teraz możecie się pochwalić swoimi przedmiotami i osiągnięciami w Dota 2 – dosłownie wszystkim z waszego ekwipunku w Dota 2 – dzięki nowej gablocie profilu.\\n\\nChcecie utworzyć kapliczkę poświęconą waszej ulubionej zawodowej drużynie z 2016 roku? Proszę bardzo. Co powiecie na kolekcję zestawów dla waszych ulubionych bohaterów? Nic nie stoi na przeszkodzie. Jeden but z każdej możliwej pary butów Kunkki? Niestety, tak. Technicznie też jest to możliwe.",
  "international2023_showcase_profile_title": "Zaktualizowany profil",
  "international2023_showcase_profile_desc": "Jesteście Michałem Aniołem, profil to od teraz wasze płótno, a ogranicza was jedynie własna wyobraźnia (i elementarne poczucie ludzkiej przyzwoitości).",
  "international2023_showcase_mini_profile_title": "Zaktualizowany miniprofil",
  "international2023_showcase_mini_profile_desc": "Miniprofile bardzo przypominają profile, ale z jedną istotną różnicą – trzymajcie się – są mniejsze. Inni gracze zobaczą wasze miniprofile przy każdym najechaniu kursorem na wasze pseudonimy.",
  "international2023_showcase_carousel_title": "Przykładowe gabloty",
  "international2023_showcase_items_title": "Przedmioty gabloty",
  "international2023_showcase_items_desc": "Dostosujcie swoje gabloty za pomocą ogromnego zbioru wszystkich przedmiotów i nagród, które udało wam się zgromadzić przez lata.",
  "international2023_showcase_item_heroes_title": "Bohaterowie",
  "international2023_showcase_item_trophies_title": "Trofea",
  "international2023_showcase_item_stickers_title": "Naklejki",
  "international2023_showcase_item_stats_title": "Statystyki",
  "international2023_showcase_item_chat_wheels_title": "Koła czatu",
  "international2023_showcase_item_sprays_title": "Spraye",
  "international2023_showcase_item_items_title": "Przedmioty ze zbrojowni",
  "international2023_showcase_item_emoticons_title": "Emotikony",
  "international2023_showcase_item_loading_screens_title": "Ekrany ładowania",
  "international2023_showcase_item_couriers_title": "Kurierzy",
  "international2023_showcase_item_wards_title": "Wardy",
  "international2023_tournament_prize_pool": "Pula nagród",
  "international2023_tournament_prize_pool_percent": "25% wszystkich zysków ze sprzedaży Kompendium The International 2023 trafi do puli nagród The International 2023.",
  "international2023_tournament_learn_more": "Dowiedzcie się więcej o turnieju",
  "international2023_quests_title": "Wyzwanie Drogi do The International",
  "international2023_quests_intro": "Oglądaliście profesjonalistów. Kibicowaliście im. Teraz grajcie jak jeden z nich. Rozsiądźcie się na krześle gamingowym swoich ulubionych zawodowych graczy e-sportowych i odtwórzcie ich najlepsze chwile z ostatniego roku. Wygrajcie jako ich bohaterowie z konkretnego meczu lub jako jeden z pięciu bohaterów, których używali w danym miesiącu sezonu. Zbierajcie punkty za każde wyzwanie i dodatkowe punkty za ukończenie pełnych zestawów wyzwań.",
  "international2023_quests_match_title": "Wyzwania meczu",
  "international2023_quests_match_desc": "Wygrajcie za pomocą bohaterów z rzeczywistego meczu rozegranego przez zawodowca.",
  "international2023_quests_pro_title": "Wyzwania gracza",
  "international2023_quests_pro_desc": "Wygrajcie jako jeden z najczęściej wybieranych przez zawodowca bohaterów.",
  "international2023_quests_rewards_title": "Zdobywajcie nagrody",
  "international2023_quests_rewards_desc": "Wzmocnijcie swoją linię nagród za pomocą zdobytych po drodze punktów Kompendium.",
  "international2023_fantasy_title": "Ewolucja ligi marzeń",
  "international2023_fantasy_intro": "Wybierzcie drużynę waszych ulubionych zawodowców. Zdecydujcie, które statystyki będą dla was najcenniejsze. Rywalizujcie z graczami z całego świata, by zdobyć jak najwięcej punktów. Oto liga marzeń Dota, którą dobrze znacie, ale ulepszona pod każdym względem.",
  "international2023_fantasy_players_title": "Wybierajcie",
  "international2023_fantasy_players_desc": "Wybierzcie ulubionych graczy głównych, środka i wsparcia.",
  "international2023_fantasy_craft_title": "Wytwarzajcie",
  "international2023_fantasy_craft_desc": "Użyjcie przelosowań zdobytych razem z nagrodami Kompendium, by spróbować wytworzyć najlepsze statystyki dla swoich zawodników. Wybierajcie rozważnie – niektóre statystyki są lepsze na jednych graczach niż innych.",
  "international2023_fantasy_compete_title": "Rywalizujcie",
  "international2023_fantasy_compete_desc": "Każdy weekend turnieju to osobna runda ligi marzeń, dzięki czemu będziecie mieli wiele szans, by rywalizować ze znajomymi i ze światem. Zdobywajcie punkty Kompendium i – jeśli wasza pozycja w rankingu będzie wystarczająco wysoka – jedyne w swoim rodzaju trofeum.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Czy przeszywa was dreszczyk emocji za każdym razem, gdy zawodowa drużyna kupuje Divine Rapiera? Albo gdy mecz trwa ponad 80 minut i wszystko przybiera dość dziwny charakter? A co powiecie na to, gdy drużyna bohaterów o łącznej liczbie 16 nóg walczy z drużyną mającą tylko 4?\\n\\nCóż, przygotujcie się, by w końcu spieniężyć tę ekscytację. Po to mamy bingo, by pozwolić wam zyskać na naprawdę szalonych wydarzeniach.",
  "international2023_bingo_cards_title": "JEDNA KARTA DO BINGO NA WEEKEND",
  "international2023_bingo_cards_desc": "Wszyscy posiadacze Kompendium otrzymają nową losowo wygenerowaną kartę do bingo na każdy weekend turnieju. Ta karta jest pełna kwadratów z dziwnymi warunkami i ciekawymi sytuacjami, za które możecie trzymać kciuki, by się wydarzyły, podczas gdy zawodowcy będą rywalizować.",
  "international2023_bingo_rewards_title": "Wypełniajcie rzędy i zdobywajcie punkty",
  "international2023_bingo_rewards_desc": "Zgadza się – nie dajcie się zwieść bogom, demonom ani narwanym leśnym stworzeniom, to wciąż tylko bingo, ludzie. Gdy odznaczycie rząd w poziomie, pionie lub po przekątnej na naszej karcie do bingo, to w nagrodę otrzymacie punkty Kompendium. Uwaga: krzyczenie „BINGO” jest opcjonalne, ale gorąco do niego zachęcamy.",
  "international2023_predictions_title": "Wyzwanie Wyroczni",
  "international2023_predictions_intro": "Wyrocznia korzysta z astralnej magii pępkowej, by zajrzeć w przyszłość. Cóż, nie chcemy was dołować, ale nie ma czegoś takiego jak magia oparta na pępku. Będziecie musieli użyć swojego sprytu, wiedzy z zakresu e-sportu i, co najważniejsze, swoich najlepszych domysłów, aby odwalić robotę.\\n\\nPrzewidujcie jak Wyrocznia (ale bez żadnych pępków), które drużyny awansują, a które pospadają z tabeli wyników podczas każdego weekendowego turnieju. Próby odgadnięcia przyszłości zakończone sukcesem (znaczy wieszczenia niczym Wyrocznia) przyznają wam punkty Kompendium.",
  "international2023_predictions_group_stage_title": "Typujcie w fazie grupowej",
  "international2023_predictions_group_stage_desc": "Jako nowość w tym roku spróbujcie przewidzieć kolejność drużyn w każdej grupie.",
  "international2023_predictions_ingame_title": "Typowania w grze",
  "international2023_predictions_ingame_desc": "Podczas oglądania w grze lub na Twitchu przetestujcie swoją moc przepowiadania, nim rozbrzmi sygnał na rozpoczęcie każdego meczu. Za każde poprawne typowanie otrzymacie punkty Kompendium (maksymalnie 6 dziennie).",
  "international2023_rewards_title": "Nagrody Kompendium",
  "international2023_rewards_intro": "Jeśli jesteście fanami rywalizacyjnej rozgrywki w Dota 2 i otrzymywania nagród z tej racji, to tegoroczne nagrody są dla was. Kompendium 2023 jest w całości skupione na The International 2023 oraz zawodowej scenie Dota 2.",
  "international2023_rewards_physical_aegis_title": "Fizyczny model Egidy",
  "international2023_rewards_physical_aegis_desc": "Replika słynnej nagrody dla mistrzów w skali 1:5 wykonana ze stopu niklu. Eksponujcie ją z dumą! Eksponujcie ją bez zobowiązań! Przetopcie ją i stwórzcie z niej własną walutę!",
  "international2023_rewards_chat_wheels_title": "Niewygasające koła czatu",
  "international2023_rewards_chat_wheels_desc": "W przeciwieństwie do poprzednich lat żadne koła czatu teraz nie wygasają. Tak jak w tytule. Tak, ten tekst wydaje się trochę rozwleczony, ale miło jest spędzić z wami trochę więcej czasu.",
  "international2023_rewards_stickers_title": "Naklejki graczy i drużyn",
  "international2023_rewards_stickers_desc": "„Tylko naklejki drużyn?” – nie przeczytaliście nawet tytułu, prawda? Otrzymacie też naklejki graczy. Szczerze, te akapity są tu tylko po to, by treść tytułu została bezpiecznie przekazana do waszych mózgów.",
  "international2023_rewards_hud_title": "Skórka interfejsu: The International 2023",
  "international2023_rewards_hud_desc": "Ten ostatni akapit mógł odstraszyć ludzi przed przeczytaniem tego. Więc jeśli nadal tu jesteście: całkiem rozsądnie. To był test i udało wam się go zdać. Z uwagi na kilka informacji, które nie zostały zawarte w tytule: nowy interfejs ma przeznaczony specjalnie dla niego motyw przypominający witraże.",
  "international2023_rewards_loading_screens_title": "Ekrany ładowania",
  "international2023_rewards_loading_screens_desc": "Otrzymacie niestandardowy ekran ładowania z motywem witraży dla każdego zespołu, a także niektóre z kluczowych grafik z tegorocznego The International.",
  "international2023_rewards_materials_title": "Wzmocnienia ligi marzeń oraz Wyzwania Drogi do The International",
  "international2023_rewards_materials_desc": "Użyjcie niestandardowych narzędzi, aby wytworzyć graczy o lepszych statystykach w lidze marzeń lub przebijcie się przez szczególnie trudną zawartość Wyzwania Drogi do The International.",
  "international2023_rewards_teleport_fx_title": "Efekty teleportacji ulubionej drużyny",
  "international2023_rewards_teleport_fx_desc": "Pochwalcie się swoją ulubioną drużyną w grze dzięki niestandardowym efektom teleportacji na trzech różnych poziomach.",
  "international2023_rewards_Types_title": "Rodzaje nagród",
  "international2023_rewards_Types_desc": "Każdy rodzaj nagrody ma swój własny wskaźnik postępu. Po jego zapełnieniu możecie odebrać nagrodę. Niektóre z tych wskaźników można zapełniać dowolną liczbę razy, a niektóre tylko określoną.",
  "international2023_rewards_Levels_title": "Poziomy Kompendium",
  "international2023_rewards_Levels_desc": "Zdobywajcie poziomy Kompendium, biorąc udział w jego zadaniach lub poprzez zakup pakietów poziomów. Stosujcie poziomy, aby zwiększać wskaźniki postępu dla WSZYSTKICH rodzajów nagród.",
  "international2023_rewards_Boosters_title": "Premie",
  "international2023_rewards_Boosters_desc": "Premie są jak poziomy Kompendium, ale służą do zwiększania konkretnych pojedynczych nagród. Zastosowanie premii na nagrodzie przybliża was również do zdobycia Kolekcjonerskiej Egidy.",
  "international2023_supporters_clubs_title": "Kluby kibica",
  "international2023_supporters_clubs_subtitle": "Bezpośrednio wspierajcie swoje ulubione drużyny",
  "international2023_supporters_clubs_intro": "Nagrody klubów kibica są jak młodzieńcza radość – chwytajcie je pełnymi garściami póki możecie, bo są ulotne. A przynajmniej kiedyś były. W tym roku zostają na stałe! Od teraz mogą nieść wam radość już na zawsze! Chyba że wpadniecie pod autobus.\\n\\n A teraz coś jeszcze lepszego: 50% wszystkich zysków ze sprzedaży trafia bezpośrednio do drużyny. Cóż, jeszcze lepiej dla nich. To pierwsze jest lepsze dla was.",
  "international2023_supporters_clubs_tiers_title": "Trzy stopnie wsparcia",
  "international2023_supporters_clubs_tiers_desc": "Wybierzcie brązowy, srebrny lub złoty stopień wsparcia dla swoich ulubionych drużyn, aby zdobyć stworzone przez nie nagrody.",
  "international2023_talent_title": "Naklejki ekspertów",
  "international2023_talent_subtitle": "Bezpośrednio wspierajcie swoich ulubionych ekspertów",
  "international2023_talent_intro": "Prowadzenie transmisji e-sportowych na żywo to ciężki kawałek chleba. Oczywiście nie tak ciężki jak wydobywanie węgla. Choć cięższy niż robienie na drutach i wystawianie swoich rękodzieł na OLX. Oczywiście nie tak ciężki jak każda robótka. Ale niektóre z tych kolorowych szydełkowanych sweterków serio wyglądają na dość skomplikowane. \\n\\n Teraz możecie przekazać swojemu ulubionemu ekspertowi komunikat o treści „Ej… Szanuję twoją pracę. Co prawda trochę mniej niż pracę górnika, ale jednak bardziej niż pracę co najmniej 50% wystawiających ogłoszenia na OLX.” A skoro już mowa o 50%, to połowa wszystkich zysków ze sprzedaży naklejek ekspertów trafia prosto do nich.",
  "international2023_talent_tiers_title": "Wybierzcie swój stopień",
  "international2023_talent_tiers_desc": "Kupcie pakiety nagród z waszymi ulubionymi ekspertami w rolach głównych. W skład pakietów wchodzą naklejki, kwestie dialogowe i autografy (w zależności od stopnia zakupionego pakietu).",
  "international2023_talent_coming_soon": "Pakiety ekspertów będą dostępne w sprzedaży po zapowiedzeniu obecności danych ekspertów.",
  "international2023_coming_soon": "Już wkrótce",
  "ti12_bp_countdown_header": "Do fazy grupowej",
  "ti12_bp_countdown_desc": "Oglądajcie największy turniej e-sportowy tego roku – transmitowany na żywo z Seattle, gdzie częścią stawki jest Egida Czempionów.",
  "ti12_bp_tournament_complete_desc": "Przeżyjcie na nowo największy turniej e-sportowy tego roku. Od całej akcji z Seattle dzieli was tylko kliknięcie.",
  "ti12_group_stage_venue": "Online",
  "ti12_playoffs_venue": "Centrum Kongresowe w Seattle",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Wspierajcie turniej",
  "ti12_compendium_header": "Kompendium The International 2023",
  "ti12_compendium_desc": "Uzyskajcie jeszcze więcej z sezonu turniejowego dzięki Kompendium The International 2023. Grajcie jak zawodowcy w ramach Wyzwania Drogi do The International. Ustalcie skład złożony ze swoich ulubionych zawodowców wraz z przerobioną ligą marzeń. Sprawdźcie swoje umiejętności przewidywania w Wyzwaniu Wyroczni. I miejcie nadzieję, że drużyny zrobią coś dziwnego wraz z nową funkcją bingo.\\n\\nZdobywajcie nagrody takie jak naklejki graczy i drużyn, koła czatu, niestandardowy interfejs i nie tylko, aż po fizyczną replikę Egidy.\\n\\n25% wszystkich zysków ze sprzedaży Kompendium trafia bezpośrednio do puli nagród The International.",
  "ti12_compendium_standard": "Standardowe Kompendium",
  "ti12_compendium_upgraded": "Ulepszone Kompendium"
}