// 9888.js

{
  "language": "german",
  "international2023_compendium_activity": "Aktivität für Kompendiumbesitzer",
  "international2023_update_title": "Feierlichkeiten zu The International 2023",
  "international2023_update_subtitle": "Von bekennenden Fans der Profiszene bis hin zu Gelegenheitsspielern hat dieses E-Sport-Update für jeden etwas zu bieten.",
  "international2023_update_body": "Egal, ob Sie jede Sekunde einer jeden Partie bei The International mitfiebern, Ihnen gar nicht bewusst ist, dass andere Menschen damit ihren Lebensunterhalt verdienen, oder Sie das Spiel einfach nur in Ruhe genießen wollen – lesen Sie weiter: In diesem Update ist garantiert etwas für Sie dabei.\\n\\nSie sind ein bekennender E-Sport-Fan? Dann stellen Sie Ihren eigenen Kader aus Profis für die überarbeitete <b>Fantasy-Liga</b> zusammen. Sie sind eher ein begeisterter Analytiker? Dann tauchen Sie in <b>Oracles Herausforderung</b> ein und treffen Sie Prognosen für Begegnungen. Möglicherweise begeistern Sie Spiele, die von Ihrer Großtante geschätzt werden. Keine Angst, in diesem Jahr haben wir sogar <b>Bingo</b>!\\n\\nNatürlich kann es auch sein, dass Ihnen keine der Optionen zusagt. Vielleicht sind Sie schlicht Ihr eigener Fan. Aber auch dann haben wir etwas für Sie: <b>den Profilaussteller</b>. Ihr Profil wird nun zu einem interaktiven Denkmal Ihrer selbst, in dem Sie alle Gegenstände und Errungenschaften aus Ihrer Spielgeschichte ausstellen können, ganz wie es Ihnen beliebt.",
  "international2023_update_footer": "Sie haben es bis zum Ende des Updates geschafft. Gute Arbeit!",
  "international2023_compendium": "Kompendium",
  "international2023_compendium_title": "Kompendium zu The International 2023",
  "international2023_compendium_intro": "Das Kompendium ist Ihr digitaler Begleiter während „Der Weg zu TI“ und The International 2023.\\n\\nSpielen Sie wie ein Profi bei der Herausforderung zum Weg zu TI. Stellen Sie einen Kader Ihrer Lieblingsspieler für die überarbeitete und aktualisierte Fantasy-Herausforderung zusammen. Testen Sie Ihre Hellsicht mit Prognosen für die Gruppen- und Bracketphase. Knacken Sie den Hauptgewinn mit den brandneuen Bingokarten.\\n\\nBetrachten Sie das Kompendium als Ihre zentrale Anlaufstelle für eventbezogene Aktivitäten, Herausforderungen und alle Belohnungen rund um das diesjährige Turnier. Außerdem fließen 25 % aller Erlöse aus dem Verkauf in das Preisgeld von The International 2023 ein.",
  "international2023_showcase_title": "Der Profilaussteller",
  "international2023_showcase_subtitle": "Neue Funktion für alle Dota-Spieler",
  "international2023_showcase_intro": "Das Profil und das Miniprofil wurden für alle Spieler (also für die 98 % von Ihnen, die eine Kommunikationswertung von über 6.000 haben) komplett überarbeitet. Jetzt können Sie all Ihre Dota-Gegenstände und Errungenschaften – praktisch alles, was sich in Ihrem Dota-Arsenal befindet – im neuen Profilaussteller hervorheben.\\n\\nSie möchten einen Schrein für Ihr Lieblingsteam aus dem Jahr 2016 errichten? Kein Problem. Wie wäre es mit einer Sammlung Ihrer liebsten Heldensets? Absolut machbar. Ein Exemplar von jedem Stiefelpaar für Kunkka? Klingt schräg, aber ja. Technisch gesehen ist auch das möglich.",
  "international2023_showcase_profile_title": "Aktualisiertes Profil",
  "international2023_showcase_profile_desc": "Sie sind Michaelangelo und Ihr Profil ist jetzt Ihre Leinwand. Grenzen werden Ihnen nur durch Ihre Fantasie gesetzt. (Und durch die Regeln des Anstands.)",
  "international2023_showcase_mini_profile_title": "Aktualisiertes Miniprofil",
  "international2023_showcase_mini_profile_desc": "Miniprofile sind gewöhnlichen Profilen sehr ähnlich, mit einem entscheidenden Unterschied – Halten Sie sich fest! – sie sind kleiner, praktisch mini. Andere Spieler können Ihr Miniprofil sehen, wenn sie den Mauszeiger über Ihren Namen bewegen.",
  "international2023_showcase_carousel_title": "Beispiele für Profilaussteller",
  "international2023_showcase_items_title": "Ausstellbare Gegenstände",
  "international2023_showcase_items_desc": "Heben Sie in Ihrem Profilaussteller die riesige Sammlung von Gegenständen und Belohnungen hervor, die Sie über die Jahre gesammelt haben.",
  "international2023_showcase_item_heroes_title": "Helden",
  "international2023_showcase_item_trophies_title": "Trophäen",
  "international2023_showcase_item_stickers_title": "Aufkleber",
  "international2023_showcase_item_stats_title": "Statistiken",
  "international2023_showcase_item_chat_wheels_title": "Chatradsprüche",
  "international2023_showcase_item_sprays_title": "Graffitis",
  "international2023_showcase_item_items_title": "Arsenalgegenstände",
  "international2023_showcase_item_emoticons_title": "Emoticons",
  "international2023_showcase_item_loading_screens_title": "Ladebildschirme",
  "international2023_showcase_item_couriers_title": "Kuriere",
  "international2023_showcase_item_wards_title": "Wards",
  "international2023_tournament_prize_pool": "Preisgeld",
  "international2023_tournament_prize_pool_percent": "25 % aller Erlöse aus dem Verkauf des Kompendiums zu The International 2023 fließen in das Preisgeld von The International 2023 ein.",
  "international2023_tournament_learn_more": "Weitere Informationen zum Turnier",
  "international2023_quests_title": "Herausforderung zum Weg zu The International",
  "international2023_quests_intro": "Sie haben den Profis zugeschaut. Sie haben sie angefeuert. Und jetzt spielen Sie wie einer. Nehmen Sie Platz im Gaming-Stuhl Ihrer liebsten E-Sport-Profis und erleben Sie deren größten Momente des vergangenen Jahres aufs Neue. Gewinnen Sie mit einem ihrer Helden aus einer ganz speziellen Partie oder mit einem der fünf Helden, die sie in einem bestimmten Monat der Saison am häufigsten ausgewählt haben. Für jede Herausforderung erhalten Sie Punkte und für das Abschließen ganzer Herausforderungsreihen winken sogar Bonuspunkte.",
  "international2023_quests_match_title": "Partie-Quests",
  "international2023_quests_match_desc": "Gewinnen Sie mit Helden aus einer echten Profipartie.",
  "international2023_quests_pro_title": "Spieler-Quests",
  "international2023_quests_pro_desc": "Gewinnen Sie als einer der meistgewählten Helden eines Profis.",
  "international2023_quests_rewards_title": "Belohnungen erhalten",
  "international2023_quests_rewards_desc": "Erhalten Sie viele tolle Belohnungen, indem Sie durch Ihre Aktivitäten Kompendiumpunkte verdienen.",
  "international2023_fantasy_title": "Überarbeitetes Fantasy",
  "international2023_fantasy_intro": "Wählen Sie ein Team aus Ihren Lieblingsprofis. Stellen Sie deren Werte so zusammen, wie Sie es für besonders erfolgversprechend halten. Wetteifern Sie mit Spielern rund um den Globus um die meisten Punkte. Es ist die altbekannte Dota-Fantasy-Liga, allerdings in jeglicher Hinsicht neu gedacht.",
  "international2023_fantasy_players_title": "Auswählen",
  "international2023_fantasy_players_desc": "Wählen Sie Ihre liebsten Core-, Mid- und Support-Spieler.",
  "international2023_fantasy_craft_title": "Herstellen",
  "international2023_fantasy_craft_desc": "Nutzen Sie Chancen, um Spielerwerte neu zu generieren, die Sie als eine der vielen Belohnungen in Ihrem Kompendium erhalten können, um die besten Spieler für Fantasy herzustellen. Aber wählen Sie weise – einige Werte passen besser zu bestimmten Spielern als andere.",
  "international2023_fantasy_compete_title": "Wetteifern",
  "international2023_fantasy_compete_desc": "Jedes Wochenende des Turniers stellt eine eigene Runde der Fantasy-Liga dar, sodass Sie mehrere Gelegenheiten haben, mit Ihren Freunden und der ganzen Welt zu wetteifern. Verdienen Sie Kompendiumpunkte und – falls Ihr Rang in der Bestenliste hoch genug ist – eine einzigartige Trophäe.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Verspüren Sie jedes Mal einen leichten Nervenkitzel, wenn ein Profiteam ein Divine Rapier kauft? Oder wenn eine Partie über 80 Minuten dauert und alles ein wenig seltsam wird? Wie wäre es, wenn ein Team von Helden mit 16 Beinen gegen ein Team mit nur vier Beinen kämpft?\\n\\nMachen Sie sich bereit, diesen Nervenkitzel voll auszukosten. Bingo ermöglicht Ihnen, von einigen wahrlich verrückten Ereignissen zu profitieren.",
  "international2023_bingo_cards_title": "EINE BINGOKARTE PRO WOCHENENDE",
  "international2023_bingo_cards_desc": "Alle Kompendiumbesitzer erhalten an jedem Wochenende des Turniers eine neue, zufällig generierte Bingokarte. Die Felder dieser Karte sind voller ungewöhnlicher Bedingungen und interessanter Situationen, bei denen Sie die Profis im Wettkampf anfeuern können.",
  "international2023_bingo_rewards_title": "Reihen vervollständigen, Punkte verdienen",
  "international2023_bingo_rewards_desc": "Richtig gelesen – lassen Sie sich nicht von den Göttern, Dämonen und schießwütigen Waldbewohnerinnen täuschen, es handelt sich um das altbekannte Bingo, im Ernst.",
  "international2023_predictions_title": "Oracles Herausforderung",
  "international2023_predictions_intro": "Oracle verwendet astrale Bauchnabelmagie, um in die Zukunft zu blicken. Na gut, Spaß beiseite: Bauchnabelmagie existiert nicht wirklich. Sie müssen von Ihrer Gerissenheit, Ihrem E-Sport-Wissen und vor allem von Ihren besten Vorhersagen Gebrauch machen, um diese Herausforderung zu bewältigen.\\n\\nSagen Sie wie Oracle – ohne Einsatz Ihres Bauchnabels – vorher, welche Teams an jedem Turnierwochenende in die nächste Runde einziehen und welche ausscheiden werden. Für richtige Prognosen (wir meinen Oracle-ähnliche Hellsicht) erhalten Sie Kompendiumpunkte.",
  "international2023_predictions_group_stage_title": "Prognosen der Gruppenphase",
  "international2023_predictions_group_stage_desc": "Neu in diesem Jahr: Versuchen Sie, die Platzierung der Teams innerhalb jeder Gruppe vorherzusagen.",
  "international2023_predictions_ingame_title": "Prognosen während der Partien",
  "international2023_predictions_ingame_desc": "Während Sie im Spiel oder auf Twitch zusehen, können Sie Ihre Hellsicht vor dem Erklingen des Horns einer jeden Partie testen. Für jede richtige Prognose erhaltet Sie bis zu sechs Kompendiumpunkte pro Tag.",
  "international2023_rewards_title": "Kompendiumbelohnungen",
  "international2023_rewards_intro": "Wenn Sie ein Fan der Dota-Wettkampfszene sind und dafür belohnt werden wollen, sind die diesjährigen Belohnungen genau das Richtige für Sie. Das Kompendium 2023 konzentriert sich ausschließlich auf The International 2023 und die Dota-Profiszene.",
  "international2023_rewards_physical_aegis_title": "Physische Replik der Ägis",
  "international2023_rewards_physical_aegis_desc": "Ein Replikat des berühmten Siegerpreises aus einer Nickellegierung im Maßstab 1:5. Präsentieren Sie sie mit Stolz! Oder verwahren Sie sie ganz diskret. Sie könnten das Replikat auch einschmelzen und Ihre ganz eigene Währung kreieren.",
  "international2023_rewards_chat_wheels_title": "Permanente Chatradsprüche",
  "international2023_rewards_chat_wheels_desc": "Anders als in den vergangenen Jahren sind jetzt alle Chatradsprüche permanent verfügbar. Genau wie es im Titel steht. Ja, dieser Text wirkt etwas redundant. Aber es ist nett, etwas mehr Zeit mit Ihnen zu verbringen.",
  "international2023_rewards_stickers_title": "Spieler- und Teamaufkleber",
  "international2023_rewards_stickers_desc": "„Nur Teamaufkleber?“ Sie haben nicht einmal den Titel gelesen, oder? Sie bekommen auch Spieleraufkleber. Ehrlich gesagt sind diese Texte nur Verpackungsmaterial, um den Titel auf dem Transportweg zu Ihren Augen zu schonen.",
  "international2023_rewards_hud_title": "HUD zu The International 2023",
  "international2023_rewards_hud_desc": "Der vorherige Abschnitt hat möglicherweise einige Leute davon abgeschreckt, diesen Text zu lesen. Wenn Sie also bis hierhin durchgehalten haben: Äußerst klug. Es handelte sich nämlich um einen Test – und Sie haben bestanden. Hier sind einige Informationen, die nicht im Titel enthalten waren: Das neue HUD wurde in diesem Jahr im Stil von buntem Kirchenfensterglas gestaltet.",
  "international2023_rewards_loading_screens_title": "Ladebildschirme",
  "international2023_rewards_loading_screens_desc": "Sie erhalten für jedes Team einen Ladebildschirm im Stil von buntem Kirchenfensterglas sowie einige der zentralen Motive des diesjährigen TIs.",
  "international2023_rewards_materials_title": "Power-Ups für Fantasy und die Herausforderung zum Weg zu TI",
  "international2023_rewards_materials_desc": "Benutzen Sie spezielle Werkzeuge, um bessere Spieler für die Fantasy-Herausforderung herzustellen oder besonders schwierige Inhalte der Herausforderung zum Weg zu TI zu bewältigen.",
  "international2023_rewards_teleport_fx_title": "Teleportationseffekte Ihres Lieblingsteams",
  "international2023_rewards_teleport_fx_desc": "Zeigen Sie stolz Ihr Lieblingsteam im Spiel mit individuellen Teleportationseffekten in drei verschiedenen Stufen.",
  "international2023_rewards_Types_title": "Belohnungsarten",
  "international2023_rewards_Types_desc": "Jede Belohnungsart zählt ihren eigenen Fortschritt. Wenn dieser erfüllt ist, können Sie die Belohnung einlösen. Bei einigen Belohnungen kann der Fortschritt so oft wie Sie möchten, bei anderen nur begrenzte Male erneut durchlaufen werden.",
  "international2023_rewards_Levels_title": "Kompendiumlevel",
  "international2023_rewards_Levels_desc": "Verdienen Sie Kompendiumlevel, indem Sie an den Aktivitäten für Kompendiumbesitzer teilnehmen oder Levelpakete kaufen. Die Anwendung von Levelpaketen trägt zum Fortschritt für ALLE Belohnungsarten bei.",
  "international2023_rewards_Boosters_title": "Booster",
  "international2023_rewards_Boosters_desc": "Booster funktionieren wie Kompendiumlevel, gewährt aber nur Fortschritt für eine bestimmte Belohnung. Die Anwendung eines Boosters auf eine Belohnung trägt auch zum Fortschritt für die Sammlerägis bei.",
  "international2023_supporters_clubs_title": "Fanclubs",
  "international2023_supporters_clubs_subtitle": "Direkte Unterstützung Ihrer Lieblingsteams",
  "international2023_supporters_clubs_intro": "Genießen Sie Fanclub-Belohnungen, solange Sie können, denn sie sind so vergänglich, wie die Freuden der Jugend. Oder zumindest war das bisher so. Ab diesem Jahr sind die Belohnungen permanent verfügbar! Das heißt, Sie können sie jetzt für immer genießen!\\n\\nUnd es kommt noch besser: 50 % aller Erlöse aus den Verkäufen fließen direkt an das Team. Nun, streng genommen ist das besser für die Teams. Aber die Belohnungen sind definitiv besser für Sie.",
  "international2023_supporters_clubs_tiers_title": "Drei Stufen der Unterstützung",
  "international2023_supporters_clubs_tiers_desc": "Zeigen Sie Ihre Unterstützung für Ihre Lieblingsteams mittels Bronze-, Silber- oder Goldstufe und erhalten Sie Belohnungen, die von den Teams selbst entworfen wurden.",
  "international2023_talent_title": "Talentaufkleber",
  "international2023_talent_subtitle": "Direkte Unterstützung Ihres Lieblingstalents",
  "international2023_talent_intro": "Die Live-Übertragung von E-Sport ist harte Arbeit. Nicht so hart wie der Kohlebergbau, versteht sich. Jetzt können Sie Ihrem Lieblingstalent eine Nachricht schicken, wie: „Hey, ich respektiere deine Arbeit. Nicht so sehr wie das Schuften eines Bergmanns, aber trotzdem.“ Außerdem fließt die Hälfte aller Erlöse aus dem Verkauf von Talentaufklebern direkt an das Talent.",
  "international2023_talent_tiers_title": "Wählen Sie Ihre Stufe",
  "international2023_talent_tiers_desc": "Kaufen Sie Belohnungspakete Ihres Lieblingstalents. Die Pakete enthalten je nach Stufe des gekauften Pakets eine Kombination aus Aufklebern, Chatradsprüchen und Autogrammen.",
  "international2023_talent_coming_soon": "Talentpakete sind erhältlich, nachdem das Talent bekannt gegeben wird.",
  "international2023_coming_soon": "Bald verfügbar",
  "ti12_bp_countdown_header": "Zur Gruppenphase",
  "ti12_bp_countdown_desc": "Schalten Sie zum größten E-Sport-Turnier des Jahres ein – live übertragen aus Seattle. Der Sieger nimmt die Ägis der Champions mit nach Hause.",
  "ti12_bp_tournament_complete_desc": "Erleben Sie die Begeisterung des größten E-Sport-Turniers des Jahres erneut – die gesamte Action aus Seattle ist nur einen Klick entfernt.",
  "ti12_group_stage_venue": "Online",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Turnier unterstützen",
  "ti12_compendium_header": "Kompendium zu The International 2023",
  "ti12_compendium_desc": "Holen Sie mit dem Kompendium zu The International 2023 noch mehr aus der diesjährigen Turniersaison heraus. Spielen Sie wie ein Profi bei der Herausforderung zum Weg zu TI. Stellen Sie einen Kader aus Ihren Lieblingsprofis bei der überarbeiteten Fantasy-Herausforderung zusammen. Testen Sie Ihre Hellsicht mit Oracles Herausforderung. Und hoffen Sie beim Bingo darauf, dass die Teams einige verrückte Sachen machen.\\n\\nErhalten Sie Belohnungen wie Spieleraufkleber, Teamaufkleber, Chatradsprüche, ein individuelles HUD und vieles mehr, bis hin zu einer physischen Replik der Ägis.\\n\\n25 % aller Erlöse aus dem Verkauf des Kompendiums fließt direkt in das Preisgeld für The International 2023 ein.",
  "ti12_compendium_standard": "Standard-Kompendium",
  "ti12_compendium_upgraded": "Aufgewertetes Kompendium"
}