// 5513.js

{
  "language": "spanish",
  "international2023_compendium_activity": "Actividad para los que tienen el Compendio",
  "international2023_update_title": "Celebración de The International 2023",
  "international2023_update_subtitle": "Esta actualización de e-sport tiene algo para todos, tanto para los fanáticos de la escena profesional como para los jugadores ocasionales.",
  "international2023_update_body": "Tanto si estás pendiente de los segundos de emoción que ofrece cada partida de The International, como si solo te sonaba vagamente que hay gente que se gana la vida jugando a esto y lo único que quieres es disfrutar del juego tranquilamente, sigue leyendo, pues esta actualización tiene algo para todos.\\n\\n¿Eres un fanático de los e-sports? Crea tu propia alineación de jugadores profesionales con la <b>liga Fantasía</b> mejorada. ¿Eres más bien un apasionado de los análisis? Adéntrate en las predicciones sobre los grupos de <b>El desafío del Oráculo</b>. O, tal vez, tu gran afición son los juegos de la hermana de tu abuela. Bueno, en ese caso, ¡este año tenemos <b>Bingo</b>!\\n\\nLa otra opción es que no te guste ninguno de estos juegos, pero sí eres el mejor de tus fans. En ese caso, también tenemos algo para ti: <b>el expositor del perfil</b>. Ahora tu perfil es un monumento interactivo de tu persona diseñado para exponer cualquier artículo o logro de tu historial de juego que quieras destacar.",
  "international2023_update_footer": "¡Bien hecho, te leíste las notas de la actualización hasta el final!",
  "international2023_compendium": "Compendio",
  "international2023_compendium_title": "Compendio de The International 2023",
  "international2023_compendium_intro": "El Compendio es tu compañero digital interactivo en la etapa «El camino a The International» 2023 y en The International 2023.\\n\\nJuega como un profesional con el desafío «El camino a The International». Selecciona a tus jugadores favoritos con el desafío de Fantasía rediseñado y actualizado. Pon a prueba tu capacidad para predecir la fase de grupos y los grupos resultantes. Gana el premio gordo con los nuevos tableros de bingo.\\n\\nConsidera el Compendio como la única fuente de actividades, desafíos y recompensas relacionadas con el evento de este año. Además, un 25 % de las ventas se añadirán al fondo de premios de The International 2023.",
  "international2023_showcase_title": "Expositor del perfil",
  "international2023_showcase_subtitle": "Nueva característica para todos los jugadores de Dota",
  "international2023_showcase_intro": "Tanto el perfil como el miniperfil se han rediseñado por completo para todos los jugadores —bueno, para el 98 % que tiene una puntuación de comunicación por encima de 6000—. Ahora, con el expositor del perfil, puedes presumir de tus artículos y logros de Dota, literalmente, puedes presumir de todo lo que tengas en tu inventario de Dota.\\n\\n¿Quieres crear un altar dedicado a equipo profesional favorito del 2016? Ya puedes hacerlo. ¿Qué tal crear una colección de tus sets de héroes favoritos? También puedes hacerlo. ¿Quieres mostrar cada uno de los pares de botas de Kunkka? Lamentablemente, sí. En teoría, también puedes hacerlo.",
  "international2023_showcase_profile_title": "Perfil actualizado",
  "international2023_showcase_profile_desc": "Eres un Miguel Ángel y tu perfil es un panel parecido a sus lienzos; el único límite es tu imaginación (y un sentido básico de decencia).",
  "international2023_showcase_mini_profile_title": "Miniperfil actualizado",
  "international2023_showcase_mini_profile_desc": "Los miniperfiles son muy parecidos a los perfiles, solo tienen una diferencia clave —y esto es importante—, son más pequeños. Los demás jugadores van a ver tu miniperfil cuando pasen el cursor sobre tu nombre.",
  "international2023_showcase_carousel_title": "Expositores de muestra",
  "international2023_showcase_items_title": "Artículos del expositor",
  "international2023_showcase_items_desc": "Personaliza tus expositores con el gran surtido de artículos y recompensas que has estado coleccionando a lo largo de los años.",
  "international2023_showcase_item_heroes_title": "Héroes",
  "international2023_showcase_item_trophies_title": "Trofeos",
  "international2023_showcase_item_stickers_title": "Pegatinas",
  "international2023_showcase_item_stats_title": "Estadísticas",
  "international2023_showcase_item_chat_wheels_title": "Ruedas de chat",
  "international2023_showcase_item_sprays_title": "Espráis",
  "international2023_showcase_item_items_title": "Objetos de la armería",
  "international2023_showcase_item_emoticons_title": "Emoticonos",
  "international2023_showcase_item_loading_screens_title": "Pantallas de carga",
  "international2023_showcase_item_couriers_title": "Mensajeros",
  "international2023_showcase_item_wards_title": "Guardianes",
  "international2023_tournament_prize_pool": "Fondo para premios",
  "international2023_tournament_prize_pool_percent": "El 25 % de todas las ventas del Compendio para The International 2023 se destina al fondo de premios del evento.",
  "international2023_tournament_learn_more": "Más información sobre el torneo",
  "international2023_quests_title": "Desafío «El camino a The International»",
  "international2023_quests_intro": "Ya has visto a los profesionales, ya los animaste, ahora, juega como uno de ellos. Siéntate en la silla de tus jugadores profesionales favoritos de e-sports y revive los momentos más importantes del año que pasó. Consigue la victoria con los héroes utilizados en una partida concreta o jugando con uno de los cinco héroes utilizados en un mes concreto de la temporada. Consigue puntos por cada desafío y puntos adicionales por completar todo un conjunto de desafíos.",
  "international2023_quests_match_title": "Desafíos de enfrentamiento",
  "international2023_quests_match_desc": "Obtén la victoria con héroes de una partida profesional concreta.",
  "international2023_quests_pro_title": "Desafíos de jugador",
  "international2023_quests_pro_desc": "Obtén la victoria con uno de los héroes más utilizados por un profesional en concreto.",
  "international2023_quests_rewards_title": "Obtén recompensas",
  "international2023_quests_rewards_desc": "Mejora tus recompensas con los puntos del Compendio que vayas ganando.",
  "international2023_fantasy_title": "Una nueva liga Fantasía",
  "international2023_fantasy_intro": "Forma un equipo con tus jugadores profesionales favoritos. Para crearlo, usa las estadísticas que consideres más valiosas. Compite contra jugadores de todo el mundo para ganar el máximo de puntos. Es la liga Fantasía de Dota de siempre, pero rediseñada por completo.",
  "international2023_fantasy_players_title": "Selecciona",
  "international2023_fantasy_players_desc": "Elige tus jugadores favoritos para los puestos de principal, central y apoyo.",
  "international2023_fantasy_craft_title": "Crea",
  "international2023_fantasy_craft_desc": "Usa las renovaciones conseguidas con tus recompensas del Compendio para intentar crear el mejor conjunto de estadísticas para tus jugadores. Elige con cuidado, algunas de las estadísticas funcionan mejor en unos jugadores que en otros.",
  "international2023_fantasy_compete_title": "Compite",
  "international2023_fantasy_compete_desc": "Cada fin de semana del torneo es una ronda de Fantasía independiente, así que tendrás varias oportunidades de enfrentarte a tus amigos y al mundo. Consigue puntos del Compendio y, si tu clasificación es lo suficientemente alta, obtendrás un trofeo único.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "¿Sientes un poco de adrenalina cada vez que un equipo profesional compra un Estoque Divino? ¿Se te hace raro que una partida dure más de 80 minutos? ¿Qué impresión te da cuando un equipo con héroes que suman 16 extremidades inferiores se enfrenta a otro equipo que solo suma 4?\\n\\nBueno, pues prepárate para beneficiarte de toda esta emoción. Con el bingo puedes sacarle partido a ese tipo de eventos descabellados.",
  "international2023_bingo_cards_title": "UN CARTÓN DE BINGO POR FIN DE SEMANA",
  "international2023_bingo_cards_desc": "Todos los que tengan el Compendio reciben cada uno de los fines de semana del torneo un nuevo cartón de bingo generado de forma aleatoria. Está lleno de cuadritos con condiciones poco usuales y situaciones interesantes por las que vas a apostar mientras compiten los profesionales.",
  "international2023_bingo_rewards_title": "Completa filas, gana puntos",
  "international2023_bingo_rewards_desc": "Así es. ¡Gente, no dejéis que os engañen los dioses, los demonios o las criaturas del bosque con gatillo fácil, se trata de un bingo! Al completar una línea, una columna o una diagonal de la tarjeta, se puede reclamar una recompensa de puntos del Compendio. Nota: Lo de gritar «¡BINGO!» es optativo pero recomendable.",
  "international2023_predictions_title": "El desafío del Oráculo",
  "international2023_predictions_intro": "El Oráculo usa magia astral umbilical para ver el futuro. Bueno, me temo que debemos revelar que la magia basada en el ombligo no es algo real. Vas a tener que usar tu astucia, tus conocimientos de e-sports y, lo que es más importante, puras conjeturas para poder realizar la tarea.\\n\\nTendrás que predecir, como un oráculo pero sin magia umbilical, qué equipos ganarán y cuáles perderán cada fin de semana del torneo. Las predicciones correctas —es decir, las adivinaciones dignas de un oráculo— te otorgarán puntos del Compendio.",
  "international2023_predictions_group_stage_title": "Predicciones de la fase de grupos",
  "international2023_predictions_group_stage_desc": "La novedad de este año es tratar de predecir el orden de los equipos dentro de cada grupo.",
  "international2023_predictions_ingame_title": "Predicciones dentro del juego",
  "international2023_predictions_ingame_desc": "Mientras ves la partida dentro del juego o en Twitch, pon a prueba tus poderes adivinatorios antes de que suene el cuerno de inicio de cada partida. Obtendrás puntos del Compendio por cada predicción correcta, hasta seis por día.",
  "international2023_rewards_title": "Recompensas del Compendio",
  "international2023_rewards_intro": "Si eres un fan del Dota competitivo y de obtener recompensas por tu afición al juego, las recompensas de este año son para ti. El Compendio 2023 está enfocado por completo en The International 2023 y la escena profesional de Dota.",
  "international2023_rewards_physical_aegis_title": "Modelo físico de la Égida",
  "international2023_rewards_physical_aegis_desc": "Una réplica a escala 1:5 de aleación de níquel del famoso premio de los campeones. ¡Exhíbela con orgullo! ¡Muéstrala libremente! ¡O fúndela para crear tus propias monedas!",
  "international2023_rewards_chat_wheels_title": "Ruedas de chat permanentes",
  "international2023_rewards_chat_wheels_desc": "A diferencia de los años anteriores, ahora todas las ruedas de chat son permanentes. Tal como ya se indica en el título. Esto puede parecer redundante, pero nos encanta pasar más tiempo contigo.",
  "international2023_rewards_stickers_title": "Pegatinas de jugadores y equipos",
  "international2023_rewards_stickers_desc": "«¿Solo pegatinas de equipos?». Ni siquiera te leíste el título, ¿verdad? También consigues pegatinas de jugadores. Francamente, estos párrafos son de relleno para que el mensaje del título no pase desapercibido por delante de tus ojos.",
  "international2023_rewards_hud_title": "HUD de The International 2023",
  "international2023_rewards_hud_desc": "El párrafo anterior podría haber asustado a la gente y hecho que dejaran de leer este. Si seguiste leyendo, eres bastante inteligente. Era una prueba y la superaste, porque aquí hay información que no aparece en el título: el nuevo HUD tiene un diseño especial inspirado en el tema de las vidrieras de este año.",
  "international2023_rewards_loading_screens_title": "Pantallas de carga",
  "international2023_rewards_loading_screens_desc": "Recibirás una pantalla de carga personalizada con temática de vidrieras para cada equipo, así como algunas de las obras clave de TI de este año.",
  "international2023_rewards_materials_title": "Mejoras para los desafíos Fantasía y «El camino a The International»",
  "international2023_rewards_materials_desc": "Usa herramientas personalizadas para mejorar a los jugadores en el desafío Fantasía, o enfréntate al contenido especialmente complicado del desafío «El camino a The International».",
  "international2023_rewards_teleport_fx_title": "Efectos de teletransporte de tu equipo favorito",
  "international2023_rewards_teleport_fx_desc": "Presume de tu equipo favorito dentro del juego con efectos de teletransporte personalizados en tres niveles distintos.",
  "international2023_rewards_Types_title": "Tipos de recompensas",
  "international2023_rewards_Types_desc": "Cada tipo de recompensa tiene su medidor de progreso. Cuando se llene, podrás reclamar la recompensa. Algunos medidores se pueden volver a llenar tantas veces como quieras, pero otros solo se pueden volver a llenar un número de veces específico.",
  "international2023_rewards_Levels_title": "Niveles del Compendio",
  "international2023_rewards_Levels_desc": "Obtén niveles del Compendio participando en sus actividades o comprando paquetes de niveles. Aplica niveles para aumentar los medidores de progreso de TODOS los tipos de recompensas.",
  "international2023_rewards_Boosters_title": "Potenciadores",
  "international2023_rewards_Boosters_desc": "Los potenciadores son una especie de niveles del Compendio, pero solo se usan para aumentar una recompensa específica. Al aplicar un potenciador a una recompensa también se avanza en el progreso de la Égida del Coleccionista.",
  "international2023_supporters_clubs_title": "Clubs de seguidores",
  "international2023_supporters_clubs_subtitle": "Apoya directamente a tus equipos favoritos",
  "international2023_supporters_clubs_intro": "Las recompensas de los clubs de seguidores eran como las alegrías de la juventud: había que disfrutarlas mientras se podía, pues desaparecían. Así era antes. A partir de este año, ¡se vuelven permanentes! Ahora vas a poder disfrutar de ellas eternamente, a menos que te atropelle un autobús.\\n\\n Y lo que es mejor, un 50 % de todas las ventas van directamente al equipo. Bueno, eso es incluso mejor para ellos, pero lo del principio es mejor para ti.",
  "international2023_supporters_clubs_tiers_title": "Tres niveles de apoyo",
  "international2023_supporters_clubs_tiers_desc": "Elige el apoyo de nivel oro, plata o bronce para tus equipos favoritos para obtener recompensas diseñadas por ellos mismos.",
  "international2023_talent_title": "Pegatinas de talentos",
  "international2023_talent_subtitle": "Apoya directamente a tu talento favorito",
  "international2023_talent_intro": "La retransmisión en directo de e-sports es una tarea complicada. Bueno, no es tan difícil como trabajar en una mina, pero más complicada que ponerse a tejer para Etsy. Bueno, depende de lo que haya que tejer, algunos de esos jerséis de punto crochet se ven bastante complicados. \\n\\n Ahora puedes mandarle un mensaje a tu talento favorito que diga «Hola, le tengo mucho respeto a lo que haces; bueno, no tanto como a lo que hace un minero, pero al menos un 50 % más de respeto que a los creadores de Etsy». Y hablando del 50 %, la mitad de las ventas de las pegatinas de talentos van para el talento directamente.",
  "international2023_talent_tiers_title": "Elige un nivel",
  "international2023_talent_tiers_desc": "Compra lotes de recompensas con tu talento favorito. Los lotes incluyen una combinación de pegatinas, líneas de voz y autógrafos, dependiendo del nivel del lote que compres.",
  "international2023_talent_coming_soon": "Los lotes de talentos estarán disponibles para su compra después de que se anuncie cada talento.",
  "international2023_coming_soon": "Próximamente",
  "ti12_bp_countdown_header": "Rumbo a la fase de grupos",
  "ti12_bp_countdown_desc": "No te pierdas el mayor torneo de e-sports del año, en directo desde Seattle con la batalla por la Égida de los Campeones.",
  "ti12_bp_tournament_complete_desc": "Revive la emoción del mayor torneo de e-sports del año. Toda la acción de Seattle a un solo clic.",
  "ti12_group_stage_venue": "En línea",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Apoya el torneo",
  "ti12_compendium_header": "Compendio de The International 2023",
  "ti12_compendium_desc": "Desbloquea aún más recompensas de la temporada del torneo con el Compendio de The International 2023. Juega como un profesional con el desafío «El camino a The International». Crea una plantilla de tus jugadores profesionales favoritos en una liga Fantasía rediseñada. Pon a prueba tus dotes adivinatorias con el desafío del Oráculo. Y ruega para que algunos equipos hagan cosas raras con esa nueva característica del bingo.\\n\\nGana recompensas como pegatinas de jugadores y de equipos, ruedas de chat, un HUD personalizado y mucho más, incluyendo hasta una réplica física de la Égida.\\n\\nEl 25 % de todas las ventas del Compendio se destina directamente al fondo de premios de The International.",
  "ti12_compendium_standard": "Compendio estándar",
  "ti12_compendium_upgraded": "Compendio mejorado"
}