// 8603.js

{
  "language": "finnish",
  "international2023_compendium_activity": "Tekemistä turnauskirjan omistajille",
  "international2023_update_title": "The International 2023 -juhlatapahtuma",
  "international2023_update_subtitle": "Turnauspäivitys tarjoaa jotakin kaikille ammattilais-Dotan superfaneista satunnaisiin pelaajiin.",
  "international2023_update_body": "Olitpa sitten vannoutunut Dota-fani tai ällikällä siitä, että jotkut tienaavat elantonsa pelaamalla Dotaa, kannattaa jatkaa lukemista: tämä päivitys koskee sinua.\\n\\nOletko turnausfani? Luo oma joukkuekokoonpano ammattilaispelaajista päivitetyssä <b>fantasialiigassa.</b> Oletko ennemmin tilastotyyppiä? Osallistu <b>oraakkelin haasteen</b> veikkauksiin. Kiinnostavatko isotätisi pelit? Tänä vuonna voit myös pelata <b>bingoa</b>!\\n\\nEhkä tämä ei kiinnosta sinua lainkaan, vaan olet enemmän kiinnostunut itsestäsi. Ei huolta, meillä on jotain sinullekin: <b>profiilivitriini.</b> Profiilisi on nyt interaktiivinen muistomerkki itsellesi. Siellä voit esitellä kaikkia vuosien varrella haalimiasi esineitä ja saavutuksia.",
  "international2023_update_footer": "Olet nyt löytänyt tiesi päivityssivun päähän. Hieno homma!",
  "international2023_compendium": "Turnauskirja",
  "international2023_compendium_title": "The International 2023 -turnauskirja",
  "international2023_compendium_intro": "Turnauskirja on interaktiivinen työkalu kaikkeen, mikä liittyy Road to The International -tapahtumaan ja The International 2023 -turnaukseen.\\n\\nPelaa ammattilaisten tavoin Road to The International -haasteessa, valitse suosikkipelaajasi uudistetussa fantasialiigassa, näytä tietämyksesi lohko- ja sarake-ennustuksissa tai voita jättipotti bingokortilla.\\n\\nTurnauskirjasta löydät kaikki tapahtumaan liittyvät aktiviteetit, haasteet ja tapahtumapalkinnot. Lisäksi 25 % kaikista turnauskirjojen myyntituloista menee suoraan The International 2023 -kisan palkintopottiin.",
  "international2023_showcase_title": "Profiilivitriini",
  "international2023_showcase_subtitle": "Uusi ominaisuus kaikille Dota-pelaajille",
  "international2023_showcase_intro": "Profiilit ja miniprofiilit ovat nyt saaneet täysin uuden ulkoasun, josta kaikki pääsevät nauttimaan (paitsi ne 2 %, joiden käytöspisteet ovat alle 6 000 pisteen). Nyt voit esitellä Dota-esineitäsi ja saavutuksiasi — siis aivan mitä tahansa, mitä tavaraluettelostasi löytyy — uudessa profiilivitriinissä.\\n\\nHaluatko luoda alttarin lempijoukkueellesi vuodelta 2016? Se on mahdollista. Entä jos haluat esitellä lempiesinekokoelmiasi? Se on todellakin mahdollista. Entäpä jokaista Kunkan kenkäparia? Valitettavasti sekin on kyllä mahdollista.",
  "international2023_showcase_profile_title": "Päivitetty profiili",
  "international2023_showcase_profile_desc": "Olet Michaelangelo, profiilisi on kankaasi ja ainoa rajoitteesi on mielikuvituksen rajallisuus (ja tietenkin säädyllisyys).",
  "international2023_showcase_mini_profile_title": "Päivitetty miniprofiili",
  "international2023_showcase_mini_profile_desc": "Miniprofiilit ovat aika samanlaisia kuin profiilit, mutta niissä on yksi pieni ero: ne ovat pieniä. Muut pelaajat näkevät miniprofiilisi, kun he pitävät hiirtä nimesi yllä.",
  "international2023_showcase_carousel_title": "Esimerkkivitriinit",
  "international2023_showcase_items_title": "Vitriiniesineet",
  "international2023_showcase_items_desc": "Tee vitriinistä omanlaisesi kaikilla niillä esineillä ja palkinnoilla, joita olet vuosien aikana kerännyt.",
  "international2023_showcase_item_heroes_title": "Sankarit",
  "international2023_showcase_item_trophies_title": "Pokaalit",
  "international2023_showcase_item_stickers_title": "Tarrat",
  "international2023_showcase_item_stats_title": "Tilastot",
  "international2023_showcase_item_chat_wheels_title": "Chatrullat",
  "international2023_showcase_item_sprays_title": "Graffitit",
  "international2023_showcase_item_items_title": "Asevaraston esineet",
  "international2023_showcase_item_emoticons_title": "Hymiöt",
  "international2023_showcase_item_loading_screens_title": "Latausruudut",
  "international2023_showcase_item_couriers_title": "Kuriirit",
  "international2023_showcase_item_wards_title": "Wardit",
  "international2023_tournament_prize_pool": "Palkintopotti",
  "international2023_tournament_prize_pool_percent": "25 % The International 2023 -turnauskirjan myynnistä menee The International 2023 -kilpailun palkintopottiin.",
  "international2023_tournament_learn_more": "Lue lisää turnauksesta",
  "international2023_quests_title": "Road to The International -haaste",
  "international2023_quests_intro": "Olet katsellut ammattilaisia. Olet kannattanut ammattilaisia. Nyt voit pelata ammattilaisena. Istahda siis lempipelaajasi pelituoliin ja koe heidän viimeisen vuoden suurimmat hetkensä uudelleen. Voita tiettyjen otteluiden sankareilla tai jollain heidän eniten pelaamistaan sankareista tiettynä kuukautena. Jokainen haaste antaa turnauskirjapisteitä, ja haasteryhmien suorittaminen tuo lisäpisteitä.",
  "international2023_quests_match_title": "Pelihaasteet",
  "international2023_quests_match_desc": "Voita käyttämällä sankareita oikeasta kilpailukauden ottelusta.",
  "international2023_quests_pro_title": "Pelaajahaasteet",
  "international2023_quests_pro_desc": "Voita jollain ammattilaispelaajan eniten pelaamalla sankarilla.",
  "international2023_quests_rewards_title": "Ansaitse palkintoja",
  "international2023_quests_rewards_desc": "Hanki upeita palkintoja ansaitsemillasi turnauskirjapisteillä.",
  "international2023_fantasy_title": "Kehittyneempi fantasialiiga",
  "international2023_fantasy_intro": "Kokoa tiimi lempipelaajistasi. Luo heille mielestäsi arvokkaimmat lisäpiirteet. Kilpaile pelaajia vastaan ympäri maailmaa tienataksesi lisäpisteitä. Kokonaan uudistettu Dotan fantasialiiga on parempi kuin koskaan.",
  "international2023_fantasy_players_title": "Valitse",
  "international2023_fantasy_players_desc": "Valitse suosikkisi kärki-, keski- ja tukipelaajaksi.",
  "international2023_fantasy_craft_title": "Luo",
  "international2023_fantasy_craft_desc": "Käytä turnauskirjan palkinnoista ansaittuja arvontapoletteja ja yritä luoda parhaimmat tilastot pelaajillesi. Valitse huolella – jotkut tilastot sopivat paremmin tietyille pelaajille.",
  "international2023_fantasy_compete_title": "Kilpaile",
  "international2023_fantasy_compete_desc": "Jokainen turnausviikonloppu on erillinen fantasiaturnaus, joten voit kilpailla kavereitasi ja koko maailmaa vastaan useamman kerran. Ansaitse turnauskirjapisteitä ja jos pärjäät tarpeeksi hyvin, saat ainutlaatuisen pokaalin.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Saatko kylmiä väreitä, kun ammattilaisjoukkue ostaa Divine Rapierin? Tai kun peli kestää yli 80 minuuttia, eikä sillä enää ole päätä eikä häntää? Entä, jos yli 16-jalkainen kokoonpano taistelee nelijalkaista vastaan?\\n\\nNyt on jännitykselle käyttöä, sillä bingosta voi saada pisteitä kaikenmoisista hulluista tilanteista.",
  "international2023_bingo_cards_title": "YKSI BINGOKORTTI JOKA VIIKONLOPPU",
  "international2023_bingo_cards_desc": "Kaikki turnauskirjan omistajat saavat satunnaisesti luodun bingokortin jokaiselle turnausviikonlopulle. Bingokortissa on ruutuja oudoille ja mielenkiintoisille vaatimuksille ja tilanteille, jotka tuovat lisäjännitystä kotikatsomoihin.",
  "international2023_bingo_rewards_title": "Täytä rivit ja ansaitse pisteitä",
  "international2023_bingo_rewards_desc": "Älä anna jumalien, demonien tai hampaisiin asti aseistettujen karvaturrien hämätä sinua: bingo on yhä bingoa. Jokainen vaaka-, pysty- ja vinorivi antavat sinulle lisää turnauskirjapisteitä. Bingon huutaminen ei ole pakollista, mutta suosittelemme sitä silti.",
  "international2023_predictions_title": "Oraakkeli-haaste",
  "international2023_predictions_intro": "Oraakkeli käyttää yliluonnollisen navan taikuutta nähdäkseen tulevaisuuteen. Emme halua pilata intoasi, mutta yliluonnollinen napataikuus ei ole todellista. Käytä oveluuttasi, esports-tietämystäsi ja mikä tärkeintä, onnettaren apua päästäksesi päämäärääsi.\\n\\nEnnusta kuin oraakkeli, mutta unohda navat, mitkä joukkueet pääsevät jatkoon ja mitkä putoavat kunkin turnausviikonlopun aikana. Oikeista veikkauksista (oraakkelityyppisistä ennustuksista) saa turnauskirjapisteitä.",
  "international2023_predictions_group_stage_title": "Ennusta lohkovaihe",
  "international2023_predictions_group_stage_desc": "Uutta tänä vuonna: voit yrittää ennustaa joukkueiden järjestyksen kussakin lohkossa.",
  "international2023_predictions_ingame_title": "Veikkaukset pelissä",
  "international2023_predictions_ingame_desc": "Kun katsot otteluita Dotassa tai Twitchissä, voit esitellä yhteyttäsi henkimaailmaan ja ennustaa pelitulokset ennen pelitorven töräytystä. Voit tienata turnauskirjapisteitä joka päivä enintään kuudesta oikeasta ennustuksesta.",
  "international2023_rewards_title": "Turnauskirjapalkinnot",
  "international2023_rewards_intro": "Jos pidät Dotan turnauspeleistä ja niiden seuraamisesta saatavista palkinnoista, tämän vuoden palkinnot ovat sinua varten. Vuoden 2023 turnauskirja keskittyy täysin The International 2023 -turnaukseen ja Dotan kilpailukauteen.",
  "international2023_rewards_physical_aegis_title": "Mestareiden merkin keräilykappale",
  "international2023_rewards_physical_aegis_desc": "Nikkeliseoksesta tehty mestaruuspalkinnon näköiskopio. Sitä voi esitellä ylpeillen! Jos haluaa. Tai sen voi sulattaa ja siitä voi tehdä omaa valuuttaa!",
  "international2023_rewards_chat_wheels_title": "Pysyvät chatrullat",
  "international2023_rewards_chat_wheels_desc": "Toisin kuin aiempina vuosina, kaikki chatrullarepliikit ovat nyt pysyviä, niin kuin otsikossa jo luvattiinkin. Mainitsemme asiasta kuitenkin uudelleen, koska on mukava viettää enemmän aikaa kanssanne.",
  "international2023_rewards_stickers_title": "Pelaaja- ja joukkuetarrat",
  "international2023_rewards_stickers_desc": "\"Vain joukkuetarroja?\" Et tainnut edes lukea otsikkoa: mukana on myös pelaajatarroja. Jos totta puhutaan, nämä leipätekstit ovat kuin styroksipehmusteita, joilla suojaamme otsikkoja niiden matkatessa tietoisuuteesi.",
  "international2023_rewards_hud_title": "The International 2023 -ulkoasu",
  "international2023_rewards_hud_desc": "Edellinen leipäteksti saattoi säikyttää jotkut leipätekstien lukemiselta. Joten jos vielä jatkat lukemista, läpäisit testin. Saat palkinnoksi lisätietoa, joka ei selviä otsikosta: ulkoasu on räätälöity tämän vuoden lasimaalausteemaiseksi.",
  "international2023_rewards_loading_screens_title": "Latausruudut",
  "international2023_rewards_loading_screens_desc": "Saat lasimaalausteemaisen latausruudun jokaisesta turnausjoukkueesta sekä muuta turnaukseen liittyvää kuvitusta.",
  "international2023_rewards_materials_title": "Fantasia ja Road to The International -haasteen voimabonukset",
  "international2023_rewards_materials_desc": "Käytä mukautettuja työkaluja luodaksesi parempia pelaajia fantasiahaasteessa tai suoriudu erityisen rankoista koettelemuksista Road to The International -haasteessa.",
  "international2023_rewards_teleport_fx_title": "Suosikkijoukkueen teleporttaustehosteet",
  "international2023_rewards_teleport_fx_desc": "Esittele lempijoukkuettasi kolmella eritasoisella teleporttaustehosteella.",
  "international2023_rewards_Types_title": "Palkintotyypit",
  "international2023_rewards_Types_desc": "Jokaisella palkintotyypillä on oma edistymismittarinsa. Kun mittari täyttyy, ansaitset sen sisältämän palkinnon. Joitain mittareita voi täyttää rajattomasti yhä uudelleen ja uudelleen, kun taas joitain palkintoja voi lunastaa vain tietyn verran.",
  "international2023_rewards_Levels_title": "Turnauskirjan tasot",
  "international2023_rewards_Levels_desc": "Ansaitse turnauskirjan tasoja osalllistumalla turnauskirjan aktiviteetteihin tai ostamalla tasopaketteja. Edistä KAIKKIA palkintojasi saamalla lisää tasoja.",
  "international2023_rewards_Boosters_title": "Tehostimet",
  "international2023_rewards_Boosters_desc": "Tehostimet ovat kuin turnauskirjan tasoja, jotka kohdistuvat vain yhdelle palkinnolle. Tehostin edistää myös Mestareiden merkin keräilykappaleen edistymistä.",
  "international2023_supporters_clubs_title": "Faniklubit",
  "international2023_supporters_clubs_subtitle": "Tue suosikkijoukkueitasi",
  "international2023_supporters_clubs_intro": "Faniklubien palkinnot ovat kuin nuoruuden ilot — nauti niistä, kun vielä voit, sillä ne ovat häilyviä. Tai ainakin ne olivat ennen, sillä tästä hetkestä eteenpäin ne ovat pysyviä! Voit siis nauttia niistä ikuisesti. Tai ainakin kuolemaasi saakka.\\n\\nKaiken kukkuraksi puolet tuloista menee suoraan joukkueelle. Se on hyvä juttu pelaajille. Aikaisempi juttu oli parempi sinulle.",
  "international2023_supporters_clubs_tiers_title": "Kolme tukitasoa",
  "international2023_supporters_clubs_tiers_desc": "Valitse pronssi-, hopea- tai kultatason tuki suosikkijoukkueillesi, jotta voit ansaita joukkueiden itsensä suunnittelemia palkintoja.",
  "international2023_talent_title": "Juontajatarrat",
  "international2023_talent_subtitle": "Tue suosikkijuontajaasi",
  "international2023_talent_intro": "Suora turnausselostaminen ei ole helppoa hommaa. On se tosin helpompaa kuin hiilen kaivaminen. Mutta juontaminen on varmasti vaikeampaa kuin telkkarin toljotus.\\n\\nNyt voit kertoa lempijuontajallesi: \"Hei, arvostan työtäsi. Se ei ole ehkä niin raskasta kuin kaivostyö, mutta se on varmasti ainakin 50 % haastavampaa kuin sohvaperunana oleminen!\" 50 % sattuukin olemaan se osuus, minkä juontajat saavat juontajatarrojen tuloista!",
  "international2023_talent_tiers_title": "Valitse tasosi",
  "international2023_talent_tiers_desc": "Osta lempijuontajasi paketteja, jotka sisältävät paketin tasosta riippuvaisen yhdistelmän tarroja, repliikkejä ja nimikirjoituksia.",
  "international2023_talent_coming_soon": "Juontajapaketit tulevat myyntiin, kun juontajat julkistetaan.",
  "international2023_coming_soon": "Tulossa pian",
  "ti12_bp_countdown_header": "Lohkovaiheeseen",
  "ti12_bp_countdown_desc": "Virittäydy vuoden isoimman esports-turnauksen tunnelmaan – katso livelähetyksiä Seattlesta. Taistelu Mestareiden merkistä käy kuumana.",
  "ti12_bp_tournament_complete_desc": "Koe uudelleen vuoden suurimman e-urheilutapahtuman jännitys. Seattlen tapahtumat ovat klikkauksen päässä.",
  "ti12_group_stage_venue": "Verkossa",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Turnauksen tukeminen",
  "ti12_compendium_header": "The International 2023 -turnauskirja",
  "ti12_compendium_desc": "Saat entistä enemmän irti turnauskaudesta The International 2023 -turnauskirjan avulla. Pelaa kuin ammattilainen Road to The International -haasteessa. Kokoa lista suosikkipelaajistasi uudelleen suunnitellussa fantasiapelissä. Testaa ennakointitaitosi oraakkeli-haasteen avulla ja toivo, että joukkueet tekevät outoja asioita täysin uudessa bingossa.\\n\\nAnsaitse palkintoja, kuten pelaaja- ja joukkuetarroja, chatrullia, räätälöity HUD-ulkoasu ja paljon muuta. Saatavana on myös mestaruuspalkinnon fyysinen näköiskopio.\\n\\n25 % turnauskirjan kokonaismyynnistä menee The Internationalin palkintopottiin.",
  "ti12_compendium_standard": "Perinteinen turnauskirja",
  "ti12_compendium_upgraded": "Päivitetty turnauskirja"
}