// 3283.js

{
  "language": "italian",
  "ringmastercomic_title_cover": "Il Burattino - Copertina",
  "ringmastercomic_title": "Il Burattino - Pagina %1$s",
  "ringmastercomic_help_text": "Clicca sull'immagine o premi spazio per proseguire",
  "ringmastercomic_return_button": "Torna alla copertina",
  "ti13_online": "Copenaghen",
  "ti13_main_event_venue": "Royal Arena - Copenaghen",
  "ti13_best_of_three": "Meglio di tre",
  "ti13_best_of_five": "Meglio di cinque",
  "ti13_group_stage_sp_rules": "Fase a gironi - Regole della priorità di selezione",
  "ti13_group_stage_sp_game1": "Lancio di una moneta.",
  "ti13_group_stage_sp_game2": "Prima partita: il vincitore del lancio della moneta può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_group_stage_sp_game3": "Seconda partita: il perdente del lancio della moneta sceglie tra un Eroe o una fazione.",
  "ti13_group_stage_sp_game4": "Terza partita (se applicabile): nuovo lancio di una moneta. Il vincitore del nuovo lancio può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_group_stage_tie_rules": "Fase a gironi - Regole dello spareggio",
  "ti13_first_second_tie": "Due squadre sono a pari merito per il 1° e il 2° posto",
  "ti13_second_third_tie": "Due squadre sono a pari merito per il 2° e il 3° posto",
  "ti13_third_fourth_tie": "Due squadre sono a pari merito per il 3° e il 4° posto",
  "ti13_three_way_first_tie": "Tre squadre sono a pari merito per il 1° posto",
  "ti13_three_way_second_tie": "Tre squadre sono a pari merito per il 2° posto",
  "ti13_four_way_tie": "Quattro squadre sono a pari merito per il 1° posto",
  "ti13_tie_resolve_bo3": "Spareggio con un meglio di tre.",
  "ti13_tie_resolve_third_fourth": "Non vengono giocate altre partite. Le due squadre restano in parità per il 3° e il 4° posto.",
  "ti13_tie_resolve_first_with_round_robin": "Spareggio per il 1° posto con un girone all'italiana al meglio di uno finché una squadra non vince due volte.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Si continua a giocare finché tutte le squadre non si sono affrontate almeno una volta. I risultati più recenti del girone all'italiana saranno usati per decidere il 2° e il 3° posto.",
  "ti13_tie_resolve_second_with_round_robin": "Spareggio per il 2° posto con un girone all'italiana al meglio di uno finché una squadra non vince due volte.",
  "ti13_tie_resolve_third_fourth_other": "Non vengono giocate altre partite. Le altre due squadre restano in parità per il 3° e il 4° posto.",
  "ti13_tie_resolve_four_way_1": "Le squadre verranno abbinate in modo casuale. Ai fini di queste regole, queste squadre verranno chiamate Squadra A, Squadra B, Squadra C e Squadra D.",
  "ti13_tie_resolve_four_way_2": "La Squadra A affronta la Squadra B al meglio di uno. La Squadra C affronta la Squadra D al meglio di uno.",
  "ti13_tie_resolve_four_way_3": "Spareggio per il 1° posto giocando un meglio di uno tra il vincitore di A/B e il vincitore di C/D.",
  "ti13_tie_resolve_four_way_4": "Spareggio per il 4° posto giocando un meglio di uno tra il perdente di A/B e il perdente di C/D.",
  "ti13_tie_resolve_four_way_5": "Spareggio per il 2° e il 3° posto giocando un meglio di uno tra le squadre rimanenti.",
  "ti13_seeding_decider_sp_rules": "Decisioni sulle selezioni - Regole della priorità di selezione",
  "ti13_seeding_decider_sp_rules_1": "Prima partita: la squadra meglio classificata della fase a gironi può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_seeding_decider_sp_rules_2": "Seconda partita: la squadra peggio classificata della fase a gironi può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_seeding_decider_sp_rules_3": "Terza partita (se applicabile): la squadra meglio classificata della fase a gironi può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_playoffs_and_ti_sp_rules": "Playoff e The International - Regole della priorità di selezione",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Lancio di una moneta.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Prima mappa: il vincitore del lancio della moneta può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Seconda mappa: il perdente del lancio della moneta può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Terza mappa (se applicabile): nuovo lancio di una moneta. Il vincitore del nuovo lancio può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Prima mappa: la squadra vincitrice del girone superiore può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Seconda mappa: la squadra vincitrice del girone inferiore può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Terza mappa: la squadra vincitrice del girone superiore può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Quarta mappa (se applicabile): la squadra vincitrice del girone inferiore può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Quinta mappa (se applicabile): lancio di una moneta. Il vincitore del lancio della moneta può decidere se scegliere la fazione o l'ordine di selezione degli Eroi.",
  "international2024_update_title": "TI 2024, Ringmaster e il Compendio",
  "ringmaster_hype": "\"Eroi ed Eroine, vittime di tutte le età! Il momento che stavate aspettando è finalmente arrivato.\\n\\n Da circa un anno di me esisteva solo il nome, appena sussurrato. Ero solo una povera ombra dietro una tenda rossa. Ma ora, dopo lunghi mesi (troppi, a mio parere), gli sciocchi responsabili di questo costume mi hanno finalmente permesso di benedirvi con la mia magnificenza mettendomi umilmente sotto i riflettori! Sono io, Cogliostro Kettle, maestro maligno! Terribile imbonitore di anime dannate! L'unico vero RINGMASTER! E ho diversi trucchetti nella manica!\"",
  "ringmaster_comic": "\"Ma non credermi sulla parola! Perché non leggi un fumetto sulle mie tragiche origini, raccontate da un narratore anonimo e affidabile?\"",
  "ringmaster_comic_title": "Il Burattino",
  "ringmaster_comic_desc": "Scopri le origini di Ringmaster in tournée con il circo meccanico di Kettle.",
  "ringmaster_guide": "\"Mi è stato chiesto di farti da guida nel Compendio di quest'anno, un'offerta che ho accettato con gratitudine. Dopotutto, dovremmo conoscerci meglio! [b]Cominciamo?\"[/b]",
  "ringmaster_introducing": "Vi presentiamo",
  "ringmaster_hero_detail_button": "Visita la pagina dell'Eroe",
  "ringmaster_play_trailer_button": "Guarda il trailer",
  "ringmaster_comic_button": "Leggi il fumetto",
  "international2024_compendium": "Compendio",
  "international2024_compendium_title": "Compendio del The International 2024",
  "international2024_effigies_title": "EFFIGI PER EROE",
  "international2024_effigies_subtitle": "Funzionalità aggiornata, gratuita per tutti",
  "international2024_effigies_intro": "\"Cari amici, c'è stato un periodo, non molto tempo fa, in cui queste magnifiche effigi erano davvero rare! Non più! Ora c'è un monumento pronto per ogni Titano che sta per entrare nel campo di battaglia, che si tratti del Ringmaster o di tutti gli altri Eroi minori!\"",
  "international2024_effigies_desc": "Le effigi sono statue posizionabili dei tuoi Eroi preferiti da mettere in mostra nella tua base. Invece di condividere un singolo slot globale, ogni Eroe ora ha il proprio slot dell'effigie nell'equipaggiamento dell'Arsenale.\\n\\nPuoi continuare a usare la nuova effigie predefinita per ogni Eroe, oppure crearne una tua ed equipaggiarla.",
  "international2024_purchase_intro": "\"Divinità e mostri, creep e bestioline varie, venite avanti e rifatevi gli occhi con [b]la più emozionante serie di partite, eventi e ricompense[/b] su questa sponda del fiume! Mettete alla prova la vostra arguzia, fortuna e coraggio con la celebrazione del più grande evento di eSport di questo regno e di qualunque altro!\"",
  "international2024_activities": "ECCO COSA VI ASPETTA",
  "international2024_activities_subtitle": "Giochi di sorte, imprese di abilità e delizie per tutte le età ",
  "international2024_activities_intro": "\"A differenza del vostro spietato presentatore, mi è stato detto che alcuni di voi hanno bisogno di un MOTIVO per uccidere. Perciò, cari amici, ogni partita a cui giocherete vi farà guadagnare punti! Più giocherete, più guadagnerete, quindi lanciatevi nelle corsie e cominciate ad accumulare punti!\"",
  "international2024_activities_play_title": "Gioca a Dota, guadagna punti",
  "international2024_activities_play_desc": "Quest'anno guadagnerai punti per quasi tutte le partite giocate tramite la sfida settimanale. Guadagnerai anche punti aggiuntivi per la tua prima vittoria di ogni giorno.",
  "international2024_activities_fantasy_title": "FantaDota",
  "international2024_activities_fantasy_desc": "Competi con i tuoi amici e con i giocatori di Dota in tutto il mondo. Scegli la migliore formazione di FantaDota dei tuoi professionisti preferiti e crea carte personalizzate con statistiche che fanno aumentare i punti.",
  "international2024_activities_oracles_title": "Sfida di Oracle",
  "international2024_activities_oracles_desc": "Fai pronostici sulle squadre che avanzeranno e quelle che retrocederanno, e beati dell'accuratezza dei tuoi pronostici (supponendo che tu li abbia azzeccati).",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Ottieni carte del Bingo generate casualmente per ogni fase del torneo, piene di condizioni bizzarre e situazioni interessanti.",
  "international2024_activities_outro": "\"Ricorda! La ricompensa non sta solo nella vittoria! Ogni volta che completerai con successo una di queste attività, guadagnerai punti! Vai al Banco dei premi qui sotto per scoprire quali chicche puoi accaparrarti con quei punti!\"",
  "international2024_rewards_title": "Ricompense del Compendio",
  "international2024_rewards_subtitle": "Fai un passo avanti e metti gli occhi su questi premi",
  "international2024_rewards_intro": "\"Ammassa quei cadaveri e riscatta i tuoi premi! Ahhh, e che SPLENDIDI premi ti attendono! No, non il premio inteso come la soddisfazione di vedere uno sventurato Eroe esalare il suo ultimo respiro mentre lo strangoli, perché questa è già una ricompensa IN SÉ! Questo è ciò che otterrai DOPO!\"",
  "international2024_rewards_physical_aegis_title": "Modello fisico dell'Egida",
  "international2024_rewards_physical_aegis_desc": "Riempi quel buco a forma di Egida sulla tua mensola e nel tuo cuore con una replica in lega di nichel in scala 1/5 del famoso premio.",
  "international2024_rewards_hud_title": "Interfaccia del The International 2024",
  "international2024_rewards_hud_desc": "Abbellisci la tua interfaccia di gioco con lo spirito del circo. Abbiamo rinnovato l'interfaccia in base al tema del TI di quest'anno.",
  "international2024_rewards_versus_title": "Schermata Versus 2024",
  "international2024_rewards_versus_desc": "Rinfresca il tuo spirito combattivo pre-partita con una schermata Versus personalizzata che mostra le nuove slot delle effigi degli Eroi.",
  "international2024_rewards_chat_wheels_title": "Frasi permanenti per la chat radiale",
  "international2024_rewards_stickers_title": "Adesivi di giocatori e squadre",
  "international2024_rewards_loading_screens_title": "Schermate di caricamento",
  "international2024_rewards_materials_title": "Miglioramenti del FantaDota e del Bingo",
  "international2024_rewards_teleport_fx_title": "Effetti del teletrasporto della squadra preferita",
  "international2024_rewards_effigy_title": "Blocco da Effigie 2024",
  "international2024_supporters_clubs_title": "Sostieni la Comunità",
  "international2024_supporters_clubs_subtitle": "Pacchetti di talenti e squadre per i tifosi",
  "international2024_supporters_clubs_intro": "\"Stimati benefattori! Filantropi di ogni età! Umili mecenati dell'arte di uccidere e di tutte le arti correlate! Il 50% della vostra magnanima generosità va direttamente a favore delle vostre squadre e dei commentatori preferiti! Chi è il vero Eroe? Io, ovviamente! Sto applaudendo con le mie gigantesche mani epiche per VOI!\"",
  "international2024_supporters_clubs_tiers_title": "Club dei tifosi delle squadre",
  "international2024_supporters_clubs_tiers_desc": "Scegli se essere un tifoso di Bronzo, Argento o Oro per le tue squadre preferite e ottieni le ricompense realizzate dalle squadre stesse.",
  "international2024_talent_tiers_title": "Pacchetti di adesivi dei talenti",
  "international2024_talent_tiers_desc": "Acquista i pacchetti di ricompense dei tuoi talenti preferiti. I pacchetti contengono adesivi, frasi e autografi in base al livello acquistato.",
  "ti13_compendium_small_header": "Sostieni il torneo",
  "ti13_compendium_header": "Compendio del The International 2024",
  "ti13_compendium_desc": "Il Compendio è il tuo compagno digitale interattivo per il The International. È un punto di riferimento unico per le attività legate agli eventi, le sfide e tutte le ricompense incentrate sugli eventi di quest'anno. Inoltre, il 25% di tutte le vendite contribuirà al montepremi del The International 2024.",
  "ti13_compendium_bp_btn": "Visita il sito",
  "ti13_compendium_standard": "Compendio standard",
  "ti13_compendium_standard_subtitle": "Tutte le funzionalità e le attività",
  "ti13_compendium_upgraded": "Compendio migliorato",
  "ti13_compendium_upgraded_subtitle": "Tutte le funzionalità e le attività più ricompense accelerate",
  "ti13_compendium_purchase_tp_fx": "Effetto del teletrasporto del TI 2024 (liv. 1)",
  "ti13_compendium_purchase_boosters_footnote": "I booster possono sbloccare contenuti aggiuntivi a tua scelta",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "I booster possono sbloccare l'interfaccia del The International 2024 o contenuti aggiuntivi a tua scelta",
  "ti13_compendium_purchase_levels": "%1$s livelli del Compendio",
  "ti13_compendium_purchase_booster_levels": "%1$s booster",
  "ti13_compendium_purchase_discount": "Risparmia il %1$s% sui livelli",
  "ti13_compendium_purchase_earn_the_following": "I livelli del Compendio sbloccheranno:",
  "ti13_compendium_contribution": "Il 25% di tutte le vendite si aggiungerà al montepremi del The International 2024.",
  "ti13_compendium_purchase_all_access": "L'accesso a tutte le funzionalità del Compendio",
  "ti13_compendium_purchase_aegis_emoticon": "Emoticon dell'Egida",
  "ti13_compendium_purchase_bingo_tokens": "%1$s gettoni del Bingo",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s rigenerazioni (FantaDota)",
  "ti13_compendium_purchase_one_player_sticker": "1 capsula di adesivi dei giocatori",
  "ti13_compendium_purchase_player_stickers": "%1$s capsule di adesivi dei giocatori",
  "ti13_compendium_purchase_team_stickers": "%1$s capsule di adesivi delle squadre",
  "ti13_compendium_purchase_effigy_blocks": "%1$s blocchi da Effigie del TI 2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s tesori con schermate di caricamento delle squadre",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s tesori con schermate di caricamento del TI",
  "international2024_tournament_learn_more": "Ulteriori informazioni sul torneo",
  "ringmaster_abilities_heading": "Abilità",
  "ringmaster_souvenirs_heading": "Souvenir",
  "ringmaster_ability_tame_the_beasts": "Domatore",
  "ringmaster_ability_tame_the_beasts_Description": "CANALIZZATA - Ringmaster fa roteare la frusta e poi la fa schioccare. I nemici frustati vengono danneggiati e fuggono spaventati da Ringmaster. Il tempo di canalizzazione aumenta esponenzialmente il danno e prolunga la durata dello spavento, ma ne riduce il raggio.",
  "ringmaster_ability_the_box": "Escapologia",
  "ringmaster_ability_the_box_Description": "Ringmaster racchiude se stesso o un Eroe alleato in una scatola mobile extradimensionale. L'alleato nella scatola può muoversi attraverso le Unità e ottiene e un bonus di resistenza ai rallentamenti, resistenza alla magia e velocità di movimento. L'alleato è inoltre non bersagliabile, ammutolito, silenziato e disarmato. La scatola si aprirà allo scadere dell'effetto o quando si allontana troppo.",
  "ringmaster_ability_impalement": "Arti d'impalamento",
  "ringmaster_ability_impalement_Description": "Ringmaster lancia uno dei suoi pugnali in un punto preciso a sua scelta. Se colpisce un nemico, il pugnale infligge danni da impatto, rallenta brevemente l'Unità colpita e infligge un danno pari a una percentuale della salute massima della vittima ogni secondo.",
  "ringmaster_ability_wheel": "Ruota delle meraviglie",
  "ringmaster_ability_wheel_Description": "Ringmaster fa girare la ruota delle meraviglie verso il punto bersagliato, respingendo di lato i nemici lungo il percorso. Una volta giunta a destinazione, i nemici nel raggio della ruota vengono rallentati e danneggiati nel tempo. Gli Eroi nemici che guardano la ruota per più di 0,5 secondi vengono incantati e attratti verso di essa. Il primo nemico a essere ipnotizzato fa scattare un timer per l'esplosione della ruota. Se il timer non viene attivato, la ruota esploderà automaticamente dopo 8 secondi.",
  "ringmaster_ability_spotlight": "Riflettore",
  "ringmaster_ability_spotlight_Description": "Ringmaster punta un riflettore su un'area. I nemici illuminati hanno una possibilità di mancare i loro attacchi e, se invisibili, di essere rivelati. Le illusioni colpite dal raggio svaniscono, perdendo una percentuale della loro salute massima ogni secondo.",
  "ringmaster_ability_dark_carnival_trinkets": "Ciarlatano del circo degli orrori",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ringmaster riceve un souvenir casuale monouso ogni volta che un Eroe nemico muore nelle vicinanze. I souvenir aggiuntivi vengono conservati come cariche. Se Ringmaster non ha souvenir quando rinasce, ne riceverà uno. I souvenir del circo degli orrori includono uno Specchio magico, un Tonico del forzuto e un Petofono.",
  "ringmaster_ability_funhouse_mirror": "Specchio magico",
  "ringmaster_ability_funhouse_mirror_Description": "Uso: Distorsione delle proporzioni\\n\\nCrea 1 immagine imperfetta del tuo Eroe che dura 18 secondi. La tua illusione infligge il 28% del danno e subisce il 300% del danno.",
  "ringmaster_ability_whoopee_cushion": "Petofono",
  "ringmaster_ability_whoopee_cushion_Description": "Uso: Petofono\\n\\nSpinge il tuo Eroe in avanti di 400 unità. Rilascia una nuvola puzzolente in un raggio di 200 per 3 secondi che rallenta i nemici del 30%.",
  "ringmaster_ability_strongman_tonic": "Tonico del forzuto",
  "ringmaster_ability_strongman_tonic_Description": "Uso: Bevuta forzata\\n\\nAumenta temporaneamente la Forza di un Eroe alleato di 5 più 1,5 per livello di Ringmaster per 8 secondi. L'effetto dura 4 secondi e poi si deteriora nel corso della durata."
}