// 7585.js

{
  "language": "czech",
  "international2023_compendium_activity": "Aktivita pro vlastníky Přehledu",
  "international2023_update_title": "Šampionát The International 2023",
  "international2023_update_subtitle": "Oslavy jsou v plném proudu a zváni jsou všichni hráči!",
  "international2023_update_body": "Tahle aktualizace má něco pro všechny, takže čtěte dál, ať už doslova visíte na každé sekundě šampionátu The International, nebo ani pořádně nevíte, že se něco takového hraje, a chcete jen v klidu bránit svého Ancienta.\\n\\nŽerete e-sport? Sestavte si vysněný tým profíků a zúčastněte se vylepšené <b>soutěže Fantasy týmů</b>. Spíš dáváte přednost věštění? Vyplňte všechna políčka <b>tipovacích výzev</b>. A jestli náhodou ujíždíte na hrách převážně pro seniory, letos Vám uděláme radost. Máme <b>bingo</b>!\\n\\nAle možná Vás nic z tohohle nezajímá a jen se rádi díváte do zrcadla. Inu, i pro Vás něco máme. Díky <b>přehlídce profilu</b> si totiž z profilu můžete udělat interaktivní památník své osoby zdobený všemi předměty a úspěchy, které se na něj vejdou!",
  "international2023_update_footer": "Dočetli jste až na konec stránky. Dobrá práce!",
  "international2023_compendium": "Přehled",
  "international2023_compendium_title": "Přehled šampionátu The International 2023",
  "international2023_compendium_intro": "Přehled šampionátu The International 2023 je Vaším interaktivním průvodcem největší událostí letošního roku.\\n\\nZahrajte si na profesionály v dovednostních výzvách. Vytřete všem zrak se svojí skvadrou v předělané a vylepšené soutěži Fantasy týmů. Otestujte své věštecké schopnosti na všech fázích šampionátu. Nebo si odneste jackpot ze zbrusu nových bingo kartiček.\\n\\nPřehled zkrátka na jednom místě přehledně shromažďuje všechny aktivity, výzvy a odměny související s letošním ročníkem šampionátu. A 25 % z ceny každého prodaného Přehledu jde do celkové výhry!",
  "international2023_showcase_title": "Přehlídka profilu",
  "international2023_showcase_subtitle": "Novinka pro všechny hráče",
  "international2023_showcase_intro": "Profil a mini-profil byly od základu přepracovány, takže ode dneška můžete (pokud tedy patříte mezi 98 % hráčů se skóre komunikace vyšším než 6 000 bodů) v přehlídce vystavit všechny své předměty a úspěchy. Nebo lépe řečeno, můžete tam vystavit úplně cokoli!\\n\\nChcete mít na profilu svatyni svého oblíbeného profi týmu z roku 2016? Jak je ctěná libost. Kolekci nejlepších setů kosmetických předmětů? Jistě. Všechny páry Kunkkových bot? Ano, bohužel i to jde.",
  "international2023_showcase_profile_title": "Nový profil",
  "international2023_showcase_profile_desc": "Nyní jste umělci a profil je Vaším plátnem, kde jste omezeni pouze svojí představivostí. A základními pravidly slušnosti...",
  "international2023_showcase_mini_profile_title": "Nový mini-profil",
  "international2023_showcase_mini_profile_desc": "Mini-profil je něco jako profil, ale s jedním podstatným rozdílem: je menší. Fakticky! A ostatní hráči ho vidí, kdykoli myší najedou na Vaše jméno. Jo, i kdyby nechtěli.",
  "international2023_showcase_carousel_title": "Ukázkové přehlídky",
  "international2023_showcase_items_title": "Položky přehlídky",
  "international2023_showcase_items_desc": "Do přehlídek jde nacpat celá škála kosmetických předmětů, odměn a dalších věcí, které se Vám za roky hraní nakupily ve zbrojnici.",
  "international2023_showcase_item_heroes_title": "Hrdinové",
  "international2023_showcase_item_trophies_title": "Trofeje",
  "international2023_showcase_item_stickers_title": "Samolepky",
  "international2023_showcase_item_stats_title": "Statistiky",
  "international2023_showcase_item_chat_wheels_title": "Zvuky a hlášky",
  "international2023_showcase_item_sprays_title": "Spreje",
  "international2023_showcase_item_items_title": "Kosmetické předměty",
  "international2023_showcase_item_emoticons_title": "Emotikony",
  "international2023_showcase_item_loading_screens_title": "Načítací obrazovky",
  "international2023_showcase_item_couriers_title": "Kurýři",
  "international2023_showcase_item_wards_title": "Wardy",
  "international2023_tournament_prize_pool": "Celková výhra",
  "international2023_tournament_prize_pool_percent": "25 % z ceny každého prodaného Přehledu putuje do celkové výhry šampionátu The International 2023.",
  "international2023_tournament_learn_more": "Zjistit více o šampionátu",
  "international2023_quests_title": "Dovednostní výzvy",
  "international2023_quests_intro": "Dívali jste se na profesionální hráče. Fandili jste jim. A teď se jimi můžete stát. Využijte příležitosti, usedněte do pomyslných křesel svých favoritů a prožijte jejich nejdůležitější milníky z cesty na šampionát The International – vyhrávejte jako hrdinové z konkrétních zápasů nebo ukažte, že ovládáte nejhranější hrdiny svého idolu. Na konci každé výzvy Vás čeká bodová odměna, která je ještě navýšena, když pokoříte celý měsíc.",
  "international2023_quests_match_title": "Výzvy zápasů",
  "international2023_quests_match_desc": "Vyhrajte s hrdiny, kteří byli vybráni ve skutečném zápase.",
  "international2023_quests_pro_title": "Výzvy hráčů",
  "international2023_quests_pro_desc": "Vyhrajte s hrdiny, které daný měsíc nejčastěji hrál některý z profesionálů.",
  "international2023_quests_rewards_title": "Odměny výzev",
  "international2023_quests_rewards_desc": "Získávejte body Přehledu a nárokujte si odměny ze široké nabídky tematických předmětů.",
  "international2023_fantasy_title": "Evoluce Fantasy týmů",
  "international2023_fantasy_intro": "Sestavte si z profíků svůj tým snů. Upravte jejich statistiky, aby Vám akce reálných předobrazů vynášely co nejvíc bodů. Překonejte ostatní hráče z celého světa. Aneb stará dobrá soutěž Fantasy týmů. Akorát ve všech ohledech lepší!",
  "international2023_fantasy_players_title": "Soupiska",
  "international2023_fantasy_players_desc": "Vyberte do svého týmu po jednom core, mid a support hráči. Na výběr je z účastníků šampionátu.",
  "international2023_fantasy_craft_title": "Tituly a prapory",
  "international2023_fantasy_craft_desc": "Používejte obnovovací žetony nabízené Přehledem a zkuste pro každého svého hráče získat ty nejlepší bonusy. Ale pozor, ne každý hráč profituje ze všech bonusů.",
  "international2023_fantasy_compete_title": "Bodování",
  "international2023_fantasy_compete_desc": "Každý víkend šampionátu je oddělené kolo soutěže Fantasy týmů, takže budete mít několik šancí ukázat záda svým přátelům i celému světu. A když to dotáhnete obzvlášť vysoko, odnesete si jedinečnou trofej.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Dostáváte husí kůži, když se profesionální tým odhodlá koupit Divine Rapier? Nebo když zápas překlene 80. minutu a věci začnou být divnější než obvykle? A co když tým s hrdiny, kteří mají dohromady 16 nohou, zadupe tým jenom se čtyřma nohama?\\n\\nNaše bingo kartičky Vás konečně nechají husí kůži prodat a zbohatnout na některých skutečně šílených událostech.",
  "international2023_bingo_cards_title": "Jedna kartička na víkend",
  "international2023_bingo_cards_desc": "Všichni vlastníci Přehledu získají na každý víkend šampionátu jednu náhodně vygenerovanou bingo kartičku a podle políček s prazvláštními podmínkami zjistí, v jaké situace mají při zápasech profíků doufat.",
  "international2023_bingo_rewards_title": "Řádky, sloupce a body",
  "international2023_bingo_rewards_desc": "Nenechte se zmást bohy, démony ani pivními pupky hrdinů, tahle minihra je pořád jenom bingo. Až tedy na své kartičce dokončíte řádku, sloupec nebo diagonálu, můžete si vyzvednout odměnu v podobě bodů Přehledu. Zvolání „BINGO“ není povinné, ale doporučuje se.",
  "international2023_predictions_title": "Tipovací výzvy",
  "international2023_predictions_intro": "Věděli jste, že Oracle vidí do budoucnosti díky napojení na astrální magii? A věděli jste, že nic jako astrální magie doopravdy neexistuje? Takže pokud se budete chtít předvést v tipovacích výzvách, budete se muset spolehnout na svoji mazanost, e-sportovní znalosti a především na své nejlepší odhady.\\n\\nKonkrétně si můžete tipnout, které týmy během jednotlivých víkendů šampionátu vyhrají, a které naopak odjedou domů. Správné tipy (respektive „vidiny“) Vám pak zajistí body Přehledu.",
  "international2023_predictions_group_stage_title": "Tipy na skupinovou fázi",
  "international2023_predictions_group_stage_desc": "Letos poprvé je možné tipovat také pořadí týmů ve skupinách během první fáze šampionátu.",
  "international2023_predictions_ingame_title": "Tipy při zápasech",
  "international2023_predictions_ingame_desc": "Když si zápas šampionátu pustíte přímo ve hře nebo na Twitchi, můžete před zazněním startovního rohu zadat své tipy na několik sledovaných statistik. Každý den jde takhle získat body až za šest správných tipů.",
  "international2023_rewards_title": "Odměny Přehledu",
  "international2023_rewards_intro": "Jste-li fanoušky kompetitivní Doty a fanoušky odměňování fanoušků kompetitivní Doty, letošek si zamilujete, protože Přehled šampionátu The International 2023 je svými odměnami výhradně zaměřen na šampionát a profesionální scénu.",
  "international2023_rewards_physical_aegis_title": "Slitinová replika Aegisu",
  "international2023_rewards_physical_aegis_desc": "Replika slavné trofeje v měřítku 1 ku 5 ze slitiny niklu. Vystavte ji všem na odiv! Vystavte ji na odiv pouze sobě! Nebo ji roztavte a vytvořte si vlastní měnu!",
  "international2023_rewards_chat_wheels_title": "Permanentní zvuky a hlášky",
  "international2023_rewards_chat_wheels_desc": "Na rozdíl od předchozích ročníků, letos jsou všechny zvuky a hlášky chatovacího kolečka permanentní. Takže nezmizí po skončení šampionátu. Nikdy. Kapiš?",
  "international2023_rewards_stickers_title": "Samolepky hráčů a týmů",
  "international2023_rewards_stickers_desc": "„Jaké samolepky?“ Že Vy jste ani nečetli nadpis, přiznejte se. Přitom tady jde hlavně o ty nadpisy! Popisky jsou pak jenom staré noviny, které mají nadpisy ochránit při cestě do očí.",
  "international2023_rewards_hud_title": "Vzhled ukazatelů",
  "international2023_rewards_hud_desc": "Předchozí odstavec mohl leckoho odradit od čtení popisků, ale Vy jste zůstali. A tím pádem prošli testem, protože tenhle popisek má informace nezahrnuté v nadpisu: nový vzhled ukazatelů připomíná barevné sklo, které je motivem letošního ročníku šampionátu.",
  "international2023_rewards_loading_screens_title": "Načítací obrazovky",
  "international2023_rewards_loading_screens_desc": "Všechny načítací obrazovky jsou tematicky sladěné s letošním šampionátem, ale zatímco jedny se dělí podle týmů, jiné jsou obecnější.",
  "international2023_rewards_materials_title": "Pomocné předměty",
  "international2023_rewards_materials_desc": "Využijte obnovovací žetony pro získání lepších hráčů do Fantasy týmů nebo si sekyrou usnadněte obzvlášť těžkou dovednostní výzvu.",
  "international2023_rewards_teleport_fx_title": "Efekty teleportu",
  "international2023_rewards_teleport_fx_desc": "Fanděte svému oblíbenému týmu i prostřednictvím efektu teleportu se třemi úrovněmi.",
  "international2023_rewards_Types_title": "Typy odměn",
  "international2023_rewards_Types_desc": "Každý typ odměny má svůj vlastní ukazatel postupu. Jakmile se tento ukazatel naplní, můžete si vyzvednout danou odměnu. Některé ukazatele lze naplňovat (a odměny vyzvedávat) stále dokola, zatímco jiné jsou omezeny počtem vyzvednutí.",
  "international2023_rewards_Levels_title": "Úrovně Přehledu",
  "international2023_rewards_Levels_desc": "Úrovně Přehledu můžete získávat z různých aktivit nebo nakupováním balíčků úrovní. Použitím úrovní Přehledu jsou navýšeny ukazatele postupu všech dostupných typů odměn.",
  "international2023_rewards_Boosters_title": "Bonusy Přehledu",
  "international2023_rewards_Boosters_desc": "Bonusy jsou podobné úrovním, akorát jsou používány k navýšení postupu u jedné odměny, o kterou máte největší zájem. Ať už ale bonus použijete na cokoli, vždy je navýšen také postup u repliky Aegisu.",
  "international2023_supporters_clubs_title": "Fanouškovské kluby",
  "international2023_supporters_clubs_subtitle": "Podpořte přímo své oblíbené týmy",
  "international2023_supporters_clubs_intro": "Odměny fanouškovských klubů jsou jako mládí a musíte si je užít, dokud je máte. Nebo tomu tak alespoň bylo dřív. Od teď jsou totiž permanentní a můžete si je užívat navždy! Nebo dokud Vás nesejme autobus.\\n\\nCo víc, polovina výtěžku z prodejů putuje přímo danému týmu. Výhra pro obě strany!",
  "international2023_supporters_clubs_tiers_title": "Tři úrovně členství",
  "international2023_supporters_clubs_tiers_desc": "Vyberte si bronzové, stříbrné nebo zlaté členství a získejte odměny navržené přímo podporovaným týmem.",
  "international2023_talent_title": "Samolepky uvaděčů",
  "international2023_talent_subtitle": "Podpořte přímo své oblíbené osobnosti",
  "international2023_talent_intro": "Komentování přímých přenosů e-sportovních událostí je dřina. Ne teda taková jako fárání uhlí, ale větší než cukrařina. Pochopitelně se najdou i složité dorty, třeba různé vícepatrové s figurkami, ale v základu se chápeme, ne?\\n\\nNicméně, ode dneška můžete svému milovanému uvaděči poslat zprávu, že respektujete, co dělá. Sice ne tak moc, jako respektujete horníky, ale víc, než polovinu lidí živících se cukrařinou. A zároveň mu vlastně polovinu z ceny samolepky pošlete jako dar.",
  "international2023_talent_tiers_title": "Úrovně podpory",
  "international2023_talent_tiers_desc": "Podpora uvaděčů probíhá skrze balíčky jejich předmětů. V závislosti na úrovni balíčku se tak můžete těšit na samolepky, hlášky nebo třeba autogramy.",
  "international2023_talent_coming_soon": "Balíčky bude možné zakoupit, až oznámíme zúčastněné uvaděče.",
  "international2023_coming_soon": "Již brzy",
  "ti12_bp_countdown_header": "skupinové fáze",
  "ti12_bp_countdown_desc": "Největší e-sportovní událost roku se blíží – sledujte živě, kdo v Seattlu pozvedne nad hlavu trofej Aegis of Champions!",
  "ti12_bp_tournament_complete_desc": "Prožijte znovu ty nejlepší momenty z největší e-sportovní události roku. Archiv ze Seattlu je vzdálen pouhé jedno kliknutí!",
  "ti12_group_stage_venue": "Online",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Přispějte do celkové výhry",
  "ti12_compendium_header": "Přehled šampionátu The International 2023",
  "ti12_compendium_desc": "Získejte maximum ze šampionátu The International 2023 pomocí jeho Přehledu! Zahrajte si na profesionály v dovednostních výzvách. Sestavte si vysněný tým profíků a vypalte rybník ostatním hráčům v předělané soutěži Fantasy týmů. Otestujte své věštecké schopnosti v tipovacích výzvách. A doufejte, že při zápasech dojde na neobvyklé situace, které máte v bingo kartičce.\\n\\nOdměnami Vám budou samolepky hráčů i týmů, zvuky chatovacího kolečka, tematický vzhled ukazatelů nebo replika trofeje Aegis of Champions.\\n\\nCo víc, 25 % z ceny každého prodaného Přehledu jde přímo do celkové výhry šampionátu.",
  "ti12_compendium_standard": "Standardní Přehled",
  "ti12_compendium_upgraded": "Vylepšený Přehled"
}