// 17.js

{
  "language": "ukrainian",
  "ringmastercomic_title_cover": "Лялька — обкладинка",
  "ringmastercomic_title": "Лялька — сторінка %1$s",
  "ringmastercomic_help_text": "Клацніть зображення або натисніть клавішу пробілу для переходу далі",
  "ringmastercomic_return_button": "Повернутися до обкладинки",
  "ti13_online": "Копенгаген",
  "ti13_main_event_venue": "Royal Arena в Копенгагені",
  "ti13_best_of_three": "До двох перемог",
  "ti13_best_of_five": "До трьох перемог",
  "ti13_group_stage_sp_rules": "Груповий етап — правила пріоритету вибору",
  "ti13_group_stage_sp_game1": "Підкидання монетки.",
  "ti13_group_stage_sp_game2": "Перша гра: переможець у підкиданні монетки обирає між вибором героя та стороною.",
  "ti13_group_stage_sp_game3": "Друга гра: переможений у підкиданні монетки обирає між вибором героя та стороною.",
  "ti13_group_stage_sp_game4": "Третя гра (за потреби): новий переможець у підкиданні монетки обирає між вибором героя та стороною.",
  "ti13_group_stage_tie_rules": "Груповий етап — правила додаткових матчів",
  "ti13_first_second_tie": "Дві команди ділять 1-ше і 2-ге місце",
  "ti13_second_third_tie": "Дві команди ділять 2-ге і 3-тє місце",
  "ti13_third_fourth_tie": "Дві команди ділять 3-тє і 4-те місце",
  "ti13_three_way_first_tie": "Три команди ділять 1-ше місце",
  "ti13_three_way_second_tie": "Три команди ділять 2-ге місце",
  "ti13_four_way_tie": "Чотири команди ділять 1-ше місце",
  "ti13_tie_resolve_bo3": "Вирішується грою до двох перемог.",
  "ti13_tie_resolve_third_fourth": "Подальші матчі не проводяться. Дві команди продовжують ділити 3-тє й 4-те місце.",
  "ti13_tie_resolve_first_with_round_robin": "Для визначення 1-го місця команди грають по колу один матч, доки одна команда не виграє двічі.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Ігри продовжуються, доки всі команди не зіграють одна з одною хоча б раз. Для визначення 2-го і 3-го місця використовуються результати останнього кола.",
  "ti13_tie_resolve_second_with_round_robin": "Для визначення 2-го місця команди грають по колу один матч, доки одна команда не виграє двічі.",
  "ti13_tie_resolve_third_fourth_other": "Подальші матчі не проводяться. Інші дві команди продовжують ділити 3-тє й 4-те місце.",
  "ti13_tie_resolve_four_way_1": "Команди поєднуються випадковим чином. У контексті цих правил назвімо їх «Команда А», «Команда Б», «Команда В» і «Команда Г».",
  "ti13_tie_resolve_four_way_2": "«Команда А» грає з «Командою Б» один матч. «Команда В» грає з «Командою Г» один матч.",
  "ti13_tie_resolve_four_way_3": "Перше місце визначається одним матчем між переможцями пари А/Б й пари В/Г.",
  "ti13_tie_resolve_four_way_4": "Четверте місце визначається одним матчем між переможеними в парі А/Б й парі В/Г.",
  "ti13_tie_resolve_four_way_5": "2-ге і 3-тє місця визначаються одним матчем між двома командами, що лишилися.",
  "ti13_seeding_decider_sp_rules": "Визначення посіву — правила пріоритету вибору",
  "ti13_seeding_decider_sp_rules_1": "Перша гра: вищий посів із групового етапу обирає між вибором героя та стороною.",
  "ti13_seeding_decider_sp_rules_2": "Друга гра: нижчий посів із групового етапу обирає між вибором героя та стороною.",
  "ti13_seeding_decider_sp_rules_3": "Третя гра (за потреби): вищий посів із групового етапу обирає між вибором героя та стороною.",
  "ti13_playoffs_and_ti_sp_rules": "Плейоф і The International — правила пріоритету вибору",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Підкидання монетки.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Перша мапа: переможець у підкиданні монетки обирає між вибором героя та стороною.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Друга мапа: переможений у підкиданні монетки обирає між вибором героя та стороною.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Третя мапа (за потреби): новий переможець у підкиданні монетки обирає між вибором героя та стороною.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Перша мапа: переможець верхньої сітки обирає між вибором героя та стороною.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Друга мапа: переможець нижньої сітки обирає між вибором героя та стороною.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Третя мапа: переможець верхньої сітки обирає між вибором героя та стороною.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Четверта мапа (за потреби): переможець нижньої сітки обирає між вибором героя та стороною.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "П’ята мапа (за потреби): підкидання монетки; переможець у підкиданні монетки обирає між вибором героя та стороною.",
  "international2024_update_title": "The International 2024, Циркмейстер і компендіум",
  "ringmaster_hype": "«Лічі та луни, сларки та марсі, жертви будь-якого віку! Момент, на який ви всі так чекали, врешті настав.\\n\\n Уже майже рік я відомий вам тільки за йменням, що промовляють пошепки, і за тінню позаду червоної завіси. Та після довгого очікування (занадто довгого, як на мене) довбні, що відповідають за цю виставу, нарешті спромоглися дати мені можливість благословити вас своєю величністю, і зайняти своє скромне місце під світлом софітів! Це я, Мехаліостро Кетл — лиховісний маестро! Темний пес проклятих! Єдиний і неповторний ЦИРКМЕЙСТЕР! У моєму рукаві сховано чимало фокусів!»",
  "ringmaster_comic": "«Однак не вірте мені на слово! Чому б не прочитати комікс про трагічну історію мого походження, яку розповів вартий довіри анонімний оповідач?»",
  "ringmaster_comic_title": "Лялька",
  "ringmaster_comic_desc": "Прочитайте про ранні часи Циркмейстера, коли він гастролював із «Механічним цирком Кетла».",
  "ringmaster_guide": "«Мені запропонували провести вас цьогорічним компендіумом — і я великодушно прийняв цю пропозицію. Зрештою, нам слід познайомитися ближче! [b]Тож розпочнімо![/b]»",
  "ringmaster_introducing": "Представляємо",
  "ringmaster_hero_detail_button": "Дивитися сторінку героя",
  "ringmaster_play_trailer_button": "Дивитися трейлер",
  "ringmaster_comic_button": "Читати комікс",
  "international2024_compendium": "Компендіум",
  "international2024_compendium_title": "Компендіум The International 2024",
  "international2024_effigies_title": "СТАТУЇ ГЕРОЇВ",
  "international2024_effigies_subtitle": "Оновлена функція, безкоштовна для всіх",
  "international2024_effigies_intro": "«Були часи, друзі мої, і не так давно, коли ці великі статуї траплялися дуже нечасто! Більше не так! Тепер на кожного титана, що готується ввійти на поле бою, чекає монумент — чи то мій, чи то якихось менш значних героїв!»",
  "international2024_effigies_desc": "Статуї — це скульптури ваших улюблених героїв, якими можна похвалитися в себе на базі. Якщо раніше всі герої мали спільну глобальну ланку, тепер кожен герой має свою ланку для статуї в спорядженні в зброярні.\\n\\nМожете лишити нову стандартну статую для будь-якого героя або ж виготовити та спорядити власну.",
  "international2024_purchase_intro": "«Боги й чудовиська, кріпи і тварюки, підійміться та спрямуйте свій щасливий погляд на [b]найзахопливішу колекцію ігор, подій і кіберспортивних нагород[/b] по цей бік річки! Випробуйте свою кмітливість, свою удачу та свою мужність під час святкування найвизначнішої кіберспортивної події в цьому світі та за його межами!»",
  "international2024_activities": "ОСЬ ЩО ВИ ОТРИМАЄТЕ",
  "international2024_activities_subtitle": "Ігри шансів, демонстрація навичок і розваги на будь-який вік ",
  "international2024_activities_intro": "«На відміну від вашого зашкарублого церемоніймейстера, я знаю, що вам потрібна ПРИЧИНА для вбивства. Тож тепер, друзі, за кожну зіграну гру ви отримуватимете очки! Чим більше граєте, тим більше отримуєте! Застрибуйте на лінії й дивіться, як росте гора очок!»",
  "international2024_activities_play_title": "Грайте в Dota, заробляйте очки",
  "international2024_activities_play_desc": "Цього року ви зароблятимете очки майже за кожну гру зі щотижневого випробування. Також ви щодня зароблятимете додаткові очки за першу перемогу.",
  "international2024_activities_fantasy_title": "Фентезі",
  "international2024_activities_fantasy_desc": "Змагайтеся проти своїх друзів та гравців у Dota з усього світу. Оберіть найкращий склад фентезі-команди зі своїх улюблених професіоналів і створіть власні картки зі статистикою, яка покращує очки.",
  "international2024_activities_oracles_title": "Випробування Оракула",
  "international2024_activities_oracles_desc": "Передбачте, які команди пройдуть далі, а які залишать турнір, і насолоджуйтеся точністю своїх прогнозів (якщо вгадаєте).",
  "international2024_activities_bingo_title": "Бінґо",
  "international2024_activities_bingo_desc": "Отримайте випадково згенеровані картки бінґо для кожного етапу турніру, сповнені дивацьких умов та цікавих ситуацій.",
  "international2024_activities_outro": "«Пам’ятайте! Перемога — це не просто нагорода само собою! Успішне виконання кожного з цих занять приноситиме вам очки! Перейдіть до призової ятки нижче і гляньте, які товари ви можете за них купити!»",
  "international2024_rewards_title": "Нагороди компендіуму",
  "international2024_rewards_subtitle": "Підходьте й погляньте на ці призи",
  "international2024_rewards_intro": "«Поскладайте ці тіла в одну високу купу й отримуйте свої нагороди! Ох, і ЯКІ ж нагороди на вас чекають! І я не про нагороду у вигляді ваших рук навколо ворожого горла й безпомічного погляду вмираючого героя. Це САМЕ ПО СОБІ є нагородою! А я про те, що буде ПІСЛЯ цього!»",
  "international2024_rewards_physical_aegis_title": "Фізична копія Еґіди",
  "international2024_rewards_physical_aegis_desc": "Заповніть порожнечу у формі Еґіди на своїй полиці та у своєму серці за допомогою цієї ексклюзивної зменшеної вп’ятеро репродукції легендарного трофея з нікелевого сплаву.",
  "international2024_rewards_hud_title": "Стиль інтерфейсу The International 2024",
  "international2024_rewards_hud_desc": "Прикрасьте внутрішньоігровий інтерфейс духом цирку. Ми оновили дизайн відповідно до тематики цьогорічного The International.",
  "international2024_rewards_versus_title": "Екран поєдинку 2024",
  "international2024_rewards_versus_desc": "Освіжіть свій бойовий дух перед боєм за допомогою нестандартного екрана поєдинку, що демонструє нові статуї героїв.",
  "international2024_rewards_chat_wheels_title": "Постійні колеса чату",
  "international2024_rewards_stickers_title": "Наліпки гравців і команд",
  "international2024_rewards_loading_screens_title": "Заставки",
  "international2024_rewards_materials_title": "Підсилення для фентезі-ліги й бінґо",
  "international2024_rewards_teleport_fx_title": "Ефекти телепортації улюбленої команди",
  "international2024_rewards_effigy_title": "Пам’ятний блок 2024",
  "international2024_supporters_clubs_title": "Підтримайте спільноту",
  "international2024_supporters_clubs_subtitle": "Комплекти підтримки талантів і гравців",
  "international2024_supporters_clubs_intro": "«Поважні благодійники! Філантропи будь-якого віку! Скромні покровителі вбивства та вбивчих мистецтв! 50% від ваших великодушних щедрот піде безпосередньо вашій улюбленій команді й талантам трансляцій! Хто тут справжній герой? Та я, звісно ж! Плескаю свої величезними героїчними руками на ВАШУ честь!»",
  "international2024_supporters_clubs_tiers_title": "Клуби підтримки команд",
  "international2024_supporters_clubs_tiers_desc": "Обирайте бронзовий, срібний чи золотий ступінь підтримки улюблених команд, щоб отримати нагороди, створені самими командами.",
  "international2024_talent_tiers_title": "Набори з наліпками талантів",
  "international2024_talent_tiers_desc": "Купуйте комплекти нагород зі своїм улюбленим талантом. Комплекти містять набір наліпок, голосових фраз і автографів, залежно від ступеня придбаного комплекту.",
  "ti13_compendium_small_header": "Підтримайте турнір",
  "ti13_compendium_header": "Компендіум The International 2024",
  "ti13_compendium_desc": "Компендіум — це ваш інтерактивний цифровий компаньйон до The International. Єдине місце для всіх занять, випробувань і нагород, пов’язаних із цьогорічною подією. Окрім цього, 25% від усіх продажів поповнюватимуть призовий фонд The International 2024.",
  "ti13_compendium_bp_btn": "Сайт",
  "ti13_compendium_standard": "Стандартний компендіум",
  "ti13_compendium_standard_subtitle": "Усі особливості та заняття",
  "ti13_compendium_upgraded": "Покращений компендіум",
  "ti13_compendium_upgraded_subtitle": "Усі функції та заняття, а також прискорені нагороди",
  "ti13_compendium_purchase_tp_fx": "Ефект телепортації 1-го рівня 2024",
  "ti13_compendium_purchase_boosters_footnote": "Посилювачі розблоковують додатковий уміст на ваш вибір",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Посилювачі можуть розблокувати стиль інтерфейсу The International 2024 чи додатковий уміст на ваш вибір",
  "ti13_compendium_purchase_levels": "Рівні компендіуму (%1$s)",
  "ti13_compendium_purchase_booster_levels": "Посилювачі (%1$s)",
  "ti13_compendium_purchase_discount": "Заощадьте %1$s% на рівнях",
  "ti13_compendium_purchase_earn_the_following": "Рівні компендіуму розблокують:",
  "ti13_compendium_contribution": "25% від усіх придбань поповнюватимуть призовий фонд The International 2024.",
  "ti13_compendium_purchase_all_access": "Доступ до всіх функцій компендіуму",
  "ti13_compendium_purchase_aegis_emoticon": "Смайлик Еґіди",
  "ti13_compendium_purchase_bingo_tokens": "Жетони бінґо (%1$s)",
  "ti13_compendium_purchase_fantasy_tokens": "Заміни для фентезі-ліги (%1$s)",
  "ti13_compendium_purchase_one_player_sticker": "1 капсула з наліпками гравців",
  "ti13_compendium_purchase_player_stickers": "Капсули з наліпками гравців (%1$s шт.)",
  "ti13_compendium_purchase_team_stickers": "Капсули з наліпками команд (%1$s шт.)",
  "ti13_compendium_purchase_effigy_blocks": "Пам’ятні блоки TI 2024 (%1$s)",
  "ti13_compendium_purchase_team_loading_screens": "Скарбниці із заставками команд (%1$s шт.)",
  "ti13_compendium_purchase_ti_loading_screens": "Скарбниці із заставками TI (%1$s шт.)",
  "international2024_tournament_learn_more": "Докладніше про турнір",
  "ringmaster_abilities_heading": "Здібності",
  "ringmaster_souvenirs_heading": "Сувеніри",
  "ringmaster_ability_tame_the_beasts": "Приручення звірів",
  "ringmaster_ability_tame_the_beasts_Description": "ЧАКЛУЄТЬСЯ. Циркмейстер закручує свій батіг, а потім б’є ним. Уражені вороги зазнають шкоди й перелякано тікають від Циркмейстера. Час чаклування збільшує шкоду й час страху, але зменшує радіус дії.",
  "ringmaster_ability_the_box": "Номер із ящиком",
  "ringmaster_ability_the_box_Description": "Циркмейстер упаковує себе або союзного героя в мобільний міжвимірний ящик. Істоти в ящику здобувають фазисний рух, опір сповільненню, додатковий опір магії й додаткову швидкість руху. На них також не можна націлитися, вони заглушені, знемовлені та роззброєні. Ящик розкриється, коли завершиться його час дії або герой вийде за межі радіусу дії.",
  "ringmaster_ability_impalement": "Мистецтво метання",
  "ringmaster_ability_impalement_Description": "Циркмейстер влучно кидає один зі своїх кинджалів в обрану ним точку. Якщо він влучає у ворога, то кинджал завдає шкоду від удару, ненадовго сповільнює вражену ціль та щосекунди завдає відсоток від максимального здоров’я жертви як шкоду.",
  "ringmaster_ability_wheel": "Колесо чудес",
  "ringmaster_ability_wheel_Description": "Циркмейстер запускає колесо чудес у цільове місце, яке відкидає ворогів на своєму шляху вбік. Коли воно досягає цілі, вороги в радіусі дії зазнають періодичної шкоди і сповільнюються. Вороги, що дивляться на колесо протягом понад 0,5 с, гіпнозуються, і воно їх притягує. Перший зачарований ворог запускає лічильник вибуху колеса. Якщо лічильник не запущено, то колесо вибухне автоматично через 8 с.",
  "ringmaster_ability_spotlight": "У світлі софіта",
  "ringmaster_ability_spotlight_Description": "Циркмейстер запалює лампу на софіті, світло від якої рухається областю. Освітлені вороги мають шанс схибити атакою, а також виявляються, якщо вони невидимі. Ілюзії під світлом софіта тануть, утрачаючи відсоток свого максимального здоров’я щосекунди.",
  "ringmaster_ability_dark_carnival_trinkets": "Темний карнавал",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Циркмейстер здобуває випадковий сувенір темного карнавалу для разового використання щоразу, коли поблизу помирає ворожий герой. Додаткові сувеніри зберігаються як заряди. Якщо Циркмейстер не має сувенірів після відродження, то отримає один. Сувеніри темного карнавалу: Криве дзеркало, Тонік силача та Курйозна подушка.",
  "ringmaster_ability_funhouse_mirror": "Криве дзеркало",
  "ringmaster_ability_funhouse_mirror_Description": "Спотворення пропорцій (використання)\\n\\nСтворює 1 недосконалий образ героя, що живе 18 с. Ілюзії завдають 28% шкоди й зазнають 300% шкоди.",
  "ringmaster_ability_whoopee_cushion": "Курйозна подушка",
  "ringmaster_ability_whoopee_cushion_Description": "Ой (використання)\\n\\nПросуває вашого героя вперед на відстань 400. Лишає позаду смердючу хмару радіусом 200, що триває 3 с і сповільнює ворогів на 30%.",
  "ringmaster_ability_strongman_tonic": "Тонік силача",
  "ringmaster_ability_strongman_tonic_Description": "Примусове поглинання (використання)\\n\\nТимчасово збільшує силу союзного героя на 5 + 1,5 за рівень Циркмейстера впродовж 8 с. Ефект триває 4 с і потім поступово слабшає."
}