// 8600.js

{
  "language": "italian",
  "international2023_compendium_activity": "Attività per gli utenti del Compendio",
  "international2023_update_title": "Commemorazione del The International 2023",
  "international2023_update_subtitle": "Dai fanatici della scena professionale ai giocatori occasionali, questo aggiornamento ha qualcosa per tutti.",
  "international2023_update_body": "Che tu segua ogni attimo di tutte le partite del The International, o che tu sia appena consapevole del fatto che Dota può essere un vero e proprio lavoro e vuoi solo goderti il gioco in pace, continua a leggere: questo aggiornamento ha qualcosa da offrirti.\\n\\nSei un fan degli eSport? Crea la tua formazione di professionisti nella nuova versione del <b>FantaDota</b>. Preferisci analizzare i numeri? Fai i tuoi pronostici nella <b>Sfida di Oracle</b>. Forse ti appassionano i giochi dei tempi della tua prozia? Beh, quest'anno abbiamo anche il <b>Bingo</b>!\\n\\nMagari, però, niente di tutto ciò ti interessa e sei solo un grande fan di te stesso. In tal caso, abbiamo qualcosa anche per te: la <b>galleria del profilo</b>. Ora il tuo profilo può diventare un monumento interattivo in cui mettere in evidenza qualsiasi oggetto e risultato ottenuto nella tua carriera su Dota.",
  "international2023_update_footer": "Hai raggiunto la fine dell'aggiornamento. Ben fatto!",
  "international2023_compendium": "Compendio",
  "international2023_compendium_title": "Compendio del The International 2023",
  "international2023_compendium_intro": "Il Compendio sarà il tuo compagno digitale interattivo durante il Cammino per il The International 2023 e il The International 2023.\\n\\nGioca come un professionista nella Sfida del Cammino per il TI. Seleziona i tuoi giocatori preferiti in una versione aggiornata del FantaDota. Metti alla prova i tuoi poteri di divinazione con i pronostici sui gironi del torneo. Tenta la fortuna con le nuovissime cartelle del Bingo.\\n\\nPensa al Compendio come al tuo punto di riferimento per attività, sfide e tutte le ricompense a tema di quest'anno. Inoltre, il 25% del ricavato di tutte le vendite si aggiungerà direttamente al montepremi del The International 2023.",
  "international2023_showcase_title": "Galleria del profilo",
  "international2023_showcase_subtitle": "Nuova funzionalità per tutti i giocatori di Dota",
  "international2023_showcase_intro": "Il profilo e il miniprofilo sono stati completamente rinnovati per tutti (o almeno per il 98% dei giocatori con un punteggio di comunicazione superiore a 6.000). La nuova galleria del profilo ti consente di mettere in evidenza tutti i tuoi oggetti e traguardi su Dota (praticamente qualsiasi cosa nel tuo inventario).\\n\\nVuoi realizzare un altare per la tua squadra preferita del 2016? Ora puoi farlo. Che ne pensi di una collezione dei tuoi set preferiti per gli Eroi? Ora puoi farlo. E una mostra con tutte le possibili scarpe di Kunkka? Sfortunatamente puoi fare anche questo.",
  "international2023_showcase_profile_title": "Profilo aggiornato",
  "international2023_showcase_profile_desc": "Tu sei Michelangelo, il tuo profilo è una tela bianca e l'unico limite è la tua immaginazione (e un minimo di decenza comune).",
  "international2023_showcase_mini_profile_title": "Miniprofilo aggiornato",
  "international2023_showcase_mini_profile_desc": "I miniprofili sono molto simili ai profili, ma con una differenza che ti sorprenderà: sono più piccoli. Gli altri giocatori potranno vedere il tuo miniprofilo passando il cursore sul tuo nome.",
  "international2023_showcase_carousel_title": "Esempi di gallerie",
  "international2023_showcase_items_title": "Esponi gli oggetti",
  "international2023_showcase_items_desc": "Personalizza le tue gallerie con il vasto assortimento di tutti gli oggetti e le ricompense che hai collezionato nel corso degli anni.",
  "international2023_showcase_item_heroes_title": "Eroi",
  "international2023_showcase_item_trophies_title": "Trofei",
  "international2023_showcase_item_stickers_title": "Adesivi",
  "international2023_showcase_item_stats_title": "Statistiche",
  "international2023_showcase_item_chat_wheels_title": "Frasi per la chat radiale",
  "international2023_showcase_item_sprays_title": "Spray",
  "international2023_showcase_item_items_title": "Oggetti dell'Arsenale",
  "international2023_showcase_item_emoticons_title": "Emoticon",
  "international2023_showcase_item_loading_screens_title": "Schermate di caricamento",
  "international2023_showcase_item_couriers_title": "Corrieri",
  "international2023_showcase_item_wards_title": "Guardiani",
  "international2023_tournament_prize_pool": "Montepremi",
  "international2023_tournament_prize_pool_percent": "Il 25% del ricavato di tutte le vendite del Compendio si aggiungerà direttamente al montepremi del The International 2023.",
  "international2023_tournament_learn_more": "Ulteriori informazioni sul torneo",
  "international2023_quests_title": "Sfida del Cammino per il The International",
  "international2023_quests_intro": "Hai visto i professionisti in azione e hai fatto il tifo per loro. Ora sarai tu a dover giocare come un pro. Accomodati sulla sedia da gaming dei tuoi giocatori di eSport preferiti e ricrea i loro momenti migliori dell'anno scorso. Vinci con il loro stesso Eroe di una partita specifica o con uno dei cinque Eroi che hanno usato nel corso di un determinato mese della stagione. Otterrai dei punti per ogni sfida e un bonus di punti completando un intero gruppo di sfide.",
  "international2023_quests_match_title": "Sfide della partita",
  "international2023_quests_match_desc": "Vinci con gli Eroi di una vera partita professionistica.",
  "international2023_quests_pro_title": "Sfide del giocatore",
  "international2023_quests_pro_desc": "Vinci con uno degli Eroi più usati da un professionista.",
  "international2023_quests_rewards_title": "Ricompense",
  "international2023_quests_rewards_desc": "Ottieni ancora più ricompense grazie ai punti del Compendio ricevuti completando le attività.",
  "international2023_fantasy_title": "L'evoluzione del FantaDota",
  "international2023_fantasy_intro": "Crea una squadra con i tuoi giocatori professionisti preferiti. Personalizza le statistiche che ritieni più preziose. Competi con i giocatori di tutto il mondo per ottenere il maggior numero di punti. Il FantaDota che hai sempre amato, ma rivisto sotto ogni aspetto.",
  "international2023_fantasy_players_title": "Scegli",
  "international2023_fantasy_players_desc": "Scegli i tuoi giocatori Core, Mid e Support.",
  "international2023_fantasy_craft_title": "Personalizza",
  "international2023_fantasy_craft_desc": "Usa le rigenerazioni incluse nelle ricompense del Compendio per ottenere le statistiche migliori per i tuoi giocatori. Scegli con attenzione: alcune statistiche sono più adatte ad alcuni giocatori rispetto che ad altri.",
  "international2023_fantasy_compete_title": "Competi",
  "international2023_fantasy_compete_desc": "Ogni fine settimana del torneo rappresenta un nuovo round del FantaDota, quindi avrai diverse possibilità di competere contro i tuoi amici e il mondo intero. Partecipa per ottenere punti del Compendio e un trofeo speciale se la tua posizione in classifica è abbastanza alta.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Ti corre un brivido lungo la schiena ogni volta che una squadra di professionisti acquista uno Stocco Divino? O quando una partita supera gli 80 minuti e iniziano le stranezze? E quando una squadra di Eroi con 16 gambe ne affronta una con 4 soltanto?\\n\\nBeh, ora puoi sfruttare queste emozioni a tuo vantaggio e approfittare di eventi assolutamente pazzeschi grazie al nuovo gioco del Bingo.",
  "international2023_bingo_cards_title": "UNA CARTELLA DEL BINGO OGNI WEEKEND",
  "international2023_bingo_cards_desc": "Tutti gli utenti del Compendio riceveranno una cartella del Bingo generata casualmente per ogni fine settimana del torneo. Questa cartella sarà stracolma di riquadri con condizioni strane e situazioni interessanti che potrai sperare accadano durante le partite dei professionisti.",
  "international2023_bingo_rewards_title": "Completa le righe, guadagna punti",
  "international2023_bingo_rewards_desc": "Non farti ingannare dalle divinità, dai demoni e dalle creature della foresta armate fino ai denti: si tratta pur sempre del Bingo. Quando completi una riga, una colonna o una diagonale sulla tua cartella del Bingo, otterrai dei punti del Compendio come ricompensa. Attenzione: gridare \"BINGO\" è opzionale, ma altamente consigliato.",
  "international2023_predictions_title": "Sfida di Oracle",
  "international2023_predictions_intro": "Oracle utilizza la magia astrale ombelicale per prevedere il futuro. Beh, ci dispiace dirtelo, ma la magia ombelicale non esiste. Dovrai accontentarti della tua arguzia, della tua conoscenza in fatto di eSport e soprattutto della tua fortuna per vincere la sfida.\\n\\nPronostica (un po' come Oracle, ma senza ombelichi) quali squadre avanzeranno e quali verranno eliminate durante ciascun weekend del torneo. I pronostici corretti (ossia le divinazioni degne di Oracle) ti faranno ottenere punti del Compendio.",
  "international2023_predictions_group_stage_title": "Pronostici per la fase a gironi",
  "international2023_predictions_group_stage_desc": "Novità di quest'anno: cerca di pronosticare l'ordine delle squadre in ciascun girone.",
  "international2023_predictions_ingame_title": "Pronostici in gioco",
  "international2023_predictions_ingame_desc": "Mentre fai da spettatore in gioco o su Twitch, metti alla prova i tuoi poteri di divinazione prima del suono di inizio delle partite. Otterrai punti del Compendio per ogni pronostico corretto, fino a un massimo di sei al giorno.",
  "international2023_rewards_title": "Ricompense del Compendio",
  "international2023_rewards_intro": "Se sei un fan del mondo competitivo di Dota e ti piace ricevere dei premi per essere un fan del mondo competitivo di Dota, le ricompense di quest'anno fanno al caso tuo. Il Compendio 2023 è incentrato esclusivamente sul The International 2023 e sulla scena professionale di Dota.",
  "international2023_rewards_physical_aegis_title": "Modello fisico dell'Egida",
  "international2023_rewards_physical_aegis_desc": "Una replica in lega di nichel in scala 1:5 del famoso premio dei campioni. Mostrala con orgoglio! Mostrala senza impegno! Fondila e crea la tua valuta personale!",
  "international2023_rewards_chat_wheels_title": "Frasi permanenti per la chat radiale",
  "international2023_rewards_chat_wheels_desc": "A differenza degli scorsi anni, ora tutte le frasi della chat radiale sono permanenti. Proprio come dice il titolo. Sì, questa descrizione è un po' superflua, ma è bello poter passare del tempo con te.",
  "international2023_rewards_stickers_title": "Adesivi di giocatori e squadre",
  "international2023_rewards_stickers_desc": "\"Solo adesivi dei giocatori?\" Non hai finito di leggere il titolo, vero? Ci sono anche gli adesivi delle squadre. In tutta onestà, questi paragrafi servono come pluriball per proteggere il titolo mentre viene consegnato ai tuoi occhi.",
  "international2023_rewards_hud_title": "Interfaccia del The International 2023",
  "international2023_rewards_hud_desc": "L'ultimo paragrafo potrebbe aver spaventato alcune persone al punto di interrompere la lettura. Se però sei ancora qui, bella mossa! Era un test e l'hai superato. Ecco alcune informazioni non incluse nel titolo: la nuova interfaccia segue il tema delle vetrate colorate di quest'anno.",
  "international2023_rewards_loading_screens_title": "Schermate di caricamento",
  "international2023_rewards_loading_screens_desc": "Riceverai una schermata di caricamento a tema vetrate colorate per ogni squadra, oltre ad alcune illustrazioni del The International di quest'anno.",
  "international2023_rewards_materials_title": "Strumenti nel FantaDota e nella Sfida del Cammino per il TI",
  "international2023_rewards_materials_desc": "Usa degli strumenti personalizzati per creare giocatori migliori nel FantaDota o affronta contenuti particolarmente ardui nella Sfida del Cammino per il TI.",
  "international2023_rewards_teleport_fx_title": "Effetti del teletrasporto della squadra preferita",
  "international2023_rewards_teleport_fx_desc": "Metti in mostra la tua squadra preferita durante le partite con speciali effetti del teletrasporto in tre livelli diversi.",
  "international2023_rewards_Types_title": "Tipi di ricompensa",
  "international2023_rewards_Types_desc": "Ogni tipo di ricompensa ha una barra di avanzamento diversa. Riempi la barra di una ricompensa per poterla riscattare. Alcune barre possono essere riempite un numero illimitato di volte, mentre altre hanno un limite massimo.",
  "international2023_rewards_Levels_title": "Livelli del Compendio",
  "international2023_rewards_Levels_desc": "Ottieni altri livelli del Compendio partecipando alle attività o acquistando i pacchetti di livelli. Applica i livelli per aumentare la barra di avanzamento delle ricompense di TUTTI i tipi.",
  "international2023_rewards_Boosters_title": "Booster",
  "international2023_rewards_Boosters_desc": "I booster sono come i livelli del Compendio, ma servono ad aumentare la barra di una ricompensa specifica. Applicare un booster a una ricompensa farà avanzare anche la barra dell'Egida da collezionista.",
  "international2023_supporters_clubs_title": "Club dei tifosi",
  "international2023_supporters_clubs_subtitle": "Sostieni direttamente le tue squadre preferite",
  "international2023_supporters_clubs_intro": "Le ricompense dei Club dei tifosi sono come le gioie della gioventù: goditele finché puoi, perché presto svaniranno. Quest'anno, però, le ricompense sono permanenti e potrai godertele per l'eternità! Sempre che un autobus non ti investa.\\n\\nAncora meglio: il 50% del ricavato sarà devoluto alla squadra. Beh, ancora meglio per loro. Solo la prima parte è meglio per te.",
  "international2023_supporters_clubs_tiers_title": "Tre livelli di tifoseria",
  "international2023_supporters_clubs_tiers_desc": "Scegli se essere un tifoso di Bronzo, Argento o Oro per le tue squadre preferite e ottieni le ricompense realizzate dalle squadre stesse.",
  "international2023_talent_title": "Adesivi dei talenti",
  "international2023_talent_subtitle": "Sostieni direttamente i tuoi talenti preferiti",
  "international2023_talent_intro": "Commentare gli eventi di eSport in tempo reale è un lavoro duro. Ovviamente non come lavorare in miniera, ma più duro di chi lavora a maglia su Etsy. Beh, non facciamo di tutta l'erba un fascio: alcuni di quei cardigan fatti all'uncinetto sembrano piuttosto complicati.\\n\\nOra puoi inviare questo messaggio al tuo talento preferito: \"Ehi… Rispetto il tuo lavoro. Non come quello di un minatore, ma più di quello di almeno il 50% dei creatori su Etsy.\" A proposito di 50%, la metà di tutto il ricavato dalle vendite degli adesivi dei talenti sarà devoluto al talento in questione.",
  "international2023_talent_tiers_title": "Scegli un livello",
  "international2023_talent_tiers_desc": "Acquista i pacchetti di ricompense dei tuoi talenti preferiti. I pacchetti contengono adesivi, frasi e autografi in base al livello acquistato.",
  "international2023_talent_coming_soon": "I pacchetti dei talenti potranno essere acquistati una volta svelati i talenti dell'evento.",
  "international2023_coming_soon": "Prossimamente",
  "ti12_bp_countdown_header": "Alla fase a gironi",
  "ti12_bp_countdown_desc": "Assisti al più grande torneo dell'anno in diretta da Seattle, con l'Egida dei Campioni in palio.",
  "ti12_bp_tournament_complete_desc": "Rivivi l'emozione del più grande torneo di eSport dell'anno: tutta l'azione di Seattle è ad appena un clic di distanza.",
  "ti12_group_stage_venue": "Online",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Sostieni il torneo",
  "ti12_compendium_header": "Compendio del The International 2023",
  "ti12_compendium_desc": "Sfrutta ancora meglio la stagione del torneo con il Compendio del The International 2023. Gioca come un professionista nella Sfida per il Cammino del TI. Crea un roster con i tuoi giocatori preferiti in una nuova versione del FantaDota. Metti alla prova i tuoi poteri di divinazione con la Sfida di Oracle. Infine, spera che le squadre facciano cose strane nel nuovissimo gioco del Bingo.\\n\\nGuadagna ricompense come adesivi dei giocatori e delle squadre, frasi per la chat radiale, un'interfaccia personalizzata e altro ancora, fino a una replica fisica dell'Egida dei Campioni.\\n\\nIl 25% del ricavato di tutte le vendite si aggiungerà direttamente al montepremi del The International.",
  "ti12_compendium_standard": "Compendio standard",
  "ti12_compendium_upgraded": "Compendio migliorato"
}