// 8699.js

{
  "language": "thai",
  "ringmastercomic_title_cover": "หุ่นกล - หน้าปก",
  "ringmastercomic_title": "หุ่นกล - หน้า %1$s",
  "ringmastercomic_help_text": "คลิกที่รูปภาพหรือกด Space Bar เพื่ออ่านต่อ",
  "ringmastercomic_return_button": "ย้อนกลับไปยังหน้าปก",
  "ti13_online": "เมืองโคเปนเฮเกน",
  "ti13_main_event_venue": "Royal Arena - เมืองโคเปนเฮเกน",
  "ti13_best_of_three": "Best of 3",
  "ti13_best_of_five": "Best of 5",
  "ti13_group_stage_sp_rules": "รอบแบ่งกลุ่ม - กติกาสิทธิ์ในการเลือก",
  "ti13_group_stage_sp_game1": "ทอยเหรียญตัดสิน",
  "ti13_group_stage_sp_game2": "เกมที่หนึ่ง: ผู้ชนะการทอยเหรียญจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_group_stage_sp_game3": "เกมที่สอง: ผู้แพ้การทอยเหรียญจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_group_stage_sp_game4": "เกมที่สาม (ถ้ามี): ทอยเหรียญใหม่ ผู้ชนะการทอยเหรียญใหม่จะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_group_stage_tie_rules": "รอบแบ่งกลุ่ม - กติกาตัดสินไทเบรก",
  "ti13_first_second_tie": "2 ทีมเสมอกันที่อันดับ 1 และ 2",
  "ti13_second_third_tie": "2 ทีมเสมอกันที่อันดับ 2 และ 3",
  "ti13_third_fourth_tie": "2 ทีมเสมอกันที่อันดับ 3 และ 4",
  "ti13_three_way_first_tie": "3 ทีมเสมอกันที่อันดับ 1",
  "ti13_three_way_second_tie": "3 ทีมเสมอกันที่อันดับ 2",
  "ti13_four_way_tie": "4 ทีมเสมอกันที่อันดับ 1",
  "ti13_tie_resolve_bo3": "ตัดสินด้วยการแข่งขันแบบ Best of 3",
  "ti13_tie_resolve_third_fourth": "ไม่มีการเล่นเกมเพิ่มเติม ทั้ง 2 ทีมจะเสมอกันที่อันดับ 3 และ 4",
  "ti13_tie_resolve_first_with_round_robin": "ตัดสินอันดับ 1 ด้วยการแข่งขัน Best of 1 แบบพบกันหมดจนกว่าจะมีหนึ่งทีมที่ชนะ 2 ครั้ง",
  "ti13_tie_resolve_second_and_third_place_bo1": "เล่นต่อไปจนกว่าทุกทีมจะพบทีมอื่นอย่างน้อยหนึ่งครั้ง ใช้ผลการแข่งขันแบบพบกันหมดรอบล่าสุดเพื่อตัดสินอันดับ 2 และ 3",
  "ti13_tie_resolve_second_with_round_robin": "ตัดสินอันดับ 2 ด้วยการแข่งขัน Best of 1 แบบพบกันหมดจนกว่าจะมีหนึ่งทีมที่ชนะ 2 ครั้ง",
  "ti13_tie_resolve_third_fourth_other": "ไม่มีการเล่นเกมเพิ่มเติม อีก 2 ทีมที่เหลือจะเสมอกันที่อันดับ 3 และ 4",
  "ti13_tie_resolve_four_way_1": "สุ่มจับคู่ทีม โดยสำหรับกติกานี้ จะเรียกทีมเหล่านี้ว่า ทีม A ทีม B ทีม C และทีม D",
  "ti13_tie_resolve_four_way_2": "ทีม A แข่งกับทีม B ในการแข่งขันแบบ Best of 1 และทีม C แข่งกับทีม D ในการแข่งขันแบบ Best of 1",
  "ti13_tie_resolve_four_way_3": "ตัดสินอันดับ 1 ด้วยการแข่งขันแบบ Best of 1 ระหว่างผู้ชนะของ A/B และผู้ชนะของ C/D",
  "ti13_tie_resolve_four_way_4": "ตัดสินอันดับ 4 ด้วยการแข่งขันแบบ Best of 1 ระหว่างผู้แพ้ของ A/B และผู้แพ้ของ C/D",
  "ti13_tie_resolve_four_way_5": "ตัดสินอันดับ 2 และ 3 ด้วยการแข่งขันแบบ Best of 1 ระหว่างทีมที่เหลือ",
  "ti13_seeding_decider_sp_rules": "แมตช์กำหนดสาย - กติกาสิทธิ์ในการเลือก",
  "ti13_seeding_decider_sp_rules_1": "เกมที่หนึ่ง: ทีมที่มีอันดับสูงกว่าจากรอบแบ่งกลุ่มจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_seeding_decider_sp_rules_2": "เกมที่สอง: ทีมที่มีอันดับต่ำกว่าจากรอบแบ่งกลุ่มจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_seeding_decider_sp_rules_3": "เกมที่สาม (ถ้ามี): ทีมที่มีอันดับสูงกว่าจากรอบแบ่งกลุ่มจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_playoffs_and_ti_sp_rules": "รอบตัดเชือกและ The International - กติกาสิทธิ์ในการเลือก",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "ทอยเหรียญตัดสิน",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "แผนที่ที่หนึ่ง: ผู้ชนะการทอยเหรียญจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "แผนที่ที่สอง: ผู้แพ้การทอยเหรียญจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "แผนที่ที่สาม (ถ้ามี): ทอยเหรียญใหม่ ผู้ชนะการทอยเหรียญใหม่จะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "แผนที่ที่หนึ่ง: ผู้ชนะสายบนจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "แผนที่ที่สอง: ผู้ชนะสายล่างจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "แผนที่ที่สาม: ผู้ชนะสายบนจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "แผนที่ที่สี่ (ถ้ามี): ผู้ชนะสายล่างจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "แผนที่ที่ห้า (ถ้ามี): ทอยเหรียญตัดสิน ผู้ชนะการทอยเหรียญจะได้สิทธิ์เลือกฝั่งหรือลำดับการเลือก",
  "international2024_update_title": "TI 2024, Ringmaster และ Compendium",
  "ringmaster_hype": "\"ลิชและลีนา สลาร์กและมาร์ซี เหยื่อทุกเพศทุกวัย! ช่วงเวลาที่พวกท่านทั้งหลายตั้งตารอคอยมาโดยตลอดได้มาถึงแล้ว\\n\\n เป็นเวลาราวหนึ่งปีที่ข้ามีเพียงชื่อ — ถูกกล่าวขานด้วยเสียงกระซิบแผ่วเบา เงาที่แอบซุ่มอยู่เบื้องหลังม่านสีเลือด แต่บัดนี้ หลังจากรอคอยมาเนิ่นนาน (นานเกินไปด้วยซ้ำถ้าถามความเห็นข้า) พวกโง่เง่าที่ดูแลวงการนี้ในที่สุดก็ฉลาดพอจะปล่อยให้ข้าอวยพรพวกท่านด้วยความยิ่งใหญ่ของข้า และรับบทกลางแสงสปอตไลต์อย่างถ่อมตัว! ข้าคือ Cogliostro Kettle — หัวหน้าคณะวายร้าย! นักเชิญชวนแห่งห้วงอเวจี! RINGMASTER เพียงหนึ่งเดียว ไม่มีใครเหมือน! ข้ายังมีกลมายาอันน่าทึ่งรออยู่อีกเพียบ!\"",
  "ringmaster_comic": "\"แต่อย่าเพิ่งเชื่อคำพูดข้าเลย! ทำไมไม่ลองอ่านการ์ตูนเกี่ยวกับเรื่องราวต้นกำเนิดอันแสนเศร้าของข้า ซึ่งเล่าโดยผู้บรรยายนิรนามที่น่าไว้ใจดูสักหน่อยล่ะ?\"",
  "ringmaster_comic_title": "หุ่นกล",
  "ringmaster_comic_desc": "อ่านเรื่องราวตำนาน Ringmaster ในวันเก่าก่อนตอนออกทัวร์กับคณะละครหุ่นกลของนายเคตเทิล",
  "ringmaster_guide": "\"ข้าได้รับการร้องขอให้เป็นผู้นำทางของท่านในการสำรวจ Compendium ประจำปีนี้ ด้วยข้อเสนอที่ข้ายอมรับด้วยความยินดียิ่ง จะว่าไปแล้วเราควรจะทำความรู้จักกันไว้นะ! [b]เรามาเริ่มกันเลยดีไหม?[/b]\"",
  "ringmaster_introducing": "ขอแนะนำ",
  "ringmaster_hero_detail_button": "ดูหน้ารายละเอียดฮีโร่",
  "ringmaster_play_trailer_button": "เล่นตัวอย่าง",
  "ringmaster_comic_button": "อ่านการ์ตูน",
  "international2024_compendium": "Compendium",
  "international2024_compendium_title": "Compendium ของ The International 2024",
  "international2024_effigies_title": "รูปสลักสำหรับแต่ละฮีโร่",
  "international2024_effigies_subtitle": "คุณสมบัติที่อัปเกรดฟรีสำหรับทุกคน",
  "international2024_effigies_intro": "\"กาลครั้งหนึ่ง สหายเอ๋ย ไม่นานมานี้เอง รูปสลักอันสง่างามเหล่านี้เป็นสิ่งที่หาชมได้ยากยิ่งนัก! แต่ไม่ใช่อีกต่อไป! บัดนี้ท่านจะเห็นรูปสลักตั้งตระหง่านรอต้อนรับเหล่าผู้กล้าที่กำลังก้าวเข้าสู่สนามรบ ไม่ว่าจะเป็น Ringmaster หรือบรรดาฮีโร่กระจอกงอกง่อยทั้งหลาย!\"",
  "international2024_effigies_desc": "รูปสลักคือประติมากรรมที่สามารถปรับท่าทางได้ของเหล่าฮีโร่ที่คุณชื่นชอบเพื่อประดับฐานของคุณ โดยตอนนี้ฮีโร่แต่ละตัวจะมีช่องรูปสลักเป็นของตัวเองในคลังแสงชุดปรับแต่งแทนที่จะใช้ช่องสากลเพียงหนึ่งเดียว\\n\\nคุณสามารถใช้รูปสลักเริ่มต้นแบบใหม่สำหรับฮีโร่แต่ละตัว หรือจะสร้างสรรค์และใช้งานรูปสลักของคุณเองก็ได้",
  "international2024_purchase_intro": "\"เทพเจ้าและอสูร สรรพสัตว์และสิ่งมีชีวิตน่าขนพองทั้งหลาย เชิญก้าวเข้ามา แล้วให้ดวงตาอันแสนโชคดีของท่านได้ชื่นชม[b]คอลเลกชันเกม กิจกรรม และรางวัลอีสปอร์ตที่เร้าใจที่สุด[/b]ในฟากฝั่งแม่น้ำนี้! เชิญพิสูจน์ไหวพริบ ลองวัดดวง และทดสอบความกล้าหาญของท่านในงานเฉลิมฉลองมหกรรมอีสปอร์ตที่ยิ่งใหญ่ที่สุดในอาณาจักรนี้และทุกภพภูมิ!\"",
  "international2024_activities": "คุณจะได้รับสิ่งต่อไปนี้",
  "international2024_activities_subtitle": "เกมเสี่ยงโชค การประลองทักษะ และความสนุกสนานสำหรับทุกเพศทุกวัย",
  "international2024_activities_intro": "\"ข้าได้ยินมาว่าบางคนในหมู่พวกท่านต้องการเหตุผลในการสังหาร ต่างจากพิธีกรที่มีสติมั่นคงของพวกท่าน ดังนั้นทุกเกมที่ท่านเล่นจะทำให้ท่านได้รับแต้ม สหายเอ๋ย! ยิ่งท่านเล่นมากเท่าไหร่ ท่านก็จะยิ่งได้มากขึ้นเท่านั้น ถ้าอย่างนั้นก็จงโถมตัวเข้าสู่เลน แล้วมองดูแต้มสะสมของท่านพุ่งทะยานขึ้นไปสิ!\"",
  "international2024_activities_play_title": "เล่น Dota เพื่อรับแต้ม",
  "international2024_activities_play_desc": "ในปีนี้ คุณจะได้รับแต้มจากเกือบทุกเกมที่คุณเล่นผ่านการท้าทายประจำสัปดาห์ นอกจากนี้คุณจะได้รับแต้มพิเศษสำหรับชัยชนะครั้งแรกของแต่ละวันด้วย",
  "international2024_activities_fantasy_title": "แฟนตาซี",
  "international2024_activities_fantasy_desc": "แข่งขันกับเพื่อนของคุณและผู้เล่น Dota ทั่วโลก เลือกทีมแฟนตาซีที่ดีที่สุดจากบรรดาผู้เล่นมืออาชีพที่คุณชื่นชอบ และสร้างการ์ดแบบกำหนดเองด้วยค่าสถิติที่ช่วยเพิ่มแต้ม",
  "international2024_activities_oracles_title": "บททดสอบของ Oracle",
  "international2024_activities_oracles_desc": "ทำนายว่าทีมใดจะผ่านเข้ารอบและทีมใดจะตกรอบ แล้วชื่นชมความแม่นยำในการพยากรณ์ของคุณ (หากคุณทำนายถูก)",
  "international2024_activities_bingo_title": "บิงโก",
  "international2024_activities_bingo_desc": "เชิญรับการ์ดบิงโกที่สร้างขึ้นแบบสุ่มสำหรับแต่ละรอบของทัวร์นาเมนต์ ซึ่งเต็มไปด้วยเงื่อนไขที่แปลกประหลาดและสถานการณ์ที่น่าสนใจ",
  "international2024_activities_outro": "\"อย่าลืมล่ะ! ชนะแล้วก็ไม่ได้แค่ภูมิใจเฉย ๆ หรอกนะ! ทุกครั้งที่ท่านทำกิจกรรมเหล่านี้สำเร็จ ท่านก็จะได้รับแต้มด้วยนะเออ! แวะไปดูที่ซุ้มรางวัลด้านล่างนี้สิ จะได้รู้ว่าท่านจะเอาแต้มเหล่านั้นไปแลกเป็นของอะไรได้บ้าง!\"",
  "international2024_rewards_title": "รางวัล Compendium",
  "international2024_rewards_subtitle": "เชิญก้าวเข้ามาแล้วใช้ตาจับจ้องรางวัลเหล่านี้",
  "international2024_rewards_intro": "\"สะสมร่างให้สูงท่วมท้นแล้วมารับรางวัลของท่านไป! อาาา รางวัลอะไรกันนะที่รออยู่! ไม่ ๆ ไม่ใช่รางวัลจากการได้ใช้มือของท่านบีบคอ มองดูชีวิตค่อย ๆ จางหายไปจากดวงตาของฮีโร่เคราะห์ร้าย ซึ่งนั่นก็เป็นรางวัลในตัวเองอยู่แล้ว! แต่นี่คือสิ่งที่ท่านจะได้รับหลังจากนั้นต่างหาก!\"",
  "international2024_rewards_physical_aegis_title": "Aegis แบบจำลองสำหรับสะสม",
  "international2024_rewards_physical_aegis_desc": "เติมเต็มช่องว่างรูป Aegis บนตู้โชว์​และในใจของคุณ​ด้วยแบบจำลอง​โลหะผสมนิกเกิล​ขนาด 1/5 ของรางวัล​สำหรับแชมป์​อันเลื่องชื่อ",
  "international2024_rewards_hud_title": "HUD ของ The International 2024",
  "international2024_rewards_hud_desc": "เสริมแต่งอินเทอร์เฟซในเกมของคุณด้วยจิตวิญญาณแห่งคณะละครสัตว์ เราได้ปรับโฉม HUD ใหม่ให้กลมกลืนกับธีมของ TI ในปีนี้",
  "international2024_rewards_versus_title": "หน้าจอปะทะ 2024",
  "international2024_rewards_versus_desc": "เพิ่มสีสันให้กับจิตวิญญาณการต่อสู้ก่อนเกมด้วยหน้าจอปะทะแบบพิเศษที่อวดโฉมช่องรูปสลักฮีโร่แบบใหม่",
  "international2024_rewards_chat_wheels_title": "วงล้อสนทนาแบบถาวร",
  "international2024_rewards_stickers_title": "สติกเกอร์ผู้เล่นและทีม",
  "international2024_rewards_loading_screens_title": "หน้าจอโหลด",
  "international2024_rewards_materials_title": "เครื่องมือเสริมพลังแฟนตาซีและบิงโก",
  "international2024_rewards_teleport_fx_title": "เอฟเฟกต์เทเลพอร์ตทีมโปรด",
  "international2024_rewards_effigy_title": "ก้อนสำหรับแกะสลัก 2024",
  "international2024_supporters_clubs_title": "สนับสนุนชุมชน",
  "international2024_supporters_clubs_subtitle": "ชุดรวมสนับสนุนทีมและผู้เชี่ยวชาญ",
  "international2024_supporters_clubs_intro": "\"ท่านผู้มีอุปการะคุณทั้งหลาย! นักการกุศลใจบุญทุกเพศทุกวัย! ผู้อุปถัมภ์ผู้ถ่อมตนแห่งศิลปะการสังหารและศาสตร์ที่เกี่ยวข้อง! 50% ของความเอื้อเฟื้อเผื่อแผ่อันยิ่งใหญ่ของท่านจะถูกส่งตรงไปยังทีมโปรดและนักพากย์ที่ท่านชื่นชอบ! ใครกันเล่าคือฮีโร่ที่แท้จริง? ก็ข้าเองแหละ ชัดเจน! ข้ากำลังปรบมือฮีโร่อันยิ่งใหญ่ของข้าให้กับพวกท่าน!\"",
  "international2024_supporters_clubs_tiers_title": "สโมสรผู้สนับสนุนทีม",
  "international2024_supporters_clubs_tiers_desc": "เลือกการสนับสนุนระดับทองแดง เงิน หรือทองสำหรับทีมโปรดของคุณเพื่อรับรางวัลที่ออกแบบโดยทีมเอง",
  "international2024_talent_tiers_title": "แพ็กสติกเกอร์ผู้เชี่ยวชาญ",
  "international2024_talent_tiers_desc": "ซื้อชุดรวมรางวัลที่นำเสนอผู้เชี่ยวชาญคนโปรดของคุณ ชุดรวมประกอบด้วยสติกเกอร์ ประโยคเสียง และลายเซ็น โดยขึ้นอยู่กับระดับของชุดรวมที่ซื้อ",
  "ti13_compendium_small_header": "สนับสนุนทัวร์นาเมนต์",
  "ti13_compendium_header": "Compendium ของ The International 2024",
  "ti13_compendium_desc": "Compendium คือคู่หูดิจิตอลแบบอินเตอร์แอคทีฟสำหรับเส้นทางสู่ The International ซึ่งจะเป็นแหล่งรวมแบบครบวงจรสำหรับกิจกรรม บททดสอบ และรางวัลทั้งหมดที่เกี่ยวข้องกับงานแข่งในปีนี้ นอกจากนี้ รายได้ 25% จากยอดขายทั้งหมดจะนำไปสมทบเงินรางวัลรวมของ The International 2024",
  "ti13_compendium_bp_btn": "เยี่ยมชมเว็บไซต์",
  "ti13_compendium_standard": "Compendium แบบมาตรฐาน",
  "ti13_compendium_standard_subtitle": "คุณสมบัติและกิจกรรมทั้งหมด",
  "ti13_compendium_upgraded": "Compendium แบบอัปเกรด",
  "ti13_compendium_upgraded_subtitle": "คุณสมบัติและกิจกรรมทั้งหมดพร้อมกับรางวัลที่ได้ไวยิ่งขึ้น",
  "ti13_compendium_purchase_tp_fx": "เอฟเฟกต์เทเลพอร์ต TI 2024 เลเวล 1",
  "ti13_compendium_purchase_boosters_footnote": "บูสเตอร์สามารถปลดล็อกเนื้อหาเพิ่มเติมที่คุณเลือกได้",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "บูสเตอร์สามารถปลดล็อก HUD ของ The International 2024 หรือเนื้อหาเพิ่มเติมที่คุณเลือกได้",
  "ti13_compendium_purchase_levels": "%1$s เลเวล Compendium",
  "ti13_compendium_purchase_booster_levels": "%1$s บูสเตอร์",
  "ti13_compendium_purchase_discount": "ประหยัด %1$s% จากราคาเลเวล",
  "ti13_compendium_purchase_earn_the_following": "เลเวล Compendium จะปลดล็อก:",
  "ti13_compendium_contribution": "รายได้ 25% จากยอดขายทั้งหมดจะนำไปสมทบเงินรางวัลรวมของ The International 2024",
  "ti13_compendium_purchase_all_access": "สิทธิ์เข้าถึงคุณสมบัติ Compendium ทั้งหมด",
  "ti13_compendium_purchase_aegis_emoticon": "อีโมติคอน Aegis",
  "ti13_compendium_purchase_bingo_tokens": "%1$s เหรียญบิงโก",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s เหรียญสุ่มแฟนตาซี",
  "ti13_compendium_purchase_one_player_sticker": "1 แคปซูลสติกเกอร์ผู้เล่น",
  "ti13_compendium_purchase_player_stickers": "%1$s แคปซูลสติกเกอร์ผู้เล่น",
  "ti13_compendium_purchase_team_stickers": "%1$s แคปซูลสติกเกอร์ทีม",
  "ti13_compendium_purchase_effigy_blocks": "%1$s ก้อนสำหรับแกะสลัก TI 2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s สมบัติหน้าจอโหลดทีม",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s สมบัติหน้าจอโหลด TI",
  "international2024_tournament_learn_more": "เรียนรู้เพิ่มเติมเกี่ยวกับทัวร์นาเมนต์",
  "ringmaster_abilities_heading": "สกิล",
  "ringmaster_souvenirs_heading": "ของชำร่วย",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "สกิลยืนร่าย - Ringmaster เหวี่ยงแส้ของเขาแล้วฟาดลงพื้น ศัตรูที่ถูกแส้ฟาดใส่จะได้รับความเสียหาย และวิ่งหนีด้วยความหวาดกลัวออกจาก Ringmaster โดยระหว่างยืนร่ายจะทำให้ความเสียหายเพิ่มขึ้นแบบทวีคูณ​และเพิ่มระยะเวลาหวาดกลัว แต่รัศมีจะลดลง",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster ยัดตัวเขาเองหรือฮีโร่เพื่อนร่วมทีมเข้าไปในกล่องต่างมิติที่เคลื่อนที่ได้ ยูนิตที่อยู่ในกล่องจะเคลื่อนที่ทะลุผ่านยูนิต ได้รับความต้านทานลดความเร็ว ความต้านทานเวทมนตร์เพิ่มขึ้น และความเร็วในการเคลื่อนที่เพิ่มขึ้น อีกทั้งจะไม่สามารถเลือกเป็นเป้าหมายได้ ถูกใบ้ ถูกปลดอาวุธ และถูกใบ้ไอเท็ม กล่องจะเปิดออกหลังจากเอฟเฟกต์หมดเวลา หรือเมื่อฮีโร่เคลื่อนที่ออกจากรัศมี",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster ขว้างมีดสั้นของเขาไปยังจุดที่เลือกด้วยความแม่นยำ หากปักโดนศัตรู มีดสั้นจะสร้างความเสียหายปะทะ ทำให้ยูนิตที่โดนช้าลงชั่วขณะ และสร้างความเสียหายในทุกวินาทีตามเปอร์เซ็นต์พลังชีวิตสูงสุดของยูนิต",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster กลิ้ง Wheel of Wonder ไปยังตำแหน่งเป้าหมาย โดยจะผลักศัตรูระหว่างทางให้กระเด็นออก เมื่อถึงเป้าหมายแล้ว ศัตรูในระยะของกงล้อจะได้รับความเสียหายต่อเนื่องและถูกลดความเร็ว ศัตรูที่หันหน้าเข้ากงล้อนานเกินกว่า 0.5 วินาทีจะถูกสะกดจิตและดึงดูดเข้าหากงล้อ เมื่อมีศัตรูตัวแรกถูกสะกดจิตจะทำให้กงล้อเริ่มจับเวลาระเบิด หากไม่มียูนิตทำให้เริ่มจับเวลา กงล้อจะระเบิดโดยอัตโนมัติหลังจาก 8 วินาที",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster ฉายแสงสปอตไลต์สอดส่องทั่วพื้นที่ ศัตรูในลำแสงจะมีโอกาสโจมตีพลาด​และถูกเปิดเผยตัวหากล่องหน ร่างเงาที่โดนแสงส่องจะค่อย ๆ สลายร่าง โดยจะสูญเสียพลังชีวิตเป็นเปอร์เซ็นต์ของพลังชีวิตสูงสุดทุก ๆ วินาที",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ringmaster จะได้รับของชำร่วย Dark Carnival Souvenir ที่ใช้ได้ครั้งเดียว​แบบสุ่ม​เมื่อใด​ก็ตาม​ที่​ฮีโร่​ศัตรู​ตาย​ใน​บริเวณ​ใกล้เคียง ของชำร่วยที่ได้เพิ่มเติมเก็บไว้เป็นชาร์จ หาก Ringmaster ยังไม่มีของชำร่วยตอนเกิดใหม่ เขาจะได้รับ 1 ชิ้น ของชำร่วย Dark Carnival Souvenir นั้นได้แก่ Funhouse Mirror, Strongman Tonic และ Whoopee Cushion",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "ใช้: Proportion Distortion\\n\\nสร้างร่างเงาฮีโร่ที่ไม่สมบูรณ์แบบของคุณขึ้นมา 1 ตัว ซึ่งอยู่ได้นาน 18 วินาที ร่างเงาของคุณจะสร้างความเสียหาย 28% และได้รับความเสียหาย 300%",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "ใช้: Whoopsie\\n\\nพุ่งตัวฮีโร่ของคุณไปข้างหน้า 400 หน่วย และปล่อยควันเหม็นโฉ่ไว้ข้างหลังเป็นรัศมี 200 หน่วยนาน 3 วินาที ซึ่งจะลดความเร็วศัตรู 30%",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic",
  "ringmaster_ability_strongman_tonic_Description": "ใช้: Forcefully Imbibe\\n\\nเพิ่มค่า Strength ของฮีโร่เพื่อนร่วมทีมชั่วคราวเป็นจำนวน 5 หน่วยบวกกับ 1.5 หน่วยต่อเลเวลของ Ringmaster มีผล 8 วินาที เอฟเฟกต์จะคงอยู่ 4 วินาที​และจากนั้นจะค่อย ๆ ลดลงเมื่อเวลาผ่านไป"
}