// 6457.js

{
  "language": "english",
  "international2023_compendium_activity": "Activity for Compendium Owners",
  "international2023_update_title": "The International 2023 Celebration",
  "international2023_update_subtitle": "From pro scene fanatics to casual players, this esports update's got something for everyone.",
  "international2023_update_body": "Whether you hang on every nail-biting second of every match at The International or you're barely aware that people play this thing for a living and just want to enjoy the game in peace, read on: This update's got something for you.\\n\\nAre you an esports fanatic? Create your own lineup of pros with the upgraded <b>Fantasy League.</b> More of an analytics enthusiast? Dive into the <b>Oracle's Challenge</b> prediction brackets. Maybe you're a huge fan of games played by your great-aunt. Well, we've even got <b>Bingo</b> this year!\\n\\nBut maybe you're not a fan of any of that stuff. Maybe you're just a big fan of yourself. We've got something for you too: <b>The Profile Showcase</b>. Your profile is now an interactive monument to yourself, featuring any items and accomplishments in your playing history you want to jam in there.",
  "international2023_update_footer": "You've made it to the end of the update. Good work!",
  "international2023_compendium": "Compendium",
  "international2023_compendium_title": "The International 2023 Compendium",
  "international2023_compendium_intro": "The Compendium is your interactive digital companion to the Road to the International 2023 and The International 2023.\\n\\nPlay like a pro with the Road to TI Challenge. Draft your favorite players with a reworked and updated Fantasy challenge. Test your predictive mettle with Group Stage and Bracket Predictions. Hit the jackpot with the all-new Bingo boards.\\n\\nThink of the Compendium as your one-stop shop of event-related activities, challenges, and all of this year's event-focused rewards. Plus, 25% of all sales will contribute to the prize pool of The International 2023.",
  "international2023_showcase_title": "The Profile Showcase",
  "international2023_showcase_subtitle": "New Feature for All Dota Players",
  "international2023_showcase_intro": "The Profile and Mini Profile have been completely redesigned for everyone (well, the 98% of you that have a communication score above 6000). Now you can show off all of your Dota items and accomplishments — literally anything in your Dota inventory —  with the new Profile Showcase.\\n\\nWant to make a shrine to your favorite pro team from 2016? You can do that. How about a collection of your favorite hero sets? You can absolutely do that. One of every possible pair of Kunkka's shoes? Sadly, yes. Technically you can also do that.",
  "international2023_showcase_profile_title": "Updated Profile",
  "international2023_showcase_profile_desc": "You are Michaelangelo, your Profile is now your canvas, and you're only limited by your imagination. (And your basic sense of human decency.)",
  "international2023_showcase_mini_profile_title": "Updated Mini Profile",
  "international2023_showcase_mini_profile_desc": "Mini Profiles are a lot like Profiles, with one crucial distinction — stay with us here — they are smaller. Other players will get to see your Mini Profile whenever they hover over your name.",
  "international2023_showcase_carousel_title": "Sample Showcases",
  "international2023_showcase_items_title": "Showcase Items",
  "international2023_showcase_items_desc": "Customize your showcases with a huge assortment of all of the items and rewards you've been collecting over the years.",
  "international2023_showcase_item_heroes_title": "Heroes",
  "international2023_showcase_item_trophies_title": "Trophies",
  "international2023_showcase_item_stickers_title": "Stickers",
  "international2023_showcase_item_stats_title": "Stats",
  "international2023_showcase_item_chat_wheels_title": "Chat Wheels",
  "international2023_showcase_item_sprays_title": "Sprays",
  "international2023_showcase_item_items_title": "Armory Items",
  "international2023_showcase_item_emoticons_title": "Emoticons",
  "international2023_showcase_item_loading_screens_title": "Loading Screens",
  "international2023_showcase_item_couriers_title": "Couriers",
  "international2023_showcase_item_wards_title": "Wards",
  "international2023_tournament_prize_pool": "Prize Pool",
  "international2023_tournament_prize_pool_percent": "25% of all sales of the International 2023 Compendium will contribute to the prize pool of The International 2023.",
  "international2023_tournament_learn_more": "Learn More about the Tournament",
  "international2023_quests_title": "The Road to The International Challenge",
  "international2023_quests_intro": "You've watched the pros. You've cheered them on. Now play like one. Slide into the gaming chair of your favorite esports pro players and recreate their greatest moments from the past year. Win as their heroes from a specific match, or as one of five heroes they used during a given month in the season. Earn points for each challenge, and bonus points for completing full sets of challenges.",
  "international2023_quests_match_title": "Match Challenges",
  "international2023_quests_match_desc": "Win using heroes from an actual pro match.",
  "international2023_quests_pro_title": "Player Challenges",
  "international2023_quests_pro_desc": "Win as one of a pro's most-picked heroes.",
  "international2023_quests_rewards_title": "Earn Rewards",
  "international2023_quests_rewards_desc": "Power up your rewards with Compendium Points earned along the way.",
  "international2023_fantasy_title": "Fantasy Evolved",
  "international2023_fantasy_intro": "Choose a team of your favorite pros. Craft which stats you think will be most valuable. Compete with players around the globe to earn the most points. It's the Dota fantasy league you remember, but reimagined in every way.",
  "international2023_fantasy_players_title": "Choose",
  "international2023_fantasy_players_desc": "Pick your favorite core, mid, and support.",
  "international2023_fantasy_craft_title": "Craft",
  "international2023_fantasy_craft_desc": "Use rolls earned along with your Compendium rewards to attempt to craft the best stats for your players. Choose carefully—some stats are better on some players than others.",
  "international2023_fantasy_compete_title": "Compete",
  "international2023_fantasy_compete_desc": "Each weekend of the tournament is a separate round of Fantasy, so you'll have multiple chances to compete against your friends and the world. Earn Compendium Points and, if your leaderboard rank is high enough, a unique trophy.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Do you get a little thrill every time a pro team buys a Divine Rapier? Or a match goes over 80 minutes and everything starts to get a little weird? How about when a team of heroes with 16 legs fights a team with just four?\\n\\nWell, get ready to finally cash in on that excitement. Bingo is here to let you capitalize on some truly crazy events.",
  "international2023_bingo_cards_title": "ONE BINGO CARD PER WEEKEND",
  "international2023_bingo_cards_desc": "All Compendium owners will get a new randomly generated Bingo card for each weekend of the tournament. This card is crammed full of squares with weird conditions and interesting situations for you to root for while the pros compete.",
  "international2023_bingo_rewards_title": "Complete Rows, Earn Points",
  "international2023_bingo_rewards_desc": "That's right — don't let the gods, demons, and trigger-happy woodland creatures fool you, it's still just Bingo, folks. When you complete a full row, column, or diagonal on your Bingo Card, you'll claim a reward of Compendium Points. Note: Screaming \"BINGO\" is optional but encouraged.",
  "international2023_predictions_title": "The Oracle's Challenge",
  "international2023_predictions_intro": "The Oracle uses astral umbilicus magic to see the future. Well, we hate to break it to you, but umbilical-based magic isn't real. You're going to have to use your cunning, your esports knowledge, and most importantly, your best guesses to get the job done.\\n\\nPredict, Oracle-like but umbilical-less, which teams will advance and which will fall during each tournament weekend. Correct guesses (we mean Oracle-esque divinations) will earn you Compendium Points.",
  "international2023_predictions_group_stage_title": "Predict Group Stage",
  "international2023_predictions_group_stage_desc": "New for this year, attempt to predict the order of teams within each group.",
  "international2023_predictions_ingame_title": "In-game predictions",
  "international2023_predictions_ingame_desc": "While watching in-game or on Twitch, test your predictive power before the horn of each match. You'll earn Compendium Points for each correct prediction, up to six per day.",
  "international2023_rewards_title": "Compendium Rewards",
  "international2023_rewards_intro": "If you're a fan of competitive Dota and being rewarded for being a fan of competitive Dota, this year's rewards are for you. The Compendium 2023 is focused entirely on The International 2023 and the Dota Pro scene.",
  "international2023_rewards_physical_aegis_title": "Physical Aegis Model",
  "international2023_rewards_physical_aegis_desc": "A 1/5th-scale nickel alloy replica of the famed champion's prize. Display it proudly! Display it noncommittally! Melt it down and make your own currency!",
  "international2023_rewards_chat_wheels_title": "Permanent Chat Wheels",
  "international2023_rewards_chat_wheels_desc": "Unlike previous years, all of the chat wheels are permanent now. Just like we said in the title. Yes, this text feels a little redundant. But it's nice to spend some extra time with you.",
  "international2023_rewards_stickers_title": "Player and Team Stickers",
  "international2023_rewards_stickers_desc": "\"Only team stickers?\" You didn't even read the title, did you? You get player stickers too. Honestly, these paragraphs are just packing peanuts meant to protect the title in transit to your eyeballs.",
  "international2023_rewards_hud_title": "The International 2023 HUD",
  "international2023_rewards_hud_desc": "That last paragraph might have scared people off from reading this one. So if you stuck around: Pretty smart. It was a test and you passed. Because here's some info not included in the title: the new HUD is custom designed using this year's stained glass theme.",
  "international2023_rewards_loading_screens_title": "Loading Screens",
  "international2023_rewards_loading_screens_desc": "You'll get a custom stained glass-themed loading screen for each team, as well as some of the key art from this year's TI.",
  "international2023_rewards_materials_title": "Fantasy and the Road to TI Challenge Powerups",
  "international2023_rewards_materials_desc": "Use custom tools to craft better players in the Fantasy Challenge, or work through particularly tough content in the Road to TI Challenge.",
  "international2023_rewards_teleport_fx_title": "Favorite Team Teleport Effects",
  "international2023_rewards_teleport_fx_desc": "Show off your favorite team in-game with custom Teleport Effects in three different levels.",
  "international2023_rewards_Types_title": "Reward Types",
  "international2023_rewards_Types_desc": "Each Reward type has its own progress meter. When the meter fills, you can claim that reward. Some meters can be refilled as many times as you want, while others can only be refilled a certain number of times.",
  "international2023_rewards_Levels_title": "Compendium Levels",
  "international2023_rewards_Levels_desc": "Earn Compendium Levels by participating in Compendium activities, or purchasing Level Packs. Apply levels to increase the progress meters of ALL reward types.",
  "international2023_rewards_Boosters_title": "Boosters",
  "international2023_rewards_Boosters_desc": "Boosters are like Compendium Levels, but to increase a single specific reward. Applying a booster to a reward also advances progress on the Collector's Aegis.",
  "international2023_supporters_clubs_title": "Supporters Clubs",
  "international2023_supporters_clubs_subtitle": "Directly Support your Favorite Teams",
  "international2023_supporters_clubs_intro": "Supporters Club Rewards are like the joys of youth — enjoy them while you can, because they're fleeting. Or at least they were. Starting now, they're permanent! So now you can enjoy them forever! Unless you get hit by a bus.\\n\\n Even better: 50% of all sales go directly to the team. Well, even better for them. The first thing's better for you.",
  "international2023_supporters_clubs_tiers_title": "Three Tiers of Support",
  "international2023_supporters_clubs_tiers_desc": "Choose Bronze, Silver or Gold support for your favorite teams to earn rewards designed by the teams themselves.",
  "international2023_talent_title": "Talent Stickers",
  "international2023_talent_subtitle": "Directly Support your Favorite Talent",
  "international2023_talent_intro": "Live esports broadcasting is a tough job. Not coal mining tough, obviously. But harder than knitting stuff on Etsy. Well, obviously not all knitting. Some of those colorful crocheted cardigans look pretty complicated. \\n\\n Now you can send a message to your favorite talent that says, 'Hey… I respect what you do. Not as much as a miner but more than at least 50% of Etsy creators.' Speaking of 50%, half of all the proceeds from talent stickers goes right to the talent.",
  "international2023_talent_tiers_title": "Choose your Tier",
  "international2023_talent_tiers_desc": "Purchase reward bundles starring your favorite talent. Bundles include a combination of stickers, voicelines, and autographs depending on the tier of the bundle purchased.",
  "international2023_talent_coming_soon": "Talent Bundles will be available for purchase after Talent has been announced.",
  "international2023_coming_soon": "Coming Soon",
  "ti12_bp_countdown_header": "To the Group Stage",
  "ti12_bp_countdown_desc": "Tune into the biggest esports tournament of the year — broadcasting live from Seattle with the Aegis of Champions on the line.",
  "ti12_bp_tournament_complete_desc": "Relive the excitement from the biggest esports tournament of the year — all the action from Seattle is just a click away.",
  "ti12_group_stage_venue": "Online",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Support the Tournament",
  "ti12_compendium_header": "The International 2023 Compendium",
  "ti12_compendium_desc": "Unlock even more from the tournament season with The International 2023 Compendium. Play like a pro with the Road to TI Challenge. Build a roster of your favorite pros with redesigned Fantasy. Test your predictive skills with The Oracle's Challenge. And hope the teams do some weird stuff with an all new Bingo feature.\\n\\nEarn rewards such as player stickers, team stickers, chat wheels, a custom HUD, and more, all the way up to a physical replica aegis.\\n\\n25% of all Compendium sales go directly to the prize pool for The International.",
  "ti12_compendium_standard": "Standard Compendium",
  "ti12_compendium_upgraded": "Upgraded Compendium",
  "NoCommaStub": ""
}