// 6707.js

{
  "language": "spanish",
  "ringmastercomic_title_cover": "La marioneta - Portada",
  "ringmastercomic_title": "La marioneta - Página %1$s",
  "ringmastercomic_help_text": "Haz clic en la imagen o utiliza la barra espaciadora para avanzar",
  "ringmastercomic_return_button": "Volver a la portada",
  "ti13_online": "Copenhague",
  "ti13_main_event_venue": "Royal Arena - Copenhague",
  "ti13_best_of_three": "Al mejor de tres",
  "ti13_best_of_five": "Al mejor de cinco",
  "ti13_group_stage_sp_rules": "Fase de grupos - Reglas de prioridad de selección",
  "ti13_group_stage_sp_game1": "Se lanza una moneda al aire.",
  "ti13_group_stage_sp_game2": "Primera partida: quien gane a cara o cruz elige lado o seleccionar héroes.",
  "ti13_group_stage_sp_game3": "Segunda partida: quien pierda a cara o cruz elige lado o seleccionar héroes.",
  "ti13_group_stage_sp_game4": "Tercera partida (si procede): se vuelve a lanzar una moneda al aire. Quien gane a cara o cruz elige lado o seleccionar héroes.",
  "ti13_group_stage_tie_rules": "Fase de grupos - Reglas de desempate",
  "ti13_first_second_tie": "Dos equipos están empatados en primer y segundo lugar",
  "ti13_second_third_tie": "Dos equipos están empatados en segundo y tercer lugar",
  "ti13_third_fourth_tie": "Dos equipos están empatados en tercer y cuarto lugar",
  "ti13_three_way_first_tie": "Tres equipos están empatados en primer lugar",
  "ti13_three_way_second_tie": "Tres equipos están empatados en segundo lugar",
  "ti13_four_way_tie": "Cuatro equipos están empatados en primer lugar",
  "ti13_tie_resolve_bo3": "Se resuelve al mejor de tres.",
  "ti13_tie_resolve_third_fourth": "Ya no se juegan más partidas. Se mantiene el empate entre los dos equipos para el tercer y el cuarto lugar.",
  "ti13_tie_resolve_first_with_round_robin": "El primer lugar se resuelve con una ronda todos contra todos al mejor de uno hasta que un equipo gane dos veces.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Se siguen jugando partidas hasta que todos los equipos se hayan enfrentado entre sí al menos una vez. Para resolver el segundo y el tercer lugar, se utilizan los resultados más recientes de la ronda todos contra todos.",
  "ti13_tie_resolve_second_with_round_robin": "El segundo lugar se resuelve con una ronda todos contra todos al mejor de uno hasta que un equipo gane dos veces.",
  "ti13_tie_resolve_third_fourth_other": "Ya no se juegan más partidas. Se mantiene el empate entre los dos otros equipos para el tercer y el cuarto lugar.",
  "ti13_tie_resolve_four_way_1": "Los equipos se emparejan al azar. Con el fin de explicar estas reglas, digamos que los equipos se llaman Equipo A, Equipo B, Equipo C y Equipo D.",
  "ti13_tie_resolve_four_way_2": "El Equipo A y el Equipo B se enfrentan al mejor de uno. El Equipo C y el Equipo D se enfrentan al mejor de uno.",
  "ti13_tie_resolve_four_way_3": "El primer lugar se resuelve con una partida al mejor de uno entre los equipos ganadores de A contra B y de C contra D.",
  "ti13_tie_resolve_four_way_4": "El cuarto lugar se resuelve con una partida al mejor de uno entre los equipos perdedores de A contra B y de C contra D.",
  "ti13_tie_resolve_four_way_5": "El segundo y el tercer lugar se resuelven con una partida al mejor de uno entre los equipos restantes.",
  "ti13_seeding_decider_sp_rules": "Decisor de la distribución - Reglas de prioridad de selección",
  "ti13_seeding_decider_sp_rules_1": "Primera partida: el primer equipo clasificado de la fase de grupos elige lado o seleccionar héroes.",
  "ti13_seeding_decider_sp_rules_2": "Segunda partida: el último equipo clasificado de la fase de grupos elige lado o seleccionar héroes.",
  "ti13_seeding_decider_sp_rules_3": "Tercera partida (si procede): el primer equipo clasificado de la fase de grupos elige lado o seleccionar héroes.",
  "ti13_playoffs_and_ti_sp_rules": "Eliminatorias y The International - Reglas de prioridad de selección",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Se lanza una moneda al aire.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Primera partida: quien gane a cara o cruz elige lado o seleccionar héroes.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Segunda partida: quien pierda a cara o cruz elige lado o seleccionar héroes.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Tercera partida (si procede): se vuelve a lanzar una moneda al aire. Quien gane a cara o cruz elige lado o seleccionar héroes.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Primera partida: el equipo ganador del grupo ganador elige lado o seleccionar héroes.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Segunda partida: el equipo ganador del grupo perdedor elige lado o seleccionar héroes.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Tercera partida: el equipo ganador del grupo ganador elige lado o seleccionar héroes.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Cuarta partida (si procede): el equipo ganador del grupo perdedor elige lado o seleccionar héroes.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Quinta partida (si procede): se lanza una moneda al aire. Quien gane a cara o cruz elige lado o seleccionar héroes.",
  "international2024_update_title": "TI 2024, Ringmaster y el Compendio",
  "ringmaster_hype": "«¡Liches y Linas, Slarks y Marcis, víctimas de todas las edades! Por fin ha llegado el momento que habéis estado esperando.\\n\\nDurante lo que parece un año, solo se ha conocido mi nombre, pronunciado en susurros furtivos, una sombra oculta tras el telón carmesí. ¡Pero ahora, después de tanto tiempo (demasiado, en mi opinión), los imbéciles al mando de esta organización han tenido a bien permitirme deleitaros con mi magnificencia y asumir mi humilde lugar bajo los focos! ¡Soy yo, Cogliostro Kettle, vuestro malévolo maestro de ceremonias! ¡Oscuro portavoz de los condenados! ¡El único e inimitable RINGMASTER! ¡Y tengo unos cuantos trucos ocultos bajo la manga!»",
  "ringmaster_comic": "«¿No os fiáis de mi palabra? Puede que os convenza este cómic sobre mis trágicos orígenes, cuyo narrador anónimo es digno de plena confianza».",
  "ringmaster_comic_title": "La marioneta",
  "ringmaster_comic_desc": "Lee sobre los orígenes de Ringmaster, cuando iba de gira con el Circo de la Precisión de Osbert Kettle.",
  "ringmaster_guide": "«Me han pedido que os guíe por el Compendio de este año, una oferta que acepté de buena gana. ¡Al fin y al cabo, tenemos que conocernos mejor! [b]Empecemos, ¿de acuerdo?[/b]»",
  "ringmaster_introducing": "Presentamos a",
  "ringmaster_hero_detail_button": "Visita la página del héroe",
  "ringmaster_play_trailer_button": "Ver tráiler",
  "ringmaster_comic_button": "Leer el cómic",
  "international2024_compendium": "Compendio",
  "international2024_compendium_title": "Compendio de The International 2024",
  "international2024_effigies_title": "EFIGIES POR HÉROE",
  "international2024_effigies_subtitle": "Característica mejorada, gratis para todo el mundo",
  "international2024_effigies_intro": "«¡Amigas y amigos, no tanto tiempo atrás, posar la vista sobre estas majestuosas efigies era inusual... pero ya no! ¡Ahora, un monumento espera a cada titán que se lance al campo de batalla, ya sea Ringmaster o cualquier otro héroe de pacotilla!»",
  "international2024_effigies_desc": "Las efigies son estatuas de tus héroes favoritos que puedes colocar en tu base con diferentes poses para fardar de ellas. Ahora, cada héroe tiene un espacio para efigies en el equipamiento de la armería, en vez de compartir un solo espacio general.\\n\\nPuedes quedarte con la nueva efigie predeterminada de cualquier héroe o crear y equipar las tuyas propias.",
  "international2024_purchase_intro": "«¡Dioses y monstruos, creeps y criaturas, venid y deleitad vuestra mirada con [b]la colección más emocionante de juegos, eventos y recompensas[/b] a este lado del río! ¡Poned a prueba vuestro ingenio, vuestra fortuna y vuestro coraje en la celebración del evento de e‑sports más grandioso de todos los reinos!»",
  "international2024_activities": "TODO LO QUE TE ESPERA",
  "international2024_activities_subtitle": "Juegos de azar, despliegues de habilidades y sorpresas para todas las edades",
  "international2024_activities_intro": "«He oído que algunos de vosotros necesitáis una RAZÓN para matar, a diferencia de vuestro mentalmente estable maestro de ceremonias. ¡Por eso, amigos míos, cada partida que juguéis os dará puntos! ¡Cuantas más partidas, más puntos, así que lanzaos a las sendas y empezad a acumular puntos!»",
  "international2024_activities_play_title": "Juega a Dota y consigue puntos",
  "international2024_activities_play_desc": "Este año, casi todas las partidas que juegues a través del desafío semanal te darán puntos. También ganarás puntos adicionales por tu primera victoria de cada día.",
  "international2024_activities_fantasy_title": "Fantasía",
  "international2024_activities_fantasy_desc": "Compite contra tus amigos y contra jugadores de Dota de todo el mundo. Elige entre tus profesionales favoritos para formar la mejor alineación de fantasía y crea cartas personalizadas con estadísticas que te darán aún más puntos.",
  "international2024_activities_oracles_title": "Desafío del Oráculo",
  "international2024_activities_oracles_desc": "Adivina qué equipos se clasificarán y cuáles quedarán eliminados, y deléitate con la precisión de tus pronósticos (si acertaste, claro).",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Obtén cartones de bingo generados aleatoriamente para cada fase del torneo, repletos de condiciones pintorescas y situaciones interesantes.",
  "international2024_activities_outro": "«¡Recuerda que ganar no es solo una recompensa en sí! ¡Cada vez que triunfes en una de estas actividades, conseguirás puntos! ¡Pásate por el mostrador de premios más abajo para ver por qué recompensas los puedes canjear!»",
  "international2024_rewards_title": "Recompensas del Compendio",
  "international2024_rewards_subtitle": "Adelante, atrévete a contemplar estos premios",
  "international2024_rewards_intro": "«¡Dejad un rastro de cadáveres a vuestro paso y reclamad vuestros premios! ¡Y QUÉ premios os esperan! No, no me refiero al premio de ver la vida de un desventurado héroe escaparse de sus ojos con tus manos rodeándole la garganta. ¡Eso es una recompensa en SÍ mismo! ¡Me refiero a lo que conseguiréis DESPUÉS!»",
  "international2024_rewards_physical_aegis_title": "Modelo físico de la Égida",
  "international2024_rewards_physical_aegis_desc": "¿Tienes un agujero en la estantería y en el corazón que solo una Égida podría llenar? Llénalo con esta réplica de aleación de níquel a escala 1:5 del famoso premio de los campeones.",
  "international2024_rewards_hud_title": "HUD de The International 2024",
  "international2024_rewards_hud_desc": "Decora la interfaz del juego con la magia del circo. Hemos renovado el HUD con la temática de TI de este año.",
  "international2024_rewards_versus_title": "Pantalla de enfrentamiento 2024",
  "international2024_rewards_versus_desc": "Alimenta tu espíritu de lucha antes de la partida con una pantalla de enfrentamiento personalizada que exhibe los nuevos espacios para efigies de héroes.",
  "international2024_rewards_chat_wheels_title": "Ruedas de chat permanentes",
  "international2024_rewards_stickers_title": "Pegatinas de jugadores y equipos",
  "international2024_rewards_loading_screens_title": "Pantallas de carga",
  "international2024_rewards_materials_title": "Mejoras del desafío Fantasía y del Bingo",
  "international2024_rewards_teleport_fx_title": "Efectos de teletransporte de tu equipo favorito",
  "international2024_rewards_effigy_title": "Bloque de Efigie 2024",
  "international2024_supporters_clubs_title": "Apoya a la comunidad",
  "international2024_supporters_clubs_subtitle": "Lotes de apoyo a talentos y equipos",
  "international2024_supporters_clubs_intro": "«¡Estimados benefactores! ¡Filántropos de todas las edades! ¡Humildes mecenas de las artes matatorias y relacionadas! ¡El 50 % de vuestros generosos donativos se destinará directamente a vuestros equipos y talentos de retransmisión favoritos! ¿Quién es el verdadero héroe? ¡Yo, por supuesto, pues os aplaudo a VOSOTROS con mis manos tremendamente heroicas!»",
  "international2024_supporters_clubs_tiers_title": "Clubs de seguidores de los equipos",
  "international2024_supporters_clubs_tiers_desc": "Elige el apoyo de nivel oro, plata o bronce de tus equipos favoritos para obtener recompensas diseñadas por ellos mismos.",
  "international2024_talent_tiers_title": "Lotes de pegatinas de talentos",
  "international2024_talent_tiers_desc": "Compra lotes de recompensas con tu talento favorito. Los lotes incluyen una combinación de pegatinas, líneas de voz y autógrafos, dependiendo del nivel del lote que compres.",
  "ti13_compendium_small_header": "Apoya el torneo",
  "ti13_compendium_header": "Compendio de The International 2024",
  "ti13_compendium_desc": "El Compendio es tu compañero digital interactivo en The International. Incluye todas las actividades, los desafíos y las recompensas del evento de este año. Además, el 25 % de todas las ventas se destina al fondo de premios de The International 2024.",
  "ti13_compendium_bp_btn": "Visitar sitio web",
  "ti13_compendium_standard": "Compendio estándar",
  "ti13_compendium_standard_subtitle": "Todas las características y actividades",
  "ti13_compendium_upgraded": "Compendio mejorado",
  "ti13_compendium_upgraded_subtitle": "Todas las características y actividades, y recompensas aceleradas",
  "ti13_compendium_purchase_tp_fx": "Efecto de teletransporte de nivel 1 de TI 2024",
  "ti13_compendium_purchase_boosters_footnote": "Los potenciadores pueden desbloquear el contenido adicional que elijas",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Los potenciadores pueden desbloquear el HUD de The International 2024 o el contenido adicional que elijas",
  "ti13_compendium_purchase_levels": "%1$s niveles del Compendio",
  "ti13_compendium_purchase_booster_levels": "%1$s potenciadores",
  "ti13_compendium_purchase_discount": "Ahorra un %1$s % en niveles",
  "ti13_compendium_purchase_earn_the_following": "Los niveles del Compendio desbloquearán:",
  "ti13_compendium_purchase_all_access": "Acceso a todas las características del Compendio",
  "ti13_compendium_purchase_aegis_emoticon": "Emoticono de la Égida",
  "ti13_compendium_purchase_bingo_tokens": "%1$s fichas del Bingo",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s fichas de renovación de la liga Fantasía",
  "ti13_compendium_purchase_one_player_sticker": "1 cápsula de pegatinas de jugadores",
  "ti13_compendium_purchase_player_stickers": "%1$s cápsulas de pegatinas de jugadores",
  "ti13_compendium_purchase_team_stickers": "%1$s cápsulas de pegatinas de equipos",
  "ti13_compendium_purchase_effigy_blocks": "%1$s bloques de Efigie de TI 2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s tesoros de pantallas de carga de equipos",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s tesoros de pantallas de carga de TI",
  "international2024_tournament_learn_more": "Más información sobre el torneo",
  "ringmaster_abilities_heading": "Habilidades",
  "ringmaster_souvenirs_heading": "Souvenirs",
  "ringmaster_ability_tame_the_beasts": "Domador de Fieras",
  "ringmaster_ability_tame_the_beasts_Description": "CANALIZADA: Ringmaster gira su látigo y da un latigazo. Los enemigos alcanzados con el látigo reciben daño y salen huyendo espantados por Ringmaster. El tiempo de canalización aumenta exponencialmente el daño y amplía la duración del temor, pero reduce el radio.",
  "ringmaster_ability_the_box": "Escapismo",
  "ringmaster_ability_the_box_Description": "Ringmaster mete a un héroe aliado o a sí mismo en una caja móvil extradimensional. Una vez en la caja, las unidades obtienen movimiento en fase, resistencia a la ralentización, y resistencia a la magia y velocidad de movimiento adicionales. Además, no se pueden seleccionar como objetivo de un ataque, y quedan enmudecidas, silenciadas y desarmadas. La caja se abre una vez que finaliza el efecto o si el héroe se desplaza fuera del radio.",
  "ringmaster_ability_impalement": "Lanzamiento de Cuchillos",
  "ringmaster_ability_impalement_Description": "Ringmaster lanza una de sus dagas al punto preciso que elige. Si alcanza a un enemigo, la daga inflige daño por impacto, ralentiza brevemente a la unidad alcanzada, e inflige un porcentaje de la vida máxima de la víctima como daño por segundo.",
  "ringmaster_ability_wheel": "Rueda de la Ilusión",
  "ringmaster_ability_wheel_Description": "Ringmaster lanza la Rueda de la Ilusión a la ubicación objetivo, derribando a los enemigos a su paso. Una vez que llega al objetivo, los enemigos que se encuentran en el alcance de la rueda reciben daño con el tiempo y quedan ralentizados. La rueda hipnotiza y atrae a los enemigos que están de cara a ella durante más de 0,5 s. El primer enemigo hipnotizado activa un temporizador para que la rueda explote. Si el temporizador no se activa, la rueda explota automáticamente al cabo de 8 s.",
  "ringmaster_ability_spotlight": "Foco",
  "ringmaster_ability_spotlight_Description": "Ringmaster proyecta un foco que barre un área. Los enemigos que se encuentran en el haz de luz tienen una probabilidad de fallar sus ataques y quedan a la vista si son invisibles. Las ilusiones alcanzadas por el rayo pierden un porcentaje de vida máxima por segundo y se desvanecen.",
  "ringmaster_ability_dark_carnival_trinkets": "Charlatán de la Feria del Horror",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ringmaster recibe un souvenir aleatorio de la Feria del Horror de un solo uso cada vez que un héroe enemigo muere cerca de él. Los souvenirs adicionales se guardan como cargas. Ringmaster recibe un souvenir si no tiene ninguno cuando reaparece. Los souvenirs de la Feria del Horror son: Espejo del Laberinto, Tónico del Forzudo y Cojín de Pedorretas.",
  "ringmaster_ability_funhouse_mirror": "Espejo del Laberinto",
  "ringmaster_ability_funhouse_mirror_Description": "Uso: Proporción Distorsionada\\n\\nCrea 1 imagen imperfecta de tu héroe que dura 18 s. La ilusión inflige un 28 % y recibe un 300 % de daño.",
  "ringmaster_ability_whoopee_cushion": "Cojín de Pedorretas",
  "ringmaster_ability_whoopee_cushion_Description": "Uso: Tufo\\n\\nPropulsa a tu héroe 400 unidades hacia delante. Deja tras de sí una nube de hedor con un radio de 200 durante 3 s que ralentiza a los enemigos un 30 %.",
  "ringmaster_ability_strongman_tonic": "Tónico del Forzudo"
}