// 5004.js

{
  "language": "czech",
  "ringmastercomic_title_cover": "Loutka – titulní stránka",
  "ringmastercomic_title": "Loutka – %1$s. stránka",
  "ringmastercomic_help_text": "Na další stranu otočíte kliknutím nebo mezerníkem",
  "ringmastercomic_return_button": "Zpět na titulní stránku",
  "ti13_online": "Kodaň",
  "ti13_main_event_venue": "Kodaň – Royal Arena",
  "ti13_best_of_three": "Na 2 výhry",
  "ti13_best_of_five": "Na 3 výhry",
  "ti13_group_stage_sp_rules": "Skupinová fáze – pravidla přednosti výběru",
  "ti13_group_stage_sp_game1": "Hod mincí.",
  "ti13_group_stage_sp_game2": "První hra: Hod mincí, přičemž vítěz si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_group_stage_sp_game3": "Druhá hra: Hod mincí, přičemž poražený si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_group_stage_sp_game4": "Třetí hra (pokud na ni dojde): Další hod mincí, přičemž vítěz si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_group_stage_tie_rules": "Skupinová fáze – pravidla tie-breaků",
  "ti13_first_second_tie": "O 1. a 2. místo se dělí dva týmy",
  "ti13_second_third_tie": "O 2. a 3. místo se dělí dva týmy",
  "ti13_third_fourth_tie": "O 3. a 4. místo se dělí dva týmy",
  "ti13_three_way_first_tie": "O 1. místo se dělí tři týmy",
  "ti13_three_way_second_tie": "O 2. místo se dělí tři týmy",
  "ti13_four_way_tie": "O 1. místo se dělí čtyři týmy",
  "ti13_tie_resolve_bo3": "Bude vyřešeno odehráním zápasu na 2 výhry.",
  "ti13_tie_resolve_third_fourth": "Nebudou odehrány žádné další zápasy. Dva týmy se budou nadále dělit o 3. a 4. místo.",
  "ti13_tie_resolve_first_with_round_robin": "1. místo bude vyřešeno odehráním menší „skupiny“, kde se každý utká s každým v zápasech „na 1 výhru“, dokud jeden tým nevyhraje dvakrát.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Bude se pokračovat ve hraní, dokud se každý alespoň jednou neutká s každým. Pro vyřešení 2. a 3. místa budou použity poslední výsledky z těchto zápasů.",
  "ti13_tie_resolve_second_with_round_robin": "2. místo bude vyřešeno odehráním menší „skupiny“, kde se každý utká s každým v zápasech „na 1 výhru“, dokud jeden tým nevyhraje dvakrát.",
  "ti13_tie_resolve_third_fourth_other": "Nebudou odehrány žádné další zápasy. Zbylé dva týmy se budou nadále dělit o 3. a 4. místo.",
  "ti13_tie_resolve_four_way_1": "Týmy budou náhodně spárovány. Pro účely vysvětlení pravidel nazvěme tyto týmy jako Tým A, Tým B, Tým C a Tým D.",
  "ti13_tie_resolve_four_way_2": "Tým A odehraje s Týmem B zápas na 1 výhru. Tým C odehraje s Týmem D taktéž zápas na 1 výhru.",
  "ti13_tie_resolve_four_way_3": "1. místo bude vyřešeno odehráním zápasu na 1 výhru mezi vítězem A/B a vítězem C/D.",
  "ti13_tie_resolve_four_way_4": "4. místo bude vyřešeno odehráním zápasu na 1 výhru mezi poraženým A/B a poraženým C/D.",
  "ti13_tie_resolve_four_way_5": "2. a 3. místo budou vyřešeny odehráním zápasu na 1 výhru mezi zbývajícími týmy.",
  "ti13_seeding_decider_sp_rules": "Rozhodující zápas o nasazení – pravidla přednosti výběru",
  "ti13_seeding_decider_sp_rules_1": "První hra: Tým umístěný ve skupinové fázi výše si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_seeding_decider_sp_rules_2": "Druhá hra: Tým umístěný ve skupinové fázi níže si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_seeding_decider_sp_rules_3": "Třetí hra (pokud na ni dojde): Tým umístěný ve skupinové fázi výše si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_playoffs_and_ti_sp_rules": "Playoff a The International – pravidla přednosti výběru",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Hod mincí.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "První hra: Hod mincí, přičemž vítěz si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Druhá hra: Hod mincí, přičemž poražený si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Třetí hra (pokud na ni dojde): Další hod mincí, přičemž vítěz si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "První hra: Vítěz skupiny vítězů si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Druhá hra: Vítěz skupiny poražených si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Třetí hra: Vítěz skupiny vítězů si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Čtvrtá hra (pokud na ni dojde): Vítěz skupiny poražených si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Pátá hra (pokud na ni dojde): Hod mincí, přičemž vítěz si určí, jestli chce jako první vybírat hrdiny, nebo stranu.",
  "international2024_update_title": "Ringmaster a Přehled šampionátu The International 2024",
  "ringmaster_hype": "„Lichové a Liny, Slarkové a Marci, oběti všech věků! Nadešel okamžik, na který jste všichni netrpělivě čekali!\\n\\n Dlouhou dobu – skoro celý rok – jsem byl znám pouze jako jméno. Jako nezvratný osud, o němž se mluví pouze šeptem. Jako stín číhající za karmínově zbarvenou oponou. Ale nyní... nyní mi ti tupci zodpovědní za přípravu show konečně dovolili, abych Vás oblažil svojí velkolepostí a zaujal své právoplatné místo v záři reflektorů! A jsem to vskutku já, Cogliostro Kettle. Maestro mizérie! Král krutosti! Jediný pravý RINGMASTER, který na bojišti rozpoutá cirkus nevídaných rozměrů!“",
  "ringmaster_comic": "„Nevěříte mi? Přečtěte si komiks o mém tragickém původu v podání důvěryhodného anonymního vypravěče.“",
  "ringmaster_comic_title": "Loutka",
  "ringmaster_comic_desc": "Přečtěte si o tom, jak Ringmaster ve svých počátcích putoval s Kettlovým mechanickým cirkusem.",
  "ringmaster_guide": "„Zároveň jsem byl požádán, abych byl průvodcem Přehledu letošního šampionátu, což jsem s vděčností přijal, neb se domnívám, že bychom se měli lépe poznat! [b]Tak se do toho pustíme, co Vy na to?[/b]“",
  "ringmaster_introducing": "Na pódium přichází",
  "ringmaster_hero_detail_button": "Přejít na stránku hrdiny",
  "ringmaster_play_trailer_button": "Přehrát upoutávku",
  "ringmaster_comic_button": "Přečíst komiks",
  "international2024_compendium": "Přehled",
  "international2024_compendium_title": "Přehled šampionátu The International 2024",
  "international2024_effigies_title": "PODOBIZNY JEDNOTLIVÝCH HRDINŮ",
  "international2024_effigies_subtitle": "Vylepšená funkce dostupná zdarma všem",
  "international2024_effigies_intro": "„Vážení přátelé, není tomu tak dávno, co bylo velkou vzácností zahlédnout tyto majestátní podobizny! Těm dnům je však konec! Nyní čeká podobizna na každého titána, který vstoupí do arény smrti, ať už se jedná o Ringmastera, nebo kteréhokoli z méně důležitých hrdinů!“",
  "international2024_effigies_desc": "Podobizny jsou přizpůsobitelné sochy Vašich oblíbených hrdinů, které stojí v základnách. Nově už však nesdílí jeden globální slot a každý hrdina může mít vybavenou jinou podobiznu.\\n\\nPonechte mu tedy jeho výchozí sochu, nebo si vytvořte svoji vlastní.",
  "international2024_purchase_intro": "„Bohové a příšery, vojáci a zvířata, přistupte blíže a vychutnejte si pohled na [b]nejúžasnější sbírku aktivit a tematických odměn[/b] na této straně řeky! Otestujte svůj důvtip, štěstí i odvahu v rámci oslav největší e-sportovní události v této i kterékoli jiné dimenzi!“",
  "international2024_activities": "CO VŠE ZÍSKÁTE",
  "international2024_activities_subtitle": "Hry štěstěny, ukázky dovedností a úkoly pro všechny",
  "international2024_activities_intro": "„Bylo mi řečeno, že někteří z Vás na rozdíl ode mě potřebují DŮVOD k zabíjení. Inu, dobrá zpráva: každý zápas, který odehrajete, Vám zajistí pár bodíků! A čím víc toho odehrajete, tím víc bodíků získáte, takže hurá na bojiště, ať se můžete radovat z rostoucího konta. Slabomyslní hlupáci...“",
  "international2024_activities_play_title": "Body za hraní",
  "international2024_activities_play_desc": "Letos získáte skrze týdenní výzvu body Přehledu za každý odehraný zápas. Co víc, za první výhru dne získáte body navíc!",
  "international2024_activities_fantasy_title": "Fantasy týmy",
  "international2024_activities_fantasy_desc": "Soupeřte se svými přáteli i ostatními hráči z celého světa. Sestavte si ze svých oblíbenců tým snů a vytvářejte karty s lepšími bonusy.",
  "international2024_activities_oracles_title": "Tipovací výzvy",
  "international2024_activities_oracles_desc": "Tipněte si, které týmy postoupí a které vypadnou, a poté se chlubte svými věšteckými schopnostmi (a neúspěchy sveďte na osud).",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Získejte pro každou fázi šampionátu náhodně vygenerovanou kartičku plnou podmínek, v jejichž vyplnění můžete doufat.",
  "international2024_activities_outro": "„A nezapomeňte, že tady se nehraje jenom o dobrý pocit – vždy když uspějete v některé z těchto aktivit, dostanete body. Odneste je níže ke stánku s odměnami a do posledního je směňte! Peníze ani čas nevracíme!“",
  "international2024_rewards_title": "Odměny Přehledu",
  "international2024_rewards_subtitle": "Žasněte nad výčtem grandiózních odměn",
  "international2024_rewards_intro": "„Vršte mrtvoly svých soků a vyzvedávejte si odměny! A že to jsou odměny s velkým O! Ne, Vy tam vzadu, ruce kolem krku a možnost sledovat v očích nebohého hrdiny, jak ho opouští život, mezi těmito odměnami není. To je odměna z JINÉ kategorie! Ale tyhle odměny získáte PO jejím vyzvednutí!“",
  "international2024_rewards_physical_aegis_title": "Replika Aegisu",
  "international2024_rewards_physical_aegis_desc": "Vyplňte díru ve svém srdci (a na své poličce) slitinovou replikou trofeje letošního šampionátu The International v měřítku 1 ku 5.",
  "international2024_rewards_hud_title": "Vzhled ukazatelů",
  "international2024_rewards_hud_desc": "Prodchněte své herní rozhraní atmosférou cirkusu se zbrusu novým vzhledem ukazatelů.",
  "international2024_rewards_versus_title": "Úvodní obrazovka",
  "international2024_rewards_versus_desc": "Dodejte si kuráž do boje s tematickou úvodní obrazovkou vyobrazující nově řešené podobizny hrdinů.",
  "international2024_rewards_chat_wheels_title": "Permanentní zvuky a hlášky",
  "international2024_rewards_stickers_title": "Samolepky hráčů a týmů",
  "international2024_rewards_loading_screens_title": "Načítací obrazovky",
  "international2024_rewards_materials_title": "Pomocné předměty",
  "international2024_rewards_teleport_fx_title": "Efekty teleportu",
  "international2024_rewards_effigy_title": "Materiál podobizen",
  "international2024_supporters_clubs_title": "Podpora komunity",
  "international2024_supporters_clubs_subtitle": "Balíčky týmů a uvaděčů",
  "international2024_supporters_clubs_intro": "„Vážení dobrodinci! Filantropové z celého světa! Skromní mecenáši krvavých a přidružených umění! Polovina z Vašich velkorysých darů poputuje přímo Vašim oblíbeným týmům a uvaděčům! Kdo je tu potom opravdový hrdina? Stále já, nicméně i já se musím sklonit před VÁMI!“",
  "international2024_supporters_clubs_tiers_title": "Fanouškovské kluby",
  "international2024_supporters_clubs_tiers_desc": "Vyberte si bronzové, stříbrné nebo zlaté členství a získejte odměny navržené přímo podporovaným týmem.",
  "international2024_talent_tiers_title": "Balíčky uvaděčů",
  "international2024_talent_tiers_desc": "Podpora uvaděčů probíhá skrze balíčky jejich předmětů. V závislosti na úrovni se tak můžete těšit na samolepky, hlášky nebo autogramy.",
  "ti13_compendium_small_header": "Podpora šampionátu",
  "ti13_compendium_header": "Přehled šampionátu The International 2024",
  "ti13_compendium_desc": "Přehled šampionátu The International 2024 je Vaším interaktivním průvodcem největší událostí letošního roku, který na jednom místě shromažďuje všechny související aktivity, výzvy a odměny. A 25 % z ceny každého prodaného Přehledu jde do celkové výhry!",
  "ti13_compendium_bp_btn": "Přejít na webovou stránku",
  "ti13_compendium_standard": "Standardní Přehled",
  "ti13_compendium_standard_subtitle": "Všechny funkce a aktivity",
  "ti13_compendium_upgraded": "Vylepšený Přehled",
  "ti13_compendium_upgraded_subtitle": "Všechny funkce a aktivity a rychlejší získávání odměn",
  "ti13_compendium_purchase_tp_fx": "Efekt teleportu – 1. úroveň",
  "ti13_compendium_purchase_boosters_footnote": "Bonusy mohou odemknout dodatečný obsah dle výběru",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Bonusy mohou odemknout tematický vzhled ukazatelů, nebo dodatečný obsah dle výběru",
  "ti13_compendium_purchase_levels": "%1$s úrovní Přehledu",
  "ti13_compendium_purchase_booster_levels": "%1$s bonusů Přehledu",
  "ti13_compendium_purchase_discount": "O %1$s % výhodnější cena",
  "ti13_compendium_purchase_earn_the_following": "Úrovně odemknou:",
  "ti13_compendium_contribution": "25 % ze všech prodejů putuje do celkové výhry šampionátu The International 2024.",
  "ti13_compendium_purchase_all_access": "Přístup ke všem funkcím Přehledu",
  "ti13_compendium_purchase_aegis_emoticon": "Emotikon Aegis",
  "ti13_compendium_purchase_bingo_tokens": "%1$s× Žeton binga",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s× Obnovovací žeton",
  "ti13_compendium_purchase_one_player_sticker": "1× Kapsle se samolepkami hráčů",
  "ti13_compendium_purchase_player_stickers": "%1$s× Kapsle se samolepkami hráčů",
  "ti13_compendium_purchase_team_stickers": "%1$s× Kapsle se samolepkami týmů",
  "ti13_compendium_purchase_effigy_blocks": "%1$s× Effigy Block of TI2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s× Truhla s načítacími obrazovkami týmů",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s× Truhla s načítacími obrazovkami šampionátu",
  "international2024_tournament_learn_more": "Zjistit více o šampionátu",
  "ringmaster_abilities_heading": "Schopnosti",
  "ringmaster_souvenirs_heading": "Suvenýry",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "VYVOLÁVÁ SE – Ringmaster začne nad hlavou točit svým bičem, načež jím práskne a zasažení nepřátelé utrží poškození a strachy se rozutečou směrem od něj. Čím déle Ringmaster schopnost vyvolává, tím vyšší je poškození a delší trvání vystrašení, ale zároveň se tím zmenšuje rozsah prásknutí.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster schová sebe nebo spojeneckého hrdinu do mobilní extradimenzionální bedny, která poskytuje bezhmotný pohyb, bonusy k odolnosti vůči magii a zpomalení a také bonus k rychlosti pohybu. Hrdinu není možné v bedně zacílit, ale je umlčen, utišen a odzbrojen. Bedna se rozpadne buď se skončením trvání schopnosti, nebo pokud se s ní hrdina posune mimo rozsah.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster s naprostou přesností vrhne jeden ze svých nožů. Pokud nůž zasáhne nepřítele, udělí mu poškození, krátce ho zpomalí a způsobí mu krvácení, které hrdinům udílí každou sekundu poškození ve výši určitého procenta z jejich maximálního zdraví, zatímco creepům udílí každou sekundu fixní poškození.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster vyšle do cílové lokace Kolo úžasu, které při kutálení odhodí všechny nepřátele stojící mu v cestě. Jakmile se kolo zastaví, nepřátelé v jeho okruhu začnou dostávat průběžné poškození a jsou zpomaleni. Nepřátelští hrdinové, kteří se na déle než 0,5 sekundy otočí čelem ke kolu, jím jsou zhypnotizováni a přinuceni k němu jít. První zhypnotizovaný nepřítel navíc spustí odpočet do výbuchu kola. Pokud odpočet není spuštěn, kolo automaticky vybuchne po 8 sekundách.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster vyšle paprsek reflektoru, aby pročesal cílovou oblast. Nepřátelé nacházející se ve světle mají šanci minout své útoky, a pokud byli neviditelní, jsou odhaleni. Pronikavá záře paprsku nutí blednout iluze, takže každou sekundu ztratí určité procento ze svého maximálního zdraví.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Kdykoli poblíž něj zemře nepřátelský hrdina, Ringmaster získá náhodný jednorázový suvenýr z Karnevalu krutosti. Pokud už nějaký suvenýr má, další jsou přidávány jako nabití. Pokud Ringmaster oživne bez použitelného suvenýru, jeden je mu náhodně přidělen.Suvenýry jsou Funhouse Mirror, Strongman Tonic a Whoopee Cushion.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Použití: Proportion Distortion\\n\\nVytvoří 1 nedokonalý obraz tvého hrdiny, který na bojišti vydrží 18 sekund. Iluze udílí 28% poškození a dostává 300% poškození.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Použití: Whoopsie\\n\\nVystřelí tvého hrdinu o 400 jednotek dopředu. Za hrdinou také zůstane smradlavý obláček s rozsahem 200 jednotek, který 3 sekundy zpomaluje nepřátele o 30%.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic",
  "ringmaster_ability_strongman_tonic_Description": "Použití: Forcefully Imbibe\\n\\nDočasně navýší sílu spojeneckého hrdiny o 5 + 1,5 bodu za každou Ringmasterovu úroveň. Efekt trvá celkem 8 sekund, ale po prvních 4 sekundách začne slábnout."
}