// 4955.js

{
  "language": "norwegian",
  "ringmastercomic_title_cover": "Dukken – forside",
  "ringmastercomic_title": "Dukken – side %1$s",
  "ringmastercomic_help_text": "Trykk på bildet eller bruk mellomrom for å gå videre",
  "ringmastercomic_return_button": "Gå tilbake til forsiden",
  "ti13_online": "København",
  "ti13_main_event_venue": "Royal Arena – København",
  "ti13_best_of_three": "Best av tre",
  "ti13_best_of_five": "Best av fem",
  "ti13_group_stage_sp_rules": "Gruppespill – regler for valgprioritet",
  "ti13_group_stage_sp_game1": "Myntkast.",
  "ti13_group_stage_sp_game2": "Første kamp: Vinneren av myntkastet velger enten valgprioritet eller side.",
  "ti13_group_stage_sp_game3": "Andre kamp: Vinneren av myntkastet velger enten valgprioritet eller side.",
  "ti13_group_stage_sp_game4": "Tredje kamp (hvis aktuelt): Nytt myntkast. Vinneren av det nye myntkastet velger valgprioritet eller side.",
  "ti13_group_stage_tie_rules": "Gruppespill – regler for omspill",
  "ti13_first_second_tie": "To lag på delt førsteplass",
  "ti13_second_third_tie": "To lag på delt andreplass",
  "ti13_third_fourth_tie": "To lag på delt tredjeplass",
  "ti13_three_way_first_tie": "Tre lag på delt førsteplass",
  "ti13_three_way_second_tie": "Tre lag på delt andreplass",
  "ti13_four_way_tie": "Fire lag på delt førsteplass",
  "ti13_tie_resolve_bo3": "Avgjør med best av tre.",
  "ti13_tie_resolve_third_fourth": "Ingen flere kamper spilles. De to lagene forblir på delt tredjeplass.",
  "ti13_tie_resolve_first_with_round_robin": "Avgjør førsteplassen ved at alle spiller best av én mot hverandre helt til ett lag vinner to ganger.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Fortsett å spille helt til alle lagene har spilt mot hverandre minst én gang. Bruk de siste resultatene fra alle mot alle for å avgjøre andre- og tredjeplassen.",
  "ti13_tie_resolve_second_with_round_robin": "Avgjør andreplassen ved at alle spiller best av én mot hverandre helt til ett lag vinner to ganger.",
  "ti13_tie_resolve_third_fourth_other": "Ingen flere kamper spilles. De to andre lagene forblir på delt tredjeplass.",
  "ti13_tie_resolve_four_way_1": "Sett opp to og to lag tilfeldig. Som eksempel i disse reglene brukes lag A, lag B, lag C og lag D.",
  "ti13_tie_resolve_four_way_2": "Lag A spiller mot lag B i best av én. Lag C spiller mot lag D i best av én.",
  "ti13_tie_resolve_four_way_3": "Avgjør førsteplassen ved å spille best av én mellom vinneren av A/B og vinneren av C/D.",
  "ti13_tie_resolve_four_way_4": "Avgjør fjerdeplassen ved å spille best av én mellom taperen av A/B og taperen av C/D.",
  "ti13_tie_resolve_four_way_5": "Avgjør andre- og tredjeplassen ved å spille best av én mellom de resterende lagene.",
  "ti13_seeding_decider_sp_rules": "Avgjørelse av seeding – regler for valgprioritet",
  "ti13_seeding_decider_sp_rules_1": "Første kamp: Laget med høyest seed fra gruppespillet velger enten valgprioritet eller side.",
  "ti13_seeding_decider_sp_rules_2": "Andre kamp: Laget med lavest seed fra gruppespillet velger enten valgprioritet eller side.",
  "ti13_seeding_decider_sp_rules_3": "Tredje kamp (hvis aktuelt): Laget med høyest seed fra gruppespillet velger enten valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules": "Sluttspill og The International – regler for valgprioritet",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Myntkast.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Første kamp: Vinneren av myntkastet velger enten valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Andre kamp: Vinneren av myntkastet velger enten valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Tredje kamp (hvis aktuelt): Nytt myntkast. Vinneren av det nye myntkastet velger valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Første kamp: Vinneren av det øvre sluttspillet velger enten valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Andre kamp: Vinneren av det øvre sluttspillet velger enten valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Tredje kamp: Vinneren av det øvre sluttspillet velger enten valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Fjerde kamp (hvis aktuelt): Vinneren av det øvre sluttspillet velger enten valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Femte kamp (hvis aktuelt): Myntkast. Vinneren av myntkastet velger valgprioritet eller side.",
  "international2024_update_title": "The International 2024, Ringmaster og kompendiet",
  "ringmaster_hype": "«Lich og Lina, Slark og Marci, ofre i alle aldre! Øyeblikket dere alle har ventet på!\\n\\n I det som virker som et år nå, har jeg bare eksistert i navnet – nevnt i stille hvisken, en luskende skygge bak det blodrøde sløret. Men nå, etter langt (for langt om du spør meg) om lenge, har dårene som har ansvaret for dette foretaket, kommet til fornuft og latt meg velsigne dere med min prakt og ydmykt ta plass i rampelyset! Det er meg, Cogliostro Kjel – mannevond maestro! De fordømtes mørke utroper! Selveste RINGMASTER! Og jeg har noen ess i ermet!»",
  "ringmaster_comic": "«Men du trenger ikke ta meg på ordet! Hvorfor ikke lese en tegneserie om min tragiske opprinnelseshistorie, fortalt av en pålitelig, anonym forteller?»",
  "ringmaster_comic_title": "Dukken",
  "ringmaster_comic_desc": "Les om Ringmasters unge dager på turné med Kjels mekaniske sirkus.",
  "ringmaster_guide": "«Jeg er blitt spurt om å veilede dere gjennom årets kompendium – et tilbud jeg takknemlig takket ja til. Vi bør jo tross alt bli bedre kjent! [b]Skal vi ikke bare komme i gang?[/b]»",
  "ringmaster_introducing": "Vi introduserer",
  "ringmaster_hero_detail_button": "Se heltens informasjonsside",
  "ringmaster_play_trailer_button": "Se trailer",
  "ringmaster_comic_button": "Les tegneserien",
  "international2024_compendium": "Kompendium",
  "international2024_compendium_title": "The International 2024-kompendiet",
  "international2024_effigies_title": "STATUER FOR HVER HELT",
  "international2024_effigies_subtitle": "Oppgradert funksjon, gratis for alle",
  "international2024_effigies_intro": "«Det var en gang, venner, for ikke så lenge siden, da disse storslåtte statuene var ganske så sjeldne syn! Ikke nå lenger! Nå venter det et monument for hver en kjempe som skal inn på slagmarken, enten det er Ringmaster eller alle de andre mindreverdige heltene!»",
  "international2024_effigies_desc": "Du kan forme statuer av favorittheltene og vise frem i basen. Istedenfor en delt global plass har hver helt nå sin egen plass for statuer i arsenalet.\\n\\nHold deg til standardstatuen for enhver helt, eller lag og utstyr en egen.",
  "international2024_purchase_intro": "«Guder og monstre, kryp og krøtter, kom nærmere og nyt det heldige synet av [b]den mest spennende samlingen av spill, hendelser og e-sportsbelønninger[/b] på denne siden av elven! Se hva vettet og flaksen duger til i en feiring av det største e-sportsarrangementet i dette riket eller et hvilket som helst annet!»",
  "international2024_activities": "DETTE FÅR DU",
  "international2024_activities_subtitle": "Sjansespill, bragder og herligheter for alle aldre",
  "international2024_activities_intro": "«I motsetning til denne stabile seremonimesteren, har jeg hørt at noen av dere trenger en GRUNN til å drepe. Så hver kamp du spiller, kommer til å gi deg poeng! Jo mer du spiller, jo mer får du, så ta rennefart ut i stien og se poengene hope seg opp!»",
  "international2024_activities_play_title": "Spill Dota: tjen poeng",
  "international2024_activities_play_desc": "I år tjener du poeng for nesten hver kamp du spiller gjennom den ukentlige utfordringen. Du får også bonuspoeng for dagens første seier.",
  "international2024_activities_fantasy_title": "Fantasi",
  "international2024_activities_fantasy_desc": "Konkurrer mot venner og Dota-spillere over hele verden. Velg den beste fantasioppstillingen bestående av favorittproffene og lag tilpassede kort med poengsankende statistikker.",
  "international2024_activities_oracles_title": "Orakelets utfordring",
  "international2024_activities_oracles_desc": "Forutsi hvilke lag som går videre og hvilke som faller fra, og sol deg i spådommenes nøyaktighet (forutsatt at du tok riktig).",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Få et tilfeldig generert bingobrett for hver fase av turneringen, proppfullt av merkelige vilkår og interessante situasjoner.",
  "international2024_activities_outro": "«Husk! Å vinne er ikke bare sin egen belønning! Hver gang du lykkes i én av disse aktivitetene, får du poeng! Ta turen til premieboden nedenfor for å finne ut hvilke goder du kan få med dem!»",
  "international2024_rewards_title": "Kompendiumbelønninger",
  "international2024_rewards_subtitle": "Kom nærmere og ta en titt på disse premiene",
  "international2024_rewards_intro": "«Stable skrottene høyt og motta belønninger! Å, og FOR NOEN belønninger! Nei, ikke det å ha hendene rundt halsen på noen mens livet sakte ebber ut av en hjelpeløs helts øyne. Det er sin EGEN belønning! Dette er det du får ETTERPÅ!»",
  "international2024_rewards_physical_aegis_title": "Fysisk Aegis-modell",
  "international2024_rewards_physical_aegis_desc": "Fyll det Aegis-formede hullet på hyllen og i hjertet med en kopi av den berømte premien i skalaen 1:5.",
  "international2024_rewards_hud_title": "The International 2024 – Grensesnitt",
  "international2024_rewards_hud_desc": "Pynt grensesnittet i spillet med sirkusånden. Vi har fornyet grensesnittet rundt årets tema for TI.",
  "international2024_rewards_versus_title": "Introskjerm 2024",
  "international2024_rewards_versus_desc": "Piff opp kampånden før spillet starter med en tilpasset introskjerm som viser frem de nye statueplassene til helter.",
  "international2024_rewards_chat_wheels_title": "Permanente samtalehjul",
  "international2024_rewards_stickers_title": "Klistremerker for spillere og lag",
  "international2024_rewards_loading_screens_title": "Lasteskjermer",
  "international2024_rewards_materials_title": "Fantasi- og bingoverktøy",
  "international2024_rewards_teleport_fx_title": "Favorittlagets teleporteffekter",
  "international2024_rewards_effigy_title": "Statueblokk 2024",
  "international2024_supporters_clubs_title": "Støtt samfunnet",
  "international2024_supporters_clubs_subtitle": "Pakker for eksperter og lag",
  "international2024_supporters_clubs_intro": "«Ærede velgjørere! Filantroper i alle aldre! Ærbødige velyndere av drapskunsten! 50 % av den storsinnede gavmildheten går direkte til lagene og ekspertene du liker best! Hvem er den ekte helten her? Meg, selvfølgelig! Og jeg klapper i mine digre heroiske hender for DEG!»",
  "international2024_supporters_clubs_tiers_title": "Supporterklubber",
  "international2024_supporters_clubs_tiers_desc": "Velg bronse, sølv eller gull som støtte for favorittlagene og motta belønninger designet av lagene selv.",
  "international2024_talent_tiers_title": "Ekspertklistremerker",
  "international2024_talent_tiers_desc": "Kjøp belønningspakker med favoritteksperten i hovedrollen. Pakker inneholder en kombinasjon av klistremerker, replikker og autografer avhengig av graden på den kjøpte pakken.",
  "ti13_compendium_small_header": "Støtt turneringen",
  "ti13_compendium_header": "The International 2024-kompendiet",
  "ti13_compendium_desc": "Kompendiet er den interaktive digitale følgesvennen til The International. I kompendiet finner du alt på ett sted – aktiviteter og utfordringer knyttet til begivenheten, og alle belønningene for årets begivenhet. Dessuten bidrar 25 % av alle salg til premiepotten til  The International 2024.",
  "ti13_compendium_bp_btn": "Gå til nettsiden",
  "ti13_compendium_standard": "Standard kompendium",
  "ti13_compendium_standard_subtitle": "Alle funksjoner og aktiviteter",
  "ti13_compendium_upgraded": "Oppgradert kompendium",
  "ti13_compendium_upgraded_subtitle": "Alle funksjoner og aktiviteter samt påskyndte belønninger",
  "ti13_compendium_purchase_tp_fx": "TI 2024 – Teleporteffekt (nivå 1)",
  "ti13_compendium_purchase_boosters_footnote": "Boostere kan låse opp ekstrainnhold etter eget ønske",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Boostere kan låse opp The International 2024-grensesnittet eller ytterligere innhold etter eget ønske",
  "ti13_compendium_purchase_levels": "%1$s kompendiumnivå",
  "ti13_compendium_purchase_booster_levels": "%1$s boostere",
  "ti13_compendium_purchase_discount": "Spar %1$s % på nivå",
  "ti13_compendium_purchase_earn_the_following": "Kompendiumnivå låser opp:",
  "ti13_compendium_contribution": "25 % av alle salg bidrar til premiepotten til The International 2024.",
  "ti13_compendium_purchase_all_access": "Tilgang til alle kompendiumfunksjoner",
  "ti13_compendium_purchase_aegis_emoticon": "Aegis-uttrykksikon",
  "ti13_compendium_purchase_bingo_tokens": "%1$s bingomynter",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s byttemynter til fantasispillet",
  "ti13_compendium_purchase_one_player_sticker": "1 spillerklistremerkekapsel",
  "ti13_compendium_purchase_player_stickers": "%1$s spillerklistremerkekapsler",
  "ti13_compendium_purchase_team_stickers": "%1$s lagklistremerkekapsler",
  "ti13_compendium_purchase_effigy_blocks": "%1$s statueblokker – The International 2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s laglasteskjermskatter",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s TI-lasteskjermskatter",
  "international2024_tournament_learn_more": "Les mer om turneringen",
  "ringmaster_abilities_heading": "Evner",
  "ringmaster_souvenirs_heading": "Suvenirer",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "KANALISERT – Ringmaster kveiler pisken før han smekker til. Piskede fiender skades og løper i frykt fra Ringmaster. Kanaliseringstid øker skaden og forlenger fryktvarigheten eksponentielt, men reduserer radiusen.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster pakker seg selv eller en alliert helt inn i en bevegelig, ekstradimensjonal kasse. Enheter i kassen får fri ferdsel, hemmingsresistens, ekstra magiresistens og ekstra bevegelseshastighet. De er også dempet, stilnet, avvæpnet og kan ikke siktes på. Kassen spretter opp når effekten utløper eller når helten flytter seg utenfor radiusen.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster kaster en av knivene sine til et nøyaktig, valgt punkt. Hvis han treffer en fiende, gjør kniven treffskade, hemmer enheten noe og gjør en prosent av målets maks helse som skade hvert sekund.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster ruller forundringshjulet til valg sted, som slår fiender til side langs veien. Når hjulet er kommet fram, tar fiender i nærheten skade over tid og hemmes. Fiender som er vendt mot hjulet i over 0,5 sekunder, blir trollbundet og trekkes mot det. Den første trollbundne fienden utløser en tidtaker før hjulet eksploderer. Hvis tidtakeren ikke utløses, eksploderer hjulet automatisk etter 8 sekunder.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster retter søkelyset mot et område. Fiender i lyset har en sjanse til å bomme på angrep og avsløres hvis de er usynlige. Trufne illusjoner svinner bort og mister en del av maks helse hvert sekund.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ringmaster får en tilfeldig engangssuvenir når en fiendtlig helt dør i nærheten. Ytterligere suvenirer oppbevares som ladninger. Hvis Ringmaster ikke har en suvenir når han gjenopplives, får han tildelt én. Tilgjengelige suvenirer: Funhouse Mirror, Strongman Tonic og Whoopee Cushion.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Bruk: Proportion Distortion\\n\\nSkaper 1 mangelfull avbildning av helten som varer i 18 sekunder. Illusjonen gjør 28 % og tar 300 % skade.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Bruk: Whoopsie\\n\\nSender helten fremover 400 enheter. Etterlater en stinkende sky med radius på 200 i 3 sekunder, som hemmer fiender med 30 %.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic"
}