// 3654.js

{
  "language": "romanian",
  "ringmastercomic_title_cover": "Marioneta – Copertă",
  "ringmastercomic_title": "Marioneta – Pagina %1$s",
  "ringmastercomic_help_text": "Apasă pe imagine sau tasta spațiu pentru a continua",
  "ringmastercomic_return_button": "Întoarce-te la copertă",
  "ti13_online": "Copenhaga",
  "ti13_main_event_venue": "Royal Arena – Copenhaga",
  "ti13_best_of_three": "Două din trei",
  "ti13_best_of_five": "Trei din cinci",
  "ti13_group_stage_sp_rules": "Faza grupelor – Reguli pentru prioritatea de selecție",
  "ti13_group_stage_sp_game1": "Dat cu banul.",
  "ti13_group_stage_sp_game2": "Primul meci: echipa care câștigă la datul cu banul decide dacă alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_group_stage_sp_game3": "Al doilea meci: echipa care pierde la datul cu banul decide dacă alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_group_stage_sp_game4": "Al treilea meci (dacă e cazul): se dă din nou cu banul, iar echipa care câștigă la datul cu banul decide dacă alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_group_stage_tie_rules": "Faza grupelor – Reguli de departajare în caz de egalitate",
  "ti13_first_second_tie": "Două echipe sunt la egalitate pentru locurile 1 și 2:",
  "ti13_second_third_tie": "Două echipe sunt la egalitate pentru locurile 2 și 3:",
  "ti13_third_fourth_tie": "Două echipe sunt la egalitate pentru locurile 3 și 4:",
  "ti13_three_way_first_tie": "Trei echipe sunt la egalitate pentru locul 1:",
  "ti13_three_way_second_tie": "Trei echipe sunt la egalitate pentru locul 2:",
  "ti13_four_way_tie": "Patru echipe sunt la egalitate pentru locul 1:",
  "ti13_tie_resolve_bo3": "Departajarea are loc în urma unei serii de trei meciuri disputată în formatul „2 din 3”.",
  "ti13_tie_resolve_third_fourth": "Nu se mai joacă niciun alt meci. Cele două echipe vor rămâne la egalitate pentru locurile 3 și 4.",
  "ti13_tie_resolve_first_with_round_robin": "Primul loc va fi decis cu ajutorul unei grupe de departajare în care echipele vor juca fiecare cu fiecare câte un meci până când una dintre ele câștigă de două ori.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Meciurile din grupa de departajare continuă să fie jucate până când toate echipele au jucat cel puțin un meci între ele. Se vor folosi rezultatele ultimelor meciuri pentru a determina locurile 2 și 3.",
  "ti13_tie_resolve_second_with_round_robin": "Al doilea loc va fi decis cu ajutorul unei grupe de departajare în care echipele vor juca fiecare cu fiecare câte un meci până când una dintre ele câștigă de două ori.",
  "ti13_tie_resolve_third_fourth_other": "Nu se mai joacă niciun alt meci. Celelalte două echipe vor rămâne la egalitate pentru locurile 3 și 4.",
  "ti13_tie_resolve_four_way_1": "Echipele vor fi grupate câte două în mod aleatoriu. Pentru a exemplifica aceste reguli, vom denumi aceste echipe: A, B, C și D.",
  "ti13_tie_resolve_four_way_2": "Echipa A joacă un meci împotriva echipei B. Echipa C joacă un meci împotriva echipei D.",
  "ti13_tie_resolve_four_way_3": "Primul loc va fi decis în urma unui singur meci între câștigătoarea dintre A/B și câștigătoarea dintre C/D.",
  "ti13_tie_resolve_four_way_4": "Al patrulea loc va fi decis în urma unui singur meci între pierzătoarea dintre A/B și pierzătoarea dintre C/D.",
  "ti13_tie_resolve_four_way_5": "Locurile 2 și 3 vor fi decise în urma unui meci între toate celelalte echipe rămase.",
  "ti13_seeding_decider_sp_rules": "Meciuri de repartizare – Reguli pentru prioritatea de selecție",
  "ti13_seeding_decider_sp_rules_1": "Primul meci: echipa clasată pe o poziție superioară în faza grupelor va alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_seeding_decider_sp_rules_2": "Al doilea meci: echipa clasată pe o poziție inferioară în faza grupelor va alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_seeding_decider_sp_rules_3": "Al treilea meci (dacă e cazul): echipa clasată pe o poziție superioară în faza grupelor va alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_playoffs_and_ti_sp_rules": "Faza eliminatorie și The International – Reguli pentru prioritatea de selecție",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Dat cu banul.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Primul meci: echipa care câștigă la datul cu banul decide dacă alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Al doilea meci: echipa care pierde la datul cu banul decide dacă alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Al treilea meci (dacă e cazul): se dă din nou cu banul, iar echipa care câștigă la datul cu banul decide dacă alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Primul meci: câștigătoarea din grupa superioară decide dacă alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Al doilea meci: câștigătoarea din grupa inferioară decide dacă alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Al treilea meci: câștigătoarea din grupa superioară decide dacă alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Al patrulea meci (dacă e cazul): câștigătoarea din grupa inferioară decide dacă alege primul erou sau jumătatea de hartă pe care va juca.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Al cincilea meci (dacă e cazul): se dă cu banul, iar echipa care câștigă decide dacă alege primul erou sau jumătatea de hartă pe care va juca.",
  "international2024_update_title": "TI 2024, Ringmaster și compendiul",
  "ringmaster_hype": "„Eroi și eroine, de orice tip și din orice specie, victime de toate vârstele! Momentul pe care l-ați tot așteptat a sosit în sfârșit.\\n\\n Timp de aproape un an, am existat doar cu numele, rostit doar în șoapte, o umbră în spatele cortinei stacojii. Dar acum, în sfârșit (care a venit prea târziu, dacă mă întrebi), imbecilii responsabili de acest turneu și-au revenit în simțiri și m-au lăsat să vă binecuvântez cu măreția mea și să-mi ocup locul umil în lumina reflectoarelor! Sunt chiar eu, Cogliostro Kettle, maestrul mârșav! Prezentatorul sumbru al celor damnați! Singurul și unicul RINGMASTER! Și am câțiva ași în mânecă!”",
  "ringmaster_comic": "„Dar să nu credeți tot ce spun! De ce nu citiți mai bine o bandă desenată cu povestea tragică a originii mele, așa cum e relatată de un narator anonim și demn de încredere?”",
  "ringmaster_comic_title": "Marioneta",
  "ringmaster_comic_desc": "Citește despre începuturile lui Ringmaster, când lucra cu circul mecanizat al lui Kettle.",
  "ringmaster_guide": "„Mi s-a cerut să fiu ghid pentru compendiul de anul acesta, o ofertă pe care am acceptat-o cu drag. Până la urmă, ar trebui să ne facem timp să ne cunoaștem mai bine! [b]Deci, ce-ar fi să începem?[/b]”",
  "ringmaster_introducing": "Vi-l prezentăm pe",
  "ringmaster_hero_detail_button": "Vezi pagina cu detaliile eroului",
  "ringmaster_play_trailer_button": "Redă trailerul",
  "ringmaster_comic_button": "Citește banda desenată",
  "international2024_compendium": "Compendiu",
  "international2024_compendium_title": "Compendiu – The International 2024",
  "international2024_effigies_title": "EFIGII INDIVIDUALE",
  "international2024_effigies_subtitle": "Caracteristică îmbunătățită și disponibilă gratuit",
  "international2024_effigies_intro": "„A fost o dată, prieteni, nu cu mult timp în urmă, o perioadă când aceste efigii mărețe erau chiar o raritate! Dar nu mai e cazul! Acum un monument îl așteaptă pe fiecare titan care va păși pe câmpul de luptă, indiferent că e vorba despre Ringmaster sau toți ceilalți eroi mai nesemnificativi!”",
  "international2024_effigies_desc": "Efigiile sunt statui personalizabile ale eroilor tăi preferați care pot fi etalate în baza ta. În loc să folosească un singur slot global partajat, fiecare erou are acum propriul slot pentru efigie în echipamentul din arsenal.\\n\\nPoți folosi noua efigie implicită pentru fiecare erou sau să-ți creezi propria variantă.",
  "international2024_purchase_intro": "„Zeități și monștri, creepi și necreepi, veniți cu mic cu mare să vedeți [b]cea mai încântătoare colecție de jocuri, evenimente și recompense din lumea sporturilor electronice[/b] de pe această parte a râului! Testați-vă mintea, norocul și limitele în această sărbătoare a celui mare eveniment de sporturi electronice din acest tărâm și oricare altul!”",
  "international2024_activities": "IATĂ CE PRIMEȘTI",
  "international2024_activities_subtitle": "Jocuri de noroc, probe de îndemânare și delicii pentru toate vârstele",
  "international2024_activities_intro": "„Spre deosebire de maestrul vostru de ceremonii întreg la cap, mi s-a spus că unii dintre voi au nevoie de un MOTIV pentru a ucide. Așa că fiecare meci jucat îți va oferi puncte, prietene! Cu cât joci mai mult, cu atât câștigi mai mult, așa că aventurează-te în culoare și vezi cum se adună punctele!”",
  "international2024_activities_play_title": "Joci Dota, primești puncte",
  "international2024_activities_play_desc": "Anul acesta vei primi puncte pentru aproape fiecare meci pe care-l joci prin intermediul provocării săptămânale. Vei primi puncte bonus și pentru prima victorie a zilei.",
  "international2024_activities_fantasy_title": "Fantasy",
  "international2024_activities_fantasy_desc": "Concurează împotriva prietenilor și jucătorilor de Dota din întreaga lume. Făurește-ți cea mai bună formație Fantasy cu jucătorii tăi preferați și creează cartonașe personalizate cu statistici care măresc numărul de puncte obținute.",
  "international2024_activities_oracles_title": "Provocarea lui Oracle",
  "international2024_activities_oracles_desc": "Realizează pronosticuri cu echipele care vor avansa și cele care vor fi eliminate, iar apoi etalează-ți aptitudinile de oracol (doar dacă ai avut dreptate).",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Primești bilete de Bingo generate în mod aleatoriu pentru fiecare fază a turneului. Biletele vor fi pline de condiții ciudate și situații interesante.",
  "international2024_activities_outro": "„Ține minte! Câștigul nu este doar o recompensă în sine! De fiecare dată când izbutești în cadrul oricăreia dintre aceste activități, veți primi puncte! Vizitează toneta cu recompense pentru a vedea ce bunătăți poți cumpăra cu ele!”",
  "international2024_rewards_title": "Recompensele compendiului",
  "international2024_rewards_subtitle": "Veniți cu mic cu mare pentru a descoperi premiile",
  "international2024_rewards_intro": "„Adună cât mai multe cadavre și revendică premiile! Aaah și CE mai premii te așteaptă! Nu, nu premiul strângerii unui gât cu propriile mâini, în timp ce vezi cum se stinge lumina din ochii unui erou neajutorat. Aia e PROPRIA-I recompensă! ASTA e ce cauți!”",
  "international2024_rewards_physical_aegis_title": "Modelul fizic al trofeului Aegis",
  "international2024_rewards_physical_aegis_desc": "Umple spațiul gol sub formă de Aegis de pe raftul tău (și pe cel din inima ta, de altfel) cu o replică la o scară de 1:5, confecționată din aliaj de nichel, a trofeului campionilor.",
  "international2024_rewards_hud_title": "Interfața de joc The International 2024",
  "international2024_rewards_hud_desc": "Înfrumusețează-ți interfața din joc cu spiritul circului. Am reconceput interfața folosind tematica din acest an a campionatului TI.",
  "international2024_rewards_versus_title": "Ecran versus 2024",
  "international2024_rewards_versus_desc": "Revigorează-ți spiritul de luptă de dinaintea meciurilor cu un ecran versus personalizat care evidențiază noile sloturi de efigii pentru eroi.",
  "international2024_rewards_chat_wheels_title": "Replici permanente pentru rotița de chat",
  "international2024_rewards_stickers_title": "Abțibilduri cu jucători și echipe",
  "international2024_rewards_loading_screens_title": "Ecrane de încărcare",
  "international2024_rewards_materials_title": "Beneficii pentru Fantasy și Bingo",
  "international2024_rewards_teleport_fx_title": "Efecte de teleportare cu echipa favorită",
  "international2024_rewards_effigy_title": "Bloc pentru efigie 2024",
  "international2024_supporters_clubs_title": "Sprijină comunitatea",
  "international2024_supporters_clubs_subtitle": "Pachete de echipă și de realizator",
  "international2024_supporters_clubs_intro": "„Stimați binefăcători! Filantropi de toate vârstele! Admiratori umili ai omorurilor și artelor adiacente omorurilor! 50% din prețioasele voastre plăți vor fi direcționate către echipele și realizatorii voștri preferați! Cine-i adevăratul erou? Eu, evident! Bat din palmele mele eroice pentru VOI!”",
  "international2024_supporters_clubs_tiers_title": "Fan cluburile echipelor",
  "international2024_supporters_clubs_tiers_desc": "Alege din pachetele de bronz, argint sau aur ale echipelor tale preferate pentru a obține recompense realizate chiar de către echipe.",
  "international2024_talent_tiers_title": "Pachete cu abțibilduri cu realizatori",
  "international2024_talent_tiers_desc": "Achiziționează pachetele cu recompense ale realizatorilor tăi preferați. Pachetele includ abțibilduri, replici și autografe în funcție de categoria pachetului achiziționat.",
  "ti13_compendium_small_header": "Sprijină campionatul",
  "ti13_compendium_header": "Compendiu – The International 2024",
  "ti13_compendium_desc": "Compendiul este companionul tău digital interactiv pentru The International 2023. Reprezintă locul în care găsești toate activitățile, provocările și recompensele cu tematica evenimentului din acest an. De asemenea, 25% din veniturile realizate vor contribui la fondul de premiere al campionatului The International 2024.",
  "ti13_compendium_bp_btn": "Accesează site-ul web",
  "ti13_compendium_standard": "Compendiu standard",
  "ti13_compendium_standard_subtitle": "Toate caracteristicile și activitățile",
  "ti13_compendium_upgraded": "Compendiu îmbunătățit",
  "ti13_compendium_upgraded_subtitle": "Toate caracteristicile și activitățile plus acces mai rapid la recompense",
  "ti13_compendium_purchase_tp_fx": "Nivelul 1 – Efect de teleportare TI 2024",
  "ti13_compendium_purchase_boosters_footnote": "Stimulentele te pot ajuta să deblochezi conținutul suplimentar pe care-l dorești.",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Stimulentele te pot ajuta să deblochezi interfața de joc The International 2024 sau conținutul suplimentar pe care-l dorești.",
  "ti13_compendium_purchase_levels": "%1$s niveluri de compendiu",
  "ti13_compendium_purchase_booster_levels": "%1$s stimulente",
  "ti13_compendium_purchase_discount": "Economisește %1$s la niveluri",
  "ti13_compendium_purchase_earn_the_following": "Nivelurile de compendiu vor debloca:",
  "ti13_compendium_contribution": "25% din veniturile obținute în urma vânzărilor vor merge către fondul de premiere al campionatului The International 2024.",
  "ti13_compendium_purchase_all_access": "Acces la toate caracteristicile compendiului",
  "ti13_compendium_purchase_aegis_emoticon": "Emoticon cu Aegis",
  "ti13_compendium_purchase_bingo_tokens": "%1$s jetoane de bingo",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s jetoane modificatoare pentru Fantasy",
  "ti13_compendium_purchase_one_player_sticker": "O capsulă cu abțibild de jucător",
  "ti13_compendium_purchase_player_stickers": "%1$s capsule cu abțibild de jucător",
  "ti13_compendium_purchase_team_stickers": "%1$s capsule cu abțibild de echipă",
  "ti13_compendium_purchase_effigy_blocks": "%1$s blocuri pentru efigie TI 2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s comori cu ecran de încărcare de echipă",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s comori cu ecran de încărcare TI",
  "international2024_tournament_learn_more": "Află mai multe despre campionat",
  "ringmaster_abilities_heading": "Abilități",
  "ringmaster_souvenirs_heading": "Suveniruri",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "CONCENTRARE - Ringmaster își învârte biciul înainte de a biciui o zonă. Inamicii biciuiți încasează daune și fug de frică de Ringmaster. Durata de concentrare mărește exponențial daunele și durata fricii, dar reduce raza abilității.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster împachetează un erou aliat sau pe el însuși într-o cutie mobilă extradimensională. Unitățile din cutie pot trece prin alte unități și obțin rezistență la încetiniri, rezistență la magie bonus și viteză de mișcare bonus. Unitățile nu pot fi țintite, dar sunt amuțite, perturbate și dezarmate. Cutia se va deschide după expirarea efectului sau după ce eroul părăsește zona de efect.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster aruncă unul dintre pumnalele sale către un punct precis ales de acesta. Dacă lovește un inamic, pumnalul cauzează daune de impact, încetinește unitatea lovită pentru scurt timp și îi cauzează daune egale cu un procent din maximul ei de viață în fiecare secundă.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster trimite roata hipnotizantă către locația țintită, împingând inamicii din calea sa. După ce ajunge la locație, inamicii din zona de efect a roții încasează daune de-a lungul timpului și sunt încetiniți. Eroii inamici care se uită la roată mai mult de 0,5 secunde sunt hipnotizați și atrași de aceasta. Primul inamic hipnotizat va declanșa un temporizator pentru detonarea roții. Dacă temporizatorul nu este declanșat, roata va exploda automat după 8 secunde.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster aprinde un reflector care trece peste o zonă. Inamicii iluminați au o șansă de a rata atacurile și sunt dezvăluiți dacă sunt invizibili. Iluziile surprinse de lumină dispar treptat, pierzând un procent din maximul lor de viață în fiecare secundă.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ringmaster primește un suvenir aleatoriu de unică folosință ori de câte ori un erou inamic moare în apropiere. Orice suvenir suplimentar este păstrat sub formă de încărcătură. Dacă Ringmaster nu are un suvenir atunci când reînvie, acesta va primi unul. Suvenirurile posibile: Funhouse Mirror, Strongman Tonic și Whoopee Cushion.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Utilizare: Proportion Distortion\\n\\nCreează o imagine perfectă a eroului tău care persistă timp de 18 secunde. Iluzia ta cauzează 28% daune și încasează 300% daune.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Utilizare: Whoopsie\\n\\nLansează eroul 400 de unități în față. Lasă în urmă un nor puturos cu o rază de 200 de unități și o durată de 3 secunde, care încetinește inamicii 30%.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic",
  "ringmaster_ability_strongman_tonic_Description": "Utilizare: Forcefully Imbibe\\n\\nMărește temporar forța unui erou aliat cu 5 plus 1,5 per nivelul lui Ringmaster timp de 8 secunde. Efectul se menține timp de 4 secunde, după care se diminuează de-a lungul duratei."
}