// 1002.js

{
  "language": "brazilian",
  "international2023_compendium_activity": "Atividade para portadores do compêndio",
  "international2023_update_title": "Comemoração do International 2023",
  "international2023_update_subtitle": "De fanáticos pelo cenário profissional a jogadores casuais, esta atualização tem algo para todos.",
  "international2023_update_body": "Seja você alguém que acompanha cada segundo eletrizante de cada partida do International, ou alguém que mal sabe que tem gente que se sustenta jogando este jogo e só deseja curti-lo em paz, continue lendo: esta atualização tem algo para você.\\n\\nVocê é fã de eSports? Crie a sua escalação de profissionais com o <b>Dota dos Sonhos</b> aprimorado. Curte mais fazer análises? Dê os seus palpites no <b>Desafio do Oráculo</b>. Talvez sinta nostalgia pelos jogos que jogava com a sua tia-avó. Para a sua sorte, temos até mesmo um <b>Bingo</b> neste ano!\\n\\nMas talvez não seja fã dessas coisas, e só se importe com você. Também pensamos nisso: <b>o destaque do perfil</b>. Agora, o seu perfil é um monumento interativo em sua homenagem, destacando itens e conquistas do seu histórico no Dota que deseje apresentar.",
  "international2023_update_footer": "Você chegou ao final da atualização. Bom trabalho!",
  "international2023_compendium": "Compêndio",
  "international2023_compendium_title": "Compêndio do International 2023",
  "international2023_compendium_intro": "O compêndio é o seu companheiro digital interativo para O Caminho para o International 2023 e o próprio International 2023.\\n\\nJogue como um profissional no Desafio do Caminho para o TI. Escolha os seus jogadores favoritos no Dota dos Sonhos reformulado. Teste a sua vidência nos palpites da fase de grupos e chaves. Tire a sorte grande com as inéditas cartelas de Bingo.\\n\\nPense no compêndio como a sua central de atividades, desafios e todas as recompensas relacionadas ao evento deste ano. Além disso, 25% de todas as vendas serão destinadas à premiação total do International 2023.",
  "international2023_showcase_title": "Destaque do perfil",
  "international2023_showcase_subtitle": "Novo recurso para todos os jogadores de Dota",
  "international2023_showcase_intro": "O perfil e o miniperfil foram completamente redesenhados para todos (ou melhor, os 98% dos jogadores com uma nota de comunicação acima de 6.000). Agora, você pode mostrar todos os seus itens e conquistas do Dota — literalmente qualquer coisa do seu arsenal — com o novo destaque do perfil.\\n\\nQuer montar um altar para a sua equipe profissional favorita de 2016? Vá em frente. Que tal uma coleção dos seus conjuntos favoritos? Vá em frente! Um par de cada tipo de sapato disponível para Kunkka? Infelizmente, vá em frente...",
  "international2023_showcase_profile_title": "Perfil atualizado",
  "international2023_showcase_profile_desc": "Você é Tarsila do Amaral, o seu perfil é a sua tela e o limite é a sua imaginação (e o bom senso).",
  "international2023_showcase_mini_profile_title": "Miniperfil atualizado",
  "international2023_showcase_mini_profile_desc": "Os miniperfis são como os perfis, mas com uma grande diferença: são menores. Os outros jogadores verão o seu miniperfil sempre que passarem o mouse sobre o seu nome.",
  "international2023_showcase_carousel_title": "Exemplos de destaques",
  "international2023_showcase_items_title": "Destaque itens",
  "international2023_showcase_items_desc": "Personalize os seus destaques com uma grande variedade de todos os itens e recompensas que você tem colecionado ao longo dos anos.",
  "international2023_showcase_item_heroes_title": "Heróis",
  "international2023_showcase_item_trophies_title": "Troféus",
  "international2023_showcase_item_stickers_title": "Adesivos",
  "international2023_showcase_item_stats_title": "Estatísticas",
  "international2023_showcase_item_chat_wheels_title": "Mensagens sonoras",
  "international2023_showcase_item_sprays_title": "Pinturas",
  "international2023_showcase_item_items_title": "Itens do arsenal",
  "international2023_showcase_item_emoticons_title": "Emoticons",
  "international2023_showcase_item_loading_screens_title": "Telas de carregamento",
  "international2023_showcase_item_couriers_title": "Entregadores",
  "international2023_showcase_item_wards_title": "Sentinelas",
  "international2023_tournament_prize_pool": "Premiação total",
  "international2023_tournament_prize_pool_percent": "25% de todas as vendas será destinado à premiação total do International 2023.",
  "international2023_tournament_learn_more": "Saiba mais sobre o torneio",
  "international2023_quests_title": "Desafio do Caminho para o International",
  "international2023_quests_intro": "Você assistiu aos profissionais. Torceu por eles. Agora, jogue como um. Sente-se na cadeira gamer dos seus jogadores favoritos e recrie os maiores momentos deles no último ano. Vença com o mesmo herói de uma partida específica ou como um entre cinco heróis que ele usou em um dos meses da temporada. Ganhe pontos para cada desafio, além de pontos adicionais ao cumprir meses inteiros.",
  "international2023_quests_match_title": "Desafios de partida",
  "international2023_quests_match_desc": "Vença com um herói de uma partida profissional passada.",
  "international2023_quests_pro_title": "Desafios de jogador",
  "international2023_quests_pro_desc": "Vença com um dos heróis mais usados por um profissional.",
  "international2023_quests_rewards_title": "Ganhe recompensas",
  "international2023_quests_rewards_desc": "Potencialize as suas recompensas com os pontos do compêndio obtidos pelo caminho.",
  "international2023_fantasy_title": "Um novo Dota dos Sonhos",
  "international2023_fantasy_intro": "Monte uma equipe com os seus jogadores profissionais favoritos. Molde a escalação com os atributos que acredita serem mais valiosos. Compita com jogadores do mundo todo para marcar mais pontos. É o Dota dos Sonhos que você lembra, mas completamente reformulado.",
  "international2023_fantasy_players_title": "Escolha",
  "international2023_fantasy_players_desc": "Escolha o seu jogador principal, da trilha do meio e suporte favoritos.",
  "international2023_fantasy_craft_title": "Molde",
  "international2023_fantasy_craft_desc": "Use as fichas de renovação obtidas entre as recompensas do compêndio para tentar ficar com os melhores atributos — o que varia dependendo do seu jogador escolhido.",
  "international2023_fantasy_compete_title": "Compita",
  "international2023_fantasy_compete_desc": "Cada fim de semana do torneio é uma rodada separada, então você terá várias chances de competir contra os seus amigos e o resto da comunidade. Ganhe pontos do compêndio e, se ficar entre os maiores pontuadores, um troféu exclusivo.",
  "international2023_bingo_title": "Bingo!",
  "international2023_bingo_intro": "Você sente um negócio sempre que uma equipe profissional compra uma Rapieira Divina? Ou quando uma partida passa dos 80 minutos e tudo começa a perder sentido? E quando uma equipe de heróis somando 16 pernas enfrenta outra com apenas 4?\\n\\nBom, chegou a hora dessa emoção valer algo. O Bingo está aqui para você sair ganhando sempre que certos eventos malucos ocorrerem.",
  "international2023_bingo_cards_title": "UMA CARTELA POR FIM DE SEMANA",
  "international2023_bingo_cards_desc": "Todos os portadores do compêndio receberão uma nova cartela de bingo gerada aleatoriamente para cada fim de semana do torneio. Cada quadrado contém uma condição inusitada (ou situação interessante) para você torcer que aconteça enquanto os profissionais competem.",
  "international2023_bingo_rewards_title": "Complete linhas e ganhe pontos",
  "international2023_bingo_rewards_desc": "É isso mesmo: não se deixe enganar pelos deuses, demônios e criaturas silvestres atiradoras, isso não é nada mais que bingo. Ao completar uma linha, coluna ou diagonal na sua cartela, você receberá pontos do compêndio como recompensa. Aviso: gritar \"BINGO!\" é opcional, mas incentivado.",
  "international2023_predictions_title": "Desafio do Oráculo",
  "international2023_predictions_intro": "O Oráculo usa magias astrais umbilicais para ver o futuro. Bom, não queremos estragar tudo, mas magias umbilicais não existem de verdade — então você precisará usar a sua astúcia, o seu conhecimento de eSports e, além de tudo, os seus melhores chutes para sair ganhando.\\n\\nPreveja (assim como o Oráculo, mas sem a parte do umbigo) quais equipes avançarão e quais serão eliminadas em cada final de semana do torneio. Palpites corretos — queremos dizer, adivinhações oraculares — valem pontos do compêndio.",
  "international2023_predictions_group_stage_title": "Dê palpites para a fase de grupos",
  "international2023_predictions_group_stage_desc": "Pela primeira vez, você pode tentar prever a ordem das equipes em cada grupo.",
  "international2023_predictions_ingame_title": "Palpites no jogo",
  "international2023_predictions_ingame_desc": "Ao assistir no jogo ou na Twitch, teste a sua vidência antes que o berrante da partida seja tocado. Você ganhará pontos do compêndio para cada palpite correto, até um máximo de seis por dia.",
  "international2023_rewards_title": "Recompensas do compêndio",
  "international2023_rewards_intro": "Se você é fã do Dota competitivo e de receber recompensas por ser fã do Dota competitivo, as recompensas deste ano são para você. O compêndio de 2023 é focado exclusivamente no International 2023 e no cenário profissional de Dota.",
  "international2023_rewards_physical_aegis_title": "Modelo físico da Égide",
  "international2023_rewards_physical_aegis_desc": "Uma réplica em escala 1:5 feita de liga de níquel do famoso troféu dos campeões. Exiba-a com orgulho! Exiba-a sem compromisso! Derreta-a e crie a sua própria moeda!",
  "international2023_rewards_chat_wheels_title": "Mensagens sonoras permanentes",
  "international2023_rewards_chat_wheels_desc": "Diferentemente de anos anteriores, todas as mensagens sonoras deste ano são permanentes. Como bem falamos no título. Sim, este texto é um pouco redundante. Mas é bom passar um pouco mais de tempo com você.",
  "international2023_rewards_stickers_title": "Adesivos de jogadores e equipes",
  "international2023_rewards_stickers_desc": "\"Ué, adesivos só de jogadores?\" Você nem terminou de ler o título, né? Você também receberá adesivos de equipes. Honestamente, esses parágrafos são como plástico-bolha, protegendo o título na entrega até o seu cérebro.",
  "international2023_rewards_hud_title": "Interface do International 2023",
  "international2023_rewards_hud_desc": "O último parágrafo pode ter assustado algumas pessoas, que já nem lerão mais este. Então, se ficou por aqui: muito inteligente. Isso foi um teste, e você tirou nota dez. Porque temos informações que não estavam no título: a interface segue o tema de vitrais deste ano.",
  "international2023_rewards_loading_screens_title": "Telas de carregamento",
  "international2023_rewards_loading_screens_desc": "Você receberá uma tela de carregamento com tema de vitrais para cada equipe, bem como algumas das principais artes do TI deste ano.",
  "international2023_rewards_materials_title": "Poderes do Dota dos Sonhos e Desafio do Caminho para o TI",
  "international2023_rewards_materials_desc": "Use ferramentas personalizadas para moldar os seus jogadores no Dota dos Sonhos, ou facilite a sua vida no Desafio do Caminho para o TI.",
  "international2023_rewards_teleport_fx_title": "Efeitos de teletransporte da equipe favorita",
  "international2023_rewards_teleport_fx_desc": "Mostre para quem você torce enquanto joga, usando efeitos de teletransporte personalizados com três níveis diferentes.",
  "international2023_rewards_Types_title": "Tipos de recompensas",
  "international2023_rewards_Types_desc": "Cada tipo de recompensa tem o seu próprio medidor de progressão. Ao completar o medidor de uma recompensa, você poderá resgatá-la. Alguns medidores podem ser completados quantas vezes quiser, enquanto outros têm um limite.",
  "international2023_rewards_Levels_title": "Níveis do compêndio",
  "international2023_rewards_Levels_desc": "Ganhe níveis do compêndio ao participar de atividades do compêndio ou comprar pacotes de níveis. Aplique níveis para preencher os medidores de progressão de TODOS os tipos de recompensas.",
  "international2023_rewards_Boosters_title": "Impulsionadores",
  "international2023_rewards_Boosters_desc": "Impulsionadores são como níveis do compêndio, mas para aumentar o progresso de uma recompensa específica. Aplicar um impulsionador também avança a progressão da Égide de Colecionador.",
  "international2023_supporters_clubs_title": "Clubes do Suporte-Torcedor",
  "international2023_supporters_clubs_subtitle": "Apoie diretamente as suas equipes favoritas",
  "international2023_supporters_clubs_intro": "As recompensas do Clube do Suporte-Torcedor são como as alegrias da juventude: aproveite-as enquanto há tempo, porque elas são passageiras. Ou pelo menos eram. A partir de agora, elas são permanentes! Então você pode aproveitá-las para sempre... a menos que você desapareça! Como a juventude!\\n\\n E ainda melhor: 50% das vendas vão diretamente para a equipe. Bom... ainda melhor para elas. A primeira parte é melhor para você.",
  "international2023_supporters_clubs_tiers_title": "Três níveis de apoio",
  "international2023_supporters_clubs_tiers_desc": "Escolha fazer parte do Clube Bronze, Prata ou Ouro das suas equipes favoritas para ganhar recompensas criadas por elas.",
  "international2023_talent_title": "Adesivos de personalidades",
  "international2023_talent_subtitle": "Apoie diretamente as suas personalidades favoritas",
  "international2023_talent_intro": "A transmissão de eSports ao vivo é uma tarefa difícil. Não como minerar carvão, é claro. Mas provavelmente é mais difícil do que ler os detalhes de uma atualização. Bem, nem sempre — às vezes uma atualização desbrava Novas Fronteiras de listões.\\n\\n Agora você pode enviar uma mensagem para a sua personalidade favorita dizendo: \"Ei… eu respeito o que você faz. Não tanto quanto um minerador, mas mais do que aqueles que não leem mais do que 50% de uma atualização.\" Falando em 50%, metade de toda a receita proveniente da venda dos adesivos de cada personalidade vai direto para ela.",
  "international2023_talent_tiers_title": "Escolha o seu nível",
  "international2023_talent_tiers_desc": "Compre pacotes de recompensas das suas personalidades favoritas. Os pacotes podem incluir adesivos, mensagens sonoras e autógrafos dependendo do nível comprado.",
  "international2023_talent_coming_soon": "Os pacotes de personalidades poderão ser comprados após o anúncio das personalidades.",
  "international2023_coming_soon": "Em breve",
  "ti12_bp_countdown_header": "Até a fase de grupos",
  "ti12_bp_countdown_desc": "Sintonize no maior torneio de eSports do ano — ao vivo direto de Seattle, com a Égide dos Campeões em jogo.",
  "ti12_bp_tournament_complete_desc": "Reviva a emoção do maior torneio de eSports do ano — toda a ação de Seattle a um clique de distância.",
  "ti12_group_stage_venue": "On-line",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Apoie o torneio",
  "ti12_compendium_header": "Compêndio do International 2023",
  "ti12_compendium_desc": "Destrave ainda mais da temporada do torneio com o compêndio do International 2023. Jogue como um profissional no Desafio do Caminho para o TI. Monte uma escalação com os seus profissionais favoritos no Dota dos Sonhos reformulado. Teste a sua vidência no Desafio do Oráculo. E torça para que as equipes façam coisas estranhas no inédito Bingo.\\n\\nGanhe recompensas como adesivos de jogadores e equipes, mensagens sonoras, uma interface personalizada e mais, até uma réplica física da Égide.\\n\\n25% de todas as vendas do compêndio serão destinadas à premiação total do International.",
  "ti12_compendium_standard": "Compêndio básico",
  "ti12_compendium_upgraded": "Compêndio aprimorado"
}