// 9333.js

{
  "language": "romanian",
  "international2023_compendium_activity": "Activității pentru posesorii de compendiu",
  "international2023_update_title": "Sărbătorirea campionatului The International 2023",
  "international2023_update_subtitle": "Indiferent că este vorba despre fanatici ai scenei profesioniste sau de jucători obișnuiți, această actualizare e-sports este menită pentru toată lumea.",
  "international2023_update_body": "Indiferent dacă trăiești la intensitate maximă fiecare meci de la The International sau nici măcar nu ai idee că există oameni care-și câștigă existența jucând acest joc și vrei să urmărești acest eveniment în liniște, continuă să citești: această actualizare are ceva pregătit pentru tine.\\n\\nEști un fan înrăit e-sports? Creează-ți propria formație de profesioniști în versiunea îmbunătățită a <b>Ligii Fantasy</b>. Ești mai degrabă o persoană care preferă să analizeze statisticile? Atunci realizează pronosticuri pentru <b>provocarea lui Oracle</b>. Sau poate ești un mare fan al jocurilor preferate de sora bunicii tale. Ei bine, anul acesta avem și <b>bingo</b>!\\n\\nDar poate nu te atrage nimic din lucrurile menționate anterior. Poate că ești impresionat doar de ceea ce realizezi tu însuți. Ei bine, avem ceva și pentru tine: <b>afișierul profilului</b>. Profilul tău este acum un monument interactiv dedicat ție, iar acesta prezintă toate obiectele și realizările tale din istoricul tău de joc pe care dorești să le evidențiezi.",
  "international2023_update_footer": "Ai reușit să citești toate informațiile despre actualizare. Felicitări!",
  "international2023_compendium": "Compendiu",
  "international2023_compendium_title": "Compendiu - The International 2023",
  "international2023_compendium_intro": "Compendiul este companionul tău digital interactiv în „Drumul spre The International 2023” și evenimentul principal The International 2023.\\n\\nJoacă precum un profesionist în cadrul provocării „Drumul spre TI”. Alege-ți jucătorii preferați în noua versiune reconcepută a provocării Fantasy. Testează-ți aptitudinile de ghicitor pentru toate etapele evenimentului. Dă lovitura și câștigă marele premiu cu noile bilete de bingo.\\n\\nPoți vedea compendiul ca fiind locul în care găsești toate activitățile legate de evenimente, provocări și recompense cu tematica evenimentului din acest an. De asemenea, 25% din veniturile din vânzări vor contribui la fondul de premiere al campionatului The International 2023.",
  "international2023_showcase_title": "Afișierul profilului",
  "international2023_showcase_subtitle": "Caracteristică nouă pentru toți jucătorii de Dota",
  "international2023_showcase_intro": "Profilul și miniprofilul au fost complet reconcepute pentru toată lumea (în fine, cei 98% dintre voi care au un scor de comunicare mai mare de 6.000). Acum îți poți prezenta toate obiectele (efectiv orice din inventarul tău Dota) și realizările din Dota cu ajutorul noului afișier pentru profil.\\n\\nVrei să ai un altar cu echipa ta profesionistă preferată din 2016? Ei bine, ce mai aștepți? Sau ce zici de o colecție cu seturile de obiecte ale eroului tău preferat? Și acest lucru este posibil. Vrei o colecție cu toate perechile de încălțăminte ale lui Kunkka? Din păcate, da, poți realiza și acest lucru.",
  "international2023_showcase_profile_title": "Profil actualizat",
  "international2023_showcase_profile_desc": "Ești Michelangelo, profilul tău este acum pânza ta, iar nimic altceva nu te limitează, cu excepția imaginației tale (și a unei doze minime de bun simț).",
  "international2023_showcase_mini_profile_title": "Miniprofil actualizat",
  "international2023_showcase_mini_profile_desc": "Miniprofilurile sunt foarte asemănătoare cu profilurile, cu excepția unei singure diferențe care te va surprinde: acestea sunt mai mici. Alți jucători vor avea ocazia să-ți vadă miniprofilul atunci când amplasează cursorul mouse-ului peste numele tău.",
  "international2023_showcase_carousel_title": "Exemple de afișiere",
  "international2023_showcase_items_title": "Conținutul afișierelor",
  "international2023_showcase_items_desc": "Personalizează-ți afișierele cu o gamă variată de obiecte și recompense pe care le-ai strâns de-a lungul anilor.",
  "international2023_showcase_item_heroes_title": "Eroi",
  "international2023_showcase_item_trophies_title": "Trofee",
  "international2023_showcase_item_stickers_title": "Abțibilduri",
  "international2023_showcase_item_stats_title": "Statistici",
  "international2023_showcase_item_chat_wheels_title": "Replici pentru rotița de chat",
  "international2023_showcase_item_sprays_title": "Graffitiuri",
  "international2023_showcase_item_items_title": "Obiecte din arsenal",
  "international2023_showcase_item_emoticons_title": "Emoticoane",
  "international2023_showcase_item_loading_screens_title": "Ecrane de încărcare",
  "international2023_showcase_item_couriers_title": "Curieri",
  "international2023_showcase_item_wards_title": "Warduri",
  "international2023_tournament_prize_pool": "Fondul de premiere",
  "international2023_tournament_prize_pool_percent": "25% din veniturile obținute în urma vânzărilor de compendiu pentru The International 2023 vor merge către fondul de premiere al campionatului The International 2023.",
  "international2023_tournament_learn_more": "Află mai multe despre campionat",
  "international2023_quests_title": "Drumul spre The International - Provocarea",
  "international2023_quests_intro": "I-ai urmărit pe profesioniști. I-ai susținut. Acum a venit momentul să preiei rolul acestora. Instalează-te în scaunele jucătorilor profesioniști preferați și recreează-le cele mai importante momente din ultimul an. Câștigă cu aceiași eroi cu care aceștia au jucat într-un anumit meci sau cu unul dintre cei cinci eroi pe care aceștia i-au folosit de-a lungul unei anumite luni în timpul sezonului. Obține puncte pentru fiecare provocare pe care o finalizezi și puncte bonus pentru finalizarea seturilor de provocări.",
  "international2023_quests_match_title": "Provocările meciurilor",
  "international2023_quests_match_desc": "Câștigă cu eroi care au fost aleși într-un meci profesionist.",
  "international2023_quests_pro_title": "Provocările jucătorilor",
  "international2023_quests_pro_desc": "Câștigă cu unul dintre cei mai aleși eroi ai unui jucător profesionist.",
  "international2023_quests_rewards_title": "Câștigă recompense",
  "international2023_quests_rewards_desc": "Câștigă recompense cu ajutorul punctelor pentru compendiu pe care le obții pe parcurs.",
  "international2023_fantasy_title": "Provocarea Fantasy a evoluat",
  "international2023_fantasy_intro": "Compune o echipă cu jucătorii tăi profesioniști preferați. Alege statisticile care crezi că vor fi cele mai utile. Concurează cu jucători din întreaga lume pentru a câștiga cele mai multe puncte. Este aceeași ligă Fantasy cu care te-ai obișnuit, doar că aceasta a fost reconcepută din toate punctele de vedere.",
  "international2023_fantasy_players_title": "Alege",
  "international2023_fantasy_players_desc": "Alege-ți jucătorii favoriți pentru următoarele roluri: core, mid și support.",
  "international2023_fantasy_craft_title": "Personalizează",
  "international2023_fantasy_craft_desc": "Folosește jetoanele modificatoare din rândul recompenselor oferite de compendiu pentru a încerca să obții cele mai bune statistici pentru jucătorii tăi. Alege cu grijă, deoarece anumite bonusuri sunt mai bune doar pentru anumiți jucători.",
  "international2023_fantasy_compete_title": "Concurează",
  "international2023_fantasy_compete_desc": "Fiecare weekend al campionatului va veni cu o rundă separată pentru provocarea Fantasy, astfel că vei avea mai multe șanse de a concura împotriva prietenilor și a întregii lumi. Câștigă puncte pentru compendiu și, dacă-ți asiguri un loc important în clasament, un trofeu unic.",
  "international2023_bingo_title": "Bingo",
  "international2023_bingo_intro": "Te trec puțin fiorii atunci când o echipă profesionistă cumpără un Divine Rapier? Sau poate atunci când durata unui meci depășește 80 de minute și totul pare să ia o turnură ciudată? Ce părere ai totuși despre situațiile în care numărul de unități ale unei echipe îl depășește într-o confruntare pe cel al echipei adverse?\\n\\nEi bine, pregătește-te să pui acele emoții la treabă: noul joc de bingo îți va permite să câștigi o mulțime de puncte în baza evenimentelor cu adevărat nebunești care au loc în meciuri.",
  "international2023_bingo_cards_title": "UN BILET BINGO PER WEEKEND",
  "international2023_bingo_cards_desc": "Toți deținătorii de compendiu vor primi în fiecare weekend al turneului un nou bilet de bingo generat aleatoriu. Acest bilet este plin de căsuțe cu condiții ciudate și situații interesante care pot avea loc în timpul meciurilor jucate în cadrul campionatului.",
  "international2023_bingo_rewards_title": "Completează linii pentru a câștiga puncte",
  "international2023_bingo_rewards_desc": "Ai citit bine: nu te lăsa păcălit de zei, demoni sau orice altă creatură silvană. E totuși un joc de bingo. Atunci când completezi un rând, o coloană sau o diagonală pe biletul tău de bingo, vei revendica o recompensă care constă în puncte pentru compendiu. Mențiune: nu este obligatoriu să strigi „BINGO”, dar te încurajăm să o faci.",
  "international2023_predictions_title": "Provocarea lui Oracle",
  "international2023_predictions_intro": "Oracle folosește magia astrală ombilicală pentru a citi viitorul. Ei bine, nu vrem să-ți tăiem entuziasmul, dar magia ombilicală nu există. Va trebui să te bazezi pe viclenia ta, cunoștințele tale despre e-sports și, cel mai important, pe aptitudinile tale de pronosticare.\\n\\nPronostichează asemenea lui Oracle, dar fără a folosi magia ombilicală, ce echipe vor avansa și care vor fi eliminate în fiecare weekend al campionatului. Pronosticurile corecte (adică divinațiile lui Oracle) îți vor aduce puncte pentru compendiu.",
  "international2023_predictions_group_stage_title": "Realizează pronosticuri pentru faza grupelor",
  "international2023_predictions_group_stage_desc": "În premieră pentru acest an, încearcă să realizezi pronosticuri privind ordinea echipelor din fiecare grupă.",
  "international2023_predictions_ingame_title": "Pronosticuri în joc",
  "international2023_predictions_ingame_desc": "În timp ce urmărești meciuri în joc sau pe Twitch, testează-ți aptitudinile și realizează pronosticuri înainte de a se auzi cornul care vestește începutul fiecărui meci. Pentru fiecare pronostic corect vei obține puncte pentru compendiu și vei putea fi recompensat pentru maxim șase predicții pe zi.",
  "international2023_rewards_title": "Recompensele compendiului",
  "international2023_rewards_intro": "Dacă îți place scena competitivă de Dota, dar și să primești recompense pentru această pasiune, recompensele de anul acesta sunt menite pentru tine. Compendiul din 2023 se concentrează exclusiv pe The International 2023 și scena profesionistă de Dota.",
  "international2023_rewards_physical_aegis_title": "Modelul fizic al trofeului Aegis",
  "international2023_rewards_physical_aegis_desc": "O replică din aliaj de nichel la o scară de 1:5 a faimosului trofeu. Expune-o cu mândrie! Expune-o fără nicio obligație! Topește-o pentru a-ți crea propria monedă!",
  "international2023_rewards_chat_wheels_title": "Replici permanente pentru rotița de chat",
  "international2023_rewards_chat_wheels_desc": "Spre deosebire de anii precedenți, toate replicile pentru rotița de chat sunt acum permanente. Așa cum spune și titlul. Da, acest text pare puțin redundant, dar ne face plăcere să petrecem mai mult timp alături de tine.",
  "international2023_rewards_stickers_title": "Abțibilduri cu jucători și echipe",
  "international2023_rewards_stickers_desc": "„Doar abțibilduri cu echipe?” N-ai citit titlul, nu-i așa? Vei primi și abțibilduri cu jucători. Sincer, aceste paragrafe sunt doar niște fulgi de polistiren pe care-i folosim pentru a proteja titlul pe parcurs ce informația din titlu îți este transmisă.",
  "international2023_rewards_hud_title": "Interfața de joc The International 2023",
  "international2023_rewards_hud_desc": "Probabil că ultimul paragraf i-a speriat pe câțiva dintre voi să-l mai citească și pe acesta. Dacă nu te-am pierdut încă, felicitări, te-ai descurcat destul de bine! Acesta a fost un test pe care ai reușit să-l treci. Deoarece câteva dintre informațiile de aici nu se regăsesc în titlu: noua interfață de joc a fost personalizată folosind un model de vitraliu, temă care este specifică ediției din acest an a campionatului.",
  "international2023_rewards_loading_screens_title": "Ecrane de încărcare",
  "international2023_rewards_loading_screens_desc": "Vei primi un ecran de încărcare personalizat cu tematică de vitraliu pentru fiecare echipă, dar și câteva dintre ilustrațiile principale ale campionatului TI din acest an.",
  "international2023_rewards_materials_title": "Instrumente pentru Fantasy și Drumul către TI",
  "international2023_rewards_materials_desc": "Utilizează instrumente personalizate pentru a crea jucători mai buni în provocarea Fantasy sau pentru a progresa mai ușor în cadrul provocării „Drumul către TI”.",
  "international2023_rewards_teleport_fx_title": "Efecte de teleportare cu echipa favorită",
  "international2023_rewards_teleport_fx_desc": "Exprimă-ți sprijinul în meciuri față de echipa preferată cu ajutorul efectelor personalizate de teleportare pentru care sunt disponibile trei niveluri.",
  "international2023_rewards_Types_title": "Tipuri de recompense",
  "international2023_rewards_Types_desc": "Fiecare tip de recompensă vine cu propria bară de progres. Atunci când aceasta se umple, vei putea revendica recompensa respectivă. Anumite bare de progres se vor reseta după umplere de un număr nelimitat de ori, în timp ce altele vor putea fi umplute doar de un anumit număr de ori.",
  "international2023_rewards_Levels_title": "Niveluri pentru compendiu",
  "international2023_rewards_Levels_desc": "Pentru a obține niveluri pentru compendiu poți participa la activitățile propuse de compendiu sau poți cumpăra pachete cu niveluri. Aplică niveluri pentru a mări progresul tuturor tipurilor de recompense.",
  "international2023_rewards_Boosters_title": "Stimulente",
  "international2023_rewards_Boosters_desc": "Stimulentele sunt similare nivelurilor de compendiu, dar acestea măresc progresul pentru o singură recompensă. Aplicarea unui stimulent pentru a obține progres pentru o anumită recompensă va contribui și la progresul pentru Collector's Aegis.",
  "international2023_supporters_clubs_title": "Fan cluburi",
  "international2023_supporters_clubs_subtitle": "Sprijină-ți direct echipele preferate",
  "international2023_supporters_clubs_intro": "Recompensele pentru fan cluburi sunt ca bucuriile tinereții – bucură-te de ele cât poți pentru că sunt trecătoare. Sau cel puțin erau. Începând de acum, acestea sunt permanente! Te poți bucura mereu de ele! Asta dacă nu ești călcat de tren.\\n\\n Mai bine: 50% din încasări vor merge direct către echipă. Da, e chiar mai bine pentru ei. Pentru tine e mai important primul aspect.",
  "international2023_supporters_clubs_tiers_title": "Trei categorii de pachete pentru susținere",
  "international2023_supporters_clubs_tiers_desc": "Alege din pachetele de bronz, argint sau aur ale echipelor tale preferate pentru a obține recompense realizate chiar de către echipe.",
  "international2023_talent_title": "Abțibilduri cu realizatori",
  "international2023_talent_subtitle": "Sprijină direct realizatorii preferați",
  "international2023_talent_intro": "Difuzarea în direct a competițiilor de e-sports nu este o muncă ușoară. Nu este la fel de dificilă ca munca dintr-o mină de cărbune, evident. Dar este o activitate mai grea decât să vinzi tricotaje pe Etsy. Ei bine, și tricotatul poate fi dificil dacă ne gândim la acele jachete tricotate în mai multe culori. \\n\\n Acum îi poți transmite un mesaj realizatorului tău preferat care să sune cam așa: „Hei… îți respect munca. Nu la fel de mult ca pe cea a unui miner, dar mai mult decât munca depusă de cel puțin 50% dintre creatorii de pe Etsy.” Vorbind de 50%, jumătate din toate veniturile obținute din comercializarea de abțibilduri cu realizatori vor merge direct către aceștia.",
  "international2023_talent_tiers_title": "Alege categoria",
  "international2023_talent_tiers_desc": "Achiziționează pachetele cu recompense ale realizatorilor tăi preferați. Pachetele includ abțibilduri, replici și autografe în funcție de categoria pachetului achiziționat.",
  "international2023_talent_coming_soon": "Pachetele realizatorilor vor fi disponibile pentru achiziție după ce realizatorii evenimentului vor fi anunțați.",
  "international2023_coming_soon": "În curând",
  "ti12_bp_countdown_header": "până la faza grupelor",
  "ti12_bp_countdown_desc": "Urmărește cel mai mare campionat de e-sports al anului, difuzat în direct din Seattle – trofeul Aegis of Champions așteaptă să fie revendicat.",
  "ti12_bp_tournament_complete_desc": "Retrăiește emoția celui mai mare campionat de e-sports al anului, deoarece toate momentele din Seattle sunt disponibile la un clic distanță.",
  "ti12_group_stage_venue": "Online",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Sprijină campionatul",
  "ti12_compendium_header": "Compendiu - The International 2023",
  "ti12_compendium_desc": "Deblochează conținut suplimentar din cadrul campionatului cu ajutorul compendiului pentru The International 2023. Joacă asemenea unui profesionist în provocarea „Drumul către TI”. Construiește o listă cu jucătorii tăi profesioniști preferați cu noua provocare Fantasy. Testează-ți abilitățile de predicție cu provocarea lui Oracle și speră că echipele fac anumite lucruri inedite cu noua funcționalitate bingo. \\n\\nCâștigă recompense precum abțibilduri cu jucători și echipe, rotițe de chat, un HUD personalizat și multe altele, chiar și o replică fizică a trofeului Aegis of Champions.\\n\\n25% din veniturile obținute în urma vânzărilor de compendiu vor merge către fondul de premiere al campionatului The International.",
  "ti12_compendium_standard": "Compendiu standard",
  "ti12_compendium_upgraded": "Compendiu îmbunătățit"
}