// 1504.js

{
  "language": "thai",
  "international2023_compendium_activity": "กิจกรรมสำหรับผู้ที่มี Compendium",
  "international2023_update_title": "เฉลิมฉลองการแข่งขัน The International 2023",
  "international2023_update_subtitle": "การอัปเดตอีสปอร์ตครั้งนี้มีบางอย่างให้สำหรับทุกคน ตั้งแต่แฟนตัวยงของการแข่งขันมืออาชีพไปจนถึงผู้เล่นทั่วไป",
  "international2023_update_body": "ไม่ว่าคุณจะลุ้นไปกับทุกวินาทีของทุกแมตช์ในการแข่งขัน The International หรือคุณแทบจะไม่รู้เลยว่ามีคนเล่นเกมนี้เพื่อหาเลี้ยงชีพด้วยและเพียงแค่ต้องการเล่นเกมอย่างสงบสุข โปรดอ่านต่อด้านล่างนี้ เพราะว่าอัปเดตครั้งนี้มีบางอย่างสำหรับคุณ\\n\\nคุณเป็นแฟนพันธุ์แท้อีสปอร์ตใช่หรือไม่? สร้างทีมผู้เล่นมืออาชีพของคุณเองด้วย<b>ลีกแฟนตาซี</b>ฉบับอัปเกรด หรือว่าคุณชื่นชอบการวิเคราะห์เกมมากกว่าหรือเปล่า? ดำดิ่งสู่การทายผลสายการแข่งขันใน<b>บททดสอบของ Oracle</b> หรือบางทีคุณอาจชอบเล่นเกมที่นิยมกันในแก๊งป้า ๆ ของคุณ เพราะว่าในปีนี้เรามีแม้แต่<b>เกมบิงโก</b>อีกด้วย!\\n\\nแต่บางทีคุณอาจไม่ได้สนใจอะไรที่กล่าวมาเลย บางทีคุณอาจแค่สนใจตัวคุณเองอย่างเดียว ขอบอกว่าเราก็มีบางอย่างสำหรับคุณเช่นกัน นั่นก็คือ<b>หน้าแสดงผลงานบนโปรไฟล์</b> ต่อจากนี้โปรไฟล์ของคุณจะกลายเป็นอนุสรณ์แบบอินเตอร์แอคทีฟสำหรับตัวคุณเอง โดยนำเสนอไอเท็มและผลงานความสำเร็จในประวัติการเล่นใดก็ตามที่คุณต้องการจะใส่เข้าไป",
  "international2023_update_footer": "คุณได้อ่านจนจบการอัปเดตแล้ว เก่งมาก!",
  "international2023_compendium": "Compendium",
  "international2023_compendium_title": "Compendium ของ The International 2023",
  "international2023_compendium_intro": "Compendium คือคู่หูดิจิตอลแบบอินเตอร์แอคทีฟสำหรับเส้นทางสู่ The International 2023 และ The International 2023\\n\\nสวมบทเล่นเหมือนมืออาชีพด้วยบททดสอบเส้นทางสู่ TI ดราฟต์ผู้เล่นคนโปรดของคุณด้วยการท้าทายแฟนตาซีฉบับอัปเดตและปรับปรุงใหม่ ทดสอบพลังการทำนายของคุณด้วยการทายผลรอบแบ่งกลุ่มและสายการแข่งขัน หรือลุ้นรางวัลแจ๊กพ็อตด้วยตารางบิงโกใหม่ล่าสุด\\n\\nคิดซะว่า Compendium เป็นแหล่งรวมแบบครบวงจรสำหรับกิจกรรม บททดสอบ และรางวัลทั้งหมดที่เกี่ยวข้องกับงานแข่งในปีนี้ นอกจากนี้ รายได้ 25% จากยอดขายทั้งหมดจะนำไปสมทบเงินรางวัลรวมของ The International 2023",
  "international2023_showcase_title": "หน้าแสดงผลงานบนโปรไฟล์",
  "international2023_showcase_subtitle": "คุณสมบัติใหม่สำหรับผู้เล่น Dota ทุกคน",
  "international2023_showcase_intro": "หน้าโปรไฟล์และโปรไฟล์ย่อยได้รับการออกแบบใหม่ทั้งหมดสำหรับทุกคน (ก็นะ คุณทุกคน 98% มีคะแนนการสื่อสารมากกว่า 6000 คะแนนน่ะ) ตอนนี้คุณจะสามารถอวดไอเท็ม Dota และผลงานความสำเร็จของคุณได้ทั้งหมด ซึ่งก็คืออะไรก็ได้ทุกอย่างที่อยู่ในคลัง Dota ของคุณ ด้วยหน้าแสดงผลงานบนโปรไฟล์แบบใหม่\\n\\nอยากสร้างหิ้งให้กับทีมมืออาชีพโปรดของคุณเมื่อตอนปี 2016? ย่อมทำได้ แล้วถ้าอยากอวดชุดสะสมฮีโร่โปรดของคุณล่ะ? ก็ทำได้อย่างแน่นอน หรืออยากแสดงหนึ่งในรองเท้า Kunkka ที่มีเป็นร้อยพันล้านคู่ใช่ไหม? ตอบอย่างเศร้า ๆ ก็คือใช่ ในทางเทคนิคแล้วก็ทำได้เช่นกัน",
  "international2023_showcase_profile_title": "โปรไฟล์แบบอัปเดตใหม่",
  "international2023_showcase_profile_desc": "รับบทเป็นไมเคิลแองเจโลและเปลี่ยนหน้าโปรไฟล์ให้กลายเป็นผืนผ้าใบของคุณ ไม่มีอะไรที่เป็นไปไม่ได้เกินกว่าจินตนาการ (และความรู้สึกผิดชอบชั่วดีพื้นฐานของคุณ)",
  "international2023_showcase_mini_profile_title": "โปรไฟล์ย่อยแบบอัปเดตใหม่",
  "international2023_showcase_mini_profile_desc": "โปรไฟล์ย่อยนั้นมีอะไรหลายอย่างเหมือนกับโปรไฟล์ แต่สิ่งสำคัญอย่างหนึ่งที่แตกต่างก็คือ (ทนฟังเราก่อนนะ) โปรไฟล์ย่อยนั้นมีขนาดเล็กกว่า... และผู้เล่นคนอื่น ๆ จะเห็นโปรไฟล์ย่อยของคุณทุกครั้งที่ชี้เมาส์เหนือชื่อของคุณ",
  "international2023_showcase_carousel_title": "ตัวอย่างหน้าแสดงผลงาน",
  "international2023_showcase_items_title": "ไอเท็มสำหรับแสดง",
  "international2023_showcase_items_desc": "ปรับแต่งหน้าแสดงผลงานของคุณด้วยไอเท็มและรางวัลมากมายหลากหลายทั้งหมดที่คุณสะสมมาตลอดหลายปี",
  "international2023_showcase_item_heroes_title": "ฮีโร่",
  "international2023_showcase_item_trophies_title": "ถ้วยรางวัล",
  "international2023_showcase_item_stickers_title": "สติกเกอร์",
  "international2023_showcase_item_stats_title": "สถิติ",
  "international2023_showcase_item_chat_wheels_title": "วงล้อสนทนา",
  "international2023_showcase_item_sprays_title": "สเปรย์",
  "international2023_showcase_item_items_title": "ไอเท็มคลังแสง",
  "international2023_showcase_item_emoticons_title": "อีโมติคอน",
  "international2023_showcase_item_loading_screens_title": "หน้าจอโหลด",
  "international2023_showcase_item_couriers_title": "Courier",
  "international2023_showcase_item_wards_title": "Ward",
  "international2023_tournament_prize_pool": "เงินรางวัลรวม",
  "international2023_tournament_prize_pool_percent": "รายได้ 25% จากยอดขาย Compendium ของ The International 2023 ทั้งหมดจะนำไปสมทบเงินรางวัลรวมของ The International 2023",
  "international2023_tournament_learn_more": "เรียนรู้เพิ่มเติมเกี่ยวกับทัวร์นาเมนต์",
  "international2023_quests_title": "บททดสอบเส้นทางสู่ The International",
  "international2023_quests_intro": "คุณได้ดูผู้เล่นมืออาชีพไปแล้ว คุณได้ให้กำลังใจเชียร์ไปแล้ว คราวนี้ได้เวลาเล่นเหมือนมืออาชีพบ้าง สไลด์ตัวเข้าเก้าอี้เล่นเกมของผู้เล่นอีสปอร์ตมืออาชีพคนโปรดของคุณ และสร้างสรรค์เหตุการณ์ที่ยิ่งใหญ่ที่สุดของเขาจากปีที่ผ่านมาให้กลับมามีชีวิตอีกครั้ง ชนะด้วยฮีโร่จากแมตช์ที่กำหนด หรือเล่นหนึ่งในฮีโร่ 5 ตัวที่ผู้เล่นมืออาชีพใช้ในช่วงเดือนที่กำหนดของฤดูกาล รับคะแนนจากบททดสอบแต่ละประเภท และรับคะแนนเพิ่มเติมเมื่อทำบททดสอบสำเร็จครบทั้งชุด",
  "international2023_quests_match_title": "บททดสอบแมตช์",
  "international2023_quests_match_desc": "ชนะด้วยฮีโร่จากแมตช์มืออาชีพที่แข่งขันจริง",
  "international2023_quests_pro_title": "บททดสอบผู้เล่น",
  "international2023_quests_pro_desc": "ชนะด้วยหนึ่งในฮีโร่ที่ผู้เล่นมืออาชีพเลือกบ่อยที่สุด",
  "international2023_quests_rewards_title": "รับรางวัล",
  "international2023_quests_rewards_desc": "เสริมพลังรางวัลของคุณด้วยแต้ม Compendium ที่ได้รับตลอดทาง",
  "international2023_fantasy_title": "แฟนตาซีพัฒนาใหม่",
  "international2023_fantasy_intro": "เลือกทีมจากผู้เล่นมืออาชีพที่คุณชื่นชอบ สร้างค่าสถิติที่คุณคิดว่าจะมีมูลค่าสูงสุด แข่งขันกับผู้เล่นทั่วโลกเพื่อทำคะแนนให้ได้มากที่สุด นี่คือลีกแฟนตาซี Dota ในแบบที่คุณเคยรู้จัก แต่ครั้งนี้มีการปรับโฉมรูปแบบใหม่ในทุก ๆ ด้าน",
  "international2023_fantasy_players_title": "เลือก",
  "international2023_fantasy_players_desc": "เลือกผู้เล่นตัวหลัก เลนกลาง และซัพพอร์ตที่คุณชื่นชอบ",
  "international2023_fantasy_craft_title": "สร้าง",
  "international2023_fantasy_craft_desc": "ใช้สิทธิ์สุ่มใหม่ที่ได้รับจากรางวัล Compendium เพื่อพยายามสร้างค่าสถิติที่ดีที่สุดสำหรับผู้เล่นของคุณ พยายามเลือกให้ดี เพราะสถิติบางอย่างจะดีสำหรับผู้เล่นบางคนมากกว่าผู้เล่นคนอื่น",
  "international2023_fantasy_compete_title": "แข่งขัน",
  "international2023_fantasy_compete_desc": "รอบแฟนตาซีในแต่ละรอบจะแบ่งตามแต่ละสุดสัปดาห์ของทัวร์นาเมนต์ ดังนั้นคุณจะมีโอกาสหลายครั้งในการแข่งกับเพื่อนของคุณและคนทั้งโลก รับแต้ม Compendium และหากอันดับของคุณในกระดานผู้นำสูงพอ ก็จะได้รับถ้วยรางวัลสุดพิเศษอีกด้วย",
  "international2023_bingo_title": "บิงโก",
  "international2023_bingo_intro": "คุณรู้สึกตื่นเต้นทุกครั้งที่ทีมมืออาชีพซื้อ Divine Rapier ไหม? หรือเมื่อแมตช์เล่นนานกว่า 80 นาทีแล้วทุกอย่างเริ่มแปลก ๆ หน่อย? แล้วเมื่อทีมฮีโร่รวมกัน 16 ขาสู้กับทีมที่มีเพียง 4 ขาล่ะ?\\n\\nเตรียมตัวเปลี่ยนความตื่นเต้นเหล่านั้นให้กลายเป็นรางวัล เกมบิงโกมาถึงแล้วให้คุณได้ผลตอบแทนจากเหตุการณ์บางอย่างที่บ้าบอสุดขั้ว",
  "international2023_bingo_cards_title": "การ์ดบิงโกหนึ่งใบต่อสุดสัปดาห์",
  "international2023_bingo_cards_desc": "ผู้ที่มี Compendium ทุกคนจะได้รับการ์ดบิงโกที่สร้างขึ้นแบบสุ่มในแต่ละสุดสัปดาห์ของทัวร์นาเมนต์ การ์ดดังกล่าวจะอัดแน่นไปด้วยช่องที่มีเงื่อนไขแปลก ๆ และสถานการณ์ที่น่าสนใจให้คุณได้ลุ้นในขณะที่ผู้เล่นมืออาชีพแข่งขันกัน",
  "international2023_bingo_rewards_title": "เติมแถวให้ครบและรับรางวัล",
  "international2023_bingo_rewards_desc": "ใช่แล้ว อย่าปล่อยให้เทพเจ้า ปีศาจ และสิ่งมีชีวิตสัตว์ป่าจอมหาเรื่องมาหลอกคุณได้ เกมนี้คือบิงโกธรรมดานั่นแหละ เมื่อคุณเติมแถวในการ์ดบิงโกจนครบแนวตั้ง แนวนอน หรือแนวเฉียง ก็จะได้รับรางวัลเป็นแต้ม Compendium หมายเหตุ: ไม่จำเป็นต้องตะโกน \"บิงโก\" แต่เราก็ขอแนะนำให้ทำอยู่ดี",
  "international2023_predictions_title": "บททดสอบของ Oracle",
  "international2023_predictions_intro": "Oracle ใช้เวทมนตร์เส้นใยอวกาศเพื่อมองเห็นอนาคต ซึ่งเราก็ไม่อยากทำลายมายาหรอกนะ แต่เวทมนตร์เส้นใยอวกาศนั้นไม่มีจริงหรอก คุณจะต้องใช้ไหวพริบ ความรู้ด้านอีสปอร์ต และที่สำคัญที่สุดคือการคาดเดาที่แม่นที่สุดของคุณเพื่อทายให้ถูกต้อง\\n\\nทำนายให้เหมือน Oracle (แต่แบบไม่ใช้เส้นใยอวกาศ) ว่าทีมใดจะเข้ารอบต่อไปและทีมใดจะต้องตกรอบในทัวร์นาเมนต์แต่ละสุดสัปดาห์ การทายผลถูกต้อง (หรือก็คือพลังเทพ Oracle พยากรณ์) จะทำให้คุณได้รับแต้ม Compendium",
  "international2023_predictions_group_stage_title": "ทายผลรอบแบ่งกลุ่ม",
  "international2023_predictions_group_stage_desc": "ใหม่สำหรับปีนี้ พยายามทำนายอันดับทีมในแต่ละกลุ่ม",
  "international2023_predictions_ingame_title": "ทายผลในเกม",
  "international2023_predictions_ingame_desc": "ขณะรับชมในเกมหรือบน Twitch ลองทดสอบพลังทำนายของคุณก่อนเริ่มเสียงแตรในแต่ละแมตช์ คุณจะได้รับแต้ม Compendium ตามการทายผลที่ถูกต้องแต่ละครั้ง สูงสุดได้ถึง 6 ครั้งต่อวัน",
  "international2023_rewards_title": "รางวัล Compendium",
  "international2023_rewards_intro": "หากคุณเป็นแฟนตัวยงของการแข่งขัน Dota และได้รับรางวัลจากการเป็นแฟนตัวยงของการแข่งขัน Dota รางวัลในปีนี้มีไว้สำหรับคุณ Compendium 2023 จะมุ่งเน้นไปที่ The International 2023 และการแข่งขัน Dota มืออาชีพทั้งหมด",
  "international2023_rewards_physical_aegis_title": "Aegis แบบจำลองสำหรับสะสม",
  "international2023_rewards_physical_aegis_desc": "รางวัลแชมป์อันเลื่องชื่อแบบจำลอง ผลิตจากโลหะผสมนิกเกิลขนาด 1 ต่อ 5 นำไปแสดงได้อย่างภาคภูมิใจ! หรือนำไปแสดงอย่างไม่ต้องภูมิใจก็ได้! หรือเอาไปละลายและสร้างสกุลเงินของคุณเองก็ตามสบาย!",
  "international2023_rewards_chat_wheels_title": "วงล้อสนทนาแบบถาวร",
  "international2023_rewards_chat_wheels_desc": "ต่างจากปีที่ผ่านมา วงล้อสนทนาทั้งหมดในตอนนี้จะเป็นแบบถาวร เหมือนกับที่เราเขียนไว้ในหัวเรื่องไง ใช่แล้ว เราจะบอกซ้ำทำไมเนอะ แต่ก็ดีที่ได้ใช้เวลาอยู่ร่วมกับคุณนานขึ้น",
  "international2023_rewards_stickers_title": "สติกเกอร์ผู้เล่นและทีม",
  "international2023_rewards_stickers_desc": "\"แค่สติกเกอร์ทีมเหรอ?\" คุณไม่ได้อ่านหัวเรื่องใช่ไหมล่ะ? คุณจะได้รับสติกเกอร์ผู้เล่นด้วย พูดตามตรงนะ ย่อหน้าพวกนี้ก็เป็นเหมือนแค่เม็ดโฟมกันกระแทกเอาไว้ป้องกันระหว่างที่หัวเรื่องเดินทางเข้าสู่นัยน์ตาคุณแค่นั้นแหละ",
  "international2023_rewards_hud_title": "HUD ของ The International 2023",
  "international2023_rewards_hud_desc": "ย่อหน้าเมื่อกี้อาจทำให้ผู้คนขี้เกียจอ่านย่อหน้านี้ไปแล้ว ดังนั้นหากคุณยังอยู่กับเรา ก็บอกได้เลยว่าคุณฉลาดมากที่ผ่านบททดสอบนี้ได้ เพราะว่าคราวนี้มีข้อมูลที่ไม่ได้อยู่ในหัวเรื่องด้วย ก็คือ HUD ใหม่ได้รับการออกแบบเป็นพิเศษโดยใช้ธีมกระจกสีประจำปีนี้",
  "international2023_rewards_loading_screens_title": "หน้าจอโหลด",
  "international2023_rewards_loading_screens_desc": "คุณจะได้รับหน้าจอโหลดธีมกระจกสีแบบพิเศษสำหรับแต่ละทีม พร้อมกับงานศิลป์หลักบางส่วนของ TI ในปีนี้",
  "international2023_rewards_materials_title": "เครื่องมือเสริมพลังแฟนตาซีและบททดสอบเส้นทางสู่ TI",
  "international2023_rewards_materials_desc": "ใช้เครื่องมือพิเศษเพื่อสร้างผู้เล่นที่ดีขึ้นในการท้าทายแฟนตาซี หรือฝ่าฟันผ่านการท้าทายที่ยากเป็นพิเศษในบททดสอบเส้นทางสู่ TI",
  "international2023_rewards_teleport_fx_title": "เอฟเฟกต์เทเลพอร์ตทีมโปรด",
  "international2023_rewards_teleport_fx_desc": "อวดทีมโปรดของคุณในเกมด้วยเอฟเฟกต์เทเลพอร์ตแบบกำหนดเองใน 3 ระดับแตกต่างกัน",
  "international2023_rewards_Types_title": "ประเภทรางวัล",
  "international2023_rewards_Types_desc": "รางวัลแต่ละประเภทจะมีมาตรวัดความคืบหน้าเป็นของตัวเอง ซึ่งเมื่อเต็มแล้วคุณจะสามารถรับรางวัลนั้นได้ มาตรวัดบางอย่างสามารถเติมซ้ำได้หลายครั้งตามต้องการ ในขณะที่บางอย่างสามารถเติมได้โดยจำกัดจำนวนครั้ง",
  "international2023_rewards_Levels_title": "เลเวล Compendium",
  "international2023_rewards_Levels_desc": "รับเลเวล Compendium โดยการเข้าร่วมกิจกรรม Compendium ต่าง ๆ หรือซื้อแพ็กเลเวล ใช้งานเลเวลเพื่อเพิ่มความคืบหน้ามาตรวัดของรางวัลทุกประเภท",
  "international2023_rewards_Boosters_title": "บูสเตอร์",
  "international2023_rewards_Boosters_desc": "บูสเตอร์นั้นก็เหมือนกับเลเวล Compendium แต่จะเพิ่มรางวัลเฉพาะรายการเดียว การใช้บูสเตอร์กับรางวัลก็จะเพิ่มความคืบหน้าของ Aegis สำหรับสะสมด้วยเช่นกัน",
  "international2023_supporters_clubs_title": "สโมสรผู้สนับสนุน",
  "international2023_supporters_clubs_subtitle": "สนับสนุนทีมที่คุณชื่นชอบโดยตรง",
  "international2023_supporters_clubs_intro": "รางวัลสโมสรผู้สนับสนุนนั้นเปรียบเสมือนความสุขในวัยเยาว์ จงเพลิดเพลินขณะที่ยังมีเวลาเหลืออยู่ เพราะมันจะสูญสิ้นไปในไม่ช้า แต่ทั้งหมดนี้จะไม่เป็นความจริงอีกต่อไป เพราะตั้งแต่บัดนี้ รางวัลจะเป็นแบบถาวร! ต่อจากนี้คุณสามารถเพลิดเพลินกับรางวัลได้ตลอดไป! เว้นแต่คุณจะโดนรถเมล์ชนซะก่อน\\n\\n อีกทั้งยังดียิ่งกว่าเก่า: รายได้ 50% จากยอดขายทั้งหมดมอบให้ทีมโดยตรง ซึ่งก็ดียิ่งกว่าเก่าสำหรับทีม ส่วนอย่างแรกดีขึ้นสำหรับคุณ",
  "international2023_supporters_clubs_tiers_title": "สนับสนุนได้ 3 ระดับ",
  "international2023_supporters_clubs_tiers_desc": "เลือกการสนับสนุนระดับทองแดง เงิน หรือทองสำหรับทีมโปรดของคุณเพื่อรับรางวัลที่ออกแบบโดยทีมเอง",
  "international2023_talent_title": "สติกเกอร์ผู้เชี่ยวชาญ",
  "international2023_talent_subtitle": "สนับสนุนผู้เชี่ยวชาญที่คุณชื่นชอบโดยตรง",
  "international2023_talent_intro": "ถึงแม้ว่าการถ่ายทอดสดอีสปอร์ตจะดูเหมือนง่าย ๆ แต่ที่จริงแล้วเป็นงานที่ยากอยู่เหมือนกัน \\n\\n แต่จากนี้ไปคุณจะสามารถบอกผู้เชี่ยวชาญคนโปรดได้ว่า \"ฉันเคารพในสิ่งที่คุณทำนะ\" และรายได้ 50% จากยอดขายสติกเกอร์ผู้เชี่ยวชาญทั้งหมดจะมอบให้กับผู้เชี่ยวชาญคนนั้นโดยตรง",
  "international2023_talent_tiers_title": "เลือกระดับของคุณ",
  "international2023_talent_tiers_desc": "ซื้อชุดรวมรางวัลที่นำเสนอผู้เชี่ยวชาญคนโปรดของคุณ ชุดรวมประกอบด้วยสติกเกอร์ ประโยคเสียง และลายเซ็น โดยขึ้นอยู่กับระดับของชุดรวมที่ซื้อ",
  "international2023_talent_coming_soon": "ชุดรวมผู้เชี่ยวชาญจะสามารถสั่งซื้อได้หลังจากการประกาศรายชื่อผู้เชี่ยวชาญ",
  "international2023_coming_soon": "เร็ว ๆ นี้",
  "ti12_bp_countdown_header": "สู่รอบแบ่งกลุ่ม",
  "ti12_bp_countdown_desc": "รับชมทัวร์นาเมนต์อีสปอร์ตที่ยิ่งใหญ่ที่สุดของปี ถ่ายทอดสดจากเมืองซีแอตเทิลโดยมี Aegis of Champions เป็นเดิมพัน",
  "ti12_bp_tournament_complete_desc": "ย้อนกลับไปรับความตื่นเต้นจากทัวร์นาเมนต์อีสปอร์ตที่ยิ่งใหญ่ที่สุดแห่งปีได้อีกครั้ง — แค่คลิกเดียวก็ชมการแข่งขันจากเมืองซีแอตเทิลได้ทุกนัด",
  "ti12_group_stage_venue": "ออนไลน์",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "สนับสนุนทัวร์นาเมนต์",
  "ti12_compendium_header": "Compendium ของ The International 2023",
  "ti12_compendium_desc": "ปลดล็อกรางวัลมากกว่าเดิมจากฤดูกาลทัวร์นาเมนต์ด้วย Compendium ของ The International 2023 สวมบทเล่นเหมือนมืออาชีพด้วยบททดสอบเส้นทางสู่ TI สร้างทีมผู้เล่นคนโปรดของคุณด้วยแฟนตาซีแบบปรับใหม่ ทดสอบทักษะการทำนายของคุณด้วยบททดสอบของ Oracle และลุ้นให้ทีมทำอะไรแปลก ๆ ด้วยคุณสมบัติบิงโกใหม่ล่าสุด\\n\\nรับรางวัล เช่น สติกเกอร์ผู้เล่น สติกเกอร์ทีม วงล้อสนทนา HUD แบบใหม่ และอีกมากมาย จนไปถึง Aegis แบบจำลองสำหรับสะสม\\n\\nรายได้ 25% จากยอดขาย Compendium ทั้งหมดจะนำไปสมทบเงินรางวัลรวมของ The International โดยตรง",
  "ti12_compendium_standard": "Compendium แบบมาตรฐาน",
  "ti12_compendium_upgraded": "Compendium แบบอัปเกรด"
}