// 8960.js

{
  "language": "danish",
  "ringmastercomic_title_cover": "Dukken – forside",
  "ringmastercomic_title": "Dukken – side %1$s",
  "ringmastercomic_help_text": "Klik på billedet eller brug mellemrumstasten for at gå videre",
  "ringmastercomic_return_button": "Gå tilbage til forsiden",
  "ti13_online": "København",
  "ti13_main_event_venue": "Royal Arena – København",
  "ti13_best_of_three": "Bedst af tre",
  "ti13_best_of_five": "Bedst af fem",
  "ti13_group_stage_sp_rules": "Gruppenfase – Valgprioritetsregler",
  "ti13_group_stage_sp_game1": "Plat eller krone.",
  "ti13_group_stage_sp_game2": "Første kamp: Vinderen af plat eller krone vælger valgprioritet eller side.",
  "ti13_group_stage_sp_game3": "Anden kamp: Taberen af plat eller krone vælger valgprioritet eller side.",
  "ti13_group_stage_sp_game4": "Tredje kamp (hvis relevant): Ny omgang plat eller krone. Vinderen af den nye omgang vælger valgprioritet eller side.",
  "ti13_group_stage_tie_rules": "Gruppenfase – Regler ved uafgjort",
  "ti13_first_second_tie": "To hold er på en delt førsteplads",
  "ti13_second_third_tie": "To hold er på en delt andenplads",
  "ti13_third_fourth_tie": "To hold er på en delt tredjeplads",
  "ti13_three_way_first_tie": "Tre hold er på en delt førsteplads",
  "ti13_three_way_second_tie": "Tre hold er på en delt andenplads",
  "ti13_four_way_tie": "Fire hold er på en delt førsteplads",
  "ti13_tie_resolve_bo3": "Afgør med bedst af tre",
  "ti13_tie_resolve_third_fourth": "Der spilles ikke yderligere kampe. De to hold bliver på en delt tredje- og fjerdeplads.",
  "ti13_tie_resolve_first_with_round_robin": "Afgør førstepladsen ved at spille bedst af én mod hinanden, indtil et hold vinder to gange.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Fortsæt med at spille, indtil alle hold har spillet mod hinanden mindst én gang. Brug de seneste resultater fra alle mod alle for at afgøre anden- og tredjepladsen.",
  "ti13_tie_resolve_second_with_round_robin": "Afgør andenpladsen ved at spille bedst af én mod hinanden, indtil et hold vinder to gange.",
  "ti13_tie_resolve_third_fourth_other": "Der spilles ikke yderligere kampe. De to andre hold bliver på en delt tredje- og fjerdeplads.",
  "ti13_tie_resolve_four_way_1": "Sæt holdene tilfældigt op mod hinanden. Som eksempel i disse regler bruges hold A, hold B, hold C og hold D.",
  "ti13_tie_resolve_four_way_2": "Hold A spiller mod hold B i en bedst af én. Hold C spiller mod hold D i en bedst af én.",
  "ti13_tie_resolve_four_way_3": "Afgør førstepladsen ved at spille bedst af én mellem vinderen af A/B og vinderen af C/D.",
  "ti13_tie_resolve_four_way_4": "Afgør fjerdepladsen ved at spille bedst af én mellem taberen af A/B og taberen af C/D.",
  "ti13_tie_resolve_four_way_5": "Afgør andenpladsen ved at spille bedst af én mellem de tilbageværende hold.",
  "ti13_seeding_decider_sp_rules": "Afgørelse af seeding – Valgprioritetsregler",
  "ti13_seeding_decider_sp_rules_1": "Første kamp: Holdet med højeste seed fra gruppefasen vælger valgprioritet eller side.",
  "ti13_seeding_decider_sp_rules_2": "Anden kamp: Holdet med laveste seed fra gruppefasen vælger valgprioritet eller side.",
  "ti13_seeding_decider_sp_rules_3": "Tredje kamp (hvis relevant): Holdet med højeste seed fra gruppefasen vælger valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules": "Slutspillet og The International – Valgprioritetsregler",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Plat eller krone.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Første kamp: Vinderen af plat eller krone vælger valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Anden kamp: Taberen af plat eller krone vælger valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Tredje kamp (hvis relevant): Ny omgang plat eller krone. Vinderen af den nye omgang vælger valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Første kamp: Vinderen af øvre gruppe vælger valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Anden kamp: Vinderen af nedre gruppe vælger valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Tredje kamp: Vinderen af øvre gruppe vælger valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Fjerde kamp (hvis relevant): Vinderen af nedre gruppe vælger valgprioritet eller side.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Femte kamp (hvis relevant): Vinderen af plat eller krone vælger valgprioritet eller side.",
  "international2024_update_title": "TI 2024, Ringmaster og kompendiet",
  "ringmaster_hype": "\"Licher og Linaer, Slarker og Marcier, ofre i alle aldre! Øjeblikket, I alle har ventet på.\\n\\n I det, der virker som et år nu, har jeg kun eksisteret af navn – nævnt i stille hvisken, en lurende skygge bag det blodrøde tæppe. Men nu, langt (alt for langt, hvis I spørger mig) om længe, er de tåber, som står for det her foretagende, kommet til fornuft og har ladet mig velsigne jer med min pragt og ydmygt tage plads i rampelyset! Det er mig, Cogliostro Kettle – ondskabsfuld maestro! De fordømtes mørke rekommandør! Den uovertrufne RINGMASTER! Og jeg har nogle esser i ærmet!\"",
  "ringmaster_comic": "\"Men tag ikke mit ord for det! Hvorfor ikke læse en tegneserie om min tragiske oprindelseshistorie, berettet af en troværdig anonym fortæller?\"",
  "ringmaster_comic_title": "Dukken",
  "ringmaster_comic_desc": "Læs om Ringmasters tidlige dage på turné med Kettles' mekaniske cirkus.",
  "ringmaster_guide": "\"Jeg er blevet bedt om at være jeres guide gennem årets kompendium – et tilbud, jeg taknemligt har sagt ja til. Vi bør trods alt lære hinanden at kende! [b]Skal vi ikke bare komme i gang?[/b]\"",
  "ringmaster_introducing": "Vi præsenterer",
  "ringmaster_hero_detail_button": "Vis helteside",
  "ringmaster_play_trailer_button": "Afspil trailer",
  "ringmaster_comic_button": "Læs tegneserien",
  "international2024_compendium": "Kompendium",
  "international2024_compendium_title": "The International 2024-kompendiet",
  "international2024_effigies_title": "AFBILDNINGER PER HELT",
  "international2024_effigies_subtitle": "Opgraderet funktion, gratis for alle",
  "international2024_effigies_intro": "\"Der var engang, venner, for ikke så længe siden, hvor disse storslåede afbildninger var et sjældent syn! Ikke længere! Nu venter der et monument til hver kæmpe, som skal ud på slagmarken, uanset om det er Ringmaster eller alle de andre mindreværdige helte!\"",
  "international2024_effigies_desc": "Afbildninger er statuer af dine yndlingshelte, som du kan forme og placere på basen. I stedet for at dele en enkelt global plads har hver helt nu en afbildningsplads i arsenalet.",
  "international2024_purchase_intro": "\"Guder og monstre, kryb og kravl, træd op og fryd jeres heldige øjne med den mest [b]spændende samling spil, begivenheder og e-sportsbelønninger[/b] på denne side af floden! Test jeres forstand, held og mod i en fest for den største e-sportsbegivenhed i dette rige eller et hvilket som helst andet!\"",
  "international2024_activities": "DET HER FÅR DU",
  "international2024_activities_subtitle": "Chancespil, bedrifter og herligheder for alle aldre ",
  "international2024_activities_intro": "\"I modsætning til jeres stabile ceremonimester har jeg hørt, at nogle af jer har behov for at have en GRUND til at dræbe. Så hver kamp, du spiller, giver point, ven! Jo mere du spiller, jo mere får du, så kast dig ud i lanerne, og se pointene hobe sig op!\"",
  "international2024_activities_play_title": "Spil Dota: Optjen point",
  "international2024_activities_play_desc": "I år optjener du point for næsten hver eneste kamp, du spiller i den ugentlige udfordring. Du får også bonuspoint for din første sejr hver dag.",
  "international2024_activities_fantasy_title": "Fantasi",
  "international2024_activities_fantasy_desc": "Konkurrer mod dine venner og Dota-spillere fra hele verden. Vælg den bedste fantasiopstilling bestående af dine favoritproffer, og lav tilpassede kort med pointøgende statistikker.",
  "international2024_activities_oracles_title": "Oraklets udfordring",
  "international2024_activities_oracles_desc": "Forudsig, hvilke hold der går videre, og hvilke der ikke klarer sig, og nyd spådommenes nøjagtighed (forudsat at du havde ret).",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Få tilfældigt genererede bingoplader for hver fase af turneringen, fyldt med mærkelige forhold og interessante situationer.",
  "international2024_activities_outro": "\"Husk! Sejr er ikke kun en belønning i sig selv! Hver gang du gennemfører en af disse aktiviteter, får du point! Gå til præmieboden nedenfor for at se, hvilke herligheder du kan få for dem!\"",
  "international2024_rewards_title": "Kompendiumbelønninger",
  "international2024_rewards_subtitle": "Træd nærmere og kast blikket på disse præmier",
  "international2024_rewards_intro": "\"Stabl ligene højt, og indløs dine præmier! Ahhh, og HVILKE præmier der venter! Nej, præmien er ikke at klemme hænderne om en hals og se livet forsvinde fra en ulykkelig helts øjne. Det er en belønning I SIG SELV! Det her får du BAGEFTER!\"",
  "international2024_rewards_physical_aegis_title": "Fysisk Aegis-model",
  "international2024_rewards_physical_aegis_desc": "Fyld dit Aegis-formede hul på hylden og i hjertet med en kopi med nikkellegering af det berømte trofæ i målestoksforholdet 1:5.",
  "international2024_rewards_hud_title": "The International 2024 – HUD",
  "international2024_rewards_hud_desc": "Pynt grænsefladen i spillet med cirkusstemning. Vi har shinet HUD'en op inspireret af årets TI-tema.",
  "international2024_rewards_versus_title": "Præsentationsskærm 2024",
  "international2024_rewards_versus_desc": "Pift kampånden op inden spilstart med en tilpasset præsentationsskærm, som fremviser de nye helteafbildningspladser.",
  "international2024_rewards_chat_wheels_title": "Permanente chathjulsreplikker",
  "international2024_rewards_stickers_title": "Spiller- og holdklistermærker",
  "international2024_rewards_loading_screens_title": "Indlæsningsskærme",
  "international2024_rewards_materials_title": "Værktøjer til fantasispillet og bingo",
  "international2024_rewards_teleport_fx_title": "Yndlingsholdets teleporteffekter",
  "international2024_rewards_effigy_title": "Statueblok 2024",
  "international2024_supporters_clubs_title": "Støt fællesskabet",
  "international2024_supporters_clubs_subtitle": "Supporterbundter for hold og talenter",
  "international2024_supporters_clubs_intro": "\"Ærede velgørere! Filantroper i alle aldre! Ydmyge velyndere af drabs- og drabsnærliggende kunst! 50% af jeres storsindede gavmildhed går direkte til de hold og broadcasttalenter, I bedst kan lide! Hvem er den virkelige helt her? Mig, selvfølgelig! Og jeg klapper i mine enorme heroiske hænder af JER!\"",
  "international2024_supporters_clubs_tiers_title": "Supporterklubber",
  "international2024_supporters_clubs_tiers_desc": "Vælg bronze, sølv eller guld for at støtte dine yndlingshold og optjene belønninger, som er designet af holdene selv.",
  "international2024_talent_tiers_title": "Klistermærkepakker for talenter",
  "international2024_talent_tiers_desc": "Køb belønningsbundter med dit yndlingstalent. Bundter indeholder en kombination af klistermærker, stemmereplikker og autografer, alt efter hvilket niveau af bundtet der købes.",
  "ti13_compendium_small_header": "Støt turneringen",
  "ti13_compendium_header": "The International 2024-kompendiet",
  "ti13_compendium_desc": "Kompendiet er din interaktive digitale følgesvend til Vejen til The International. I kompendiet finder du alt på ét sted: aktiviteter og udfordringer i forbindelse med begivenheden og alle belønningerne for årets begivenhed. Og 25% af salget bidrager til præmiepuljen for The International 2024.\\n",
  "ti13_compendium_bp_btn": "Besøg hjemmeside",
  "ti13_compendium_standard": "Standardkompendium",
  "ti13_compendium_standard_subtitle": "Alle funktioner og aktiviteter",
  "ti13_compendium_upgraded": "Opgraderet kompendium",
  "ti13_compendium_upgraded_subtitle": "Alle funktioner og aktiviteter + hurtigere belønninger",
  "ti13_compendium_purchase_tp_fx": "TI 2024 – Teleporteffekt level 1",
  "ti13_compendium_purchase_boosters_footnote": "Boostere kan låse op for mere valgfrit indhold",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Boostere kan låse op for The International 2024-HUD'et eller mere valgfrit indhold",
  "ti13_compendium_purchase_levels": "%1$s kompendium-levels",
  "ti13_compendium_purchase_booster_levels": "%1$s boostere",
  "ti13_compendium_purchase_discount": "Spar %1$s% på levels",
  "ti13_compendium_purchase_earn_the_following": "Kompendium-levels låser op for:",
  "ti13_compendium_contribution": "25% af alle indtægterne bidrager til præmiepuljen til The International 2024.",
  "ti13_compendium_purchase_all_access": "Adgang til alle kompendiumfunktioner",
  "ti13_compendium_purchase_aegis_emoticon": "Aegis-emotikon",
  "ti13_compendium_purchase_bingo_tokens": "%1$s bingopoletter",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s fantasiombytningspoletter",
  "ti13_compendium_purchase_one_player_sticker": "1 spillerklistermærkekapsel",
  "ti13_compendium_purchase_player_stickers": "%1$s spillerklistermærkekapsler",
  "ti13_compendium_purchase_team_stickers": "%1$s holdklistermærkekapsler",
  "ti13_compendium_purchase_effigy_blocks": "%1$s statueblokke – TI 2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s skatte med holdindlæsningsskærme",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s skatte med TI-indlæsningsskærme",
  "international2024_tournament_learn_more": "Læs mere om turneringen",
  "ringmaster_abilities_heading": "Evner",
  "ringmaster_souvenirs_heading": "Souvenirer",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "KANALISERET – Ringmaster svinger og slår med sin pisk. Piskede fjender skades og løber i frygt fra Ringmaster. Kanaliseringstiden øger skade og forlænger frygtvarigheden eksponentielt, men reducerer radiussen.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster pakker sig selv eller en allieret helt ned i en mobil, ekstradimensionel kasse. Enheder i kassen får fri bevægelse, hæmningsresistens, ekstra magisk resistens og ekstra bevægelseshastighed. De bliver også uangribelige, dæmpes, undertrykkes og afvæbnes. Kassen springer op, når effekten udløber, eller helten bevæger sig udenfor radiussen.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster kaster en af sine knive til et præcist punkt efter sit eget valg. Hvis han rammer en fjende, gør kniven træfferskade, hæmmer den ramte enhed kortvarigt og gør en procentdel af offerets maks. HP som skade hvert sekund.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster ruller Wheel of Wonder til det valgte sted og skubber fjender til siden undervejs. Når det er fremme ved stedet, tager fjender indenfor hjulets rækkevidde skade over tid og hæmmes. Fjender, som vender mod hjulet i mere end 0,5 sekunder, hypnotiseres og trækkes hen imod det. Den første fjende, der hypnotiseres, udløser en nedtælling til hjulets selvdestruktion. Hvis nedtællingen ikke udløses, eksploderer hjulet automatisk efter 8 sekunder.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster lyser med et spotlys henover et område. Fjender i lyset har chance for at misse med deres angreb og afsløres, hvis de er usynlige. Illusioner, som rammes af lysstrålen, mister en procentdel af deres maks. helbred hvert sekund.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Når en fjendtlig helt i nærheden dør i nærheden af Ringmaster, modtager Ringmaster en tilfældig souvenir fra Dark Carnival, som kan bruges én gang. Yderligere souvenirer opbevares som ladninger. Hvis Ringmaster ikke har en souvenir, når han genoplives, får han en. Souvenirer fra Dark Carnival inkluderer Funhouse Mirror, Strongman Tonic og Whoopee Cushion.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Anvend: Proportion Distortion\\n\\nSkaber 1 ufuldkomment billede af din helt, som varer i 18 sekunder. Illusionen gør 28% skade og tager 300% skade.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Anvend: Whoopsie\\n\\nSender din helt 400 enheder frem. Efterlader en ildelugtende sky med en radius på 200 i 3 sekunder, som hæmmer fjender med 30%.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic",
  "ringmaster_ability_strongman_tonic_Description": "Anvend: Forcefully Imbibe\\n\\nØger midlertidigt en allieret helts styrke med 5 + 1,5 per Ringmasters level i 8 sekunder. Effekten var i 4 sekunder og svækkes, indtil den ophører."
}