// 8655.js

{
  "language": "hungarian",
  "international2023_compendium_activity": "Tevékenység Összefoglaló-tulajdonosoknak",
  "international2023_update_title": "A The International 2023 ünneplése",
  "international2023_update_subtitle": "Ebben az e-sport frissítésben a hivatásos játékosok rajongóitól az alkalmi játékosokig mindenkinek van valami.",
  "international2023_update_body": "Akár le se veszed a szemed a The International összes meccsének minden izgalmas másodpercéről, akár arról se nagyon tudsz, hogy van, aki ezzel megélhetésként játszik, és csak békében élvezni akarod a játékot, olvass tovább: van ebben a frissítésben valami neked való.\\n\\nE-sport rajongó vagy? Készítsd el saját felállásod a hivatásosokból a fejlesztett <b>Fantasy Ligával</b>. Inkább az elemzés lelkesít? Merülj el az <b>Oracle Kihívás</b> előrejelzési ágaiban. Talán a nagynénéd játszotta játékok hatalmas rajongója vagy. Na, idén még <b>Bingónk</b> is van!\\n\\nDe lehet, hogy e dolgok egyikéért sem rajongsz. Talán csak saját magad nagy rajongója vagy. Számodra is van valamink: <b>A Profilvitrin</b>. A profilod mostantól önmagad interaktív emlékműve, bemutatva bármilyen tárgyat és eredményt játéktörténetedből, amit csak bele akarsz gyömöszölni.",
  "international2023_update_footer": "Eljutottál a frissítés végéig. Szép munka volt!",
  "international2023_compendium": "Összefoglaló",
  "international2023_compendium_title": "The International 2023 Összefoglaló",
  "international2023_compendium_intro": "Az Összefoglaló az interaktív digitális társad a The International 2023-ig vezető úton és a The International 2023-on.\\n\\nJátssz profiként a TI-ig vezető út kihívás játékkal. Válogasd össze kedvenc játékosaidat egy átdolgozott és frissített Fantasy kihívással. Teszteld előrejelző képességeidet a csoportköri és ágtippekkel. Nyerd meg a főnyereményt a vadonatúj bingótáblákkal.\\n\\nTekintsd az Összefoglalót az eseménnyel kapcsolatos tevékenységek, és az idei év minden eseményközpontú jutalmának összefogójaként. Ráadásul az összes eladás 25%-a hozzájárul a The International 2023 nyereményalapjához.",
  "international2023_showcase_title": "A Profilvitrin",
  "international2023_showcase_subtitle": "Új funkció minden Dota játékosnak",
  "international2023_showcase_intro": "A profil és a miniprofil teljesen át lett tervezve mindenkinek (nos, a több mint 6000 kommunikációs pontszámmal rendelkezők 98%-ának). Mostantól az új profilvitrinnel bemutathatod az összes Dota tárgyadat és eredményedet; szó szerint bármit a Dota raktáradban.\\n\\nSzentélyt akarsz állítani kedvenc hivatásos csapatodnak 2016-ból? Meg tudod tenni. Mit szólnál a kedvenc hősszettjeid gyűjteményéhez? Abszolút meg tudod tenni. Egy-egy pár Kunkka összes elképzelhető cipőjéből? Sajnos, igen. Technikailag ezt is meg tudod tenni.",
  "international2023_showcase_profile_title": "Frissített profil",
  "international2023_showcase_profile_desc": "Te vagy Michaelangelo, a profilod mostantól a vásznad, és csak a képzeleted szab határokat. (És az emberi tisztesség alapvető érzése.)",
  "international2023_showcase_mini_profile_title": "Frissített miniprofil",
  "international2023_showcase_mini_profile_desc": "A miniprofilok nagyon hasonlítanak a profilokhoz, egy döntő különbséggel. Ezt figyeld: kisebbek. A többi játékos akkor látja a miniprofilodat, amikor a nevedre mutat az egérrel.",
  "international2023_showcase_carousel_title": "Minta vitrinek",
  "international2023_showcase_items_title": "Vitrinelemek",
  "international2023_showcase_items_desc": "Szabd testre vitrinjeidet az évek során összegyűjtött minden tárgyad és jutalmad hatalmas választékával.",
  "international2023_showcase_item_heroes_title": "Hősök",
  "international2023_showcase_item_trophies_title": "Trófeák",
  "international2023_showcase_item_stickers_title": "Matricák",
  "international2023_showcase_item_stats_title": "Statisztikák",
  "international2023_showcase_item_chat_wheels_title": "Csevegőkorongok",
  "international2023_showcase_item_sprays_title": "Festések",
  "international2023_showcase_item_items_title": "Fegyvertári tárgyak",
  "international2023_showcase_item_emoticons_title": "Hangulatjelek",
  "international2023_showcase_item_loading_screens_title": "Betöltőképernyők",
  "international2023_showcase_item_couriers_title": "Futárok",
  "international2023_showcase_item_wards_title": "Wardok",
  "international2023_tournament_prize_pool": "Nyereményalap",
  "international2023_tournament_prize_pool_percent": "A The International 2023 Összefoglaló összes eladásának 25%-a hozzájárul a The International 2023 nyereményalapjához.",
  "international2023_tournament_learn_more": "Tudj meg többet a bajnokságról",
  "international2023_quests_title": "Az Internationalig vezető út kihívás",
  "international2023_quests_intro": "Nézted a hivatásosokat. Buzdítottad őket. Most játssz az egyikükként. Csüccsenj le kedvenc hivatásos e-sport játékosaid játékszékébe, és elevenítsd fel legnagyobb pillanataikat a tavalyi évből. Nyerj a hőseikként egy adott meccsről, vagy az öt hős egyikeként, akiket a szezon adott hónapjában használtak. Szerezz pontokat minden kihívásért, és bónuszpontokat teljes kihívássorozatok teljesítéséért.",
  "international2023_quests_match_title": "Meccskihívások",
  "international2023_quests_match_desc": "Nyerj egy valós hivatásos meccs hőseivel.",
  "international2023_quests_pro_title": "Játékoskihívások",
  "international2023_quests_pro_desc": "Nyerj egy hivatásos leggyakrabban választott hősei egyikével.",
  "international2023_quests_rewards_title": "Szerezz jutalmakat",
  "international2023_quests_rewards_desc": "Erősítsd jutalmaidat az út során szerzett Összefoglaló-pontokkal.",
  "international2023_fantasy_title": "Fejlesztett Fantasy",
  "international2023_fantasy_intro": "Válassz csapatot kedvenc hivatásosaidból. Készítsd el a leginkább értékesnek gondolt statisztikákat. Versenyezz játékosokkal szerte a világon a legtöbb pont szerzéséért. Ez az a Dota fantasy liga, amire emlékszel, csak minden tekintetben felújítva.",
  "international2023_fantasy_players_title": "Válassz",
  "international2023_fantasy_players_desc": "Válaszd ki kedvenc alap, közép és támogató játékosodat.",
  "international2023_fantasy_craft_title": "Készíts",
  "international2023_fantasy_craft_desc": "Használd az Összefoglaló jutalmaiddal együtt megszerzett dobásokat, hogy megpróbáld elkészíteni a legjobb statisztikákat a játékosaidnak. Válassz gondosan; egyes statisztikák egyes játékosoknak jobbak, mint másoknak.",
  "international2023_fantasy_compete_title": "Versenyezz",
  "international2023_fantasy_compete_desc": "A bajnokság mindegyik hétvégéje egy külön Fantasy forduló, így több lehetőséged lesz a barátaid és a világ ellen versengeni. Szerezz Összefoglaló-pontokat, és ha a ranglista-helyezésed elég magas, egy egyedi trófeát.",
  "international2023_bingo_title": "Bingó",
  "international2023_bingo_intro": "Kissé izgalomba jössz, valahányszor egy hivatásos csapat Divine Rapiert vesz? Vagy amikor egy meccs meghaladja a 80 percet, és minden kezd kicsit furcsává válni? Hát amikor egy tizenhat lábbal rendelkező hősökből álló csapat egy csupán néggyel rendelkezővel harcol?\\n\\nNos, készülj fel végre készpénzre váltani ezt az izgalmat. Megérkezett a bingó, hogy hasznot húzhass néhány tényleg őrületes eseményből.",
  "international2023_bingo_cards_title": "HÉTVÉGÉNKÉNT EGY BINGÓKÁRTYA",
  "international2023_bingo_cards_desc": "Minden Összefoglaló-tulajdonos egy új, véletlenszerűen generált bingókártyát kap a bajnokság mindegyik hétvégéjére. Ez a kártya tele van furcsa feltételeket és érdekes helyzeteket tartalmazó mezőkkel, amelyekért szoríthatsz, míg a hivatásosok versenyeznek.",
  "international2023_bingo_rewards_title": "Fejezz be sorokat, és pontokat kapsz",
  "international2023_bingo_rewards_desc": "Bizony, ne hagyd, hogy az istenek, démonok és lövöldözhetnék erdei lények rászedjenek; ez attól még bingó, emberek. Amikor befejezel egy teljes sort, oszlopot vagy átlót a bingókártyádon, Összefoglaló-pontokat kapsz jutalmul. Megjegyzés: „BINGÓ!” kiáltása nem kötelező, de javasolt.",
  "international2023_predictions_title": "Az Oracle kihívás",
  "international2023_predictions_intro": "Oracle asztrál-köldökzsinór mágiát használ a jövőbe látáshoz. Hát, nem szívesen romboljuk le az illúzióidat, de köldökzsinór-mágia nem létezik. Éles eszedet, e-sport-tudásodat és legfőképpen a legjobb tippjeidet kell használnod, hogy eredményt érj el.\\n\\nTippeld meg, Oracle-szerűen, de köldökzsinórmentesen, mely csapatok jutnak tovább, és melyek esnek ki az egyes bajnoksághétvégéken. A helyes tippek (akarjuk mondani, Oracle-szerű kinyilatkoztatások) Összefoglaló-pontokat érnek neked.",
  "international2023_predictions_group_stage_title": "Tippeld meg a csoportkört",
  "international2023_predictions_group_stage_desc": "Idei újdonságként próbáld megjósolni a csapatok sorrendjét az egyes csoportokban.",
  "international2023_predictions_ingame_title": "Játékbeli tippek",
  "international2023_predictions_ingame_desc": "Miközben a játékban vagy a Twitchen nézed azokat, teszteld előrejelző képességedet az egyes meccsek kürtszava előtt. Minden helyes tippért Összefoglaló-pontokat kapsz, naponta legfeljebb hatot.",
  "international2023_rewards_title": "Összefoglaló-jutalmak",
  "international2023_rewards_intro": "Ha rajongsz a versengő Dotáért, és azért, ha jutalmat kapsz a versengő Dotáért rajongásért, akkor az idei jutalmak neked valók. A 2023-as Összefoglaló teljes egészében a The International 2023-ra és a Dota hivatásos színterére összpontosít.",
  "international2023_rewards_physical_aegis_title": "Fizikai Égisz modell",
  "international2023_rewards_physical_aegis_desc": "A híres bajnoki díj 1:5 léptékű nikkelötvözet másolata. Tedd közszemlére büszkén! Tedd közszemlére közömbösen! Olvaszd be, és készíts belőle saját fizetőeszközt!",
  "international2023_rewards_chat_wheels_title": "Maradandó csevegőkorongok",
  "international2023_rewards_chat_wheels_desc": "A korábbi évektől eltérően most minden csevegőkorong maradandó. Ahogy a címben is mondtuk. Igen, ez a szöveg kissé önismétlőnek érződik. De jó még egy kis időt veled tölteni.",
  "international2023_rewards_stickers_title": "Játékos- és csapatmatricák",
  "international2023_rewards_stickers_desc": "„Csak csapatmatricák?” El se olvastad a címet, ugye? Játékosmatricákat is kapsz. Őszintén szólva, ezek a bekezdések csak a csomagológranulátum, aminek célja a címsor védelme a szemgolyóidhoz szállítás során.",
  "international2023_rewards_hud_title": "The International 2023 HUD",
  "international2023_rewards_hud_desc": "Az a legutóbbi bekezdés talán elriasztotta az embereket ennek az elolvasásától. Szóval ha még itt vagy: okos húzás volt. Ez teszt volt, és te átmentél. Mert itt van némi infó, amit a cím nem tartalmazott: az új HUD egyedi tervezésű, az idei ólomüveg téma használatával.",
  "international2023_rewards_loading_screens_title": "Betöltőképernyők",
  "international2023_rewards_loading_screens_desc": "Minden csapathoz kapni fogsz egy egyedi, ólomüveg témájú betöltőképernyőt, valamint néhány alapgrafikát az idei TI-ről.",
  "international2023_rewards_materials_title": "Fantasy és a TI-ig vezető út kihívás erősítések",
  "international2023_rewards_materials_desc": "Használj egyedi eszközöket jobb játékosok készítéséhez a Fantasy kihívásban, vagy küzdd át magad kimondottan kemény tartalmon a TI-ig vezető út kihívásban.",
  "international2023_rewards_teleport_fx_title": "Kedvenc csapat teleport-effektek",
  "international2023_rewards_teleport_fx_desc": "Mutasd meg kedvenc csapatodat a játékban az egyedi teleport-effektekkel három különböző szinten.",
  "international2023_rewards_Types_title": "Jutalomfajták",
  "international2023_rewards_Types_desc": "Mindegyik jutalomfajtának saját haladásmérője van. Amikor a mérő megtelik, fel tudod venni azt a jutalmat. Egyes mérőket annyiszor újra tudsz tölteni, ahányszor akarod, míg mások csak bizonyos számú alkalommal tölthetők újra.",
  "international2023_rewards_Levels_title": "Összefoglaló-szintek",
  "international2023_rewards_Levels_desc": "Szerezz Összefoglaló-szinteket Összefoglaló-tevékenységekben részt véve, vagy szintcsomagok vásárlásával. Alkalmazd a szinteket az ÖSSZES jutalomfajta haladásmérőjének növeléséhez.",
  "international2023_rewards_Boosters_title": "Bónuszok",
  "international2023_rewards_Boosters_desc": "A bónuszok olyanok, mint az Összefoglaló-szintek, de egy konkrét jutalom növelésére. Bónusz alkalmazása egy jutalomra a Gyűjtők Égisze felé haladáshoz is hozzájárul.",
  "international2023_supporters_clubs_title": "Támogatói klubok",
  "international2023_supporters_clubs_subtitle": "Támogasd közvetlenül a kedvenc csapataidat",
  "international2023_supporters_clubs_intro": "A támogatói klubjutalmak olyanok, mint az ifjúság örömei; élvezd őket, amíg teheted, mert mulandóak. Vagy legalábbis azok voltak. Mostantól maradandóak! Így most már örökké élvezheted őket! Hacsak el nem üt egy busz.\\n\\nÉs ami még jobb: az összes eladás 50%-a közvetlenül a csapathoz kerül. Hát, legalábbis még jobb nekik. Az előző része az, ami neked jobb.",
  "international2023_supporters_clubs_tiers_title": "A támogatás három szintje",
  "international2023_supporters_clubs_tiers_desc": "Válassz bronz, ezüst vagy arany támogatást kedvenc csapataidnak, hogy maguk a csapatok által tervezett jutalmakat szerezz.",
  "international2023_talent_title": "Közreműködő-matricák",
  "international2023_talent_subtitle": "Támogasd közvetlenül a kedvenc közreműködődet",
  "international2023_talent_intro": "Az élő e-sport közvetítés kemény munka. Azért nyilván nem szénbányászás nehézségű. De nehezebb, mint kötni valamit az Etsy-re. Jó, nyilván nem, mint bármit kötni. Néhány olyan színes horgolt kardigán igen bonyolultnak tűnik.\\n\\nMostantól üzenetet tudsz küldeni kedvenc közreműködődnek: „Üdv… Tisztelem, amit csinálsz. Nem annyira, mint egy bányászt, de jobban, mint az Etsy-alkotók legalább 50%-át.” Ha már 50%-ról beszélünk, a közreműködő-matricákból származó minden bevétel fele közvetlenül a közreműködőhöz megy.",
  "international2023_talent_tiers_title": "Válaszd ki a szintedet",
  "international2023_talent_tiers_desc": "Vásárolj a kedvenc közreműködődet bemutató jutalomcsomagokat. A csomagok matricák, hangminták és autogramok kombinációját tartalmazzák a megvásárolt csomag szintjétől függően.",
  "international2023_talent_coming_soon": "A közreműködő-csomagok a közreműködők bejelentése után lesznek megvásárolhatók.",
  "international2023_coming_soon": "Hamarosan érkezik",
  "ti12_bp_countdown_header": "a csoportkörig",
  "ti12_bp_countdown_desc": "Nézd az év legnagyobb e-sport bajnokságának élő közvetítését Seattle-ből, ahol a Bajnokok Égisze a tét.",
  "ti12_bp_tournament_complete_desc": "Éld át újra az év legnagyobb e-sport-bajnokságának izgalmát; az összes akciót Seattle-ből, egyetlen kattintással.",
  "ti12_group_stage_venue": "Online",
  "ti12_playoffs_venue": "Seattle Convention Center",
  "ti12_main_event_venue": "Climate Pledge Arena",
  "ti12_compendium_small_header": "Támogasd a bajnokságot",
  "ti12_compendium_header": "The International 2023 Összefoglaló",
  "ti12_compendium_desc": "Oldj fel még többet a bajnoksági szezonból a The International 2023 Összefoglalóval. Játssz hivatásosként a TI-ig vezető út kihíváson. Készíts felállást kedvenc hivatásosaidból az újratervezett Fantasyvel. Teszteld előrejelző képességeidet az Oracle Kihívással. És reméld, hogy a csapatok csinálnak néhány fura dolgot a vadonatúj Bingó funkcióhoz.\\n\\nSzerezz olyan jutalmakat, mint a játékosmatricák, csapatmatricák, csevegőkorongok, egy egyedi HUD és sok más, egészen az Égisz valódi másolatáig.\\n\\nAz összes Összefoglaló-eladás 25% -a közvetlenül a The International nyereményalapjába megy.",
  "ti12_compendium_standard": "Alap Összefoglaló",
  "ti12_compendium_upgraded": "Fejlesztett Összefoglaló"
}