// 6761.js

{
  "language": "brazilian",
  "ringmastercomic_title_cover": "O Boneco — Capa",
  "ringmastercomic_title": "O Boneco — Página %1$s",
  "ringmastercomic_help_text": "Clique na imagem ou use a barra de espaço para avançar",
  "ringmastercomic_return_button": "Retornar à capa",
  "ti13_online": "Copenhague",
  "ti13_main_event_venue": "Royal Arena — Copenhague",
  "ti13_best_of_three": "Melhor de três",
  "ti13_best_of_five": "Melhor de cinco",
  "ti13_group_stage_sp_rules": "Fase de grupos — Regras de prioridade de seleção",
  "ti13_group_stage_sp_game1": "Cara ou coroa.",
  "ti13_group_stage_sp_game2": "Primeira partida: a vencedora do cara e coroa escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_group_stage_sp_game3": "Segunda partida: a perdedora do cara e coroa escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_group_stage_sp_game4": "Terceira partida (se aplicável): novo cara e coroa. A vencedora do cara e coroa escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_group_stage_tie_rules": "Fase de grupos — Regras de desempate",
  "ti13_first_second_tie": "Duas equipes estão empatadas pelos 1º e 2º lugares",
  "ti13_second_third_tie": "Duas equipes estão empatadas pelos 2º e 3º lugares",
  "ti13_third_fourth_tie": "Duas equipes estão empatadas pelos 3º e 4º lugares",
  "ti13_three_way_first_tie": "Três equipes estão empatadas pelo 1º lugar",
  "ti13_three_way_second_tie": "Três equipes estão empatadas pelo 2º lugar",
  "ti13_four_way_tie": "Quatro equipes estão empatadas pelo 1º lugar",
  "ti13_tie_resolve_bo3": "Desempate em uma melhor de três.",
  "ti13_tie_resolve_third_fourth": "Nenhuma outra partida é jogada. As duas equipes continuam empatadas pelos 3º e 4º lugares.",
  "ti13_tie_resolve_first_with_round_robin": "O 1º lugar é desempatado em pontos corridos com confrontos de partida única, até uma equipe vencer duas vezes.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Continuar jogando até todas as equipes terem enfrentado uma a outra pelo menos uma vez. Usar os resultados dos pontos corridos mais recentes para decidir os 2º e 3º lugares.",
  "ti13_tie_resolve_second_with_round_robin": "O 2º lugar é desempatado em pontos corridos com confrontos de partida única, até uma equipe vencer duas vezes.",
  "ti13_tie_resolve_third_fourth_other": "Nenhuma outra partida é jogada. As duas outras equipes continuam empatadas pelos 3º e 4º lugares.",
  "ti13_tie_resolve_four_way_1": "Parear as equipes aleatoriamente. Para os propósitos destas regras, denominar as equipes como A, B, C e D.",
  "ti13_tie_resolve_four_way_2": "As equipes A e B disputam uma partida única. As equipes C e D disputam uma partida única.",
  "ti13_tie_resolve_four_way_3": "O 1º lugar é decidido em uma partida única entre as vencedoras dos confrontos AxB e CxD.",
  "ti13_tie_resolve_four_way_4": "O 4º lugar é decidido em uma partida única entre as perdedoras dos confrontos AxB e CxD.",
  "ti13_tie_resolve_four_way_5": "Os 2º e 3º lugares são decididos em uma partida única entre as equipes restantes.",
  "ti13_seeding_decider_sp_rules": "Decisão de chaveamento — Regras de prioridade de seleção",
  "ti13_seeding_decider_sp_rules_1": "Primeira partida: a equipe que mais pontuou na fase de grupos escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_seeding_decider_sp_rules_2": "Segunda partida: a equipe que menos pontuou na fase de grupos escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_seeding_decider_sp_rules_3": "Terceira partida (se aplicável): a equipe que mais pontuou na fase de grupos escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules": "Mata-mata e International — Regras de prioridade de seleção",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Cara ou coroa.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "Primeira partida: a vencedora do cara e coroa escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "Segunda partida: a perdedora do cara e coroa escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Terceira partida (se aplicável): novo cara e coroa. A vencedora do cara e coroa escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "Primeira partida: a vencedora da chave superior escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "Segunda partida: a vencedora da chave inferior escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Terceira partida: a vencedora da chave superior escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Quarta partida (se aplicável): a vencedora da chave inferior escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Quinta partida (se aplicável): cara e coroa. A vencedora do cara e coroa escolhe entre definir a ordem na fase de seleção ou o lado do mapa.",
  "international2024_update_title": "TI 2024, Mestre Circense e o compêndio",
  "ringmaster_hype": "\"Liches e Linas, Slarks e Marcis, vítimas de todas as idades! O momento pelo qual todos vocês aguardavam finalmente chegou.\\n\\n Pelo que parece um ano, eu era um mero nome proferido em sussurros abafados; uma sombra à espreita por trás de uma cortina carmesim. Mas agora, finalmente (eu que o diga), os imbecis responsáveis por este visual foram capazes de me permitir abençoar todos vocês com a minha magnificência, e tomar o meu humilde lugar de destaque nos holofotes!\\n\\n Sou eu, Cogliostro Kettle — mestre malévolo! Anunciante sombrio dos condenados! O primeiro e único MESTRE CIRCENSE! E eu tenho alguns truques nas mangas!\"",
  "ringmaster_comic": "\"Não acredita na minha palavra? Que tal ler uma história em quadrinhos sobre como cheguei aqui, narrada por um anônimo confiável?\"",
  "ringmaster_comic_title": "O Boneco",
  "ringmaster_comic_desc": "Leia sobre a origem do Mestre Circense como parte do Circo Mecânico dos Kettle.",
  "ringmaster_guide": "\"Fui convidado a guiar você pelo compêndio deste ano — uma oferta que aceitei com gratidão. Afinal, temos que nos conhecer melhor! [b]Vamos lá, então?[/b]\"",
  "ringmaster_introducing": "Apresentando o",
  "ringmaster_hero_detail_button": "Acesse a página de detalhes do herói",
  "ringmaster_play_trailer_button": "Assistir ao trailer",
  "ringmaster_comic_button": "Leia a HQ",
  "international2024_compendium": "Compêndio",
  "international2024_compendium_title": "Compêndio do International 2024",
  "international2024_effigies_title": "EFÍGIES HEROICAS",
  "international2024_effigies_subtitle": "Um recurso aprimorado e gratuito",
  "international2024_effigies_intro": "\"Houve uma época, meus amigos, não muito tempo atrás, em que essas grandes efígies eram avistamentos raros! Mas isso já passou! Agora, há um monumento para cada titã prestes a entrar no campo de batalha, seja ele o Mestre Circense ou os demais heróis inferiores!\"",
  "international2024_effigies_desc": "As efígies são estátuas articuláveis dos seus heróis favoritos para colocar na sua base. Em vez de compartilharem um único compartimento global, agora cada herói tem o seu próprio compartimento de efígie no arsenal.\\n\\nVocê pode usar a nova efígie padrão de qualquer herói, ou criar e equipar a sua própria.",
  "international2024_purchase_intro": "\"Deuses e monstros, guerreiros e criaturas, venham e deleitem-se com uma [b]incrível seleção de recompensas por partidas, eventos e eSports[/b] neste lado do rio! Teste os seus conhecimentos, a sua sorte e coragem em comemoração ao maior evento de eSports deste reino ou qualquer outro!\"",
  "international2024_activities": "O que está incluso?",
  "international2024_activities_subtitle": "Encantos e provas de sorte e destreza para todas as idades ",
  "international2024_activities_intro": "\"Ao contrário do seu sensato mestre de cerimônias, eu ouvi dizer que alguns de vocês precisam de MOTIVOS para matar. Então, cada partida que você disputar valerá pontos, colega! Quanto mais jogar, mais ganhará — então se mande para as trilhas e veja os seus pontos aumentarem!\"",
  "international2024_activities_play_title": "Jogue Dota e ganhe pontos",
  "international2024_activities_play_desc": "Neste ano, você ganhará pontos no desafio semanal por praticamente todas as partidas que jogar. E a primeira vitória do dia concede pontos adicionais.",
  "international2024_activities_fantasy_title": "Dota dos Sonhos",
  "international2024_activities_fantasy_desc": "Dispute contra amigos e jogadores de Dota do mundo todo. Monte uma equipe dos sonhos com os seus profissionais favoritos e fabrique cartas personalizadas com atributos que aumentam os seus pontos.",
  "international2024_activities_oracles_title": "Desafio do Oráculo",
  "international2024_activities_oracles_desc": "Preveja quais equipes avançarão e quais cairão, e deleite-se na precisão da sua vidência (desde que acerte).",
  "international2024_activities_bingo_title": "Bingo",
  "international2024_activities_bingo_desc": "Obtenha cartelas de bingo geradas aleatoriamente para cada fase do torneio, recheadas de condições inusitadas e situações interessantes.",
  "international2024_activities_outro": "\"Lembre-se! A vitória não é a única recompensa! Sempre que tiver êxito em uma destas atividades, você ganhará pontos! Visite a barraca de prêmios abaixo para descobrir o que pode obter em troca deles!\"",
  "international2024_rewards_title": "Recompensas do compêndio",
  "international2024_rewards_subtitle": "Venha maravilhar-se com estes brindes",
  "international2024_rewards_intro": "\"Empilhe os corpos e obtenha prêmios! E não é QUALQUER prêmio! Não falo do prêmio de estrangular um herói infeliz e arrancar-lhe a vida, e sim o que vem DEPOIS!\"",
  "international2024_rewards_physical_aegis_title": "Modelo físico da Égide",
  "international2024_rewards_physical_aegis_desc": "Preencha o buraco em forma de Égide na sua prateleira e no seu coração com uma réplica de liga de níquel em escala 1:5 do famoso troféu.",
  "international2024_rewards_hud_title": "Interface do International 2024",
  "international2024_rewards_hud_desc": "Embeleze as suas partidas com o espírito circense. Renovamos a interface com o tema do TI deste ano.",
  "international2024_rewards_versus_title": "Tela de combate de 2024",
  "international2024_rewards_versus_desc": "Refresque o seu aquecimento antes das partidas com uma tela de combate personalizada compatível com o novo compartimento de efígies.",
  "international2024_rewards_chat_wheels_title": "Mensagens sonoras permanentes",
  "international2024_rewards_stickers_title": "Adesivos de jogadores e equipes",
  "international2024_rewards_loading_screens_title": "Telas de carregamento",
  "international2024_rewards_materials_title": "Poderes do Dota dos Sonhos e bingo",
  "international2024_rewards_teleport_fx_title": "Efeitos de teletransporte da equipe favorita",
  "international2024_rewards_effigy_title": "Bloco da Efígie de 2024",
  "international2024_supporters_clubs_title": "Apoie a comunidade",
  "international2024_supporters_clubs_subtitle": "Pacotes de personalidade e Sócio-Torcedor",
  "international2024_supporters_clubs_intro": "\"Estimados benfeitores! Filantropos de todas as idades! Humildes patronos das artes da carnificina e adjacentes! 50% da sua generosidade magnânima será destinada às suas equipes e personalidades favoritas! Quem é o verdadeiro herói aqui? Eu, é claro! Batendo as as minhas enormes palmas heroicas para VOCÊ!\"",
  "international2024_supporters_clubs_tiers_title": "Clubes do Suporte-Torcedor",
  "international2024_supporters_clubs_tiers_desc": "Escolha fazer parte do Clube Bronze, Prata ou Ouro das suas equipes favoritas para ganhar recompensas criadas por elas.",
  "international2024_talent_tiers_title": "Pacotes de adesivo de personalidades",
  "international2024_talent_tiers_desc": "Compre pacotes de recompensas das suas personalidades favoritas. Os pacotes podem incluir adesivos, mensagens sonoras e autógrafos dependendo do nível comprado.",
  "ti13_compendium_small_header": "Apoie o torneio",
  "ti13_compendium_header": "Compêndio do International 2024",
  "ti13_compendium_desc": "O compêndio é o seu companheiro digital interativo para o International. Ele é a sua central de atividades, desafios e todas as recompensas relacionadas ao evento deste ano. Além disso, 25% de todas as vendas serão destinadas à premiação total do International 2024.",
  "ti13_compendium_bp_btn": "Acessar site",
  "ti13_compendium_standard": "Compêndio básico",
  "ti13_compendium_standard_subtitle": "Todos os recursos e atividades",
  "ti13_compendium_upgraded": "Compêndio aprimorado",
  "ti13_compendium_upgraded_subtitle": "Todos os recursos e atividades + recompensas mais cedo",
  "ti13_compendium_purchase_tp_fx": "Efeito de teletransporte do TI 2024 I",
  "ti13_compendium_purchase_boosters_footnote": "Impulsionadores podem destravar conteúdos adicionais da sua escolha",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Impulsionadores podem destravar a interface do International 2024, ou conteúdos adicionais da sua escolha",
  "ti13_compendium_purchase_levels": "%1$s níveis do compêndio",
  "ti13_compendium_purchase_booster_levels": "%1$s impulsionadores",
  "ti13_compendium_purchase_discount": "Economize %1$s% em níveis",
  "ti13_compendium_purchase_earn_the_following": "Os níveis do compêndio destravarão:",
  "ti13_compendium_contribution": "25% de todas as vendas será destinado à premiação total do International 2024.",
  "ti13_compendium_purchase_all_access": "Acesso a todos os recursos do compêndio",
  "ti13_compendium_purchase_aegis_emoticon": "Emoticon da Égide",
  "ti13_compendium_purchase_bingo_tokens": "%1$s fichas do bingo",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s fichas de renovação do Dota dos Sonhos",
  "ti13_compendium_purchase_one_player_sticker": "1 Cápsula de Adesivos de Jogadores",
  "ti13_compendium_purchase_player_stickers": "%1$s Cápsulas de Adesivos de Jogadores",
  "ti13_compendium_purchase_team_stickers": "%1$s Cápsulas de Adesivos de Equipes",
  "ti13_compendium_purchase_effigy_blocks": "%1$s Blocos de Efígie do TI 2024",
  "ti13_compendium_purchase_team_loading_screens": "%1$s tesouros de telas de carregamento de equipes",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s tesouros de telas de carregamento do TI",
  "international2024_tournament_learn_more": "Saiba mais sobre o torneio",
  "ringmaster_abilities_heading": "Habilidades",
  "ringmaster_souvenirs_heading": "Lembrancinhas",
  "ringmaster_ability_tame_the_beasts": "Domar as Feras",
  "ringmaster_ability_tame_the_beasts_Description": "Canalizada — O Mestre Circense gira o seu chicote e o estala. Inimigos chicoteados sofrem dano e fogem com medo do mestre. O tempo de canalização aumenta exponencialmente o dano e a duração do amedrontamento, mas reduz o raio.",
  "ringmaster_ability_the_box": "Escapismo",
  "ringmaster_ability_the_box_Description": "O Mestre Circense prende a si mesmo ou um herói aliado dentro de uma caixa móvel extradimensional. A unidade encaixotada ganha movimentação desobstruída, resistência a retardos, resistência mágica e velocidade de movimento adicionais. Ela também se torna inalvejável, calada, silenciada e desarmada. A caixa será aberta caso o efeito termine ou após o herói se mover para além do alcance.",
  "ringmaster_ability_impalement": "Arremesso de Facas",
  "ringmaster_ability_impalement_Description": "O Mestre Circense lança uma das suas facas na direção alvejada. Caso atinja um inimigo, a faca causa dano de impacto, breve retardo e causa uma porcentagem da vida máxima da vítima como dano por segundo.",
  "ringmaster_ability_wheel": "Roda a Roda",
  "ringmaster_ability_wheel_Description": "O Mestre Circense Roda a Roda na direção-alvo, empurrando os inimigos pelo caminho. Ao chegar ao ponto-alvo, os inimigos no alcance da roda sofrem dano com o tempo e retardo. Os inimigos que encararem a roda por mais de 0,5s são hipnotizados e andam em direção a ela. O primeiro inimigo hipnotizado ativa uma contagem regressiva para a explosão da roda. Caso a contagem regressiva não seja ativada, ela explodirá automaticamente após 8 segundos.",
  "ringmaster_ability_spotlight": "Holofote",
  "ringmaster_ability_spotlight_Description": "O Mestre Circense acende um holofote que varre uma área. Os inimigos sob a luz têm uma chance de errar os seus ataques e são revelados caso estejam invisíveis. Ilusões atingidas pela luz começam a desaparecer, perdendo uma porcentagem de vida máxima a cada segundo.",
  "ringmaster_ability_dark_carnival_trinkets": "Circo Sombrio",
  "ringmaster_ability_dark_carnival_trinkets_Description": "O Mestre Circense recebe aleatoriamente uma Lembrancinha do Circo Sombrio de uso único sempre que um herói inimigo morrer na proximidade. Lembrancinhas adicionais são guardadas como cargas. Caso o Mestre Circense não tenha uma Lembrancinha ao renascer, ele receberá uma. As lembrancinhas podem ser: Espelho Mágico, Tônico Fortalecedor ou Almofada Travessa.",
  "ringmaster_ability_funhouse_mirror": "Espelho Mágico",
  "ringmaster_ability_funhouse_mirror_Description": "Usar: Distorção de Proporção\\n\\nCria 1 imagem imperfeita do seu herói que dura 18 segundos. Essa ilusão causa 28% e sofre 300% de dano.",
  "ringmaster_ability_whoopee_cushion": "Almofada Travessa",
  "ringmaster_ability_whoopee_cushion_Description": "Usar: Propumsão\\n\\nEmpurra o seu herói 400 unidades para a frente. Deixa para trás uma nuvem fedorenta com 200 unidades de raio e 3 segundos de duração, retardando inimigos em 30%.",
  "ringmaster_ability_strongman_tonic": "Tônico Fortalecedor",
  "ringmaster_ability_strongman_tonic_Description": "Usar: Beber à Força\\n\\nAumenta temporariamente a Força de um herói aliado em 5 + 1,5 para cada nível do Mestre Circense. O efeito dura 8 segundos, mas começa a se deteriorar a partir de 4s."
}