// 3035.js

{
  "language": "turkish",
  "ringmastercomic_title_cover": "Kukla - Kapak",
  "ringmastercomic_title": "Kukla - %1$s. sayfa",
  "ringmastercomic_help_text": "İLERLEMEK İÇİN RESME TIKLAYIN VEYA BOŞLUK TUŞUNU KULLANIN",
  "ringmastercomic_return_button": "Kapak sayfasına dön",
  "ti13_online": "Kopenhag",
  "ti13_main_event_venue": "Royal Arena - Kopenhag",
  "ti13_best_of_three": "Üç Maçlık",
  "ti13_best_of_five": "Beş Maçlık",
  "ti13_group_stage_sp_rules": "Grup Aşaması - Seçim Önceliği Kuralları",
  "ti13_group_stage_sp_game1": "Yazı Tura.",
  "ti13_group_stage_sp_game2": "İlk Oyun: Yazı turanın kazananı, kahraman seçimini veya harita tarafını belirler.",
  "ti13_group_stage_sp_game3": "İkinci Oyun: Yazı turanın kaybedeni, kahraman seçimini veya harita tarafını belirler.",
  "ti13_group_stage_sp_game4": "Üçüncü Oyun (Varsa): Yeni Yazı Tura. Yeni yazı turanın kazananı, kahraman seçimini veya harita tarafını belirler.",
  "ti13_group_stage_tie_rules": "Grup Aşaması - Eşitlik Bozma Maçı Kuralları",
  "ti13_first_second_tie": "İki takım birinciliği ve ikinciği paylaşıyor",
  "ti13_second_third_tie": "İki takım ikinciliği ve üçüncülüğü paylaşıyor",
  "ti13_third_fourth_tie": "İki takım üçüncülüğü ve dördüncülüğü paylaşıyor",
  "ti13_three_way_first_tie": "Üç takım birinciliği paylaşıyor",
  "ti13_three_way_second_tie": "Üç takım ikinciliği paylaşıyor",
  "ti13_four_way_tie": "Dört takım birinciliği paylaşıyor",
  "ti13_tie_resolve_bo3": "Üç maçlık bir oyunla belirlenir.",
  "ti13_tie_resolve_third_fourth": "Başka maç yapılmaz. İki takım üçüncülüğü ve dördüncülüğü paylaşır.",
  "ti13_tie_resolve_first_with_round_robin": "Birinciliği belirlemek için, bir takım iki kez kazanana kadar sıralı mücadele formatında tek maçlık bir oyun oynanır.",
  "ti13_tie_resolve_second_and_third_place_bo1": "Maçlar, tüm takımlar birbirleriyle en az bir kez oynayana kadar devam eder. Son sıralı mücadele sonuçlarıyla, ikincilik ve üçüncülük belirlenir.",
  "ti13_tie_resolve_second_with_round_robin": "İkinciliği belirlemek için, bir takım iki kez kazanana kadar sıralı mücadele formatında tek maçlık bir oyun oynanır.",
  "ti13_tie_resolve_third_fourth_other": "Başka maç yapılmaz. Diğer iki takım üçüncülüğü ve dördüncülüğü paylaşır.",
  "ti13_tie_resolve_four_way_1": "Takımlar rastgele eşleştirilir. Kuralları açıklamak için takımlar \"A Takımı\", \"B Takımı\", \"C Takımı\" ve \"D Takımı\" olarak anılacaktır.",
  "ti13_tie_resolve_four_way_2": "A Takımı tek maçlık bir oyunda B Takımı ile karşılaşır. C Takımı tek maçlık bir oyunda D Takımı ile karşılaşır.",
  "ti13_tie_resolve_four_way_3": "Birinciliği belirlemek için, A/B maçının galibi ile C/D maçının galibi arasında tek maçlık bir oyun oynanır.",
  "ti13_tie_resolve_four_way_4": "Dördüncülüğü belirlemek için, A/B maçının kaybedeni ile C/D maçının kaybedeni arasında tek maçlık bir oyun oynanır.",
  "ti13_tie_resolve_four_way_5": "İkinciliği ve üçüncülüğü belirlemek için, kalan takımlar arasında tek maçlık bir oyun oynanır.",
  "ti13_seeding_decider_sp_rules": "Dağılım Kararı - Seçim Önceliği Kuralları",
  "ti13_seeding_decider_sp_rules_1": "İlk Oyun: Grup aşamasında en yüksek sıradaki takım, kahraman seçimini veya harita tarafını belirler.",
  "ti13_seeding_decider_sp_rules_2": "İkinci Oyun: Grup aşamasında en düşük sıradaki takım, kahraman seçimini veya harita tarafını belirler.",
  "ti13_seeding_decider_sp_rules_3": "Üçüncü Oyun (Varsa): Grup aşamasında en yüksek sıradaki takım, kahraman seçimini veya harita tarafını belirler.",
  "ti13_playoffs_and_ti_sp_rules": "Elemeler ve The International - Seçim Önceliği Kuralları",
  "ti13_playoffs_and_ti_sp_rules_bo3_1": "Yazı Tura.",
  "ti13_playoffs_and_ti_sp_rules_bo3_2": "İlk Harita: Yazı turanın kazananı, kahraman seçimini veya harita tarafını belirler.",
  "ti13_playoffs_and_ti_sp_rules_bo3_3": "İkinci Harita: Yazı turanın kaybedeni, kahraman seçimini veya harita tarafını belirler.",
  "ti13_playoffs_and_ti_sp_rules_bo3_4": "Üçüncü Harita (Varsa): Yeni Yazı Tura. Yeni yazı turanın kazananı, kahraman seçimini veya harita tarafını belirler.",
  "ti13_playoffs_and_ti_sp_rules_bo5_1": "İlk Harita: Üst grubun kazananı, kahraman seçimini veya harita tarafını belirler.",
  "ti13_playoffs_and_ti_sp_rules_bo5_2": "İkinci Harita: Alt grubun kazananı, kahraman seçimini veya harita tarafını belirler.",
  "ti13_playoffs_and_ti_sp_rules_bo5_3": "Üçüncü Harita: Üst grubun kazananı, kahraman seçimini veya harita tarafını belirler.",
  "ti13_playoffs_and_ti_sp_rules_bo5_4": "Dördüncü Harita (Varsa): Alt grubun kazananı, kahraman seçimini veya harita tarafını belirler.",
  "ti13_playoffs_and_ti_sp_rules_bo5_5": "Beşinci Harita (Varsa): Yazı Tura. Yazı turanın kazananı, kahraman seçimini veya harita tarafını belirler.",
  "international2024_update_title": "TI 2024, Ringmaster ve Dergi",
  "ringmaster_hype": "\"Lich'ler ve Lina'lar, Slark'lar ve Marci'ler, her yaştan kurbanlar! Hepinizin beklediği an nihayet geldi.\\n\\n Yaklaşık bir yıldır sadece ismen var oldum ve fısıltılarla anıldım. Kırmızı perdenin ardında gizlenen bir gölgeydim. Sonunda, uzun (bana sorarsanız fazla uzun) bir bekleyişin ardından, bu kuruluştan sorumlu olan embesiller nihayet sizi ihtişamımla kutsamama ve sahne ışıklarının altında naçizane yerimi almama izin verdiler!\\n\\n Ben Cogliostro Kettle, şeytani usta! Lanetlilerin kara habercisi! Tek ve yegâne RINGMASTER! Sizin için birkaç numaram var!\"",
  "ringmaster_comic": "\"Ama bana inanmak zorunda değilsiniz! İsterseniz bir çizgi roman okuyarak trajik doğuş ​​hikâyemi güvenilir, isimsiz bir anlatıcıdan öğrenebilirsiniz.\"",
  "ringmaster_comic_title": "Kukla",
  "ringmaster_comic_desc": "Ringmaster'ın Osbert Kettle'ın Saat Gibi Sirki'ndeki geçmiş yaşantısı hakkında bilgi edinin.",
  "ringmaster_guide": "\"Bu yılın dergisi için size rehberlik etmem istendi ve bu teklifi memnuniyetle kabul ettim. Sonuçta birbirimizi daha iyi tanımalıyız! [b]Lafı uzatmadan başlayalım![/b]\"",
  "ringmaster_introducing": "Karşınızda",
  "ringmaster_hero_detail_button": "Kahraman Sayfasını Görüntüle",
  "ringmaster_play_trailer_button": "Fragmanı Oynat",
  "ringmaster_comic_button": "ÇİZGİ ROMANI OKU",
  "international2024_compendium": "Dergi",
  "international2024_compendium_title": "The International 2024 Dergisi",
  "international2024_effigies_title": "HER KAHRAMAN İÇİN HEYKEL",
  "international2024_effigies_subtitle": "Herkes İçin Ücretsiz Geliştirilmiş Özellik",
  "international2024_effigies_intro": "\"Dostlarım, çok da uzun olmayan bir süre önce, bu görkemli heykellerin son derece nadir olduğu bir zaman vardı! Artık öyle değil! Artık ister Ringmaster, ister diğer alt düzey kahramanlar olsun, savaş alanına giren her titanı bir anıt bekliyor!\"",
  "international2024_purchase_intro": "\"Tanrılar ve canavarlar, yaratıklar ve varlıklar yaklaşın ve nehrin bu yakasındaki [b]en heyecan verici oyun, etkinlik ve e-spor ödül koleksiyonunun[/b] tadını çıkarın! Bu diyarın ve ötesinin en büyük e-spor etkinliğini kutlarken zekânızı, şansınızı ve cesaretinizi sınayın!\"",
  "international2024_activities": "ALACAĞINIZ ÖDÜLLER",
  "international2024_activities_subtitle": "ŞANS, BECERİ VE EĞLENCEYİ BİRLEŞTİREN HER YAŞA UYGUN OYUNLAR ",
  "international2024_activities_intro": "\"Benim gibi tamamen aklı başında olan bir tören ustasının aksine, bazılarınızın öldürmek için bir SEBEBE ihtiyacı olduğunu duydum. Bu nedenle katıldığınız her oyun size puan kazandıracak! Ne kadar çok oynarsanız o kadar çok kazanırsınız. Savaş alanına girin ve puanlarınızı biriktirmeye başlayın!\"",
  "international2024_activities_play_title": "Dota Oynayın: Puan Kazanın",
  "international2024_activities_play_desc": "Bu sene Haftalık Mücadele'de oynadığınız neredeyse her maç için puan alacaksınız. Ayrıca her günün ilk galibiyetinde fazladan puan kazanacaksınız.",
  "international2024_activities_fantasy_title": "FANTEZİ",
  "international2024_activities_fantasy_desc": "Arkadaşlarınızla ve dünyanın her yerindeki Dota oyuncularıyla yarışın. En sevdiğiniz profesyonel oyuncuları seçerek Fantezi takımınızı oluşturun ve daha fazla puan kazanmak için özel kartlar hazırlayın.",
  "international2024_activities_oracles_title": "Oracle'ın Mücadelesi",
  "international2024_activities_oracles_desc": "Hangi takımların yükseleceğini, hangilerinin eleneceğini tahmin edin ve doğru tahminleriniz için puan kazanın.",
  "international2024_activities_bingo_title": "BİNGO",
  "international2024_activities_bingo_desc": "Turnuvanın her aşaması için tuhaf koşullar ve ilginç durumlar içeren karelerle dolu, rastgele oluşturulmuş bir bingo kartı alın.",
  "international2024_activities_outro": "\"Unutmayın! Kazanmak başlı başına bir ödül değildir! Bu etkinliklerde başarılı olduğunuzda puan kazanacaksınız! Puanlarınızla hangi hediyeleri alabileceğinizi öğrenmek için aşağıdaki ödül bölümüne gidin!\"",
  "international2024_rewards_title": "DERGİ ÖDÜLLERİ",
  "international2024_rewards_subtitle": "GELİN VE BU ÖDÜLLERE BİR GÖZ ATIN",
  "international2024_rewards_intro": "\"Cesetleri üst üste yığın ve ödüllerinizi alın! Sizi NE ödüller bekliyor! Bir kahramanın gırtlağına sarılmışken, ölüm anında çaresiz bakışlarını izlemekten bahsetmiyorum. Bu KENDİ BAŞINA bir ödül! Bundan SONRA gelecek ödüllerden bahsediyorum!\"",
  "international2024_rewards_physical_aegis_title": "FİZİKSEL AEGIS MODELİ",
  "international2024_rewards_physical_aegis_desc": "Rafınızdaki ve kalbinizdeki Aegis şeklindeki boşluğu, ünlü şampiyonluk ödülünün 1/5 ölçekli nikel alaşımlı kopyasıyla doldurun.",
  "international2024_rewards_hud_title": "THE INTERNATIONAL 2024 GÖSTERGE PANELİ",
  "international2024_rewards_hud_desc": "Oyun içi arayüzünüzü sirk ruhuyla süsleyin. Göstergeyi bu yılki TI temasına göre yeniledik.",
  "international2024_rewards_versus_title": "2024 Kapışma Ekranı",
  "international2024_rewards_chat_wheels_title": "Kalıcı Sohbet Çarkları",
  "international2024_rewards_stickers_title": "Oyuncu ve Takım Çıkartmaları",
  "international2024_rewards_loading_screens_title": "Yükleme Ekranları",
  "international2024_rewards_materials_title": "FANTEZİ VE BİNGO GÜÇLENDİRMELERİ",
  "international2024_rewards_teleport_fx_title": "FAVORİ TAKIM IŞINLANMA EFEKTLERİ",
  "international2024_rewards_effigy_title": "2024 Heykel Bloğu",
  "international2024_supporters_clubs_title": "TOPLULUĞU DESTEKLEYİN",
  "international2024_supporters_clubs_subtitle": "EKİP VE TAKIM TARAFTAR PAKETLERİ",
  "international2024_supporters_clubs_intro": "\"Saygıdeğer bağışçılar! Her yaştan hayırseverler! Öldürme ve ilgili sanatların mütevazı destekçileri! Cömert bağışınızın yarısı doğrudan favori takımlarınıza ve ekip üyelerinize bağışlanacak! Peki buradaki gerçek kahraman kim? Tabii ki ben! Devasa kahraman ellerimle SİZLERİ alkışlıyorum!\"",
  "international2024_supporters_clubs_tiers_title": "TAKIM TARAFTAR KULÜPLERİ",
  "international2024_supporters_clubs_tiers_desc": "Favori takımlarınız için Bronz, Gümüş veya Altın sınıf desteğini seçin ve takımların bizzat tasarladıkları ödülleri kazanın.",
  "international2024_talent_tiers_title": "EKİP ÇIKARTMA PAKETLERİ",
  "international2024_talent_tiers_desc": "En sevdiğiniz ekip üyesini içeren ödül paketleri satın alın. Paketler, satın alınan paketin seviyesine bağlı olarak çıkartma, sesli mesaj ve imzalardan oluşan bir kombinasyonu içerir.",
  "ti13_compendium_small_header": "TURNUVAYI DESTEKLEYİN",
  "ti13_compendium_header": "THE INTERNATIONAL 2024 DERGİSİ",
  "ti13_compendium_desc": "Dergi, The International için etkileşimli dijital rehberinizdir. Dergi, etkinlikle ilgili aktivitelerin, mücadelelerin ve bu yılın tüm etkinlik odaklı ödüllerinin tek adresidir. Ayrıca tüm satışlardan elde edilen gelirin %25'i The International 2024 ödül havuzuna eklenir.",
  "ti13_compendium_bp_btn": "İNTERNET SİTESİ",
  "ti13_compendium_standard": "STANDART DERGİ",
  "ti13_compendium_standard_subtitle": "Tüm Özelikler ve Etkinlikler",
  "ti13_compendium_upgraded": "YÜKSELTİLMİŞ DERGİ",
  "ti13_compendium_upgraded_subtitle": "Tüm Özellikler ve Etkinliklere Ek Hızlandırılmış Ödüller",
  "ti13_compendium_purchase_tp_fx": "Seviye 1 TI 2024 Işınlanma Efekti",
  "ti13_compendium_purchase_boosters_footnote": "Güçlendiriciler seçtiğiniz ek içeriğin kilidini açabilir.",
  "ti13_compendium_purchase_upgraded_boosters_footnote": "Güçlendiriciler, The International 2024 gösterge panelinin veya seçtiğiniz ek içeriğin kilidini açabilir.",
  "ti13_compendium_purchase_levels": "%1$s Dergi Seviyesi",
  "ti13_compendium_purchase_booster_levels": "%1$s Güçlendirici",
  "ti13_compendium_purchase_discount": "Seviyelerde %%1$s tasarruf edin",
  "ti13_compendium_purchase_earn_the_following": "Dergi seviyeleri şunların kilidini açacaktır:",
  "ti13_compendium_purchase_all_access": "Tüm dergi özelliklerine erişim",
  "ti13_compendium_purchase_aegis_emoticon": "Aegis İfadesi",
  "ti13_compendium_purchase_bingo_tokens": "%1$s Bingo Jetonu",
  "ti13_compendium_purchase_fantasy_tokens": "%1$s Değiştirme Jetonu (Fantezi Ligi)",
  "ti13_compendium_purchase_one_player_sticker": "1 Oyuncu Çıkartması Kapsülü",
  "ti13_compendium_purchase_player_stickers": "%1$s Oyuncu Çıkartması Kapsülü",
  "ti13_compendium_purchase_team_stickers": "%1$s Takım Çıkartması Kapsülü",
  "ti13_compendium_purchase_effigy_blocks": "%1$s TI 2024 Heykel Bloğu",
  "ti13_compendium_purchase_team_loading_screens": "%1$s Takım Yükleme Ekranı Hazinesi",
  "ti13_compendium_purchase_ti_loading_screens": "%1$s TI Yükleme Ekranı Hazinesi",
  "international2024_tournament_learn_more": "TURNUVA HAKKINDA DAHA FAZLA BİLGİ EDİNİN",
  "ringmaster_abilities_heading": "Yetenekler",
  "ringmaster_souvenirs_heading": "Hatıralar",
  "ringmaster_ability_tame_the_beasts": "Tame the Beasts",
  "ringmaster_ability_tame_the_beasts_Description": "SÜRELİ - Ringmaster kırbacını çevirip şaklatarak hasar verir ve düşmanların korku içinde kaçmasına neden olur. Ringmaster yeteneği ne kadar uzun süre kullanırsa, hasar o kadar yüksek olur ve korkunun süresi de o kadar uzun olur; ancak yarıçapı azalır.",
  "ringmaster_ability_the_box": "Escape Act",
  "ringmaster_ability_the_box_Description": "Ringmaster kendini veya dost bir kahramanı büyü direnci, yavaşlatma direnci ve fazlı hareket sağlayan mobil, boyutlar ötesi bir kutuda saklar. Kahraman kutuda hedef alınamazdır ancak engellenir, susturulur ve etkisizleştirilir. Yeteneğin süresi dolduğunda ya da kahraman menzil dışına çıktığında kutu açılır.",
  "ringmaster_ability_impalement": "Impalement Arts",
  "ringmaster_ability_impalement_Description": "Ringmaster bıçaklarından birini keskin bir doğrulukla fırlatır. Bıçak bir düşmana çarparsa hasar vererek kısa bir süreliğine yavaşlatır. Ayrıca kurbanı kanatarak her saniye maksimum canının bir yüzdesi kadar hasar verir.",
  "ringmaster_ability_wheel": "Wheel of Wonder",
  "ringmaster_ability_wheel_Description": "Ringmaster, hedef konuma bir harikalar çarkı gönderir. Yuvarlanırken yoluna çıkan tüm düşmanları geri iter. Çark durduğunda etki alanı içindeki düşmanlar sürekli hasar almaya başlar ve yavaşlar. 0,5 saniyeden fazla bir süre boyunca çarka bakan düşmanlar, çark tarafından hipnotize edilir ve ona doğru yürümeye zorlanır. Ayrıca hipnotize edilen ilk düşman, çarkın patlaması için geri sayımı başlatır. Geri sayım başlatılmazsa 8 saniye sonra kendiliğinden patlar.",
  "ringmaster_ability_spotlight": "Spotlight",
  "ringmaster_ability_spotlight_Description": "Ringmaster, hedef bölgeyi taramak için bir spot ışığı gönderir. Işıktaki düşmanların, saldırılarını ıskalama şansı vardır ve görünmez durumdalarsa ortaya çıkarlar. Işığın delici parıltısı illüzyonların yok olmasına ve her saniye maksimum sağlıklarının belirli bir yüzdesini kaybetmelerine neden olur.",
  "ringmaster_ability_dark_carnival_trinkets": "Dark Carnival Barker",
  "ringmaster_ability_dark_carnival_trinkets_Description": "Ringmaster, yakındaki bir düşman kahraman öldüğünde rastgele tek kullanımlık Karanlık Karnaval Hatırası alır. Fazla hatıralar şarj olarak tutulur. Ringmaster yeniden doğduğunda bir hatıraya sahip değilse bir tane verilir. Karanlık Karnaval Hatıraları arasında bir Funhouse Mirror, bir Strongman Tonic ve bir Whoopee Cushion bulunur.",
  "ringmaster_ability_funhouse_mirror": "Funhouse Mirror",
  "ringmaster_ability_funhouse_mirror_Description": "Kullanım: Oran Bozulması\\n\\nKahramanınızın 18 saniye süren kusurlu bir kopyasını oluşturur. İllüzyonunuz %28 hasar verirken %300 hasar alır.",
  "ringmaster_ability_whoopee_cushion": "Whoopee Cushion",
  "ringmaster_ability_whoopee_cushion_Description": "Kullanım: Whoopsie\\n\\nKahramanınızı 400 birim ileri doğru fırlatır. Arkasında düşmanları 3 saniye boyunca %30 yavaşlatan 200 yarıçaplı bir koku bulutu bırakır.",
  "ringmaster_ability_strongman_tonic": "Strongman Tonic",
  "ringmaster_ability_strongman_tonic_Description": "Kullanım: Zorla İçirme\\n\\nDost bir kahramanın kuvvetini 8 saniyeliğine 5 + Ringmaster'ın seviyesi başına 1,5 kadar geçici olarak artırır. Etkisi 4 saniye sürer ve süre ilerledikçe azalmaya başlar."
}