// 7778.js

{
  "language": "polish",
  "june22_title": "Aktualizacja wprowadzająca raport bitewny",
  "june22_subtitle": "Dota Plus – lato 2022",
  "june22_desc": "Dzisiejsza aktualizacja nakazuje sezonowe odświeżenie Dota Plus oraz wykorzystuje okazję, by odsłonić przed wami jeszcze więcej. Wgryźcie się w szczegóły waszej skuteczności w grze we wszystkich meczach poprzedniego sezonu, odkryjcie różnorodność trybów gry wraz z weekendową atrakcją i śmiało pochwalcie się swoimi wiekopomnymi przedmiotami dzięki odblokowanym efektom czarów. W ofercie jest też nowy skarb, nowe i ulepszone funkcje oraz inne rzeczy – w tym aktualizacja 7.31d, która wita przybycie Marci do trybu gry Captains Mode.",
  "june22_battle_report_title": "Raport bitewny",
  "june22_battle_report_head01": "Wyróżnione statystyki",
  "june22_battle_report_desc01": "Raport bitewny analizuje waszą skuteczność we wszystkich rozgrywkach w poprzednim sezonie, by na podstawie kalkulacji wskazać waszego najlepszego bohatera, rolę i ogólne statystyki w porównaniu do innych graczy na waszym poziomie umiejętności. Jest to doskonałe, wysokopoziomowe podsumowanie waszego sezonu.",
  "june22_battle_report_head02": "Kluczowe",
  "june22_battle_report_desc02": "Pamiętacie tę jedną grę, gdzie po półtorej godziny udało wam się odwrócić sytuację? Raport bitewny pamięta – i wie, że jest to godne uwagi. Odkryjcie trendy i rekordy na spersonalizowanym ekranie kluczowych wydarzeń. Zawsze będziecie znać kolejną granicę do przekroczenia.",
  "june22_battle_report_head03": "Dogłębna analiza",
  "june22_battle_report_desc03": "Potrzeba wam jeszcze więcej statystyk? Raport bitewny pozwala wam się jeszcze bardziej wgryźć w wasze gry – sortowanie, filtrowanie i analizowanie ich według bohatera, roli czy indywidualnych meczów. Nie spieszcie się, znajdziecie tam wszystko.",
  "june22_battle_report_head04": "Zdobywajcie nagrody",
  "june22_battle_report_desc04": "Odkrywając swoje raporty bitewne, otrzymacie złote, srebrne i brązowe medale za nadzwyczajne wyniki. Każdy medal nagrodzi was odłamkami za wasze osiągnięcia: 400 za złoty, 300 za srebrny i 200 za brązowy.",
  "june22_battle_report_head05": "Tylko w Dota Plus",
  "june22_battle_report_desc05": "Raport bitewny jest dostępny wyłącznie dla członków Dota Plus. Na początku każdego sezonu Dota Plus wszyscy członkowie automatycznie otrzymają nowy raport bitewny, który szczegółowo opisuje ich wszystkie przygody w grze w poprzednim sezonie.",
  "june22_featured_game_mode_title": "Weekendowa atrakcja",
  "june22_featured_game_mode_head01": "Starzy znajomi, nowe warianty, lśniące odłamki",
  "june22_featured_game_mode_desc01": "Dołączcie do nas na weekendową atrakcję, nową kolejkę dla każdego, która pozwala odkryć pełen asortyment trybów gry i wydarzeń w Dota 2 oraz jednocześnie gromadzić odłamki Dota Plus.",
  "june22_featured_game_mode_head02": "Rotacja trybów gry",
  "june22_featured_game_mode_desc02": "Pierwszym trybem w weekendowej atrakcji jest Ability Draft w dniach 8 – 13 czerwca. Jeśli nigdy się wokół niego nie zakręciliście albo nie próbowaliście go ostatnio, to teraz jest idealny moment na dołączenie do tętniącej życiem społeczności AD i stworzenie nowych, potwornych kombinacji umiejętności dzięki łatwemu w użyciu ekranowi dobierania. Drugie centrum uwagi będzie dostępne w dniach 16 – 20 czerwca i wprowadzi Dominujące Trójki, aktualizując oryginalną wersję o rozgrywkę o szybkim tempie.",
  "june22_featured_game_mode_head03": "Jaskrawe światła szybko gasną",
  "june22_featured_game_mode_desc03": "Każda weekendowa atrakcja jest dostępna przez ograniczony czas. Udział w nich nagrodzi graczy odłamkami Dota Plus do określonej ilości (za wygrane otrzymuje się więcej). Wyczekujcie na zabłyśnięcie kolejnych trybów gry w świetle reflektorów weekendowego centrum uwagi w nadchodzących miesiącach, a następnie dołączajcie do nich, by zbierać nagrody w odłamkach.",
  "june22_immortal_fx_title": "Odblokowane efekty dla wiekopomnych przedmiotów",
  "june22_immortal_fx_head01": "Wiekopomna moc żąda ostatecznego wyboru",
  "june22_immortal_fx_desc01": "Od teraz efekty czarów waszych wiekopomnych przedmiotów mogą zostać umieszczone w wyposażeniu niezależnie od tego, jaki przedmiot nosi wasz bohater. Chcecie zabijać wrogów umiejętnością Finger of Death wraz z efektem Piekielnego Przekleństwa, gdy wasz Lion nosi Piekielny Szpon z Otchłani? Nie ma sprawy. Mieszajcie i dobierajcie swoje efekty z dowolnymi posiadanymi przez was przedmiotami. Wybór należy do was.",
  "june22_match_clips_title": "Edytor klipów",
  "june22_match_clips_head01": "Zapisuj i udostępniaj",
  "june22_match_clips_desc01": "Uchwyćcie swoje ulubione chwile w grze dzięki nowemu edytorowi klipów. Jest to przydatne narzędzie pomagające wam, podczas oglądania powtórek lub gier na żywo, szybko wybrać i zapisać wysokiej jakości wideo, które można udostępnić.",
  "june22_match_clips_head02": "Menu klipu",
  "june22_match_clips_desc02": "Określcie czas rozpoczęcia i zakończenia swojego klipu za pomocą precyzyjnej osi czasu, która obejmuje zgony i zabójstwa graczy. Możecie wybrać dokładny moment, który chcecie udostępnić, bez konieczności korzystania z zewnętrznych narzędzi.",
  "june22_match_clips_head03": "Najwyższa jakość",
  "june22_match_clips_desc03": "Możecie wybrać zaawansowane funkcje renderowania, by uzyskać cienie i odbicia o wyższej jakości, ukryć interfejs użytkownika w grze na czas trwania klipu i osiągnąć płynność obrazu nawet do 90 klatek na sekundę. W systemie Windows narzędzie bezpośrednio koduje wideo w formacie h.264, a inne platformy generują pojedyncze klatki.",
  "june22_avoid_player_title": "Ulepszona lista unikanych graczy",
  "june22_avoid_player_head01": "Dodajcie notatki",
  "june22_avoid_player_desc01": "Nie pamiętacie, dlaczego unikacie danego gracza? Po prostu zachowajcie notatkę z powodem dodania go do listy unikanych.",
  "june22_avoid_player_head02": "Zakupcie więcej miejsc",
  "june22_avoid_player_desc02": "Lista unikanych graczy ma domyślnie 25 miejsc, ale jeśli wolicie mieć ich więcej, możecie teraz rozszerzyć listę, używając odłamków.",
  "june22_shards_title": "Kupujcie za odłamki",
  "june22_shards_head01": "Efekty serii zabójstw",
  "june22_shards_desc01": "Udekorujcie swój interfejs w grze efektami specjalnymi, które pojawiają się na podstawie serii zabójstw bohatera. Wybierajcie spośród efektów ognia, lodu i złota dostępnych za 150 000 odłamków każdy w sklepie z odłamkami.",
  "june22_shards_head02": "Sezonowy skarb",
  "june22_shards_desc02": "Sezonowy Letni Skarb 2022 już tu jest i można go kupić za odłamki. W przeciwieństwie do poprzednich sezonowych skarbów mogą go zdobyć wszyscy klienci, nie tylko członkowie Dota Plus.\\n\\nTen skarb zawiera wszystkie nowe zestawy dla Arc Wardena, Death Prophet, Ember Spirita, Juggernauta, Nyx Assassina, Ursy, Vengeful Spirit i Wraith Kinga. Skrywa on także kuriera, Ponadczasowego Aptekarza, wraz z losowymi pryzmatycznymi i eterycznymi klejnotami przeznaczonymi dla tych mających na tyle szczęścia, by zasłużyć na jego lekarstwa.",
  "june22_shards_head03": "Zestawy sezonowe",
  "june22_shards_desc03": "Przegapiliście swoją szansę na niektóre zestawy ze starszych skarbów Dota Plus? Zestawy z Jesiennego skarbu 2020 i Zimowego skarbu 2020 są teraz dostępne w bezpośredniej sprzedaży w sklepie odłamków za 15 000 odłamków każdy.",
  "june22_shards_head04": "Relikwie dla każdego",
  "june22_shards_desc04": "Relikwie bohaterów mogą być teraz kupowane za odłamki przez wszystkich graczy, nie tylko członków Dota Plus. Każdy może teraz używać relikwii do śledzenia swoich statystyk i zdobywania dodatkowych PD dla bohatera, ale tylko członkowie Dota Plus mogę przejść na poziom wyższy niż 5.",
  "june22_plus_update_title": "Sezonowe odświeżenie Dota Plus",
  "june22_plus_update_head01": "Misje Dota Plus",
  "june22_plus_update_desc01": "Dzisiejsza aktualizacja zawiera również nowy zestaw misji Dota Plus, abyście mogli uzupełnić swój schowek odłamków i zebrać wszystkie nowe gadżety — oferując do 115 200 odłamków w trakcie sezonu.",
  "june22_plus_update_head02": "Nagrody gildii",
  "june22_plus_update_desc02": "Zaktualizowaliśmy również sezonowe nagrody gildii o nowy zestaw emotikon, sprayów i kół czatu dla gildii poziomu srebrnego, złotego i platynowego.",
  "june22_gameplay_title": "Aktualizacja rozgrywki 7.31d"
}