// 3562.js

{
  "language": "greek",
  "june22_title": "ΕΝΗΜΕΡΩΣΗ: ΑΝΑΦΟΡΑ ΜΑΧΗΣ",
  "june22_subtitle": "DOTA PLUS — ΚΑΛΟΚΑΙΡΙ 2022",
  "june22_desc": "Η σημερινή ενημέρωση προστάζει την εποχιακή ανανέωση του Dota Plus και εκμεταλλεύεται την ευκαιρία για να αποκαλύψει ακόμα περισσότερα. Αναλύστε τις επιδόσεις σας σε όλους τους αγώνες της τελευταίας σεζόν με την Αναφορά Μάχης, εξερευνήστε διάφορους τρόπους παιχνιδιού με το Επίκεντρο Σαββατοκύριακου και αναδείξτε τα Immortal σας όπως σας αρέσει, με ξεκλειδωμένα Immortal εφέ ξορκιών. Υπάρχει ένας νέος θησαυρός, νέα και βελτιωμένα χαρακτηριστικά και άλλα πολλά —συμπεριλαμβανομένης της Ενημέρωσης Παιχνιδιού 7.31d, που καλωσορίζει την άφιξη της Marci στο Captains Mode.",
  "june22_battle_report_title": "ΑΝΑΦΟΡΑ ΜΑΧΗΣ",
  "june22_battle_report_head01": "ΣΗΜΑΝΤΙΚΑ ΣΤΑΤΙΣΤΙΚΑ",
  "june22_battle_report_desc01": "Η Αναφορά Μάχης αναλύει τις επιδόσεις σας σε όλους τους αγώνες της προηγούμενης σεζόν για να υπολογίσει τον καλύτερο ήρωα και ρόλο σας, καθώς και τα συνολικά στατιστικά συγκριτικά με άλλους παίκτες στο επίπεδο ικανοτήτων σας. Το τέλειο περιληπτικό στιγμιότυπο για τη σεζόν σας.",
  "june22_battle_report_head02": "ΑΞΙΟΣΗΜΕΙΩΤΑ",
  "june22_battle_report_desc02": "Θυμάστε εκείνο το παιχνίδι σας με την τρελή ανατροπή μετά από μιάμιση ώρα; Η Αναφορά Μάχης το θυμάται –και γνωρίζει ότι είναι αξιοσημείωτο. Ανακαλύψτε τάσεις και ρεκόρ στην εξατομικευμένη οθόνη «Αξιοσημείωτα». Θα γνωρίζετε πάντα ποιο είναι το επόμενο ρεκόρ προς κατάρριψη.",
  "june22_battle_report_head03": "ΛΕΠΤΟΜΕΡΗΣ ΑΝΑΛΥΣΗ",
  "june22_battle_report_desc03": "Χρειάζεστε ακόμα περισσότερα στατιστικά; Η Αναφορά Μάχης σάς επιτρέπει να αναλύετε λεπτομερώς τα παιχνίδια σας –με ταξινόμηση, φιλτράρισμα και ανάλυση ανά ήρωα, ρόλο ή ανά ξεχωριστούς αγώνες. Δείτε τα με την ησυχία σας, υπάρχουν τα πάντα εδώ.",
  "june22_battle_report_head04": "ΚΕΡΔΙΣΤΕ ΑΝΤΑΜΟΙΒΕΣ",
  "june22_battle_report_desc04": "Καθώς εξερευνάτε την Αναφορά Μάχης, θα λαμβάνετε Χρυσά, Ασημένια και Χάλκινα μετάλλια για εξαιρετικά αποτελέσματα. Κάθε μετάλλιο σάς απονέμει Πετράδια για το κατόρθωμά σας: 400 για Χρυσό, 300 για Ασημένιο και 200 για Χάλκινο.",
  "june22_battle_report_head05": "ΑΠΟΚΛΕΙΣΤΙΚΟ ΣΤΟ DOTA PLUS",
  "june22_battle_report_desc05": "Η Αναφορά Μάχης είναι διαθέσιμη αποκλειστικά σε μέλη Dota Plus. Στην αρχή κάθε νέας σεζόν Dota Plus, όλα τα μέλη Dota Plus λαμβάνουν αυτόματα μία νέα Αναφορά Μάχης, με λεπτομέρειες από όλες τις περιπέτειες παιχνιδιών τους από την προηγούμενη σεζόν.",
  "june22_featured_game_mode_title": "ΕΠΙΚΕΝΤΡΟ ΣΑΒΒΑΤΟΚΥΡΙΑΚΟΥ",
  "june22_featured_game_mode_head01": "ΠΑΛΙΟΙ ΦΙΛΟΙ, ΝΕΕΣ ΑΝΑΤΡΟΠΕΣ, ΛΑΜΠΕΡΑ ΠΕΤΡΑΔΙΑ",
  "june22_featured_game_mode_desc01": "Ελάτε μαζί μας στο Επίκεντρο Σαββατοκύριακου, μία νέα ουρά αναμονής όπου όλοι μπορούν να εξερευνήσουν διάφορους τύπους παιχνιδιού και συμβάντα Dota, ενώ ταυτόχρονα κερδίζουν Πετράδια Dota Plus.",
  "june22_featured_game_mode_head02": "ΕΝΑΛΛΑΣΣΟΜΕΝΟΙ ΤΥΠΟΙ ΠΑΙΧΝΙΔΙΟΥ",
  "june22_featured_game_mode_desc02": "Ο πρώτος τύπος παιχνιδιού στο Επίκεντρο Σαββατοκύριακου είναι το Ability Draft, που είναι διαθέσιμο από 8–13 Ιουνίου. Αν δεν έχετε ασχοληθεί με το Ability Draft ή δεν το έχετε δοκιμάσει πρόσφατα, αυτή είναι η τέλεια ευκαιρία να συνδεθείτε με την ακμάζουσα κοινότητά του και να δημιουργήσετε μερικούς τερατώδεις νέους συνδυασμούς ικανοτήτων, με την εύχρηστη οθόνη επιλογής ικανοτήτων. Το δεύτερο Επίκεντρο Σαββατοκύριακου φτάνει 16–20 Ιουνίου για να εισαγάγει το Overthrow Trios, μια ενημέρωση της αρχικής έκδοσης σε γρήγορο ρυθμό.",
  "june22_featured_game_mode_head03": "ΤΑ ΛΑΜΠΕΡΑ ΦΩΤΑ ΣΒΗΝΟΥΝ ΓΡΗΓΟΡΑ",
  "june22_featured_game_mode_desc03": "Κάθε Επίκεντρο Σαββατοκύριακου είναι διαθέσιμο για περιορισμένο χρόνο. Παίζοντας θα κερδίζετε Πετράδια Dota Plus μέχρι ένα συγκεκριμένο όριο, με τις νίκες να κερδίζουν ακόμα περισσότερα Πετράδια. Μείνετε συντονισμένοι για περισσότερους τύπους παιχνιδιού που θα λάμψουν στο Επίκεντρο Σαββατοκύριακου τους επόμενους μήνες. Έπειτα, μπείτε σε έναν αγώνα και αρπάξτε τις ανταμοιβές Πετραδιών.",
  "june22_immortal_fx_title": "ΞΕΚΛΕΙΔΩΜΕΝΑ IMMORTAL ΕΦΕ ΞΟΡΚΙΩΝ",
  "june22_immortal_fx_head01": "Η ΑΘΑΝΑΤΗ ΙΣΧΥΣ ΑΠΑΙΤΕΙ ΤΗΝ ΑΠΟΛΥΤΗ ΕΠΙΛΟΓΗ",
  "june22_immortal_fx_desc01": "Τα εφέ ξορκιών των Immortal αντικειμένων σας μπορούν τώρα να εξοπλιστούν ανεξαρτήτως του αντικειμένου που φοράει ο ήρωάς σας. Θέλετε να κερδίσετε σκοτωμούς Finger of Death με το εφέ Hell-Spar Anathema ενώ φοράτε τη δαγκάνα κάβουρα Abyssal Hellclaw στον Lion; Κανένα πρόβλημα. Αναμείξτε τα εφέ σας με οποιοδήποτε αντικείμενο έχετε. Η επιλογή είναι δική σας.",
  "june22_match_clips_title": "ΕΠΕΞΕΡΓΑΣΤΗΣ ΚΛΙΠ",
  "june22_match_clips_head01": "ΑΠΟΘΗΚΕΥΣΤΕ ΚΑΙ ΚΟΙΝΟΠΟΙΗΣΤΕ",
  "june22_match_clips_desc01": "Καταγράψτε τις αγαπημένες σας στιγμές εντός παιχνιδιού με τον νέο Επεξεργαστή Κλιπ, ένα χρήσιμο εργαλείο που σας βοηθάει να επιλέξετε και να αποθηκεύσετε γρήγορα ένα βίντεο υψηλής ποιότητας που μπορεί να κοινοποιηθεί, ενώ παρακολουθείτε επαναλήψεις ή ζωντανά παιχνίδια.",
  "june22_match_clips_head02": "ΕΛΕΓΧΟΙ ΚΛΙΠ",
  "june22_match_clips_desc02": "Ορίστε την ώρα έναρξης και λήξης για το κλιπ σας με μία λεπτομερή χρονογραμμή, που περιλαμβάνει θανάτους και σκοτωμούς παικτών. Θα μπορείτε να επιλέξετε την ακριβή στιγμή που θέλετε να κοινοποιήσετε, χωρίς να απαιτούνται εργαλεία τρίτων.",
  "june22_match_clips_head03": "ΕΞΑΙΡΕΤΙΚΗ ΠΟΙΟΤΗΤΑ",
  "june22_match_clips_desc03": "Μπορείτε να επιλέξετε σύνθετα χαρακτηριστικά απόδοσης για σκιές και αντανακλάσεις υψηλότερης ποιότητας, να κρύψετε τη διεπαφή παιχνιδιού για τη διάρκεια του κλιπ και να εξομαλύνετε τον ρυθμό καρέ μέχρι τα 90 καρέ ανά δευτερόλεπτο. Το εργαλείο κωδικοποιεί απευθείας σε βίντεο h.264 σε Windows και άλλες πλατφόρμες εξάγουν ξεχωριστά καρέ.",
  "june22_avoid_player_title": "ΒΕΛΤΙΩΜΕΝΗ ΑΠΟΦΥΓΗ ΠΑΙΚΤΗ",
  "june22_avoid_player_head01": "ΚΡΑΤΗΣΤΕ ΣΗΜΕΙΩΣΕΙΣ",
  "june22_avoid_player_desc01": "Δεν μπορείτε να θυμηθείτε γιατί αποφασίσατε να αποφύγετε έναν συγκεκριμένο παίκτη; Απλώς αποθηκεύστε μια σημείωση, για να καταγράψετε τον λόγο για τον οποίο προσθέσατε έναν παίκτη στη λίστα αποφυγής παικτών.",
  "june22_avoid_player_head02": "ΑΓΟΡΑΣΤΕ ΠΕΡΙΣΣΟΤΕΡΕΣ ΘΕΣΕΙΣ",
  "june22_avoid_player_desc02": "Η λίστα αποφυγής παικτών έχει 25 θέσεις από προεπιλογή, αλλά αν προτιμάτε περισσότερες, μπορείτε πλέον να την επεκτείνετε χρησιμοποιώντας Πετράδια, για να αποκτήσετε περισσότερες θέσεις.",
  "june22_shards_title": "ΑΓΟΡΑΣΤΕ ΜΕ ΠΕΤΡΑΔΙΑ",
  "june22_shards_head01": "ΕΦΕ ΣΕΡΙ ΣΚΟΤΩΜΩΝ",
  "june22_shards_desc01": "Διακοσμήστε τη διεπαφή σας εντός παιχνιδιού με ειδικά εφέ που εμφανίζονται βάσει των σερί σκοτωμών ενός ήρωα. Επιλέξτε ανάμεσα σε εφέ φωτιάς, πάγου και χρυσού, διαθέσιμα στο Μαγαζί Πετραδιών με 150.000 Πετράδια το καθένα.",
  "june22_shards_head02": "ΕΠΟΧΙΑΚΟΣ ΘΗΣΑΥΡΟΣ",
  "june22_shards_desc02": "Ο Εποχιακός Θησαυρός Καλοκαιριού 2022 είναι εδώ, διαθέσιμος για αγορά με Πετράδια και, αντίθετα με τους προηγούμενους εποχιακούς θησαυρούς, μπορούν να τον αγοράσουν όλοι οι πελάτες, όχι μόνο τα μέλη του Dota Plus.\\n\\nΑυτός ο θησαυρός διαθέτει ολοκαίνουρια σετ για Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit και Wraith King. Υπάρχει επίσης ο μεταφορέας Ageless Apothecary που περιλαμβάνει τυχαία πρισματικά και αιθέρια πετράδια για όσους είναι αρκετά τυχεροί και αξίζουν το φάρμακό του.",
  "june22_shards_head03": "ΕΠΟΧΙΑΚΑ ΣΕΤ",
  "june22_shards_desc03": "Χάσατε την ευκαιρία να αποκτήσετε ορισμένα σετ από παλαιότερους θησαυρούς Dota Plus; Τα σετ από τον Φθινοπωρινό Θησαυρό 2020 και τον Χειμερινό Θησαυρό 2020 είναι τώρα διαθέσιμα για άμεση αγορά στο Μαγαζί Πετραδιών, με 15.000 Πετράδια το καθένα,",
  "june22_shards_head04": "ΚΕΙΜΗΛΙΑ ΓΙΑ ΟΛΟΥΣ",
  "june22_shards_desc04": "Τώρα τα Κειμήλια Ήρωα είναι διαθέσιμα για αγορά με Πετράδια από όλους τους παίκτες, όχι μόνο από μέλη του Dota Plus. Όλοι μπορούν πλέον να χρησιμοποιούν τα Κειμήλια για να καταγράφουν τα στατιστικά τους και να αποκτούν επιπλέον εμπειρία ήρωα, αλλά μόνο τα μέλη του Dota Plus έχουν δυνατότητα εξέλιξης πέρα από το επίπεδο 5.",
  "june22_plus_update_title": "ΕΠΟΧΙΑΚΗ ΑΝΑΝΕΩΣΗ DOTA PLUS",
  "june22_plus_update_head01": "ΑΠΟΣΤΟΛΕΣ DOTA PLUS",
  "june22_plus_update_desc01": "Η σημερινή ενημέρωση φέρνει επίσης ένα νέο σετ αποστολών Dota Plus που θα γεμίσει τα αποθέματα Πετραδιών σας, για να μπορείτε να αγοράσετε όλα τα νέα καλούδια, που προσφέρουν συνολικά έως 115.200 Πετράδια κατά τη διάρκεια της σεζόν.",
  "june22_plus_update_head02": "ΑΝΤΑΜΟΙΒΕΣ ΣΥΛΛΟΓΟΥ",
  "june22_plus_update_desc02": "Ενημερώσαμε επίσης τις εποχιακές ανταμοιβές Συλλόγων με ένα νέο σετ που περιλαμβάνει emoticon, σπρέι και ηχητικά ροδέλας συνομιλίας για τις βαθμίδες Συλλόγου «Ασημένια», «Χρυσή» και «Πλατινένια».",
  "june22_gameplay_title": "ΕΝΗΜΕΡΩΣΗ ΠΑΙΧΝΙΔΙΟΥ 7.31D"
}