// 5786.js

{
  "language": "ukrainian",
  "june22_title": "Оновлення з бойовим звітом",
  "june22_subtitle": "Dota Plus — літо 2022",
  "june22_desc": "Літнє оновлення Dota Plus привносить класичну сезонну зміну, а також нові функції. Занурюйтеся в подробиці своєї гри поміж усіх своїх матчів минулого сезону за допомогою бойового звіту, досліджуйте розмаїття ігрових режимів за допомогою вибору вихідних та користуйтеся розблоковуваними нетлінними ефектами чарів. Крім того, маємо нову скарбницю, нові й покращені функції та багато іншого, зокрема й ігроладне оновлення 7.31d, яке додає Марсі до капітанського режиму.",
  "june22_battle_report_title": "Бойовий звіт",
  "june22_battle_report_head01": "Відібрана статистика",
  "june22_battle_report_desc01": "Бойовий звіт аналізує ваші виступи в усіх матчах попереднього сезону для виявлення вашого найкращого героя, ролі та загальних показників у порівнянні з іншими гравцями вашого рівня навичок. Чудова пам’ятка про ваш сезон.",
  "june22_battle_report_head02": "Найкраще",
  "june22_battle_report_desc02": "Пам’ятаєте свою гру з божевільним камбеком через півтори години? Бойовий звіт пам’ятає — і знає, що це важливо. Досліджуйте тенденції та рекорди на екрані своїх найкращих досягнень. Тут ви завжди бачитимете, які ще цілі можна собі поставити.",
  "june22_battle_report_head03": "Поглиблений аналіз",
  "june22_battle_report_desc03": "Потрібно ще більше подробиць? Бойовий звіт дозволяє вам глибоко зануритися у свої ігри — сортувати, фільтрувати й аналізувати їх за героєм, роллю чи окремими матчами. Не кваптеся, там є все.",
  "june22_battle_report_head04": "Нагороди",
  "june22_battle_report_desc04": "Під час дослідження бойового звіту ви отримаєте золоті, срібні та бронзові медалі за виключні результати. Кожна медаль дає вам уламки: золота — 400, срібна — 300, а бронзова — 200.",
  "june22_battle_report_head05": "Ексклюзив Dota Plus",
  "june22_battle_report_desc05": "Бойовий звіт доступний ексклюзивно для підписників Dota Plus. На початку кожного нового сезону Dota Plus усі підписники автоматично отримуватимуть новий бойовий звіт із подробицями всіх їхніх ігрових пригод минулого сезону.",
  "june22_featured_game_mode_title": "Вибір вихідних",
  "june22_featured_game_mode_head01": "Старі друзі, нові повороти, яскраві уламки",
  "june22_featured_game_mode_desc01": "Ступайте з нами у вибір вихідних, новий спосіб для кожного досліджувати асортимент ігрових режимів Dota та подій, накопичуючи уламки Dota Plus.",
  "june22_featured_game_mode_head02": "Ротація ігрових режимів",
  "june22_featured_game_mode_desc02": "Перший режим вибору вихідних — це Ability Draft, доступний з 8 до 13 червня. Якщо ви ніколи не грали в цей режим, або вже давно його не пробували, то зараз чудовий час приєднатися до спільноти шанувальників і створити нову жахливу комбінацію здібностей за допомогою легкого для використання екрана вибору. Наступний вибір вихідних прибуде 16—20 червня й представить Overthrow Trios — стрімкий варіант оригінальної версії режиму.",
  "june22_featured_game_mode_head03": "Яскраві вогні згорають швидко",
  "june22_featured_game_mode_desc03": "Кожен вибір вихідних доступний лише обмежений час. Гра в нього дасть вам уламки Dota Plus до певного ліміту, а перемоги дадуть ще більше уламків. Стежте за появою інших ігрових режимів у виборі вихідних упродовж наступних місяців, а потім приєднуйтеся й забирайте свої уламки.",
  "june22_immortal_fx_title": "Розблоковувані нетлінні ефекти чарів",
  "june22_immortal_fx_head01": "Нетлінні сили вимагають ультимативний вибір",
  "june22_immortal_fx_desc01": "Ефекти чарів від нетлінного предмета тепер можна спорядити незалежно від того, який предмет носить ваш герой. Хочете мати ефект Перста смерті від предмета Hell-Spar Anathema, але одягнути на Лайона предмет Abyssal Hellclaw? Без проблем. Змішуйте свої ефекти з будь-якими своїми предметами. Вибір за вами.",
  "june22_match_clips_title": "Редактор кліпів",
  "june22_match_clips_head01": "Зберігайте й поширюйте",
  "june22_match_clips_desc01": "Записуйте свої улюблені моменти за допомогою нового редактора кліпів, зручного інструмента, який допомагає вам під час перегляду повторів чи ігор наживо швидко обирати та зберігати високоякісні відео для поширення.",
  "june22_match_clips_head02": "Керування кліпами",
  "june22_match_clips_desc02": "Визначайте початок і кінець вашого кліпу за допомогою точної часової лінійки, яка містить смерті та вбивства гравців. Ви зможете обрати конкретний момент, яким хочете поділитися, і вам для цього не потрібні жодні сторонні інструменти.",
  "june22_match_clips_head03": "Преміальна якість",
  "june22_match_clips_desc03": "Ви можете обрати розширені функції візуалізації для якісніших тіней та віддзеркалень, прихований внутрішньоігровий інтерфейс для тривалості кліпу та плавна частота кадрів до 90 к/с. Інструмент безпосередньо кодує відео як h.264 у Windows, а інші платформи виводять окремі кадри.",
  "june22_avoid_player_title": "Покращення уникнення гравців",
  "june22_avoid_player_head01": "Нотатки",
  "june22_avoid_player_desc01": "Не можете згадати, чому вирішили уникати певного гравця? Просто збережіть собі нотатку про причини додавання цього гравця до списку уникнення.",
  "june22_avoid_player_head02": "Придбання додаткових місць",
  "june22_avoid_player_desc02": "Список уникання гравців стандартно має 25 місць, але якщо вам потрібно більше, то ви можете отримати додаткові місця за уламки.",
  "june22_shards_title": "Придбання за уламки",
  "june22_shards_head01": "Ефекти серії вбивств",
  "june22_shards_desc01": "Прикрашайте свій внутрішньоігровий інтерфейс спеціальними ефектами серій убивств героя. Обирайте між вогняними, льодяними та золотими ефектами, що доступні за 150 000 уламків кожен у крамниці уламків.",
  "june22_shards_head02": "Сезонна скарбниця",
  "june22_shards_desc02": "Сезонна літня скарбниця 2022 року вже тут і доступна для купівлі за уламки. На відміну від попередніх сезонних скарбниць купити її може будь-хто, а не тільки підписники Dota Plus.\\n\\nЦя скарбниця містить нові набори для Вартового, Провісниці Смерті, Палючого Духа, Джаґернаута, Нікса-Вбивці, Урси, Мстивої Душі та Короля-Духа, а також кур’єра Віковічного аптекаря, що включає випадковий призматичний або ефірний самоцвіт для тих, кому посміхнулося щастя спробувати його ліки.",
  "june22_shards_head03": "Сезонні набори",
  "june22_shards_desc03": "Проґавили шанс купити набори зі старіших скарбниць Dota Plus? Набори з осінньої та зимової скарбниць 2020 року вже доступні для прямого придбання в крамниці уламків за 15 000 уламків кожен.",
  "june22_shards_head04": "Реліквії для всіх",
  "june22_shards_desc04": "Реліквії героїв тепер можуть купувати за уламки всі гравці, а не лише підписники Dota Plus. Кожен може використовувати реліквії для відстеження своєї статистики й заробляння додаткового досвіду героя, але лише підписники Dota Plus зможуть просуватися далі 5-го рівня героя.",
  "june22_plus_update_title": "Сезонне оновлення Dota Plus",
  "june22_plus_update_head01": "Завдання Dota Plus",
  "june22_plus_update_desc01": "Сьогоднішнє оновлення також дає новий набір завдань Dota Plus, щоби ви могли заробити якомога більше уламків для нових товарів крамниці уламків. Загалом за сезон можна отримати 115 200 уламків.",
  "june22_plus_update_head02": "Нагороди гільдії",
  "june22_plus_update_desc02": "Ми також оновили сезонні нагороди гільдії новим набором смайликів, графіті та фраз колеса чату для срібного, золотого і платинового ступеня гільдії.",
  "june22_gameplay_title": "Ігроладне оновлення 7.31d"
}