// 124.js

{
  "language": "bulgarian",
  "june22_title": "Обновление на бойния доклад",
  "june22_subtitle": "Dota Plus — Лято 2022",
  "june22_desc": "Днешното обновление си присвоява сезонното Dota Plus опресняване и използва шанса да разкрие дори още повече неща. Задълбочете се в подробностите за своето представяне през всичките си мачове от миналия сезон с „Бойния доклад“. Проучете разнообразие от игрални режими с „Делничния фокус“. Изфукайте се със своите Immortal артикули, както Ви се ще с отключени Immortal ефекти за заклинания. В магазина има ново съкровище. Достъпни са нови и подобрени характеристики, редом с още други неща. Сред тях е включено и игралното обновление 7.31d, което приветства пристигането на Marci в Captains Mode.",
  "june22_battle_report_title": "Боен доклад",
  "june22_battle_report_head01": "Отличени статистики",
  "june22_battle_report_desc01": "Бойният доклад анализира представянето Ви във всички Ваши мачове от предходния сезон. Така изчислява най-добрия Ви герой, роля и общи статистики спрямо други играчи във Вашето ниво на умение. Перфектната висококачествена извадка на сезона Ви.",
  "june22_battle_report_head02": "Най-добри моменти",
  "june22_battle_report_desc02": "Помните ли играта Ви с лудото завръщане след час и половина? Бойният доклад я помни и също така знае, че е забележителна. Откривайте тенденции и рекорди на персонализирания екран за „Най-добри моменти“. Винаги ще знаете следващия еталон, който да надминете.",
  "june22_battle_report_head03": "Задълбочени анализи",
  "june22_battle_report_desc03": "Нуждаете се от дори още повече статистики? Бойният доклад Ви позволява да се задълбочите в своите игри. Можете да ги сортирате, филтрирате и анализирате по герой, роля или индивидуални мачове. Не бързайте. Всичко е там.",
  "june22_battle_report_head04": "Печелете награди",
  "june22_battle_report_desc04": "Докато проучвате своя „Боен доклад“, ще получавате златни, сребърни и бронзови медали за изключителни резултати. Всеки медал Ви връчва късове за Вашето постижение: 400 за златни, 300 за сребърни и 200 за бронзови.",
  "june22_battle_report_head05": "Ексклузивно за Dota Plus",
  "june22_battle_report_desc05": "Бойният доклад е достъпен ексклузивно за Dota Plus членове. В началото на всеки нов Dota Plus сезон всички Dota Plus членове автоматично получават нов „Боен доклад“, в който подробно се описват всичките им игрални приключения от предходния сезон.",
  "june22_featured_game_mode_title": "Делничен фокус",
  "june22_featured_game_mode_head01": "Стари приятели, нови обрати и лъскави късове",
  "june22_featured_game_mode_desc01": "Пристъпете с нас в „Делничния фокус“. Нова опашка за всички, така че да проучите асортимент от Dota 2 игрални режими и събития, докато се запасявате с Dota Plus късове.",
  "june22_featured_game_mode_head02": "Ротация от игрални режими",
  "june22_featured_game_mode_desc02": "Първият режим в „Делничния фокус“ е Ability Draft, достъпен от 08 до 13 юни. Ако никога не сте се впускали в Ability Draft или не сте го опитвали наскоро, сега е идеалният момент да се присъедините към процъфтяващата AD общност и да създадете някакви нови чудовищни комбинации от умения, използвайки удобния екран за подбор на режима. Вторият „Делничен фокус“ пристига на 16 — 20 юни, за да представи Overthrow Trios, представляващ динамично обновление на оригиналната версия.",
  "june22_featured_game_mode_head03": "Ярките светлини изгарят бързо",
  "june22_featured_game_mode_desc03": "Всеки „Делничен фокус“ е достъпен за ограничен времеви период. Играенето ще връчва Dota Plus късове до зададен лимит, а победите ще носят повече късове. Продължавайте да следите за още игрални режими, които да блеснат в „Делничния фокус“ през идните месеци. След това се присъединете и пожънете наградните късове.",
  "june22_immortal_fx_title": "Отключени Immortal ефекти за заклинания",
  "june22_immortal_fx_head01": "Безсмъртната мощ изисква абсолютния избор",
  "june22_immortal_fx_desc01": "Ефектите за заклинанията на Immortal артикулите Ви вече могат да бъдат екипирани, независимо от това какво носи Вашият герой. Искате да постигнете Finger of Death убийства с Hell-Spar Anathema ефекта, докато вместо това носите рачешката щипка Abyssal Hellclaw върху Lion? Нямате проблем. Смесвайте и съчетавайте своите ефекти с всеки артикул, който имате. Изборът е Ваш.",
  "june22_match_clips_title": "Създател на клипове",
  "june22_match_clips_head01": "Запазвайте и споделяйте",
  "june22_match_clips_desc01": "Уловете любимите си игрални моменти с новия „Създател на клипове“. Удобен инструмент, който Ви помага бързо да изберете и запазите висококачествено видео за споделяне, докато наблюдавате повторения или игри на живо.",
  "june22_match_clips_head02": "Контроли за клиповете",
  "june22_match_clips_desc02": "Определяйте стартовото и крайното време за клипа Ви с много фина хронология, която включва умирания и убийства на играчи. Ще сте способни да изберете точния момент, който искате да споделите, без да се изискват инструменти от трети страни.",
  "june22_match_clips_head03": "Премиум качество",
  "june22_match_clips_desc03": "Можете да изберете разширени характеристики за рендиране на по-висококачествени сенки и отражения, скрит игрален потребителски интерфейс за времетраенето на клипа и плавна честота на кадрите до 90 к/сек. Инструментът директно кодира към h.264 видео на Windows, а при други платформи извежда отделни кадри.",
  "june22_avoid_player_title": "Подобрено избягване на играчи",
  "june22_avoid_player_head01": "Водете си бележки",
  "june22_avoid_player_desc01": "Не си спомняте защо сте решили да избягвате специфичен играч? Просто запазете бележка, която включва защо сте добавили даден потребител към списъка с играчи за избягване.",
  "june22_avoid_player_head02": "Закупете още слотове",
  "june22_avoid_player_desc02": "Списъкът с играчи за избягване разполага с 25 слота по подразбиране, но ако предпочитате още, вече можете да го разширите, използвайки късове, за да придобиете допълнителни слотове.",
  "june22_shards_title": "Закупуване с късове",
  "june22_shards_head01": "Ефекти за убийствени серии",
  "june22_shards_desc01": "Украсете своя игрален интерфейс със специални ефекти, които се показват спрямо убийствени серии на даден герой. Избирайте из огнени, ледени и златни ефекти, достъпни за 150 000 къса, всеки от които е в „Магазина за късове“.",
  "june22_shards_head02": "Сезонно съкровище",
  "june22_shards_desc02": "Сезонното съкровище за лято 2022 е тук. Достъпно е за покупка с късове и за разлика от предишните сезонни съкровища, всички клиенти са приемливи, а не само Dota Plus членовете.\\n\\nТова съкровище включва всички нови набори за Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit и Wraith King. Също така съдържа и куриера Ageless Apothecary, който включва произволни призматични и ефирни скъпоценни камъни за онези, които са достатъчно късметлии да заслужат неговия цяр.",
  "june22_shards_head03": "Сезонни набори",
  "june22_shards_desc03": "Пропуснали сте шанса си за някои от наборите в по-старите Dota Plus съкровища? Наборите от „Есенно съкровище 2020“ и „Зимно съкровище 2020“ вече са достъпни за директно закупуване в „Магазина за късове“ за 15 000 къса всеки.",
  "june22_shards_head04": "Реликви за всекиго",
  "june22_shards_desc04": "Героичните реликви вече могат да бъдат закупени за късове от всички играчи, а не само от Dota Plus членовете. Вече всеки може да използва реликви, така че да проследява своите статистики и да печели бонус опит за герои, но само Dota Plus членовете могат да напреднат над ниво 5.",
  "june22_plus_update_title": "Dota Plus сезонно опресняване",
  "june22_plus_update_head01": "Dota Plus приключения",
  "june22_plus_update_desc01": "Днешното обновление също идва с нов набор от Dota Plus приключения, които да укрепят скривалището Ви с късове за всички нови благини. В хода на сезона можете да съберете до 115 200 къса.",
  "june22_plus_update_head02": "Гилдийни награди",
  "june22_plus_update_desc02": "Също така обновихме сезонните гилдийни награди с нов набор от емотикони, спрейове и чат рулетки за гилдии от сребърни, златни и платинени поредици.",
  "june22_gameplay_title": "Игрално обновление 7.31d"
}