// 5909.js

{
  "language": "hungarian",
  "june22_title": "A Csatajelentés frissítés",
  "june22_subtitle": "Dota Plusz 2022. nyár",
  "june22_desc": "A mai frissítés harcba küldi a szezonális Dota Plusz frissítést, és megragadja az alkalmat sok más leleplezésére. Áss teljesítményed részleteinek mélyére múlt szezonbeli meccseiden a Csatajelentéssel, fedezz fel különféle játékmódokat a Hétvégi reflektorfénnyel, és büszkélkedj Halhatatlanjaiddal ahogy tetszik, a feloldott Halhatatlan varázslateffektekkel. Új kincs, új és fejlesztett funkciók és egyebek várnak rád, köztük a 7.31d játékmenet-frissítés, amely üdvözli Marcit a Captains Mode-ban.",
  "june22_battle_report_title": "Csatajelentés",
  "june22_battle_report_head01": "Kiemelt statisztikák",
  "june22_battle_report_desc01": "A Csatajelentés elemzi teljesítményedet az előző szezon összes meccsén legjobb hősöd, szereped és általános statisztikáid kiszámítására a többi játékoshoz képest az ügyességszinteden. Szezonod tökéletes, magas szintű pillanatfelvétele.",
  "june22_battle_report_head02": "Kiemelések",
  "june22_battle_report_desc02": "Emlékszel a meccsetekre, amikor másfél óra után értetek el őrületes fordítást? A Csatajelentés igen, és tudja, hogy az említésre méltó. Fedezz fel trendeket és rekordokat a személyre szóló Kiemelések képernyőn. Mindig tudni fogod, mi a következő elérendő mérföldkő.",
  "june22_battle_report_head03": "Mély elemzés",
  "june22_battle_report_desc03": "Még több statisztikára van szükséged? A Csatajelentés lehetővé teszi, hogy játékaid mélyére áss, rendezve, szűrve és elemezve azokat hős, szerep vagy konkrét meccsek szerint. Nem kell sietni, minden itt van.",
  "june22_battle_report_head04": "Szerezz jutalmakat",
  "june22_battle_report_desc04": "Miközben felfedezed a Csatajelentésedet, arany, ezüst és bronz érmet fogsz kapni a kiemelkedő eredményekért. Mindegyik medál szilánkokkal jutalmaz a teljesítményedért: az arany 400-at, az ezüst 300-at, a bronz pedig 200-at ad.",
  "june22_battle_report_head05": "Dota Plusz exkluzív",
  "june22_battle_report_desc05": "A Csatajelentés kizárólag Dota Plusz tagoknak érhető el. Minden új Dota Plusz szezon kezdetén mindegyik Dota Plusz tag automatikusan új Csatajelentést fog kapni, ami részletezi minden játékbeli kalandját az előző szezonban.",
  "june22_featured_game_mode_title": "Hétvégi reflektorfény",
  "june22_featured_game_mode_head01": "Régi barátok, új fordulatok, fénylő szilánkok",
  "june22_featured_game_mode_desc01": "Lépj be velünk a Hétvégi reflektorfénybe, egy mindenkinek elérhető új sorba, amelyben különféle Dota játékmódokat és eseményeket lehet felfedezni, közben Dota Plusz szilánkokat gyűjtve be.",
  "june22_featured_game_mode_head02": "Cserélődő játékmódok",
  "june22_featured_game_mode_desc02": "A Hétvégi reflektorfény első módja a június 8. és 13. között elérhető Ability Draft. Ha még sosem játszottál Ability Draftot, vagy mostanában nem próbáltad, itt a tökéletes alkalom csatlakozni a virágzó AD-közösséghez, és alkotni néhány durva képességkombinációt a mód könnyen használható képességválasztó képernyőjével. A második Hétvégi reflektorfény június 16. és 20. között érkezik az Overthrow Trios bemutatására, ami az eredeti változat gyors tempójú frissítése.",
  "june22_featured_game_mode_head03": "A fényes izzó gyorsan kiég",
  "june22_featured_game_mode_desc03": "Mindegyik Hétvégi reflektorfény korlátozott ideig érhető el. A játék Dota Plusz szilánkokat ad egy megadott korlátig, ahol a győzelmek több szilánkot adnak. Figyeld a Hétvégi reflektorfényt az elkövetkező hetekben további kiemelt játékmódokért. Aztán csatlakozz, és arasd le a szilánkjutalmat.",
  "june22_immortal_fx_title": "Feloldott Halhatatlan varázslateffektek",
  "june22_immortal_fx_head01": "A Halhatatlan hatalom tökéletes döntést követel",
  "june22_immortal_fx_desc01": "Halhatatlan tárgyaid varázslateffektjei mostantól attól függetlenül felszerelhetők, hogy hősöd melyik tárgyat viseli. Finger of Death öléseket akarsz elérni a Pokolverő Átok effekttel, miközben az Alvilági Pokolkarom rákollóját viseled Lionnal? Nem gond. Válogasd össze az effektjeidet bármilyen általad birtokolt tárgyból. A döntés a tiéd.",
  "june22_match_clips_title": "Klipkészítő",
  "june22_match_clips_head01": "Mentsd és oszd meg",
  "june22_match_clips_desc01": "Örökítsd meg kedvenc játékpillanataidat az új Klipkészítővel, egy hasznos eszközzel, amely segít gyorsan, magas minőségű videót kiválasztani és menteni, miközben visszajátszásokat vagy élő játékokat nézel.",
  "june22_match_clips_head02": "Klipvezérlés",
  "june22_match_clips_desc02": "Határozd meg kliped kezdetének kezdési és végződési idejét finom léptékű idővonalon, amely jelzi a játékoshalálokat és öléseket. Kiválaszthatod a pontos pillanatot, amit meg akarsz osztani, külső eszközök szükségessége nélkül.",
  "june22_match_clips_head03": "Prémium minőség",
  "june22_match_clips_desc03": "Választhatsz fejlett képalkotási lehetőségeket magasabb minőségű árnyékokkal és tükröződéssel, a játék kezelőfelületének elrejtését a klip időtartamára, és sima képkockaszámot akár 90 FPS-ig. Az eszköz Windowson közvetlenül h.264 videóvá kódol, más platformokon pedig különálló képkockákból áll a kimenete.",
  "june22_avoid_player_title": "Javított játékoselkerülés",
  "june22_avoid_player_head01": "Jegyzetelj",
  "june22_avoid_player_desc01": "Nem emlékszel, miért döntöttél egy bizonyos játékos elkerülése mellett? Egyszerűen ments egy emlékeztetőt, benne az okkal, amiért az elkerülési listához adtad a játékost.",
  "june22_avoid_player_head02": "Vásárolj több helyet",
  "june22_avoid_player_desc02": "A játékoselkerülési listának alapból 25 helye van, de ha többet szeretnél, mostantól bővítheted a listát, szilánkokat használva további helyek szerzésére.",
  "june22_shards_title": "Vásárolj szilánkokkal",
  "june22_shards_head01": "Öléssorozat-effektek",
  "june22_shards_desc01": "Díszítsd játékbeli kezelőfelületed különleges effektekkel, amelyek egy hős öléssorozatai alapján jelennek meg. Választhatsz tűz, jég és arany effektek között, amelyek mindegyike 150 000 szilánkért érhető el a Szilánkboltban.",
  "june22_shards_head02": "Szezonális kincs",
  "june22_shards_desc02": "Megjött a 2022. Nyári Szezonális Kincs, ami megvásárolható szilánkokért, és a korábbi szezonális kincsekkel ellentétben minden vásárló jogosult rá, nem csak a Dota Plusz tagok.\\n\\nE kincsben vadonatúj szettek vannak Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit és Wraith King számára. Ott van még a Kortalan Patikus futár, amelyhez véletlenszerű színjátszó és éteri ékkövek is tartoznak azoknak, akik elég szerencsések, hogy méltók legyenek gyógyírjeire.",
  "june22_shards_head03": "Szezonális szettek",
  "june22_shards_desc03": "Lemaradtál a régebbi Dota Plusz kincsek néhány szettjéről? Az Őszi Kincs 2020 és a Téli Kincs 2020 szettjei most elérhetők közvetlen megvásárlásra a Szilánkboltból, darabonként 15 000 szilánkért.",
  "june22_shards_head04": "Relikviák mindenkinek",
  "june22_shards_desc04": "A hősrelikviákat mostantól minden játékos megvásárolhatja szilánkokért, nem csak a Dota Plusz tagok. Mostantól mindenki használhat relikviákat statisztikái követésére és bónusz hős-TP szerzésére, de csak Dota Plusz tagok léphetnek 5. szintnél feljebb.",
  "june22_plus_update_title": "Dota Plusz szezonális frissítés",
  "june22_plus_update_head01": "Dota Plusz küldetések",
  "june22_plus_update_desc01": "A mai frissítéssel új készlet Dota Plusz küldetés is érkezik, hogy segítsen bezsákolni némi plusz szilánkot a sok új holmihoz, összesen 115 000 szilánkot kínálva a szezon során.",
  "june22_plus_update_head02": "Céhjutalmak",
  "june22_plus_update_desc02": "Frissítettük a szezonális céhjutalmakat is új készlet hangulatjellel, festéssel és csevegőkoronggal az ezüst, arany és platina szintű céheknek.",
  "june22_gameplay_title": "7.31d játékmenet-frissítés"
}