// 1885.js

{
  "language": "german",
  "june22_title": "Das Schlachtenbericht-Update",
  "june22_subtitle": "Dota Plus – Sommer 2022",
  "june22_desc": "Dieses Update ist das saisonale Großreinemachen von Dota Plus und beinhaltet eine Reihe von Überraschungen. Analysieren Sie in dem neuen Schlachtenbericht detailgenau Ihre Leistung in Spielen der letzten Saison, probieren Sie im Wochenend-Spotlight interessante Spielmodi aus und statten Sie Ihre Immortals mit freigeschalteten Immortal-Zaubereffekten aus. Außerdem gibt es einen neuen Schatz, neue und verbesserte Funktionen und mehr im Shop – darunter das Gameplay-Update 7.31d, mit dem Marci dem Captain’s Mode beitritt.",
  "june22_battle_report_title": "Schlachtenbericht",
  "june22_battle_report_head01": "Hervorgehobene Statistiken",
  "june22_battle_report_desc01": "Der Schlachtenbericht analysiert Ihre Leistung in sämtlichen Spielen der vergangenen Saison und berechnet Ihren erfolgreichsten Helden, Ihre beste Rolle und Ihre besten Gesamtstatistiken im Vergleich zu anderen Spielern Ihrer Erfahrungsstufe. Das perfekte Resümee Ihrer Saison.",
  "june22_battle_report_head02": "Höhepunkte",
  "june22_battle_report_desc02": "Erinnern Sie sich an die Partie, in der Sie nach eineinhalb Stunden den Kampf zu Ihren Gunsten wenden konnten? Der Schlachtenbericht erinnert sich und weiß, wie bemerkenswert dieser Moment war. Sehen Sie sich Trends und Aufzeichnungen in Ihren individuellen Highlights an. So wissen Sie immer, welchen Meilenstein es als Nächstes zu meistern gilt.",
  "june22_battle_report_head03": "Tiefenanalyse",
  "june22_battle_report_desc03": "Sie brauchen noch genauere Statistiken? Im Schlachtenbericht können Sie nach Held, Rolle und einzelnen Partien filtern und sortieren, um einen tiefen Einblick in das Spielgeschehen zu gewinnen.",
  "june22_battle_report_head04": "Belohnungen verdienen",
  "june22_battle_report_desc04": "Bei der Erkundung des Schlachtenberichts erhalten Sie Gold-, Silber- und Bronzemedaillen für hervorragende Ergebnisse. Für jede Medaille gibt es Splitter – 400 für Gold, 300 für Silber und 200 für Bronze.",
  "june22_battle_report_head05": "Exklusiv für Dota Plus",
  "june22_battle_report_desc05": "Der Schlachtenbericht ist exklusiv für Dota-Plus-Mitglieder verfügbar. Zu Beginn jeder neuen Dota-Plus-Saison erhalten alle Dota-Plus-Mitglieder automatisch einen neuen Schlachtenbericht mit allen Details zu ihren Abenteuern der vorigen Saison.",
  "june22_featured_game_mode_title": "Wochenend-Spotlight",
  "june22_featured_game_mode_head01": "Alte Freunde, neue Wendungen, funkelnde Splitter",
  "june22_featured_game_mode_desc01": "Machen Sie mit beim Wochenend-Spotlight, einer neuen Spielsuche für alle, die verschiedene Spiel-Modi und Events entdecken und dabei ordentlich Dota-Plus-Splitter ergattern möchten.",
  "june22_featured_game_mode_head02": "Abwechselnde Spielmodi",
  "june22_featured_game_mode_desc02": "Der erste Modus beim Wochenend-Spotlight vom 8. bis 13. Juni ist Ability Draft. Falls Sie diesen Modus noch nie oder schon länger nicht mehr gespielt haben, ist jetzt der perfekte Zeitpunkt der florierenden Community beizutreten und über den Draft-Bildschirm ein paar schlagkräftige Fähigkeitenkombos zu kreieren. Das zweite Wochenend-Spotlight vom 16. bis 20. Juni stellt Overthrow Trios vor, ein temporeiches Update der Originalversion.",
  "june22_featured_game_mode_head03": "Helle Lichter lodern schneller",
  "june22_featured_game_mode_desc03": "Jedes Wochenend-Spotlight läuft für eine begrenzte Zeit. Durch Spielen erhalten Sie Dota-Plus-Splitter bis zu einem festgelegten Limit, wobei Siege mehr Splitter einbringen. Bleiben Sie dran und entdecken Sie in den kommenden Monaten weitere Spielmodi in den Wochenend-Spotlights, für noch mehr Spannung und Splitter.",
  "june22_immortal_fx_title": "Freigeschaltete Immortal-Zaubereffekte",
  "june22_immortal_fx_head01": "Mit der Macht der Immortals kommt die Bürde der Entscheidungen",
  "june22_immortal_fx_desc01": "Die Zaubereffekte der Immortal-Gegenstände können jetzt ausgerüstet werden, unabhängig von der sonstigen Ausstattung eines Helden. Sie möchten Kills mit dem Finger des Todes mit dem Effekt „Hell-Spar Anathema“ erhöhen, während Lion Abyssal Infernal Claw ausgerüstet hat? Kein Problem! Kombinieren und mischen Sie die Effekte all Ihrer Gegenstände ganz nach Wunsch – die Entscheidung liegt bei Ihnen.",
  "june22_match_clips_title": "Videoclipwerkzeug",
  "june22_match_clips_head01": "Sichern und teilen",
  "june22_match_clips_desc01": "Halten Sie Ihre Lieblingsmomente im Spiel mit dem praktischen neuen Videoclipwerkzeug fest. Es war nie einfacher, Höhepunkte aus Wiederholungen oder Live-Spielen auswählen und als hochwertige Videos zu speichern und zu teilen.",
  "june22_match_clips_head02": "Clipwerkzeugsteuerung",
  "june22_match_clips_desc02": "Legen Sie die Start- und Endzeit Ihres Videoclips mithilfe der detaillierten Zeitleiste fest, die u. a. den Tod und Kills von Spielern zeigt. Wählen Sie genau den gewünschten Moment aus – ganz ohne Werkzeuge von Drittanbietern.",
  "june22_match_clips_head03": "Premiumqualität",
  "june22_match_clips_desc03": "In den erweiterten Rendering-Funktionen für Schatten und Reflexionen können Sie die Benutzeroberfläche im Spiel für die Dauer des Videos verstecken, eine höhere Videoqualität und Bildraten von bis zu 90 FPS wählen. Das Werkzeug kodiert unter Windows direkt in h.264-Video; andere Plattformen geben einzelne Frames aus.",
  "june22_avoid_player_title": "Option „Spieler meiden“ verbessert",
  "june22_avoid_player_head01": "Notizen machen",
  "june22_avoid_player_desc01": "Sie können sich nicht mehr erinnern, warum Sie einen spezifischen Spieler meiden? Fügen Sie ab sofort eine Notiz mit dem Grund hinzu, wenn Sie einen Spieler auf die Liste zu meidender Spieler setzen.",
  "june22_avoid_player_head02": "Weitere Plätze kaufen",
  "june22_avoid_player_desc02": "Die Liste für zu meidende Spieler hat standardmäßig 25 Plätze. Ab sofort können Sie mithilfe von Splittern diese Anzahl auf Wunsch erhöhen.",
  "june22_shards_title": "Mit Splittern kaufen",
  "june22_shards_head01": "Tötungsserieneffekte",
  "june22_shards_desc01": "Passen Sie Ihre Benutzeroberfläche im Spiel mit Spezialeffekten an. Effekte werden basierend auf der Anzahl von Kill-Serien angezeigt. Sie haben die Wahl zwischen Gold-, Flammen- und Eiseffekten, die einzeln für 150 000 Splitter im Shop erhältlich sind.",
  "june22_shards_head02": "Saisonaler Schatz",
  "june22_shards_desc02": "Der saisonale Schatz für den Sommer 2022 ist ab sofort für Splitter erhältlich. Im Gegensatz zu früheren saisonalen Schätzen ist dieser für alle Spieler verfügbar, nicht nur Dota-Plus-Mitglieder.\\n\\nDer Schatz enthält alle neuen Sets für Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit und Wraith King. Es gibt auch den Ageless-Apothecary-Kurier mit zufälligen prismatischen und ätherischen Edelsteinen für alle, die sich seiner Medizin würdig erweisen.",
  "june22_shards_head03": "Saisonale Sets",
  "june22_shards_desc03": "Sie haben Ihre Chance auf Sets aus vorherigen Dota-Plus-Schätzen verpasst? Ab sofort sind die Sets des herbstlichen und winterlichen Schatzes 2020 für je 15 000 Splitter im Splitter-Shop erhältlich.",
  "june22_shards_head04": "Relikte für alle",
  "june22_shards_desc04": "Heldenrelikte sind ab sofort für alle Spieler erhältlich, nicht nur Dota-Plus-Mitglieder. Alle Spieler können mit Relikten ihre Statistiken verfolgen und Bonus-EP für ihre Helden verdienen, doch alle Level höher als fünf sind Dota-Plus-Mitgliedern vorbehalten.",
  "june22_plus_update_title": "Dota Plus – Aktualisierung zur Saison",
  "june22_plus_update_head01": "Dota Plus – Quests",
  "june22_plus_update_desc01": "Das heutige Update enthält auch einen neuen Satz Dota-Plus-Quests, mit denen mächtig Splitter für neue schöne Dinge verdient werden können. Insgesamt warten 115 200 Splitter bis zu Ende der Saison darauf, eingesammelt zu werden.",
  "june22_plus_update_head02": "Gildenbelohnungen",
  "june22_plus_update_desc02": "Die saisonalen Gildenbelohnungen wurden ebenfalls um neue Emoticons, Graffitis und Chatradeffekte für die drei Stufen Silber, Gold und Platin erweitert.",
  "june22_gameplay_title": "Gameplay-Update 7.31d"
}