// 777.js

{
  "language": "vietnamese",
  "june22_title": "Cập nhật báo cáo trận đấu",
  "june22_subtitle": "Dota Plus hè 2022",
  "june22_desc": "Bản cập nhật hôm nay thổi một làn gió mùa mới cho Dota Plus và nhân cơ hội hé lộ nhiều hơn nữa. Tìm hiểu chi tiết về phong độ bản thân trong tất cả trận đấu thuộc mùa giải trước cùng Báo cáo trận đấu, khám phá hàng loạt chế độ chơi khác nhau với Tiêu điểm cuối tuần, và khoe vật phẩm Immortal theo cách riêng với nhiều hiệu ứng phép được mở khóa. Kho báu mới, những tính năng mới lẫn cải tiến, và hơn thế — tất cả quy tụ trong bản cập nhật lối chơi 7.31d, chào mừng sự góp mặt của Marci trong Captains Mode.",
  "june22_battle_report_title": "Báo cáo trận đấu",
  "june22_battle_report_head01": "Thông số nổi bật",
  "june22_battle_report_desc01": "Báo cáo trận đấu phân tích phong độ của bạn trong tất cả trận đấu thuộc mùa giải trước, tính toán ra tướng cùng vai trò hiệu quả nhất, cũng như thông số tổng thể so với người chơi khác ở cùng cấp độ. Đem lại một cái nhìn sơ bộ về mùa giải.",
  "june22_battle_report_head02": "Điểm nhấn",
  "june22_battle_report_desc02": "Bạn có nhớ lần mình đã hoàn toàn xoay chuyển thế cờ sau 1 tiếng rưỡi không? Báo cáo trận đấu thì có đấy — và biết rằng đó là khoảnh khắc đang lưu vào sách sử. Khám phá xu hướng và kỷ lục trong mục Điểm nhấn được cá nhân hóa. Bạn sẽ luôn biết cột mốc tiếp theo để chinh phục.",
  "june22_battle_report_head03": "Phân tích sâu",
  "june22_battle_report_desc03": "Cần thêm nhiều số liệu nữa? Báo cáo trận đấu cho phép đào sâu vào trò chơi — xếp, lọc, và phân tích theo tướng, vai trò, cũng như trận đấu cá nhân. Cứ từ từ tìm hiểu; chẳng mất đi đâu đâu.",
  "june22_battle_report_head04": "Nhận thưởng",
  "june22_battle_report_desc04": "Trong lúc khám phá báo cáo trận đấu, bạn sẽ nhận được huy chương Vàng, Bạc, và Đồng cho những kết quả xuất sắc. Mỗi huy chương trao cho bạn pha lê tương ứng với thành tích: 400 cho Vàng, 300 cho Bạc, và 200 cho Đồng.",
  "june22_battle_report_head05": "Độc quyền cho Dota Plus",
  "june22_battle_report_desc05": "Báo cáo trận đấu là tính năng độc quyền cho hội viên Dota Plus. Vào đầu mỗi mùa Dota Plus mới, tất cả hội viên trong đó đều tự động nhận một báo cáo trận đấu, nêu chi tiết mọi cuộc phiêu lưu trong trò chơi từ mùa trước.",
  "june22_featured_game_mode_title": "Tiêu điểm cuối tuần",
  "june22_featured_game_mode_head01": "Bạn cũ, biến mới, và pha lê sáng chói",
  "june22_featured_game_mode_desc01": "Cùng chúng tôi bước vào Tiêu điểm cuối tuần, một hàng chờ mới cho phép vừa khám phá loạt chế độ trò chơi và sự kiện Dota đa dạng, vừa kiếm thêm pha lê Dota Plus.",
  "june22_featured_game_mode_head02": "Chế độ chơi xoay vòng",
  "june22_featured_game_mode_desc02": "Chế độ đầu tiên trong tiêu điểm cuối tuần là Ability Draft, diễn ra từ 8-13 tháng 6. Nếu chưa thử hoặc gần đây chưa chơi qua chế độ này, giờ là thời điểm tuyệt vời để gia nhập cộng đồng AD và tạo các combo chiêu thức thật bá đạo với màn hình cấm chọn dễ hiểu. Tiêu điểm thứ hai sẽ diễn ra vào 16-20 với Overthrow Trios, với tốc độ nhanh hơn phiên bản gốc.",
  "june22_featured_game_mode_head03": "Lửa to cháy nhanh",
  "june22_featured_game_mode_desc03": "Mỗi tiêu điểm cuối tuần chỉ diễn ra trong một thời gian ngắn. Chơi và nhận pha lê Dota Plus tới một mức giới hạn, thắng thì nhận nhiều hơn. Chờ đón thêm nhiều chế độ chơi mới tỏa sáng trong tiêu điểm cuối tuần trong các tháng sắp tới. Rồi tham dự và kiếm thật nhiều phần thưởng pha lê.",
  "june22_immortal_fx_title": "Mở khóa hiệu ứng phép cho vật phẩm Immortal",
  "june22_immortal_fx_head01": "Sức mạnh Immortal yêu cầu lựa chọn khó",
  "june22_immortal_fx_desc01": "Giờ có thể trang bị hiệu ứng phép cho vật phẩm Immortal cho dù tướng bạn đang mặc đồ gì. Muốn đạt điểm giết cho Finger of Death với hiệu ứng Hell-Spar Anathema trong khi đang mặc Abyssal Hellclaw trên Lion? Không thành vấn đề. Phối hợp hiệu ứng với bất kỳ vật phẩm nào bạn có. Bạn được quyền quyết định.",
  "june22_match_clips_title": "Trình dựng clip",
  "june22_match_clips_head01": "Lưu và chia sẻ",
  "june22_match_clips_desc01": "Ghi lại khoảnh khắc yêu thích trong trò chơi với trình dựng clip mới, một công cụ tiện lợi giúp chọn và lưu video chất lượng cao để chia sẻ, trong khi đang xem trận phát lại hay trực tiếp.",
  "june22_match_clips_head02": "Điều khiển clip",
  "june22_match_clips_desc02": "Quyết định điểm bắt đầu và kết thúc cho clip của mình với một thanh thời gian bao gồm chết và giết của người chơi. Bạn có thể chọn chính xác thời điểm mình muốn chia sẻ mà không cần đến công cụ của bên thứ ba.",
  "june22_match_clips_head03": "Chất lượng cao",
  "june22_match_clips_desc03": "Bạn có thể chọn các tính năng render nâng cao để đạt hiệu ứng đổ bóng và phản xạ tốt hơn, ẩn yếu tố giao diện trò chơi trong thời đoạn clip, và làm mượt khung hình lên tới 90fps. Công cụ trực tiếp mã hóa thành video h.264 trên Windows, và các dạng khung hình đơn lẻ trên nền tảng khác.",
  "june22_avoid_player_title": "Cải thiện tính năng né người chơi",
  "june22_avoid_player_head01": "Ghi chú",
  "june22_avoid_player_desc01": "Không thể nhớ tại sao bạn muốn né người chơi này? Chỉ cần lưu lại ghi chú tại sao bạn thêm họ vào danh sách người chơi cần né.",
  "june22_avoid_player_head02": "Mua thêm ô trống",
  "june22_avoid_player_desc02": "Mặc định, danh sách né người chơi có 25 ô, nhưng nếu muốn, bạn có thể thêm ô trống bằng cách dùng pha lê.",
  "june22_shards_title": "Mua bằng pha lê",
  "june22_shards_head01": "Hiệu ứng chuỗi giết",
  "june22_shards_desc01": "Trang trí giao diện trong trò chơi với các hiệu ứng đặc biệt chỉ hiện dựa theo chuỗi giết của tướng. Chọn các hiệu ứng như lửa, băng và vàng, với giá mỗi cái 150k pha lê trong cửa hàng.",
  "june22_shards_head02": "Kho báu mùa",
  "june22_shards_desc02": "Kho báu chủ đề mùa hè 2022 đã cập bến và có thể mua bằng pha lê. Không như các kho báu theo mùa khác, ai ai cũng mua được, không chỉ dành riêng cho thành viên Dota Plus.\\n\\nKho báu này bao gồm tất tần tật các bộ vật phẩm mới cho Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit, cũng như Wraith King. Còn có thú vận chuyển Ageless Apothecary kèm ngọc Prismatic và Ethereal ngẫu nhiên cho những ai đủ may mắn hưởng trọn thuốc thần.",
  "june22_shards_head03": "Bộ vật phẩm mùa",
  "june22_shards_desc03": "Lỡ mất cơ hội lấy bộ vật phẩm mình yêu thích trong kho báu Dota Plus? Các bộ kho báu Autumnal 2020 và Wintry 2020 giờ có thể được mua trực tiếp trong cửa hàng pha lê chỉ với giá 15k mỗi bộ.",
  "june22_shards_head04": "Ai cũng có ấn tích",
  "june22_shards_desc04": "Ấn tích tướng giờ có thể mua bởi toàn bộ người chơi chứ không chỉ riêng hội viên Dota Plus. Ai cũng có thể dùng ấn tích để theo dõi thông số và nhận thưởng XP cho tướng, nhưng chỉ hội viên Dota Plus mới vượt được cấp 5.",
  "june22_plus_update_title": "Điểm mới theo mùa cho Dota Plus",
  "june22_plus_update_head01": "Nhiệm vụ Dota Plus",
  "june22_plus_update_desc01": "Cập nhật hôm nay cũng kèm theo một bộ nhiệm vụ Dota Plus mới, giúp bạn gom thêm pha lê để đổi lấy những món đồ ngon nghẻ — lên tới 115.200 pha lê cho cả mùa.",
  "june22_plus_update_head02": "Phần thưởng bang hội",
  "june22_plus_update_desc02": "Chúng tôi cũng cập nhật phần thưởng bang hội theo mùa, bao gồm một loạt biểu tượng cảm xúc, hình sơn, cùng vòng quay tán gẫu mới cho bậc Bạc, Vàng, lẫn Bạch kim.",
  "june22_gameplay_title": "Cập nhật lối chơi 7.31d"
}