// 6708.js

{
  "language": "swedish",
  "june22_title": "Stridsrapportuppdatering",
  "june22_subtitle": "Dota Plus – Sommaren 2022",
  "june22_desc": "Dagens uppdatering för med sig den säsongsenliga Dota Plus-uppdateringen och passar samtidigt på att avslöja än mer. Grotta ned dig i detaljerna om din insats i alla dina matcher föregående säsong med stridsrapporten, utforska ett antal olika spellägen med helgens spotlight, och visa upp dina odödliga föremål på önskat vis med upplåsta odödliga förmågeeffekter. Dessutom väntar en ny skatt, nya och förbättrade funktioner och annat smått och gott – inklusive speluppdatering 7.31d, som hälsar Marci välkommen till Captains Mode.",
  "june22_battle_report_title": "Stridsrapport",
  "june22_battle_report_head01": "Utvald statistik",
  "june22_battle_report_desc01": "Stridsrapporten analyserar din insats i alla dina matcher under föregående säsong för att räkna ut din bästa hjälte, roll och allmän statistik i jämförelse med andra spelare på samma skicklighetsnivå. Det ger ett utmärkt överblick över din säsong.",
  "june22_battle_report_head02": "Höjdpunkter",
  "june22_battle_report_desc02": "Minns du din match där du gjorde en helt galen comeback efter en och en halv timme? Det minns stridsrapporten – och den vet vad som är värt att lägga märke till. Upptäck trender och rekord på den individualiserade skärmen med höjdpunkter. Då har du alltid koll på vad du ska sträva efter härnäst.",
  "june22_battle_report_head03": "Djupanalys",
  "june22_battle_report_desc03": "Behöver du ännu mer statistik? Med stridsrapporten kan du grotta ned dig ännu mer i dina matcher – sortera, filtrera och analysera dem efter hjälte, roll eller individuella matcher. Ta den tid du behöver, allt finns där.",
  "june22_battle_report_head04": "Tjäna belöningar",
  "june22_battle_report_desc04": "När du utforskar din stridsrapport får du guld-, silver- och bronsmedaljer för enastående resultat. Varje medalj ger dig skärvor för din insats: 400 för guld, 300 för silver och 200 för brons.",
  "june22_battle_report_head05": "Exklusivt för Dota Plus",
  "june22_battle_report_desc05": "Stridsrapporten är tillgänglig exklusivt för Dota Plus-medlemmar. I början av varje ny Dota Plus-säsong får alla Dota Plus-medlemmar automatiskt en ny stridsrapport med detaljer från alla deras äventyr i spelet under föregående säsong.",
  "june22_featured_game_mode_title": "Helgens spotlight",
  "june22_featured_game_mode_head01": "Gamla bekanta, nya varianter, skinande skärvor",
  "june22_featured_game_mode_desc01": "Följ med oss till helgens spotlight, en ny kö för den som vill utforska olika spellägen och event i Dota, samtidigt som man samlar på sig Dota Plus-skärvor.",
  "june22_featured_game_mode_head02": "Roterande spellägen",
  "june22_featured_game_mode_desc02": "Det första läget i helgens spotlight är Ability Draft, tillgängligt 8–13 juni. Om du aldrig gett dig på Ability Draft eller inte provat på det nyligen så är nu det perfekta tillfället att gå med i den blomstrande AD-gemenskapen och skapa nya förmågekombinationer till monster med detta läges lättanvända valskärm. Den andra helgspotlighten anländer den 16–20 juni och introducerar Overthrow Trios, som är en snabbare version av originalet.",
  "june22_featured_game_mode_head03": "Starkt sken slocknar snabbt",
  "june22_featured_game_mode_desc03": "Varje helgspotlight är tillgänglig under en begränsad tid. Man får ett begränsat antal Dota Plus-skrävor när man spelar, som blir än mer vid vinst. Häng med under kommande månader när fler helgspotlighter med olika spellägen lyser upp tillvaron.",
  "june22_immortal_fx_title": "Olåsta odödliga förmågeeffekter",
  "june22_immortal_fx_head01": "Med odödlig makt följer stora val",
  "june22_immortal_fx_desc01": "Dina odödliga föremåls förmågeeffekter kan nu utrustas oavsett vilket föremål din hjälte bär. Vill du få Finger of Death-kills med effekten Hell-Spar Anathema fast det är Lion som bär krabbklon Abyssal Hellclaw? Inga problem. Blanda dina effekter med valfritt föremål. Valet är ditt.",
  "june22_match_clips_title": "Klippverktyg",
  "june22_match_clips_head01": "Spara och dela",
  "june22_match_clips_desc01": "Fånga dina favoritögonblick från spelet med det nya klippverktyget. Det är ett praktiskt verktyg som hjälper dig att välja snabbt och spara en högkvalitativ, delbar video medan du tittar på repriser och livematcher.",
  "june22_match_clips_head02": "Klippkontroll",
  "june22_match_clips_desc02": "Fastställ start- och sluttid för ditt klipp med en detaljerad tidslinje som inkluderar dödsfall och kills. Du kan välja det exakta ögonblicket du vill dela utan att det behövs något verktyg från en tredje part.",
  "june22_match_clips_head03": "Utmärkt kvalitet",
  "june22_match_clips_desc03": "Du kan välja avancerade renderingsfunktioner för högkvalitativa skuggor och reflektioner, dolt användargränssnitt i spelet under klippets varaktighet och jämna bildfrekvenser på upp till 90 FPS. Verktyget avkodar direkt till h.264-video på Windows och individuella bildrutor på andra plattformar.",
  "june22_avoid_player_title": "Förbättrad undvik spelare-lista",
  "june22_avoid_player_head01": "Gör anteckningar",
  "june22_avoid_player_desc01": "Kommer du inte ihåg varför du ville undvika en specifik spelare? Då är det bara att skriva ned varför du lade till hen till listan med spelare att undvika.",
  "june22_avoid_player_head02": "Köp fler platser",
  "june22_avoid_player_desc02": "Listan med spelare att undvika har som standard 25 platser, men om du vill ha fler kan du nu utöka listan och få fler platser genom att betala med skärvor.",
  "june22_shards_title": "Köp med skärvor",
  "june22_shards_head01": "Killstreak-effekter",
  "june22_shards_desc01": "Dekorera gränssnittet i spelet med specialeffekter som visas baserat på en hjältes killstreaks. Välj mellan eld-, is- och guldeffekter, vilka är tillgängliga för 150 000 skärvor vardera i skärvbutiken.",
  "june22_shards_head02": "Säsongsskatt",
  "june22_shards_desc02": "Säsongsskatten för sommaren 2022 är här och tillgänglig för köp med skärvor, och till skillnad från tidigare säsongsskatter kan alla köpa den, inte bara Dota Plus-medlemmar.\\n\\nDenna skatt innehåller alla nya set till Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit och Wraith King. Den har också kuriren Ageless Apothecary som inkluderar slumpvalda prismatiska och eteriska juveler för dem som är tursamma nog att få smaka på hans medicin.",
  "june22_shards_head03": "Säsongsset",
  "june22_shards_desc03": "Missade du några av setet i tidigare Dota Plus-skatter? Seten från höstskatten 2020 och vinterskatten 2020 går nu att köpa direkt i skärvbutiken för 15 000 vardera.",
  "june22_shards_head04": "Reliker till alla",
  "june22_shards_desc04": "Alla spelare kan köpa hjältereliker nu, inte bara Dota Plus-medlemmar. Alla kan använda reliker för att spåra statistik och tjäna hjälte-XP, men enbart Dota Plus-medlemmar kan avancera högre än nivå 5.",
  "june22_plus_update_title": "Säsongsuppdatering till Dota Plus",
  "june22_plus_update_head01": "Dota Plus-uppdrag",
  "june22_plus_update_desc01": "Dagens uppdatering medför också en ny uppsättning med Dota Plus-uppdrag så du kan samla på dig skärvor till alla nya godbitar – med upp till 115 200 skärvor under loppet av säsongen.",
  "june22_plus_update_head02": "Gillesbelöningar",
  "june22_plus_update_desc02": "Vi har också uppdaterat de säsongsenliga gillesbelöningarna med en ny uppsättning uttryckssymboler, sprejer och chatthjul för gillen på silver-, guld- och platinanivå.",
  "june22_gameplay_title": "Speluppdatering 7.31d"
}