// 277.js

{
  "language": "danish",
  "june22_title": "Opdatering med kampopsummeringer",
  "june22_subtitle": "Dota Plus sommer 2022",
  "june22_desc": "Dagens opdatering byder på sæsonopfriskninger til Dota Plus og meget mere at afsløre. Få grundige detaljer om din præstation gennem alle dine kampe i sidste sæson med kampopsummeringen, udforsk en række spiltilstande med weekendspotlightet og vis dine udødelige genstandes effekter, ligesom du ønsker det, med oplåste udødelige besværgelseseffekter. Der er en ny skat, nye og forbedrede funktioner samt andre ting i vente – herunder spilopdatering 7.31d, som byder Marci velkommen i Captains Mode.",
  "june22_battle_report_title": "Kampopsummering",
  "june22_battle_report_head01": "Fremhævede statistikker",
  "june22_battle_report_desc01": "Kampopsummeringen analyserer dine præstationer i alle kampe i den forrige sæson og beregner din bedste helt, rolle og generelle statistikker i forhold til andre spillere på dit færdighedsniveau. Et perfekt helhedsbillede af din sæson.",
  "june22_battle_report_head02": "Højdepunkter",
  "june22_battle_report_desc02": "Kan du huske den kamp, hvor I gjorde et sindssygt comeback efter halvanden time? Det kan kampopsummeringen – og den ved, at det er værd at bemærke. Opdag tendenser og rekorder på den individuelle skærm med højdepunkter. Så ved du altid, hvilke mål du skal overgå.",
  "june22_battle_report_head03": "Grundig analyse",
  "june22_battle_report_desc03": "Har du brug for endnu flere statistikker? Kampopsummeringen lader dig dykke langt ned i dine spil: Du kan sortere, filtrere og analysere dem efter helt, rolle eller individuelle kampe. Giv dig god tid, det findes alt sammen der.",
  "june22_battle_report_head04": "Optjen belønninger",
  "june22_battle_report_desc04": "Når du udforsker kampopsummeringen, modtager du guld-, sølv- og bronzemedaljer for dine flotte resultater. Hver medalje giver dig skår for din præstation: 400 for guld, 300 for sølv og 200 for bronze.",
  "june22_battle_report_head05": "Eksklusivt for Dota Plus",
  "june22_battle_report_desc05": "Kampopsummeringen er kun tilgængelig for Dota Plus-medlemmer. I starten af hver nye Dota Plus-sæson får alle Dota Plus-medlemmer automatisk en ny kampopsummering med detaljerede oplysninger om alle deres oplevelser i spillet fra den forrige sæson.",
  "june22_featured_game_mode_title": "Weekendspotlight",
  "june22_featured_game_mode_head01": "Gamle venner, nye drejninger, skinnende skår",
  "june22_featured_game_mode_desc01": "Træd ind i weekendspotlightet: en ny kø, som alle kan bruge til at udforske forskellige Dota-spiltilstande og -begivenheder, mens de forsyner sig med Dota Plus-skår.",
  "june22_featured_game_mode_head02": "Roterende spiltilstande",
  "june22_featured_game_mode_desc02": "Den første tilstand i weekendspotlightet er Ability Draft, som er tilgængelig d. 8.-13. juni. Hvis du aldrig har prøvet Ability Draft eller ikke har prøvet det for nylig, er tiden perfekt til at blive en del af det blomstrende AD-miljø og lave nogle nye stærke evnekombinationer ved hjælp af tilstandens nemme draft-skærm. Det andet weekendspotlight er d. 16.-20. juni, og her introduceres Overthrow Trios, som er en hæsblæsende opdatering af den oprindelige version.",
  "june22_featured_game_mode_head03": "Kraftige lys brænder hurtigt",
  "june22_featured_game_mode_desc03": "Hvert weekendspotlight er tilgængeligt i en begrænset periode. Du får Dota Plus-skår op til en vis grænse, når du spiller, og du får flere, når du vinder. Følg med for at se flere spiltilstande i weekendspotlightet i de kommende måneder, og spil med for at indløse skårbelønninger.",
  "june22_immortal_fx_title": "Oplåste udødelige besværgelseseffekter",
  "june22_immortal_fx_head01": "Med udødelig magt følger det ultimative valg",
  "june22_immortal_fx_desc01": "Udødelige genstandes besværgelseseffekter kan nu udstyres, uanset hvilken genstand din helt bruger. Vil du dræbe fjender med Finger of Death med effekten fra Hell-Spar Anathema, mens du bruger krabbekloen Abyssal Hellclaw i stedet? Kombiner dine effekter med andre genstande, du har. Valget er dit.",
  "june22_match_clips_title": "Videoklipværktøj",
  "june22_match_clips_head01": "Gem og del",
  "june22_match_clips_desc01": "Optag dine yndlingsøjeblikke i spillet med det nye videoklipværktøj – et brugbart værktøj, der hurtigt lader dig vælge og gemme en delevenlig video i høj kvalitet, mens du ser genudsendelser eller direkte kampe.",
  "june22_match_clips_head02": "Redigeringsmuligheder",
  "june22_match_clips_desc02": "Angiv start- og sluttidspunktet for din optagelse med en detaljerig tidslinje, der indeholder spilleres dødsfald og drab. Du kan vælge præcis det øjeblik, du vil dele, uden at skulle bruge tredjepartsværktøjer.",
  "june22_match_clips_head03": "Høj kvalitet",
  "june22_match_clips_desc03": "Du kan vælge avancerede renderingsfunktioner for at få skygger og refleksioner i højere kvalitet, skjule spillets grænsefladeelementer i klippets varighed og udligne billedhastigheden op til 90 FPS. Værktøjet indkoder direkte til h.264-video på Windows, og på andre platforme outputtes individuelle billeder.",
  "june22_avoid_player_title": "\"Undgå spiller\" forbedret",
  "june22_avoid_player_head01": "Dine egne noter",
  "june22_avoid_player_desc01": "Kan du ikke huske, hvorfor du valgte at undgå en bestemt spiller? Skriv en lille note om, hvorfor du tilføjede spilleren til listen over spillere, som undgås.",
  "june22_avoid_player_head02": "Køb flere pladser",
  "june22_avoid_player_desc02": "Listen over undgåede spillere har 25 pladser som standard, men hvis du vil have flere, kan du nu udvide listen med flere pladser ved at bruge skår.",
  "june22_shards_title": "Køb med skår",
  "june22_shards_head01": "Drabsrækkeeffekter",
  "june22_shards_desc01": "Pynt din grænseflade i spillet med særlige effekter, der bliver vist afhængigt af en helts drabsrækker. Vælg mellem ild-, is-, og guldeffekter, som hver kan købes for 150.000 skår i skårshoppen.",
  "june22_shards_head02": "Årstidsskat",
  "june22_shards_desc02": "Sommerens årstidsskat 2022 er ude nu og kan købes for skår, og til forskel fra tidligere årstidsskatte er den tilgængelig for alle kunder, ikke kun Dota Plus-medlemmer.\\n\\nDen nye skat har helt nye sæt til Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit og Wraith King. Der er også kuréren Ageless Apothecary, som inkluderer tilfældige prismatiske og æteriske ædelstene til dem, der er heldige nok til at få hans medicin.",
  "june22_shards_head03": "Årstidssæt",
  "june22_shards_desc03": "Gik du glip af nogen af sættene fra gamle Dota Plus-skatte? Sættene fra efterårsskatten 2020 og vinterskatten 2020 kan nu købes direkte i skårshoppen for 15.000 skår hver.",
  "june22_shards_head04": "Relikvier til alle",
  "june22_shards_desc04": "Helterelikvier kan nu købes for skår af alle spillere, ikke kun Dota Plus-medlemmer. Alle kan nu bruge relikvier til at følge statistikker og optjene ekstra helte-XP, men kun Dota Plus-medlemmer kan passere level 5.",
  "june22_plus_update_title": "Sæsonopfriskning til Dota Plus",
  "june22_plus_update_head01": "Dota Plus-opgaver",
  "june22_plus_update_desc01": "Dagens opdatering indeholder også et nyt sæt Dota Plus-opgaver, så du kan få nogle ekstra skår og anskaffe dig alle de gode sager – op til 115.200 skår i løbet af sæsonen.",
  "june22_plus_update_head02": "Guild-belønninger",
  "june22_plus_update_desc02": "Vi har også opdateret de sæsonbestemte guild-belønninger med et nyt sæt emotikoner, sprays og chathjulsreplikker for guilds på sølv-, guld- og platinniveau.",
  "june22_gameplay_title": "Spilopdatering 7.31d"
}