// 1374.js

{
  "language": "koreana",
  "june22_title": "전투 보고서 업데이트",
  "june22_subtitle": "도타 플러스 2022년 여름",
  "june22_desc": "오늘 업데이트에서는 도타 플러스 시즌 업데이트와 더불어 더 많은 내용을 새롭게 선보입니다. 전투 리포트로 지난 시즌 자신이 했던 모든 매치에서 경기력이 어땠는지 자세히 파헤쳐보거나, 주말 시선 집중으로 다양한 게임 모드를 즐겨보거나, 불멸 주문 효과를 해제하여 불멸 아이템을 원하는 대로 꾸며볼 수 있습니다. 새로운 보물, 신규 및 개선된 기능, 그 외 여러 가지 콘텐츠와 더불어 마르시가 캡틴 모드에 처음 등장하는 7.31d 게임플레이 업데이트까지 다양하게 즐겨보시기 바랍니다.",
  "june22_battle_report_title": "전투 보고서",
  "june22_battle_report_head01": "특선 통계",
  "june22_battle_report_desc01": "전투 리포트는 지난 시즌 자신이 했던 모든 매치에서의 경기력을 분석하여 최고의 영웅, 역할, 전체 통계를 비슷한 실력의 다른 플레이어와 비교하여 계산해 줍니다. 이는 시즌 전체를 완벽하게 갈무리하는 고급 정보입니다.",
  "june22_battle_report_head02": "하이라이트",
  "june22_battle_report_desc02": "1시간 반이나 이어졌다가 말도 안 되는 역전이 일어난 게임을 기억하시나요? 전투 보고서가 있다면 확실히 기억할 수 있습니다. 그리고 주목할 가치가 있음을 되새기게 해줍니다. 개별 하이라이트 화면에서 경향과 기록을 확인해 보세요. 항상 다음으로 깨야 할 기록을 파악하고 도전에 나설 수 있습니다.",
  "june22_battle_report_head03": "심화 분석",
  "june22_battle_report_desc03": "더 많은 통계가 필요하신가요? 전투 보고서에서는 영웅, 역할, 개별 매치별로 정렬, 분류, 분석하여 했던 게임을 심도 있게 파헤쳐 볼 수 있도록 도와줍니다. 찬찬히 둘러보세요. 온갖 정보가 다 준비되어 있습니다.",
  "june22_battle_report_head04": "보상 받기",
  "june22_battle_report_desc04": "전투 보고서를 확인할 때 눈에 띄는 성과에 따라 금, 은, 동메달을 받습니다. 메달별로 금메달은 파편 400개, 은메달은 파편 300개, 동메달은 파편 200개가 지급됩니다.",
  "june22_battle_report_head05": "도타 플러스 독점 제공",
  "june22_battle_report_desc05": "전투 보고서는 도타 플러스 회원에게만 독점 제공됩니다. 새로운 도타 플러스 시즌이 시작될 때마다, 모든 도타 플러스 회원은 자동으로 이전 시즌의 게임 내 모든 활동이 자세하게 정리된 전투 보고서를 받습니다.",
  "june22_featured_game_mode_title": "주말 시선 집중",
  "june22_featured_game_mode_head01": "오래된 친구, 새로운 변형, 반짝이는 파편",
  "june22_featured_game_mode_desc01": "주말 시선 집중을 함께 즐겨보세요. 누구나 다양한 도타 게임 모드와 이벤트를 모두 즐기며 도타 플러스 파편을 확보할 수 있는 신규 방식입니다.",
  "june22_featured_game_mode_head02": "순환식 게임 모드",
  "june22_featured_game_mode_desc02": "주말 시선 집중의 첫 번째 모드는 능력 조합으로 6월 8일~13일에 이용할 수 있습니다. 능력 조합을 한 번도 경험해보지 못했거나 한동안 즐기지 않은 분이라면 이번 기회에 계속 성장하는 능력 조합 커뮤니티에 가담하고, 편리한 조합 화면을 사용하여 어마어마한 능력 조합을 새롭게 완성해보세요. 두 번째 주말 시선 집중은 원래보다 더 빠르게 즐길 수 있도록 개편된 '타도 3인조'로 6월 16일~20일에 진행됩니다.",
  "june22_featured_game_mode_head03": "밝은 불꽃은 빠르게 타버리는 법",
  "june22_featured_game_mode_desc03": "매주 주말 시선 집중은 일정 제한된 기간에만 이용할 수 있습니다. 이를 플레이하면 도타 플러스 파편을 정해진 한도까지 획득하며, 승리하면 추가 파편을 얻습니다. 앞으로 몇 달 동안 주말 시선 집중에서 소개될 게임 모드를 관심 있게 지켜봐 주세요. 그리고 직접 참여하여 넉넉한 파편 보상을 챙기는 것도 잊지 마시기 바랍니다.",
  "june22_immortal_fx_title": "불멸 주문 효과 해제",
  "june22_immortal_fx_head01": "불멸의 힘에는 궁극의 선택이 필요하다",
  "june22_immortal_fx_desc01": "이제 영웅이 착용한 아이템에 상관없이 불멸 아이템의 주문 효과를 장착할 수 있습니다. 심연의 지옥발톱을 착용한 라이온에게 '지옥섬광의 독설' 효과로 죽음의 손가락 처치 수를 적용하고 싶으신가요? 문제없습니다. 소유한 아무 아이템으로 효과를 다양하게 섞어 조합해 보세요. 선택은 모두 여러분의 몫입니다.",
  "june22_match_clips_title": "클립 제작 도구",
  "june22_match_clips_head01": "저장하고 공유하세요",
  "june22_match_clips_desc01": "새로운 클립 제작 도구로 게임 안에서 맘에 들었던 순간을 포착해 보세요. 이 유용한 도구만 있으면 리플레이나 실시간 게임을 보는 동안 공유할 고품질 동영상을 빠르게 선택하고 저장할 수 있습니다.",
  "june22_match_clips_head02": "클립 제어",
  "june22_match_clips_desc02": "플레이어의 죽음과 처치를 포함하여 세밀하게 표시된 시간 표시줄에서 클립의 시작과 끝 시간을 지정해 주세요. 별도의 외부 도구 없이 공유하고 싶은 바로 그 순간을 선택할 수 있습니다.",
  "june22_match_clips_head03": "프리미엄 품질",
  "june22_match_clips_desc03": "고급 렌더링 기능을 선택하여 더 좋은 품질의 그림자와 반사 효과를 얻거나, 클립의 전체 시간 동안 게임 안 UI를 감춰두거나, 최대 90fps까지 부드러운 프레임 속도를 사용할 수 있습니다. 도구 사용 시 Windows에서는 h.264 동영상으로 직접 인코딩되며, 다른 플랫폼에서는 별도의 프레임 속도로 출력됩니다.",
  "june22_avoid_player_title": "기피 플레이어 개선",
  "june22_avoid_player_head01": "메모 남기기",
  "june22_avoid_player_desc01": "어느 플레이어를 무슨 이유로 기피하는지 기억이 잘 나지 않으신다고요? 기피 플레이어 목록에 해당 플레이어를 추가했던 이유를 메모로 남겨 놓으세요.",
  "june22_avoid_player_head02": "추가 칸 구매",
  "june22_avoid_player_desc02": "기피 플레이어 목록은 기본으로 25칸이 제공되지만, 이제 파편으로 추가 칸을 획득하여 목록을 더 확장할 수 있습니다.",
  "june22_shards_title": "파편으로 구매",
  "june22_shards_head01": "연속 처치 효과",
  "june22_shards_desc01": "게임 안 인터페이스를 영웅의 연속 처치에 따라 특별한 효과로 꾸며보세요. 해당 효과는 파편 상점에서 파편 150,000개로 판매되며 불, 얼음, 황금 효과를 선택할 수 있습니다.",
  "june22_shards_head02": "시즌 보물",
  "june22_shards_desc02": "2022 여름 계절 보물이 출시되어 파편으로 구매할 수 있습니다. 이전 계절 보물과는 달리, 도타 플러스 회원뿐만 아니라 모든 플레이어에게 허용됩니다.\\n\\n해당 보물에는 번개 감시자, 죽음의 예언자, 불꽃령, 가면무사, 닉스 암살자, 우르사, 복수 혼령, 망령 제왕을 위한 신규 세트가 들어 있습니다. 또한, 무작위 프리즘 및 에테르 보석이 포함된 '불로불사의 약제사' 짐꾼이 들어 있어 운이 따른다면 특별한 치료를 받는 대상이 될 수 있습니다.",
  "june22_shards_head03": "시즌 세트",
  "june22_shards_desc03": "아쉽게 놓쳤던 이전 도타 플러스 보물 세트를 갖고 싶으신가요? 2020 가을 보물과 2020 겨울 보물에 있던 세트를 파편 상점에서 1개당 파편 15,000개로 구매할 수 있습니다.",
  "june22_shards_head04": "모두를 위한 유물",
  "june22_shards_desc04": "이제 영웅 유물을 도타 플러스 회원뿐만이 아니라 모든 플레이어가 파편으로 구매할 수 있습니다. 누구나 유물로 통계를 추적하고 보너스 영웅 경험치를 획득할 수 있지만, 5레벨을 초과하여 올리려면 도타 플러스 회원으로 가입해야 합니다.",
  "june22_plus_update_title": "도타 플러스 시즌 개편",
  "june22_plus_update_head01": "도타 플러스 퀘스트",
  "june22_plus_update_desc01": "오늘 업데이트에서 새로운 도타 플러스 퀘스트가 추가되어 새롭게 선보이는 아이템에 필요한 파편을 두둑이 확보할 수 있습니다. 파편은 시즌이 진행되는 동안 최대 115,200개까지 제공됩니다.",
  "june22_plus_update_head02": "길드 보상",
  "june22_plus_update_desc02": "또한, 시즌 길드 보상으로 은, 금, 백금 등급 길드를 위해 새로운 이모티콘, 바닥그림, 휠 대화 세트를 추가했습니다.",
  "june22_gameplay_title": "게임플레이 업데이트 7.31d"
}