// 3853.js

{
  "language": "portuguese",
  "june22_title": "Atualização do Relatório de Batalha",
  "june22_subtitle": "Dota Plus – Verão de 2022",
  "june22_desc": "A atualização de hoje inclui as tradicionais alterações sazonais ao Dota Plus e aproveita para revelar ainda mais. Explora os detalhes do teu desempenho em todas as tuas partidas da temporada passada com o Relatório de Batalha, explora diferentes modos de jogo no Destaque do Fim de Semana e exibe os teus itens Imortais da forma que quiseres com efeitos Imortais desbloqueados. Há também um tesouro novo, funcionalidades que se estão a estrear, outras que foram atualizadas e muito mais — como a atualização de jogabilidade 7.31d, que adiciona a Marci ao Modo de Capitães.",
  "june22_battle_report_title": "Relatório de Batalha",
  "june22_battle_report_head01": "Estatísticas principais",
  "june22_battle_report_desc01": "O Relatório de Batalha analisa o teu desempenho em todas as partidas da temporada anterior para calcular qual é o teu melhor herói, cargo e estatísticas gerais em comparação com outros jogadores de um nível de habilidade semelhante ao teu. É o resumo perfeito da tua temporada.",
  "june22_battle_report_head02": "Destaques",
  "june22_battle_report_desc02": "Lembras-te daquela partida que teve uma reviravolta impressionante depois de uma hora e meia de jogo? O Relatório de Batalha lembra-se e sabe que merece ser destacada. Descobre tendências e recordes no menu de Destaques individuais. Assim, saberás sempre qual a próxima meta a ultrapassar.",
  "june22_battle_report_head03": "Análise aprofundada",
  "june22_battle_report_desc03": "Queres ainda mais estatísticas? O Relatório de Batalha permite-te estudar a fundo as tuas partidas. Organiza-as, filtra-as e analisa-as por herói, por cargo ou individualmente. Podes ver com calma, está lá tudo.",
  "june22_battle_report_head04": "Ganha recompensas",
  "june22_battle_report_desc04": "Explora o teu Relatório de Batalha e ganha medalhas de ouro, prata e bronze pelos teus resultados excecionais. Cada medalha dá-te Fragmentos pelos teus feitos: 400 por cada medalha de ouro, 300 por cada uma de prata e 200 por cada uma de bronze.",
  "june22_battle_report_head05": "Exclusivo do Dota Plus",
  "june22_battle_report_desc05": "O Relatório de Batalha está disponível exclusivamente para membros do Dota Plus. No início de cada nova temporada do Dota Plus, todos os membros irão receber automaticamente um novo Relatório de Batalha que detalha todas as suas aventuras da temporada anterior no jogo.",
  "june22_featured_game_mode_title": "Destaque do Fim de Semana",
  "june22_featured_game_mode_head01": "Velhos amigos, novas regras, fragmentos brilhantes",
  "june22_featured_game_mode_desc01": "Experimenta connosco o Destaque do Fim de Semana, uma nova fila de matchmaking que permite a todos os jogadores explorar vários modos de jogo e eventos do Dota enquanto ganham Fragmentos do Dota Plus.",
  "june22_featured_game_mode_head02": "Modos de jogo em rotação",
  "june22_featured_game_mode_desc02": "O primeiro modo de jogo do Destaque do Fim de Semana vai ser o modo de Seleção de Habilidades, disponível de 8 a 13 de junho. Se nunca tocaste neste modo ou não o experimentaste recentemente, agora é a altura perfeita para te juntares à comunidade da SH e criar umas combinações monstrosas de habilidades com o intuitivo menu de seleção. O segundo Destaque do Fim de Semana, de 16 a 20 de junho, vai ser Overthrow 3v3v3: uma versão mais frenética do modo original.",
  "june22_featured_game_mode_head03": "Uma chama brilhante apaga-se num instante",
  "june22_featured_game_mode_desc03": "Cada Destaque do Fim de Semana só estará disponível por tempo limitado. Ao jogá-lo, será possível obter Fragmentos do Dota Plus até um certo limite, com vitórias a conceder mais Fragmentos. Fica de olho em mais modos de jogo disponíveis no Destaque de Fim de Semana nos próximos meses. Depois participa e ganha esses Fragmentos!",
  "june22_immortal_fx_title": "Efeitos desbloqueados de itens Imortais",
  "june22_immortal_fx_head01": "Um poder imortal exige a escolha ideal",
  "june22_immortal_fx_desc01": "Os efeitos de habilidades dos teus itens Imortais podem agora ser equipados independentemente do item que o teu herói tiver equipado. Queres matar inimigos com Finger of Death, mas com o efeito da garra Hell-Spar Anathema enquanto o Lion tem a pinça Abyssal Hellclaw equipada? Dito e feito. Mistura e combina os teus efeitos com qualquer item que tiveres. A escolha é tua.",
  "june22_match_clips_title": "Criador de clips",
  "june22_match_clips_head01": "Guarda e partilha",
  "june22_match_clips_desc01": "Captura os teus momentos favoritos do jogo com o novo Criador de Clips, uma ferramenta conveniente que te ajuda a escolher e a guardar um vídeo partilhável de alta qualidade enquanto assistes a repetições ou a partidas em direto.",
  "june22_match_clips_head02": "Controla o clip",
  "june22_match_clips_desc02": "Define o início e o fim do teu clip com uma linha de tempo detalhada que inclui os momentos em que jogadores morreram ou mataram alguém. Poderás escolher o momento exato que queres partilhar sem precisares de ferramentas externas.",
  "june22_match_clips_head03": "Alta qualidade",
  "june22_match_clips_desc03": "Podes selecionar funcionalidades avançadas de renderização para que o clip tenha sombras e reflexos de alta qualidade, ocultar a interface do jogo durante o clip e suavizar a taxa de frames para até 90 fps. No Windows, a ferramenta codifica diretamente um vídeo no formato H.264. Noutras plataformas, cada frame individual será exportada como uma imagem, juntamente com a faixa de áudio em separado.",
  "june22_avoid_player_title": "Lista de jogadores evitados melhorada",
  "june22_avoid_player_head01": "Deixa uma nota",
  "june22_avoid_player_desc01": "Não te lembras porque decidiste evitar um certo jogador? Então guarda uma nota para saberes porque adicionaste um determinado jogador à lista de jogadores evitados.",
  "june22_avoid_player_head02": "Compra mais espaços",
  "june22_avoid_player_desc02": "Por predefinição, a lista de jogadores evitados tem 25 espaços. Contudo, se quiseres mais, agora podes comprar espaços adicionais com Fragmentos.",
  "june22_shards_title": "Compra com fragmentos",
  "june22_shards_head01": "Efeitos de séries de assassínios",
  "june22_shards_desc01": "Decora a interface do jogo com efeitos especiais que aparecem com base nas séries de assassínios de um herói. Escolhe entre efeitos dourados, de fogo e de gelo, disponíveis na Loja de Fragmentos por 150.000 Fragmentos cada.",
  "june22_shards_head02": "Tesouro sazonal",
  "june22_shards_desc02": "O tesouro sazonal de verão de 2022 já chegou e pode ser comprado com Fragmentos. Além disso, pela primeira vez, está disponível para todos os jogadores, não só para membros do Dota Plus.\\n\\nEste tesouro contém conjuntos inéditos para os heróis Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit e Wraith King. Se tiveres sorte, também poderás receber o estafeta \"Ageless Apothecary\", que vem pré-equipado com joias prismáticas e cinéticas aleatórias.",
  "june22_shards_head03": "Conjuntos sazonais",
  "june22_shards_desc03": "Não tiveste oportunidade de adquirir alguns dos conjuntos de tesouros passados do Dota Plus? Os conjuntos do Tesouro Outonal 2020 e do Tesouro Invernal 2020 podem agora ser comprados diretamente na Loja de Fragmentos por 15.000 Fragmentos cada.",
  "june22_shards_head04": "Relíquias para todos",
  "june22_shards_desc04": "Relíquias de heróis agora podem ser compradas com Fragmentos por todos os jogadores, não só por membros do Dota Plus. Todos podem usar relíquias para acompanhar as suas estatísticas e ganhar experiência adicional para heróis, mas só membros do Dota Plus podem avançar para além do nível 5.",
  "june22_plus_update_title": "Atualização sazonal do Dota Plus",
  "june22_plus_update_head01": "Missões do Dota Plus",
  "june22_plus_update_desc01": "A atualização de hoje também vem com um novo conjunto de missões exclusivas do Dota Plus para te ajudarem a juntar até um máximo de 115.200 Fragmentos ao longo da temporada, os quais podes usar para obter as últimas novidades da Loja de Fragmentos.",
  "june22_plus_update_head02": "Recompensas de clãs",
  "june22_plus_update_desc02": "Também atualizámos as recompensas de clãs, com novos emoticons, sprays e mensagens da Chat Wheel para clãs nos patamares de Prata, Ouro e Platina.",
  "june22_gameplay_title": "Atualização de jogabilidade 7.31d"
}