// 9542.js

{
  "language": "french",
  "june22_title": "Mise à jour du rapport de bataille",
  "june22_subtitle": "Dota Plus — été 2022",
  "june22_desc": "Au cœur de cette nouvelle mise à jour, retrouvez l'actualisation saisonnière de Dota Plus ainsi qu'une panoplie de surprises. Analysez en détail vos performances au cours des matchs de la saison dernière grâce au nouveau rapport de bataille, essayez les modes de jeu mis en avant par le coup de projecteur du weekend, et équipez à souhait vos effets de sorts immortels pour en mettre plein la vue aux autres. Découvrez un nouveau trésor, des fonctionnalités inédites et améliorées, et bien plus, dont la mise à jour du gameplay 7.31d, qui signe l'ajout de Marci au Captains Mode.",
  "june22_battle_report_title": "Rapport de bataille",
  "june22_battle_report_head01": "Des statistiques détaillées",
  "june22_battle_report_desc01": "Le rapport de bataille analyse vos performances au cours de tous les matchs de la saison dernière et les compare avec celles des personnes de même rang afin de déterminer votre unité héroïque et votre rôle de prédilection et recueillir vos meilleures statistiques. C'est le résumé idéal de votre saison.",
  "june22_battle_report_head02": "Moments forts",
  "june22_battle_report_desc02": "Vous vous souvenez de la partie au cours de laquelle vous avez fait une remontée incroyable après une heure et demie de jeu ? Le rapport de bataille, lui, s'en souvient et en a bien pris note. Consultez l'onglet des moments forts pour découvrir un résumé personnalisé de vos tendances et de vos exploits. Ainsi, vous aurez toujours en tête un nouvel objectif à dépasser.",
  "june22_battle_report_head03": "Analyse approfondie",
  "june22_battle_report_desc03": "Le rapport de bataille vous laisse assouvir votre soif de statistiques : triez, filtrez et analysez par unité héroïque jouée, par rôle endossé, ou bien par partie individuelle. Prenez tout le temps dont vous avez besoin pour revenir en détail sur vos matchs.",
  "june22_battle_report_head04": "Obtenez des récompenses",
  "june22_battle_report_desc04": "Le rapport de bataille récompense aussi vos efforts : vous recevrez des médailles en or, en argent et en bronze pour honorer vos performances exceptionnelles. Chaque médaille vous accorde des fragments : 400 pour la médaille d'or, 300 pour la médaille d'argent et 200 pour la médaille de bronze.",
  "june22_battle_report_head05": "Accès exclusif aux membres de Dota Plus",
  "june22_battle_report_desc05": "Le rapport de bataille est une fonctionnalité exclusive pour les membres de Dota Plus. Au début de chaque saison Dota Plus, chaque membre recevra un nouveau rapport de bataille qui reviendra en détail sur ses aventures en jeu de la saison précédente.",
  "june22_featured_game_mode_title": "Coup de projecteur du weekend",
  "june22_featured_game_mode_head01": "Retrouvailles, nouvelles rencontres et fragments à gogo",
  "june22_featured_game_mode_desc01": "Entrez en scène et jouez à une myriade de modes de jeu Dota mis en avant par le coup de projecteur et disponibles pour tout le monde. En prime, vous pourrez même faire une provision de fragments Dota Plus.",
  "june22_featured_game_mode_head02": "Succession de modes de jeu",
  "june22_featured_game_mode_desc02": "Le premier mode de jeu mis en avant par le coup de projecteur du weekend est Ability Draft, du 8 au 13 juin. C'est le moment parfait pour vous y essayer ou pour le redécouvrir : vous pourrez ainsi rejoindre la communauté florissante et créer des combinaisons de capacités redoutables grâce à l'écran de sélection intuitif. Le deuxième coup de projecteur mettra en avant Overthrow Trios, une version plus rapide du mode original.",
  "june22_featured_game_mode_head03": "Pas de temps à perdre",
  "june22_featured_game_mode_desc03": "Les coups de projecteur du weekend ne durent que quelques jours. Participez à l’évènement pour recevoir un nombre limite de fragments Dota Plus, et remportez des parties pour en obtenir encore davantage. Au cours des prochains mois, de nouveaux modes de jeu seront mis en avant afin de vous faire gagner un maximum de récompenses.",
  "june22_immortal_fx_title": "Effets immortels illimités",
  "june22_immortal_fx_head01": "Un pouvoir immortel implique la liberté de choisir",
  "june22_immortal_fx_desc01": "Les effets de sorts de vos items immortels peuvent maintenant être équipés, peu importe ce que porte votre unité héroïque. Vous voulez augmenter votre compteur de victimes de Finger of Death avec l'effet de l'anathème infernal tout en revêtant la griffe infernale abyssale ? C'est maintenant possible ! Combinez et mélangez à souhait les effets de tous vos items : le choix vous appartient.",
  "june22_match_clips_title": "Générateur d'extraits",
  "june22_match_clips_head01": "Enregistrez et partagez",
  "june22_match_clips_desc01": "Grâce au nouveau générateur d'extraits, gardez une trace des moments forts de vos matchs. Que vous regardiez une partie en direct ou que vous soyez vous-même en jeu, cet outil pratique vous permet de choisir rapidement un extrait et de l'enregistrer sous la forme d'une vidéo de haute qualité que vous pourrez ensuite partager.",
  "june22_match_clips_head02": "Contrôles",
  "june22_match_clips_desc02": "Définissez le début et la fin de votre extrait à l'aide d'une frise chronologique détaillée qui inclut les morts et les victimes. Ainsi, vous pouvez choisir le moment exact que vous voulez partager sans recourir au moindre outil tiers.",
  "june22_match_clips_head03": "Enregistrement de haute qualité",
  "june22_match_clips_desc03": "L'outil vous permet d'accéder à des fonctionnalités de rendu avancées pour améliorer la qualité des ombres et des reflets, de masquer l'interface en jeu pour la durée de l'extrait et de fluidifier la vidéo jusqu'à 90 IPS. Sous Windows, l'extrait est automatiquement encodé au format H.264. Sur les autres plateformes, chaque image est exportée individuellement, avec la piste audio.",
  "june22_avoid_player_title": "Liste des personnes à éviter améliorée",
  "june22_avoid_player_head01": "Prenez des notes",
  "june22_avoid_player_desc01": "Vous ne vous souvenez plus pourquoi vous avez décidé d'éviter une personne en particulier ? Vous pouvez maintenant ajouter une note pour chaque personne ajoutée à votre liste.",
  "june22_avoid_player_head02": "Achetez des emplacements",
  "june22_avoid_player_desc02": "Par défaut, la liste des personnes à éviter inclut 25 emplacements. Si vous le souhaitez, vous pouvez maintenant échanger vos fragments contre de nouveaux emplacements.",
  "june22_shards_title": "Nouveautés dans la boutique des fragments",
  "june22_shards_head01": "Effets de séries de victimes",
  "june22_shards_desc01": "Personnalisez votre interface en jeu avec des effets spéciaux qui s'affichent selon votre nombre de victimes d'affilée. Faites votre choix parmi des effets d'or, de flammes et de glace, disponibles à l'unité pour 150 000 fragments dans la boutique.",
  "june22_shards_head02": "Trésor saisonnier",
  "june22_shards_desc02": "Le trésor saisonnier de l'été 2022 est maintenant disponible et peut être acheté en échange de fragments. Contrairement aux saisons précédentes, ce trésor n'est pas réservé aux membres de Dota Plus : tout le monde peut l'acquérir.\\n\\nCe trésor comprend de tout nouveaux ensembles pour Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit et Wraith King. Et si la chance vous sourit, vous pourrez même obtenir le coursier « Apothicaire intemporel », prééquipé de gemmes prismatiques et éthérées aléatoires.",
  "june22_shards_head03": "Ensembles saisonniers",
  "june22_shards_desc03": "Vous avez raté l'occasion d'obtenir des ensembles mis en avant dans d'anciens trésors Dota Plus ? C'est votre jour de chance : les ensembles des trésors d'automne et d'hiver 2020 peuvent maintenant être achetés depuis la boutique des fragments pour 15 000 fragments chacun.",
  "june22_shards_head04": "Distribution générale de reliques",
  "june22_shards_desc04": "Tout le monde peut maintenant échanger ses fragments contre des reliques héroïques : cette fonctionnalité n'est plus exclusive aux membres de Dota Plus. N'importe qui peut suivre ses statistiques et obtenir davantage d'expérience pour augmenter le niveau de ses héros et héroïnes, mais la progression au-delà du niveau 5 est réservée aux membres de Dota Plus.",
  "june22_plus_update_title": "Actualisation saisonnière de Dota Plus",
  "june22_plus_update_head01": "Quêtes de Dota Plus",
  "june22_plus_update_desc01": "Cette nouvelle mise à jour comprend également de nouvelles quêtes pour les membres de Dota Plus, qui peuvent vous permettre de cumuler jusqu'à 115 200 fragments tout au long de la saison pour acquérir les dernières nouveautés.",
  "june22_plus_update_head02": "Récompenses de guilde",
  "june22_plus_update_desc02": "Les récompenses de guilde ont également été mises à jour : de nouveaux graffitis, émoticônes et répliques seront accordés aux membres de guildes aux rangs argent, or et platine.",
  "june22_gameplay_title": "Mise à jour du gameplay 7.31d"
}