// 976.js

{
  "language": "english",
  "june22_title": "Battle Report Update",
  "june22_subtitle": "Dota Plus Summer 2022",
  "june22_desc": "Today's update commandeers the seasonal Dota Plus refresh and takes the chance to unveil even more. Dig into the details of your performance across all your matches last season with the Battle Report, explore a variety of game modes with the Weekend Spotlight, and show off your Immortals however you please with Unlocked Immortal Spell Effects. There is a new treasure, new and improved features, and other things in store — including Gameplay Update 7.31d, which welcomes Marci's arrival to Captains Mode.",
  "june22_battle_report_title": "Battle Report",
  "june22_battle_report_head01": "Featured Stats",
  "june22_battle_report_desc01": "The Battle Report analyzes your performance across all of your matches in the previous season to calculate your best hero, role, and overall stats compared to other players at your skill level. The perfect high-level snapshot of your season.",
  "june22_battle_report_head02": "Highlights",
  "june22_battle_report_desc02": "Remember your game with a crazy comeback after an hour and a half? The Battle Report does — and knows it's noteworthy. Discover trends and records on the individualized Highlights screen. You'll always know the next benchmark to beat.",
  "june22_battle_report_head03": "Deep Analysis",
  "june22_battle_report_desc03": "Need even more stats? The Battle Report lets you dig deep into your games — sorting, filtering, and analyzing them by hero, role, or individual matches. Take your time; it's all there.",
  "june22_battle_report_head04": "Earn Rewards",
  "june22_battle_report_desc04": "As you explore your Battle Report, you'll receive Gold, Silver, and Bronze medals for outstanding results. Each medal awards you Shards for your accomplishment: 400 for Gold, 300 for Silver, and 200 for Bronze.",
  "june22_battle_report_head05": "Dota Plus Exclusive",
  "june22_battle_report_desc05": "The Battle Report is available exclusively for Dota Plus members. At the beginning of every new Dota Plus season, all Dota Plus members automatically receive a new Battle Report detailing all of their in-game adventures from the previous season.",
  "june22_featured_game_mode_title": "Weekend Spotlight",
  "june22_featured_game_mode_head01": "Old Friends, New Twists, Shiny Shards",
  "june22_featured_game_mode_desc01": "Step with us into the Weekend Spotlight, a new queue for everyone to explore an assortment of Dota game modes and events all while stocking up on Dota Plus Shards.",
  "june22_featured_game_mode_head02": "Rotating Game Modes",
  "june22_featured_game_mode_desc02": "The first mode in the Weekend Spotlight is Ability Draft, available June 8-13. If you've never dabbled in Ability Draft or haven't tried recently, now is the perfect time to join the thriving AD community and create some monster new ability combos using the mode's easy-to-use draft screen. The second Weekend Spotlight arrives June 16-20 to introduce Overthrow Trios, a fast-paced update of the original version.",
  "june22_featured_game_mode_head03": "Bright Lights Burn Fast",
  "june22_featured_game_mode_desc03": "Each Weekend Spotlight is available for a limited time. Playing will award Dota Plus Shards up to a set limit, with wins earning more Shards. Stay tuned for more game modes to shine in the Weekend Spotlight in the coming months. Then join in and reap the Shard Rewards.",
  "june22_immortal_fx_title": "Unlocked Immortal Spell Effects",
  "june22_immortal_fx_head01": "Immortal Power Demands Ultimate Choice",
  "june22_immortal_fx_desc01": "Your Immortal Item spell effects can now be equipped regardless of which item your hero is wearing. Want to earn Finger of Death kills with the Hell-Spar Anathema effect while wearing the Abyssal Hellclaw crab claw on Lion instead? No problem. Mix and match your effects with any item you have. The choice is yours.",
  "june22_match_clips_title": "Clip Builder",
  "june22_match_clips_head01": "Save and Share",
  "june22_match_clips_desc01": "Capture your favorite in-game moments with the new Clip Builder, a handy tool that helps you quickly choose and save out a high-quality shareable video while you're spectating replays or live games.",
  "june22_match_clips_head02": "Clip Controls",
  "june22_match_clips_desc02": "Define the start and end time for your clip with a fine-grained timeline that includes player deaths and kills. You'll be able to choose the exact moment you want to share with no 3rd-party tools required.",
  "june22_match_clips_head03": "Premium Quality",
  "june22_match_clips_desc03": "You can choose advanced rendering features for higher-quality shadows and reflections, hidden in-game UI for the duration of the clip, and smooth framerates up to 90fps. The tool directly encodes to h.264 video on Windows, and other platforms output individual frames.",
  "june22_avoid_player_title": "Improved Avoid Player",
  "june22_avoid_player_head01": "Take Notes",
  "june22_avoid_player_desc01": "Can't remember why you decided to avoid a specific player? Just save a note to include why you added a player to the avoid player list.",
  "june22_avoid_player_head02": "Purchase More Slots",
  "june22_avoid_player_desc02": "The Avoid Player list has 25 slots by default, but if you prefer more, you can now expand the list by using Shards to gain additional slots.",
  "june22_shards_title": "Purchase with Shards",
  "june22_shards_head01": "Kill Streak Effects",
  "june22_shards_desc01": "Decorate your in-game interface with special effects that show up based on a hero's kill streaks. Choose between Fire, Ice, and Gold effects, available for 150,000 Shards each in the Shard Shop.",
  "june22_shards_head02": "Seasonal Treasure",
  "june22_shards_desc02": "The Summer 2022 Seasonal Treasure is here and available for purchase with Shards, and unlike with previous seasonal treasures, all customers are eligible, not just Dota Plus members.\\n\\nThis treasure features all new sets for Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit, and Wraith King. There's also the Ageless Apothecary courier that includes random prismatic and ethereal gems for those lucky enough to merit his medicine.",
  "june22_shards_head03": "Seasonal Sets",
  "june22_shards_desc03": "Missed your chance on some of the sets from older Dota Plus treasures? The sets from the Autumnal Treasure 2020 and Wintry Treasure 2020 are now available for direct purchase in the Shard Shop for 15,000 Shards each.",
  "june22_shards_head04": "Relics For Everyone",
  "june22_shards_desc04": "Hero Relics can now be purchased for Shards by all players, not just Dota Plus members. Everyone can now use Relics to track their stats and earn bonus Hero XP, but only Dota Plus members can advance beyond level 5.",
  "june22_plus_update_title": "Dota Plus Seasonal Refresh",
  "june22_plus_update_head01": "Dota Plus Quests",
  "june22_plus_update_desc01": "Today's update also comes with a new set of Dota Plus quests to shore up your Shard stash for all the new goodies — offering up to 115,200 Shards over the course of the season.",
  "june22_plus_update_head02": "Guild Rewards",
  "june22_plus_update_desc02": "We've also updated the seasonal guild rewards with a new set of emoticons, sprays, and chat wheels for Silver, Gold, and Platinum tier guilds.",
  "june22_gameplay_title": "Gameplay Update 7.31d",
  "NoCommaStub": ""
}