// 9421.js

{
  "language": "thai",
  "june22_title": "อัปเดตรายงานการต่อสู้",
  "june22_subtitle": "Dota Plus ฤดูร้อน 2022",
  "june22_desc": "อัปเดตในวันนี้มาพร้อมกับการปรับเปลี่ยน Dota Plus ประจำฤดูกาล รวมทั้งถือโอกาสเปิดตัวคุณสมบัติต่าง ๆ มากมาย เจาะลึกรายละเอียดผลงานของคุณทุกแมตช์ตลอดฤดูกาลที่ผ่านมาด้วยรายงานการต่อสู้ สำรวจหลากหลายโหมดเกมด้วยเกมเด่นสุดสัปดาห์ และอวดโฉมไอเท็ม Immortal ของคุณได้ดังใจต้องการด้วยคุณสมบัติปลดล็อคเอฟเฟกต์สกิลไอเท็ม Immortal อีกทั้งยังมีสมบัติใหม่ คุณสมบัติใหม่ที่ได้รับการปรับปรุง และสิ่งอื่น ๆ อันแน่นเต็มเปี่ยม รวมถึงอัปเดตเกมเพลย์ 7.31d ซึ่งต้อนรับการมาถึงของ Marci สู่ Captains Mode",
  "june22_battle_report_title": "รายงานการต่อสู้",
  "june22_battle_report_head01": "สถิติโดดเด่น",
  "june22_battle_report_desc01": "รายงานการต่อสู้จะวิเคราะห์ผลงานของคุณในทุกแมตช์ตลอดช่วงฤดูกาลก่อนหน้านี้เพื่อคำนวณฮีโร่ ตำแหน่ง และค่าสถิติโดยรวมที่ดีที่สุดเมื่อเปรียบเทียบกับผู้เล่นคนอื่นในระดับฝีมือของคุณ กล่าวได้ว่าเป็นบทสรุปภาพรวมฤดูกาลของคุณอย่างสมบูรณ์แบบ",
  "june22_battle_report_head02": "ไฮไลต์",
  "june22_battle_report_desc02": "จำเกมของคุณที่พลิกมาเป็นฝ่ายชนะอย่างปาฏิหาริย์หลังผ่านไปชั่วโมงครึ่งได้ไหม? รายงานการต่อสู้จำได้แน่นอนและก็ทราบด้วยว่าเป็นเกมสำคัญ ค้นพบแนวโน้มและสถิติของคุณในหน้าจอไฮไลต์เฉพาะตัว แล้วคุณจะรู้เป้าหมายถัดไปที่ต้องพิชิตได้ตลอด",
  "june22_battle_report_head03": "วิเคราะห์เจาะลึก",
  "june22_battle_report_desc03": "อยากรู้ข้อมูลสถิติมากกว่านี้ใช่ไหม? รายงานการต่อสู้ช่วยให้คุณเจาะลึกลงสู่เกมของคุณ โดยจะสามารถจัดเรียง คัดกรอง และวิเคราะห์เกมตามฮีโร่ ตำแหน่ง หรือแมตช์เฉพาะ ใช้เวลาของคุณด่ำดิ่งได้เลยเพราะข้อมูลมีพร้อมให้วิเคราะห์เสมอ",
  "june22_battle_report_head04": "รับรางวัล",
  "june22_battle_report_desc04": "ขณะที่คุณสำรวจรายงานการต่อสู้ คุณจะได้รับเหรียญทอง เหรียญเงิน และเหรียญทองแดงสำหรับผลงานที่โดดเด่น แต่ละเหรียญจะมอบเศษมณีตามความสำเร็จของคุณ: เหรียญทองมอบ 400 เศษมณี เหรียญเงินจะให้ 300 เศษมณี ส่วนเหรียญทองแดงได้ 200 เศษมณี",
  "june22_battle_report_head05": "พิเศษเฉพาะสมาชิก Dota Plus",
  "june22_battle_report_desc05": "รายงานการต่อสู้สามารถใช้ได้เฉพาะสมาชิก Dota Plus เท่านั้น ในช่วงเริ่มต้นของแต่ละฤดูกาล Dota Plus สมาชิกจะได้รับรายงานการต่อสู้ฉบับใหม่โดยอัตโนมัติ ซึ่งจะแสดงรายละเอียดการผจญภัยในเกมทั้งหมดจากฤดูกาลที่ผ่านมา",
  "june22_featured_game_mode_title": "เกมเด่นสุดสัปดาห์",
  "june22_featured_game_mode_head01": "เพื่อนเก่าในรูปแบบใหม่ใส่เศษมณี",
  "june22_featured_game_mode_desc01": "ก้าวไปพร้อมกับเราเข้าสู่เกมเด่นสุดสัปดาห์ ซึ่งเป็นคิวใหม่สำหรับทุกคนสำหรับสำรวจโหมดเกม Dota และกิจกรรมต่าง ๆ มากมาย พร้อมเก็บตุนเศษมณี Dota Plus ได้อีกด้วย",
  "june22_featured_game_mode_head02": "โหมดเกมหมุนเวียนเปลี่ยนแปร",
  "june22_featured_game_mode_desc02": "โหมดแรกในเกมเด่นสุดสัปดาห์คือ Ability Draft ซึ่งจะเล่นได้ในวันที่ 8-13 มิถุนายน หากคุณไม่เคยลองสัมผัส Ability Draft หรือยังไม่ได้เล่นมานานแล้ว ตอนนี้ถือว่าเป็นเวลาที่เหมาะสมสุด ๆ ในการเข้าร่วมชุมชน AD ที่กำลังขยายตัวพร้อมสร้างคอมโบสกิลใหม่ ๆ สุดโหดด้วยหน้าดราฟต์ที่ใช้งานง่ายสำหรับโหมดนี้โดยเฉพาะ เกมเด่นสุดสัปดาห์ถัดไปในวันที่ 16-20 มิถุนายนจะนำเสนอ Overthrow Trios ซึ่งเป็นการอัปเดตเกมเวอร์ชันดั้งเดิมให้รวดเร็วยิ่งขึ้น",
  "june22_featured_game_mode_head03": "ของดีย่อมมีเวลาจำกัด",
  "june22_featured_game_mode_desc03": "เกมเด่นสุดสัปดาห์แต่ละรายการจะมีช่วงเวลาจำกัด โดยเมื่อเล่นจะได้รับรางวัลเศษมณี Dota Plus สูงจนถึงจำนวนที่กำหนด ซึ่งหากชนะจะได้รับเศษมณีเพิ่มขึ้น คอยติดตามโหมดเกมเพิ่มเติมที่จะเฉิดฉายในเกมเด่นสุดสัปดาห์เดือนถัด ๆ ไป จากนั้นเชิญเข้าร่วมและเก็บเกี่ยวรางวัลเศษมณีได้เลย",
  "june22_immortal_fx_title": "ปลดล็อคเอฟเฟกต์สกิลไอเท็ม Immortal",
  "june22_immortal_fx_head01": "พลัง Immortal ยิ่งใหญ่มาพร้อมการตัดสินใจอันใหญ่ยิ่ง",
  "june22_immortal_fx_desc01": "ต่อจากนี้คุณจะสามารถเลือกสวมใส่เอฟเฟกต์สกิลจากไอเท็ม Immortal ได้โดยไม่จำเป็นต้องให้ฮีโร่ของคุณสวมใส่ไอเท็มดังกล่าว เคยอยากได้แต้มสังหาร Finger of Death ด้วยเอฟเฟกต์ Hell-Spar Anathema ขณะใส่แขนก้ามปู Abyssal Hellclaw บน Lion หรือเปล่า? ตอนนี้จะไม่มีปัญหาอีกต่อไป มิกซ์แอนด์แมตช์เอฟเฟกต์ของคุณกับไอเท็มใดก็ตามที่คุณครอบครองอยู่ได้ตามใจปรารถนา",
  "june22_match_clips_title": "เครื่องมือสร้างคลิป",
  "june22_match_clips_head01": "บันทึกและแบ่งปัน",
  "june22_match_clips_desc01": "จับภาพช่วงเวลาโปรดในเกมด้วยตัวสร้างคลิป ซึ่งเป็นเครื่องมือใหม่ที่มีประโยชน์ โดยจะช่วยให้คุณเลือกและบันทึกวิดีโอคุณภาพสูงเพื่อนำไปแบ่งปันแชร์ได้อย่างรวดเร็วในขณะที่คุณรับชมรีเพลย์หรือเกมถ่ายทอดสดอยู่ในขณะนั้น",
  "june22_match_clips_head02": "การควบคุมคลิป",
  "june22_match_clips_desc02": "กำหนดเวลาเริ่มต้นและสิ้นสุดให้คลิปของคุณด้วยเครื่องมือไทม์ไลน์แบบละเอียด ซึ่งจะแสดงทั้งการตายและการสังหารผู้เล่น คุณสามารถที่จะเลือกช่วงเวลาแน่นอนที่ต้องการแบ่งปันได้ โดยไม่ต้องใช้เครื่องมือภายนอกใด ๆ",
  "june22_match_clips_head03": "คุณภาพระดับพรีเมียม",
  "june22_match_clips_desc03": "คุณสามารถเลือกคุณสมบัติการเรนเดอร์ขั้นสูงเพื่อให้มีเงาและแสงสะท้อนคุณภาพสูงกว่าเดิม และซ่อน UI ในเกมตลอดช่วงระยะเวลาของคลิป รวมทั้งกำหนดอัตราเฟรมราบรื่นได้สูงสุด 90 เฟรมต่อวินาที เครื่องมือนี้จะเข้ารหัสไปยังวิดีโอ h.264 บน Windows โดยตรง ต่างจากแพลตฟอร์มอื่นจะส่งเอาต์พุตออกเป็นรายเฟรม",
  "june22_avoid_player_title": "ปรับปรุงระบบหลีกเลี่ยงผู้เล่น",
  "june22_avoid_player_head01": "เก็บบันทึกย่อ",
  "june22_avoid_player_desc01": "จำไม่ได้ว่าทำไมคุณจึงตัดสินใจหลีกเลี่ยงผู้เล่นบางคนใช่ไหม? แค่จดบันทึกย่อไว้เพื่อระบุเหตุผลที่คุณใส่ชื่อผู้เล่นคนนั้นลงในรายชื่อผู้เล่นที่หลีกเลี่ยง",
  "june22_avoid_player_head02": "สั่งซื้อช่องเพิ่ม",
  "june22_avoid_player_desc02": "รายชื่อผู้เล่นที่หลีกเลี่ยงจะเริ่มต้นที่ 25 ช่อง แต่ตอนนี้ถ้าคุณอยากได้มากกว่านั้น คุณก็สามารถเพิ่มจำนวนได้โดยใช้เศษมณีเพื่อแลกช่องเพิ่มเติม",
  "june22_shards_title": "สั่งซื้อด้วยเศษมณี",
  "june22_shards_head01": "เอฟเฟกต์สังหารต่อเนื่อง",
  "june22_shards_desc01": "ตกแต่งอินเตอร์เฟซในเกมของคุณด้วยเอฟเฟกต์พิเศษที่แสดงขึ้นตามการสังหารต่อเนื่องของฮีโร่ เลือกระหว่างเอฟเฟกต์เพลิง น้ำแข็ง และทอง ซึ่งมีจำหน่ายในร้านค้าเศษมณีด้วยสนนราคา 150,000 เศษมณี",
  "june22_shards_head02": "สมบัติตามฤดูกาล",
  "june22_shards_desc02": "สมบัติประจำฤดูกาลในช่วงฤดูร้อน 2022 มาถึงแล้วและพร้อมให้สั่งซื้อได้ด้วยเศษมณี แต่ที่ต่างจากสมบัติประจำฤดูกาลก่อนหน้านี้คือ ลูกค้าทุกคนมีสิทธิ์สั่งซื้อได้ โดยไม่จำกัดไว้เฉพาะสมาชิก Dota Plus เท่านั้น\\n\\nสมบัติเหล่านี้นำเสนอชุดเซ็ตใหม่ล่าสุดสำหรับ Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit และ Wraith King อีกทั้งยังมีสัตว์ส่งของ Ageless Apothecary ที่มีอัญมณีประเภท Prismatic และ Ethereal แบบสุ่มสำหรับผู้ที่โชคดีพอที่จะคู่ควรกับยาของเขาด้วย",
  "june22_shards_head03": "ชุดเซ็ตตามฤดูกาล",
  "june22_shards_desc03": "คุณพลาดโอกาสครอบครองสมบัติบางชุดที่เป็น Dota Plus รุ่นเก่าใช่ไหม? ตอนนี้ชุดเซ็ตจากสมบัติประจำฤดูใบไม้ร่วง 2020 และสมบัติประจำฤดูหนาว 2020 พร้อมให้สั่งซื้อได้โดยตรงในร้านค้าเศษมณีด้วยสนนราคา 15,000 เศษมณีต่อชุด",
  "june22_shards_head04": "ตรามณีสำหรับทุกคน",
  "june22_shards_desc04": "ตอนนี้ผู้เล่นทุกคนสามารถซื้อตรามณีด้วยเศษมณีได้แล้ว โดยไม่จำกัดแค่สมาชิก Dota Plus เท่านั้น จากนั้นทุกคนสามารถใช้ตรามณีเพื่อติดตามสถิติของตนและรับโบนัส XP ของฮีโร่ได้ แต่เฉพาะสมาชิก Dota Plus เท่านั้นที่สามารถเดินหน้าข้ามเลเวล 5 ไปได้",
  "june22_plus_update_title": "การปรับเปลี่ยน Dota Plus ประจำฤดูกาล",
  "june22_plus_update_head01": "ภารกิจ Dota Plus",
  "june22_plus_update_desc01": "อัปเดตในวันนี้มาพร้อมกับภารกิจ Dota Plus ชุดใหม่ซัดสาดประดังประดามาพร้อมเศษมณีสำหรับใช้ซื้อไอเท็มใหม่ตามใจชอบ — รับได้สูงสุด 115,200 เศษมณีตลอดช่วงเวลาของฤดูกาล",
  "june22_plus_update_head02": "รางวัลกิลด์",
  "june22_plus_update_desc02": "นอกจากนี้เรายังได้อัปเดตรางวัลกิลด์ประจำฤดูกาลด้วยเช่นกัน โดยมีอีโมติคอน สเปรย์ และวงล้อสนทนาชุดใหม่สำหรับกิลด์ระดับเงิน ทอง และแพลทินัม",
  "june22_gameplay_title": "อัปเดตเกมเพลย์ 7.31d"
}