// 6278.js

{
  "language": "spanish",
  "june22_title": "Actualización del informe de batalla",
  "june22_subtitle": "Dota Plus, verano de 2022",
  "june22_desc": "En la actualización de hoy, desvelamos la renovación estacional de Dota Plus y, de paso, mucho más. Profundiza en los detalles de tu rendimiento en todas las partidas de la temporada pasada con el informe de batalla, explora diferentes modos de juego con los destacados del fin de semana y presume de tus inmortales como te parezca con los efectos de hechizo para objetos inmortales desbloqueados. Hay un tesoro nuevo, características nuevas y mejoradas, y muchas otras sorpresas, incluida la actualización 7.31d, que da la bienvenida a Marci en el modo Capitán.",
  "june22_battle_report_title": "Informe de batalla",
  "june22_battle_report_head01": "Estadísticas destacadas",
  "june22_battle_report_desc01": "El informe de batalla analiza tu rendimiento en todas tus partidas de la temporada anterior para calcular tu mejor héroe y rol, y estadísticas generales en comparación con otros jugadores de tu nivel de habilidad. Es un resumen visual perfecto de tu temporada.",
  "june22_battle_report_head02": "Aspectos destacados",
  "june22_battle_report_desc02": "¿Te acuerdas de esa partida en la que remontaste por sorpresa después de hora y media? El informe de batalla se acuerda y sabe que es importante. Descubre tendencias y récords en la pantalla individualizada de aspectos destacados para saber siempre cómo superarte.",
  "june22_battle_report_head03": "Análisis detallados",
  "june22_battle_report_desc03": "Si necesitas más estadísticas, el informe de batalla te permite profundizar en tus partidas ordenándolas, filtrándolas y analizándolas por héroe, rol o partidas individuales. Revísalo con calma: no falta ni un detalle.",
  "june22_battle_report_head04": "Consigue recompensas",
  "june22_battle_report_desc04": "Mientras exploras el informe de batalla, recibirás medallas de oro, plata y bronce por los resultados más excepcionales. Las medallas conceden fragmentos por los logros: 400 con las medallas de oro, 300 con las de plata y 200 con las de bronce.",
  "june22_battle_report_head05": "Solo con Dota Plus",
  "june22_battle_report_desc05": "El informe de batalla está disponible de forma exclusiva para los miembros de Dota Plus. Al principio de cada nueva temporada de Dota Plus, todos los miembros reciben automáticamente un informe de batalla nuevo, en el que se detallan sus aventuras en las partidas de la temporada anterior.",
  "june22_featured_game_mode_title": "Destacado del fin de semana",
  "june22_featured_game_mode_head01": "Viejos amigos, nuevos enredos y fragmentos relucientes",
  "june22_featured_game_mode_desc01": "Adéntrate con nosotros en los modos de juego destacados del fin de semana, una nueva sección para descubrir diferentes modos de juego y eventos al mismo tiempo que acumulas fragmentos de Dota Plus.",
  "june22_featured_game_mode_head02": "Rotación de modos de juego",
  "june22_featured_game_mode_desc02": "El primer modo destacado del fin de semana es Selección de habilidades, disponible del 8 al 13 de junio. Si no lo has probado nunca o hace tiempo que no lo pruebas, este es el momento ideal para unirte a la próspera comunidad del modo de juego y crear nuevas supercombinaciones de habilidades con la sencilla pantalla de selección. El segundo destacado del fin de semana estará disponible del 16 al 20 de junio para presentar Supremacía de a tres, una versión actualizada más rápida de la versión original.",
  "june22_featured_game_mode_head03": "Lo bueno dura poco",
  "june22_featured_game_mode_desc03": "Cada destacado del fin de semana está disponible durante un tiempo limitado. Al jugar, conseguirás fragmentos de Dota Plus (dentro de un límite establecido) y más fragmentos aún si ganas. Presta atención a los modos de juego que aparecerán destacados en los próximos meses, participa y cosecha fragmentos de recompensa.",
  "june22_immortal_fx_title": "Efectos de hechizo para objetos inmortales desbloqueados",
  "june22_immortal_fx_head01": "El poder inmortal exige libertad de elección",
  "june22_immortal_fx_desc01": "Ahora puedes equipar los efectos de hechizo de tus objetos inmortales independientemente del objeto que esté usando tu héroe. ¿Que quieres conseguir víctimas por Dedo de la Muerte con el efecto Anatema Infernal mientras Lion lleva puesta la Garra Abisal? No pasa nada. Combina los efectos con los objetos que tengas. Tú eliges.",
  "june22_match_clips_title": "Creador de clips",
  "june22_match_clips_head01": "Guarda y comparte",
  "june22_match_clips_desc01": "Captura tus momentos de juego favoritos con el nuevo Creador de clips, una herramienta muy útil que, mientras ves repeticiones o partidas en directo, te permite elegir y guardar rápidamente vídeos de alta calidad para compartirlos.",
  "june22_match_clips_head02": "Controles para crear clips",
  "june22_match_clips_desc02": "Define cuándo comienza y cuándo termina el clip con una línea de tiempo detallada que incluye tanto las víctimas como las muertes del jugador. Sin necesidad de herramientas de terceros, podrás elegir el momento exacto que quieres compartir.",
  "june22_match_clips_head03": "Máxima calidad",
  "june22_match_clips_desc03": "Puedes elegir funciones de renderizado avanzadas para conseguir sombras y reflejos de mayor calidad, ocultar la interfaz en el juego durante el clip o suavizar la velocidad de los fotogramas hasta los 90 FPS. La herramienta codifica directamente un vídeo en formato h.264 en Windows y genera fotogramas individuales en otras plataformas.",
  "june22_avoid_player_title": "Característica mejorada para evitar jugadores",
  "june22_avoid_player_head01": "Toma notas",
  "june22_avoid_player_desc01": "Para no olvidarte de por qué decidiste evitar a un jugador específico, puedes guardar una nota con las razones por las que lo añadiste a la lista de jugadores a evitar.",
  "june22_avoid_player_head02": "Compra más espacios",
  "june22_avoid_player_desc02": "Por defecto, la lista de jugadores a evitar tiene 25 espacios, pero si prefieres tener más, ahora puedes utilizar fragmentos para ampliarla y conseguir espacios adicionales.",
  "june22_shards_title": "Compra con fragmentos",
  "june22_shards_head01": "Efectos de racha de víctimas",
  "june22_shards_desc01": "Decora tu interfaz en el juego con efectos especiales que aparecen según las rachas de víctimas de cada héroe. Por 150 000 fragmentos cada uno, puedes elegir efectos de fuego, hielo y oro en la tienda de fragmentos.",
  "june22_shards_head02": "Tesoro estacional",
  "june22_shards_desc02": "Ya está aquí el tesoro estacional del verano de 2022, que puedes comprar con fragmentos y que, a diferencia de tesoros estacionales anteriores, está disponible para todos los clientes, no solo para los miembros de Dota Plus.\\n\\nEste tesoro incluye sets completamente nuevos para Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit y Wraith King. También trae al Boticario Intemporal, el mensajero con gemas etéreas y prismáticas aleatorias para los afortunados que se ganen su medicina.",
  "june22_shards_head03": "Sets de temporada",
  "june22_shards_desc03": "¿Te quedaste sin conseguir algunos de los sets de los tesoros anteriores de Dota Plus? Los sets del Tesoro de Otoño 2020 y del Tesoro de Invierno 2020 pueden adquirirse ahora directamente en la tienda de fragmentos por 15 000 fragmentos cada uno.",
  "june22_shards_head04": "Reliquias para todos",
  "june22_shards_desc04": "Todos los jugadores, no solo los miembros de Dota Plus, pueden usar ahora fragmentos para comprar reliquias de héroe y utilizarlas para hacer un seguimiento de sus estadísticas y conseguir EXP de héroe adicional, pero solo los miembros de Dota Plus pueden pasar del nivel 5.",
  "june22_plus_update_title": "Renovación estacional de Dota Plus",
  "june22_plus_update_head01": "Misiones de Dota Plus",
  "june22_plus_update_desc01": "La actualización de hoy también incluye un nuevo conjunto de misiones de Dota Plus con las que conseguir más fragmentos —hasta 115 200 durante toda la temporada— para todos los caprichos nuevos.",
  "june22_plus_update_head02": "Recompensas de clan",
  "june22_plus_update_desc02": "También hemos actualizado las recompensas de clan de la temporada con un nuevo conjunto de emoticonos, espráis y ruedas de chat para los clanes de nivel plata, oro y platino.",
  "june22_gameplay_title": "Actualización 7.31d"
}