// 3186.js

{
  "language": "norwegian",
  "june22_title": "Stridsrapporten",
  "june22_subtitle": "Dota Plus – Sommeren 2022",
  "june22_desc": "Dagens oppdatering kommer med sesongens forfriskning til Dota Plus og benytter muligheten til å avsløre enda mer. Gå i detalj om prestasjonene dine gjennom alle kampene forrige sesong med stridsrapporten, utforsk en rekke forskjellige spillmoduser i helgens rampelys, og vis frem de udødelige gjenstandene dine slik du vil med ulåste udødelige formeleffekter. Det er en ny skatt, nye og forbedrede funksjoner og andre ting i vente – deriblant spilloppdatering 7.31d, som ønsker Marci velkommen i Captains Mode.",
  "june22_battle_report_title": "Stridsrapport",
  "june22_battle_report_head01": "Fremhevet statistikk",
  "june22_battle_report_desc01": "Stridsrapporten analyserer prestasjonene dine gjennom alle kampene i forrige sesong for å beregne den beste helten, rollen og generell statistikk for deg sammenlignet med andre spillere på samme ferdighetsnivå. Et perfekt helhetsinntrykk over sesongen din.",
  "june22_battle_report_head02": "Høydepunkt",
  "june22_battle_report_desc02": "Husker du den kampen med en syk opphenting etter en og en halv time? Det gjør stridsrapporten – og den vet at det er bemerkelsesverdig. Se trender og rekorder under personlige høydepunkt. Da vet du alltid hvilke mål du må slå.",
  "june22_battle_report_head03": "Grundig analyse",
  "june22_battle_report_desc03": "Trenger du enda mer statistikk? Stridsrapporten lar deg grave enda dypere i kampene – sortere, filtrere og analysere dem etter helt, rolle eller enkeltkamper. Ta deg god tid, alt ligger der.",
  "june22_battle_report_head04": "Få belønninger",
  "june22_battle_report_desc04": "Etter hvert som du utforsker stridsrapporten, får du gull-, sølv- og bronsemedaljer for enestående resultater. Hver medalje gir deg skår for bragden: 400 for gull, 300 for sølv og 200 for bronse.",
  "june22_battle_report_head05": "Eksklusivt for Dota Plus",
  "june22_battle_report_desc05": "Stridsrapporten er tilgjengelig eksklusivt for medlemmer av Dota Plus. I begynnelsen av hver Dota Plus-sesong får alle medlemmer av Dota Plus automatisk en ny stridsrapport med detaljer om alle deres strabaser i spillet fra forrige sesong.",
  "june22_featured_game_mode_title": "Helgens rampelys",
  "june22_featured_game_mode_head01": "Gamle venner, nye vrier, skinnende skår",
  "june22_featured_game_mode_desc01": "Tre inn i helgens rampelys, en ny kø som alle kan bruke til å utforske et utvalg av spillmoduser og begivenheter i Dota, alt mens du fyller opp lageret med Dota Plus-skår.",
  "june22_featured_game_mode_head02": "Rullerende spillmoduser",
  "june22_featured_game_mode_desc02": "Den første modusen i helgens rampelys er Ability Draft, tilgjengelig den 8.–13. juni. Hvis du ikker har syslet med Ability Draft eller prøvd det på en stund, passer det nå fint å bli en del av det blomstrende AD-miljøet og sette sammen noen nye evnekombinasjoner med modusens enkle utvelgelse. Den andre helgens rampelys kommer den 16.–20. juni og introduserer Overthrow Trios, en fartsfylt oppdatering av den opprinnelige versjonen.",
  "june22_featured_game_mode_head03": "Sterke lys brenner raskt",
  "june22_featured_game_mode_desc03": "Hvert rampelys er tilgjengelig i en begrenset periode. Du får Dota Plus-skår av å spille opp til en satt grense, og du får mer av å vinne. Følg med for flere spillmoduser som kommer frem i helgens rampelys de kommende månedene. Bli så med og høst skårbelønningene.",
  "june22_immortal_fx_title": "Ulåste udødelige formeleffekter",
  "june22_immortal_fx_head01": "Udødelig kraft fordrer valgmuligheter",
  "june22_immortal_fx_desc01": "Udødelige gjenstanders formeleffekter kan nå utstyres uavhengig av hvilken gjenstand helten bruker. Vil du sanke Finger of Death-drap med Hell-Spar Anathema-effekten mens du bruker Abyssal Hellclaw-krabbekloen på Lion i stedet? Ikke noe problem. Kombiner effektene dine med andre gjenstander du har. Det er opp til deg.",
  "june22_match_clips_title": "Klippeverktøy",
  "june22_match_clips_head01": "Lagre og del",
  "june22_match_clips_desc01": "Ta opp de beste øyeblikkene i spillet med det nye klippeverktøyet, et nyttig verktøy som hjelper deg med å raskt velge og lagre en video i høy kvalitet mens du ser på repriser eller direktekamper.",
  "june22_match_clips_head02": "Klippeinnstillinger",
  "june22_match_clips_desc02": "Fastsett starten og slutten på klippet med en nøyaktig tidslinje som viser spilleres dødsfall og drap. Du kan velge akkurat de øyeblikkene du vil dele, uten at det er nødvendig med tredjepartsverktøy.",
  "june22_match_clips_head03": "Skikkelig kvalitet",
  "june22_match_clips_desc03": "Du kan velge avanserte gjengivelsesfunksjoner for høyere kvalitet på skygger og refleksjoner, skjule grensesnittet i klippet og få jevne bildefrekvenser på opptil 90. Verktøyet koder direkte til h.264-video på Windows, og enkeltbilder på andre plattformer.",
  "june22_avoid_player_title": "Forbedret unngåelse",
  "june22_avoid_player_head01": "Ta notater",
  "june22_avoid_player_desc01": "Husker du ikke hvorfor du vil unngå en bestemt spiller? Bare skriv ned hvorfor du la til spilleren direkte i listen over unngåtte spillere.",
  "june22_avoid_player_head02": "Kjøp flere plasser",
  "june22_avoid_player_desc02": "Listen over spillere du vil unngå, har i utgangspunktet 25 plasser, men hvis du vil ha flere, kan du nå utvide listen ved å bruke skår til å kjøpe flere plasser.",
  "june22_shards_title": "Kjøp med skår",
  "june22_shards_head01": "Drapsrekkeeffekter",
  "june22_shards_desc01": "Pynt grensesnittet i spillet med spesialeffekter som vises basert på heltens drapsrekke. Velg mellom ild, is og gull, hver av dem tilgjengelig for 150 000 skår i skårbutikken.",
  "june22_shards_head02": "Sesongskatt",
  "june22_shards_desc02": "Sommerskatten 2022 er her og kan kjøpes med skår, og i motsetning til tidligere sesongskatter, er de tilgjengelig for alle kunder, ikke bare medlemmer av Dota Plus.\\n\\nDenne skatten inneholder helt nye sett til Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit og Wraith King. Den har også kureren «Ageless Apothecary», som kommer med tilfeldige prismatiske og kinetiske edelsteiner for de som er heldige nok til å være medisinen hans verdig.",
  "june22_shards_head03": "Sesongsett",
  "june22_shards_desc03": "Gikk du glipp av muligheten til å skaffe deg noen av settene fra tidligere Dota Plus-skatter? Settene fra høstskatten 2020 og vinterskatten 2020 kan nå kjøpes direkte i skårbutikken til 15 000 skår hver.",
  "june22_shards_head04": "Relikvier for alle",
  "june22_shards_desc04": "Helterelikvier kan nå kjøpes med skår av alle spillere, ikke bare medlemmer av Dota Plus. Alle kan nå bruke relikvier for å spore statistikk og tjene ekstra helte-XP, men kun medlemmer av Dota Plus kan gå høyere enn nivå 5.",
  "june22_plus_update_title": "Sesongoppdatering til Dota Plus",
  "june22_plus_update_head01": "Dota Plus-oppdrag",
  "june22_plus_update_desc01": "Dagens oppdatering kommer også med et nytt sett Dota Plus-oppdrag, så du kan dra i land noen ekstra skår for å skaffe deg nye godsaker. Disse tilbyr opptil 115 200 skår i løpet av sesongen.",
  "june22_plus_update_head02": "Gildebelønninger",
  "june22_plus_update_desc02": "Vi har også oppdatert sesongens gildebelønninger med et nytt utvalg av uttrykksikoner, graffitier og linjer til samtalehjulet i gildegradene sølv, gull og platina.",
  "june22_gameplay_title": "Spilloppdatering 7.31d"
}