// 3978.js

{
  "language": "italian",
  "june22_title": "Aggiornamento del Rapporto battaglia",
  "june22_subtitle": "Dota Plus - Estate 2022",
  "june22_desc": "L'aggiornamento di oggi introduce le modifiche stagionali di Dota Plus e alcune novità a sorpresa. Scopri i dettagli sulle tue prestazioni in tutte le partite che hai giocato durante la scorsa stagione con il Rapporto battaglia, esplora modalità di gioco diverse con le Scelte del fine settimana e sfoggia i tuoi Immortali come e quando vuoi grazie agli effetti sbloccati degli oggetti Immortali. Ti aspettano un nuovo tesoro, funzionalità nuove e aggiornate e altro ancora, tra cui l'aggiornamento di gioco 7.31d che aggiunge Marci a Captains Mode.",
  "june22_battle_report_title": "Rapporto battaglia",
  "june22_battle_report_head01": "Statistiche in evidenza",
  "june22_battle_report_desc01": "Il Rapporto battaglia analizza le tue prestazioni in tutte le partite giocate nella scorsa stagione per calcolare l'Eroe e il ruolo con cui te la cavi meglio e le statistiche complessive in relazione a quelle degli altri giocatori al tuo livello di abilità. È il riassunto perfetto della tua stagione.",
  "june22_battle_report_head02": "Momenti salienti",
  "june22_battle_report_desc02": "Ricordi quella partita in cui hai fatto una rimonta pazzesca dopo un'ora e mezza di gioco? Il Rapporto battaglia la ricorda e sa bene che si tratta di un momento degno di nota. Scopri le tendenze e i record nella sezione dei Momenti salienti, così da sapere sempre qual è il prossimo traguardo da superare.",
  "june22_battle_report_head03": "Analisi dettagliata",
  "june22_battle_report_desc03": "Vai matto per le statistiche? Il Rapporto battaglia ti consente di esplorare a fondo le tue partite, ordinandole, filtrandole e analizzandole in base a Eroe, ruolo o partite individuali. Fai con calma: tutte le informazioni sono a tua disposizione.",
  "june22_battle_report_head04": "Ottieni ricompense",
  "june22_battle_report_desc04": "Mentre esplori il tuo Rapporto battaglia, riceverai medaglie d'oro, d'argento e di bronzo per i risultati più eccezionali. Ogni medaglia ti farà ottenere dei Frammenti per il tuo traguardo: 400 per le medaglie d'oro, 300 per quelle d'argento e 200 per quelle di bronzo.",
  "june22_battle_report_head05": "Esclusivo di Dota Plus",
  "june22_battle_report_desc05": "Il Rapporto battaglia è disponibile in esclusiva per gli iscritti a Dota Plus. All'inizio di ogni nuova stagione di Dota Plus, tutti gli iscritti a Dota Plus riceveranno automaticamente un nuovo Rapporto battaglia in cui vengono dettagliate le loro avventure nel gioco durante la stagione precedente.",
  "june22_featured_game_mode_title": "Scelte del fine settimana",
  "june22_featured_game_mode_head01": "Vecchie conoscenze, nuove avventure, Frammenti scintillanti",
  "june22_featured_game_mode_desc01": "Scopriamo insieme le nuove Scelte del fine settimana, una selezione di modalità di gioco ed eventi di Dota in cui fare scorta di Frammenti di Dota Plus.",
  "june22_featured_game_mode_head02": "Modalità di gioco a rotazione",
  "june22_featured_game_mode_desc02": "La prima modalità tra le Scelte del fine settimana sarà Ability Draft, disponibile dall'8 al 13 giugno. Se non ci hai mai giocato o hai bisogno di un ripasso, questa è la tua occasione per unirti alla fiorente comunità di Ability Draft e creare qualche mostruosa combinazione di abilità utilizzando l'intuitiva schermata di selezione della modalità. La seconda Scelta del fine settimana sarà disponibile dal 16 al 20 giugno e avrà come protagonista la modalità \"Overthrow Trios\", una versione più frenetica rispetto a quella originale.",
  "june22_featured_game_mode_head03": "Un bel gioco dura poco",
  "june22_featured_game_mode_desc03": "Ogni Scelta del weekend sarà disponibile per un tempo limitato. Le vittorie in queste modalità fanno ottenere un numero di Frammenti di Dota Plus sempre maggiore, fino al raggiungimento del limite massimo. Rimani sintonizzato per scoprire quali saranno le Scelte del fine settimana nei prossimi mesi, poi unisciti al divertimento e ottieni Frammenti a volontà.",
  "june22_immortal_fx_title": "Effetti degli oggetti Immortali",
  "june22_immortal_fx_head01": "Da grandi poteri derivano grandi responsabilità",
  "june22_immortal_fx_desc01": "Ora gli effetti delle abilità dei tuoi oggetti Immortali possono essere applicati indipendentemente dagli oggetti equipaggiati dal tuo Eroe. Vuoi applicare l'effetto di Anatema Infernale alle uccisioni con Dito della morte facendo indossare a Lion la Chela Infernale degli Abissi? Nessun problema. Combina i tuoi effetti con qualsiasi oggetto in tuo possesso. La scelta è solo tua.",
  "june22_match_clips_title": "Editor di clip",
  "june22_match_clips_head01": "Salva e condividi",
  "june22_match_clips_desc01": "Cattura i tuoi momenti di gioco preferiti con il nuovo Editor di clip, uno strumento utile e veloce che ti aiuta a scegliere e salvare un video condivisibile di alta qualità mentre assisti ai replay o alle partite in diretta.",
  "june22_match_clips_head02": "Controlli per le clip",
  "june22_match_clips_desc02": "Definisci l'inizio e la fine della tua clip con una sequenza temporale molto precisa che indica le morti e le uccisioni dei giocatori. Potrai scegliere il momento esatto che vuoi condividere senza usare strumenti esterni.",
  "june22_match_clips_head03": "Alta qualità",
  "june22_match_clips_desc03": "Sono disponibili opzioni di rendering avanzate per ombre e riflessi di qualità maggiore, oltre alla possibilità di nascondere l'interfaccia di gioco per tutta la durata della clip e aumentare il frame rate fino a 90 fps. Lo strumento codifica il video nel formato H.264 su Windows e genera i singoli frame sulle altre piattaforme.",
  "june22_avoid_player_title": "Lista dei giocatori da evitare",
  "june22_avoid_player_head01": "Lascia un appunto",
  "june22_avoid_player_desc01": "Non ricordi perché hai deciso di evitare un giocatore? Salva una nota in cui indichi il motivo per cui hai aggiunto un giocatore alla lista degli utenti da evitare.",
  "june22_avoid_player_head02": "Acquista altri spazi",
  "june22_avoid_player_desc02": "Di base, la lista dei giocatori da evitare contiene 25 spazi. Se vuoi averne di più, ora puoi espandere la lista e ottenere spazi aggiuntivi usando i tuoi Frammenti.",
  "june22_shards_title": "Acquista con i Frammenti",
  "june22_shards_head01": "Effetti delle serie di uccisioni",
  "june22_shards_desc01": "Decora la tua interfaccia di gioco con effetti speciali da mostrare in base alle serie di uccisioni di un Eroe. Scegli tra gli effetti dorati, di fuoco e di ghiaccio, disponibili nel negozio dei Frammenti per 150.000 Frammenti l'uno.",
  "june22_shards_head02": "Tesoro stagionale",
  "june22_shards_desc02": "Il tesoro stagionale dell'estate 2022 è ora disponibile e può essere acquistato con i Frammenti da tutti i giocatori, non più soltanto dagli iscritti a Dota Plus come accadeva in passato.\\n\\nQuesto tesoro include nuovissimi set per Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit e Wraith King. I più fortunati avranno anche il piacere di conoscere il Droghiere Immortale, un nuovo Corriere già equipaggiato con gemme eteree e prismatiche casuali.",
  "june22_shards_head03": "Set stagionali",
  "june22_shards_desc03": "Non sei riuscito a mettere mano su alcuni set dei vecchi tesori di Dota Plus? Ora i set del Tesoro Autunnale 2020 e del Tesoro Invernale 2020 possono essere acquistati direttamente nel negozio dei Frammenti per 15.000 Frammenti l'uno.",
  "june22_shards_head04": "Reliquie per tutti",
  "june22_shards_desc04": "Ora le Reliquie degli Eroi possono essere acquistate con i Frammenti da tutti i giocatori e non soltanto dagli iscritti a Dota Plus. Tutti possono usare le Reliquie per tenere traccia delle proprie statistiche e ottenere un bonus di ESP per gli Eroi, ma solo gli iscritti a Dota Plus possono avanzare oltre il livello 5.",
  "june22_plus_update_title": "Modifiche stagionali di Dota Plus",
  "june22_plus_update_head01": "Missioni di Dota Plus",
  "june22_plus_update_desc01": "L'aggiornamento di oggi include anche una nuova serie di missioni di Dota Plus, grazie a cui sarà possibile ottenere fino a 115.200 Frammenti nel corso della stagione per acquistare tutte le novità nel negozio dei Frammenti.",
  "june22_plus_update_head02": "Ricompense della gilda",
  "june22_plus_update_desc02": "Abbiamo anche aggiornato le ricompense stagionali della gilda con una nuova serie di emoticon, spray e frasi della chat radiale per le gilde di grado argento, oro e platino.",
  "june22_gameplay_title": "Aggiornamento 7.31d"
}