// 4723.js

{
  "language": "russian",
  "june22_title": "Новый боевой отчёт",
  "june22_subtitle": "в летнем обновлении Dota Plus",
  "june22_desc": "Сегодняшнее обновление привносит не только ежесезонные изменения Dota Plus, но и кое-что новое. Погрузитесь в подробности своих успехов за весь прошедший сезон с помощью боевого отчёта, откройте для себя всё разнообразие игры в еженедельных режимах выходного дня и используйте любые украшения героев, сохраняя эффекты Immortal-предметов. А ещё — сезонная сокровищница, новые и улучшенные функции и многое другое, включая обновление 7.31d, с которым Марси врывается в режим Captains Mode.",
  "june22_battle_report_title": "Боевой отчёт",
  "june22_battle_report_head01": "Отборная статистика",
  "june22_battle_report_desc01": "Боевой отчёт анализирует ваши успехи во всех играх прошедшего сезона, чтобы вычислить самого успешного героя, роль и другие примечательные показатели, которые выделяют вас среди игроков такого же уровня игры. Идеальный взгляд на уходящий сезон.",
  "june22_battle_report_head02": "Лучшие моменты",
  "june22_battle_report_desc02": "Помните, как вы совершили безумный переворот в полуторачасовой игре? Боевой отчёт помнит — и знает, насколько важным был тот момент. Следите за своими трендами и рекордами в личной вкладке лучших моментов. Вам всегда есть к чему стремиться.",
  "june22_battle_report_head03": "Глубокий анализ",
  "june22_battle_report_desc03": "Хотите ещё больше статистики? Боевой отчёт позволяет вам углубиться в данные игр: сортируйте, фильтруйте и анализируйте их по герою, роли или отдельным играм. Можете не торопиться — здесь вы найдёте всё.",
  "june22_battle_report_head04": "Получайте награды",
  "june22_battle_report_desc04": "Исследуя свой боевой отчёт вы обнаружите, что заработали золотые, серебряные или бронзовые медали за выдающиеся результаты. Каждая медаль приносит вам осколки: 400 за золотую, 300 — за серебряную и 200 — за бронзовую.",
  "june22_battle_report_head05": "Только в Dota Plus",
  "june22_battle_report_desc05": "Боевой отчёт доступен только подписчикам Dota Plus. В начале каждого сезона они будут автоматически получать новый боевой отчёт, из которого узнают о всех итогах своих похождений за прошедший сезон.",
  "june22_featured_game_mode_title": "Режим выходного дня",
  "june22_featured_game_mode_head01": "Старые знакомые, новые детали и звонкие осколки",
  "june22_featured_game_mode_desc01": "Представляем режим выходного дня — новый способ поиска игры для всех, кто хочет изучить весь спектр простых и особых режимов, зарабатывая за это осколки Dota Plus.",
  "june22_featured_game_mode_head02": "Ротация режимов игры",
  "june22_featured_game_mode_desc02": "Первым режимом выходного дня станет Ability Draft, и он появится в особом поиске с 8 по 13 июня. Если вы ещё ни разу не пробовали этот режим или уже давно в него не заходили, то сейчас самое время ознакомиться с его процветающим сообществом. Создайте свои жуткие комбинации способностей в лёгком для понимании интерфейсе режима. Через неделю — с 16 по 20 июля — вас будет ожидать кое-что новое: Overthrow тройками, скоростная версия оригинального режима.",
  "june22_featured_game_mode_head03": "Яркое пламя быстрее гаснет",
  "june22_featured_game_mode_desc03": "Каждый режим выходного дня доступен ограниченное время. Играйте, чтобы получать ограниченное количество осколков Dota Plus, и побеждайте, чтобы их стало ещё больше. В грядущие месяцы вас ждут самые разные режимы выходного дня — присоединяйтесь, чтобы получать заветные осколки.",
  "june22_immortal_fx_title": "Immortal-эффекты без ограничений",
  "june22_immortal_fx_head01": "Бескрайняя мощь требует бескрайней свободы",
  "june22_immortal_fx_desc01": "Теперь эффекты ваших Immortal-предметов можно сочетать с любым предметом, который вы дали своему герою. Хотите использовать эффект Finger of Death от предмета Hell-Spar Anathema, не снимая свою любимую клешню Abyssal Hellclaw? Без проблем. Сочетайте любые эффекты и предметы, которые у вас есть. Выбор за вами.",
  "june22_match_clips_title": "Конструктор клипов",
  "june22_match_clips_head01": "Сохраняйте и делитесь",
  "june22_match_clips_desc01": "Запечатлейте свои любимые внутриигровые моменты с новым конструктором клипов — инструментом, который поможет вам быстро выбирать и сохранять моменты в высоком качестве, пока вы смотрите повторы или чужие игры.",
  "june22_match_clips_head02": "Управление клипом",
  "june22_match_clips_desc02": "Обозначьте начало и окончание клипа на подробной временной шкале, где обозначены смерти и убийства игроков. Вы сможете выбрать именно тот момент, которым хотите поделиться, не прибегая к сторонним программам.",
  "june22_match_clips_head03": "Премиум-качество",
  "june22_match_clips_desc03": "Вы можете выбрать одну из особых функций рендеринга: например, повышенное качество теней и отражений, выключение интерфейса на время клипа и частоту кадров вплоть до плавных 90 FPS. На Windows инструмент сразу кодирует видео в h.264, а на других платформах генерирует клип покадрово.",
  "june22_avoid_player_title": "Улучшения в избегании игроков",
  "june22_avoid_player_head01": "Памятные подписи",
  "june22_avoid_player_desc01": "Не помните, почему решили избегать того или иного игрока? Просто добавьте примечание, где можно указать причину, по которой вы не хотите с ним играть.",
  "june22_avoid_player_head02": "Дополнительные слоты",
  "june22_avoid_player_desc02": "Изначально вы можете избегать только 25 игроков, но если вам нужно больше, вы можете увеличить список, открыв дополнительные слоты за осколки.",
  "june22_shards_title": "Новинки за осколки",
  "june22_shards_head01": "Эффекты серии убийств",
  "june22_shards_desc01": "Украсьте свой интерфейс особыми эффектами, которые появляются при совершении серий убийств. Вы можете приобрести огненный, ледяной или золотой эффект за 150 000 осколков каждый.",
  "june22_shards_head02": "Сезонная сокровищница",
  "june22_shards_desc02": "Летняя сокровищница 2022 года уже доступна, и её можно купить за осколки. Кстати, в отличие от предыдущих сезонных сокровищниц, эта больше не является эксклюзивной для подписчиков Dota Plus.\\n\\nСодержит новые наборы для Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit и Wraith King. Невероятно редкой дополнительной наградой выступает курьер Ageless Apothecary, который содержит случайный призматический и потусторонний самоцветы.",
  "june22_shards_head03": "Сезонные наборы",
  "june22_shards_desc03": "Упустили возможность заполучить наборы из прошлых сезонных сокровищниц? Наборы из осенней и зимней сокровищниц 2020 года теперь можно купить за 15 000 осколков каждый.",
  "june22_shards_head04": "Реликвии для всех",
  "june22_shards_desc04": "Покупка реликвий больше не эксклюзивна для подписчиков Dota Plus. Теперь любой игрок может отслеживать статистику и получать дополнительный опыт героя, но развитие выше 5 уровня остаётся привилегией подписчиков Dota Plus.",
  "june22_plus_update_title": "Сезонные изменения Dota Plus",
  "june22_plus_update_head01": "Задания Dota Plus",
  "june22_plus_update_desc01": "Сегодняшнее обновление также привносит новый набор сезонных заданий для Dota Plus, чтобы вы могли заработать как можно больше осколков для всех новых вещиц. В сумме за все задания можно получить 115 200 осколков.",
  "june22_plus_update_head02": "Награды гильдии",
  "june22_plus_update_desc02": "Мы также обновили сезонные награды гильдий, установив новые наборы смайликов, граффити и фраз для колеса чата для гильдий серебряного, золотого и платинового разрядов.",
  "june22_gameplay_title": "Обновление 7.31d"
}