// 6345.js

{
  "language": "latam",
  "june22_title": "Actualización del informe de batalla",
  "june22_subtitle": "Dota Plus, verano de 2022",
  "june22_desc": "La actualización de hoy inicia los cambios de temporada de Dota Plus y aprovecha para revelar aún más. Profundiza en los detalles de tu rendimiento en todas tus partidas con el informe de batalla, explora diferentes modos de juego con los destacados del fin de semana y presume de tus inmortales de la manera que prefieras con los efectos de hechizo para objetos inmortales desbloqueados. Hay un tesoro nuevo, características nuevas y mejoradas, y muchas otras sorpresas, incluida la actualización 7.31d, que da la bienvenida a Marci en el modo Capitán.",
  "june22_battle_report_title": "Informe de batalla",
  "june22_battle_report_head01": "Estadísticas destacadas",
  "june22_battle_report_desc01": "El informe de batalla analiza tu rendimiento en todas tus partidas de la temporada previa para calcular tu mejor héroe, rol y estadísticas generales en comparación con otros jugadores de tu mismo nivel de habilidad. Es una instantánea perfecta de alto nivel de tu temporada.",
  "june22_battle_report_head02": "Jugadas destacadas",
  "june22_battle_report_desc02": "¿Recuerdas esa partida con una loca remontada después de una hora y media? El informe de batalla la recuerda —y sabe que es notable. Descubre las tendencias y récords en la pantalla individualizada de jugadas destacadas. Siempre sabrás cuál es el próximo hito a superar.",
  "june22_battle_report_head03": "Análisis profundo",
  "june22_battle_report_desc03": "¿Quieres aún más estadísticas? El informe de batalla te permite profundizar en tus partidas —ordenándolas, filtrándolas y analizándolas por héroe, rol o partidas individuales. Tómate el tiempo que quieras; ahí lo verás todo.",
  "june22_battle_report_head04": "Gana recompensas",
  "june22_battle_report_desc04": "A medida que exploras tu informe de batalla, irás ganando medallas de oro, plata y bronce por resultados sobresalientes. Cada medalla te otorga Fragmentos por tus logros: 400 por las medallas de oro, 300 por las de plata y 200 por las de bronce.",
  "june22_battle_report_head05": "Exclusivo de Dota Plus",
  "june22_battle_report_desc05": "El informe de batalla está disponible exclusivamente para los miembros de Dota Plus. Al inicio de cada nueva temporada, todos los miembros de Dota Plus reciben automáticamente un nuevo informe de batalla que detalla todas sus aventuras en el juego de la temporada anterior.",
  "june22_featured_game_mode_title": "Destacados del fin de semana",
  "june22_featured_game_mode_head01": "Viejos amigos, nuevos giros, relucientes fragmentos",
  "june22_featured_game_mode_desc01": "Acompáñanos en los destacados del fin de semana, una nueva cola a disposición de todos para explorar una variedad de modos de juego y eventos de Dota, mientras adquieres fragmentos de Dota Plus.",
  "june22_featured_game_mode_head02": "Rotación de modos de juego",
  "june22_featured_game_mode_desc02": "El primer modo en los destacados del fin de semana es la Selección de habilidad (SH), disponible del 8 al 13 de junio. Si nunca has participado en la Selección de habilidad o no lo has hecho recientemente, ahora es el momento perfecto para unirse a la creciente comunidad de SH y crear algunas combinaciones de nuevas habilidades de monstruos utilizando la nueva y fácil de utilizar pantalla de selección.",
  "june22_featured_game_mode_head03": "Mientras más fuerte la llama, más rápido se quema",
  "june22_featured_game_mode_desc03": "Los destacados del fin de semana están disponibles por un tiempo limitado. Al jugar obtienes fragmentos de Dota Plus hasta un límite determinado, y al ganar obtienes más fragmentos. Mantente atento a más modos de juego en los destacados del fin de semana en los meses próximos. Luego, únete y busca las recompensas de fragmentos.",
  "june22_immortal_fx_title": "Efectos de hechizo para objetos inmortales desbloqueados",
  "june22_immortal_fx_head01": "El poder inmortal exige una elección definitiva",
  "june22_immortal_fx_desc01": "Tus efectos de hechizo para objetos inmortales ahora pueden equiparse sin importar qué equipo lleva tu héroe. ¿Quieres obtener víctimas de Dedo de la muerte con el efecto Anatema Infernal mientras llevas en lugar de ello la Garra Abisal en Lion? No hay problema.",
  "june22_match_clips_title": "Creador de clips",
  "june22_match_clips_head01": "Guardar y compartir",
  "june22_match_clips_desc01": "Haz capturas de tus momentos favoritos en el juego con el nuevo Creador de clips, una útil herramienta que te ayuda a elegir y guardar con rapidez un video compartible de alta calidad mientras ves juegos repetidos o en directo.",
  "june22_match_clips_head02": "Controles de clips",
  "june22_match_clips_desc02": "Determina el momento de inicio y finalización de tu clip con una línea de tiempo precisa que incluye las muertes y víctimas del jugador. Podrás elegir el momento exacto que quieras compartir sin tener que utilizar herramientas de terceros.",
  "june22_match_clips_head03": "Máxima calidad",
  "june22_match_clips_desc03": "Puedes elegir características de renderizado avanzado para que el clip tenga sombras y reflejos de mayor calidad, ocultar la interfaz en el juego durante el clip y suavizar la velocidad de fotogramas hasta 90 FPS. La herramienta codifica directamente un video en formato h.264 en Windows, y otras plataformas producen fotogramas individuales.",
  "june22_avoid_player_title": "Característica mejorada para evitar jugadores",
  "june22_avoid_player_head01": "Tomar notas",
  "june22_avoid_player_desc01": "¿No recuerdas por qué decidiste evitar a un determinado jugador? Basta con dejar una nota para incluir la razón por la que lo añadiste a la lista de jugadores a evitar.",
  "june22_avoid_player_head02": "Compra más espacios",
  "june22_avoid_player_desc02": "La lista de jugadores a evitar tiene 25 espacios por defecto, pero si prefieres tener más, puedes ampliarla utilizando fragmentos para adquirir espacios adicionales.",
  "june22_shards_title": "Compra con fragmentos",
  "june22_shards_head01": "Efectos de racha de víctimas",
  "june22_shards_desc01": "Decora la interfaz dentro del juego con estos efectos especiales que muestran las rachas de víctimas provocadas por tu héroe. Elige entre efectos de fuego, hielo y oro, disponibles por 150 000 fragmentos en la tienda de fragmentos.",
  "june22_shards_head02": "Tesoro estacional",
  "june22_shards_desc02": "Ya está aquí el tesoro estacional del verano de 2022, que puedes comprar con fragmentos y que, a diferencia de tesoros estacionales anteriores, está disponible para todos los clientes, no solo para los miembros de Dota Plus.\\n\\nEste tesoro incluye sets completamente nuevos para Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit y Wraith King. También trae al Boticario Intemporal, el mensajero con gemas etéreas y prismáticas aleatorias para los afortunados que se ganen su medicina.",
  "june22_shards_head03": "Sets de temporada",
  "june22_shards_desc03": "¿Te quedaste sin conseguir algunos de los sets de los tesoros anteriores de Dota Plus? Los sets del Tesoro de Otoño 2020 y del Tesoro de Invierno 2020 pueden adquirirse ahora directamente en la tienda de fragmentos por 15 000 fragmentos cada uno.",
  "june22_shards_head04": "Reliquias para todos",
  "june22_shards_desc04": "Ahora, todos los jugadores pueden comprar todas las reliquias de héroes con fragmentos, no solo los miembros de Dota Plus. Todos puede usar las reliquias para hacer un seguimiento de sus estadísticas y ganar una bonificación de experiencia de héroe, pero solamente los miembros de Dota Plus podrán subir más allá del nivel 5.",
  "june22_plus_update_title": "Renovación estacional de Dota Plus",
  "june22_plus_update_head01": "Misiones de Dota Plus",
  "june22_plus_update_desc01": "La actualización de hoy también incluye un nuevo conjunto de misiones de Dota Plus con las que puedes conseguir más fragmentos —hasta 115 200 durante toda la temporada— para todas las novedades.",
  "june22_plus_update_head02": "Recompensas de clan",
  "june22_plus_update_desc02": "También hemos actualizado las recompensas de clan de la temporada con un nuevo conjunto de emoticonos, aerosoles y ruedas de chat para los clanes de nivel plata, oro y platino.",
  "june22_gameplay_title": "Actualización 7.31d"
}