// 5709.js

{
  "language": "czech",
  "june22_title": "Zpráva o herním stylu",
  "june22_subtitle": "Dota Plus – aktualizace pro léto 2022",
  "june22_desc": "Letní aktualizace programu Dota Plus přináší klasickou sezónní obměnu, ale neštítí se ani novinek. Co byste řekli zprávě o herním stylu mapující Váš výkon napříč všemi zápasy uplynulé sezóny, víkendové volbě vyzdvihující různé módy nebo možnosti vybavit Immortal efekty schopností nezávisle na souvisejících předmětech? Plus je tu nová truhla, další nové či vylepšené funkce a ještě něco navíc – třeba herní aktualizace 7.31d přidávající Marci do Kapitánského režimu.",
  "june22_battle_report_title": "Zpráva o herním stylu",
  "june22_battle_report_head01": "Vybrané statistiky",
  "june22_battle_report_desc01": "Zpráva projde všechny Vaše zápasy dané sezóny a určí Vašeho nejlepšího hrdinu, roli a celkové statistiky v porovnání s hráči stejné dovednostní úrovně. Přehledná tečka za několika měsíci hraní!",
  "june22_battle_report_head02": "Shrnutí toho nej",
  "june22_battle_report_desc02": "Vzpomínáte si na ten šílený zápas, který jste po hodině a půl kompletně otočili? Zpráva o herním stylu ano, takže ho společně s dalšími svými trendy a rekordy najdete mezi „tím nej“.",
  "june22_battle_report_head03": "Detailní analýza",
  "june22_battle_report_desc03": "Lačníte po více statistikách? Zpráva Vám ráda vyhoví – třiďte, filtrujte a zkoumejte své zápasy podle hrdinů, rolí nebo čehokoli jiného. A nikam nechvátejte, času ke zlepšení je vždy dost.",
  "june22_battle_report_head04": "Odměny za výkon",
  "june22_battle_report_desc04": "Zpráva není pouze informační a za mimořádné výsledky také uděluje zlaté, stříbrné a bronzové medaile, z nichž každá je rovná 400, 300 a 200 plusových střepů. Být dobrý se zkrátka vyplácí.",
  "june22_battle_report_head05": "Pouze pro členy",
  "june22_battle_report_desc05": "Zpráva o herním stylu je dostupná exkluzivně členům programu Dota Plus, kteří vždy se začátkem nové sezóny automaticky obdrží čerstvé shrnutí všech důležitých statistik ze sezóny uplynulé.",
  "june22_featured_game_mode_title": "Víkendová volba",
  "june22_featured_game_mode_head01": "Nové zážitky a odměny",
  "june22_featured_game_mode_desc01": "Zvolte si zábavu na víkend a společně se všemi ostatními hráči vyzkoušejte různorodé módy. Za účast (a výhry obzvlášť) budete odměněni nejen zážitky, ale také plusovými střepy!",
  "june22_featured_game_mode_head02": "Rotace herních módů",
  "june22_featured_game_mode_desc02": "Prvním módem je Výběr schopností dostupný mezi 8. a 13. červnem. Pokud jste ho delší dobu (nebo nikdy) nehráli, teď je ideální čas do něj naskočit a vytvořit monstrum, tedy hrdinu, s co nejsilnějším kombem schopností. A jako druhý mód chystáme na víkend 16. až 20. června Overthrow – trojice, rychlejší verzi našeho arénového módu.",
  "june22_featured_game_mode_head03": "Kalendář vyžadován",
  "june22_featured_game_mode_desc03": "Víkendové volby jsou dostupné pouze po omezený čas a za jejich hraní jste odměňováni plusovými střepy, kterých je za výhry ještě víc. Těšte se, jaké zajímavé módy pro Vás chystáme na příští měsíce!",
  "june22_immortal_fx_title": "Neomezené Immortal efekty schopností",
  "june22_immortal_fx_head01": "Kombinace nadlidské moci",
  "june22_immortal_fx_desc01": "Immortal efekty schopností vlastněných předmětů je nově možné vybavit nezávisle na nesených kosmetických doplňcích. Chcete například provádět zabití schopnosti Finger of Death s efektem předmětu Hell-Spar Anathema, zatímco máte na Lionovi vybavené slušivé klepeto předmětu Abyssal Hellclaw? Jak je ctěná libost!",
  "june22_match_clips_title": "Editor klipů",
  "june22_match_clips_head01": "Záznam a sdílení",
  "june22_match_clips_desc01": "Zachyťte epické herní momenty s editorem klipů, který Vám při sledování záznamu nebo probíhajícího zápasu pomůže sestříhat a uložit video ve vysoké kvalitě. Pak už ho jen stačí sdílet!",
  "june22_match_clips_head02": "Střihačské nástroje",
  "june22_match_clips_desc02": "Určete začátek a konec klipu prostřednictvím chytré časové osy zahrnující úmrtí a zabití hrdinů. Vyberte přesně to, co chcete sdílet, aniž byste museli zapínat nástroje třetích stran.",
  "june22_match_clips_head03": "Prémiová kvalita",
  "june22_match_clips_desc03": "Pro klip můžete nastavit vysokou kvalitu renderování stínů a odrazů, skrýt herní ukazatele a vyhladit snímky až do frekvence 90 FPS. Mimochodem, na systému Windows používá výstupní video kódování H.264, zatímco na jiných platformách jsou výsledkem samostatné snímky.",
  "june22_avoid_player_title": "Vylepšené vyloučení hráčů",
  "june22_avoid_player_head01": "Poznámky do budoucna",
  "june22_avoid_player_desc01": "Nepamatujete si, proč jste vyloučili toho kterého hráče? S dalšími se to už nestane, protože si k nim přidáte užitečnou poznámku hned, jak Vás něčím namíchnou.",
  "june22_avoid_player_head02": "Dodatečné sloty",
  "june22_avoid_player_desc02": "Seznam vyloučených hráčů má do začátku 25 slotů, ale pokud Vám to nestačí, můžete si nově za plusové střepy dokoupit dodatečná místa. Vaše nervy Vám poděkují!",
  "june22_shards_title": "Rozšíření plusového obchodu",
  "june22_shards_head01": "Efekty sérií zabití",
  "june22_shards_desc01": "Oživte svoji hru speciálními efekty, které se rozzáří v závislosti na sérii zabití daného hrdiny. Na výběr jsou ohnivé, ledové a zlaté efekty, každý za 150 000 plusových střepů.",
  "june22_shards_head02": "Sezónní truhla",
  "june22_shards_desc02": "Přivítejte truhlu pro léto 2022, kterou seženete za plusové střepy. A pozor, na rozdíl od předchozích sezónních truhel je tato dostupná všem, nejen členům programu Dota Plus!\\n\\nUvnitř se pak ukrývají nové sety pro Arc Wardena, Death Prophet, Ember Spirita, Juggernauta, Nyx Assassina, Ursu, Vengeful Spirit a Wraith Kinga doplněné ještě kurýrem Ageless Apothecary s náhodným prizmatickým a kinetickým gemem pro ty největší šťastlivce.",
  "june22_shards_head03": "Sezónní sety",
  "june22_shards_desc03": "Litujete, že jste prošvihli nějaké sety ze starších sezónních truhel? Konkrétně ty z podzimní a zimní truhly 2020 je nově možné přímo zakoupit v plusovém obchodu, každý za 15 000 střepů.",
  "june22_shards_head04": "Relikvie pro všechny",
  "june22_shards_desc04": "Relikvie hrdinů už nejsou omezeny na program Dota Plus! Všichni hráči tak mohou sledovat své statistiky a získávat bonusová XP hrdinů, nicméně úrovně nad pátou zůstanou i nadále exkluzivní pro „plusové hráče“.",
  "june22_plus_update_title": "Sezónní obměna programu Dota Plus",
  "june22_plus_update_head01": "Sezónní úkoly",
  "june22_plus_update_desc01": "Co by to bylo za aktualizaci programu Dota Plus, kdyby nedošlo k obnovení sezónních úkolů. Tak na nic nečekejte a běžte si vydělat až 115 200 střepů!",
  "june22_plus_update_head02": "Guildovní odměny",
  "june22_plus_update_desc02": "A pro členy guild stříbrné, zlaté a platinové hodnosti máme ještě nové emotikony, spreje a zvuky chatovacího kolečka.",
  "june22_gameplay_title": "Herní aktualizace 7.31d"
}