// 8811.js

{
  "language": "brazilian",
  "june22_title": "Atualização do relatório de batalha",
  "june22_subtitle": "Dota+ — Verão de 2022",
  "june22_desc": "A atualização de hoje abre as portas para a renovação sazonal do Dota+ e traz ainda mais. Aprofunde-se nos detalhes do seu desempenho ao longo de todas as partidas da última temporada com o Relatório de Batalha, explore uma variedade de modos de jogo com o Destaque Semanal e exiba os seus Imortais do jeito que você quiser com efeitos Imortais destravados. Há também um novo tesouro, novos (e atualizações de) recursos e outras novidades — incluindo a atualização de jogabilidade 7.31d, que dá as boas-vindas a Marci no Modo de Capitães.",
  "june22_battle_report_title": "Relatório de batalha",
  "june22_battle_report_head01": "Estatísticas realçadas",
  "june22_battle_report_desc01": "O relatório de batalha analisa o seu desempenho ao longo de todas as suas partidas na temporada anterior e calcula o seu melhor herói, função e estatísticas gerais em relação a outros jogadores no seu nível de habilidade. É o resumo perfeito e de alto nível da sua temporada.",
  "june22_battle_report_head02": "Destaques",
  "june22_battle_report_desc02": "Lembra daquela partida que terminou após uma hora e meia com uma virada insana? O relatório de batalha se lembra — e sabe da sua importância. Descubra tendências e recordes na tela separada de destaques. Você sempre saberá qual é a próxima meta a bater.",
  "june22_battle_report_head03": "Análises aprofundadas",
  "june22_battle_report_desc03": "Quer ver ainda mais? O relatório de batalha permite ir ainda além — ordenando, filtrando e analisando por herói, função ou partidas individuais. Pode ver, está tudo lá.",
  "june22_battle_report_head04": "Ganhe recompensas",
  "june22_battle_report_desc04": "Ao explorar o seu relatório de batalha, você receberá medalhas de ouro, prata e bronze por resultados excepcionais. Cada medalha concede fragmentos pela conquista: 400 por medalha de ouro, 300 por de prata e 200 por de bronze.",
  "june22_battle_report_head05": "Exclusivo do Dota+",
  "june22_battle_report_desc05": "O relatório de batalha está disponível exclusivamente para assinantes do Dota+. No início de cada nova temporada do Dota+, todos os assinantes receberão automaticamente um novo relatório de batalha detalhando todas as suas aventuras dentro do jogo durante a temporada anterior.",
  "june22_featured_game_mode_title": "Destaque semanal",
  "june22_featured_game_mode_head01": "Velhos amigos, novidades e fragmentos brilhantes",
  "june22_featured_game_mode_desc01": "Acompanhe-nos no destaque semanal, uma nova fila de busca onde todos podem explorar uma diversidade de modos de jogo e eventos de Dota enquanto acumula fragmentos do Dota+.",
  "june22_featured_game_mode_head02": "Rodízio de modos de jogo",
  "june22_featured_game_mode_desc02": "O primeiro modo do destaque semanal é a Seleção de Habilidades, disponível de 8 a 13 de junho. Caso nunca tenha experimentado esse modo ou não tenha jogado recentemente, esse é o momento perfeito para se juntar à comunidade da SH e criar algumas novas combinações monstruosas de habilidades usando a tela de seleção intuitiva. O segundo destaque semanal irá de 16 a 20 de junho, introduzindo o Overthrow em Trios (que apelidamos de \"Overthrios\"), uma versão mais rápida do modo original.",
  "june22_featured_game_mode_head03": "O que é bom dura pouco",
  "june22_featured_game_mode_desc03": "Cada destaque semanal ficará disponível por tempo limitado. Jogá-los concederá fragmentos do Dota+ até um valor máximo, com vitórias concedendo mais fragmentos. Fique de olho, pois mais modos de jogo passarão pelo destaque semanal nos próximos meses. Aí é só participar e ganhar fragmentos.",
  "june22_immortal_fx_title": "Efeitos Imortais destravados",
  "june22_immortal_fx_head01": "Um poder Imortal exige escolhas adequadas",
  "june22_immortal_fx_desc01": "Agora, os efeitos de habilidade dos seus itens Imortais podem ser equipados independentemente do item usado pelo herói. Quer jogar de Lion e matar com o Dedo da Morte usando o efeito da Anátema Infernal enquanto veste a garra de carangueijo \"Garra Infernal do Abismo\"? O seu desejo é uma ordem. Combine e misture os seus efeitos com quaisquer itens que você tiver. A escolha é sua.",
  "june22_match_clips_title": "Criador de clipes",
  "june22_match_clips_head01": "Salve e compartilhe",
  "june22_match_clips_desc01": "Registre os seus momentos favoritos durante partidas com o novo Criador de Clipes, uma ferramenta útil que ajuda a selecionar e salvar rapidamente um vídeo compartilhável de alta qualidade enquanto assiste a replays ou partidas ao vivo.",
  "june22_match_clips_head02": "Controle o clipe",
  "june22_match_clips_desc02": "Defina o início e o fim do seu clipe em uma linha do tempo refinada que inclui as mortes e vítimas de cada jogador. Você conseguirá selecionar o momento exato que deseja compartilhar sem precisar usar ferramentas externas.",
  "june22_match_clips_head03": "Alta qualidade",
  "june22_match_clips_desc03": "Você pode selecionar recursos avançados de renderização para obter sombras e reflexos de maior qualidade, ocultar a interface do jogo dentro do clipe e aumentar a taxa de quadros a até 90 QPS. A ferramenta codifica automaticamente um vídeo em formato H.264 no Windows, e em outras plataformas você receberá a faixa de áudio separada e cada quadro do clipe como uma imagem.",
  "june22_avoid_player_title": "Lista de indesejados aprimorada",
  "june22_avoid_player_head01": "Tome notas",
  "june22_avoid_player_desc01": "Não se lembra por que decidiu evitar um jogador específico? Salve uma mensagem para incluir o motivo da adição na lista.",
  "june22_avoid_player_head02": "Compre mais vagas",
  "june22_avoid_player_desc02": "Por padrão, a lista de jogadores indesejados tem 25 vagas, mas, caso queira mais, agora é possível trocar fragmentos por mais espaços na lista.",
  "june22_shards_title": "Compre com fragmentos",
  "june22_shards_head01": "Efeitos de sequências de vítimas",
  "june22_shards_desc01": "Decore a sua interface dentro nas partidas com efeitos especiais exibidos de acordo com a sequência de vítimas do seu herói. Escolha entre efeitos de fogo, gelo e ouro, disponíveis por 150.000 fragmentos cada na loja de fragmentos.",
  "june22_shards_head02": "Tesouro sazonal",
  "june22_shards_desc02": "O tesouro sazonal do verão de 2022 já está disponível para compra com fragmentos, e, ao contrário de tesouros sazonais anteriores, todo mundo pode comprar — não somente assinantes do Dota+.\\n\\nEsse tesouro conta com novos conjuntos para o Arc Warden, Death Prophet, Ember Spirit, Juggernaut, Nyx Assassin, Ursa, Vengeful Spirit e Wraith King. Para aqueles sortudos o bastante para provar os seus medicamentos, há a chance de ganhar o entregador \"Boticário Atemporal\", que já vem com gemas etéreas e prismáticas acopladas.",
  "june22_shards_head03": "Conjuntos sazonais",
  "june22_shards_desc03": "Perdeu a oportunidade de pegar alguns conjuntos de tesouros antigos do Dota+? Os conjuntos do Tesouro Outonal de 2020 e do Tesouro Invernal de 2020 já estão disponíveis para compra direta na loja de fragmentos, por 15.000 cada.",
  "june22_shards_head04": "Relíquias para todos",
  "june22_shards_desc04": "Agora, não só os assinantes do Dota+ podem trocar fragmentos por relíquias de herói. Todos podem usar as relíquias para rastrear as suas estatísticas e subir o Nível+ de heróis, mas só quem é assinante poderá ir além do nível 5.",
  "june22_plus_update_title": "Renovação sazonal do Dota+",
  "june22_plus_update_head01": "Missões do Dota+",
  "june22_plus_update_desc01": "A atualização de hoje também conta com um novo conjunto de missões para o Dota+, que ajuda a encher o seu estoque de fragmentos para usar em todas as novidades — é possível obter até 115.200 fragmentos durante a temporada.",
  "june22_plus_update_head02": "Recompensas de clã",
  "june22_plus_update_desc02": "Também atualizamos as recompensas sazonais de clã com um novo conjunto de emoticons, pinturas e mensagens sonoras para os clãs de nível prata, ouro e platina.",
  "june22_gameplay_title": "Atualização de jogabilidade 7.31d"
}