// 1020.js

{
  "language": "bulgarian",
  "kez_website_title": "Kez — нов Dota 2 герой",
  "kez_newhero_section_subheader": "Представяме",
  "kez_newhero_name": "Kez",
  "kez_newhero_description": "Що се отнася до стратегията, Kez има склонност да се осланя окрилената спонтанност. Способен е да превключва между своята катана и сай в движение, за да прорязва, запокитва, замахва и парира според това какво е нужно на бойното поле.<br><br>Но когато вложи мисъл, може да вземе под внимание всяка вероятност. Kez разполага с подходящия инструмент за всяка работа (допускайки, че си спомни навреме кой е правилният инструмент) и може да реши дали да атакува, да избяга или просто да надхитри своите врагове с мъничко предвидливо планиране.",
  "kez_abilities_heading": "Повече оръжия. Повече умения. Повече опции.",
  "kez_hero_detail_button": "Прегледайте страницата с подробности за героя",
  "kez_play_trailer_button": "Пускане на трейлъра",
  "kez_wallpapers": "Тапети",
  "kez_comic_section_catchup": "Наваксайте предисторията",
  "kez_comic_section_comic_title": "Нощта на възшествието",
  "kez_comic_section_comic_blub": "Преди да стане водач на казураите, Kez беше младо птиченце с пъргав език, талант за забъркване в неприятности и недопечен план да помогне на приятел в най-натоварената нощ през годината.",
  "kez_comic_section_read_comic": "Прочетете комикса",
  "kez_ability_description": "Kez разполага с два набора от оръжия, така че е съвсем подходящо да разполага с два съответни набора от умения. Единият е наличен, докато размахва Kazurai Katana. А другият, когато размахва Shodo Sai. Всеки оръжеен набор включва и уникални ефекти, когато атакува, но всичко това е прекалено забавно, за да развалим изненадата просто с приказки. Ето защо препоръчваме вместо това да погледнете по-долу, така че действително да надникнете какво представлява Kez, когато е в действие.",
  "kez_ability_switch_weapons": "Switch Discipline",
  "kez_ability_set_katana": "Katana",
  "kez_ability_set_sai": "Sai",
  "kez_details_more_info": "За подробни статистики относно Kez"
}