// 2509.js

{
  "language": "german",
  "kez_website_title": "Kez – Der neuer Dota-2-Held",
  "kez_newhero_section_subheader": "Jetzt neu",
  "kez_newhero_name": "Kez",
  "kez_newhero_description": "Wenn es um Strategie geht, neigt Kez zur Improvisation. Er ist in der Lage, in sekundenschnelle zwischen seinem Kazurai-Katana und seinen Shodo-Saigabeln zu wechseln, um je nach Anforderung des Schlachtfelds entweder Hiebe auszuteilen, schnell vorzupreschen, sich an Gegner heranzuziehen oder Angriffe zu parieren.<br><br>Solange er sein Spatzenhirn nur genug anstrengt, ist er für alle Eventualitäten gerüstet, denn Kez hat für jede Situation das passende Werkzeug (wenn er sich denn nur rechtzeitig daran erinnert). Dadurch kann er seine Gegner nach Belieben attackieren, vor ihnen fliehen oder sie mit ein wenig Vorausplanung auch leicht überlisten.",
  "kez_abilities_heading": "Mehr Waffen, mehr Fähigkeiten, mehr Optionen",
  "kez_hero_detail_button": "Heldendetailseite anzeigen",
  "kez_play_trailer_button": "Trailer abspielen",
  "kez_wallpapers": "Ladebildschirme",
  "kez_comic_section_catchup": "Was bisher geschah …",
  "kez_comic_section_comic_title": "Nacht der Krönung",
  "kez_comic_section_comic_blub": "Bevor er zu einem Anführer der Kazurai wurde, war Kez ein junger Vogel mit losem Mundwerk und hatte ein Talent dafür, in Schwierigkeiten zu geraten. Dann heckte er eines Tages einen tollkühnen Plan aus, um einem Freund in der lebhaftesten Nacht des Jahres aus der Patsche zu helfen …",
  "kez_comic_section_read_comic": "Comic lesen",
  "kez_ability_description": "Kez beherrscht zwei verschiedene Waffenarten und verfügt dementsprechend auch über zwei verschiedene Fähigkeitensets. Auf das erste Set kann er zugreifen, während er sein Kazurai-Katana schwingt, und auf das zweite, während er seine Shodo-Saigabeln einsetzt. Jede Technik gewährt ihm außerdem einzigartige Angriffseffekte – jedoch wollen wir an dieser Stelle nicht zu viel verraten, um den Spaß am Ausprobieren nicht zu verderben. Wir empfehlen, selbst einen Blick auf Kez zu werfen und ihn in Aktion zu erleben.",
  "kez_ability_switch_weapons": "Waffenwechsel",
  "kez_ability_set_katana": "Katana",
  "kez_ability_set_sai": "Saigabeln",
  "kez_details_more_info": "Detaillierte Infos über Kez"
}