// 7370.js

{
  "language": "latam",
  "kez_website_title": "Kez: El nuevo héroe de Dota 2",
  "kez_newhero_section_subheader": "Presentamos a",
  "kez_newhero_name": "#|m|#Kez",
  "kez_newhero_description": "Cuando se trata de estrategia, Kez tiende a improvisar: es capaz de cambiar sobre la marcha entre su katana y sai para cortar, moverse rápido, lanzarse en picada y hacer bloqueos según lo exijan las necesidades del campo de batalla.<br><br>Pero cuando se lo propone, se puede contar con él para cualquier eventualidad. Kez tiene la herramienta adecuada para cada trabajo (suponiendo que recuerde a tiempo cuál es la herramienta adecuada) y puede elegir entre atacar, escapar o simplemente burlar a sus enemigos con un poco de planificación con antelación.",
  "kez_abilities_heading": "Más armas, más habilidades, más opciones",
  "kez_hero_detail_button": "Ver la página de detalles del héroe",
  "kez_play_trailer_button": "Reproducir avance",
  "kez_wallpapers": "Fondos de pantalla",
  "kez_comic_section_catchup": "Ponte al día con la historia",
  "kez_comic_section_comic_title": "Noche de Ascensión",
  "kez_comic_section_comic_blub": "Antes de ser líder de los Kazurai, Kez era un joven pájaro hablador, con talento para meterse en problemas y un plan a medias para ayudar a un amigo en la noche más concurrida del año.",
  "kez_comic_section_read_comic": "Lee el cómic",
  "kez_ability_description": "Kez tiene dos set de armas, por lo que es adecuado que tenga dos sets de habilidades para igualar. Un set está disponible mientras blande su katana Kazurai y el otro cuando empuñe su sai Shodo. Cada set de armas también presenta efectos únicos al atacar, pero es demasiado divertido para estropearlo aquí en pocas palabras, por lo que recomendamos echar un vistazo a continuación para ver a Kez en acción.",
  "kez_ability_switch_weapons": "Cambiar de Disciplina",
  "kez_ability_set_katana": "Katana",
  "kez_ability_set_sai": "Sai",
  "kez_details_more_info": "Para ver en detalle los atributos de Kez"
}