// 1580.js

{
  "language": "romanian",
  "kez_website_title": "Kez – Noul erou din Dota 2",
  "kez_newhero_section_subheader": "Vi-l prezentăm pe",
  "kez_newhero_name": "Kez",
  "kez_newhero_description": "Când vine vorba de strategie, Kez tinde să improvizeze: acesta mânuiește cu dibăcie cele două tipuri de arme, katana și pumnalele tridente sai, pe care le schimbă din mers pentru a se adapta la nevoile de pe câmpul de luptă.<br><br>Atunci când își pune mintea la contribuție, Kez e pregătit pentru orice scenariu, deoarece are instrumentul potrivit pentru orice (presupunând că își amintește în timp util care-i instrumentul potrivit). Datorită abilităților sale versatile, acesta poate să atace, să se retragă sau să-și depășească inamicii.",
  "kez_abilities_heading": "Mai multe arme, mai multe abilități, mai multe opțiuni",
  "kez_hero_detail_button": "Vezi pagina cu detaliile eroului",
  "kez_play_trailer_button": "Redă trailerul",
  "kez_wallpapers": "Imagini de fundal",
  "kez_comic_section_catchup": "Fii la curent cu povestea",
  "kez_comic_section_comic_title": "Noaptea Ascensiunii",
  "kez_comic_section_comic_blub": "Înainte de a deveni liderul armatei Kazurai, Kez era un păsăroi tânăr rebel, cu un talent înnăscut de a intra în necazuri și un plan îndoielnic de a-și ajuta un prieten în cea mai aglomerată noapte din an.",
  "kez_comic_section_read_comic": "Citește banda desenată",
  "kez_ability_description": "Kez are două seturi de arme, așa că se cuvine să aibă două seturi de abilități, câte unul pentru fiecare tip de armă. Un set de abilități este pentru când mânuiește katana specifică armatei Kazurai, iar al doilea pentru când mânuiește pumnalele tridente sai specifice Ordinului Shodo. Fiecare set de arme dispune de efecte unice pentru atac, însă totul e atât de interesant încât nu vrem să ne rezumăm la o simplă descriere, așa că-ți recomandăm să arunci un ochi mai jos pentru a-l vedea pe Kez în acțiune.",
  "kez_ability_switch_weapons": "Switch Discipline",
  "kez_ability_set_katana": "Katana",
  "kez_ability_set_sai": "Sai",
  "kez_details_more_info": "Pentru statistici detaliate despre Kez"
}