// 6756.js

{
  "language": "portuguese",
  "largo_hero_name": "Largo",
  "largo_website_title": "Largo - Novo herói do Dota 2",
  "largo_website_subtitle": "Atualização do Largo + 7.40",
  "largo_website_summary": "Herói novo, Tesouro de Inverno e atualização 7.40",
  "largo_website_introduction": "Os exilados de Murkroot descobriram Velu'mar, uma ilha viva tão antiga que só se exprime através de canções. Criado entre os trovadores xamanísticos que aprenderam a comungar com a ilha, Largo percorre agora os reinos com uma trupe de discípulos sapinhos, à procura de inspiração para novas melodias que possa trazer de volta para a ilha onde agora vivem e partilhá-las.<br><br>No campo de batalha, Largo amplifica os seus aliados, inspirando uma conjuração de feitiços mais eficiente e projetando mais dano sobre os seus inimigos. Ele é rápido a apanhar tanto amigos como inimigos, controlando o ritmo de uma escaramuça com a sua língua pegajosa, enquanto os seus sapinhos estão sempre dispostos a esmagar os adversários com os pés. E quando a batalha começa a animar, Largo não hesita em saltar para as luzes da ribalta e tocar o seu repertório de canções de Murkroot que concedem à sua equipa bênçãos poderosas que mudam o tom e a dinâmica de uma luta definitivamente a seu favor.",
  "largo_archor_new_hero": "Novo herói",
  "largo_archor_new_treasure": "Tesouro de Inverno",
  "largo_archor_new_gameplay": "Atualização de jogabilidade 7.40",
  "largo_comic_label": "Descobre as origens deste herói",
  "largo_comic_title": "A Ilha que Vem",
  "largo_comic_description": "Há muito, muito tempo, uma catástrofe obrigou os antepassados de Largo a fugir para a ilha viva de Velu'Mar. Mas agora, a ilha ficou em silêncio e cabe ao Largo descobrir porquê.",
  "largo_herodetails_section_subheader": "Para mais detalhes sobre o Largo...",
  "largo_treasure_section_label": "Tesouro de Inverno",
  "largo_treasure_section_title": "Collector's Cache",
  "largo_treasure_section_introduction": "Explora a nova Collector's Cache de Inverno, com 16 conjuntos para heróis como Tiny, Centaur Warrunner, Silencer e muitos mais.",
  "largo_treasure_hero_shadow_fiend": "Shadow Fiend",
  "largo_treasure_hero_shadow_fiend_set": "Lord of the Sundered Souls",
  "largo_treasure_hero_primal_beast": "Primal Beast",
  "largo_treasure_hero_primal_beast_set": "Prehistoric Predator",
  "largo_treasure_hero_broodmother": "Broodmother",
  "largo_treasure_hero_broodmother_set": "The White Widow",
  "largo_treasure_hero_enigma": "Enigma",
  "largo_treasure_hero_enigma_set": "Angel of the Abyss",
  "largo_treasure_hero_ringmaster": "Ringmaster",
  "largo_treasure_hero_ringmaster_set": "Harrow's Harvest",
  "largo_treasure_hero_morphling": "Morphling",
  "largo_treasure_hero_morphling_set": "Fluid Frenzy",
  "largo_treasure_hero_silencer": "Silencer",
  "largo_treasure_hero_silencer_set": "Worship of the Whispered Wing",
  "largo_treasure_hero_centaur_warrunner": "Centaur Warrunner",
  "largo_treasure_hero_centaur_warrunner_set": "Cunning Counterfeit",
  "largo_treasure_hero_tiny": "Tiny",
  "largo_treasure_hero_tiny_set": "Stone Giant Stronghold",
  "largo_gameplay_subtitle": "Notas da atualização",
  "largo_gameplay_title": "Atualização de jogabilidade 7.40",
  "largo_gameplay_description": "Ficam aqui em destaque algumas alterações a heróis, a itens neutros e até ao mapa. Depois, descobre todas as outras novidades nas notas da atualização mais abaixo.",
  "largo_gameplay_heroes_title": "Atualizações de heróis em destaque",
  "largo_gameplay_heroes_lone_druid_highlight_1": "Sylla e o seu urso aprenderam uns truques novos: o Lone Druid pode prender inimigos ao chão com a nova habilidade Entangle, enquanto o novo Spirit Bear tem a sua própria árvore de talentos.",
  "largo_gameplay_heroes_slark_highlight_1": "O único fugitivo da prisão do Recife Obscuro está mais esguio do que nunca, com Essence Shift como a habilidade Inata, enquanto a nova habilidade Saltwater Shiv lhe permite roubar regeneração de vida e rapidez de movimento a inimigos.",
  "largo_gameplay_heroes_treant_highlight_1": "Até as árvores acabam por ficar sem paciência. A nova versão de Leech Seed é mais perigosa e a nova interação com Aghanim's Scepter torna Overgrowth ainda mais poderosa. Rooftrellen está furioso e pronto para enfrentar de perto os inimigos que ameaçam as suas florestas.",
  "largo_gameplay_neutral_items_title": "Itens neutros em destaque",
  "largo_gameplay_neutral_items_description": "Vasculhámos as prateleiras de todas as lojas e os acampamentos das selvas à procura de alguns itens neutros inéditos (e alguns clássicos de longa data) para esta atualização.",
  "largo_gameplay_neutral_items_new": "Novo",
  "largo_gameplay_neutral_items_removed_title": "Itens removidos em destaque",
  "largo_gameplay_neutral_items_removed_description": "Antes de te entusiasmares com o novo dado batoteiro e o prisma estrambólico desta atualização, faz uma pausa para relembrarmos todos juntos alguns dos itens neutros que, infelizmente, tiveram de dizer adeus ao jogo.",
  "largo_gameplay_terrain_title": "Alterações ao terreno",
  "largo_gameplay_terrain_description": "Enquanto considerávamos alguns ajustes a vários locais do mapa com vista a melhorar a movimentação e a jogabilidade, aproveitámos a ocasião para melhorar muitos elementos visuais por todo o mapa. Podes arrastar o ícone abaixo para os lados se quiseres ver algumas das alterações. Abre no jogo e entra numa partida para veres o resto.",
  "largo_gameplay_terrain_comparison_widsom_radiant": "Altar da Sabedoria (Radiant)",
  "largo_gameplay_terrain_comparison_widsom_dire": "Altar da Sabedoria (Dire)",
  "largo_gameplay_terrain_comparison_gates_radiant": "Portões Defensivos (Radiant)",
  "largo_gameplay_terrain_comparison_gates_dire": "Portões Defensivos (Dire)",
  "largo_gameplay_terrain_comparison_bridge_radiant": "Ponte (Radiant)",
  "largo_gameplay_terrain_comparison_bridge_dire": "Ponte (Dire)",
  "largo_gameplay_qol_title": "Melhorias adicionais",
  "largo_gameplay_qol_description": "Para além de tudo o que certamente leste acima, também temos mais algumas coisas a mencionar antes de ires à tua vida.",
  "largo_gameplay_qol_demo_hero_title": "Modo de teste de heróis: agora com multijogador",
  "largo_gameplay_qol_demo_hero_description": "Tomámos a medida drástica de mudar o modo de teste de heróis. Já não é apenas uma solitária experiência para um só jogador e agora pode ser uma moche multijogador que podes jogar com um grupo de amigos. Avanços fascinantes na ciência que estuda a amizade sugerem que testar mecânicas com amigos pode ser mais divertido do que testar a sós. Mas estas são só conclusões preliminares. Experimenta já o modo de teste de heróis com alguns amigos e confirma em primeira mão. Vais encontrar o Roshan e um Tormentor à tua espera, juntamente com um menu atualizado que te permite criar qualquer creep neutro, controlar o tempo e alterar várias outras definições globais.",
  "largo_gameplay_qol_general_title": "Geral",
  "largo_gameplay_qol_buffs_description": "Novidade do Dota Plus: o resumo pós-partida tem agora o separador \"Buffs\". Os jogadores podem ver o número e a duração de buffs e debuffs em inimigos e aliados.",
  "largo_gameplay_qol_ability_tormentor_description": "Novidade: foi adicionado um indicador de Tormentors para comunicar quando e onde o próximo irá aparecer.",
  "largo_gameplay_qol_ability_draft_title": "Seleção de Habilidades",
  "largo_gameplay_qol_ability_draft_description_1": "Foram corrigidas as interações de Walrus Punch com outras habilidades (Swashbuckle, Starbreaker, etc.).",
  "largo_gameplay_qol_ability_draft_description_2": "Foi corrigido um problema em que Swashbuckle, Lil' Shredder e Falcon Rush não podiam ativar Time Lock.",
  "largo_gameplay_qol_ability_draft_description_3": "Foi corrigido um caso em que Fatal Bonds + Sinister Gaze (Faceta \"Evil Eye\") causavam dano infinito.",
  "largo_gameplay_qol_ability_draft_description_4": "Shadow Fiend: Necromastery foi substituída por Feast of Souls.",
  "largo_gameplay_qol_ability_draft_description_5": "Phantom Assassin: Blur foi substituída por Immaterial.",
  "largo_gameplay_qol_ability_draft_description_6": "Phantom Assassin: Coup de Grace agora concede Blur.",
  "largo_gameplay_qol_ability_draft_description_7": "Spectre: Desolate foi substituída por Shadow Step.",
  "largo_gameplay_qol_ability_draft_description_8": "Spectre: Haunt agora concede Reality.",
  "largo_gameplay_qol_ability_draft_description_9": "Lone Druid: nova habilidade, Entangle.",
  "largo_gameplay_qol_ability_draft_description_10": "Slark: Essence Shift foi substituída por Saltwater Shiv.",
  "largo_gameplay_qol_ability_draft_description_11": "Medusa: nova habilidade, Gorgon's Grasp."
}