// 1674.js

{
  "language": "italian",
  "largo_hero_name": "Largo",
  "largo_website_title": "Nuovo Eroe di Dota 2: Largo",
  "largo_website_subtitle": "Largo + l'aggiornamento 7.40",
  "largo_website_summary": "Nuovo Eroe, Tesoro invernale e aggiornamento di gioco 7.40",
  "largo_website_introduction": "I Murkroot esiliati di Velu'Mar hanno scoperto un'isola vivente così antica che parla solo attraverso i canti. Cresciuto tra i bardi sciamanici che hanno imparato a comunicare con essa, Largo ora vaga per i regni con una troupe di rane discepole, in cerca di ispirazione per nuove melodie da riportare a casa. <br><br>Largo amplifica i suoi alleati sul campo di battaglia, ispirando incantesimi efficaci e infliggendo danni maggiori ai suoi nemici. Cattura rapidamente amici e nemici, controllando il flusso di una zuffa con la sua lingua appiccicosa, e le sue rane sono sempre pronte a pestare i piedi per terra. Quando si lancia in battaglia, Largo si mette con entusiasmo al centro dell'azione e suona i suoi brani migliori, strimpellando il suo strumento per eseguire il suo repertorio di canzoni Murkroot famose che conferiscono potenti benedizioni alla sua squadra, cambiando il ritmo e l'esito della battaglia a suo favore.",
  "largo_archor_new_hero": "Nuovo Eroe",
  "largo_archor_new_treasure": "Tesoro invernale",
  "largo_archor_new_gameplay": "Aggiornamento di gioco 7.40",
  "largo_comic_label": "Riassunto della storia fino a questo momento",
  "largo_comic_title": "L'isola che riaffiora",
  "largo_comic_description": "Generazioni fa, una catastrofe spinse gli antenati di Largo sull'isola vivente di Velu'Mar, ma ora l'isola è diventata silenziosa e sta a Largo scoprirne il motivo.",
  "largo_herodetails_section_subheader": "Per le statistiche dettagliate su Largo",
  "largo_treasure_section_label": "Tesoro invernale",
  "largo_treasure_section_title": "Bottino del Collezionista",
  "largo_treasure_section_introduction": "Tuffati in un Bottino del Collezionista nuovo di zecca, con 16 set per tantissimi Eroi, tra cui Tiny, Centaur Warrunner, Silencer e altri.",
  "largo_treasure_hero_shadow_fiend": "Shadow Fiend",
  "largo_treasure_hero_shadow_fiend_set": "Signore delle Anime Lacerate",
  "largo_treasure_hero_primal_beast": "Primal Beast",
  "largo_treasure_hero_primal_beast_set": "Predatore Preistorico",
  "largo_treasure_hero_broodmother": "Broodmother",
  "largo_treasure_hero_broodmother_set": "La Vedova Bianca",
  "largo_treasure_hero_enigma": "Enigma",
  "largo_treasure_hero_enigma_set": "Angelo degli Abissi",
  "largo_treasure_hero_ringmaster": "Ringmaster",
  "largo_treasure_hero_ringmaster_set": "Mietitura del Tormento",
  "largo_treasure_hero_morphling": "Morphling",
  "largo_treasure_hero_morphling_set": "Frenesia Fluida",
  "largo_treasure_hero_silencer": "Silencer",
  "largo_treasure_hero_silencer_set": "Culto delle Ali dei Sussurri",
  "largo_treasure_hero_centaur_warrunner": "Centaur Warrunner",
  "largo_treasure_hero_centaur_warrunner_set": "Imitazione Astuta",
  "largo_treasure_hero_tiny": "Tiny",
  "largo_treasure_hero_tiny_set": "Roccaforte Gigante di Pietra",
  "largo_gameplay_subtitle": "Note della patch",
  "largo_gameplay_title": "Aggiornamento di gioco 7.40",
  "largo_gameplay_description": "Dai un'occhiata ad alcune modifiche in evidenza agli Eroi, agli oggetti neutrali e persino alla mappa. Poi approfondisci per scoprire tutto il resto nelle note della patch in fondo alla pagina.",
  "largo_gameplay_heroes_title": "Eroi modificati in evidenza",
  "largo_gameplay_heroes_lone_druid_highlight_1": "Sia Sylla che il suo orso hanno appreso alcuni nuovi trucchi: Sylla può sconfiggere i nemici con una nuova abilità Intrappolamento e il suo nuovissimo Spirito Orso ha un nuovissimo albero dei talenti.",
  "largo_gameplay_heroes_slark_highlight_1": "L'unico evaso dalla prigione di Scogliera Profonda è più sfuggente che mai, con Furto d'essenza come abilità innata e la nuova abilità Lama salmastra, che gli permette di rubare la rigenerazione della salute e la velocità di movimento del nemico.",
  "largo_gameplay_heroes_treant_highlight_1": "Alla fine anche gli alberi perdono la pazienza. Con un Seme parassita modificato in modo da essere ancora più minaccioso e un fortissimo potenziamento di Crescita eccessiva, Rooftrellen è arrabbiato e sta cercando di conoscere da vicino i nemici che minacciano le sue foreste.",
  "largo_gameplay_neutral_items_title": "Oggetti neutrali in evidenza",
  "largo_gameplay_neutral_items_description": "Abbiamo setacciato tutti gli scaffali del negozio e i campi nella giungla per trovare alcuni nuovi oggetti neutrali (e alcuni classici) da buttare nel mix.",
  "largo_gameplay_neutral_items_new": "Novità",
  "largo_gameplay_neutral_items_removed_title": "Oggetti neutrali in evidenza rimossi",
  "largo_gameplay_neutral_items_removed_description": "Prima di lasciarti prendere la mano dai tuoi dadi truccati e dai tuoi prismi luccicanti, prendiamoci un momento per rendere omaggio ad alcuni oggetti neutri che non sono stati selezionati.",
  "largo_gameplay_terrain_title": "Modifiche al terreno",
  "largo_gameplay_terrain_description": "Abbiamo approfittato delle modifiche apportate ai percorsi sulla mappa e al gameplay per perfezionare molti aspetti visivi in tutta la mappa. Usa il cursore qui sotto per meglio evidenziare alcune delle modifiche. Avvia il gioco per scoprire tutte le altre!",
  "largo_gameplay_terrain_comparison_widsom_radiant": "Santuario della Saggezza dei Radiant",
  "largo_gameplay_terrain_comparison_widsom_dire": "Santuario della Saggezza dei Dire",
  "largo_gameplay_terrain_comparison_gates_radiant": "Barriere protettive dei Radiant",
  "largo_gameplay_terrain_comparison_gates_dire": "Barriere protettive dei Dire",
  "largo_gameplay_terrain_comparison_bridge_radiant": "Ponte dei Radiant",
  "largo_gameplay_terrain_comparison_bridge_dire": "Ponte dei Dire",
  "largo_gameplay_qol_title": "Miglioramenti aggiuntivi",
  "largo_gameplay_qol_description": "Oltre a tutto ciò che hai sicuramente letto sopra, abbiamo giusto alcune altre cose da menzionare prima che tu te ne vada.",
  "largo_gameplay_qol_demo_hero_title": "Modalità di prova multigiocatore",
  "largo_gameplay_qol_demo_hero_description": "Abbiamo intrapreso un passo radicale e trasformato la modalità di prova, prima noiosa e solitaria, in una festosa esperienza multigiocatore. Ricerche approfondite nel campo della scienza dell'amicizia hanno dimostrato che testare le meccaniche di gioco con altri giocatori è molto più divertente. Ma questi sono solo i risultati preliminari. Entra nella modalità di prova con i tuoi amici e scoprilo di persona! Ti aspettano Roshan e un Oppressore, insieme a un sacco di modifiche alle opzioni del menu che ti permetteranno di far rinascere qualsiasi creep neutrale, controllare il tempo e modificare molte altre impostazioni globali.",
  "largo_gameplay_qol_general_title": "Generali",
  "largo_gameplay_qol_buffs_description": "Novità per Dota Plus: aggiunta la scheda \"Effetti positivi\" al post-partita. I giocatori possono visualizzare il numero o la durata degli effetti positivi e negativi su nemici e alleati.",
  "largo_gameplay_qol_ability_tormentor_description": "Novità: aggiunto il timer a Oppressore per comunicare la posizione e il momento della rinascita.",
  "largo_gameplay_qol_ability_draft_title": "Ability Draft",
  "largo_gameplay_qol_ability_draft_description_1": "Risolta l'interazione con Pugno del TRICHECO! (Raffica di affondi, Schianto stellare, ecc.).",
  "largo_gameplay_qol_ability_draft_description_2": "Risolto il problema per cui Blocco temporale non funzionava con Raffica di affondi, Piccolo distruttore e Scatto del falco.",
  "largo_gameplay_qol_ability_draft_description_3": "Risolto il problema per cui Legami fatali + Sguardo sinistro (faccetta Malocchio) causava un danno infinito.",
  "largo_gameplay_qol_ability_draft_description_4": "Shadow Fiend: Necromaestria è stata sostituita con Banchetto delle anime.",
  "largo_gameplay_qol_ability_draft_description_5": "Phantom Assassin: Sfocatura è stata sostituita con Immateriale.",
  "largo_gameplay_qol_ability_draft_description_6": "Phantom Assassin: ora Esecuzione conferisce Sfocatura.",
  "largo_gameplay_qol_ability_draft_description_7": "Spectre: Desolazione è stata sostituita con Passo oscuro.",
  "largo_gameplay_qol_ability_draft_description_8": "Spectre: ora Tormento conferisce Realtà.",
  "largo_gameplay_qol_ability_draft_description_9": "Lone Druid: nuova abilità: Intrappolamento.",
  "largo_gameplay_qol_ability_draft_description_10": "Slark: Furto d'essenza è stata sostituita con Lama salmastra.",
  "largo_gameplay_qol_ability_draft_description_11": "Medusa: nuova abilità: Presa della Gorgone."
}