// 2357.js

{
  "language": "romanian",
  "largo_hero_name": "Largo",
  "largo_website_title": "Largo – Noul erou din Dota 2",
  "largo_website_subtitle": "Largo + Actualizarea 7.40",
  "largo_website_summary": "Un erou nou, comoara de iarnă și actualizarea de joc 7.40",
  "largo_website_introduction": "Neamul exilat din Rădăcinile Mâloase a descoperit o insulă vie, Velu'Mar, atât de antică încât comunică doar prin cântec. Crescut printre barzii-șamani care au învățat să comunice cu insula, Largo cutreieră acum tărâmurile cu o gașcă de discipoli broscuțe în căutarea inspirației pentru noi cântece pe care să le cânte insulei sale. <br><br>Largo amplifică puterea aliaților săi pe câmpul de luptă, inspirându-i să invoce vrăji mai eficient și să cauzeze mai multe daune inamicilor. E ager și capabil să-și surprindă atât aliații, cât și inamicii, putând să modifice cursul unei lupte cu limba sa lipicioasă, iar broscuțele sale sunt mereu pregătite să calce totul în picioare. Atunci când se încinge o luptă serioasă, Largo se va remarca mândru cu repertoriul său de piese clasice din Rădăcinile Mâloase, cu ajutorul cărora va oferi echipei sale binecuvântări puternice pentru a schimba cursul luptei în favoarea sa.",
  "largo_archor_new_hero": "Erou nou",
  "largo_archor_new_treasure": "Comoara de iarnă",
  "largo_archor_new_gameplay": "Actualizarea de joc 7.40",
  "largo_comic_label": "Fii la curent cu povestea",
  "largo_comic_title": "Insula Care Vine",
  "largo_comic_description": "Cu generații în urmă, o catastrofă i-a determinat pe strămoșii lui Largo să-și ducă veacul pe Velu'Mar, insula vie. Dar acum insula a amuțit, iar datoria de a afla cauza acestei tăceri îi revine lui Largo.",
  "largo_herodetails_section_subheader": "Pentru statistici detaliate despre Largo",
  "largo_treasure_section_label": "Comoara de iarnă",
  "largo_treasure_section_title": "Collector's Cache",
  "largo_treasure_section_introduction": "Descoperă noul Collector's Cache din această iarnă, care include 16 seturi pentru o mulțime de eroi, inclusiv Tiny, Centaur Warrunner, Silencer și nu numai.",
  "largo_treasure_hero_shadow_fiend": "Shadow Fiend",
  "largo_treasure_hero_shadow_fiend_set": "Lord of the Sundered Souls",
  "largo_treasure_hero_primal_beast": "Primal Beast",
  "largo_treasure_hero_primal_beast_set": "Prehistoric Predator",
  "largo_treasure_hero_broodmother": "Broodmother",
  "largo_treasure_hero_broodmother_set": "The White Widow",
  "largo_treasure_hero_enigma": "Enigma",
  "largo_treasure_hero_enigma_set": "Angel of the Abyss",
  "largo_treasure_hero_ringmaster": "Ringmaster",
  "largo_treasure_hero_ringmaster_set": "Harrow's Harvest",
  "largo_treasure_hero_morphling": "Morphling",
  "largo_treasure_hero_morphling_set": "Fluid Frenzy",
  "largo_treasure_hero_silencer": "Silencer",
  "largo_treasure_hero_silencer_set": "Worship of the Whispered Wing",
  "largo_treasure_hero_centaur_warrunner": "Centaur Warrunner",
  "largo_treasure_hero_centaur_warrunner_set": "Cunning Counterfeit",
  "largo_treasure_hero_tiny": "Tiny",
  "largo_treasure_hero_tiny_set": "Stone Giant Stronghold",
  "largo_gameplay_subtitle": "Jurnalul actualizării",
  "largo_gameplay_title": "Actualizarea de joc 7.40",
  "largo_gameplay_description": "Descoperă câteva dintre modificările principale aduse eroilor, obiectelor neutre și chiar hărții. Apoi explorează în detaliu restul jurnalului de actualizare mai jos.",
  "largo_gameplay_heroes_title": "Principalele modificări aduse eroilor",
  "largo_gameplay_heroes_lone_druid_highlight_1": "Atât Sylla, cât și ursul său au învățat amândoi niște trucuri noi: Sylla poate înrădăcina inamici cu noua sa abilitate Entangle, iar prietenul său nou-nouț, Spirit Bear, are propriul său arbore nou de talente.",
  "largo_gameplay_heroes_slark_highlight_1": "Singurul evadat din închisoarea Reciful Întunecat e mai alunecos ca niciodată. Essence Shift este acum o abilitate nativă, iar noua sa abilitate Saltwater Shiv îi permite acestuia să fure viața și viteza de mișcare a inamicilor.",
  "largo_gameplay_heroes_treant_highlight_1": "Până și copacii își pierd răbdarea în cele din urmă. Abilitatea Leech Seed a fost refăcută pentru a fi mai amenințătoare, iar Overgrowth a primit o îmbunătățire copleșitoare. Astfel, Rooftrellen este furios și gata să-i înfrunte pe cei care-i amenință pădurile.",
  "largo_gameplay_neutral_items_title": "Obiecte neutre evidențiate",
  "largo_gameplay_neutral_items_description": "Am cutreierat în lung și-n lat bazarele și taberele din junglă pentru a găsi niște obiecte neutre nou-nouțe (și câteva obiecte vechi apreciate) pe care să le includem în joc.",
  "largo_gameplay_neutral_items_new": "Nou",
  "largo_gameplay_neutral_items_removed_title": "Principalele obiecte neutre eliminate",
  "largo_gameplay_neutral_items_removed_description": "Înainte de a te lăsa dus de val cu zarurile tale măsluite și prismele elegante, să facem o mică pauză pentru a aduce un omagiu câtorva obiecte neutre, care, din păcate, nu se mai află în joc.",
  "largo_gameplay_terrain_title": "Modificări aduse câmpului de luptă",
  "largo_gameplay_terrain_description": "Pe măsură ce ne gândeam la niște modificări pe care să le realizăm pentru mai multe locații de pe hartă cu scopul de a facilita deplasarea și experiența de joc, am considerat că ar fi un moment oportun să îmbunătățim mai multe aspecte vizuale de pe întreaga hartă. Poți utiliza glisorul de mai jos pentru a vedea câteva imagini comparative cu aceste modificări. Pentru a descoperi și restul modificărilor, aventurează-te în joc.",
  "largo_gameplay_terrain_comparison_widsom_radiant": "Altarul de înțelepciune Radiant",
  "largo_gameplay_terrain_comparison_widsom_dire": "Altarul de înțelepciune Dire",
  "largo_gameplay_terrain_comparison_gates_radiant": "Bariera de protecție Radiant",
  "largo_gameplay_terrain_comparison_gates_dire": "Bariera de protecție Dire",
  "largo_gameplay_terrain_comparison_bridge_radiant": "Podul Radiant",
  "largo_gameplay_terrain_comparison_bridge_dire": "Podul Dire",
  "largo_gameplay_qol_title": "Îmbunătățiri suplimentare",
  "largo_gameplay_qol_description": "Pe lângă toate informațiile pe care le-ai citit, fără îndoială, mai sus, mai avem câteva detalii de menționat înainte de a te avânta în joc.",
  "largo_gameplay_qol_demo_hero_title": "Modul demo pentru eroi permite multijucători",
  "largo_gameplay_qol_demo_hero_description": "Am luat decizia radicală de a modifica modul demo pentru eroi dintr-o experiență solitară pentru un singur jucător într-una distractivă pentru mai mulți jucători. Rezultatele fascinante ale cercetărilor științifice despre prietenie sugerează faptul că testarea mecanicilor de joc cu prietenii ar putea fi mai distractivă decât testarea pe cont propriu. Dar acestea sunt doar niște descoperiri preliminare. Folosește modul demo pentru eroi alături de niște prieteni ca să confirmi această teorie. Roshan și un oprimator te așteaptă, alături de o suită de modificări aduse meniului, care îți permit să creezi orice creep neutru, să controlezi timpul și să modifici o mulțime de alte setări globale.",
  "largo_gameplay_qol_general_title": "Generalități",
  "largo_gameplay_qol_buffs_description": "Nou pentru Dota Plus: a fost adăugată fila „Efecte” în sumarul de la finalul meciului. Jucătorii pot vedea numărul și durata efectelor pozitive și negative aplicate inamicilor și aliaților.",
  "largo_gameplay_qol_ability_tormentor_description": "Nou: a fost adăugat un temporizator pentru oprimator care comunică locația și durata rămasă până la apariție.",
  "largo_gameplay_qol_ability_draft_title": "Selecție abilități",
  "largo_gameplay_qol_ability_draft_description_1": "A fost remediată interacțiunea abilității Walrus Punch cu altele (de exemplu, cu Swashbuckle, Starbreaker etc.).",
  "largo_gameplay_qol_ability_draft_description_2": "A fost remediată problema în care Time Lock nu se declanșa cu Swashbuckle, Lil' Shredder și Falcon Toss.",
  "largo_gameplay_qol_ability_draft_description_3": "A fost remediat problema în care Fatal Bonds + Sinister Gaze (cu fațeta Evil Eye) cauzau daune infinite.",
  "largo_gameplay_qol_ability_draft_description_4": "Shadow Fiend: Necromastery a fost înlocuit cu Feast of Souls.",
  "largo_gameplay_qol_ability_draft_description_5": "Phantom Assassin: Blur a fost înlocuit cu Immaterial.",
  "largo_gameplay_qol_ability_draft_description_6": "Phantom Assassin: Coup de Grace acum acordă Blur.",
  "largo_gameplay_qol_ability_draft_description_7": "Spectre: Desolate a fost înlocuit cu Shadow Step.",
  "largo_gameplay_qol_ability_draft_description_8": "Spectre: Haunt acum acordă Reality.",
  "largo_gameplay_qol_ability_draft_description_9": "Lone Druid: are o abilitate nouă, Entangle.",
  "largo_gameplay_qol_ability_draft_description_10": "Slark: Essence Shift a fost înlocuit cu Saltwater Shiv.",
  "largo_gameplay_qol_ability_draft_description_11": "Medusa: are o abilitate nouă, Gorgon's Grasp."
}