// 6510.js

{
  "language": "greek",
  "largo_hero_name": "Largo",
  "largo_website_title": "Largo – Νέος ήρωας Dota 2",
  "largo_website_subtitle": "Ο LARGO ΚΑΙ Η ΕΝΗΜΕΡΩΣΗ 7.40",
  "largo_website_summary": "Νέος ήρωας, χειμερινός θησαυρός και η ενημέρωση παιχνιδιού 7.40",
  "largo_website_introduction": "Οι εξόριστοι Μαυροριζαίοι του Βελουμάρ ανακάλυψαν ένα ζωντανό νησί, τόσο αρχαίο που γνώριζε μονάχα μία γλώσσα, το τραγούδι. Αναθρεμμένος από τους σαμάνους βάρδους που έμαθαν να συνομιλούν με εκείνο, ο Largo περιφέρεται τώρα στα βασίλεια μαζί με έναν θίασο νεαρών μαθητευόμενων βατράχων, αναζητώντας έμπνευση για νέες μελωδίες που θα φέρει πίσω στο σπίτι.<br><br>Ο Largo ενισχύει τους συμμάχους του στο πεδίο της μάχης, εμπνέοντάς τους να εκτελούν αποτελεσματικότερα μαγεία και να προκαλούν μεγαλύτερη ζημιά στους εχθρούς του. Πιάνει γρήγορα τόσο φίλους όσο και εχθρούς, ελέγχοντας τη ροή μιας αψιμαχίας με την κολλώδη γλώσσα του. Τα βατράχια του είναι πάντα πρόθυμα να ποδοβολήσουν γύρω του. Όταν μια μάχη φουντώσει για τα καλά, ο Largo μπαίνει με χαρά στο προσκήνιο και παίζει τις επιτυχίες του, μια λίστα κλασικών κομματιών που δίνουν στην ομάδα του ισχυρές ευλογίες, για να αλλάξει καθοριστικά τον τόνο και τον ρυθμό μιας μάχης προς όφελός τους.",
  "largo_archor_new_hero": "ΝΕΟΣ ΗΡΩΑΣ",
  "largo_archor_new_treasure": "ΧΕΙΜΕΡΙΝΟΣ ΘΗΣΑΥΡΟΣ",
  "largo_archor_new_gameplay": "ΕΝΗΜΕΡΩΣΗ ΠΑΙΧΝΙΔΙΟΥ 7.40",
  "largo_comic_label": "Η ΙΣΤΟΡΙΑ ΜΕΧΡΙ ΤΩΡΑ",
  "largo_comic_title": "Το νησί που έρχεται",
  "largo_comic_description": "Αιώνες πριν, μια καταστροφή ανάγκασε τους προγόνους του Largo να βρουν καταφύγιο στο ζωντανό νησί Βελουμάρ. Τώρα, όμως, το νησί έχει βυθιστεί στη σιωπή και μόνο ο Largo μπορεί να ανακαλύψει το γιατί.",
  "largo_herodetails_section_subheader": "ΓΙΑ ΛΕΠΤΟΜΕΡΗ ΣΤΑΤΙΣΤΙΚΑ ΣΧΕΤΙΚΑ ΜΕ ΤΟΝ LARGO",
  "largo_treasure_section_label": "ΧΕΙΜΕΡΙΝΟΣ ΘΗΣΑΥΡΟΣ",
  "largo_treasure_section_title": "Collector's Cache",
  "largo_treasure_section_introduction": "Ανακαλύψτε ένα νέο Winter Cache, που διαθέτει 16 σετ από διάφορους ήρωες, συμπεριλαμβανομένων των Tiny, Centaur Warrunner, Silencer και άλλων.",
  "largo_treasure_hero_shadow_fiend": "Shadow Fiend",
  "largo_treasure_hero_shadow_fiend_set": "Lord of the Sundered Souls",
  "largo_treasure_hero_primal_beast": "Primal Beast",
  "largo_treasure_hero_primal_beast_set": "Prehistoric Predator",
  "largo_treasure_hero_broodmother": "ΜΑΥΡΗ ΑΡΑΧΝΗ",
  "largo_treasure_hero_broodmother_set": "The White Widow",
  "largo_treasure_hero_enigma": "Enigma",
  "largo_treasure_hero_enigma_set": "Angel of the Abyss",
  "largo_treasure_hero_ringmaster": "#|m|#Ringmaster",
  "largo_treasure_hero_ringmaster_set": "Harrow's Harvest",
  "largo_treasure_hero_morphling": "Morphling",
  "largo_treasure_hero_morphling_set": "Fluid Frenzy",
  "largo_treasure_hero_silencer": "Silencer",
  "largo_treasure_hero_silencer_set": "Worship of the Whispered Wing",
  "largo_treasure_hero_centaur_warrunner": "ΚΕΝΤΑΥΡΟΣ",
  "largo_treasure_hero_centaur_warrunner_set": "Cunning Counterfeit",
  "largo_treasure_hero_tiny": "Tiny",
  "largo_treasure_hero_tiny_set": "Stone Giant Stronghold",
  "largo_gameplay_subtitle": "ΣΗΜΕΙΩΣΕΙΣ ΕΝΗΜΕΡΩΣΗΣ",
  "largo_gameplay_title": "ΕΝΗΜΕΡΩΣΗ ΠΑΙΧΝΙΔΙΟΥ 7.40",
  "largo_gameplay_description": "Ρίξτε μια ματιά σε μερικές σημαντικές αλλαγές που αφορούν τους ήρωες, τα ουδέτερα αντικείμενα, όπως επίσης και τον χάρτη. Στη συνέχεια, δείτε πιο αναλυτικά όλα τα υπόλοιπα, στις σημειώσεις ενημέρωσης παρακάτω.",
  "largo_gameplay_heroes_title": "ΕΠΙΛΕΓΜΕΝΟΙ ΕΠΑΝΑΣΧΕΔΙΑΣΜΟΙ ΗΡΩΩΝ",
  "largo_gameplay_heroes_lone_druid_highlight_1": "Ο Sylla και η αρκούδα του έμαθαν και οι δύο μερικά νέα κόλπα: Ο Sylla μπορεί να ακινητοποιήσει εχθρούς με τη νέα ικανότητα Entangle και η ολοκαίνουρια αρκούδα του έχει ένα ολόδικό της δέντρο ταλέντων.",
  "largo_gameplay_heroes_slark_highlight_1": "Ο μόνος δραπέτης από τη φυλακή του Σκοτεινού Υφάλου ξεγλιστρά πιο εύκολα από ποτέ, με το Essence Shift που είναι πλέον εγγενής ικανότητα, καθώς και με τη νέα ικανότητα Saltwater Shiv που του επιτρέπει να κλέβει την αναπλήρωση ζωής και την ταχύτητα κίνησης των εχθρών.",
  "largo_gameplay_heroes_treant_highlight_1": "Ακόμα και η υπομονή των δέντρων εξαντλείται κάποια στιγμή. Με έναν ακόμα πιο απειλητικό ανασχεδιασμό του Leech Seed και μια ισχυρή αναβάθμιση του Overgrowth, ο Rooftrellen είναι θυμωμένος και έτοιμος να τα βάλει προσωπικά με τους εχθρούς που απειλούν τα δάση του.",
  "largo_gameplay_neutral_items_title": "ΕΠΙΛΕΓΜΕΝΑ ΟΥΔΕΤΕΡΑ ΑΝΤΙΚΕΙΜΕΝΑ",
  "largo_gameplay_neutral_items_description": "Ψάξαμε απ' άκρη σ' άκρη κάθε ράφι μαγαζιού και κάθε καταυλισμό ζούγκλας, για να βρούμε μερικά ολοκαίνουρια ουδέτερα αντικείμενα (και μερικά παλιά αγαπημένα) και να τα ρίξουμε στο παιχνίδι.",
  "largo_gameplay_neutral_items_new": "ΝΕΟ",
  "largo_gameplay_neutral_items_removed_title": "ΕΠΙΛΕΓΜΕΝΕΣ ΑΦΑΙΡΕΣΕΙΣ ΟΥΔΕΤΕΡΩΝ ΑΝΤΙΚΕΙΜΕΝΩΝ",
  "largo_gameplay_neutral_items_removed_description": "Πριν πάρετε πολλή φόρα με το κομπιναδόρικο ζάρι και τα φανταχτερά πρίσματα σας, ας δούμε μια στιγμή μερικά από τα άτυχα ουδέτερα αντικείμενα που έμειναν εκτός δράσης.",
  "largo_gameplay_terrain_title": "ΑΛΛΑΓΕΣ ΠΕΔΙΟΥ ΜΑΧΗΣ",
  "largo_gameplay_terrain_description": "Καθώς εξετάζαμε ορισμένες προσαρμογές σε διάφορες τοποθεσίες του χάρτη, για λόγους που αφορούσαν τα μονοπάτια και τον τρόπο παιχνιδιού, σκεφτήκαμε ότι θα ήταν επίσης μια καλή στιγμή να βελτιώσουμε πολλά οπτικά στοιχεία σε ολόκληρο τον χάρτη. Μπορείτε να χρησιμοποιήσετε το εύκολο ρυθμιστικό παρακάτω, που αναδεικνύει ορισμένες από αυτές τις αλλαγές. Για να ανακαλύψετε όλα τα υπόλοιπα, απλώς μπείτε το παιχνίδι.",
  "largo_gameplay_terrain_comparison_widsom_radiant": "ΒΩΜΟΣ WISDOM RADIANT",
  "largo_gameplay_terrain_comparison_widsom_dire": "ΒΩΜΟΣ WISDOM DIRE",
  "largo_gameplay_terrain_comparison_gates_radiant": "ΠΥΛΕΣ ΥΠΕΡΑΣΠΙΣΤΗ RADIANT",
  "largo_gameplay_terrain_comparison_gates_dire": "ΠΥΛΕΣ ΥΠΕΡΑΣΠΙΣΤΗ DIRE",
  "largo_gameplay_terrain_comparison_bridge_radiant": "ΓΕΦΥΡΑ RADIANT",
  "largo_gameplay_terrain_comparison_bridge_dire": "ΓΕΦΥΡΑ DIRE",
  "largo_gameplay_qol_title": "ΕΠΙΠΛΕΟΝ ΒΕΛΤΙΩΣΕΙΣ",
  "largo_gameplay_qol_description": "Πέρα από όλα όσα αναμφίβολα διαβάσατε παραπάνω, έχουμε μερικά ακόμα πράγματα που πρέπει να αναφέρουμε πριν φύγετε.",
  "largo_gameplay_qol_demo_hero_title": "ΛΕΙΤΟΥΡΓΙΑ ΔΟΚΙΜΗΣ ΗΡΩΑ ΠΟΛΛΩΝ ΠΑΙΚΤΩΝ",
  "largo_gameplay_qol_demo_hero_description": "Κάναμε το ριζικό βήμα να αλλάξουμε τη λειτουργία δοκιμής ήρωα, μεταμορφώνοντάς την από μοναχική γωνιά για έναν σε πάρτι πολλών παικτών. Οι συναρπαστικές ανακαλύψεις στην επιστήμη της φιλίας δείχνουν ότι το να δοκιμάζεις τις μηχανικές του παιχνιδιού με φίλους μπορεί να είναι πιο διασκεδαστικό απ' ό,τι να το κάνεις μόνος. Αλλά αυτά είναι μόνο προκαταρκτικά ευρήματα. Μεταβείτε στη λειτουργία δοκιμής ήρωα με μερικούς φίλους, για να το επιβεβαιώσετε και εσείς. Θα βρείτε τον Roshan και ένα Tormentor να σας περιμένουν, μαζί με μια σειρά από αλλαγές στο μενού, που σας επιτρέπουν να δημιουργείτε οποιαδήποτε ουδέτερη μονάδα, να ελέγχετε τον χρόνο και να τροποποιείτε διάφορες άλλες γενικές ρυθμίσεις.",
  "largo_gameplay_qol_general_title": "ΓΕΝΙΚΑ",
  "largo_gameplay_qol_buffs_description": "Νέο για Dota Plus: Προστέθηκε η καρτέλα «Επαυξήσεις» στο τέλος του παιχνιδιού. Οι παίκτες μπορούν να δουν τον αριθμό και τη διάρκεια των επαυξήσεων και των απομειώσεων, τόσο σε εχθρούς όσο και σε συμμάχους.",
  "largo_gameplay_qol_ability_tormentor_description": "Νέο: Προστέθηκε ένα Χρονόμετρο Tormentor για να γνωστοποιείται η τοποθεσία και ο χρόνος αναβίωσής του.",
  "largo_gameplay_qol_ability_draft_title": "Ability Draft",
  "largo_gameplay_qol_ability_draft_description_1": "Διορθώθηκε η αλληλεπίδραση του Walrus Punch με διάφορες ικανότητες (όπως Swashbuckle, Starbreaker κτλ.).",
  "largo_gameplay_qol_ability_draft_description_2": "Διορθώθηκε πρόβλημα όπου το Time Lock δεν ενεργοποιούνταν με τις ικανότητες Swashbuckle, Lil' Shredder και Falcon Toss.",
  "largo_gameplay_qol_ability_draft_description_3": "Διορθώθηκε πρόβλημα όπου ο συνδυασμός των ικανοτήτων Fatal Bonds και Sinister Gaze (όψη Evil Eye) προκαλούσε άπειρη ζημιά.",
  "largo_gameplay_qol_ability_draft_description_4": "Shadow Fiend: Το Necromastery αντικαταστάθηκε με το Feast of Souls.",
  "largo_gameplay_qol_ability_draft_description_5": "Phantom Assassin: Το Blur αντικαταστάθηκε με το Immaterial.",
  "largo_gameplay_qol_ability_draft_description_6": "Phantom Assassin: Το Coup de Grace παρέχει τώρα το Blur.",
  "largo_gameplay_qol_ability_draft_description_7": "Spectre: Το Desolate αντικαταστάθηκε με το Shadow Step.",
  "largo_gameplay_qol_ability_draft_description_8": "Spectre: Το Haunt παρέχει τώρα το Reality.",
  "largo_gameplay_qol_ability_draft_description_9": "Lone Druid: Νέα ικανότητα – Entangle.",
  "largo_gameplay_qol_ability_draft_description_10": "Slark: Το Essence Shift αντικαταστάθηκε με το Saltwater Shiv.",
  "largo_gameplay_qol_ability_draft_description_11": "Medusa: Νέα ικανότητα – Gorgon's Grasp."
}