// 1419.js

{
  "language": "polish",
  "largo_hero_name": "Largo",
  "largo_website_title": "Largo – nowy bohater Dota 2",
  "largo_website_subtitle": "Aktualizacja 7.40 + Largo",
  "largo_website_summary": "Nowy bohater, Zimowy Skarb i aktualizacja rozgrywki 7.40",
  "largo_website_introduction": "Wygnani Mrokorzeniacy z Velu'Mar odkryli żywą wyspę tak pradawną, że jedyną formą komunikacji z nią jest śpiew. Jako wychowanek szamańskich bardów, którzy nauczyli się z nią porozumiewać, Largo przemierza teraz krainy wraz z trupą żabich uczniów w poszukiwaniu natchnienia do nowych melodii, które mógłby przywieźć ze sobą z powrotem do domu.<br><br>Largo wzmacnia swoich sojuszników na polu bitwy, dając im natchnienie do skutecznego rzucania czarów i wyrządzania większych szkód jego wrogom. Szybko łapie zarówno sojuszników, jak i wrogów, kontrolując przepływ potyczki swoim lepkim językiem, a jego żabki zawsze rwą się do tupania pod nogami. Gdy bitwa rozkręci się z przytupem, Largo z przyjemnością wkracza w blask jupitera i gra przeboje, brzdąkając utwory ze swojego klasycznego repertuaru, przez co jego drużyna zyskuje mocne błogosławieństwa do stanowczego pokierowania tonem i rytmem walki na swoją korzyść.",
  "largo_archor_new_hero": "Nowy bohater",
  "largo_archor_new_treasure": "Zimowy Skarb",
  "largo_archor_new_gameplay": "Aktualizacja rozgrywki 7.40",
  "largo_comic_label": "Zapoznaj się z historią",
  "largo_comic_title": "Wyspa, która przychodzi",
  "largo_comic_description": "Pokolenia temu katastrofa wygnała przodków Largo na żyjącą wyspę Velu'Mar. Jednak teraz wyspa zamilkła i to Largo musi dowiedzieć się, dlaczego tak się stało.",
  "largo_herodetails_section_subheader": "Aby zobaczyć szczegółowe statystyki Largo",
  "largo_treasure_section_label": "Zimowy Skarb",
  "largo_treasure_section_title": "Skrytka Kolekcjonera",
  "largo_treasure_section_introduction": "Wgryźcie się w nową, odpicowaną Zimową Skrytkę zawierającą 16 zestawów dla bohaterów, w tym Tiny'ego, Centaura Warrunnera, Silencera i wielu innych.",
  "largo_treasure_hero_shadow_fiend": "Shadow Fiend",
  "largo_treasure_hero_shadow_fiend_set": "Pan Rozerwanych Dusz",
  "largo_treasure_hero_primal_beast": "Primal Beast",
  "largo_treasure_hero_primal_beast_set": "Prehistoryczny Drapieżnik",
  "largo_treasure_hero_broodmother": "Broodmother",
  "largo_treasure_hero_broodmother_set": "Biała Wdowa",
  "largo_treasure_hero_enigma": "Enigma",
  "largo_treasure_hero_enigma_set": "Anioł Otchłani",
  "largo_treasure_hero_ringmaster": "Ringmaster",
  "largo_treasure_hero_ringmaster_set": "Urodzaj Udręki",
  "largo_treasure_hero_morphling": "Morphling",
  "largo_treasure_hero_morphling_set": "Płynny Obłęd",
  "largo_treasure_hero_silencer": "Silencer",
  "largo_treasure_hero_silencer_set": "Sekta Szeptanego Skrzydła",
  "largo_treasure_hero_centaur_warrunner": "Centaur Warrunner",
  "largo_treasure_hero_centaur_warrunner_set": "Przebiegła Podróbka",
  "largo_treasure_hero_tiny": "Tiny",
  "largo_treasure_hero_tiny_set": "Twierdza Kamiennego Giganta",
  "largo_gameplay_subtitle": "Lista zmian aktualizacji",
  "largo_gameplay_title": "Aktualizacja rozgrywki 7.40",
  "largo_gameplay_description": "Sprawdźcie kilka wyróżnionych zmian w bohaterach, przedmiotach neutralnych, a nawet w samej mapie. Czytajcie dalej, by poznać całą resztę w liście na dole.",
  "largo_gameplay_heroes_title": "Wyróżnione przeróbki bohaterów",
  "largo_gameplay_heroes_lone_druid_highlight_1": "Sylla i jego niedźwiedź nauczyli się paru nowych sztuczek: Sylla może ukorzenić wrogów swoją nową umiejętnością (Entangle), a jego całkowicie nowy duchowy niedźwiedź ma swoje własne całkowicie nowe drzewko talentów.",
  "largo_gameplay_heroes_slark_highlight_1": "Jedyny uciekinier z więzienia Mrocznej Rafy jest teraz jeszcze bardziej śliski niż kiedykolwiek, ponieważ Essence Shift jest teraz umiejętnością wrodzoną, a nowa umiejętność (Saltwater Shiv) pozwala mu kraść od wrogów regenerację zdrowia i szybkość ruchu.",
  "largo_gameplay_heroes_treant_highlight_1": "Nawet drzewom kiedyś kończy się cierpliwość. Dzięki znacznie groźniejszemu przerobieniu um. Leech Seed i mocarnemu ulepszeniu Overgrowth, Rooftrellen nabrał bojowego animuszu i szuka okazji do bliskiego starcia z wrogami czyhającymi na jego lasy.",
  "largo_gameplay_neutral_items_title": "Wyróżnione przedmioty neutralne",
  "largo_gameplay_neutral_items_description": "Przetrzepaliśmy każdą półkę w sklepie i każdy obóz w dżungli, by znaleźć kilka całkowicie nowych przedmiotów neutralnych (i paru starych ulubieńców) i dorzuciliśmy je do puli.",
  "largo_gameplay_neutral_items_new": "Nowe",
  "largo_gameplay_neutral_items_removed_title": "Wyróżnione usunięte przedmioty neutralne",
  "largo_gameplay_neutral_items_removed_description": "Jednak zanim was trochę poniesie z waszymi kośćmi do kantowania i fikuśnymi pryzmatami, poświęćmy chwilę na wspomnienie paru niefortunnych neutralnych, które nie są już razem z nami.",
  "largo_gameplay_terrain_title": "Zmiany w terenie",
  "largo_gameplay_terrain_description": "Gdy rozważaliśmy niektóre poprawki w różnych miejscach mapy pod kątem wytyczania ścieżek i rozgrywki, wpadliśmy na pomysł, że teraz byłby też dobry moment na dopieszczenie tony wizualnych aspektów w obrębie całej mapy. Poniżej znajdziecie poręczny suwak wyróżniający niektóre zmiany. Aby zobaczyć całą resztę, po prostu wskoczcie do gry.",
  "largo_gameplay_terrain_comparison_widsom_radiant": "Ołtarz mądrości Świetlistych",
  "largo_gameplay_terrain_comparison_widsom_dire": "Ołtarz mądrości Mrocznych",
  "largo_gameplay_terrain_comparison_gates_radiant": "Bramy obrońcy Świetlistych",
  "largo_gameplay_terrain_comparison_gates_dire": "Bramy obrońcy Mrocznych",
  "largo_gameplay_terrain_comparison_bridge_radiant": "Most Świetlistych",
  "largo_gameplay_terrain_comparison_bridge_dire": "Most Mrocznych",
  "largo_gameplay_qol_title": "Dodatkowe ulepszenia",
  "largo_gameplay_qol_description": "Oprócz wszystkich tych rzeczy powyżej, które niewątpliwie przeczytaliście, mamy do omówienia jeszcze kilka innych, zanim puścimy was do gry.",
  "largo_gameplay_qol_demo_hero_title": "Wieloosobowy tryb testowania bohatera",
  "largo_gameplay_qol_demo_hero_description": "Podjęliśmy radykalny krok przemiany trybu testowania bohatera z osamotnionego zakątka dla jednego gracza na kanciapę do wieloosobowej zabawy. Fascynujące przełomy w naukach o przyjaźni sugerują, że wspólne testowanie mechanik gry ze znajomymi może dawać więcej frajdy, niż robienie tego samemu. Ale są to tylko wstępne odkrycia. Wskoczcie do trybu testowania bohatera z paroma znajomymi, by przekonać się o tym na własnym ekranie. Czekają na was Roshan, dręczyciel i nieco zmian w menu, które pozwalają wam przywołać dowolnego stwora neutralnego, kontrolować czas oraz modyfikować różne inne ustawienia globalne.",
  "largo_gameplay_qol_general_title": "Zmiany ogólne",
  "largo_gameplay_qol_buffs_description": "Nowość dla Dota Plus: dodaliśmy zakładkę z premiami do ekranu po grze. Gracze mogą od teraz zobaczyć czas trwania pozytywnych i negatywnych efektów na wrogach i sojusznikach.",
  "largo_gameplay_qol_ability_tormentor_description": "Nowość: dodaliśmy zegar dla dręczyciela, by przekazać informacje o jego lokalizacji i czasie odrodzenia.",
  "largo_gameplay_qol_ability_draft_title": "Tryb Ability Draft",
  "largo_gameplay_qol_ability_draft_description_1": "Poprawiono interakcję z um. Walrus Punch (Swashbuckle, Starbreaker itd.).",
  "largo_gameplay_qol_ability_draft_description_2": "Naprawiono błąd uniemożliwiający aktywację um. Time Lock z um. Swashbuckle, Lil' Shredder i Falcon Rush.",
  "largo_gameplay_qol_ability_draft_description_3": "Naprawiono błąd powodujący, że kombinacja um. Fatal Bonds i Sinister Gaze (z aspektem Złe Oko) skutkowała nieskończonymi obrażeniami.",
  "largo_gameplay_qol_ability_draft_description_4": "Shadow Fiend: zamieniono um. Necromastery na Feast of Souls.",
  "largo_gameplay_qol_ability_draft_description_5": "Phantom Assassin: zamieniono um. Blur na Immaterial.",
  "largo_gameplay_qol_ability_draft_description_6": "Phantom Assassin: od teraz um. Coup de Grace przyznaje efekt z Blur.",
  "largo_gameplay_qol_ability_draft_description_7": "Spectre: zamieniono um. Desolate na Shadow Step.",
  "largo_gameplay_qol_ability_draft_description_8": "Spectre: od teraz um. Haunt przyznaje efekt z Reality.",
  "largo_gameplay_qol_ability_draft_description_9": "Lone Druid: dodano nową umiejętność – Entangle.",
  "largo_gameplay_qol_ability_draft_description_10": "Slark: zamieniono um. Essence Shift na Saltwater Shiv.",
  "largo_gameplay_qol_ability_draft_description_11": "Medusa: dodano nową umiejętność: Gorgon's Grasp."
}