// 2484.js

{
  "language": "ukrainian",
  "largo_hero_name": "Ларґо",
  "largo_website_title": "Новий герой Dota 2: Ларґо",
  "largo_website_subtitle": "Ларґо + оновлення 7.40",
  "largo_website_summary": "Новий герой, зимова скарбниця, ігроладне оновлення 7.40",
  "largo_website_introduction": "Вигнанці із Хмурокорінного лісу знайшли Велу’мар — живий острів, настільки стародавній, що він розмовляє лише піснями. Вихований бардами-шаманами, які навчилися спілкуватися з Велу’маром, Ларґо зрештою вирушив у подорож королівствами з трупою учнів-жабенят, шукаючи натхнення для нових мелодій, які б він міг принести назад із собою і заспівати вдома.<br><br>Ларґо посилює своїх союзників, надихаючи їх на ефективніше чаклування та збільшуючи їхню шкоду ворогам. Він може швидко спіймати друга чи ворога, керуючи плином сутички завдяки своєму липкому язику, а його жабенята завжди раді кинутися під ноги й почати тупотіти. У розпалі битви Ларґо з радістю опиниться в центрі уваги й зіграє одну зі своїх класичних пісень-хітів, наділяючи своїх союзників потужними перевагами для зміни тону й темпу бою на свій лад.",
  "largo_archor_new_hero": "Новий герой",
  "largo_archor_new_treasure": "Зимова скарбниця",
  "largo_archor_new_gameplay": "Ігроладне оновлення 7.40",
  "largo_comic_label": "Довідайтеся передісторію",
  "largo_comic_title": "Посталий острів",
  "largo_comic_description": "Багато поколінь тому катастрофа вигнала пращурів Ларґо на живий острів Велу’мар. Одначе нині острів мовчить, і саме Ларґо повинен з’ясувати причину.",
  "largo_herodetails_section_subheader": "Щоби дізнатися більше про Ларґо:",
  "largo_treasure_section_label": "Зимова скарбниця",
  "largo_treasure_section_title": "Схованка колекціонера",
  "largo_treasure_section_introduction": "Відчуйте зимову свіжість у цій сезонній схованці колекціонера, що містить 16 нових наборів героїв, зокрема для Малюка, Кентавра-Воєводи, Знемовлювача та інших.",
  "largo_treasure_hero_shadow_fiend": "Тінистий Нелюд",
  "largo_treasure_hero_shadow_fiend_set": "Повелитель розділених душ",
  "largo_treasure_hero_primal_beast": "Первісний Звір",
  "largo_treasure_hero_primal_beast_set": "Хтонічний хижак",
  "largo_treasure_hero_broodmother": "Павучиха",
  "largo_treasure_hero_broodmother_set": "Біла вдова",
  "largo_treasure_hero_enigma": "Еніґма",
  "largo_treasure_hero_enigma_set": "Первозданний посланець",
  "largo_treasure_hero_ringmaster": "Циркмейстер",
  "largo_treasure_hero_ringmaster_set": "Жнива життів",
  "largo_treasure_hero_morphling": "Морфник",
  "largo_treasure_hero_morphling_set": "Плинне пересердя",
  "largo_treasure_hero_silencer": "Знемовлювач",
  "largo_treasure_hero_silencer_set": "Культ мовчазного крила",
  "largo_treasure_hero_centaur_warrunner": "Кентавр-Воєвода",
  "largo_treasure_hero_centaur_warrunner_set": "Файна фальшивка",
  "largo_treasure_hero_tiny": "Малюк",
  "largo_treasure_hero_tiny_set": "Твердиня кам’яного титана",
  "largo_gameplay_subtitle": "Нотатки про",
  "largo_gameplay_title": "Ігроладне оновлення 7.40",
  "largo_gameplay_description": "Ознайомтеся з головними змінами, що торкнулися героїв, нейтральних предметів і навіть мапи. Потім зануртеся ще глибше й перегляньте все інше в списку змін, який наведено нижче.",
  "largo_gameplay_heroes_title": "Перероблені герої",
  "largo_gameplay_heroes_lone_druid_highlight_1": "Силла та його ведмідь навчилися деяких нових трюків: тепер Силла може вкорінювати ворогів за допомогою нової здібності — Entangle (Обплітання), — а його новісінький ведмідь-дух має абсолютно незалежне дерево талантів.",
  "largo_gameplay_heroes_slark_highlight_1": "Єдиний втікач із в’язниці Темного Рифу став ще більш невловимим, ніж будь-коли: Essence Shift (Перетворення субстанцій) тепер є вродженою здібністю, а нова здібність — Saltwater Shiv (Солонуватий тесак) — дозволяє Сларку вкрасти регенерацію здоров’я та швидкість руху ворога.",
  "largo_gameplay_heroes_treant_highlight_1": "Терпіння не вічне навіть у дерев. Після переробки здібність Leech Seed (Насінина-кровопивця) стала ще загрозливішою, а Overgrowth (Зарості) тепер додає сердитому Руфтреллену ще більше сил, і йому вже не терпиться зустрітися з ворогами, що загрожують його лісам.",
  "largo_gameplay_neutral_items_title": "Перероблені нейтральні предмети",
  "largo_gameplay_neutral_items_description": "Ми передивилися всі полиці всіх крамниць і всі лісові табори в пошуках абсолютно нових нейтральних предметів, а також деяких старих й улюблених.",
  "largo_gameplay_neutral_items_new": "Нове",
  "largo_gameplay_neutral_items_removed_title": "Вилучені нейтральні предмети",
  "largo_gameplay_neutral_items_removed_description": "Перш ніж ви встигнете захопитися шахрайськими кубиками та чудернацькими призмами, спочатку віддамо данину кільком нещасним предметам, які зникнуть із гри.",
  "largo_gameplay_terrain_title": "Зміни ландшафту",
  "largo_gameplay_terrain_description": "Розмірковуючи над деякими змінами до різних місць на мапі з метою покращення зручності пересування й ігроладу, ми вирішили, що також варто вдосконалити чимало візуальних аспектів. Скористайтеся зручним повзунком нижче для перегляду деяких головних змін. Ну а в грі ви зможете дослідити решту.",
  "largo_gameplay_terrain_comparison_widsom_radiant": "Святилище мудрості Сяйва",
  "largo_gameplay_terrain_comparison_widsom_dire": "Святилище мудрості Пітьми",
  "largo_gameplay_terrain_comparison_gates_radiant": "Захисні брами Сяйва",
  "largo_gameplay_terrain_comparison_gates_dire": "Захисні брами Пітьми",
  "largo_gameplay_terrain_comparison_bridge_radiant": "Міст Сяйва",
  "largo_gameplay_terrain_comparison_bridge_dire": "Міст Пітьми",
  "largo_gameplay_qol_title": "Додаткові покращення",
  "largo_gameplay_qol_description": "Окрім усього вищенаведеного, що ви вже точно прочитали, є ще кілька речей, про які вам варто дізнатися.",
  "largo_gameplay_qol_demo_hero_title": "Спільний режим демонстрації героя",
  "largo_gameplay_qol_demo_hero_description": "Ми вжили радикальних заходів стосовно режиму демонстрації героя, перетворивши його із самітного закутку на місце розваг для кількох гравців. Неймовірні наукові відкриття у сфері дружби свідчать, що випробовувати ігрові механіки разом із друзями може бути набагато веселіше, ніж наодинці. Щоправда, це лише попередні результати, які ви можете власноруч перевірити в режимі демонстрації героя, запросивши туди своїх друзів: там на вас чекатимуть Рошан і Мучитель, а також купа змін до інтерфейсу, що дозволяють керувати часом, відродженням нейтральних кріпів і змінювати безліч інших глобальних налаштувань.",
  "largo_gameplay_qol_general_title": "Загальні",
  "largo_gameplay_qol_buffs_description": "Нове в Dota Plus: до післяматчевих підсумків додано вкладку «Ефекти», на якій можна побачити кількість і тривалість позитивних і негативних ефектів на ворогах і союзниках.",
  "largo_gameplay_qol_ability_tormentor_description": "Нове: додано таймер відродження мучителя, що показує місце й час його появи.",
  "largo_gameplay_qol_ability_draft_title": "Відбір здібностей"
}