// 6681.js

{
  "language": "czech",
  "largo_hero_name": "Largo",
  "largo_website_title": "Dota 2 – Nový hrdina Largo",
  "largo_website_subtitle": "Largo + aktualizace 7.40",
  "largo_website_summary": "Nový hrdina, sváteční truhla a herní aktualizace 7.40",
  "largo_website_introduction": "Když byli obyvatelé Zakalených lesů donuceni prchnout na širý oceán, objevili zde živoucí ostrov Velu’Mar tak starý, že s ním bylo možné komunikovat jenom prostřednictvím písní. Largo je vrchním písňotepcem, který tuto komunikaci zajišťuje, ale protože si ostrov žádá nové písně, Largo se společně se svými učedníky vydal hledat inspiraci do světa...<br><br>Zatímco je Largo přítomen na bojišti, posiluje své spojence, inspiruje k efektivnějšímu sesílání kouzel a navyšuje poškození nepřátel. Jakožto žabák má také vždy připravený svůj dlouhý lepkavý jazyk a jeho učedníci se nenechají dvakrát pobízet k roztančení pořádného dupáku. A jakmile se bitva doopravdy rozjede, Largo s radostí převezme roli frontmana a zabrnká své léty prověřené odrhovačky, které dodají jeho týmu nejen rytmus, ale také nadmíru užitečné bonusy.",
  "largo_archor_new_hero": "Nový hrdina",
  "largo_archor_new_treasure": "Sváteční truhla",
  "largo_archor_new_gameplay": "Herní aktualizace 7.40",
  "largo_comic_label": "Přečtěte si Largův příběh",
  "largo_comic_title": "Ostrov, který se zjevil",
  "largo_comic_description": "Před dávnými časy zahnala přírodní katastrofa Largovy předky na živoucí ostrov Velu’Mar. Nyní se však ostrov odmlčel a Largo musí zjistit proč.",
  "largo_herodetails_section_subheader": "Chcete se o Largovi dozvědět více?",
  "largo_treasure_section_label": "Sváteční truhla",
  "largo_treasure_section_title": "Collector's Cache",
  "largo_treasure_section_introduction": "Rozbalte truhlu ukrývající 16 parádních setů pro Tinyho, Centaur Warrunnera, Silencera a další.",
  "largo_treasure_hero_shadow_fiend": "Shadow Fiend",
  "largo_treasure_hero_shadow_fiend_set": "Lord of the Sundered Souls",
  "largo_treasure_hero_primal_beast": "Primal Beast",
  "largo_treasure_hero_primal_beast_set": "Prehistoric Predator",
  "largo_treasure_hero_broodmother": "Broodmother",
  "largo_treasure_hero_broodmother_set": "White Widow",
  "largo_treasure_hero_enigma": "Enigma",
  "largo_treasure_hero_enigma_set": "Angel of the Abyss",
  "largo_treasure_hero_ringmaster": "Ringmaster",
  "largo_treasure_hero_ringmaster_set": "Harrow's Harvest",
  "largo_treasure_hero_morphling": "Morphling",
  "largo_treasure_hero_morphling_set": "Fluid Frenzy",
  "largo_treasure_hero_silencer": "Silencer",
  "largo_treasure_hero_silencer_set": "Worship of the Whispered Wing",
  "largo_treasure_hero_centaur_warrunner": "Centaur Warrunner",
  "largo_treasure_hero_centaur_warrunner_set": "Cunning Counterfeit",
  "largo_treasure_hero_tiny": "Tiny",
  "largo_treasure_hero_tiny_set": "Stone Giant Stronghold",
  "largo_gameplay_subtitle": "Seznam změn",
  "largo_gameplay_title": "Herní aktualizace 7.40",
  "largo_gameplay_description": "Prohlédněte si několik vybraných změn hrdinů, neutrálních předmětů a herní mapy. A až se osmělíte, ponořte se do hlubin kompletního seznamu změn.",
  "largo_gameplay_heroes_title": "Přepracovaní hrdinové",
  "largo_gameplay_heroes_lone_druid_highlight_1": "Sylla a jeho medvědí společník se naučili hned několik nových triků. Sylla může například nechat nepřátele zakořenit pomocí schopnosti Entangle a z medvěda se stal téměř plnohodnotný hrdina s vlastním talentovým stromem.",
  "largo_gameplay_heroes_slark_highlight_1": "Třináctý z tuctu je nebezpečnější než kdy dříve, protože jeho schopnost Essence Shift je ode dneška vrozená a její místo zabrala nová schopnost Saltwater Shiv kradoucí nepřátelům regeneraci zdraví, obnovu zdraví a rychlost pohybu.",
  "largo_gameplay_heroes_treant_highlight_1": "Přepracovaná a hrozivější schopnost Leech Seed nebo silnější vylepšení schopnosti Overgrowth jsou jen dvě ukázky toho, že i stromům jednou dojde trpělivost a Rooftrellen je teď pořádně nazlobený na všechny, kdo ubližují lesům.",
  "largo_gameplay_neutral_items_title": "Nové neutrální předměty",
  "largo_gameplay_neutral_items_description": "Prohrabali jsme všechny truhlice a našli několik zbrusu nových (a pár staronových) artefaktů, které dále rozšíří Vaše buildy.",
  "largo_gameplay_neutral_items_new": "Novinka",
  "largo_gameplay_neutral_items_removed_title": "Odstraněné neutrální předměty",
  "largo_gameplay_neutral_items_removed_description": "Než si však začneme hrát s cinknutými kostkami a tajemnými krystaly, uctěme minutou ticha artefakty, s nimiž se už ve hře nesetkáte.",
  "largo_gameplay_terrain_title": "Změny mapy",
  "largo_gameplay_terrain_description": "Když jsme pracovali na úpravách mapy pro docílení plynulejšího pohybu a vybalancovanější hratelnosti, napadlo nás, že by možná stálo za to vybrousit také vizuální aspekty napříč mapou. Několik vybraných změn si můžete prohlédnout níže díky šikovnému posuvníku, ale něco budete muset objevit až při hraní.",
  "largo_gameplay_terrain_comparison_widsom_radiant": "Svatyně vědomostí (Radiant)",
  "largo_gameplay_terrain_comparison_widsom_dire": "Svatyně vědomostí (Dire)",
  "largo_gameplay_terrain_comparison_gates_radiant": "Zadní vrátka (Radiant)",
  "largo_gameplay_terrain_comparison_gates_dire": "Zadní vrátka (Dire)",
  "largo_gameplay_terrain_comparison_bridge_radiant": "Most (Radiant)",
  "largo_gameplay_terrain_comparison_bridge_dire": "Most (Dire)",
  "largo_gameplay_qol_title": "Dodatečná vylepšení",
  "largo_gameplay_qol_description": "Kromě toho všeho, co jste si nepochybně přečetli výše, pro Vás máme ještě pár dalších věcí.",
  "largo_gameplay_qol_demo_hero_title": "Zkoušení ve více lidech",
  "largo_gameplay_qol_demo_hero_description": "Nedávno publikované vědecké studie naznačují, že zkoušení hrdinů v Dotě by mohlo být zábavnější ve více lidech nežli o samotě, a proto jsme se rozhodli pro radikální krok a doposud sólovou záležitost proměnili v multiplayerovou party. Budeme však potřebovat, abyste nové testování pořádně otestovali, takže sežeňte přátele a hurá na speciální mapu, kde čeká Roshan, Tormentor a celá řada nových možností například pro přidání libovolného neutrálního creepa, změnu času a modifikaci dalších globálních nastavení.",
  "largo_gameplay_qol_general_title": "Obecné",
  "largo_gameplay_qol_buffs_description": "Pozápasové analýzy programu Dota Plus byly rozšířeny o záložku „Buffy“, kde si můžete prohlédnout všechny buffy a debuffy, které ovlivnily spojence a nepřátele",
  "largo_gameplay_qol_ability_tormentor_description": "Byl přidán ukazatel Tormentora, pomocí kterého lze informovat o pozici a stavu Tormentora",
  "largo_gameplay_qol_ability_draft_title": "Výběr schopností",
  "largo_gameplay_qol_ability_draft_description_1": "Byly opraveny interakce schopnosti Walrus PUNCH! (se schopností Swashbuckle, Starbreaker a dalšími)",
  "largo_gameplay_qol_ability_draft_description_2": "Byla opravena schopnost Time Lock, která nebyla spouštěna schopnostmi Swashbuckle, Lil' Shredder a Falcon Rush",
  "largo_gameplay_qol_ability_draft_description_3": "Bylo opraveno kombo schopností Fatal Bonds a Sinister Gaze (se specialitou Evil Eye), které udílelo nekonečně poškození",
  "largo_gameplay_qol_ability_draft_description_4": "Schopnost Necromastery byla nahrazena schopností Feast of Souls (Shadow Fiend)",
  "largo_gameplay_qol_ability_draft_description_5": "Schopnost Blur byla nahrazena schopností Immaterial (Phantom Assassin)",
  "largo_gameplay_qol_ability_draft_description_6": "Schopnost Coup de Grace nově poskytuje schopnost Blur (Phantom Assassin)",
  "largo_gameplay_qol_ability_draft_description_7": "Schopnost Desolate byla nahrazena schopností Shadow Step (Spectre)",
  "largo_gameplay_qol_ability_draft_description_8": "Schopnost Haunt nově poskytuje schopnost Reality (Spectre)",
  "largo_gameplay_qol_ability_draft_description_9": "Byla přidána nová schopnost Entangle (Lone Druid)",
  "largo_gameplay_qol_ability_draft_description_10": "Schopnost Essence Shift byla nahrazena schopností Saltwater Shiv (Slark)",
  "largo_gameplay_qol_ability_draft_description_11": "Byla přidána nová schopnost Gorgon's Grasp (Medusa)"
}