// 8326.js

{
  "language": "french",
  "muerta_title": "Mise à jour Dead Reckoning",
  "muerta_title_pre": "Mise à jour",
  "muerta_title_post": " ",
  "muerta_title_date": "Du 6 mars au 4 avril 2023",
  "muerta_play_trailer": "Voir la bande-annonce",
  "new_hero_tag": "Nouvelle héroïne",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Héroïne",
  "muerta_navigation_event": "Minijeu",
  "muerta_navigation_janitor": "Fonctionnalités",
  "muerta_navigation_gameplay": "Mise à jour du gameplay",
  "muerta_role1": "Carry",
  "muerta_role2": "À distance",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "As de la gâchette et des invocations spectrales, une arme de rechange à la hanche, Muerta a fauché tant de vies que le Faucheur lui-même a décidé de l'embaucher. Véritable machine à tuer, animée par un désir de vengeance aussi aveugle qu'implacable, Muerta fait parler ses deux fidèles calibres pour transporter les âmes de l'autre côté, de gré ou de force. Et, aux plus récalcitrantes, Muerta révèle sa vraie nature de spectre meurtrier, un cauchemar éveillé qui leur arrache d'autant plus vite un dernier soupir.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Capacité à ciblage vectoriel. Muerta tire un projectile spectral en direction d'une unité ennemie ou d'un arbre. Quand le projectile atteint sa cible, celle-ci subit des dégâts et est ralentie. Il rebondit ensuite dans la direction ciblée, infligeant des dégâts à toutes les unités ennemies traversées, jusqu'à ce qu'il touche une unité héroïque. Les unités héroïques touchées courent dans la direction du projectile.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Muerta invoque un groupe de fantômes qui encerclent lentement l'emplacement ciblé. Les unités ennemies dans la zone voient leurs vitesses de déplacement et d'attaque réduites. Les unités qui entrent en contact avec les fantômes subissent des dégâts et sont réduites au silence.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "À chaque attaque, Muerta a une chance de tirer sur une autre unité ennemie à portée choisie au hasard (unités héroïques en priorité).",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta se transforme et devient immunisée contre les dégâts physiques. Ses dégâts d'attaque augmentent et sont convertis en dégâts magiques. Pendant ce temps, elle peut aussi traverser les obstacles. Muerta peut attaquer les unités éthérées, mais n'inflige pas de dégâts aux unités immunisées contre les sorts.",
  "muerta_heroes_title": "Statistiques détaillées de Muerta",
  "muerta_heroes_btn": "Voir la page de l'héroïne",
  "muerta_wallpaper": "Fonds d'écran",
  "muerta_minigame_title_pre": "Minijeu",
  "muerta_minigame_title": " ",
  "muerta_minigame_subtitle": "LA MORT RÉCLAME SON DÛ…",
  "muerta_minigame_subtitle2": "Muerta a besoin de votre aide pour enterrer au bon endroit moult corps encore chauds… Avant chacune de vos parties, et tout au long de l'évènement Dead Reckoning, une cible vous sera assignée. Marquez des points en la tuant ou en coopérant à sa mort. Mais attention : votre adversaire aussi veut vous voir six pieds sous terre… Qui aura obtenu le plus de points en fin de partie verra sa récompense doublée !",
  "muerta_minigame_rules_title": "Fleurs",
  "muerta_minigame_rules_desc": "Tuez ou coopérez à la mort de votre cible pour gagner des points et recevoir les <b>fleurs</b> de Muerta. Marquez plus de points que votre cible pour obtenir encore davantage de fleurs.",
  "muerta_minigame_rules_title2": "Trésor",
  "muerta_minigame_rules_desc2": "Échangez vos fleurs contre des <b>coffres Dead Reckoning</b>. Ils contiennent de nouveaux ensembles exclusifs et aux couleurs de l'évènement.",
  "muerta_minigame_rules_title3": "Clés",
  "muerta_minigame_rules_desc3": "Achetez une <b>clé Dead Reckoning</b> pour déverrouiller le coffre et découvrir ce qu'il renferme. Les clés coutent %1$s, ou 20 000 fragments dans la boutique des fragments.",
  "muerta_treasure_title": "Coffre Dead Reckoning",
  "muerta_treasure_content_desc": "Faites le plein de fleurs pour obtenir encore plus d'ensembles d'items aux couleurs de l'évènement. Pour lancer les célébrations, Muerta a généreusement donné cinq clés à tout le monde. S'il vous en faut plus, utilisez vos fragments ou faites un tour dans le magasin Dota.",
  "muerta_minigame_treasure_name1": "Prédateur spectral",
  "muerta_minigame_treasure_name2": "Lueur funèbre",
  "muerta_minigame_treasure_name3": "Boule sacrificielle",
  "muerta_minigame_treasure_name4": "Chaleur mortelle",
  "muerta_minigame_treasure_name5": "Vipère létale",
  "muerta_minigame_treasure_name6": "Poupée de la mort",
  "muerta_minigame_treasure_name7": "Fusil subclaquant",
  "muerta_minigame_treasure_name8": "Âme du basilic",
  "janitors_corner_title": "Nouvelles fonctionnalités",
  "732e_patch_dotaplus_advancedstats_title": "Statistiques de bataille avancées",
  "732e_patch_dotaplus_advancedstats_subtitle": "Analysez en détail votre historique de parties",
  "732e_patch_dotaplus_advancedstats_desc": "Améliorez-vous (et analysez votre technique) grâce aux statistiques de bataille avancées, directement depuis votre profil. Les membres de Dota Plus ont désormais accès à des statistiques de jeu en temps réel entièrement repensées. Étudiez votre stratégie en revenant sur votre historique de parties et en le triant selon vos choix d'unité héroïque, de rôle, de mode de jeu et bien plus.",
  "732e_patch_dotaplus_advancedstats_desc2": "Vous souhaitez devenir un as des coups fatals ? Consultez les statistiques relatives aux creeps pour voir ce que vous pouvez améliorer. Vous préférez plutôt améliorer vos compétences de Support ? C'est parfait : la nouvelle section dédiée est maintenant bien plus éclairante que n'importe quelle Ward !",
  "732e_patch_quickkeys_title": "Utilisation rapide personnalisée",
  "732e_patch_quickkeys_subtitle": "À chaque usage son raccourci",
  "732e_patch_quickkeys_desc": "Si vous avez recours à l'utilisation rapide, vous pouvez maintenant indiquer quels objets et capacités d'unités doivent s'activer à l'appui ou au relâchement d'une touche. Pour ce faire, accédez aux raccourcis et sélectionnez les options « Raccourcis spécifiques aux unités » et « Activer l'utilisation rapide ».",
  "732e_patch_friendslist_title": "Améliorations apportées à la liste de contacts",
  "732e_patch_friendslist_subtitle": "Donnez une place de choix à vos contacts préférés",
  "732e_patch_friendslist_desc": "La nouvelle fonctionnalité de favoris vous permet maintenant d'épingler à votre liste de contacts les personnes avec lesquelles vous jouez le plus. Triez votre liste de contacts par contacts favoris, en jeu, en ligne ou hors ligne, ou utilisez la toute nouvelle option de recherche de contacts pour jouer avec la personne de votre choix.",
  "732e_patch_title": "Mise à jour du gameplay",
  "732e_patch_subtitle": "7.32E ET PLUS ENCORE",
  "732e_patch_turbo_title": "Modifications apportées au mode turbo",
  "732e_patch_turbo_intro": "Le mode turbo a le vent en poupe : cette mise à jour inclut donc des changements spéciaux en la matière ! D'autres modifications sont à venir afin de continuer à améliorer l'expérience de jeu dans ce mode.",
  "732e_patch_turbo_change_notes1": "Il n'est plus possible de voir les choix des autres personnes pendant la phase de sélection.",
  "732e_patch_turbo_change_notes2": "La phase de pénalité pendant la sélection a été supprimée. Maintenant, à la fin de la période de sélection, toute personne n'ayant pas fait son choix devra sélectionner l'unité héroïque prévisualisée. Si celle-ci n'est pas disponible ou si aucune unité n'a été prévisualisée, une unité héroïque choisie au hasard sera assignée.",
  "732e_patch_turbo_change_notes3": "Les bonus de Null Talisman, Wraith Band et Bracer sont maintenant doublés à partir de la 12ᵉ minute (et non plus à partir de la 25ᵉ minute).",
  "732e_patch_turbo_change_notes4": "Les unités invoquées n'infligent plus de dégâts bonus aux tours. Les unités non invoquées (creeps de lanes, creeps dominés…) restent plus fortes contre les tours en comparaison avec les parties normales.",
  "732e_patch_turbo_change_notes5": "Vous pouvez maintenant gagner jusqu'à deux étoiles pour les défis héroïques (au lieu d'une).",
  "732e_patch_turbo_change_notes6": "L'Arcane « Bladeform Legacy » de Juggernaut enregistre maintenant entièrement le nombre de victimes d'Omnislash.",
  "732e_patch_turbo_change_notes7": "L'Arcane « Chute de la planète » d'Earthshaker enregistre maintenant entièrement le nombre de victimes et de coopérations d'Echo Slam. Les records de combos et de dégâts de combos sont maintenant aussi pris en compte.",
  "732e_patch_turbo_change_notes8": "L'item immortel « Vestiges des arts obscurs » d'Invoker enregistre maintenant entièrement le nombre de victimes de Sun Strike.",
  "732e_patch_turbo_change_notes9": "L'item immortel « Chaudron de Xahryx du retour » de Lone Druid enregistre maintenant entièrement la durée d'enracinement d'Entangling Claws.",
  "732e_patch_turbo_change_notes10": "L'item immortel « Épée de la baleine léviathan du retour » de Kunkka enregistre maintenant entièrement le nombre de cibles héroïques de Torrent.",
  "732e_patch_turbo_change_notes11": "L'item immortel « Orchidée foudroyante du retour » de Storm Spirit enregistre maintenant entièrement les dégâts de Ball Lightning.",
  "732e_patch_turbo_change_notes12": "L'item immortel « Charme du retour du roi Fin » de Lion enregistre maintenant entièrement la durée de transformation de Hex.",
  "732e_patch_turbo_change_notes13": "L'item immortel « Bâton tourmenté du retour » de Leshrac enregistre maintenant entièrement la durée d'étourdissement de Split Earth.",
  "732e_patch_turbo_change_notes14": "L'Arcane « Lames de Voth Domosh » de Legion Commander enregistre maintenant entièrement le nombre de victoires lors de duels.",
  "732e_patch_turbo_change_notes15": "La progression des items arcanes a été modifiée pour les cas suivants :",
  "732e_bug_fixes_title": "Corrections de bugs",
  "732e_bug_fixes_notes1": "Correction du problème suivant : les détails des parties n'étaient pas correctement associés aux enregistrements sauvegardés ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]problème 349[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes2": "Correction du problème suivant : parfois, les modèles, matériaux et autres composantes des unités héroïques étaient invisibles, et il fallait se reconnecter pour les voir correctement ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]problème 6070[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes3": "Correction du problème suivant : parfois, le temps de recharge de Refresher Orb ne se déclenchait pas après avoir utilisé Refresher Shard ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]problème 6668[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes4": "Correction du problème suivant : quand la portée d'incantation était trop grande, il n'était pas possible de lancer Tree Dance de Monkey King. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]problème 717[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes5": "Correction du problème suivant : quand Infest de Lifestealer était lancée à certaines portées, Lifestealer manquait sa première attaque ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]problème 6801[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes6": "Les attaques de Jinada et de Gemina peuvent maintenant se déclencher quand l'unité incantatrice est interrompue, mais non pas quand elle est réduite au silence. Ce comportement concorde maintenant avec celui des autres capacités de même type ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]problème 6779[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes7": "Correction du problème suivant : les effets de particules de Snowball de Tusk ne disparaissaient pas si l'incantation de Snowball échouait ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problème 6805[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes8": "Correction du problème suivant : il était possible de canaliser Fiend's Gate à l'intérieur de Snowball de Tusk ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]problème 6670[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes9": "L'unité incantatrice de Snowball est maintenant enracinée, et cet enracinement se superpose aux autres effets de statut éventuels. Cette modification corrige des problèmes relatifs aux effets de particules qui se produisaient quand certaines capacités de déplacement étaient utilisées pendant Snowball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problème 6805[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes10": "Correction du problème suivant : le bonus d'amplification des soins de Keeper of the Light n'était pas appliqué aux soins prodigués aux unités alliées par Illuminate pendant Spirit Form ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]problème 2176[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes11": "Correction du problème suivant : les unités ciblées par Pulverize de Primal Beast pouvaient rester attachées à Primal Beast si, pendant le déplacement vertical, elles était ciblées par la dissipation forte d'un autre sort (comme Earth Spike de Lion) ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]problème 3528[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes12": "Correction du problème suivant : dans les descriptions d'Ice Shards de Tusk et de God's Strength de Sven, le temps de recharge indiqué n'était pas réduit après avoir sélectionné les talents pertinents ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]problème 575[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes13": "Correction du problème suivant : il manquait des indicateurs de temps de recharge pour certaines capacités avec charges, y compris des capacités qui obtiennent des charges après l'amélioration d'un talent, ou l'obtention d'Aghanim's Scepter ou d'Aghanim's Shard ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]problème 315[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes14": "Correction du problème suivant : les soins de Spirit Vessel n'étaient pas pris en compte dans la section « Soins » de l'écran post-match ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]problème 213[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes15": "Correction du problème suivant : quand Scream of Pain était lancée alors qu'il n'y avait aucune unité à portée, les particules et les effets sonores de la capacité ne se déclenchaient pas ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]problème 5429[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes16": "Correction du problème suivant : le rôle de personnes qui se déconnectaient au début de la partie ne s'affichait pas correctement.",
  "732e_bug_fixes_notes17": "Correction du problème suivant : quand Omniknight était interrompu, les effets de Heavenly Grace étaient désactivés ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]problème 1649[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes18": "Correction du problème suivant : Troll Warlord pouvait contourner les attaques forcées de Battle Trance en lançant la version à distance de Whirling Axes en dehors de la portée d'incantation. Utiliser la capacité de cette manière lance maintenant les projectiles dans la direction choisie.",
  "732e_bug_fixes_notes19": "Correction du problème suivant : parfois, les messages de chat indiquant la déconnexion ou la reconnexion d'une personne ne s'affichaient pas si celle-ci avait été ignorée.",
  "732e_bug_fixes_notes20": "Les descriptions des gemmes des Arcanes de Queen of Pain et de Faceless Void indiquent maintenant que la progression vers les styles secondaires n'est prise en compte que lors de victoires. Il ne s'agit que d'une modification au niveau du texte : il a toujours fallu gagner des parties pour faire progresser leur Arcane.",
  "732e_bug_fixes_notes21": "Ajout d'informations supplémentaires à la description de Glyph of Fortification ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]problème 6786[/u] sur GitHub[/url]).",
  "732e_bug_fixes_notes22": "Une note (affichable en appuyant sur ALT tout en survolant) a été ajoutée aux capacités qui peuvent cibler les unités invulnérables et dissiper certains états d'invulnérabilité (comme Cyclone) pour indiquer qu'elles peuvent cibler les unités invulnérables.",
  "732e_bug_fixes_notes23": "Les descriptions des capacités suivantes ont été mises à jour :",
  "732e_bug_fixes_notes24": "Nightmare (Bane)",
  "732e_bug_fixes_notes25": "Poison (Boar de Beastmaster)",
  "732e_bug_fixes_notes26": "Wild Axes (Beastmaster)",
  "732e_bug_fixes_notes27": "Dispel Magic (être élémentaire Storm de Brewmaster)",
  "732e_bug_fixes_notes28": "Poison Sting (Spiderling de Broodmother)",
  "732e_bug_fixes_notes29": "Ice Spire (Lich)",
  "732e_bug_fixes_notes30": "Purge (unité archère de Necronomicon)",
  "732e_bug_fixes_notes31": "Nullify (Nullifier)",
  "732e_bug_fixes_notes32": "Fortune's End (Oracle)",
  "732e_bug_fixes_notes33": "Purge (Satyr Banisher)",
  "732e_bug_fixes_notes34": "Demonic Cleanse (Shadow Demon)",
  "732e_bug_fixes_notes35": "Demonic Purge (Shadow Demon)",
  "732e_bug_fixes_notes36": "Storm Hammer (Sven)",
  "732e_bug_fixes_notes37": "Pit of Malice (Underlord)",
  "732e_bug_fixes_notes38": "Les items du magot de collection II peuvent maintenant être offerts après avoir été déballés (comme c'est le cas pour le magot de collection I).",
  "732e_bug_fixes_notes39": "Il est maintenant possible de modifier les raccourcis dans l'interface des talents depuis le menu des raccourcis avancés.",
  "732e_bug_fixes_notes40": "Il n'est plus possible de participer au matchmaking avec l'option de lancement « -dev ». Cette option de lancement permettait à des outils tiers de modifier des éléments de l'interface de manière à obtenir un avantage en jeu.",
  "732e_bug_fixes_notes41": "Désactivation de moyens supplémentaires permettant d'accéder au profil des autres personnes pendant la phase de sélection.",
  "732e_bug_fixes_notes42": "Il est maintenant possible de cliquer sur le portrait d'une unité ennemie dans la barre supérieure en pleine partie pour voir son dernier emplacement et son dernier inventaire connus."
}