// 929.js

{
  "language": "brazilian",
  "muerta_title": "Atualização da Retaliação Mortal",
  "muerta_title_pre": "Atualização da",
  "muerta_title_post": " ",
  "muerta_title_date": "6 de março a 4 de abril de 2023",
  "muerta_play_trailer": "Assistir ao trailer",
  "new_hero_tag": "Nova heroína",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Heroína",
  "muerta_navigation_event": "Minijogo",
  "muerta_navigation_janitor": "Recursos",
  "muerta_navigation_gameplay": "Atualização de jogabilidade",
  "muerta_role1": "Carregadora",
  "muerta_role2": "Longo alcance",
  "muerta_role3": "Bombardeadora",
  "muerta_role4": "Desativadora",
  "muerta_intro": "Com os seus disparos de arrepiar, espíritos invocados e uma segunda arma sempre à mão, a Muerta era tão boa em tomar vidas que a Morte fez dela sua funcionária. Empunhando as pistolas gêmeas, ela tem uma sede de vingança mortal — a Muerta leva almas rebeldes para o além, por bem ou por mal. E, se precisarem de convencimento para morrer um pouco mais rápido, ela está pronta para revelar a sua verdadeira forma espectral e assassina.",
  "muerta_ability1_title": "Rebatiro",
  "muerta_ability1_desc": "A Muerta dispara um tiro fantasmagórico certeiro em uma unidade inimiga ou árvore. Quando a bala atingir o alvo, ela causa dano e um breve retardo, para então rebater na direção alvejada. Após a rebatida, o projétil causa dano a todas as unidades atravessadas até atingir um herói. Heróis atingidos pela rebatida ficam amedrontados, correndo para longe do impacto.",
  "muerta_ability2_title": "O Chamado",
  "muerta_ability2_desc": "Invoca um grupo de espíritos regressores que circulam lentamente a área-alvo. Inimigos dentro da área sofrem retardo das velocidades de movimento e ataque. Os regressores causam dano e silenciam inimigos atravessados.",
  "muerta_ability3_title": "Pistoleira",
  "muerta_ability3_desc": "Os ataques da Muerta têm uma chance de disparar um segundo projétil contra outro alvo, priorizando heróis.",
  "muerta_ability4_title": "Além do Véu",
  "muerta_ability4_desc": "A Muerta se transforma, tornando-se imune a dano físico. Todo o seu dano de ataque é causado como dano mágico. A Muerta ganha velocidade de ataque adicional e movimentação desobstruída. A Muerta pode atacar unidades etéreas, mas não causa dano a alvos imunes a magias.",
  "muerta_heroes_title": "Para saber todos os atributos da Muerta",
  "muerta_heroes_btn": "acesse a página de detalhes dela",
  "muerta_wallpaper": "Papéis de parede",
  "muerta_minigame_title_pre": "Minijogo da",
  "muerta_minigame_title": " ",
  "muerta_minigame_subtitle": "RÁPIDA E MORTAL…",
  "muerta_minigame_subtitle2": "A Muerta precisa de ajuda para enterrar os cadáveres da sua lista... e é aqui que você entra! Você receberá um alvo no início de cada partida de Dota durante o evento da Retaliação Mortal, e marca pontos por cada vez que abatê-lo (diretamente ou dando assistência). Mas cuidado: o seu adversário também quer o seu sangue, e quem marcar mais pontos obterá o dobro de recompensas!",
  "muerta_minigame_rules_title": "Flores",
  "muerta_minigame_rules_desc": "Mate e ajude a matar o seu alvo para marcar pontos e ganhar <b>Flores</b> da Muerta. Marque mais pontos que o seu alvo para levar ainda mais.",
  "muerta_minigame_rules_title2": "Tesouro",
  "muerta_minigame_rules_desc2": "Troque as suas Flores por <b>Baús da Retaliação Mortal</b>, repletos de conjuntos inéditos, incluindo itens temáticos do evento.",
  "muerta_minigame_rules_title3": "Chaves",
  "muerta_minigame_rules_desc3": "Compre uma <b>Chave da Retaliação Mortal</b> para destrancar um baú e revelar a sua recompensa. As chaves estão disponíveis para compra na sua moeda local ou em troca de 20.000 fragmentos cada na loja de fragmentos.",
  "muerta_treasure_title": "Baú da Retaliação Mortal",
  "muerta_treasure_content_desc": "Consiga mais Flores para ter mais chances de ganhar estes conjuntos temáticos da Retaliação Mortal. A Muerta concedeu a todos cinco chaves, para dar início às comemorações. Obtenha ainda mais trocando fragmentos ou na loja do Dota.",
  "muerta_minigame_treasure_name1": "Caçador Espectral",
  "muerta_minigame_treasure_name2": "Luz Agonizante",
  "muerta_minigame_treasure_name3": "Orbe do Altar",
  "muerta_minigame_treasure_name4": "Calor Mortal",
  "muerta_minigame_treasure_name5": "Cobra da Morte",
  "muerta_minigame_treasure_name6": "Boneco dos Mortos",
  "muerta_minigame_treasure_name7": "Arma Vencida",
  "muerta_minigame_treasure_name8": "Serpente das Almas",
  "janitors_corner_title": "Novos recursos",
  "732e_patch_dotaplus_advancedstats_title": "Estatísticas de batalha avançadas",
  "732e_patch_dotaplus_advancedstats_subtitle": "Mergulhe nos dados do seu histórico no Dota",
  "732e_patch_dotaplus_advancedstats_desc": "Exalte (e reavalie) as suas partidas com as estatísticas de batalha avançadas diretamente no seu perfil. Agora, os membros do Dota+ têm acesso a análises da própria jogabilidade inteiramente reformuladas e em tempo real. Aprofunde-se no seu estilo de jogo ordenando todo o seu histórico de partidas com cada herói, função, modo e mais.",
  "732e_patch_dotaplus_advancedstats_desc2": "Quer acompanhar as suas finalizações? Acompanhe as estatísticas com as colunas de criaturas. Quer saber o quanto você ajuda nas partidas? As estatísticas de suporte revelarão mais detalhes que uma Sentinela Reveladora.",
  "732e_patch_quickkeys_title": "Atalhos rápidos personalizáveis",
  "732e_patch_quickkeys_subtitle": "Maior controle sob os seus dedos",
  "732e_patch_quickkeys_desc": "Agora, usuários de atalho rápido podem atribuir individualmente para cada herói o tipo de ativação de cada habilidade e item, seja ao pressionar ou soltar uma tecla. Confira a novidade selecionando \"Atalhos específicos de unidades\" e \"Ativar atalho rápido\" para habilidades e itens na aba de atalhos no menu de configurações.",
  "732e_patch_friendslist_title": "Aprimoramentos na lista de amigos",
  "732e_patch_friendslist_subtitle": "Trate os seus melhores amigos do Dota da forma que merecem",
  "732e_patch_friendslist_desc": "Com o recurso de favoritos, você pode colocar as pessoas com quem você mais joga no topo da sua lista de amigos. Eles sempre estarão em destaque ao ordenar por jogando Dota, on-line ou off-line. Com o novo recurso de busca de amigos, você também pode achar exatamente quem procura.",
  "732e_patch_title": "Atualização de jogabilidade",
  "732e_patch_subtitle": "7.32E E MAIS",
  "732e_patch_turbo_title": "Alterações do modo Turbo",
  "732e_patch_turbo_intro": "Com o aumento da popularidade do modo Turbo, queremos garantir que estamos fazendo o possível para a sua comunidade de jogadores. Fiquem de olho, pois teremos mais alterações no futuro para melhorar ainda mais a experiência do modo.",
  "732e_patch_turbo_change_notes1": "Não é mais possível ver os heróis dos adversários durante a fase de escolha.",
  "732e_patch_turbo_change_notes2": "Remoção da fase de penalidade ao escolher heróis. Quando o tempo designado acabar, todos os jogadores que não selecionaram um herói serão forçados a escolher o herói atualmente realçado. Caso esse herói não esteja disponível ou não houver herói realçado, um herói será sorteado.",
  "732e_patch_turbo_change_notes3": "Agora, os valores dos itens \"Talismã Nulo\", \"Tiara Assombrada\" e \"Braçadeira\" são dobrados aos 12 minutos de partida, não mais aos 25 minutos.",
  "732e_patch_turbo_change_notes4": "Remoção do dano adicional a torres de todas as unidades invocadas. Unidades não invocadas (como criaturas de trilha e dominadas) permanecem mais fortes contra torres em comparação aos demais modos de jogo.",
  "732e_patch_turbo_change_notes5": "Agora, você pode obter duas estrelas em desafios de heróis em vez de apenas uma.",
  "732e_patch_turbo_change_notes6": "Agora, o Arcano \"Legado Laminar\" do Juggernaut contabiliza todas as vítimas do Onitalho.",
  "732e_patch_turbo_change_notes7": "Agora, o Arcano \"Domínio Planetar\" do Earthshaker contabiliza todas as vítimas e assistências da Batida Ecoante. Também contabiliza a combinação de habilidades e o dano causado.",
  "732e_patch_turbo_change_notes8": "Agora, o Imortal \"Retorno da Maestria Obscura\" do Invoker contabiliza todas as vítimas do Raio Solar.",
  "732e_patch_turbo_change_notes9": "Agora, o Imortal \"Caldeirão de Xahryx do Renascimento Eminente\" do Lone Druid contabiliza toda a duração das Garras Entrelaçantes.",
  "732e_patch_turbo_change_notes10": "Agora, o Imortal \"Lâmina da Baleia Leviatã do Renascimento Eminente\" de Kunkka contabiliza todos os heróis atingidos pela Torrente.",
  "732e_patch_turbo_change_notes11": "Agora, o Imortal \"Orquídea Relampejante do Renascimento Eminente\" do Storm Spirit contabiliza todo o dano causado pela Bola de Relâmpago.",
  "732e_patch_turbo_change_notes12": "Agora, o Imortal \"Amuleto do Rei Barbatana do Renascimento Eminente\" de Lion contabiliza todos os inimigos Enfeitiçados.",
  "732e_patch_turbo_change_notes13": "Agora, o Imortal \"Cajado Atormentado do Renascimento Eminente\" de Leshrac contabiliza todos os atordoamentos com Dividir a Terra.",
  "732e_patch_turbo_change_notes14": "Agora, o Arcano \"Lâminas de Voth Domosh\" da Legion Commander contabiliza todas as vitórias em Duelos.",
  "732e_patch_turbo_change_notes15": "O progresso em itens Arcanos foi atualizado para:",
  "732e_bug_fixes_title": "Correções",
  "732e_bug_fixes_notes1": "Correção de problema em que replays salvos não eram corretamente preenchidos com os detalhes da partida. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u][i]issue[/i] 349[/u][/url])",
  "732e_bug_fixes_notes2": "Correção de erro em que heróis ocasionalmente eram exibidos sem os seus modelos, materiais etc. até reconectar-se à partida. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u][i]issue[/i] 6070[/u][/url])",
  "732e_bug_fixes_notes3": "Correção de erro em que o Orbe Restaurador ocasionalmente não entrava em intervalo entre usos após usar um Fragmento Restaurador. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u][i]issue[/i] 6668[/u][/url])",
  "732e_bug_fixes_notes4": "Correção de erro no qual a Dança da Árvore do Monkey King não era ativada a distâncias muito longas. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u][i]issue[/i] 717[/u][/url])",
  "732e_bug_fixes_notes5": "Correção de erro no qual o Lifestealer errava o seu primeiro ataque de Infestar em inimigos dependendo da distância ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u][i]issue[/i] 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Agora, os ataques de Jinada e Germinar podem ser usados sob Quebra, mas não sob Silêncio. Isso as deixa consistente com habilidades semelhantes do jogo.([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u][i]issue[/i] 6779[/u][/url])",
  "732e_bug_fixes_notes7": "Correçao de erro no qual o efeito de partícula da Bola de Neve do Tusk não era destruído se a Bola de Neve não fosse lançada ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u][i]issue[/i] 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Não é mais possível canalizar o Portal do Demônio estando dentro de uma Bola de Neve. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u][i]issue[/i] 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Agora, o herói que lançou a Bola de Neve também fica enraizado, além dos efeitos de estado anteriores. Isso resolve alguns problemas relacionados a efeitos de partícula quando certas habilidades de movimentação eram usadas durante a Bola de Neve. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u][i]issue[/i] 6805[/u][/url])",
  "732e_bug_fixes_notes10": "Correção de erro no qual a cura em aliados de Iluminar do KotL na Forma Espiritual não era amplificada pela amplificação de cura do KotL. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u][i]issue[/i] 2176[/u][/url])",
  "732e_bug_fixes_notes11": "Correção de erro no qual Pulverizar da Fera Primal ocasionalmente prendia heróis à Fera Primal para sempre caso uma dissipação poderosa ocorresse durante a movimentação vertical de outra habilidade (como o Espinho de Terra do Lion). ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u][i]issue[/i] 3528[/u][/url])",
  "732e_bug_fixes_notes12": "Correção da não exibição dos intervalos entre usos reduzidos nas descrições dos Fragmentos de Gelo do Tusk e da Força Divina de Sven se os respectivos talentos fossem escolhidos. Esta é apenas uma correção textual — os intervalos estavam sendo reduzidos corretamente. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u][i]issue[/i] 575[/u][/url])",
  "732e_bug_fixes_notes13": "Correção da não indicação de intervalo entre usos em habilidades baseadas em cargas, incluindo aquelas que possuem cargas apenas com um talento ou aprimoramento de Aghanim. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u][i]issue[/i] 315[/u][/url])",
  "732e_bug_fixes_notes14": "Correção da não contabilização da cura do Receptáculo Espiritual nas estatísticas de cura da tela pós-partida. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u][i]issue[/i] 213[/u][/url])",
  "732e_bug_fixes_notes15": "Correção do não uso dos efeitos sonoros e de partícula da Queen of Pain quando Grito de Dor é usado sem alvos próximos. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u][i]issue[/i] 5429[/u][/url])",
  "732e_bug_fixes_notes16": "Agora, as funções corretas são exibidas na partida para jogadores que se desconectaram no início dela.",
  "732e_bug_fixes_notes17": "Correção da desativação da Graça Divina do Omniknight por Quebra. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u][i]issue[/i] 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Correção de erro no qual o Troll Warlord poderia ignorar os comandos de ataque forçado do Transe de Batalha ao enviar comandos de Machados Giratórios (Longo Alcance) fora do alcance de uso. Agora, fazê-lo fará com que Machados Giratórios (Longo Alcance) sejam lançados na direção escolhida.",
  "732e_bug_fixes_notes19": "Correção de alguns casos em que mensagens de conversa, como de desconexão e reconexão, não eram exibidos se o jogador estivesse silenciado.",
  "732e_bug_fixes_notes20": "Adição de \"em partidas vitoriosas\" para a descrição das gemas que destravam estilos alternativos para os Arcanos da Queen of Pain e do Faceless Void. Esta é apenas uma correção textual — sempre foi necessário vencer para progredir no Arcano de ambos os heróis.",
  "732e_bug_fixes_notes21": "Adição de algumas informações adicionais para o texto do Glifo de Fortificação. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u][i]issue[/i] 6786[/u][/url])",
  "732e_bug_fixes_notes22": "Adição de informações ao pressionar ALT em habilidades que podem alvejar unidades invulneráveis ou dissipar certos estados invulneráveis (como o Ciclone), para especificar essa possibilidade.",
  "732e_bug_fixes_notes23": "Atualização de textos para as seguintes habilidades:",
  "732e_bug_fixes_notes24": "Bane: Pesadelo",
  "732e_bug_fixes_notes25": "Beastmaster (Javali): Veneno",
  "732e_bug_fixes_notes26": "Beastmaster: Machados Selvagens",
  "732e_bug_fixes_notes27": "Brewmaster (Elemental da Tempestade): Dissipar Magias",
  "732e_bug_fixes_notes28": "Broodmother (Aranhinha): Picada Venenosa",
  "732e_bug_fixes_notes29": "Lich: Espiral de Gelo",
  "732e_bug_fixes_notes30": "Necronomicon (Arqueiro): Expurgar",
  "732e_bug_fixes_notes31": "Anulador: Anular",
  "732e_bug_fixes_notes32": "Oracle: Fim da Fortuna",
  "732e_bug_fixes_notes33": "Sátiro Expulsor: Expurgar",
  "732e_bug_fixes_notes34": "Shadow Demon: Limpeza Demoníaca",
  "732e_bug_fixes_notes35": "Shadow Demon: Expurgo Demoníaco",
  "732e_bug_fixes_notes36": "Sven: Punho da Tempestade",
  "732e_bug_fixes_notes37": "Underlord: Fosso da Malícia",
  "732e_bug_fixes_notes38": "Agora, itens do Suplemento de Colecionador II podem ser presenteados após a abertura, ficando igual aos do Suplemento de Colecionador I.",
  "732e_bug_fixes_notes39": "Agora, o aprimoramento de talentos pode ter teclas vinculadas nos atalhos avançados.",
  "732e_bug_fixes_notes40": "Não é mais possível jogar partidas oficiais quando iniciar o jogo com a opção de inicialização \"-dev\", por permitir que ferramentas externas modifiquem elementos da interface de forma prejudicial ao equilíbrio da partida.",
  "732e_bug_fixes_notes41": "Desativação de mais algumas formas de acessar o perfil de alguém durante a fase de escolha.",
  "732e_bug_fixes_notes42": "Agora, clicar no retrato de um inimigo na barra superior durante uma partida exibirá a localização e o inventário de quando ele foi visto por último."
}