// 1947.js

{
  "language": "hungarian",
  "muerta_title": "A Halálos Leszámolás frissítés",
  "muerta_title_pre": "A",
  "muerta_title_post": "frissítés",
  "muerta_title_date": "2023. március 6. – április 4.",
  "muerta_play_trailer": "Előzetes lejátszása",
  "new_hero_tag": "Új hős",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Hős",
  "muerta_navigation_event": "Minijáték",
  "muerta_navigation_janitor": "Funkciók",
  "muerta_navigation_gameplay": "Játékmenet-frissítés",
  "muerta_role1": "Végjátékos",
  "muerta_role2": "Távolsági",
  "muerta_role3": "Zúzó",
  "muerta_role4": "Bénító",
  "muerta_intro": "Félelmetes kapáslövéseivel, megidézett lelkeivel és ráadás pisztolyával Muerta tehetsége az élet kioltására oly lenyűgöző volt, hogy maga a Halál vette fel őt munkaerőnek. Muerta, a bosszú dupla pisztolyos, célt nem tévesztő gépezeteként tereli át a megtévedt lelkeket a másvilágra, akár oda akarnak jutni, akár nem. És ha további győzködésre van szükségük, készen áll felfedni valódi, rémálomba illő halálos spektrálalakját, ha az segít nekik kicsit gyorsabban meghalni.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta kísérteties megpattanó lövést ad le egy ellenséges egységre vagy fára. A lövedék találatkor sebez és rövid időre lassít, majd megpattan a célzott irányban. A tovább pattanó lövedék sebzi az összes egységet, amin áthalad, és hőst eltalálva megáll. A megpattanás által eltalált hősök a lövés irányába fognak futni.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Muerta megidéz egy csoport visszatért lelket, amelyek lassan köröznek a célzott terület körül. A területen lévő ellenségek lelassulnak és csökken a támadási sebességük. A lelkek sebzést okoznak az ellenségeknek és elhallgattatják azokat, mikor áthaladnak rajtuk.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Muerta támadásainak esélye van egy második lövésre egy másik célpontra, hősöket részesítve előnyben.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta átalakul, immunissá válva a fizikai sebzésre. Minden támadási sebzése mágikus sebzés lesz. Muerta támadási többletsebzést és ütközéstelen mozgást kap. Muerta támadhat éteri egységeket, de nem okoz sebzést varázsimmunis célpontoknak.",
  "muerta_heroes_title": "Muerta részletes statisztikáiért",
  "muerta_heroes_btn": "Nézd meg a hősrészletek oldalt",
  "muerta_wallpaper": "Háttérképek",
  "muerta_minigame_title_pre": "A",
  "muerta_minigame_title": "minijáték",
  "muerta_minigame_subtitle": "GYORSABB A HALÁLNÁL…",
  "muerta_minigame_subtitle2": "Muertának segítségre van szüksége, hogy a megfelelő élőket a megfelelő friss sírokba juttassa... és itt jössz te a képbe! A Halálos Leszámolás esemény alatt minden Dota játék előtt kapsz egy kijelölt célpontot. Szerezz pontokat ölésekért és segítésekért, de vigyázz; az ellenfeled is vadászik rád, és aki több pontot szerez, dupla jutalmat kap!",
  "muerta_minigame_rules_title": "Virágok",
  "muerta_minigame_rules_desc": "Szerezz öléseket és segítéseket a kijelölt célpontod ellen, hogy pontokat szerezz, és kiérdemeld Muerta <b>Virágait</b>. Zsákmányod növeléséhez szerezz több pontot a célpontodnál.",
  "muerta_minigame_rules_title2": "Kincs",
  "muerta_minigame_rules_desc2": "Váltsd be a Virágaidat vadonatúj tárgyszettekkel és eseménytémájú tárgyakkal megpakolt <b>Halálos Leszámolás Ládákra</b>.",
  "muerta_minigame_rules_title3": "Kulcsok",
  "muerta_minigame_rules_desc3": "Vásárolj egy <b>Halálos Leszámolás kulcsot</b> a láda kinyitásához és a benne levő jutalom felfedéséhez. A kulcsok %1$s összegért vagy 20 000 szilánkért érhetőek el a Szilánkboltban.",
  "muerta_treasure_title": "Halálos Leszámolás Láda",
  "muerta_treasure_content_desc": "Szerezz több Virágot extra esélyért e Halálos Leszámolás témájú tárgyszettek feloldására. Muerta mindenkinek öt kulcsot adott az ünneplés megkezdésére. Szerezz még annyit, amennyire csak szükséged van, szilánkok használatával, vagy a Dota boltban.",
  "muerta_minigame_treasure_name1": "Spektrálvadász",
  "muerta_minigame_treasure_name2": "Haldokló Fény",
  "muerta_minigame_treasure_name3": "Oltárgolyó",
  "muerta_minigame_treasure_name4": "Halálos Hőség",
  "muerta_minigame_treasure_name5": "Halálvipera",
  "muerta_minigame_treasure_name6": "A Holtak Babája",
  "muerta_minigame_treasure_name7": "Lejárt Fegyver",
  "muerta_minigame_treasure_name8": "Léleksárkány",
  "janitors_corner_title": "Új funkciók",
  "732e_patch_dotaplus_advancedstats_title": "Haladó csatastatisztikák",
  "732e_patch_dotaplus_advancedstats_subtitle": "Merülj el a Dota előzményeid adataiban",
  "732e_patch_dotaplus_advancedstats_desc": "Értékeld ki és emeld magasabb szintre a játékodat a Haladó csatastatisztikákkal közvetlenül a profilodban. A Dota Plusz tagok mostantól hozzáférnek a teljesen megújult, valós idejű játékelemzésekhez. Áss a játékstílusod mélyére a teljes Dota előzményeid hős, szerep, játékmód és egyebek szerinti rendezésével.",
  "732e_patch_dotaplus_advancedstats_desc2": "Az utolsó találatokra koncentrálsz? A creepstatisztika-csoportjai segítenek benne. A támogató képességeidet fejleszted? A támogató statisztikák mostantól többet fednek fel, mint egy Sentry Ward.",
  "732e_patch_quickkeys_title": "Személyre szabható gyorsvarázslás",
  "732e_patch_quickkeys_subtitle": "Pontosabb vezérlés a kezed ügyében",
  "732e_patch_quickkeys_desc": "A gyorsvarázslást használók mostantól külön-külön kioszthatják, hogy mely egységspecifikus képességek és tárgyak aktiválódnak billentyűlenyomással vagy felengedéssel. Próbáld ki az „Egységspecifikus gyorsbillentyűket”, majd a „Gyors-varázslás használását” választva képességekhez és tárgyakhoz a Beállítások menü Gyorsbillentyűk fülén.",
  "732e_patch_friendslist_title": "Barátlista-fejlesztések",
  "732e_patch_friendslist_subtitle": "Add meg a legjobb Dota barátaidnak a megérdemelt bánásmódot",
  "732e_patch_friendslist_desc": "A Kedvenc funkcióval mostantól megjelölheted azokat, akikkel a legtöbbet játszol, hogy a Barátlistád tetejére kerüljenek. Rendezd a barátaidat Kedvencek, Dotával játszik, Online és Offline sorrendbe. Vagy használd az újonnan hozzáadott Barátkeresés funkciót pontosan annak megtalálásához, akit keresel.",
  "732e_patch_title": "Játékmenet-frissítés",
  "732e_patch_subtitle": "7.32E ÉS TOVÁBBIAK",
  "732e_patch_turbo_title": "Turbó mód változások",
  "732e_patch_turbo_intro": "Mivel növekszik a Turbó mód népszerűsége, szeretnénk gondoskodni arról, hogy mindent megteszünk e játékoscsoportért, amit tudunk. Figyeld a további változásokat, ahogy tovább javítjuk a játékélmény egészét.",
  "732e_patch_turbo_change_notes1": "Mostantól minden hősválasztás vakon történik.",
  "732e_patch_turbo_change_notes2": "Kivettük a büntetési fázist hősválasztáskor. Amikor a normál választási idő véget ér, mindenkit, aki nem választott hőst, annak választására kényszerítünk, akit ideiglenesen választott. Amennyiben az a hős nem érhető el, vagy nincs ideiglenes választás, véletlenszerű hőst fog kapni.",
  "732e_patch_turbo_change_notes3": "A Null Talisman, a Wraith Band és a Bracer 25 perc helyett 12 perc után duplázza meg a bónuszait.",
  "732e_patch_turbo_change_notes4": "Megszüntettük minden idézett egység tornyok elleni többletsebzését. A nem idézett egységek (vonali creepek, uralt creepek), továbbra is erősebbek tornyok ellen a nem Turbó Dotához képest.",
  "732e_patch_turbo_change_notes5": "Mostantól hőskihívásokért két csillagot szerezhetsz, nem csak egyet.",
  "732e_patch_turbo_change_notes6": "Juggernaut Pengeküllem Hagyaték Titokzatosa mostantól teljesen beszámítja az Omnislash öléseket.",
  "732e_patch_turbo_change_notes7": "Earthshaker Földet Érés Titokzatosa mostantól teljesen beszámítja az Echo Slam öléseket és segítéseket. A képességsorozatok és kombinációs sebzés követése is be lett kapcsolva.",
  "732e_patch_turbo_change_notes8": "Invoker Sötét Művészet Felidézése Halhatatlanja mostantól teljesen beszámítja a Sun Strike öléseket.",
  "732e_patch_turbo_change_notes9": "Lone Druid A Kimagasló Újjáéledés Xahryx Üstje Halhatatlanja mostantól teljesen beszámítja az Entangling Claws időtartamot.",
  "732e_patch_turbo_change_notes10": "Kunkka A Kimagasló Újjáéledés Leviatánbálna-pengéje mostantól teljesen beszámítja a Torrenttel eltalált hősöket.",
  "732e_patch_turbo_change_notes11": "Storm Spirit A Kimagasló Újjáéledés Villámló Orchideája Halhatatlanja mostantól teljesen beszámítja a Ball Lightning sebzést.",
  "732e_patch_turbo_change_notes12": "Lion A Kimagasló Újjáéledés Uszonykirály Talizmánja Halhatatlanja mostantól teljesen beszámítja a Hex hatása alá került ellenségeket.",
  "732e_patch_turbo_change_notes13": "Leshrac A Kimagasló Újjáéledés Meggyötört Botja Halhatatlanja mostantól teljesen beszámítja a Split Earth használatával megbénított ellenségeket.",
  "732e_patch_turbo_change_notes14": "Legion Commander Titokzatosa mostantól számolja a Duel győzelmeket.",
  "732e_patch_turbo_change_notes15": "A Titokzatos és Halhatatlan haladás frissítve lett a következőkhöz:",
  "732e_bug_fixes_title": "Hibajavítások",
  "732e_bug_fixes_notes1": "Javítottunk egy problémát, aminél a mentett visszajátszások nem lettek helyesen feltöltve a meccsrészletekkel. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]349-es probléma[/u][/url])",
  "732e_bug_fixes_notes2": "Javítottuk a hibát, aminél a hősöknek a játékba visszacsatlakozásig néha hiányoztak a modelljei/anyagai/stb. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]6070-es probléma[/u][/url])",
  "732e_bug_fixes_notes3": "Javítottunk egy hibát, aminél a Refresher Orb néha nem került újratöltődésre Refresher Shard használatakor. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]6668-as probléma[/u][/url])",
  "732e_bug_fixes_notes4": "Javítottunk egy hibát, aminél Monkey King Tree Dance képessége nagyon nagy varázslási távolságoknál nem varázsolódott. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]717-es probléma[/u][/url])",
  "732e_bug_fixes_notes5": "Javítottunk egy hibát, aminél Lifestealer bizonyos távolságból varázsláskor elhibázta az első Infest támadását. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]6801-es probléma[/u][/url])",
  "732e_bug_fixes_notes6": "A Jinada és a Geminate Attack mostantól varázsolható Break hatása alatt, elhallgattatva viszont nem. A viselkedés mostantól következetesen egyezik a hasonló képességekkel. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]6779-es probléma[/u][/url])",
  "732e_bug_fixes_notes7": "Javítottunk egy hibát, aminél Tusks Snowballjának részecskeeffektjei nem szűntek meg, ha a hógolyó nem tudott elindulni. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]6805-ös probléma[/u][/url])",
  "732e_bug_fixes_notes8": "A hősök mostantól nem tudnak Fiend's Gate-et fenntartani, amíg a Snowball hógolyójában vannak. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]6670-es probléma[/u][/url])",
  "732e_bug_fixes_notes9": "Az a hős, aki a Snowballt varázsolja, mostantól a korábbi hatások mellett le is van gyökereztetve. Ez korábban részecskeeffekt-hibákat okozott, amikor bizonyos mozgási képességeket varázsoltak Snowball során. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]6805-ös probléma[/u][/url])",
  "732e_bug_fixes_notes10": "Javítottunk egy hibát, aminél Keeper of the Light gyógyításerősítése nem erősítette a Spirit Formos Illuminate képességének gyógyítását. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]2176-os probléma[/u][/url])",
  "732e_bug_fixes_notes11": "Javítottunk egy hibát, aminél Primal Beast Pulverize képességének hatására a hősök időnként végleg Primal Beasthez ragadhattak, ha a függőleges mozgás ideje alatt erős megszüntetésre került sor egy másik varázslattól, mint például Lion Earth Spike-ja. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]3528-as probléma[/u][/url])",
  "732e_bug_fixes_notes12": "Javítottuk, hogy Tusk Ice Shards és Sven God's Strength képességleírásai a megfelelő Adottságok választásakor nem a csökkentett újratöltődési idő értékeket jelenítették meg. Ez csak a szövegen végzett változtatás. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]575-ös probléma[/u][/url])",
  "732e_bug_fixes_notes13": "Javítottuk a töltetalapú képességek hiányzó újratöltődés-jelzőit, beleértve az olyan képességeket, amelyeknek csak a megfelelő Adottság választása vagy Aghanim-fejlesztés esetén van töltete. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]315-ös probléma[/u][/url])",
  "732e_bug_fixes_notes14": "Javítottuk, hogy a Spirit Vessel gyógyítása nem számított bele a gyógyításba a játék utáni képernyőn. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]213-as probléma[/u][/url])",
  "732e_bug_fixes_notes15": "Javítottuk Queen of Pain hiányzó részecske- és hangeffektjeit, amikor a Scream of Pain hatósugáron belüli célpont nélkül volt varázsolva. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]5429-es probléma[/u][/url])",
  "732e_bug_fixes_notes16": "A játékbeli szerepek mostantól helyesen vannak megjelenítve olyan játékosoknál, akik a játék kezdetén lekapcsolódtak.",
  "732e_bug_fixes_notes17": "Javítottuk, hogy a Break kikapcsolta Omniknight Heavenly Grace képességét. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]1649-es probléma[/u][/url])",
  "732e_bug_fixes_notes18": "Javítottunk egy hibát, aminél Troll Warlord Whirling Axes (távolsági) varázslási parancsok varázslási távolságon kívüli kiadásával felül tudta bírálni a Battle Trance kényszerített támadási parancsait. Az ilyen varázslás mostantól ehelyett Whirling Axes (távolsági) képességet fog varázsolni a kérdéses irányban.",
  "732e_bug_fixes_notes19": "Javítottunk egyes eseteket, amikor az olyan csevegésüzenetek, mint a lekapcsolódás és újracsatlakozás, nem jelentek meg, ha a játékos némítva volt.",
  "732e_bug_fixes_notes20": "Hozzáadtuk a „győztes játékokban” részt Queen of Pain és Faceless Void Titokzatosainál a második stílus feloldásához való ékkő leírásához. Ez csak szövegváltozás; ennél a két hősnél mindig is szükség volt a győzelemre a Titokzatos-haladáshoz.",
  "732e_bug_fixes_notes21": "Némi további információt adtunk a Glyph of Fortification elemleírásához. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]6786-os probléma[/u][/url])",
  "732e_bug_fixes_notes22": "ALT + képességleírást adtunk olyan képességekhez, amelyek képesek sebezhetetlen egységeket célozni és megszüntetni bizonyos sebezhetetlen állapotokat, annak jelzésére, hogy tudnak sebezhetetlen egységet célozni.",
  "732e_bug_fixes_notes23": "Frissítettük a képességleírásokat az alábbi képességekhez:",
  "732e_bug_fixes_notes24": "Bane: Nightmare",
  "732e_bug_fixes_notes25": "Beastmaster vadkanjának mérgezése",
  "732e_bug_fixes_notes26": "Beastmaster: Wild Axes",
  "732e_bug_fixes_notes27": "Brewmaster Storm Brewlingjének Dispel Magic képessége",
  "732e_bug_fixes_notes28": "Broodmother Spiderlingjének Poison Sting képessége",
  "732e_bug_fixes_notes29": "Lich: Ice Spire",
  "732e_bug_fixes_notes30": "Necronomicon Archer: Purge",
  "732e_bug_fixes_notes31": "Nullifier: Nullify",
  "732e_bug_fixes_notes32": "Oracle: Fortune's End",
  "732e_bug_fixes_notes33": "Satyr Banisher: Purge",
  "732e_bug_fixes_notes34": "Shadow Demon: Demonic Cleanse",
  "732e_bug_fixes_notes35": "Shadow Demon: Demonic Purge",
  "732e_bug_fixes_notes36": "Sven: Storm Hammer",
  "732e_bug_fixes_notes37": "Underlord: Pit of Malice",
  "732e_bug_fixes_notes38": "A Gyűjtők Ékkőládája II tárgyai a kicsomagolás után ajándékozhatók, hogy megegyezzen a Gyűjtők Ékkőládája I ajándékozhatóságával.",
  "732e_bug_fixes_notes39": "Az adottságfejlesztő kezelőfelület mostantól billentyűkhöz rendelhető a Haladó Billentyűzetkiosztás menüben.",
  "732e_bug_fixes_notes40": "Letiltottuk a meccskereséshez csatlakozás lehetőségét, amikor a -dev kapcsoló be van kapcsolva. Ez lehetővé tette külső eszközöknek a kezelőfelület elemeinek kihasználható módon való módosítását.",
  "732e_bug_fixes_notes41": "Letiltottuk a játékosprofilok elérésének néhány további módját a választási szakasz során.",
  "732e_bug_fixes_notes42": "Az ellenségekre kattintás a felső sávban játék során megmutatja a legutóbbi ismert helyzetüket, illetve felszerelésállapotukat."
}