// 3966.js

{
  "language": "romanian",
  "muerta_title": "Actualizarea Dead Reckoning",
  "muerta_title_pre": "Actualizarea",
  "muerta_title_post": " ",
  "muerta_title_date": "6 martie 2023 - 4 aprilie 2023",
  "muerta_play_trailer": "Redă trailerul",
  "new_hero_tag": "Eroină nouă",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Eroina",
  "muerta_navigation_event": "Mini-joc",
  "muerta_navigation_janitor": "Caracteristici",
  "muerta_navigation_gameplay": "Actualizare de joc",
  "muerta_role1": "Carry",
  "muerta_role2": "De distanță",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "Cu precizia ei nelumească, spiritele invocate și chiar arma sa de rezervă, talentul Muertei de a lua vieți este atât de impresionant încât chiar Moartea a luat-o sub aripa sa. Înarmată cu două pistoale și o dorință de răzbunare nemaivăzută, Muerta îndrumă sufletele către lumea de dincolo, fie că vor, fie că nu. Iar, pentru cei care trebuie convinși, aceasta e pregătită să-și dezvăluie adevărata sa formă, un coșmar spectral letal, în speranță că le va oferi o moarte mai rapidă.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta lansează un proiectil fantomatic către o unitate inamică sau un copac. După impact, acesta va cauza daune și va încetini pentru o scurtă durată, iar apoi va ricoșa în direcția țintită. Ricoșeul rănește toate unitățile prin care trece, oprindu-se dacă nimerește un erou. Eroii loviți de ricoșeu vor fugi în direcția loviturii.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Invocă un grup de spirite care înconjoară zona țintită. Inamicii din zonă sunt încetiniți și au viteza de atac redusă. Spiritele cauzează daune și amuțesc inamicii prin care trec.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Atacurile Muertei au o șansă de a declanșa un al doilea foc către o altă țintă, prioritizând eroii.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta se transformă, devenind imună la daune fizice. Toate daunele ei de atac devin daune magice. Muerta primește daune de atac bonus și mișcare fazică. Muerta poate ataca unități eterice, dar nu cauzează daune unităților imune la magie.",
  "muerta_heroes_title": "Pentru statistici detaliate despre Muerta",
  "muerta_heroes_btn": "Vezi pagina cu detaliile eroinei",
  "muerta_wallpaper": "Fundaluri",
  "muerta_minigame_title_pre": "Mini-jocul",
  "muerta_minigame_title": " ",
  "muerta_minigame_subtitle": "MAI IUTE CA MOARTEA...",
  "muerta_minigame_subtitle2": "Muerta are nevoie de ajutor pentru a conduce cadavrele proaspete către mormintele proaspăt săpate... aici intervii tu! Ți se va desemna o țintă înainte de fiecare meci de Dota pe durata evenimentului Dead Reckoning. Poți înscrie puncte cu ajutorul uciderilor și asistărilor. Dar ai grijă, adversarii îți vor vrea propria viață, iar oricine înscrie mai multe puncte va primi o recompensă dublată!",
  "muerta_minigame_rules_title": "Flori",
  "muerta_minigame_rules_desc": "Obține ucideri și asistări împotriva țintei tale desemnate pentru a înscrie puncte și a obține <b>florile</b> Muertei. Înscrie mai multe puncte decât ținta ta pentru a obține o pradă și mai generoasă.",
  "muerta_minigame_rules_title2": "Comoară",
  "muerta_minigame_rules_desc2": "Dă-ți florile la schimb pentru <b>cufere Dead Reckoning</b>, care sunt pline cu seturi de obiecte nou-nouțe, printre care și obiecte cu tematica evenimentului.",
  "muerta_minigame_rules_title3": "Chei",
  "muerta_minigame_rules_desc3": "Cumpără o <b>cheie Dead Reckoning</b> pentru a descuia cufărul și pentru a dezvălui recompensa din interior. Cheile sunt disponibile pentru achiziție la prețul de %1$s sau pot fi obținute din magazinul cu fragmente în schimbul a 20.000 de fragmente fiecare.",
  "muerta_treasure_title": "Cufăr Dead Reckoning",
  "muerta_treasure_content_desc": "Obține și mai multe flori pentru a avea mai multe șanse de a debloca aceste seturi de obiecte cu tematica evenimentului Dead Reckoning. Muerta le-a acordat tuturor cinci chei pentru a începe cu dreptul acest eveniment. Ia-ți cât de multe ai nevoie folosind fragmente sau magazinul Dota.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "Caracteristici noi",
  "732e_patch_dotaplus_advancedstats_title": "Statistici avansate de luptă",
  "732e_patch_dotaplus_advancedstats_subtitle": "Analizează îndeaproape istoricul tău din Dota",
  "732e_patch_dotaplus_advancedstats_desc": "Elevează-ți și evaluează-ți capabilitățile folosind statisticile avansate de luptă, chiar direct pe profilul tău. Membrii Dota Plus au acum acces la analize complet reproiectate privind meciurile, în timp real. Analizează-ți în detaliu stilul de joc cu ajutorul funcției de sortare a istoricului tău complet de Dota, în funcție de eroi, roluri, moduri de joc și multe altele.",
  "732e_patch_dotaplus_advancedstats_desc2": "Vrei să te concentrezi pe loviturile finale? Grupul de statistici pentru creepi îți va fi perfect. Vrei să-ți îmbunătățești aptitudinile de Support? Statisticile pentru Support vor dezvălui mai multe decât un Sentry Ward.",
  "732e_patch_quickkeys_title": "Invocare rapidă personalizabilă",
  "732e_patch_quickkeys_subtitle": "Control mai precis la îndemâna ta",
  "732e_patch_quickkeys_desc": "Utilizatorii care folosesc invocarea rapidă acum pot să desemneze în mod individual care abilitate specifică unităților sau obiectelor este declanșată de o apăsare sau eliberare de buton. Asigură-te că ai active opțiunile „Taste rapide specifice unităților” și „Activează invocarea rapidă” pentru abilități și obiecte din fila cu taste rapide a meniului de setări.",
  "732e_patch_friendslist_title": "Îmbunătățiri aduse listei de prieteni",
  "732e_patch_friendslist_subtitle": "Tratează-ți cei mai buni prieteni din Dota așa cum se cuvine",
  "732e_patch_friendslist_desc": "Cu noua funcție pentru prieteni preferați, acum îi poți eticheta pe cei cu care te joci cel mai mult pentru a-i avea în partea superioară a listei tale de prieteni. Sortează-ți prietenii în funcție de preferați, care joacă Dota chiar acum, care sunt online și offline. Sau folosește noua funcție de căutare a prietenilor pentru a găsi persoana dorită.",
  "732e_patch_title": "Actualizarea de joc",
  "732e_patch_subtitle": "7.32E ȘI MULTE ALTELE",
  "732e_patch_turbo_title": "Modificări pentru modul Turbo",
  "732e_patch_turbo_intro": "Pe măsură ce modul Turbo devine din ce în ce mai popular, vrem să ne asigurăm că facem tot ceea ce putem pentru acel grup de jucători. Fii pregătit, căci elaborăm mai multe modificări pentru a continua să îmbunătățim experiența generală de joc.",
  "732e_patch_turbo_change_notes1": "Toate selecțiile de eroi sunt acum pe nevăzute.",
  "732e_patch_turbo_change_notes2": "A fost eliminată faza de penalizare aferentă alegerii eroilor. Atunci când timpul normal de selecție expiră, orice persoană care nu a selectat un erou va fi forțată să aleagă oricare dintre eroii aleși provizoriu anterior. Dacă eroul nu mai este disponibil sau dacă nu a fost selectat provizoriu niciun erou, atunci jucătorului îi va fi atribuit un erou în mod aleatoriu.",
  "732e_patch_turbo_change_notes3": "Null Talisman, Wraith Band și Bracer își vor dubla bonusurile la 12 minute în loc de 25 de minute.",
  "732e_patch_turbo_change_notes4": "Bonusul de daune cauzat turnurilor de către unitățile invocate a fost eliminat. Unitățile care nu sunt invocate (creepii din culoare și cei dominați) sunt în continuare mai puternici împotriva turnurilor, spre deosebire de varianta non-Turbo de Dota.",
  "732e_patch_turbo_change_notes5": "Acum poți obține două stele pentru provocările eroilor în loc de una.",
  "732e_patch_turbo_change_notes6": "Arcana Bladeform Legacy a lui Juggernaut acum contorizează pe deplin uciderile realizate cu Omnislash.",
  "732e_patch_turbo_change_notes7": "Arcana Planetfall a lui Earthshaker acum contorizează pe deplin uciderile și asistările realizate cu Echo Slam. Acum contorizează și combinațiile de abilități si daunele cauzate de aceste combinații.",
  "732e_patch_turbo_change_notes8": "Obiectul Immortal Dark Artistry Throwback al lui Invoker acum contorizează pe deplin uciderile realizate cu Sun Strike.",
  "732e_patch_turbo_change_notes9": "Obiectul Immortal Cauldron of Xahryx of Eminent Revival al lui Lone Druid acum contorizează pe deplin durata de activitate a abilității Entangling Claws.",
  "732e_patch_turbo_change_notes10": "Obiectul Immortal Leviathan Whale Blade of Eminent Revival al lui Kunkka acum contorizează pe deplin eroii loviți cu Torrent.",
  "732e_patch_turbo_change_notes11": "Obiectul Immortal The Lightning Orchid of Eminent Revival al lui Storm Spirit acum contorizează pe deplin daunele cauzate cu Ball Lightning.",
  "732e_patch_turbo_change_notes12": "Obiectul Immortal Fin King's Charm of Eminent Revival al lui Lion acum contorizează pe deplin durata totală de deochere a inamicilor.",
  "732e_patch_turbo_change_notes13": "Obiectul Immortal Tormented Staff of Eminent Revival Immortal al lui Leshrac acum contorizează pe deplin numărul de inamici năuciți cu Split Earth.",
  "732e_patch_turbo_change_notes14": "Arcana pentru Legion Commander acum contorizează victoriile din dueluri.",
  "732e_patch_turbo_change_notes15": "Progresul obiectelor Arcana a fost actualizat pentru următoarele:",
  "732e_bug_fixes_title": "Remedieri de erori",
  "732e_bug_fixes_notes1": "A fost remediată o eroare din cauza căreia reluările salvate nu erau populate corect cu detaliile meciului. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]problema 349[/u][/url])",
  "732e_bug_fixes_notes2": "A fost remediată o eroare din cauza căreia uneori eroii nu aveau modele/materiale/etc. până în momentul reconectării la joc. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]problema 6070[/u][/url])",
  "732e_bug_fixes_notes3": "A fost remediată o eroare din cauza căreia Refresher Orb nu-și declanșa repausul atunci când era utilizat un Refresher Shard. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]problema 6668[/u][/url])",
  "732e_bug_fixes_notes4": "A fost remediată o eroare din cauza căreia abilitatea Tree Dance a lui Monkey King avea distanțe foarte mari de invocare. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]problema 717[/u][/url])",
  "732e_bug_fixes_notes5": "A fost remediată o eroare din cauza căreia Lifestealer rata primul atac cu Infest dacă abilitatea era invocată la anumite distanțe. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]problema6801[/u][/url])",
  "732e_bug_fixes_notes6": "Atacurile cu Jinada și Geminate Attack pot fi invocate atunci când eroul este perturbat, dar nu și în timp ce este amuțit. Comportamentul este acum consistent cu celelalte abilități asemănătoare din joc. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]problema 6779[/u][/url])",
  "732e_bug_fixes_notes7": "A fost remediată o eroare din cauza căreia efectul de particule al abilității Snowball a lui Tusk nu era distrus dacă lansarea acestuia nu mai avea loc. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problema 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Eroii nu mai pot concentra Fiend's Gate cât timp se află într-un Snowball. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]problema 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Eroii care au invocat Snowball acum sunt înrădăcinați, pe lângă celelalte efecte aplicate. Înainte cauza niște probleme cu efectele de particule atunci când anumite abilități de mișcare erau utilizate în timp ce se folosea Snowball. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problema 6805[/u][/url])",
  "732e_bug_fixes_notes10": "A fost remediată o eroare din cauza căreia abilitatea Spirit Form a lui Keeper of the Light nu avea vindecarea amplificată atunci când eroul folosea Illuminate. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]problema 2176[/u][/url])",
  "732e_bug_fixes_notes11": "A fost remediată o eroare din cauza căreia abilitatea Pulverize a lui Primal Beast îi făcea uneori pe eroi să rămână blocați permanent în Primal Beast dacă era utilizat un descântec puternic al altei vrăji în timpul mișcării verticale, cum ar fi cea Earth Spike a lui Lion. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]problema 3528[/u][/url])",
  "732e_bug_fixes_notes12": "A fost remediată o eroare din cauza căreia descrierile pentru abilitățile Ice Shard a lui Tusk și God's Strength a lui Sven nu afișau valorile corecte pentru repaus atunci când talentul corespunzător era ales. Aceasta e doar o modificare de text, funcționalitatea nefiind afectată. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]problema 575[/u][/url])",
  "732e_bug_fixes_notes13": "Au fost remediate indicatoarele de repaus lipsă pentru abilitățile bazate pe încărcături, inclusiv cele care au încărcături doar atunci când un talent este ales sau când este achiziționat un obiect Aghanim's. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]problema 315[/u][/url])",
  "732e_bug_fixes_notes14": "A fost remediat faptul că vindecarea de la Spirit Vessel nu era contorizată pe ecranul de la sfârșitul meciului. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]problema 213[/u][/url])",
  "732e_bug_fixes_notes15": "A fost remediat faptul că Queen of Pain nu avea particule sau efecte sonore atunci când invoca Scream of Pain fără să fie vreo țintă prin preajmă. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]problema 5429[/u][/url])",
  "732e_bug_fixes_notes16": "Rolurile din joc sunt afișate corect jucătorilor care s-au deconectat la începutul meciului.",
  "732e_bug_fixes_notes17": "A fost remediat faptul că abilitatea Heavenly Grace a lui Omniknight era dezactivată de perturbare. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]problema 1649[/u][/url])",
  "732e_bug_fixes_notes18": "A fost remediată o eroare din cauza căreia Troll Warlord putea suprascrie atacul forțat al abilității Battle Trance dacă invoca Whirling Axes (Ranged) în afara distanței de invocare. O astfel de invocare acum va invoca Whirling Axes (Ranged) în acea direcție.",
  "732e_bug_fixes_notes19": "Au fost remediate unele situații în care mesajele din chat, cum ar fi cele de deconectare sau reconectare, nu erau afișate dacă jucătorul în cauză era amuțit.",
  "732e_bug_fixes_notes20": "A fost adăugată sintagma „În meciurile câștigate” la descrierea nestematelor pentru deblocarea stilurilor secundare pentru obiectele Arcana ale Queen of Pain și Faceless Void. Aceasta este doar o modificare de text, victoriile au fost întotdeauna necesare pentru progresia obiectelor Arcana ale acestor eroi.",
  "732e_bug_fixes_notes21": "Au fost adăugate informații suplimentare în descrierea abilității Glyph of Fortification. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]problema 6786[/u][/url])",
  "732e_bug_fixes_notes22": "Pentru abilitățile care pot ținti unități invulnerabile și descânta anumite stări invizibile (Cyclone etc.), a fost adăugate descrieri, care sunt afișate când este apăsată tasta ALT, pentru a specifica faptul că pot ținti unități invulnerabile.",
  "732e_bug_fixes_notes23": "Au fost actualizate descrierile pentru următoarele abilități:",
  "732e_bug_fixes_notes24": "Nightmare a lui Bane",
  "732e_bug_fixes_notes25": "Boar Poison a lui Beastmaster",
  "732e_bug_fixes_notes26": "Wild Axes a lui Beastmaster",
  "732e_bug_fixes_notes27": "Dispel Magic a unității Storm Brewling a lui Brewmaster",
  "732e_bug_fixes_notes28": "Poison Sting a unității Spiderling al lui Broodmother",
  "732e_bug_fixes_notes29": "Ice Spire a lui Lich",
  "732e_bug_fixes_notes30": "Purge a lui Necronomicon Archer",
  "732e_bug_fixes_notes31": "Nullify de la Nullifier",
  "732e_bug_fixes_notes32": "Fortune's End a lui Oracle",
  "732e_bug_fixes_notes33": "Purge a lui Satyr Banisher",
  "732e_bug_fixes_notes34": "Demonic Cleanse a lui Shadow Demon",
  "732e_bug_fixes_notes35": "Demonic Purge a lui Shadow Demon",
  "732e_bug_fixes_notes36": "Storm Hammer a lui Sven",
  "732e_bug_fixes_notes37": "Pit of Malice a lui Underlord",
  "732e_bug_fixes_notes38": "Obiectele din „Cutia colecționarului 2” pot fi dăruite după despachetare, asemenea obiectelor din „Cutia colecționarului 1”.",
  "732e_bug_fixes_notes39": "Interfața aferentă talentelor poate avea acum taste asociate prin intermediul meniului avansat pentru asocierile de taste rapide.",
  "732e_bug_fixes_notes40": "A fost eliminată posibilitatea de a accesa matchmakingul cât timp este activ parametrul „-dev flag”. Această modificare le permite instrumentelor terțe să modifice elementele de interfață în moduri care puteau fi considerate abuzive.",
  "732e_bug_fixes_notes41": "Au fost dezactivate mai multe modalități prin care se putea accesa profilul cuiva în timpul fazei de selecție.",
  "732e_bug_fixes_notes42": "Dacă apeși din bara de sus pe inamici în timpul unui meci vei vedea ultima locație a acestora și starea inventarului acestora."
}