// 4105.js

{
  "language": "vietnamese",
  "muerta_title": "Bản cập nhật Dead Reckoning",
  "muerta_title_pre": "Bản cập nhật",
  "muerta_title_post": " ",
  "muerta_title_date": "6/3 - 4/4/2023",
  "muerta_play_trailer": "Xem trailer",
  "new_hero_tag": "Tướng mới",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Tướng",
  "muerta_navigation_event": "Mini game",
  "muerta_navigation_janitor": "Tính năng",
  "muerta_navigation_gameplay": "Cập nhật lối chơi",
  "muerta_role1": "Carry",
  "muerta_role2": "Tầm xa",
  "muerta_role3": "Dồn phép",
  "muerta_role4": "Chế ngự",
  "muerta_intro": "Với tài bắn súng điêu luyện, khả năng triệu hồi linh hồn, và thêm cả vũ khí giắt lưng, tài đoạt mạng của Muerta ấn tượng đến mức chính Thần Chết phải đưa cô vào sổ lương. Một cỗ máy phục thù nhắm ai trúng đó lấy hai khẩu súng làm động cơ, Muerta lùa linh hồn lạc lối tới thế giới bên kia, dù chúng có muốn hay không. Và lỡ có kẻ cứng đầu, thì cô sẵn sàng hiện nguyên hình thành bóng ma ác mộng để giúp chúng chết nhanh hơn một tí.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta bắn viên đạn ma với khả năng dội vào một kẻ địch hoặc cây. Khi đạn trúng, nó gây sát thương và làm chậm thoáng chốc, rồi dội lại theo hướng chỉ định. Đạn dội gây sát thương lên tất cả đơn vị nó đi qua và dừng lại khi trúng một tướng. Tướng trúng đạn dội sẽ chạy theo hướng của viên đạn.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Triệu hồi một nhóm bóng ma từ từ vây tròn quanh vị trí chỉ định. Kẻ địch trong khu vực bị làm chậm tốc độ chạy và đánh. Bóng ma gây sát thương và khóa phép khi chạm vào kẻ địch.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Đòn tấn công của Muerta có tỉ lệ khai hỏa phát đạn thứ hai lên một mục tiêu ngẫu nhiên khác, ưu tiên tướng.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta biến hình, miễn nhiễm sát thương vật lý. Tất cả đòn tấn công thường gây sát thương phép. Muerta tăng thêm sát thương tấn công và di chuyển xuyên vật cản. Muerta có thể tấn công đơn vị hồn thể, nhưng không gây sát thương lên đơn vị miễn nhiễm phép.",
  "muerta_heroes_title": "Để xem thông số chi tiết của Muerta",
  "muerta_heroes_btn": "Xem trang chi tiết tướng",
  "muerta_wallpaper": "Hình nền",
  "muerta_minigame_title_pre": " ",
  "muerta_minigame_title": "Mini game",
  "muerta_minigame_subtitle": "NHANH THÌ SỐNG, CHẬM THÌ CHẾT…",
  "muerta_minigame_subtitle2": "Chôn đúng chỗ, người chết đúng mộ, và Muerta cần được trợ giúp... từ bạn! Bạn sẽ được giao một mục tiêu trước mỗi trận trong sự kiện Dead Reckoning. Ghi điểm bằng cách giết và hỗ trợ. Nhưng cẩn thận — kẻ địch cũng đi săn bạn đấy, và ai ghi nhiều điểm hơn sẽ nhận gấp đôi phần thưởng!",
  "muerta_minigame_rules_title": "Hoa cài",
  "muerta_minigame_rules_desc": "Giết hoặc hỗ trợ chống lại mục tiêu được giao thì bạn sẽ ghi điểm và nhận <b>hoa</b> của Muerta. Ghi nhiều điểm hơn mục tiêu để tăng mức thưởng.",
  "muerta_minigame_rules_title2": "Kho báu",
  "muerta_minigame_rules_desc2": "Đổi hoa lấy <b>hòm Dead Reckoning</b>, ngập tràn các bộ vật phẩm mới, bao gồm nhiều hàng hóa theo chủ đề sự kiện.",
  "muerta_minigame_rules_title3": "Chìa khóa",
  "muerta_minigame_rules_desc3": "Mua <b>chìa Dead Reckoning</b> để mở khóa hòm và khám phá phần thưởng bên trong. Chìa được bán với giá %1$s hoặc 20.000 pha lê trong cửa hàng pha lê.",
  "muerta_treasure_title": "Hòm Dead Reckoning",
  "muerta_treasure_content_desc": "Ghi thật nhiều hoa để thêm cơ hội mở khóa các bộ vật phẩm chủ đề Dead Reckoning này. Muerta đã trao cho tất cả bà con cô bác 5 chìa để nổi lửa ăn mừng. Kiếm cho thỏa thê tùy ý thích bằng cách dùng pha lê hay ghé cửa hàng Dota.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "Tính năng mới",
  "732e_patch_dotaplus_advancedstats_title": "Thông số trận đấu nâng cao",
  "732e_patch_dotaplus_advancedstats_subtitle": "Đào bới dữ liệu lịch sử Dota của bạn nào",
  "732e_patch_dotaplus_advancedstats_desc": "Nâng tầm — và sánh tầm — trận đấu của bạn, với thông số trận đấu nâng cao trực tiếp trong hồ sơ.  Thành viên Dota Plus giờ có thể truy cập các phân tích trò chơi theo thời gian thực đã được cải tiến hoàn toàn. Lặn sâu vào phong cách chơi của bạn bằng cách sắp xếp toàn bộ lịch sử chơi Dota theo tướng, vai trò, chế độ chơi, và nhiều nữa.",
  "732e_patch_dotaplus_advancedstats_desc2": "Tập trung tung đòn kết liễu? Nhóm chỉ số quái sẽ bao thầu khoản này. Muốn cải thiện trình hỗ trợ? Chỉ số hỗ trợ giờ không chỉ dừng lại ở việc hé lộ mắt tàng hình.",
  "732e_patch_quickkeys_title": "Biến hóa dùng phép nhanh",
  "732e_patch_quickkeys_subtitle": "Tinh tế hơn chỉ trên đầu ngón tay",
  "732e_patch_quickkeys_desc": "Người sử dụng tính năng dùng phép nhanh giờ có thể gán đơn lẻ kỹ năng nào của đơn vị và vật phẩm sẽ được kích hoạt khi ấn hay thả nút. Kiểm tra mục 'Phím tắt riêng từng đơn vị' và 'Bật dùng nhanh' cho kỹ năng và vật phẩm trong thẻ 'Phím tắt' của menu thiết lập.",
  "732e_patch_friendslist_title": "Cải thiện danh sách bạn bè",
  "732e_patch_friendslist_subtitle": "Hảo hữu Dota giờ sẽ được yêu ái",
  "732e_patch_friendslist_desc": "Với tính năng 'Yêu thích', bạn giờ có thể gắn nhãn cho người mình thường chơi cùng để họ luôn ở đầu danh sách bạn bè. Xếp bạn bè theo kiểu 'Yêu thích', 'Đang chơi Dota', 'Trên mạng' hay 'Rời mạng'. Hoặc dùng tính năng 'Tìm bạn bè' mới được thêm vào để tìm đúng người mình cần.",
  "732e_patch_title": "Cập nhật lối chơi",
  "732e_patch_subtitle": "7.32E VÀ HƠN THẾ",
  "732e_patch_turbo_title": "Thay đổi chế độ Turbo",
  "732e_patch_turbo_intro": "Với việc chế độ Turbo ngày một phổ biến, chúng tôi muốn làm hết sức có thể cho nhóm người chơi đó. Chú ý theo dõi thêm nhiều thay đổi trong tương lai nhé, chúng tôi sẽ liên tục cải thiện trải nghiệm chơi cho chế độ này.",
  "732e_patch_turbo_change_notes1": "Tất cả việc chọn tướng giờ sẽ là chọn mù",
  "732e_patch_turbo_change_notes2": "Gỡ bỏ giai đoạn phạt khi chọn tướng. Khi thời gian chọn thông thường kết thúc, người nào chưa chọn tướng sẽ bị ép chọn tướng đang định dùng. Trong trường hợp tướng đó không còn hay chưa có dự định, họ sẽ được chỉ định tướng ngẫu nhiên",
  "732e_patch_turbo_change_notes3": "Null Talisman, Wraith Band, và Bracer sẽ nhân đôi chỉ số ở phút thứ 12 thay vì 25",
  "732e_patch_turbo_change_notes4": "Bỏ sát thương tăng thêm lên trụ từ tất cả đơn vị triệu hồi. Đơn vị không phải triệu hồi (quái đường, quái thu phục) vẫn đánh mạnh hơn vào trụ so với chế độ Dota không kích hoạt Turbo",
  "732e_patch_turbo_change_notes5": "Bạn giờ có thể nhận hai sao cho thử thách tướng thay vì chỉ một",
  "732e_patch_turbo_change_notes6": "Arcana Bladeform Legacy của Juggernaut giờ ghi nhận đầy đủ mạng giết cho Omnislash",
  "732e_patch_turbo_change_notes7": "Arcana Planetfall của Earthshaker giờ ghi nhận đầy đủ mạng giết và hỗ trợ cho Echo Slam. Theo dõi dồn kỹ năng và sát thương combo giờ cũng được bật",
  "732e_patch_turbo_change_notes8": "Vật phẩm bất diệt Dark Artistry Throwback cho Invoker giờ ghi nhận đầy đủ mạng giết cho Sun Strike",
  "732e_patch_turbo_change_notes9": "Vật phẩm bất diệt Cauldron of Xahryx of Eminent Revival của Lone Druid giờ ghi nhận đầy đủ thời lượng cho Entangling Claws",
  "732e_patch_turbo_change_notes10": "Vật phẩm bất diệt Leviathan Whale Blade of Eminent Revival của Kunkka giờ ghi nhận đầy đủ số lần đánh trúng nhiều tướng với Torrent",
  "732e_patch_turbo_change_notes11": "Vật phẩm bất diệt The Lightning Orchid of Eminent Revival của Storm Spirit giờ ghi nhận đầy đủ sát thương Ball Lightning",
  "732e_patch_turbo_change_notes12": "Vật phẩm bất diệt Fin King's Charm of Eminent Revival của Lion giờ ghi nhận đầy đủ khi hóa thú kẻ địch",
  "732e_patch_turbo_change_notes13": "Vật phẩm bất diệt Tormented Staff of Eminent Revival của Leshrac giờ ghi nhận đầy đủ khi gây choáng kẻ địch với Split Earth",
  "732e_patch_turbo_change_notes14": "Arcana của Legion Commander giờ tính số lần chiến thắng Duel",
  "732e_patch_turbo_change_notes15": "Tiến độ Arcana đã được cập nhật như sau:",
  "732e_bug_fixes_title": "Sửa lỗi",
  "732e_bug_fixes_notes1": "Sửa lỗi thông tin của các bản phát lại đã lưu không khớp với chi tiết trận đấu ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]vấn đề 349[/u][/url])",
  "732e_bug_fixes_notes2": "Sửa lỗi trong đó tướng đôi lúc thiếu mô hình/vật liệu/v.v. cho đến khi bạn kết nối lại vào trận đấu ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]vấn đề 6070[/u][/url])",
  "732e_bug_fixes_notes3": "Sửa lỗi đôi khi Refresher Orb không phải chờ hồi lại khi Refresher Shard được dùng ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]vấn đề 6668[/u][/url])",
  "732e_bug_fixes_notes4": "Sửa lỗi Tree Dance của Monkey King sẽ không thành công khi dùng ở tầm thi triển rất xa ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]vấn đề 717[/u][/url])",
  "732e_bug_fixes_notes5": "Sửa lỗi Lifestealer sẽ trượt đòn tấn công Infest đầu tiên lên kẻ địch nếu dùng ở các cự ly nhất định ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]vấn đề 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Đòn tấn công Jinada và Geminate giờ có thể thi triển khi bị phá nội tại, nhưng không thể khi bị khóa phép. Hành vi nay nhất quán với các kỹ năng tương tự khác trong trò chơi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]vấn đề 6779[/u][/url])",
  "732e_bug_fixes_notes7": "Sửa lỗi hiệu ứng hạt Snowball của Tusk sẽ không bị phá hủy nếu Snowball phóng không thành công ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]vấn đề 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Tướng không còn thể vận pháp Fiend's Gate khi ở bên trong Snowball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]vấn đề 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Tướng thi triển lên Snowball giờ bị trói chân cùng các trạng thái hiệu ứng trước đó. Điều này từng gây ra một số vấn đề hiệu ứng hạt khi một vài kỹ năng di chuyển được thi triển khi đang Snowball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]vấn đề 6805[/u][/url])",
  "732e_bug_fixes_notes10": "Sửa lỗi Illuminate ở Spirit Form của KotL không được lợi từ cường hóa hồi phục của KotL ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]vấn đề 2176[/u][/url])",
  "732e_bug_fixes_notes11": "Sửa lỗi Pulverize của Primal Beast có thể thi thoảng khiến tướng bị kẹt vĩnh viễn với Primal Beast nếu hóa giải loại mạnh xảy ra trên chuyển động chiều dọc từ một phép khác như Earth Spike của Lion ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]vấn đề 3528[/u][/url])",
  "732e_bug_fixes_notes12": "Sửa mẹo công cụ Ice Shards của Tusk và God's Strength của Sven không hiện giá trị thời gian hồi đã giảm nếu đã chọn tiềm năng phù hợp. Đây chỉ là thay đổi về chữ ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]vấn đề 575[/u][/url])",
  "732e_bug_fixes_notes13": "Sửa thiếu mất báo hiệu thời gian hồi cho kỹ năng có lượt dùng, bao gồm kỹ năng chỉ có lượt dùng khi lên tiềm năng hay nâng cấp Aghanim tương ứng ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]vấn đề 315[/u][/url])",
  "732e_bug_fixes_notes14": "Sửa hồi phục Spirit Vessel không được tính vào chỉ số hồi phục tại bảng tổng kết sau trận đấu ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]vấn đề 213[/u][/url])",
  "732e_bug_fixes_notes15": "Sửa thiếu mất hiệu ứng hạt và âm thanh Scream of Pain của Queen of Pain khi dùng mà không có mục tiêu nào trong cự ly ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]vấn đề 5429[/u][/url])",
  "732e_bug_fixes_notes16": "Vai trò trong trận đấu được hiện đúng cho người chơi bị mất kết nối vào đầu trận.",
  "732e_bug_fixes_notes17": "Sửa Heavenly Grace của Omniknight bị tắt bởi phá nội tại. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]vấn đề 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Sửa lỗi Troll Warlord có thể ghi đè ép bắt buộc tấn công từ Battle Trance bằng cách ra lệnh dùng Whirling Axes (Tầm xa) ở ngoài cự ly thi triển. Giờ đây, hành động này sẽ thi triển Whirling Axes (Tầm xa) theo hướng đó.",
  "732e_bug_fixes_notes19": "Sửa một số trường hợp tin nhắn trò chuyện như mất kết nối và kết nối lại không được hiện nếu người chơi bị tắt tiếng.",
  "732e_bug_fixes_notes20": "Thêm \"trong các trận thắng\" vào mô tả ngọc để mở khóa kiểu dáng Arcana thứ hai cho Queen of Pain và Faceless Void. Đây chỉ là thay đổi về chữ; thắng trận luôn là yêu cầu cần để mở tiến độ Arcana cho hai tướng này.",
  "732e_bug_fixes_notes21": "Thêm một số thông tin bổ sung vào mẹo công cụ cho Glyph of Fortification ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]vấn đề 6786[/u][/url])",
  "732e_bug_fixes_notes22": "Với các kỹ năng có thể chọn mục tiêu bất khả xâm phạm và hóa giải một vài trạng thái bất khả xâm phạm (ví dụ như bị lốc Cyclone), thêm ALT + mẹo công cụ để làm rõ rằng chúng có thể chọn mục tiêu bất khả xâm phạm.",
  "732e_bug_fixes_notes23": "Cập nhật mẹo công cụ cho một số kỹ năng sau:",
  "732e_bug_fixes_notes24": "Nightmare (Bane)",
  "732e_bug_fixes_notes25": "Boar Poison (Beastmaster)",
  "732e_bug_fixes_notes26": "Wild Axes (Beastmaster)",
  "732e_bug_fixes_notes27": "Dispel Magic (Brewmaster - Brewling bão tố)",
  "732e_bug_fixes_notes28": "Poison Sting (Broodmother - Nhện con)",
  "732e_bug_fixes_notes29": "Ice Spire (Lich)",
  "732e_bug_fixes_notes30": "Purge (Cung thủ Necronomicon)",
  "732e_bug_fixes_notes31": "Nullify (vật phẩm Nullifier)",
  "732e_bug_fixes_notes32": "Fortune's End (Oracle)",
  "732e_bug_fixes_notes33": "Purge (Quái Satyr Trickster)",
  "732e_bug_fixes_notes34": "Demonic Cleanse (Shadow Demon)",
  "732e_bug_fixes_notes35": "Demonic Purge (Shadow Demon)",
  "732e_bug_fixes_notes36": "Storm Hammer (Sven)",
  "732e_bug_fixes_notes37": "Pit of Malice (Underlord)",
  "732e_bug_fixes_notes38": "Vật phẩm Collector's Cache 2 giờ có thể gửi làm quà sau khi mở gói, cho tương xứng với khả năng gói quà của Collector's Cache 1",
  "732e_bug_fixes_notes39": "Giao diện nâng cấp tiềm năng giờ có thể gán phím qua mục 'Phím tắt nâng cao'",
  "732e_bug_fixes_notes40": "Tắt khả năng tham gia hệ thống tìm trận khi bật nhãn -dev. Việc đó dẫn tới các công cụ bên thứ ba lạm dụng chỉnh sửa giao diện không đúng quy cách.",
  "732e_bug_fixes_notes41": "Tắt một vài phương thức khác để truy cập hồ sơ của người chơi trong giai đoạn chọn tướng.",
  "732e_bug_fixes_notes42": "Nhấn vào kẻ địch trên hàng đỉnh đầu trong trận đấu sẽ hiện lần cuối nhìn thấy / trạng thái kho đồ"
}