// 840.js

{
  "language": "ukrainian",
  "muerta_title": "Оновлення «Смертельна відплата»",
  "muerta_title_pre": " ",
  "muerta_title_post": "Оновлення",
  "muerta_title_date": "6 березня — 4 квітня 2023 року",
  "muerta_play_trailer": "Дивитися трейлер",
  "new_hero_tag": "Нова героїня",
  "muerta_name": "Муерта",
  "muerta_navigation_intro": "Героїня",
  "muerta_navigation_event": "Міні-гра",
  "muerta_navigation_janitor": "Особливості",
  "muerta_navigation_gameplay": "Ігроладне оновлення",
  "muerta_role1": "Лідер",
  "muerta_role2": "Дальній бій",
  "muerta_role3": "Нападник",
  "muerta_role4": "Знерухомлювач",
  "muerta_intro": "Через страхітливі рикошети, прикликаних духів та запасні пістолети вміння Муерти відбирати життя вражає так, що її найняла на роботу сама Смерть. Двопістольний рушій меткої помсти, Муерта супроводить норовливі душі на інший бік незалежно від того, бажають вони цього чи ні. І якщо їм потрібно більше переконливості, то вона готова розкрити свою істинну форму — смертоносного примарного жаху, який допоможе померти трішки швидше.",
  "muerta_ability1_title": "Постріл Смерті",
  "muerta_ability1_desc": "Муерта стріляє примарною кулею у ворога чи дерево. Коли куля влучає, то завдає шкоду й ненадовго сповільнює, а потім рикошетить за напрямком прицілювання. Рикошет ушкоджує всіх істот, крізь яких проходить, і зупиняється після влучання в героя. Герой, у якого потрапляє рикошет, лякається й тікає в напрямку пострілу.",
  "muerta_ability2_title": "Поклик",
  "muerta_ability2_desc": "Прикликає групу примар, які повільно оточують цільове місце. Швидкість руху та атаки ворогів у цій зоні сповільнюється. Примари завдають шкоди та приголомшують ворогів, якщо ті проходять крізь них.",
  "muerta_ability3_title": "Стрілець",
  "muerta_ability3_desc": "Атаки Муерти можуть додатково вистрілити в іншу ціль із пріоритетом на героїв.",
  "muerta_ability4_title": "Крізь Вуаль",
  "muerta_ability4_desc": "Муерта трансформується і стає невразливою для фізичної шкоди. Уся шкода від її атак стає магічною. Муерта отримує додаткову шкоду від атак і може проходити крізь істот. Також може атакувати ефірних істот, але не завдає шкоду цілям з імунітетом до магії.",
  "muerta_heroes_title": "Щоби дізнатися більше про Муерту,",
  "muerta_heroes_btn": "Перейти на сторінку героя",
  "muerta_wallpaper": "Тло",
  "muerta_minigame_title_pre": " ",
  "muerta_minigame_title": "Міні-гра",
  "muerta_minigame_subtitle": "ШВИДКА ТА МЕРТВА…",
  "muerta_minigame_subtitle2": "Муерті потрібна допомога, щоби доправити правильні ще теплі тіла до належних свіжих могил… І ось з’являєтеся ви! Ви отримуватимете призначену ціль перед початком кожної гри в Dota впродовж події «Смертельна відплата». Заробляйте очки за вбивства й підмоги. Однак стережіться, адже супротивник теж жадає вашої крові, а хто заробить більше очок — отримає подвійну нагороду!",
  "muerta_minigame_rules_title": "Квітки",
  "muerta_minigame_rules_desc": "Здобувайте вбивства й підмоги на призначеній вам цілі, щоби заробити очки та здобути <b>квітки</b> Муерти. Заробіть більше очок, ніж ваша ціль, щоби збільшити свою нагороду.",
  "muerta_minigame_rules_title2": "Скарбниця",
  "muerta_minigame_rules_desc2": "Обмінюйте квітки на <b>Скрині смертельної відплати</b>, що заповнені цілковито новими наборами предметів, включно з тематичними для цієї події.",
  "muerta_minigame_rules_title3": "Ключі",
  "muerta_minigame_rules_desc3": "Купуйте <b>Ключ смертельної відплати</b> для розблокування скрині й отримання схованої всередині нагороди. Ключі доступні за %1$s або 20 000 уламків у крамниці уламків.",
  "muerta_treasure_title": "Скриня смертельної відплати",
  "muerta_treasure_content_desc": "Збирайте більше квіток для збільшення шансів розблокувати ці тематичні набори предметів «Смертельної відплати». Муерта дала кожному п’ять ключів для початку святкування, однак ви можете дістати скільки вам потрібно за допомогою уламків чи крамниці Dota.",
  "muerta_minigame_treasure_name1": "Спектральний мисливець",
  "muerta_minigame_treasure_name2": "Згасаюче світло",
  "muerta_minigame_treasure_name3": "Вівтарний м’яч",
  "muerta_minigame_treasure_name4": "Смертельна спека",
  "muerta_minigame_treasure_name5": "Смертельна змія",
  "muerta_minigame_treasure_name6": "Іграшка мерців",
  "muerta_minigame_treasure_name7": "Покійна рушниця",
  "muerta_minigame_treasure_name8": "Гадюка душ",
  "janitors_corner_title": "Нові особливості",
  "732e_patch_dotaplus_advancedstats_title": "Розширена бойова статистика",
  "732e_patch_dotaplus_advancedstats_subtitle": "Зануртеся в дані своєї історії в Dota",
  "732e_patch_dotaplus_advancedstats_desc": "Покращуйте й аналізуйте свою гру за допомогою розширеної бойової статистики просто у вашому профілі. Підписники Dota Plus тепер мають доступ до цілковито переробленої ігрової аналітики в реальному часі. Зануртеся глибше у свій стиль гри, сортуючи всю історію ігор у Dota за героєм, роллю, ігровим режимом тощо.",
  "732e_patch_dotaplus_advancedstats_desc2": "Фокусуєтеся на останніх ударах? Ваша група статистики кріпів допоможе вам. Покращуєте навички підтримки? Статистика підтримки тепер показує більше, ніж вартовий вард.",
  "732e_patch_quickkeys_title": "Персоналізоване швидке чаклування",
  "732e_patch_quickkeys_subtitle": "Точний і зручний контроль",
  "732e_patch_quickkeys_desc": "Гравці, що використовують швидке чаклування, тепер можуть індивідуально призначати, які здібності істот і предметів активуються натисканням кнопки, а які — відпусканням. Перевірте це, обравши «Індивідуальні клавіші» та «Швидке застосування» для здібностей і предметів на вкладці гарячих клавіш у меню налаштувань.",
  "732e_patch_friendslist_title": "Покращення списку друзів",
  "732e_patch_friendslist_subtitle": "Віддайте належне своїм найкращим друзям у Dota",
  "732e_patch_friendslist_desc": "Тепер ви можете давати позначку «Улюблені» людям, із якими найбільше граєте, щоби вони завжди були вгорі вашого списку друзів. Сортуйте друзів за порядком: «Улюблені», «У грі», «У мережі», «Не в мережі». Чи використовуйте нову функцію пошуку друзів, щоби знайти тих, кого шукаєте.",
  "732e_patch_title": "Ігроладне оновлення",
  "732e_patch_subtitle": "7.32E І ЩЕ ДЕЩО",
  "732e_patch_turbo_title": "Зміни турбо-режиму",
  "732e_patch_turbo_intro": "Оскільки популярність турбо-режиму зростає, ми намагаємося зробити все можливе для задоволення цієї групи гравців. Стежте за подальшими змінами, адже ми продовжуємо покращувати загальний ігровий досвід.",
  "732e_patch_turbo_change_notes1": "Усі герої тепер обираються наосліп.",
  "732e_patch_turbo_change_notes2": "Прибрано штрафний етап під час вибору героїв. Після завершення часу вибору для будь-кого, хто не вибрав героя, обирається той герой, на якого гравець клацнув перед цим. Якщо цей герой недоступний або гравець ні на кого не клацав, то він отримає випадкового героя.",
  "732e_patch_turbo_change_notes3": "Талісман ануляції (Null Talisman), Примарна маска (Wraith Band) та Наручень (Bracer) подвоюватимуть свої бонуси на 12-й хвилині, а не на 25-й.",
  "732e_patch_turbo_change_notes4": "Вилучено додаткову шкоду вежам від усіх прикликаних істот. Неприкликані істоти (лінійні кріпи, задоміновані кріпи) все ще сильніші проти веж у порівнянні з іншими режимами.",
  "732e_patch_turbo_change_notes5": "Тепер ви можете заробляти дві зірки за випробування героя замість однієї.",
  "732e_patch_turbo_change_notes6": "Таємний предмет «Спадок клинка» (Bladeform Legacy) для Джаґернаута тепер повністю враховує вбивства від Точкових ударів.",
  "732e_patch_turbo_change_notes7": "Таємний предмет «Планетопад» (Earthshaker) для Землетруса тепер повністю враховує вбивства й підмоги від Сейсмічного удару. Також увімкнено відстеження поєднання здібностей і шкоди від комбінацій.",
  "732e_patch_turbo_change_notes8": "Нетлінний предмет «Залишки темного мистецтва» (Dark Artistry Throwback) для Заклинача тепер повністю враховує вбивства від Сонячного удару.",
  "732e_patch_turbo_change_notes9": "Нетлінний предмет «Котел Ксарикса видатного відродження» (Cauldron of Xahryx of Eminent Revival) для Самітного Друїда тепер повністю враховує тривалість Обплітальних пазурів.",
  "732e_patch_turbo_change_notes10": "Нетлінний предмет «Клинок кита-левіафана видатного відродження» (Leviathan Whale Blade of Eminent Revival) для Кунки тепер повністю враховує влучання в героїв Струменем.",
  "732e_patch_turbo_change_notes11": "Нетлінний предмет «Грозова орхідея видатного відродження» (The Lightning Orchid of Eminent Revival) для Штормового Духа тепер повністю враховує шкоду від Кульової блискавки.",
  "732e_patch_turbo_change_notes12": "Нетлінний предмет «Чар-патик Риб’ячого Короля видатного відродження» (Fin King's Charm of Eminent Revival) для Лайона тепер повністю враховує обернених ворогів.",
  "732e_patch_turbo_change_notes13": "Нетлінний предмет «Катувальний посох видатного відродження» (Tormented Staff of Eminent Revival) для Лешрака тепер повністю враховує приголомшених Розколом землі ворогів.",
  "732e_patch_turbo_change_notes14": "Таємний предмет для Командувачки Легіоном тепер ураховує перемоги в дуелях.",
  "732e_patch_turbo_change_notes15": "Оновлено просування для таких таємних предметів:",
  "732e_bug_fixes_title": "Виправлення помилок",
  "732e_bug_fixes_notes1": "Виправлено помилку, через яку збережені повтори не містили правильної інформації про матчі ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]№349 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes2": "Виправлено помилку, через яку в героїв іноді зникали їхні моделі, матеріали тощо й доводилося повторно підключатися до гри ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]№6070 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes3": "Виправлено помилку, через яку Сфера відновлення іноді не починала заряджатися після використання Уламка відновлення ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]№6668 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes4": "Виправлено помилку, через яку Танок між дерев Мавпячого Короля іноді не застосовувався на дальню відстань ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]№717 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes5": "Виправлено помилку, через яку Життєкрад міг схибити першою атакою Паразитування на ворогів, якщо чаклував із певних відстаней ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]№6801 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes6": "Цінада та Подвійна атака тепер застосовуються під час переривання, але не під час знемовлення. Їхня поведінка тепер узгоджена з іншими подібними здібностями в грі ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]№6779 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes7": "Виправлено помилку, через яку ефект часток Сніжної кулі Бивня не зникав, якщо куля не починала котитися ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]№6805 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes8": "Герої більше не можуть чаклувати Потойбічні врата всередині Сніжної кулі ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]№6670 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes9": "Герої, що чаклують Сніжну кулю, тепер вкорінюються на додачу до попередніх ефектів статусу. Це викликало деякі проблеми з ефектами часток у разі чаклування здібностей, що впливають на рух, під час дії Сніжної кулі ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]№6805 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes10": "Виправлено помилку, через яку лікування союзників Освітленням Хранителя Світла в Духовній формі не збільшувалося посиленням лікування в героя ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]№2176 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes11": "Виправлено помилку, через яку Подрібнення від Первісного Звіра могло назавжди причепити героїв до Первісного Звіра, якщо під час вертикального руху застосовувалося сильне розвіювання від інших чарів, як-от від Земляних шипів Лайона ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]№3528 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes12": "Виправлено помилку, через яку підказки до Льодяних брил у Бивня та Могутності бога у Свена не показували зменшені значення зарядки після вибору відповідних талантів. Ця зміна стосується лише тексту ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]№575 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes13": "Виправлено помилку, через яку були відсутні позначки для здібностей із зарядами, включно зі здібностями, які отримують заряди від відповідних талантів чи аґанімних покращень ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]№315 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes14": "Виправлено помилку, через яку лікування від Чаші душ не враховувалося на післяматчевому екрані ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]№213 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes15": "Виправлено помилку, через яку зникали ефекти часток і звуки, якщо Крик болю від Королеви Болю чаклувався без цілей у зоні дії ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]№5429 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes16": "Внутрішньоігрові ролі тепер правильно показуються для гравців, що відключилися на початку матчу.",
  "732e_bug_fixes_notes17": "Виправлено помилку, через яку Небесна милість у Вселицаря скасовувалася перериванням ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]№1649 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes18": "Виправлено помилку, через яку Троль-Воєвода міг замістити примусову атаку Бойового трансу чаклуванням дальнього Виру сокир за межами максимальної дальності чаклування. Таке чаклування тепер спричинятиме звичайний дальній Вир сокир у відповідному напрямку.",
  "732e_bug_fixes_notes19": "Виправлено ситуацію, коли деякі повідомлення чату, як-от про підключення чи відключення, не показувалися для заглушених гравців.",
  "732e_bug_fixes_notes20": "Додано «в переможних іграх» до опису самоцвітів розблоковуваних другорядних стилів для таємних предметів Королеви Болю й Безликого. Це суто текстова зміна (для просування завжди були необхідні перемоги).",
  "732e_bug_fixes_notes21": "Додано більше інформації в підказку до гліфу фортифікації ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]№6786 на GitHub[/u][/url]).",
  "732e_bug_fixes_notes22": "Для здібностей, які можуть діяти на невразливі цілі й розвіювати деякі невразливі стани (як-от від Циклону), додано підказки з інформацією про можливість цілитися на невразливих істот (для показу утримуйте клавішу Alt).",
  "732e_bug_fixes_notes23": "Оновлено підказки для таких здібностей:",
  "732e_bug_fixes_notes24": "Страшний сон (Nightmare) Губителя",
  "732e_bug_fixes_notes25": "Отрута (Poison) кнура Звіромайстра",
  "732e_bug_fixes_notes26": "Дикі сокири (Wild Axes) Звіромайстра",
  "732e_bug_fixes_notes27": "Розвіяння чарів (Dispel Magic) воїна Шторму в Хмелемайстра",
  "732e_bug_fixes_notes28": "Отруйне жало (Poison Sting) павученят Павучихи",
  "732e_bug_fixes_notes29": "Льодяне вістря (Ice Spire) Ліча",
  "732e_bug_fixes_notes30": "Очищення (Purge) лучника Некрономікона",
  "732e_bug_fixes_notes31": "Ануляція (Nullify) Анулятора",
  "732e_bug_fixes_notes32": "Примха фортуни (Fortune's End) Оракула",
  "732e_bug_fixes_notes33": "Очищення (Purge) сатира-проклинача",
  "732e_bug_fixes_notes34": "Демонічне вичищення (Demonic Cleanse) Тінистого Демона",
  "732e_bug_fixes_notes35": "Демонічне очищення (Demonic Purge) Тінистого Демона",
  "732e_bug_fixes_notes36": "Молот бурі (Storm Hammer) Свена",
  "732e_bug_fixes_notes37": "Вирва злості (Pit of Malice) Підземного Лорда",
  "732e_bug_fixes_notes38": "Предмети Схованки колекціонера II тепер можна дарувати після розпакування, як це було в Схованці колекціонера I.",
  "732e_bug_fixes_notes39": "Покращення талантів тепер можна призначити на потрібні клавіші в розширених налаштуваннях клавіш.",
  "732e_bug_fixes_notes40": "Вимкнено можливість приєднуватися до пошуку матчів з увімкненим параметром -dev. Це дозволяло стороннім інструментам змінювати елементи інтерфейсу з метою зловживань.",
  "732e_bug_fixes_notes41": "Вимкнено деякі інші способи отримати доступ до чужого профілю під час етапу вибору героїв.",
  "732e_bug_fixes_notes42": "Клацання на ворога у верхньому меню під час матчу покаже його останнє побачене розташування та стан інвентарю."
}