// 2555.js

{
  "language": "portuguese",
  "muerta_title": "Atualização Dead Reckoning",
  "muerta_title_pre": "Atualização",
  "muerta_title_post": " ",
  "muerta_title_date": "6 de março de 2023 - 4 de abril de 2023",
  "muerta_play_trailer": "Ver trailer",
  "new_hero_tag": "Nova heroína",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Heroína",
  "muerta_navigation_event": "Minijogo",
  "muerta_navigation_janitor": "Funcionalidades",
  "muerta_navigation_gameplay": "Atualização de jogabilidade",
  "muerta_role1": "Carry",
  "muerta_role2": "Ranged",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "Com os seus disparos temíveis, espíritos invocados e uma pistola de reserva, Muerta é tão eficiente a reclamar vidas que a própria Morte decidiu contratá-la. Munida de duas pistolas mortíferas e de uma sede de vingança certeira, Muerta guia as almas penadas para o além, quer queiram quer não. E se for preciso convencê-las, ela está pronta a revelar a sua verdadeira natureza, um pesadelo espectral terrível, se isso as ajudar a morrer um pouco mais depressa.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta dispara um projétil fantasmagórico contra uma unidade inimiga ou uma árvore. Quando a bala atinge o alvo, causa dano e abrandamento por breves momentos, fazendo ricochete na direção selecionada. O ricochete causa dano a todas as unidades que a bala atravessar e é interrompido assim que a bala atingir um herói. Heróis atingidos pelo ricochete irão correr na direção da bala.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Invoca um grupo de fantasmas que circundam lentamente o local selecionado. Inimigos na área serão abrandados e ficarão com menos rapidez de ataque. Os fantasmas causam dano e silenciam ao atravessar inimigos.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Os ataques de Muerta têm uma probabilidade de disparar uma segunda bala contra outro alvo, sendo dada prioridade a heróis.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta transforma-se e torna-se imune a dano físico. Todo o dano dos seus ataques passa a ser dano mágico. Muerta ganha um bónus de dano de ataque e pode deslocar-se através de unidades e obstáculos. Muerta pode atacar unidades etéreas, mas não causa dano a alvos imunes a magia.",
  "muerta_heroes_title": "Para mais detalhes sobre a Muerta...",
  "muerta_heroes_btn": "Ver página de detalhes da heroína",
  "muerta_wallpaper": "Fundos de ecrã",
  "muerta_minigame_title_pre": "O minijogo",
  "muerta_minigame_title": "Minijogo",
  "muerta_minigame_subtitle": "RÁPIDA E MORTAL…",
  "muerta_minigame_subtitle2": "Muerta precisa de ajuda a levar os cadáveres certos para as sepulturas certas... e é aí que tu entras! Durante o evento \"Dead Reckoning\", ser‑te‑á atribuído um alvo no início de cada partida de Dota. Ganhas pontos ao matares ou ao ajudares a matar o teu alvo, mas tem cuidado! O teu adversário também te vai considerar um alvo e quem conseguir mais pontos recebe o dobro da recompensa!",
  "muerta_minigame_rules_title": "Flores",
  "muerta_minigame_rules_desc": "Mata ou ajuda a matar o teu alvo para ganhares pontos e receberes <b>Flores</b> da Muerta. Se obtiveres mais pontos do que o teu alvo, receberás ainda mais Flores.",
  "muerta_minigame_rules_title2": "Tesouro",
  "muerta_minigame_rules_desc2": "Troca as Flores por <b>Baús Dead Reckoning</b>, que estão repletos de conjuntos totalmente novos e temáticos do evento.",
  "muerta_minigame_rules_title3": "Chaves",
  "muerta_minigame_rules_desc3": "Compra uma <b>Chave do Baú Dead Reckoning</b> para abrires o baú e obteres a recompensa no seu interior. Cada chave está disponível por 20 000 Fragmentos na Loja de Fragmentos ou por %1$s.",
  "muerta_treasure_title": "Baú Dead Reckoning",
  "muerta_treasure_content_desc": "Quantas mais Flores juntares, mais oportunidades terás de obter os conjuntos temáticos do evento Dead Reckoning. Para dar início às festividades, Muerta deu cinco chaves a todos os jogadores. Adquire mais chaves com Fragmentos ou na Loja do Dota.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "Novas funcionalidades",
  "732e_patch_dotaplus_advancedstats_title": "Estatísticas de batalha avançadas",
  "732e_patch_dotaplus_advancedstats_subtitle": "Mergulha nos dados do teu histórico do Dota",
  "732e_patch_dotaplus_advancedstats_desc": "Eleva e avalia as tuas jogadas com as estatísticas de batalha avançadas, diretamente no teu perfil. Agora, os membros do Dota Plus têm acesso a estatísticas de jogabilidade totalmente reformuladas e em tempo real. Aprofunda o teu estilo de jogo ao ordenares todo o teu histórico de partidas por herói, cargo, modo de jogo e muito mais.",
  "732e_patch_dotaplus_advancedstats_desc2": "Pretendes especializar‑te em golpes finais? O grupo de estatísticas de creeps tem os dados ideais para ti. Queres saber o quanto ajudas nas partidas? As estatísticas de apoio agora são mais reveladoras do que uma Sentry Ward.",
  "732e_patch_quickkeys_title": "Uso rápido personalizável",
  "732e_patch_quickkeys_subtitle": "Um controlo mais preciso nas pontas dos teus dedos",
  "732e_patch_quickkeys_desc": "Utilizadores do modo de uso rápido podem agora definir o tipo de ativação das habilidades de cada unidade e de cada item (ativar ao pressionar ou ao largar uma tecla). Acede à secção de atalhos no menu de definições e experimenta selecionar \"Atalhos específicos de unidades\" e \"Ativar uso rápido\" de habilidades e itens.",
  "732e_patch_friendslist_title": "Melhoramentos à lista de amigos",
  "732e_patch_friendslist_subtitle": "Dá aos teus melhores amigos no Dota o tratamento que merecem",
  "732e_patch_friendslist_desc": "Com a funcionalidade de Favoritos, podes agora marcar as pessoas com quem mais jogas para que fiquem no topo da tua lista de amigos e em destaque nas categorias \"A jogar Dota\", \"Online\" e \"Offline\". Além disso, também podes usar a nova funcionalidade de procura de amigos para encontrares exatamente quem procuras.",
  "732e_patch_title": "Atualização de jogabilidade",
  "732e_patch_subtitle": "7.32E E MUITO MAIS",
  "732e_patch_turbo_title": "Alterações ao Modo Turbo",
  "732e_patch_turbo_intro": "Com o Modo Turbo a tornar-se cada vez mais popular, queremos garantir que estamos a fazer todos os possíveis pelos jogadores que o jogam. Fica de olho em mais alterações no futuro, pois continuaremos a melhorar a experiência de jogo.",
  "732e_patch_turbo_change_notes1": "Todas as seleções de heróis estarão agora ocultas.",
  "732e_patch_turbo_change_notes2": "Foi removida a fase de penalidade durante a seleção de heróis. Quando o período de seleção chega ao fim, qualquer jogador que não tenha selecionado um herói será obrigado a selecionar a escolha provisória. Caso esse herói não esteja disponível ou não haja uma escolha provisória, será atribuído um herói aleatório ao jogador.",
  "732e_patch_turbo_change_notes3": "Null Talisman, Wraith Band e Bracer terão o dobro dos bónus após o 12.º minuto da partida em vez do 25.º minuto.",
  "732e_patch_turbo_change_notes4": "Foi removido o bónus de dano a torres de todas as unidades invocadas. Unidades não invocadas (como creeps das lanes e creeps dominados) continuam a ser mais fortes contra torres em comparação com partidas que não sejam no Modo Turbo.",
  "732e_patch_turbo_change_notes5": "Agora, podes ganhar duas estrelas em desafios de heróis em vez de apenas uma.",
  "732e_patch_turbo_change_notes6": "O item Arcano \"Bladeform Legacy\" do Juggernaut agora regista na totalidade mortes causadas com Omnislash.",
  "732e_patch_turbo_change_notes7": "O item Arcano \"Planetfall\" do Earthshaker agora regista na totalidade mortes causadas e assistências com Echo Slam. A contagem de combos e dano de combos no Modo Turbo agora também fica em registo.",
  "732e_patch_turbo_change_notes8": "O conjunto Imortal \"Dark Artistry Throwback\" do Invoker agora regista na totalidade mortes causadas com Sun Strike.",
  "732e_patch_turbo_change_notes9": "O item Imortal \"Cauldron of Xahryx of Eminent Revival\" do Lone Druid agora regista na totalidade a duração de Entangling Claws.",
  "732e_patch_turbo_change_notes10": "O item Imortal \"Leviathan Whale Blade of Eminent Revival\" do Kunkka agora regista na totalidade o número de heróis atingidos por Torrent.",
  "732e_patch_turbo_change_notes11": "O item Imortal \"The Lightning Orchid of Eminent Revival\" do Storm Spirit agora regista na totalidade a quantidade de dano causado com Ball Lightning.",
  "732e_patch_turbo_change_notes12": "O item Imortal \"Fin King's Charm of Eminent Revival\" do Lion agora regista na totalidade a duração de Hex.",
  "732e_patch_turbo_change_notes13": "O item Imortal \"Tormented Staff of Eminent Revival\" do Leshrac agora regista na totalidade o número de heróis atordoados por Split Earth.",
  "732e_patch_turbo_change_notes14": "O item Arcano \"Blades of Voth Domosh\" da Legion Commander agora regista vitórias em duelos.",
  "732e_patch_turbo_change_notes15": "O progresso em itens Arcanos foi atualizado nos seguintes casos:",
  "732e_bug_fixes_title": "Correções de bugs",
  "732e_bug_fixes_notes1": "Foi corrigido um bug que fazia com que repetições guardadas não contivessem os detalhes das partidas ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]problema 349[/u][/url]).",
  "732e_bug_fixes_notes2": "Foi corrigido um bug ocasional que fazia com que heróis não tivessem modelos, materiais, entre outros, sendo necessário sair e voltar a entrar na partida ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]problema 6070[/u][/url]).",
  "732e_bug_fixes_notes3": "Foi corrigido um bug ocasional que fazia com que o item Refresher Orb não entrasse em cooldown após o uso do item Refresher Shard ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]problema 6668[/u][/url]).",
  "732e_bug_fixes_notes4": "Foi corrigido um bug que impedia a utilização da habilidade Tree Dance, do Monkey King, se tivesse um alcance de uso muito longo ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]problema 717[/u][/url]).",
  "732e_bug_fixes_notes5": "Foi corrigido um bug que fazia com que o Lifestealer falhasse o seu primeiro ataque de Infest contra inimigos se a habilidade fosse usada a partir de certas distâncias ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]problema 6801[/u][/url]).",
  "732e_bug_fixes_notes6": "Ataques de Jinada e Geminate podem agora ser usados enquanto sob o efeito de habilidades desativadas (Break) mas não enquanto o utilizador estiver silenciado. Este comportamento é agora consistente com outras habilidades semelhantes no jogo ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]problema 6779[/u][/url]).",
  "732e_bug_fixes_notes7": "Foi corrigido um bug que fazia com que o efeito de partículas da habilidade Snowball do Tusk não fosse destruído se a bola de neve não fosse lançada ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problema 6805[/u][/url]).",
  "732e_bug_fixes_notes8": "Heróis já não podem concentrar Fiend's Gate enquanto estiverem dentro de uma bola de neve (Snowball) do Tusk ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]problema 6670[/u][/url]).",
  "732e_bug_fixes_notes9": "Heróis que usarem a habilidade Snowball recebem agora o efeito de ficar presos ao chão para além dos outros debuffs. Esta alteração corrige alguns problemas de efeitos de partículas que ocorriam quando certas habilidades relacionadas com deslocação eram utilizadas durante o uso de Snowball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problema 6805[/u][/url]).",
  "732e_bug_fixes_notes10": "Foi corrigido um bug que fazia com que a cura em aliados da habilidade Illuminate do Keeper of the Light durante Spirit Form não fosse amplificada por bónus de amplificação de cura no Keeper of the Light ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]problema 2176[/u][/url]).",
  "732e_bug_fixes_notes11": "Foi corrigido um bug ocasional que fazia com que a habilidade Pulverize, do Primal Beast, prendesse heróis ao Primal Beast por tempo indeterminado se uma dissipação forte ocorresse durante a moção vertical de outra habilidade, como Earth Spike do Lion ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]problema 3528[/u][/url]).",
  "732e_bug_fixes_notes12": "As descrições das habilidades Ice Shards (do Tusk) e God's Strength (do Sven) foram corrigidas para que os valores de cooldown sejam atualizados no caso de os talentos de redução de cooldowns serem escolhidos. Esta é só uma alteração a nível de texto ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]problema 575[/u][/url]).",
  "732e_bug_fixes_notes13": "Foram adicionados indicadores de cooldown em falta a habilidades à base de cargas, incluindo habilidades que só têm cargas devido a um talento correspondente ou ao item Aghanim's Scepter/Shard ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]problema 315[/u][/url]).",
  "732e_bug_fixes_notes14": "Foi corrigido um problema com a cura do item Spirit Vessel, que não se refletia na estatística de cura no ecrã pós‑partida ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]problema 213[/u][/url]).",
  "732e_bug_fixes_notes15": "Foi corrigido um bug que fazia com que a Queen of Pain perdesse efeitos sonoros e de partículas se a habilidade Scream of Pain fosse usada sem nenhum alvo dentro do alcance ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]problema 5429[/u][/url]).",
  "732e_bug_fixes_notes16": "Agora, os cargos de jogadores que se desconectarem no início da partida aparecem corretamente.",
  "732e_bug_fixes_notes17": "Foi corrigido um bug que fazia com que a habilidade Heavenly Grace, do Omniknight, fosse desativada se o herói estivesse sob o efeito de habilidades desativadas ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]problema 1649[/u][/url]).",
  "732e_bug_fixes_notes18": "Foi corrigido um bug que fazia com que o Troll Warlord pudesse ignorar a condição de ataques forçados da habilidade Battle Trance ao usar a habilidade Whirling Axes (Ranged) para além do alcance de uso. Utilizar a habilidade desta forma irá agora lançar os machados nessa direção.",
  "732e_bug_fixes_notes19": "Foram corrigidos alguns casos onde mensagens de chat sobre desconectar e reconectar não eram mostradas se o jogador tivesse sido silenciado.",
  "732e_bug_fixes_notes20": "Foi adicionado o texto \"___ em partidas vitoriosas\" a descrições de joias como requisito dos estilos secundários dos conjuntos Arcanos da Queen of Pain e do Faceless Void. Esta é só uma alteração a nível de texto; vitórias foram sempre necessárias para o progresso no conjunto Arcano destes dois heróis.",
  "732e_bug_fixes_notes21": "Foram adicionadas informações adicionais à descrição do Glifo de Fortificação ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]problema 6786[/u][/url]).",
  "732e_bug_fixes_notes22": "No caso de habilidades que podem ser usadas em unidades invulneráveis e dissipar certos estados invulneráveis (Cyclone, etc.), foram adicionadas descrições ativadas por ALT que especificam que podem ser usadas em unidades invulneráveis.",
  "732e_bug_fixes_notes23": "Foram atualizadas as descrições das seguintes habilidades:",
  "732e_bug_fixes_notes24": "Nightmare (Bane)",
  "732e_bug_fixes_notes25": "Poison (Boar do Beastmaster)",
  "732e_bug_fixes_notes26": "Wild Axes (Beastmaster)",
  "732e_bug_fixes_notes27": "Dispel Magic (guerreiro Storm do Brewmaster)",
  "732e_bug_fixes_notes28": "Poison Sting (Spiderling da Broodmother)",
  "732e_bug_fixes_notes29": "Ice Spire (Lich)",
  "732e_bug_fixes_notes30": "Purge (Necronomicon Archer)",
  "732e_bug_fixes_notes31": "Nullify (Nullifier)",
  "732e_bug_fixes_notes32": "Fortune's End (Oracle)",
  "732e_bug_fixes_notes33": "Purge (Satyr Banisher)",
  "732e_bug_fixes_notes34": "Demonic Cleanse (Shadow Demon)",
  "732e_bug_fixes_notes35": "Demonic Purge (Shadow Demon)",
  "732e_bug_fixes_notes36": "Storm Hammer (Sven)",
  "732e_bug_fixes_notes37": "Pit of Malice (Underlord)",
  "732e_bug_fixes_notes38": "Itens da Collector's Cache 2 podem agora ser presenteados depois de estreados, como acontece com itens da Collector's Cache 1.",
  "732e_bug_fixes_notes39": "É agora possível designar teclas para as várias opções da interface de talentos no menu de atalhos avançados.",
  "732e_bug_fixes_notes40": "Já não é possível entrar em partidas criadas via matchmaking se o jogo for iniciado com a opção de arranque \"-dev\", por permitir que ferramentas externas modifiquem elementos da interface de forma prejudicial.",
  "732e_bug_fixes_notes41": "Foram desativados alguns métodos adicionais de acesso ao perfil dos jogadores durante a fase de escolha de heróis.",
  "732e_bug_fixes_notes42": "Agora, ao clicar no retrato de um herói inimigo na barra superior durante uma partida, é indicado o local e o estado do inventário de quando esse herói foi visto pela última vez."
}