// 168.js

{
  "language": "spanish",
  "muerta_title": "La actualización del Juicio Mortal",
  "muerta_title_pre": "Actualización:",
  "muerta_title_post": " ",
  "muerta_title_date": "Del 6 de marzo al 4 de abril de 2023",
  "muerta_play_trailer": "Ver tráiler",
  "new_hero_tag": "Nueva heroína",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Heroína",
  "muerta_navigation_event": "Minijuego",
  "muerta_navigation_janitor": "Características",
  "muerta_navigation_gameplay": "Actualización",
  "muerta_role1": "Carry",
  "muerta_role2": "A distancia",
  "muerta_role3": "Nuker",
  "muerta_role4": "Incapacitador",
  "muerta_intro": "Con sus temibles y engañosos disparos, espíritus invocados y un arma de repuesto, la destreza de Muerta para llevarse vidas por delante era tan impresionante que la propia Muerte la contrató. Vengativa, impasible y fiel a sus dos pistolas, Muerta se lleva almas al más allá, tanto si quieren ir como si no. Y, cuando necesita ser más convincente, no tiene más que revelar su verdadera identidad de pesadilla espectral asesina para ayudarlas a morir un poco más rápido.",
  "muerta_ability1_title": "Disparo Mortal",
  "muerta_ability1_desc": "Muerta dispara a una unidad enemiga o a un árbol con un tiro fantasmal que rebota. La bala inflige daño al impactar, ralentiza brevemente y luego rebota en la dirección objetivo. El rebote daña a todas las unidades que atraviesa y se detiene al impactar en un héroe. Los héroes alcanzados por el rebote corren en la dirección del disparo.",
  "muerta_ability2_title": "La Invocación",
  "muerta_ability2_desc": "Invoca a un grupo de apariciones que rodean lentamente el lugar elegido. Los enemigos que se encuentren dentro del área se ralentizan y su velocidad de ataque disminuye. Las apariciones infligen daño y silencian a los enemigos al atravesarlos.",
  "muerta_ability3_title": "Pistolera",
  "muerta_ability3_desc": "Los ataques de Muerta pueden realizar un segundo disparo contra un objetivo distinto, dando prioridad a los héroes.",
  "muerta_ability4_title": "Atravesar el Velo",
  "muerta_ability4_desc": "Muerta se transforma y se vuelve inmune al daño físico. Todo su daño de ataque se inflige como daño mágico. Muerta obtiene daño de ataque adicional y movimiento en fase. Puede atacar a unidades etéreas, pero no inflige daño a los objetivos con inmunidad mágica.",
  "muerta_heroes_title": "Para ver las estadísticas detalladas de Muerta",
  "muerta_heroes_btn": "Visita la página de la heroína",
  "muerta_wallpaper": "Fondos de pantalla",
  "muerta_minigame_title_pre": "Minijuego del",
  "muerta_minigame_title": " ",
  "muerta_minigame_subtitle": "RÁPIDA Y MORTAL…",
  "muerta_minigame_subtitle2": "Muerta necesita ayuda para poner los cuerpos calientes correctos en las tumbas frescas adecuadas... ¡y para eso estás tú! Durante el evento del Juicio Mortal, se te asignará un objetivo al inicio de cada partida de Dota. Consigue puntos por víctimas y por asistencias. Pero presta atención, porque tu rival también tiene sed de sangre ¡y quien consigue más puntos recibe el doble de recompensa!",
  "muerta_minigame_rules_title": "Flores",
  "muerta_minigame_rules_desc": "Mata y ayuda a matar a tu objetivo asignado para conseguir puntos y <b>Flores</b> de Muerta. Consigue más puntos que tu objetivo para aumentar el botín.",
  "muerta_minigame_rules_title2": "Tesoro",
  "muerta_minigame_rules_desc2": "Intercambia Flores por <b>Cofres del Juicio Mortal</b> cargados de sets de objetos completamente nuevos, algunos de ellos inspirados en el evento.",
  "muerta_minigame_rules_title3": "Llaves",
  "muerta_minigame_rules_desc3": "Compra una <b>Llave del Juicio Mortal</b> para abrir el cofre y desvelar la recompensa que esconde en su interior. Las llaves cuestan %1$s o 20 000 fragmentos en la tienda de fragmentos.",
  "muerta_treasure_title": "Cofre del Juicio Mortal",
  "muerta_treasure_content_desc": "Cuantas más flores consigas, más posibilidades tendrás de conseguir los sets de objetos inspirados en el Juicio Mortal. Muerta concede cinco llaves a cada jugador para iniciar la celebración. Consigue todas las llaves adicionales que necesites intercambiando fragmentos o en la tienda de Dota.",
  "muerta_minigame_treasure_name1": "Cazador Espectral",
  "muerta_minigame_treasure_name2": "Luz Agonizante",
  "muerta_minigame_treasure_name3": "Esfera del Altar",
  "muerta_minigame_treasure_name4": "Calor Mortal",
  "muerta_minigame_treasure_name5": "Víbora de la Muerte",
  "muerta_minigame_treasure_name6": "Muñeco de los Muertos",
  "muerta_minigame_treasure_name7": "Arma Caduca",
  "muerta_minigame_treasure_name8": "Serpiente Espectral",
  "janitors_corner_title": "Nuevas características",
  "732e_patch_dotaplus_advancedstats_title": "Estadísticas avanzadas de batalla",
  "732e_patch_dotaplus_advancedstats_subtitle": "Ahonda en tu historial de Dota",
  "732e_patch_dotaplus_advancedstats_desc": "Evalúa y mejora tu juego con las estadísticas avanzadas de batalla que aparecen directamente en tu perfil. Los miembros de Dota Plus ahora tienen acceso a una analítica de juego en tiempo real y completamente renovada. Ordena tu historial completo de Dota por héroe, rol, modo de juego, etc., para analizar en profundidad tu estilo de juego.",
  "732e_patch_dotaplus_advancedstats_desc2": "¿Quieres centrarte en los últimos golpes? Consulta el grupo de estadísticas de tus creeps. ¿Quieres mejorar tus habilidades como Apoyo? Las estadísticas del rol ahora son más reveladoras que un Guardián Centinela.",
  "732e_patch_quickkeys_title": "Lanzamiento rápido personalizable",
  "732e_patch_quickkeys_subtitle": "Control más preciso al alcance de tu mano",
  "732e_patch_quickkeys_desc": "Quienes utilicen el lanzamiento rápido pueden asignar ahora individualmente qué habilidades específicas de cada unidad y qué objetos se usan al presionar o soltar teclas. Selecciona «Teclas rápidas específicas de unidades» y «Activar lanzamiento rápido» en «Habilidades» y «Objetos», dentro de la pestaña «Teclas rápidas» del menú de ajustes, y échale un vistazo.",
  "732e_patch_friendslist_title": "Mejoras de la lista de amigos",
  "732e_patch_friendslist_subtitle": "Trata a tus mejores amigos de Dota como se merecen",
  "732e_patch_friendslist_desc": "Ahora, con la opción de favoritos, puedes etiquetar a la gente con la que más juegas para que aparezcan siempre en la parte superior de tu lista de amigos. Ordena tus amigos por favoritos, si están jugando a Dota, y si están conectados o desconectados. También puedes utilizar la característica de búsqueda recién añadida para encontrar exactamente a quien busques.",
  "732e_patch_title": "Actualización",
  "732e_patch_subtitle": "7.32E Y MÁS",
  "732e_patch_turbo_title": "Cambios en el modo Turbo",
  "732e_patch_turbo_intro": "A medida que el modo Turbo gana popularidad, queremos asegurarnos de que hacemos todo lo posible por los jugadores que lo utilizan. Seguimos mejorando la experiencia de juego en general, y pronto llegarán más cambios.",
  "732e_patch_turbo_change_notes1": "Los héroes se eligen ahora de forma oculta.",
  "732e_patch_turbo_change_notes2": "Se eliminó la fase de penalización al elegir héroes. Cuando se termina el tiempo de selección normal, quienes no hayan elegido ningún héroe se verán obligados a elegir el héroe que hayan seleccionado provisionalmente. Si dicho héroe no está disponible o no hay ninguna selección provisional, se les asignará un héroe de forma aleatoria.",
  "732e_patch_turbo_change_notes3": "Las bonificaciones de Talismán Anulador, Antifaz Espectral y Brazalete se duplican a los 12 minutos, en lugar de a los 25 minutos.",
  "732e_patch_turbo_change_notes4": "Las unidades invocadas ya no causan daño adicional a las torres, mientras que las unidades no invocadas (creeps de senda y dominados) siguen siendo más fuertes contra las torres que fuera del modo Turbo.",
  "732e_patch_turbo_change_notes5": "Es posible conseguir dos estrellas por desafíos de héroes, en lugar de solo una.",
  "732e_patch_turbo_change_notes6": "El arcano Legado de la Hoja de Juggernaut ya reconoce todas las víctimas por Omnilátigo.",
  "732e_patch_turbo_change_notes7": "El arcano Caída Planetaria de Earthshaker ya reconoce todas las víctimas y asistencias con Golpe Resonante. También está activado el seguimiento de las habilidades encadenadas y del combo de daño.",
  "732e_patch_turbo_change_notes8": "El inmortal Atavismo del Artificio Oscuro de Invoker ya reconoce todas las víctimas por Impacto Solar.",
  "732e_patch_turbo_change_notes9": "El inmortal Caldero de Xahryx del Renacimiento Eminente de Lone Druid ya reconoce en su totalidad la duración de Garras Enredadoras.",
  "732e_patch_turbo_change_notes10": "El inmortal Hoja de la Ballena Leviatán del Renacimiento Eminente de Kunkka ya reconoce todos los héroes alcanzados con Torrente.",
  "732e_patch_turbo_change_notes11": "El inmortal Orquídea Relámpago del Renacimiento Eminente de Storm Spirit ya reconoce el daño por Rayo Esférico en su totalidad.",
  "732e_patch_turbo_change_notes12": "El inmortal Amuleto del Rey de la Aleta del Renacimiento Eminente de Lion ya reconoce las maldiciones de enemigos en su totalidad.",
  "732e_patch_turbo_change_notes13": "El inmortal Bastón Atormentado del Renacimiento Eminente de Leshrac ya reconoce todos los enemigos aturdidos con Dividir la Tierra.",
  "732e_patch_turbo_change_notes14": "El arcano de Legion Commander ahora cuenta las victorias en duelos.",
  "732e_patch_turbo_change_notes15": "Se actualizó lo siguiente en el progreso de los arcanos:",
  "732e_bug_fixes_title": "Correcciones",
  "732e_bug_fixes_notes1": "Se corrigió un problema por el cual los detalles de las partidas no se añadían correctamente a las repeticiones guardadas ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]problema 349[/u][/url]).",
  "732e_bug_fixes_notes2": "Se corrigió el problema que hacía que faltasen los modelos, materiales, etc., de los héroes hasta que se volvía a conectar a la partida ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]problema 6070[/u][/url]).",
  "732e_bug_fixes_notes3": "Se corrigió un error por el cual Orbe Revigorizante a veces no entraba en recarga al utilizar Esquirla Revigorizante ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]problema 6668[/u][/url]).",
  "732e_bug_fixes_notes4": "Se corrigió un error que impedía lanzar Danza Arbórea de Monkey King a mucha distancia ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]problema 717[/u][/url]).",
  "732e_bug_fixes_notes5": "Se corrigió un error por el cual el primer ataque con Infestado de Lifestealer fallaba a ciertas distancias ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]problema 6801[/u][/url]).",
  "732e_bug_fixes_notes6": "Jinada y Ataque Geminado ya se pueden lanzar cuando los héroes están afectados por Ruptura, pero no al estar Silenciados. El comportamiento coincide ahora con el de otras habilidades similares del juego ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]problema 6779[/u][/url]).",
  "732e_bug_fixes_notes7": "Se corrigió un error por el cual el efecto de partículas de la Bola de Nieve de Tusk no se destruía si fallaba el lanzamiento ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problema 6805[/u][/url]).",
  "732e_bug_fixes_notes8": "Los héroes ya no pueden canalizar Portal Demoníaco cuando se encuentran dentro de Bola de Nieve ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]problema 6670[/u][/url]).",
  "732e_bug_fixes_notes9": "Ahora, además de los efectos de estado anteriores, los héroes que lanzan Bola de Nieve están inmovilizados para evitar los problemas que se producían en los efectos de partículas al lanzar algunas habilidades de movimiento durante Bola de Nieve ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problema 6805[/u][/url]).",
  "732e_bug_fixes_notes10": "Se corrigió un error por el cual la amplificación de la curación de KotL no amplificaba la curación de aliados de Iluminar con Forma Espiritual ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]problema 2176[/u][/url]).",
  "732e_bug_fixes_notes11": "Se corrigió un error por el cual Pulverizar de Primal Beast podía hacer que los héroes quedasen pegados a Primal Beast de forma indefinida si se producía una disipación fuerte durante el movimiento vertical de otro hechizo, como Púa Terrenal de Lion ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]problema 3528[/u][/url]).",
  "732e_bug_fixes_notes12": "La descripción emergente de las habilidades Fragmentos de Hielo de Tusk y Fuerza Divina de Sven ya muestra los valores de recarga reducidos al elegir los talentos adecuados. Solo ha cambiado el texto ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]problema 575[/u][/url]).",
  "732e_bug_fixes_notes13": "Se corrigieron los indicadores de recarga que faltaban en algunas habilidades basadas en cargas, incluidas aquellas que solo tienen carga en combinación con el talento correspondiente o una mejora de Aghanim ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]problema 315[/u][/url]).",
  "732e_bug_fixes_notes14": "Se corrigió que la curación de Vasija Espiritual no contase para la estadística de curación en la pantalla pospartida ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]problema 213[/u][/url]).",
  "732e_bug_fixes_notes15": "Ya no faltan los efectos de partículas y sonido cuando Queen of Pain lanza Alarido de Dolor sin objetivos al alcance ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]problema 5429[/u][/url]).",
  "732e_bug_fixes_notes16": "Ya se muestran correctamente los roles dentro del juego de los jugadores que se desconectan al inicio de la partida.",
  "732e_bug_fixes_notes17": "Ruptura ya no desactiva Gracia Celestial de Omniknight ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]problema 1649[/u][/url]).",
  "732e_bug_fixes_notes18": "Se corrigió un error por el cual Troll Warlord podía anular los comandos de ataque forzados de Trance de Batalla emitiendo comandos de lanzamiento de Hachas Giratorias (a distancia) fuera del alcance de lanzamiento. Al lanzar así la habilidad, Hachas Giratorias (a distancia) se lanza ahora en esa dirección.",
  "732e_bug_fixes_notes19": "Se corrigieron algunos casos en los que los mensajes de chat (por ejemplo, sobre desconexiones y reconexiones) no se mostraban si el jugador estaba silenciado.",
  "732e_bug_fixes_notes20": "Se añadió «en partidas ganadas» a la descripción de la gema que permite desbloquear estilos secundarios del set arcano de Queen of Pain y Faceless Void. Solo ha cambiado el texto. El progreso del arcano de estos dos héroes siempre ha dependido de las victorias conseguidas.",
  "732e_bug_fixes_notes21": "Se añadieron más detalles a la descripción emergente de Glifo de Fortificación ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]problema 6786[/u][/url]).",
  "732e_bug_fixes_notes22": "Las habilidades que pueden tener unidades invulnerables como objetivo y que pueden disipar ciertos estados de invulnerabilidad (Ciclón, etc.) lo indican ahora en la descripción emergente que aparece al pulsar la tecla ALT.",
  "732e_bug_fixes_notes23": "Se actualizaron las descripciones emergentes de las siguientes habilidades:",
  "732e_bug_fixes_notes24": "Pesadilla de Bane",
  "732e_bug_fixes_notes25": "Veneno del Jabalí de Beastmaster",
  "732e_bug_fixes_notes26": "Hachas Salvajes de Beastmaster",
  "732e_bug_fixes_notes27": "Disipar Magia del Brewlecito de Tormenta de Brewmaster",
  "732e_bug_fixes_notes28": "Picadura Venenosa de la Cría de Araña de Broodmother",
  "732e_bug_fixes_notes29": "Aguja de Hielo de Lich",
  "732e_bug_fixes_notes30": "Purga del Arquero del Necronomicón",
  "732e_bug_fixes_notes31": "Anular de Nulificador",
  "732e_bug_fixes_notes32": "Fin de la Fortuna de Oracle",
  "732e_bug_fixes_notes33": "Purga del Desterrador Sátiro",
  "732e_bug_fixes_notes34": "Limpieza Demoníaca de Shadow Demon",
  "732e_bug_fixes_notes35": "Purga Demoníaca de Shadow Demon",
  "732e_bug_fixes_notes36": "Martillo de la Tormenta de Sven",
  "732e_bug_fixes_notes37": "Fosa de Malevolencia de Underlord",
  "732e_bug_fixes_notes38": "Como ya ocurre con el Alijo del Coleccionista I, los objetos del Alijo del Coleccionista II se pueden regalar una vez abiertos.",
  "732e_bug_fixes_notes39": "Ya es posible asignar teclas a la interfaz de mejoras de talentos en «Teclas rápidas avanzadas».",
  "732e_bug_fixes_notes40": "Ya no es posible unirse al emparejamiento cuando la opción «-dev» está activada. Eso permitía que herramientas de terceros cambiasen determinados elementos de la interfaz de usuario de forma indebida.",
  "732e_bug_fixes_notes41": "Se desactivaron algunas formas adicionales de acceder al perfil de un jugador durante la fase de elección.",
  "732e_bug_fixes_notes42": "Durante una partida, al hacer clic en un enemigo en la barra superior, se muestra su última ubicación conocida y el estado de su inventario."
}