// 6784.js

{
  "language": "dutch",
  "muerta_title": "De Dead Reckoning-update",
  "muerta_title_pre": "De",
  "muerta_title_post": " -update",
  "muerta_title_date": "6 maart - 4 april 2023",
  "muerta_play_trailer": "Trailer afspelen",
  "new_hero_tag": "Nieuwe held",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Held",
  "muerta_navigation_event": "Minispel",
  "muerta_navigation_janitor": "Functies",
  "muerta_navigation_gameplay": "Gameplayupdate",
  "muerta_role1": "Carry",
  "muerta_role2": "Afstand",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "Met haar angstaanjagende trickshots, haar talent om geesten op te roepen en een extra vuurwapen op de koop toe, was Muerta zo goed in het verzamelen van zielen dat de Dood haar hoogstpersoonlijk heeft gerekruteerd. Muerta is een wervelwind van pistolen en een doodse wraakzucht. Het is haar missie om verloren zielen naar het hiernamaals te leiden, of ze dat nu willen of niet. En als iemand zich niet zo makkelijk laat overtuigen, zal ze niet aarzelen om haar ware vorm te laten zien en als moordzuchtige spectrale nachtmerrie die verloren zielen iets sneller het hoekje om te helpen.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta schiet een bovennatuurlijk projectiel richting een vijandelijke eenheid of boom. Nadat de kogel het eerste doel heeft geraakt en beschadigd, wordt de kogel afgeremd en ketst vervolgens af richting het doelwit. Alle eenheden die op het traject tussen de kogel en de held liggen worden beschadigd. De kogel stopt als de held wordt geraakt. Helden die door een afgeketste kogel worden geraakt, rennen in de richting van het schot.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Hiermee wordt een groep geesten opgeroepen die langzaam rond de geselecteerde locatie cirkelen. Vijanden in dat gebied worden vertraagd en hebben een lagere aanvalssnelheid. Vijanden die in contact komen met de spoken lopen schade op en worden tot zwijgen gebracht.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Muerta's aanvallen hebben een kans op een tweede schot dat een ander doelwit zal raken, met prioriteit voor helden.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta ondergaat een transformatie, waarna ze immuun is voor fysieke schade. Al haar aanvalsschade wordt toegebracht als magische schade. Muerta krijgt bonusaanvalsschade en kan door andere eenheden heen bewegen. Muerta kan etherische eenheden aanvallen, maar kan geen schade toebrengen aan doelwitten die immuun zijn voor magie.",
  "muerta_heroes_title": "Gedetailleerde statistieken over Muerta",
  "muerta_heroes_btn": "Heldenpagina bekijken",
  "muerta_wallpaper": "Achtergronden",
  "muerta_minigame_title_pre": "Het",
  "muerta_minigame_title": "Minispel",
  "muerta_minigame_subtitle": "SNELLER DAN DE DOOD",
  "muerta_minigame_subtitle2": "Muerta moet de nog warme lijken van haar slachtoffers in de juiste graven zien te krijgen ... en daar heeft ze jouw hulp bij nodig. Tijdens het Dead Reckoning-evenement krijg je voor het begin van ieder Dota-spel een doelwit toegewezen. Je krijgt punten voor kills en assists, maar pas op! Je tegenstander is ook op bloed uit en degene met de meeste punten krijgt een dubbele beloning!",
  "muerta_minigame_rules_title": "Bloemen",
  "muerta_minigame_rules_desc": "Verzamel punten met kills en assists op je toegewezen doelwit en krijg <b>bloemen</b> van Muerta. Scoor meer punten dan je doelwit om je winst te vergroten.",
  "muerta_minigame_rules_title2": "Schat",
  "muerta_minigame_rules_desc2": "Ruil je bloemen voor <b>Dead Reckoning-kisten</b> die bomvol zitten met splinternieuwe itemsets en thematische items voor dit evenement.",
  "muerta_minigame_rules_title3": "Sleutels",
  "muerta_minigame_rules_desc3": "Koop een <b>Dead Reckoning-sleutel</b> om de kist te ontgrendelen en ontdek welke beloning erin verborgen ligt. Sleutels zijn voor %1$s of 20.000 fragmenten per stuk verkrijgbaar in de fragmentenwinkel.",
  "muerta_treasure_title": "Dead Reckoning-kist",
  "muerta_treasure_content_desc": "Verdien meer bloemen en vergroot je kans om deze itemsets met het Dead Reckoning-thema te ontgrendelen. Muerta heeft iedereen vijf sleutels toegekend om dit evenement feestelijk te beginnen. Je kunt meer sleutels bemachtigen door fragmenten te gebruiken of naar de Dota-winkel te gaan.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "Nieuwe functies",
  "732e_patch_dotaplus_advancedstats_title": "Geavanceerde gevechtsstatistieken",
  "732e_patch_dotaplus_advancedstats_subtitle": "Duik in alle data van je Dota-geschiedenis",
  "732e_patch_dotaplus_advancedstats_desc": "Til je vaardigheden naar een hoger niveau en evalueer je spel met geavanceerde gevechtsstatistieken die direct beschikbaar zijn op je profiel. Dota Plus-leden hebben nu toegang tot volledig vernieuwde gameplay-analyses in realtime. Duik dieper in je speelstijl door je complete Dota-geschiedenis te sorteren op held, rol, spelmodus en meer.",
  "732e_patch_dotaplus_advancedstats_desc2": "Geïnteresseerd in je laatste treffers? In je Creeps-statistieken vind je alles wat je zoekt. Wil je aan je Support-vaardigheden werken? De Support-statistieken geven nu meer informatie dan een Sentry Ward.",
  "732e_patch_quickkeys_title": "Aanpasbare sneltoetsen",
  "732e_patch_quickkeys_subtitle": "Meer controle met een druk op de knop",
  "732e_patch_quickkeys_desc": "Met de functie 'Snel gebruiken' kunnen spelers nu zelf opgeven welke eenheidsspecifieke vaardigheden en items worden geopend door een knop in te drukken of juist lost te laten. Probeer het zelf door op het tabblad Sneltoetsen in het menu Instellingen de opties 'Eenheidsspecifieke sneltoetsen' en 'Snel gebruiken inschakelen' te selecteren voor vaardigheden en items.",
  "732e_patch_friendslist_title": "Verbeteringen voor vriendenlijsten",
  "732e_patch_friendslist_subtitle": "Geef je beste Dota-vrienden de erebehandeling die ze verdienen",
  "732e_patch_friendslist_desc": "Met de functie Favorieten kun je nu de spelers taggen waar je het meest mee speelt om ze bovenaan je vriendenlijst weer te geven. Sorteer je vrienden op favorieten, die Dota aan het spelen zijn en op online en offline status. Je kunt ook de gloednieuwe zoekfunctie voor vrienden gebruiken om te vinden wie je zoekt.",
  "732e_patch_title": "Gameplayupdate",
  "732e_patch_subtitle": "7.32E EN MEER",
  "732e_patch_turbo_title": "Wijzigingen voor Turbo-modus",
  "732e_patch_turbo_intro": "Nu de Turbo-modus steeds populairder wordt, willen we er zeker van zijn dat we alles doen wat we kunnen voor diegenen die er gebruik van maken. We blijven de spelervaring verbeteren, dus je kunt in de toekomst meer wijzigingen verwachten.",
  "732e_patch_turbo_change_notes1": "De selectie van alle helden is nu verborgen.",
  "732e_patch_turbo_change_notes2": "De fase voor straffen bij het kiezen van helden is verwijderd. Als de reguliere opstellingstijd eindigt, zal iedereen die nog geen held heeft geselecteerd gedwongen worden om met de held te spelen die was voorgeselecteerd. Als die held niet beschikbaar is of als er geen voorlopige keuze is gemaakt, dan wordt er een willekeurige held toegewezen.",
  "732e_patch_turbo_change_notes3": "De bonussen van Null Talisman, Wraith Band en Bracer worden nu verdubbeld na 12 minuten in plaats van 25 minuten.",
  "732e_patch_turbo_change_notes4": "Bonusschade aan torens van alle opgeroepen eenheden is verwijderd. Niet-opgeroepen eenheden (padcreeps, gedomineerde creeps) geven nog steeds verhoogde schade tegen torens in vergelijking met wedstrijden die niet in Turbo-modus worden gespeeld.",
  "732e_patch_turbo_change_notes5": "Je kunt nu twee sterren verdienen voor helduitdagingen in plaats van maar één.",
  "732e_patch_turbo_change_notes6": "De Arcana Bladeform Legacy van Juggernaut registreert nu alle kills met Omnislash.",
  "732e_patch_turbo_change_notes7": "De Arcana Planetfall van Earthshaker registreert nu alle kills en assists van Echo Slam. Het bijhouden van vaardigheden en schade met combo's is ook ingeschakeld.",
  "732e_patch_turbo_change_notes8": "Het onsterfelijke item Dark Artistry Throwback van Invoker registreert nu alle kills met Sun Strike.",
  "732e_patch_turbo_change_notes9": "Het onsterfelijke item Cauldron of Xahryx of Eminent Revival van Lone Druid registreert nu de volledige duur van Entangling Claws.",
  "732e_patch_turbo_change_notes10": "Het onsterfelijke item Leviathan Whale Blade of Eminent Revival van Kunkka registreert nu alle treffers op helden met Torrent.",
  "732e_patch_turbo_change_notes11": "Het onsterfelijke item The Lightning Orchid of Eminent Revival van Storm Spirit registreert nu alle schade met Ball Lightning.",
  "732e_patch_turbo_change_notes12": "Het onsterfelijke item Charm of Eminent Revival van Fin King registreert nu de volledige duur van Hex.",
  "732e_patch_turbo_change_notes13": "Het onsterfelijke item Tormented Staff of Eminent Revival van Leshrac registreert nu alle verlammingen met Split Earth.",
  "732e_patch_turbo_change_notes14": "De Arcana van Legion Commander telt nu Duel-overwinningen.",
  "732e_patch_turbo_change_notes15": "Arcana-vooruitgang is bijgewerkt voor het volgende:",
  "732e_bug_fixes_title": "Oplossingen voor bugs",
  "732e_bug_fixes_notes1": "Probleem opgelost waarbij opgeslagen herhalingen niet correct werden bijgewerkt met wedstrijdinformatie. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]Bug 349[/u][/url])",
  "732e_bug_fixes_notes2": "Bug opgelost waarbij helden soms hun modellen/materialen/etc. misten totdat er opnieuw verbinding werd gemaakt met het spel. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]Bug 6070[/u][/url])",
  "732e_bug_fixes_notes3": "Bug opgelost waarbij de afkoeltijd voor Refresher Orb soms niet werd geactiveerd wanneer Refresher Shard werd gebruikt. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]Bug 6668[/u][/url])",
  "732e_bug_fixes_notes4": "Bug opgelost waarbij Tree Dance van Monkey King niet kon worden uitgevoerd als het spreukbereik te groot was. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]Bug 717[/u][/url])",
  "732e_bug_fixes_notes5": "Bug opgelost waarbij de eerste aanval met Infest van Lifestealer op vijanden miste wanneer de aanval op bepaalde afstanden werd uitgevoerd. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]Bug 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Jinada en Geminate Attacks kunnen nu worden gebruikt terwijl Break actief is, maar niet wanneer zwijgen is opgelegd. Dit gedrag is nu hetzelfde als voor vergelijkbare vaardigheden in het spel. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]Bug 6779[/u][/url])",
  "732e_bug_fixes_notes7": "Bug verholpen waarbij het deeltjeseffect van de Snowball van Tusk niet werd vernietigd als de Snowball-lancering mislukte. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]Bug 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Helden kunnen Fiend's Gate niet langer oproepen terwijl ze zich in een Snowball bevinden. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]Bug 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Helden die een Snowball gebruiken worden nu vastgezet naast andere statuseffecten. Dit veroorzaakte problemen met deeltjeseffecten wanneer bepaalde bewegingsvaardigheden werden uitgevoerd tijdens een Snowball. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]Bug 6805[/u][/url])",
  "732e_bug_fixes_notes10": "Bug opgelost waarbij Illuminate van KotL met helende Spirit Form op bondgenoten niet werd versterkt door de genezingsversterking van KotL. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]Bug 2176[/u][/url])",
  "732e_bug_fixes_notes11": "Bug opgelost waarbij Pulverize van Primal Beast er soms voor zorgde dat helden permanent aan Primal Beast vast kwamen te zitten als er een sterke verdrijving plaatsvond tijdens de verticale beweging van een andere spreuk zoals Earth Spike van Lion. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]Bug 3528[/u][/url])",
  "732e_bug_fixes_notes12": "Probleem opgelost waarbij de tooltips voor Ice Shards van Tusk en voor God's Strength van Sven de verlaagde waarden voor de afkoeltijd niet weergaven bij selectie van de betreffende talenten. Het gaat hier alleen om een aanpassing van de tekst. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]Bug 575[/u][/url])",
  "732e_bug_fixes_notes13": "Ontbrekende indicatoren voor afkoeltijden toegevoegd voor vaardigheden met ladingen, inclusief vaardigheden waarbij ladingen alleen voorkomen als het corresponderende talent of Aghanim's-verbetering is geactiveerd. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]Bug 315[/u][/url])",
  "732e_bug_fixes_notes14": "Probleem opgelost waarbij de genezing door Spirit Vessel niet in de spelanalyse werd meegeteld als genezing. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]Bug 213[/u][/url])",
  "732e_bug_fixes_notes15": "Probleem opgelost waarbij er voor Queen of Pain deeltjes en geluidseffecten ontbraken wanneer Scream of Pain werd gebruikt zonder dat er doelwitten binnen bereik waren. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]Bug 5429[/u][/url])",
  "732e_bug_fixes_notes16": "Rollen in het spel worden nu correct weergegeven voor spelers die geen verbinding hebben aan het begin van het spel.",
  "732e_bug_fixes_notes17": "Probleem opgelost waarbij Heavenly Grace van Omniknight werd uitgeschakeld door Break. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]Bug 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Bug opgelost waarbij Troll Warlord de opdracht van Battle Trance om aanvallen te forceren kon omzeilen door buiten het spreukbereik de opdracht Whirling Axes (Afstand) te gebruiken. Als de spreuk op deze manier wordt gebruikt, wordt Whirling Axes (Afstand) nu in die richting uitgevoerd.",
  "732e_bug_fixes_notes19": "Enkele gevallen gecorrigeerd waarbij chatberichten over het verbreken of herstellen van de verbinding niet werden weergegeven als de speler was gedempt.",
  "732e_bug_fixes_notes20": "De tekst 'in gewonnen spellen' is toegevoegd aan juweelbeschrijvingen voor het ontgrendelen van secundaire stijlen voor Arcana's van Queen of Pain en Faceless Void. Het gaat hier alleen om een aanpassing van de tekst: voor Arcana's van deze twee helden is het winnen van een spel altijd een vereiste geweest.",
  "732e_bug_fixes_notes21": "Aanvullende informatie toegevoegd aan de tooltip voor Glyph of Fortification. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]Bug 6786[/u][/url])",
  "732e_bug_fixes_notes22": "Voor vaardigheden die onschendbare eenheden als doelwit kunnen kiezen en enkele onschendbare toestanden kunnen verwijderen (zoals Cyclone), zijn Alt-beschrijvingen toegevoegd waarin wordt aangegeven dat ze onschendbare eenheden als doelwit kunnen kiezen.",
  "732e_bug_fixes_notes23": "Tooltips zijn bijgewerkt voor de volgende vaardigheden:",
  "732e_bug_fixes_notes24": "Nightmare van Bane",
  "732e_bug_fixes_notes25": "Boar Poison van Beastmaster",
  "732e_bug_fixes_notes26": "Wild Axes van Beastmaster",
  "732e_bug_fixes_notes27": "Dispel Magic van het Storm-element van Brewmaster",
  "732e_bug_fixes_notes28": "Poison Sting van Broodmother's Spiderling",
  "732e_bug_fixes_notes29": "Ice Spire van Lich",
  "732e_bug_fixes_notes30": "Purge van Necronomicon Archer",
  "732e_bug_fixes_notes31": "Nullify van Nullifier",
  "732e_bug_fixes_notes32": "Fortune's End van Oracle",
  "732e_bug_fixes_notes33": "Purge van Satyr Banisher",
  "732e_bug_fixes_notes34": "Demonic Cleanse van Shadow Demon",
  "732e_bug_fixes_notes35": " Demonic Purge van Shadow Demon",
  "732e_bug_fixes_notes36": "Storm Hammer van Sven",
  "732e_bug_fixes_notes37": "Pit of Malice van Underlord",
  "732e_bug_fixes_notes38": "Items uit Collector's Cache 2 kunnen nu na het uitpakken geschonken worden, net als items uit Collector's Cache 1.",
  "732e_bug_fixes_notes39": "Het is nu mogelijk om sneltoetsen in te stellen voor de gebruikersinterface van het upgraden van talenten. Deze opties zijn te vinden in de instellingen voor geavanceerde sneltoetsen.",
  "732e_bug_fixes_notes40": "Het is niet meer mogelijk om aan te sluiten bij de matchmakingwachtrij wanneer de markering -dev actief is. Deze optie kon met software van derden gebruikt worden om onderdelen van de gebruikersinterface te wijzigen voor misbruik.",
  "732e_bug_fixes_notes41": "Een aantal aanvullende manieren om het profiel van een speler te openen tijdens de selectiefase zijn uitgeschakeld.",
  "732e_bug_fixes_notes42": "Door tijdens een spel in de bovenste balk op vijanden te klikken wordt hun laatste locatie en de status van hun inventaris weergegeven."
}