// 5527.js

{
  "language": "danish",
  "muerta_title": "Opdatering: Dead Reckoning",
  "muerta_title_pre": " ",
  "muerta_title_post": "Opdatering",
  "muerta_title_date": "6. marts 2023 – 4. april 2023",
  "muerta_play_trailer": "Afspil trailer",
  "new_hero_tag": "Ny helt",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Helt",
  "muerta_navigation_event": "Minispil",
  "muerta_navigation_janitor": "Funktioner",
  "muerta_navigation_gameplay": "Spilopdatering",
  "muerta_role1": "Carry",
  "muerta_role2": "Afstandskamp",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "Med hendes frygtede trickskud, åndefremkaldelser og et ekstra sidevåben var Muertas evner til at dræbe så imponerende, at selv døden havde hende på lønningslisten. Muerta er en hævngerrig drabsmaskine, som fører vildfarne sjæle til den anden side med sine to pistoler, om de vil det eller ej. Og hvis der skal mere overtalelse til, afslører hun sit sande væsen som et morderisk, mareridtsagtigt genfærd, hvis det hjælper dem med at dø lidt hurtigere.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta affyrer et hældende spøgelsesskud mod en enhed eller et træ. Når skuddet rammer, gør det skade, hæmmer kortvarigt og rikochetterer derefter i den vektorvalgte retning. Det rikochetterende skud skader alle enheder, det rammer, og stopper når det rammer en helt. Helte, som rammes af rikochetteringen, bliver skræmt i samme retning som skuddet.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Hidkalder en flok genfærd, der langsomt kredser rundt om det valgte område. Fjender i området hæmmes og har reduceret angrebshastighed. Genfærdene skader og undertrykker fjender, der rører dem.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Muertas angreb kan affyre et sekundært skud mod et andet mål. Helte prioriteres.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta forvandles og bliver immun over for fysisk skade. Al hendes angrebsskade forvandles til magisk skade. Muerta får ekstra angrebsskade og evnen til at bevæge sig igennem enheder. Muerta kan angribe æteriske enheder, men gør ikke skade på mål, der har magisk immunitet.",
  "muerta_heroes_title": "Se alle oplysningerne om Muerta",
  "muerta_heroes_btn": "Besøg heltesiden",
  "muerta_wallpaper": "Baggrunde",
  "muerta_minigame_title_pre": " ",
  "muerta_minigame_title": "Minispillet",
  "muerta_minigame_subtitle": "DE HURTIGE OG DE DØDE…",
  "muerta_minigame_subtitle2": "Muerta skal bruge hjælp til at finde det rette lig til den rette grav, og det er der, du kommer ind i billedet! I løbet af Dead Reckoning-begivenheden får du tildelt et mål før hver Dota-kamp. Scor point ved at dræbe og assistere i drab på målet, men pas på – din modstander er også ude efter dig, og den, der scorer flest point, får dobbelt så mange belønninger!",
  "muerta_minigame_rules_title": "Blomster",
  "muerta_minigame_rules_desc": "Dræb og assister i at dræbe dit tildelte mål for at score point og modtage Muertas <b>Blomster</b>. Scor flere point end dit mål for sikre dig flere belønninger.",
  "muerta_minigame_rules_title2": "Skatte",
  "muerta_minigame_rules_desc2": "Byt dine blomster til <b>Dead Reckoning-kister</b>, som er fulde af helt nye genstandssæt samt genstande med begivenhedstema.",
  "muerta_minigame_rules_title3": "Nøgler",
  "muerta_minigame_rules_desc3": "Køb en <b>Dead Reckoning-nøgle</b> for at låse op for kisten og afsløre belønningen indeni. Nøgler kan købes for %1$s eller 20.000 skår i skårshoppen.",
  "muerta_treasure_title": "Dead Reckoning-kiste",
  "muerta_treasure_content_desc": "Scor flere blomster for ekstra chancer for at låse op for disse genstandssæt i Dead Reckoning-tema. Muerta har givet fem nøgler til alle til at skyde festen i gang. Snup alle dem, du har brug for, ved hjælp af skår eller Dota-butikken.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "Nye funktioner",
  "732e_patch_dotaplus_advancedstats_title": "Avanceret kampstatistik",
  "732e_patch_dotaplus_advancedstats_subtitle": "Analysér alle dataene i hele din Dota-spilhistorik",
  "732e_patch_dotaplus_advancedstats_desc": "Løft – og evaluer – dit spil med avanceret kampstatistik direkte i din profil. Dota Plus-medlemmer har nu adgang til helt nye spilanalyser i realtid. Dyk længere ned i din spillestil ved at sortere hele din Dota-historik efter helt, rolle, spiltilstand og meget mere.",
  "732e_patch_dotaplus_advancedstats_desc2": "Fokuserer du på dødsstød? Krybstatistikken har det hele. Prøver du at blive bedre support? Supportstatistikken afslører endnu mere, end Sentry Wards gør.",
  "732e_patch_quickkeys_title": "Tilpasseligt hurtigkast",
  "732e_patch_quickkeys_subtitle": "Bedre styring i fingerspidserne",
  "732e_patch_quickkeys_desc": "Med hurtigkast kan man nu vælge, hvilke enhedsspecifikke evner og genstande, der skal aktiveres med tastetryk eller tasteslip. Prøv det ved at vælge \"Enhedsspecifikke genvejstaster\" og \"Slå hurtigkast til\" på evner og genstande via Indstillinger > Genvejstaster.",
  "732e_patch_friendslist_title": "Forbedringer til vennelisten",
  "732e_patch_friendslist_subtitle": "Give dine bedste Dota-venner den status, de fortjener",
  "732e_patch_friendslist_desc": "Med favoritfunktionen kan du nu tagge folk, du spiller mest med, så de forbliver i toppen af vennelisten. Venner sorteres efter favoritter, i spil, online og offline. Du kan også bruge den nye vennesøgefunktion til at finde præcis den ven, du leder efter.",
  "732e_patch_title": "Spilopdatering",
  "732e_patch_subtitle": "7.32E OG MERE",
  "732e_patch_turbo_title": "Ændringer til Turbo-tilstand",
  "732e_patch_turbo_intro": "Da Turbo-tilstand er steget i popularitet, vil vi gerne sikre os, at vi gør alt, hvad vi kan for dem, der spiller tilstanden. Vi vil fortsat forbedre spiloplevelsen, så hold øje med flere opdateringer.",
  "732e_patch_turbo_change_notes1": "Alle heltevalg er nu skjulte",
  "732e_patch_turbo_change_notes2": "Fjernede straffefasen under heltevalg. Når valgtiden slutter, tvinges enhver spiller, som ikke har valgt en helt, til at vælge den helt, de har markeret. Hvis helten ikke er tilgængelig, eller der ikke er markeret nogen helt, vælges der en tilfældig helt.",
  "732e_patch_turbo_change_notes3": "Null Talisman, Wraith Band og Bracer fordobler deres bonusser efter 12 minutter i stedet for efter 25 minutter",
  "732e_patch_turbo_change_notes4": "Fjernede bonusskaden mod tårne fra alle hidkaldte enheder. Ikke-hidkaldte enheder (lanekryb, dominerede kryb) er stadig stærkere mod tårne i Turbo.",
  "732e_patch_turbo_change_notes5": "Man kan nu tjene op til to stjerner i helteudfordringer i stedet for én",
  "732e_patch_turbo_change_notes6": "Juggernauts Arcana-genstand \"Bladeform Legacy\" giver nu fuld anerkendelse for drab med Omnislash",
  "732e_patch_turbo_change_notes7": "Earthshakers Arcana-genstand \"Planetfall\" giver nu fuld anerkendelse for drab og assisterede drab med Echo Slam. Sporing af evnekædning og komboskade er også aktiveret.",
  "732e_patch_turbo_change_notes8": "Invokers udødelige genstand \"Dark Artistry Throwback\" giver nu fuld anerkendelse for drab med Sun Strike",
  "732e_patch_turbo_change_notes9": "Lone Druids udødelige genstand \"Cauldron of Xahryx of Eminent Revival\" giver nu fuld anerkendelse for fastgørelsesvarighed med Entangling Claws",
  "732e_patch_turbo_change_notes10": "Kunkkas udødelige genstand \"Leviathan Whale Blade of Eminent Revival\" giver nu fuld anerkendelse for at ramme helte med Torrent",
  "732e_patch_turbo_change_notes11": "Storm Spirits udødelige genstand \"The Lightning Orchid of Eminent Revival\" giver nu fuld anerkendelse for skade med Ball Lightning",
  "732e_patch_turbo_change_notes12": "Lions udødelige genstand \"Fin King's Charm of Eminent Revival\" giver nu fuld anerkendelse for brug af Hex på fjender",
  "732e_patch_turbo_change_notes13": "Leshracs udødelige genstand \"Tormented Staff of Eminent Revival\" giver nu fuld anerkendelse for lammelse af fjender med Split Earth",
  "732e_patch_turbo_change_notes14": "Legion Commanders Arcana-genstand tæller nu sejre med Duel",
  "732e_patch_turbo_change_notes15": "Følgende Arcana-fremskridt er blevet opdateret:",
  "732e_bug_fixes_title": "Fejlrettelser",
  "732e_bug_fixes_notes1": "Rettede et problem, hvor gemte gengivelser ikke blev udfyldt med kampoplysninger korrekt ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]fejl 349[/u][/url])",
  "732e_bug_fixes_notes2": "Rettede en fejl, hvor helte nogle gange manglede deres modeller/materialer/osv., indtil man tilsluttede til kampen igen ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]fejl 6070[/u][/url])",
  "732e_bug_fixes_notes3": "Rettede en fejl, som gjorde, at Refresher Orb til tider ikke blev nedkølet, hvis Refresher Shard blev brugt ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]fejl 6668[/u][/url])",
  "732e_bug_fixes_notes4": "Rettede en fejl, hvor Monkey Kings evne Tree Dance ikke blev brugt ved lange afstande ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]fejl 717[/u][/url])",
  "732e_bug_fixes_notes5": "Rettede en fejl, hvor Lifestealer ville misse med sit første angreb fra evnen Infest, hvis den blev brugt fra bestemte afstande ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]fejl 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Angreb med Jinada og Geminate Attack kan nu bruges, mens passive evner er deaktiveret, men ikke mens man er undertrykt. Denne adfærd matcher nu andre lignende evner i spillet ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]fejl 6779[/u][/url])",
  "732e_bug_fixes_notes7": "Rettede et problem, hvor partikeleffekterne fra Tusks evne Snowball ikke forsvandt, hvis evnen fik afbrudt sin affyring ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]fejl 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Helte kan ikke længere kanalisere Fiend's Gate, når de er inde i en snebold ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]fejl 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Helte, som bruger evnen \"Snowball\", bliver nu også fastgjort udover de sædvanlige statuseffekter. Dette forårsagede problemer med partikeleffekter, når visse bevægelsesevner blev brugt i løbet af evnen ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]fejl 6805[/u][/url])",
  "732e_bug_fixes_notes10": "Rettede en fejl, hvor Keeper of the Lights heling fra Illuminate med Spirit Form ikke blev amplificeret af helingsamplifikation ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]fejl 2176[/u][/url])",
  "732e_bug_fixes_notes11": "Rettede en fejl, hvor Primal Beasts Pulverize kunne få helte til at sidde fast på Primal Beast, hvis de fik påført en stærk dispel på samme tid som en vertikal bevægelse fra en anden besværgelse, såsom Lions Earth Spike ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]fejl 3528[/u][/url])",
  "732e_bug_fixes_notes12": "Rettede, at beskrivelserne for Tusks Ice Shards og Svens God's Strength ikke viste de reducerede nedkølingsværdier, hvis man valgte de relevante talenter. Dette er kun en tekstændring ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]fejl 575[/u][/url])",
  "732e_bug_fixes_notes13": "Rettede manglende nedkølingsindikatorer for ladningsbaserede evner, herunder evner der kun har ladninger, når man vælger det rette talent eller Aghanim-opgradering ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]fejl 315[/u][/url])",
  "732e_bug_fixes_notes14": "Rettede, at heling fra Spirit Vessel ikke talte som heling i efterspilsopsummeringen ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]fejl 213[/u][/url])",
  "732e_bug_fixes_notes15": "Rettede Queen of Pains manglende partikel- og lydeffekter, når Scream of Pain blev brugt uden nogen mål inden for rækkevidde ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]fejl 5429[/u][/url])",
  "732e_bug_fixes_notes16": "Roller i spillet vises nu korrekt for spillere, der afbrød forbindelsen til spillet i starten af kampen.",
  "732e_bug_fixes_notes17": "Rettede, at Omniknights Heavenly Grace ikke virkede, hvis passive evner blev deaktiveret ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]fejl 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Rettede en fejl, hvor Troll Warlord kunne ignorere Battle Trances tvungne angrebskommandoer ved at bruge Whirling Axes i afstandstilstand uden for kasterækkevidden. Nu vil brug af evnen kaste Whirling Axes i den valgte retning.",
  "732e_bug_fixes_notes19": "Rettede nogle tilfælde, hvor chatbeskeder såsom forbindelsesbeskeder ikke blev vist, hvis spilleren var chatdæmpet.",
  "732e_bug_fixes_notes20": "Tilføjede \"i kampe, du vinder\" til ædelstenbeskrivelser, der låser op for sekundære Arcana-stile til Queen of Pain og Faceless Void. Dette er kun en tekstændring, da sejre altid har været et krav for Arcana-fremskridt for disse to helte.",
  "732e_bug_fixes_notes21": "Tilføjede mere information i beskrivelsen til Glyph of Fortification ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]fejl 6786[/u][/url])",
  "732e_bug_fixes_notes22": "Evner, der kan bruges på usårlige enheder og kan fjerne visse usårlige tilstande (Cyclone osv.), har fået tilføjet ALT-beskrivelser, hvor der uddybes, at de kan bruges på usårlige enheder.",
  "732e_bug_fixes_notes23": "Opdaterede tooltips til de følgende evner:",
  "732e_bug_fixes_notes24": "Bane: Nightmare",
  "732e_bug_fixes_notes25": "Beastmasters vildsvin: Poison",
  "732e_bug_fixes_notes26": "Beastmaster: Wild Axes",
  "732e_bug_fixes_notes27": "Brewmasters Stormelement: Dispel Magic",
  "732e_bug_fixes_notes28": "Broodmothers edderkopper: Poison Sting",
  "732e_bug_fixes_notes29": "Lich: Ice Spire",
  "732e_bug_fixes_notes30": "Necronomicon Archer: Purge",
  "732e_bug_fixes_notes31": "Nullifier: Nullify",
  "732e_bug_fixes_notes32": "Oracle: Fortune's End",
  "732e_bug_fixes_notes33": "Satyr Banisher: Purge",
  "732e_bug_fixes_notes34": "Shadow Demon: Demonic Cleanse",
  "732e_bug_fixes_notes35": "Shadow Demon: Demonic Purge",
  "732e_bug_fixes_notes36": "Sven: Storm Hammer",
  "732e_bug_fixes_notes37": "Underlord: Pit of Malice",
  "732e_bug_fixes_notes38": "Genstande fra Collector's Cache 2 kan gives i gave, efter de er pakket ud (samme funktionalitet som Collector's Cache 1)",
  "732e_bug_fixes_notes39": "Brugergrænsefladen til talentopgradering kan nu tildeles en genvej under avancerede tilknytninger",
  "732e_bug_fixes_notes40": "Deaktiverede muligheden for at slutte sig til matchmaking, når parameteren -dev er aktiveret. Dette gjorde tredjepartsværktøjer i stand til at modificere grænsefladens elementer på måder, der kunne misbruges.",
  "732e_bug_fixes_notes41": "Deaktiverede flere måder at tilgå andres profiler på i løbet af valgfasen.",
  "732e_bug_fixes_notes42": "Når man klikker på fjender i topbjælken, får man vist deres sidst sete lokation og inventar"
}