// 3057.js

{
  "language": "turkish",
  "muerta_title": "Ölülerin İntikamı Güncellemesi",
  "muerta_title_pre": " ",
  "muerta_title_post": "GÜNCELLEMESİ",
  "muerta_title_date": "6 Mart 2023 - 4 Nisan 2023",
  "muerta_play_trailer": "Fragmanı Oynat",
  "new_hero_tag": "YENİ KAHRAMAN",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Kahraman",
  "muerta_navigation_event": "MİNİ OYUN",
  "muerta_navigation_janitor": "ÖZELLİKLER",
  "muerta_navigation_gameplay": "OYNANIŞ GÜNCELLEMESİ",
  "muerta_role1": "Taşıyıcı",
  "muerta_role2": "MENZİLLİ",
  "muerta_role3": "ANİ HASARCI",
  "muerta_role4": "ENGELLEYİCİ",
  "muerta_intro": "Korkutucu derecede isabetli atışları, çağırdığı ruhlar ve tabancaları sayesinde Muerta'nın can alma kabiliyeti o kadar iyiydi ki Ölüm, onu sağ kolu yaptı. Hedefinden şaşmayan bir intikam arzusuyla yanıp tutuşan ve iki tabancasıyla etrafına ölüm saçan Muerta, kayıp ruhları isteseler de istemeseler de öbür dünyaya gönderme konusunda uzmandır. Şayet Muerta, ikna edilmeye ihtiyaç duyan asi ruhlarla karşılaşırsa, onların biraz daha hızlı ölmelerine yardımcı olmak için dehşet verici hayalet formuna geçmekten beis duymaz.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta, bir düşmana veya ağaca çarptığında hasar veren, hedefi kısa süreliğine yavaşlatan ve ardından belirlenen yöne seken bir hayalet mermi ateşler. Mermi sektikten sonra yoluna çıkan tüm düşmanlara hasar verir ve bir kahramana çarptığında durur. Seken merminin isabet ettiği kahramanlar korkarak merminin sekme yönüne doğru koşturur.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Muerta, mezardan hedef bölgenin etrafında yavaşça dönen bir grup hayalet çağırır. Alanın içindeki düşmanların hareket ve saldırı hızları azalır. Düşmanların içinden geçen hayaletler hedefe hasar verir ve susturur.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Muerta'nın saldırıları kahramanlar öncelikli olmak üzere ikinci bir hedefe daha ateş edilmesine neden olabilir.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta dönüşerek fiziksel hasara bağışıklı hâle gelir. Tüm saldırı hasarları büyü hasarı olarak verilir. Muerta fazladan saldırı hasarı ve fazlı hareket kazanır. Muerta ruhani birimlere saldırabilir ancak büyü bağışıklığına sahip hedeflere hasar veremez.",
  "muerta_heroes_title": "MUERTA'YA AİT DETAYLI İSTATİSTİKLER İÇİN",
  "muerta_heroes_btn": "KAHRAMAN SAYFASINI GÖRÜNTÜLEYİN",
  "muerta_wallpaper": "Duvar Kâğıtları",
  "muerta_minigame_title_pre": " ",
  "muerta_minigame_title": "MİNİ OYUN",
  "muerta_minigame_subtitle": "HIZLI VE ÖLÜ...",
  "muerta_minigame_subtitle2": "Muerta'nın doğru cesetleri doğru mezarlara yerleştirmesi için yardıma ihtiyacı var... Ve burada siz devreye giriyorsunuz! Ölülerin İntikamı etkinliği boyunca, her maçtan önce size ortadan kaldırmanız için bir hedef atanır. Hedefi öldürdüğünüzde veya öldürülmesine yardım ettiğinizde puan kazanırsınız. Ancak düşmanınız da sizi öldürmeye çalışacağından dikkatli olun. Ayrıca daha fazla puan kazananın ödülü de ikiye katlanacak!",
  "muerta_minigame_rules_title": "ÇİÇEKLER",
  "muerta_minigame_rules_desc": "Size verilen hedefi öldürün veya öldürülmesine yardım ederek puan toplayın ve Muerta'nın <b>çiçeklerini</b> kazanın. Ayrıca hedefinizden daha fazla puan alırsanız daha çok kazanırsınız.",
  "muerta_minigame_rules_title2": "HAZİNE",
  "muerta_minigame_rules_desc2": "Çiçeklerinizi, etkinlik temalı öğeler de dâhil olmak üzere yepyeni öğe setleri içeren <b>Ölülerin İntikamı Sandığı</b> karşılığında takas edin.",
  "muerta_minigame_rules_title3": "Anahtarlar",
  "muerta_minigame_rules_desc3": "Bir <b>Ölülerin İntikamı Anahtarı</b> satın alarak sandığı açın ve içindeki ödülü ortaya çıkarın. Anahtarlar Dota Mağazası'ndan %1$s veya Parça Dükkânı'ndan 20 bin parça karşılığında satın alınabilir.",
  "muerta_treasure_title": "ÖLÜLERİN İNTİKAMI SANDIĞI",
  "muerta_treasure_content_desc": "Ölülerin İntikamı temalı öğe setlerinin kilidini açmak için daha fazla çiçek toplayın. Muerta, gelişini kutlamak için herkese beş ücretsiz anahtar verdi. Parçaları kullanarak veya Dota Mağazası'ndan satın alarak istediğiniz kadar sandığı açın.",
  "muerta_minigame_treasure_name1": "Heyula Avcısı",
  "muerta_minigame_treasure_name2": "Ölen Işık",
  "muerta_minigame_treasure_name3": "Sunak Topu",
  "muerta_minigame_treasure_name4": "Ölümcül Isı",
  "muerta_minigame_treasure_name5": "Ölümcül Engerek",
  "muerta_minigame_treasure_name6": "ÖLÜLERİN PELUŞU",
  "muerta_minigame_treasure_name7": "Ölümcül Tabanca",
  "muerta_minigame_treasure_name8": "Ruh Yılanı",
  "janitors_corner_title": "YENİ ÖZELLİKLER",
  "732e_patch_dotaplus_advancedstats_title": "GELİŞMİŞ MÜCADELE İSTATİSTİKLERİ",
  "732e_patch_dotaplus_advancedstats_subtitle": "Dota geçmişinizin verilerine inin",
  "732e_patch_dotaplus_advancedstats_desc": "Doğrudan profilinizden ulaşabileceğiniz gelişmiş mücadele istatistikleriyle kendinizin değerlendirmesini yapın ve kendinizi geliştirin. Dota Plus üyeleri artık tamamen yenilenmiş, gerçek zamanlı oyun analizlerine erişebilir. Tüm Dota geçmişinizi kahramana, role, oyun moduna ve daha fazlasına göre sıralayarak oyun tarzınızı daha iyi anlayın.",
  "732e_patch_dotaplus_advancedstats_desc2": "Son vuruşları yapmaya mı çabalıyorsunuz? Yeni yaratık istatistikleri bölümü size yardımcı olacaktır. Destek yeteneklerinizi mi geliştirmek istiyorsunuz? Destek istatistikleri artık bir nöbetçi gözden daha fazla şeyi açığa çıkarıyor.",
  "732e_patch_quickkeys_title": "KİŞİSELLEŞTİRİLEBİLİR HIZLI YETENEK KULLANMA",
  "732e_patch_quickkeys_subtitle": "Parmak Uçlarınızda Daha Hassas Kontrol",
  "732e_patch_quickkeys_desc": "Hızlı kullan ile artık birime özgü hangi yeteneklerin veya eşyaların tuşa basıldığında veya tuş bırakıldığında kullanılacağı ayrı ayrı ayarlanabilir. Ayarlar > Kısayollar menüsünde \"Birime Özgü Tuşlar\" ve \"Hızlı Kullanı Etkinleştir\" seçeneklerini etkinleştirerek yeteneklere ve eşyalara özel tuş atanabilir.",
  "732e_patch_friendslist_title": "ARKADAŞ LİSTESİ İYİLEŞTİRMELERİ",
  "732e_patch_friendslist_subtitle": "En İyi Dota Arkadaşlarınıza Hak Ettikleri Değeri Verin",
  "732e_patch_friendslist_desc": "Favori arkadaşlar özelliğiyle artık en çok oyun oynadığınız kişileri arkadaş listenizin en üstünde tutmak için etiketleyebilirsiniz. Arkadaşlarınızı favoriler, Dota oynayanlar, çevrimiçi ve çevrimdışı olarak sıralayabilir veya tam olarak kimi aradığınızı bulmak için yeni eklenen \"Arkadaş Arama\" özelliğini kulllanabilirsiniz.",
  "732e_patch_title": "OYNANIŞ GÜNCELLEMESİ",
  "732e_patch_subtitle": "7.32E VE DAHA FAZLASI",
  "732e_patch_turbo_title": "TURBO MODU DEĞİŞİKLİKLERİ",
  "732e_patch_turbo_intro": "Turbo modunun popülerliği arttığından bu modu oynayan oyuncu grubu için elimizden gelenin en iyisini yapmak istiyoruz. Genel oyun deneyimini iyileştirmeye devam ederken ileriye dönük yapacağımız daha fazla değişiklik için takipte kalın.",
  "732e_patch_turbo_change_notes1": "Bütün kahraman seçimleri artık gizli olacak.",
  "732e_patch_turbo_change_notes2": "Kahraman seçiminde geç seçme cezası kaldırıldı. Seçim süresi sona erdiğinde, seçimini yapmamış oyuncu ön izlemesini yaptığı bir kahramanı seçmek zorunda kalacak. Kahramanın seçilemediği veya ön izleme yapmadığı durumlarda rastgele bir kahraman verilecek.",
  "732e_patch_turbo_change_notes3": "Null Talisman, Wraith Band ve Bracer'ın bonusu artık 25. dakika yerine 12. dakikada iki katına çıkıyor.",
  "732e_patch_turbo_change_notes4": "Çağrılan tüm birimlerin kulelere verdiği fazladan hasar kaldırıldı. Kulvar yaratıkları ve hükmedilen yaratıklar gibi çağrılmayan birimler kulelere karşı diğer oyun modlarına nazaran Turbo modunda hâlâ daha güçlüdür.",
  "732e_patch_turbo_change_notes5": "Artık kahraman mücadelelerinde bir yıldız yerine iki yıldız kazanabilirsiniz.",
  "732e_patch_turbo_change_notes6": "Juggernaut'ın Kılıç Sureti Efsanesi gizemli eşyası Omnislash leşlerini artık tam olarak sayıyor.",
  "732e_patch_turbo_change_notes7": "Earthshaker'ın Gezegene İniş gizemli eşyası Echo Slam leş ve asistlerini artık tam olarak sayıyor. Zincirleme yetenek kullanma ve kombo hasarı takibi de etkinleştirildi.",
  "732e_patch_turbo_change_notes8": "Invoker'ın Karanlık Sanatların Kalıntıları ölümsüz eşyası Sun Strike leşlerini artık tam olarak sayıyor.",
  "732e_patch_turbo_change_notes9": "Lone Druid'in Yüce Uyanışın Xahryx Kazanı ölümsüz eşyası Entangling Claws etkisi altında geçen süreyi artık tam olarak sayıyor.",
  "732e_patch_turbo_change_notes10": "Kunkka'nın Yüce Uyanışın Leviathan Kılıcı ölümsüz eşyası Torrent etkisi altında vurulan düşmanları artık tam olarak sayıyor.",
  "732e_patch_turbo_change_notes11": "Storm Spirit'in Yüce Uyanışın Yıldırım Orkidesi ölümsüz eşyası Ball Lightning hasarını arıtk tam olarak sayıyor.",
  "732e_patch_turbo_change_notes12": "Lion'ın Yüzgeç Kral'ın Nazarlığı ölümsüz eşyası Hex etkisi altındaki düşmanları artık tam olarak sayıyor.",
  "732e_patch_turbo_change_notes13": "Leshrac'in Yüce Uyanışın İşkence Asası ölümsüz eşyası Split Earth ile sersemletilen düşmanları artık tam olarak sayıyor.",
  "732e_patch_turbo_change_notes14": "Legion Commander'ın Voth Domosh'un Kılıçları artık Duel zaferlerini sayıyor.",
  "732e_patch_turbo_change_notes15": "Aşağıdaki durumlar için gizemli eşya ilerlemesi güncellendi:",
  "732e_bug_fixes_title": "HATA DÜZELTMELERİ",
  "732e_bug_fixes_notes1": "İndirilen maç tekrarların maç detaylarının doğru bir şekilde yeniden oluşturulmaması sorunu düzeltildi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]sorun 349[/u][/url]).",
  "732e_bug_fixes_notes2": "Kahramanların modellerinin, malzemelerinin ve diğer unsurlarının bazen görünmediği ve onları doğru bir şekilde görmek için tekrar bağlanmanızı gerektiren bir sorun düzeltildi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]sorun 6070[/u][/url]).",
  "732e_bug_fixes_notes3": "Refresher Shard kullanıldığında Refresher Orb'un bazen dolum süresine girmemesine neden olan bir hata düzeltildi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]sorun 6668[/u][/url]).",
  "732e_bug_fixes_notes4": "Monkey King'in Tree Dance yeteneğinin çok uzun kullanma menzillerinde devreye girmediği bir hata düzeltildi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]sorun 717[/u][/url]).",
  "732e_bug_fixes_notes5": "Belirli menzillerden kullanıldığında Lifestealer'ın Infest etkisi altında yaptığı ilk saldırıyı ıskalamasına neden olan bir hata düzeltildi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]sorun 6801[/u][/url]).",
  "732e_bug_fixes_notes6": "Jinada ve Geminate saldırıları artık Break etkisindeyken kullanılabilirken Susturma etkisinde kullanılamaz. Bu davranış benzer yetenekler için de geçerlidir ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]sorun 6779[/u][/url]).",
  "732e_bug_fixes_notes7": "Tusk'ın Snowball hareketi başarısız olduğunda Snowball'un parçacık efektlerinin yok olmamasına neden olan bir hata düzeltildi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]sorun 6805[/u][/url]).",
  "732e_bug_fixes_notes8": "Snowball içindeki kahramanlar artık Fiend's Gate kullanamayacak ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]sorun 6670[/u][/url]).",
  "732e_bug_fixes_notes9": "Snowball kullanan kahramanlar bir önceki durum etkilerinin yanı sıra artık yere bağlanacak. Bu, Snowball sırasında belirli hareket yeteneklerini kullanırken parçacık efekti sorunlarına neden oluyordu ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]sorun 6805[/u][/url]).",
  "732e_bug_fixes_notes10": "Keeper of the Light'ın Spirit Form'dayken Illuminate kullanarak yaptığı dost iyileştirmesinin Keeper of the Light'ın iyileştirme artırımından etkilenmemesine neden olan bir hata düzeltildi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]sorun 2176[/u][/url]).",
  "732e_bug_fixes_notes11": "Primal Beast'in Pulverize yeteneğinin, Lion'ın Earth Spike yeteneği gibi başka bir büyüden gelen dikey bir hareketle aynı anda güçlü bir etkisizleştirme uygulandığında, kahramanların bazen Primal Beast'e takılıp kalmasına neden olan bir hata düzeltildi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]sorun 3528[/u][/url]).",
  "732e_bug_fixes_notes12": "Uygun hünerlerin seçilmiş olmasına rağmen Tusk'ın Ice Shards ve Sven'in God's Strength yeteneklerinin yenetek ipuçlarında dolum süresinin azalmamış olarak gösterilmesi sorunu düzeltildi. Bu sadece yetenek ipucu metninde yapılmış bir değişikliktir ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]sorun 575[/u][/url]).",
  "732e_bug_fixes_notes13": "Yalnızca gerekli hüner seçildiği veya Aghanim's Scepter ile yükseltildiği takdirde şarja sahip olan yetenekler dâhil olmak üzere şarja dayalı yeteneklerde eksik olan bekleme süresi göstergeleri eklendi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]sorun 315[/u][/url]).",
  "732e_bug_fixes_notes14": "Spirit Vessel iyileştirmesinin oyun sonrası ekranında ''İyileştirme'' kısmına eklenmemesi sorunu düzeltildi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]sorun 213[/u][/url]).",
  "732e_bug_fixes_notes15": "Etrafta herhangi bir hedef olmadan Scream of Pain kullanıldığında Queen of Pain'in eksik parçacık ve ses efektleri düzeltildi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]sorun 5429[/u][/url]).",
  "732e_bug_fixes_notes16": "Oyunun başlangıcında bağlantısı kesilmiş oyuncuların oyun içi rolleri artık doğru gösteriliyor.",
  "732e_bug_fixes_notes17": "Omniknight'ın Heavenly Grace yeteneğinin Break ile devre dışı kalması düzeltildi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]sorun1649[/u][/url]).",
  "732e_bug_fixes_notes18": "Troll Warlord'un Battle Trance etkisi altındayken kullanma menzilinin dışına Whirling Axes (Menzilli) kullanma emri vererek zorla saldırmayı devre dışı bırakması düzeltildi. Bu şekilde kullanmak artık Whirling Axes (Menzilli) yeteneğinin o yönde kullanılmasını sağlayacaktır.",
  "732e_bug_fixes_notes19": "Oyuncunun sesi kapatılmışsa bağlantının kesilmesi ve yeniden bağlanmasıyla ilgili sohbet mesajlarının gösterilmediği bazı durumlar düzeltildi.",
  "732e_bug_fixes_notes20": "Queen of Pain ve Faceless Void'in gizemli eşyalarının ikincil tarzlarını açmak bir gereksinim olarak taş açıklamalarına \"kazanılan maçlarda\" ibaresi eklendi. Bu yalnızca metin düzeyinde bir değişikliktir; bu iki kahramanın gizemli eşyalarında ilerleme kaydetmek için galibiyet elde etmek her zaman gerekliydi.",
  "732e_bug_fixes_notes21": "Kuvvetlendirme Kalkanı'nın ipucuna ilave bilgiler eklendi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]sorun 6786[/u][/url]).",
  "732e_bug_fixes_notes22": "Hasar verilemez birimleri hedef alabilen ve bazı hasar verilemez durumları (Cyclone gibi) etkisiz hâle getirebilen yeteneklere, hasar verilemez birimleri hedef alabildiklerini belirtmek için ALT tuşuna basıldığında çıkan açıklamalar eklendi.",
  "732e_bug_fixes_notes23": "Aşağıdaki yeteneklerin araç ipuçları güncellendi:",
  "732e_bug_fixes_notes24": "Bane - Nightmare",
  "732e_bug_fixes_notes25": "Beastmaster - Boar Poison",
  "732e_bug_fixes_notes26": "Beastmaster - Wild Axes",
  "732e_bug_fixes_notes27": "Brewmaster - Storm Brewling'in Dispel Magic Yeteneği",
  "732e_bug_fixes_notes28": "Broodmother - Spiderling'in Poison Sting Yeteneği",
  "732e_bug_fixes_notes29": "Lich - Ice Spire",
  "732e_bug_fixes_notes30": "Necronomicon Archer - Purge",
  "732e_bug_fixes_notes31": "Nullifier - Nullify",
  "732e_bug_fixes_notes32": "Oracle - Fortune's End",
  "732e_bug_fixes_notes33": "Satyr Banisher - Purge",
  "732e_bug_fixes_notes34": "Shadow Demon - Demonic Cleanse",
  "732e_bug_fixes_notes35": "Shadow Demon - Demonic Purge",
  "732e_bug_fixes_notes36": "Sven - Storm Hammer",
  "732e_bug_fixes_notes37": "Underlord - Pit of Malice",
  "732e_bug_fixes_notes38": "Koleksiyoncunun Zulası 2'deki öğeler, tıpkı Koleksiyoncunun Zulası 1 öğeleri gibi artık kilidi açıldıktan sonra hediye edilebilecek.",
  "732e_bug_fixes_notes39": "Hüner geliştirme arayüzüne \"Gelişmiş Tuş Atamaları\" kısmından tuş ataması yapmak artık mümkün.",
  "732e_bug_fixes_notes40": "-dev parametresi kullanılırken artık eşleştirmeye katılınamayacak. Bu, üçüncü taraf araçların arayüzdeki bazı unsurları haksız avantaj elde etmek için değiştirebilmesine olanak sağlıyordu.",
  "732e_bug_fixes_notes41": "Seçim aşamasında birisinin profiline erişim sağlamak için kullanılan bazı yollar devre dışı bırakıldı.",
  "732e_bug_fixes_notes42": "Oyun sırasında üst çubuktan düşmanlara tıklamak artık onların son görülen konumunu ve envanter durumunu gösterecek."
}