// 542.js

{
  "language": "swedish",
  "muerta_title": "Uppdateringen Dead Reckoning",
  "muerta_title_pre": " ",
  "muerta_title_post": "Uppdateringen",
  "muerta_title_date": "6 mars – 4 april 2023",
  "muerta_play_trailer": "Spela trailer",
  "new_hero_tag": "Ny hjälte",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Hjälte",
  "muerta_navigation_event": "Minispel",
  "muerta_navigation_janitor": "Funktioner",
  "muerta_navigation_gameplay": "Speluppdatering",
  "muerta_role1": "Carry",
  "muerta_role2": "Ranged",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "Hennes fruktade trickskott, framkallade andar, extra sidovapen och talang för att döda var så imponerande att hon blev anlitad av döden själv. Den hämndgiriga mördarmaskinen Muerta använder sina pistoler för att föra förlorade själar till den andra sidan, oavsett om de vill det eller inte. Om det behövs mer övertalning för att de ska dö lite snabbare, visar hon gärna upp sitt sanna väsen som en mordisk mara i andeform.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta avfyrar ett spökaktigt skott mot en fiendeenhet eller ett träd. När kulan träffar utdelar den skada och saktar sedan ned för ett ögonblick, innan den rikoschetterar i målets riktning. Rikoschetten skadar alla enheter den passerar igenom och stannar när den träffar en hjälte. Hjältar som träffas av rikoschetten springer i samma riktning som skottet.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Framkallar en grupp gengångare som långsamt omringar valt område. Fienderna i området saktas ned och får minskad attackskada. Gengångare utdelar skada och tystar fiender de passerar igenom.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Muertas attacker har nu en chans att avfyra en andra runda skott mot en annan måltavla. Hjältar prioriteras.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta förvandlas och blir immun mot fysisk skada. All hennes attackskada utdelas som magisk skada. Muerta får extra attackskada och förmågan att förflytta sig igenom enheter. Muerta kan attackera eteriska enheter, men inte skada enheter immuna mot magi.",
  "muerta_heroes_title": "För fler detaljer om Muerta",
  "muerta_heroes_btn": "Besök hjältens informationssida",
  "muerta_wallpaper": "Bakgrunder",
  "muerta_minigame_title_pre": " ",
  "muerta_minigame_title": "Minispel",
  "muerta_minigame_subtitle": "SNABBARE ÄN DÖDEN …",
  "muerta_minigame_subtitle2": "Muerta behöver hjälp att föra de rätta varma kropparna till de rätta nygrävda gravarna – och till det behövs du! Du tilldelas en måltavla innan varje Dota-match under Dead Reckoning-eventet och får poäng för kills och assister. Men passa dig – din motståndare är ute efter dig också, och den som tar flest poäng får en dubbel så hög belöning!",
  "muerta_minigame_rules_title": "Blommor",
  "muerta_minigame_rules_desc": "Få kills och assister mot din tilldelade måltavla för att ta poäng och tjäna Muertas <b>blommor</b>. Ta fler poäng än din måltavla för att öka din förtjänst.",
  "muerta_minigame_rules_title2": "Skatt",
  "muerta_minigame_rules_desc2": "Byt in dina blommor mot <b>Dead Reckoning-kistor</b>, fyllda med helt nya föremålsset, inklusive föremål med eventtemat.",
  "muerta_minigame_rules_title3": "Nycklar",
  "muerta_minigame_rules_desc3": "Köp en <b>Dead Reckoning-nyckel</b> för att låsa upp kistan och avslöja belöningen där i. Nycklar finns tillgängliga i skärvbutiken för %1$s eller 20 000 skärvor per styck.",
  "muerta_treasure_title": "Dead Reckoning-kista",
  "muerta_treasure_content_desc": "Plocka hem fler blommor för extra chanser att låsa upp föremålsset med Dead Reckoning-tema. Muerta har beviljat fem nycklar till alla, som avspark på firandet. Skaffa så många du behöver med skärvor eller från Dota-butiken.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "Nya funktioner",
  "732e_patch_dotaplus_advancedstats_title": "Avancerad stridsstatistik",
  "732e_patch_dotaplus_advancedstats_subtitle": "Dyk ned i din Dota-historik",
  "732e_patch_dotaplus_advancedstats_desc": "Utvärdera och ta ditt spelande till nya höjder med avancerad stridsstatistik direkt i din profil. Dota Plus-medlemmar har nu tillgång till en helt förnyad spelanalys i realtid. Fördjupa dig i din spelstil genom att sortera din kompletta Dota-historik efter hjälte, roll, spelläge och mer.",
  "732e_patch_dotaplus_advancedstats_desc2": "Fokuserar du på dödsstötar? Creepstatistiken har vad du behöver. Du kanske vill förbättra dina skills när det gäller support? Supportstatistiken avslöjar nu mer än en Sentry Ward.",
  "732e_patch_quickkeys_title": "Anpassningsbar användning",
  "732e_patch_quickkeys_subtitle": "Förbättrad kontroll",
  "732e_patch_quickkeys_desc": "Med snabbanvändning kan man nu individuellt tilldela vilka enhetsspecifika förmågor och föremål som aktiveras vid knappintryckning eller -släpp. Prova genom att välja ”Enhetsspecifika snabbknappar” och ”Aktivera snabbanvändning” för förmågor och föremål i snabbknappsfliken under Inställningar.",
  "732e_patch_friendslist_title": "Förbättringar av vänlistan",
  "732e_patch_friendslist_subtitle": "Ge dina bästa Dota-vänner behandlingen de förtjänar",
  "732e_patch_friendslist_desc": "Du kan nu tagga personerna du spelar mest med för att behålla dem högst upp på din vänlista. Sortera in dina vänner i Favoriter, Spelar Dota, Online och Offline. Eller använd den nya vänsökfunktionen för att hitta exakt den du letar efter.",
  "732e_patch_title": "Speluppdatering",
  "732e_patch_subtitle": "7.32E OCH MER",
  "732e_patch_turbo_title": "Ändringar av turboläget",
  "732e_patch_turbo_intro": "Eftersom att turboläget blir alltmer populärt vill vi se till att vi gör allt vi kan för den gruppen av spelare. Håll ögonen öppna efter fler ändringar framöver då vi fortsätter att förbättra spelupplevelsen.",
  "732e_patch_turbo_change_notes1": "Alla hjälteval är nu dolda",
  "732e_patch_turbo_change_notes2": "Tog bort fasen med straff när man väljer hjältar. När den vanliga valtiden upphör kan den som inte valt en hjälte tvingas välja den hjälte de har markerat. Man får en slumpvald hjälte om den markerade hjälten inte är tillgänglig eller om man inte markerat någon.",
  "732e_patch_turbo_change_notes3": "Null Talisman, Wraith Band och Bracer fördubblar sina bonusar efter 12 minuter istället för efter 25 minuter.",
  "732e_patch_turbo_change_notes4": "Tog bort bonusskadan mot torn från alla framkallade enheter. Enheter som inte framkallats (lane creeps, dominerade creeps) är fortfarande starkare mot torn.",
  "732e_patch_turbo_change_notes5": "Du kan nu tjäna två stjärnor för hjälteutmaningar istället för en.",
  "732e_patch_turbo_change_notes6": "Juggernauts Bladeform Legacy-arcana ger nu full utdelning för kills med Omnislash.",
  "732e_patch_turbo_change_notes7": "Earthshakers Planetfall-arcana ger nu full utdelning för kills och assister med Echo Slam. Spårning av förmågor i rad och kombinationsskada är också aktiverad.",
  "732e_patch_turbo_change_notes8": "Invokers odödliga föremål Dark Artistry Throwback ger nu full utdelning för kills med Sun Strike.",
  "732e_patch_turbo_change_notes9": "Lone Druids odödliga föremål Cauldron of Xahryx of Eminent Revival ger nu full utdelning under Entagling Claws varaktighet.",
  "732e_patch_turbo_change_notes10": "Kunkkas odödliga föremål Leviathan Whale Blade of Eminent Revival ger nu full utdelning när man träffar hjältar med Torrent.",
  "732e_patch_turbo_change_notes11": "Storm Spirits odödliga föremål The Lightning Orchid of Eminent Revival ger nu full utdelning för skada med Ball Lightning.",
  "732e_patch_turbo_change_notes12": "Lions odödliga föremål Fin King's Charm of Eminent Revival ger nu full utdelning vid användning av Hex på fiender.",
  "732e_patch_turbo_change_notes13": "Leshracs odödliga föremål Tormented Staff of Eminent Revival ger nu full utdelning vid bedövning av fiender med Split Earth.",
  "732e_patch_turbo_change_notes14": "Legion Commanders arcana räknar nu med Duel-vinster.",
  "732e_patch_turbo_change_notes15": "Följande arcana-framsteg har uppdaterats:",
  "732e_bug_fixes_title": "Buggåtgärder",
  "732e_bug_fixes_notes1": "Åtgärdade problem där sparade repriser inte fick all matchinformation. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]Fel 349[/u][/url])",
  "732e_bug_fixes_notes2": "Åtgärdade bugg där hjältar ibland saknade modeller/material/osv. tills du återanslöt till matchen. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]Fel 6070[/u][/url])",
  "732e_bug_fixes_notes3": "Åtgärdade en bugg där Refresher Orb inte alltid fick cooldown när Refresher Shard användes. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]Fel 6668[/u][/url])",
  "732e_bug_fixes_notes4": "Åtgärdade en bugg där Monkey Kings Tree Dance inte gick att använda vid riktigt långa avstånd. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]Fel 717[/u][/url])",
  "732e_bug_fixes_notes5": "Åtgärdade en bugg där Lifestealer missade sin första attack med förmågan Infest om den användes vid specifika avstånd. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]Fel 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Attackerna Jinada och Geminate kan nu utföras medan hjältar påverkas av Break, men inte när de har tystats. Beteendet stämmer nu överens med andra liknande förmågor i spelet. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]Fel 6779[/u][/url])",
  "732e_bug_fixes_notes7": "Åtgärdade bugg där partikeleffekten från Tusks förmåga Snowball inte försvann om förmågan avbröts. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]Fel 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Hjältar kan inte längre kanalisera Fiend's Gate inifrån en snöboll. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]Fel 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Hjältar som använder förmågan Snowball rotas nu utöver de tidigare statuseffekterna. Detta orsakade problem med partikeleffekter när vissa rörelseförmågor användes under Snowball. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]Fel 6805[/u][/url])",
  "732e_bug_fixes_notes10": "Åtgärdade en bugg där helande på allierade med Keeper of the Lights Illuminate med Spirit Form inte inkluderade förstärkning av helande. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]Fel 2176[/u][/url])",
  "732e_bug_fixes_notes11": "Åtgärdade ett problem där Primal Beasts Pulverize ibland fick hjältar att permanent fastna i Primal Beast om hård dispel användes av en annan förmåga under vertikal rörelse, som Lions Earth Spike. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]Fel 3528[/u][/url])",
  "732e_bug_fixes_notes12": "Åtgärdade att verktygstips för Tusks Ice Shards och Svens God's Strength inte visade reducerade cooldownvärden när lämpliga talanger hade valts. Detta är enbart en textändring. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]Fel 575[/u][/url])",
  "732e_bug_fixes_notes13": "Åtgärdade cooldownindikatorer som saknades för laddningsbaserade förmågor, inklusive förmågor som bara har laddningar när en motsvarande talang eller Aghanim-uppgradering väljs. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]Fel 315[/u][/url])",
  "732e_bug_fixes_notes14": "Åtgärdade att helande med Spirit Vessel inte räknades på skärmen efter matchen. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]Fel 213[/u][/url])",
  "732e_bug_fixes_notes15": "Åtgärdade att Queen of Pains Scream of Pain saknade partikel- och ljudeffekter när förmågan användes utan några mål inom räckhåll. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]Fel 5429[/u][/url])",
  "732e_bug_fixes_notes16": "Roller i spelet visas nu korrekt för spelare som frånkopplas i början av spelet.",
  "732e_bug_fixes_notes17": "Åtgärdade att Omniknights Heavenly Grace inaktiverades av Break. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]Fel 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Åtgärdade en bugg som gjorde att Troll Warlord kunde åsidosätta Battle Trance-påtvingade attackkommandon genom att kasta Whirling Axes (för avståndskamp) utanför räckvidden. Istället använder han nu Whirling Axes (för avståndskamp) i den riktningen.",
  "732e_bug_fixes_notes19": "Åtgärdade några fall där chattmeddelanden (om exempelvis frånkoppling/anslutning) inte visades om spelaren var mjutad.",
  "732e_bug_fixes_notes20": "Lade till texten ”i matcher du vann” i ädelstensbeskrivningen för upplåsning av de sekundära arcana-stilarna för Queen of Pain och Faceless Void. Detta är bara en textändring. Dessa två hjältars arcana-framsteg har alltid krävt vinster.",
  "732e_bug_fixes_notes21": "Lade till ytterligare information i beskrivningen för Glyph of Fortification. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]Fel 6786[/u][/url])",
  "732e_bug_fixes_notes22": "Lade till verktygstips (ALT) för förmågor som kan användas på osårbara enheter och ta bort vissa osårbara tillstånd (Cyclone osv.).",
  "732e_bug_fixes_notes23": "Uppdaterade verktygstips för följande förmågor:",
  "732e_bug_fixes_notes24": "Bane: Nightmare",
  "732e_bug_fixes_notes25": "Beastmaster: Boar Poison",
  "732e_bug_fixes_notes26": "Beastmaster: Wild Axes",
  "732e_bug_fixes_notes27": "Brewmaster: Storm Brewlings Dispel Magic",
  "732e_bug_fixes_notes28": "Broodmother: Spiderlings Poison Sting",
  "732e_bug_fixes_notes29": "Lich: Ice Spire",
  "732e_bug_fixes_notes30": "Necronomicon Archer: Purge",
  "732e_bug_fixes_notes31": "Nullifier: Nullify",
  "732e_bug_fixes_notes32": "Oracle: Fortune's End",
  "732e_bug_fixes_notes33": "Satyr Trickster: Purge",
  "732e_bug_fixes_notes34": "Shadow Demon: Demonic Cleanse",
  "732e_bug_fixes_notes35": "Shadow Demon: Demonic Purge",
  "732e_bug_fixes_notes36": "Sven: Storm Hammer",
  "732e_bug_fixes_notes37": "Underlord: Pit of Malice",
  "732e_bug_fixes_notes38": "Föremål från Collector's Cache 2 kan ges som gåva efter öppning (på samma sätt som med Collector's Cache 1).",
  "732e_bug_fixes_notes39": "Användargränssnitt för talanguppgradering kan nu tilldelas en snabbknapp under Avancerade knappbindningar.",
  "732e_bug_fixes_notes40": "Inaktiverade möjligheten att gå med i matchning när parametern -dev är aktiverad. Detta gjorde att verktyg från en tredje part kunde modifiera element i användargränssnittet på sätt som kunde utnyttjas.",
  "732e_bug_fixes_notes41": "Inaktiverade några andra sätt att få åtkomst till någons profil under valfasen.",
  "732e_bug_fixes_notes42": "Om man klickar på fiender i det övre fältet i en match så visas deras senaste plats/förrådsstatus."
}