// 6314.js

{
  "language": "polish",
  "muerta_title": "Aktualizacja Porachunki Umarłych",
  "muerta_title_pre": "Aktualizacja",
  "muerta_title_post": " ",
  "muerta_title_date": "6 marca – 4 kwietnia 2023",
  "muerta_play_trailer": "Odtwórz zwiastun",
  "new_hero_tag": "Nowa bohaterka",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Bohaterka",
  "muerta_navigation_event": "Minigra",
  "muerta_navigation_janitor": "Funkcje",
  "muerta_navigation_gameplay": "Aktualizacja rozgrywki",
  "muerta_role1": "Carry",
  "muerta_role2": "Dystansowy",
  "muerta_role3": "Nuker",
  "muerta_role4": "Wyłączający",
  "muerta_intro": "Dzięki swej wzbudzającej postrach wprawie strzeleckiej, przyzywanym duszom i broni na podorędziu smykałka Muerty do odbierania życia była tak imponująca, że sama Śmierć postanowiła ją zatrudnić. Jako uzbrojone w dwa pistolety wcielenie zemsty o zabójczym spojrzeniu i precyzji prowadzi ona krnąbrne dusze na drugą stronę, niezależnie od tego, czy chcą się tam dostać, czy nie. A jeśli potrzeba im dodatkowej perswazji i ma to pomóc im szybciej umrzeć, Muerta bez wahania ujawnia swoje prawdziwe oblicze morderczej zjawy z koszmarów.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta precyzyjnie wystrzeliwuje widmowy pocisk we wrogą jednostkę lub drzewo. Pocisk po uderzeniu w cel zadaje obrażenia i chwilowo go spowalnia, a następnie odbija się rykoszetem we wskazanym kierunku. Rykoszet zadaje obrażenia wszystkim jednostkom, przez które przejdzie, i zatrzyma się, jeśli trafi bohatera. Bohaterowie trafieni rykoszetem pobiegną w kierunku strzału.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Przyzywa grupę upiorów, które powoli okrążają wskazane miejsce. Wrogowie znajdujący się na tym obszarze mają zmniejszoną szybkość ruchu i ataku. Upiory zadają obrażenia i uciszają przeciwników, przechodząc przez nich.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Ataki Muerty mają szansę wystrzelić drugi raz w inny cel (bohaterowie mają priorytet).",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta ulega przemianie, stając się niewrażliwą na obrażenia fizyczne. Wszystkie jej obrażenia od ataku stają się obrażeniami magicznymi. Muerta zyskuje dodatkową szybkość ataku oraz ruch fazowy. Muerta może atakować jednostki eteryczne, ale nie zadaje obrażeń celom niewrażliwym na magię.",
  "muerta_heroes_title": "Aby zobaczyć szczegółowe statystyki Muerty",
  "muerta_heroes_btn": "Zobacz stronę szczegółów bohaterki",
  "muerta_wallpaper": "Tapety",
  "muerta_minigame_title_pre": "Minigra",
  "muerta_minigame_title": " ",
  "muerta_minigame_subtitle": "SZYBCY I MARTWI…",
  "muerta_minigame_subtitle2": "Muerta potrzebuje pomocy z wrzuceniem właściwych ciepłych ciał do właściwych świeżych grobów... i w tym momencie zjawiacie się właśnie wy! Podczas wydarzenia Porachunki Umarłych zostanie przydzielony wam cel przed każdym meczem w Dota. Zdobywajcie punkty za zabójstwa i asysty, ale uważajcie – wasz przeciwnik też jest żądny krwi (waszej), a gracz z większą liczbą punktów otrzyma podwójną nagrodę!",
  "muerta_minigame_rules_title": "Kwiaty",
  "muerta_minigame_rules_desc": "Zabijajcie i asystujcie przy zabójstwach przydzielonego wam celu, by zdobyć punkty i otrzymać <b>kwiaty</b> Muerty. Zdobądźcie więcej punktów niż wasz cel, by otrzymać więcej kwiatów.",
  "muerta_minigame_rules_title2": "Skarb",
  "muerta_minigame_rules_desc2": "Wymieniajcie swoje kwiaty na <b>Skrzynie Porachunków Umarłych</b> wypełnione całkowicie nowymi zestawami przedmiotów, w tym przedmiotami z motywem wydarzenia.",
  "muerta_minigame_rules_title3": "Klucze",
  "muerta_minigame_rules_desc3": "Kupujcie <b>Klucze Porachunków Umarłych</b>, by odblokować skrzynie i odkryć znajdującą się w nich nagrodę. Klucze można kupić w sklepie odłamków za %1$s lub 20 000 odłamków.",
  "muerta_treasure_title": "Skrzynia Porachunków Umarłych",
  "muerta_treasure_content_desc": "Zdobądźcie więcej kwiatów, by otrzymać dodatkowe szanse na odblokowanie tych zestawów przedmiotów z motywem wydarzenia. Muerta przyznała każdemu po 5 kluczy w ramach rozpoczęcia świętowania. Zgromadźcie tyle, ile potrzebujecie, korzystając z odłamków lub odwiedzając Sklep Dota.",
  "muerta_minigame_treasure_name1": "Widmowy Łowca",
  "muerta_minigame_treasure_name2": "Umierające Światło",
  "muerta_minigame_treasure_name3": "Kula z Ołtarza",
  "muerta_minigame_treasure_name4": "Gorączka Śmierci",
  "muerta_minigame_treasure_name5": "Żmija Śmierci",
  "muerta_minigame_treasure_name6": "Kukła Umarłych",
  "muerta_minigame_treasure_name7": "Sztywny Cyngiel",
  "muerta_minigame_treasure_name8": "Wąż Dusz",
  "janitors_corner_title": "Nowe funkcje",
  "732e_patch_dotaplus_advancedstats_title": "Zaawansowane statystyki bitewne",
  "732e_patch_dotaplus_advancedstats_subtitle": "Spójrzcie na dane swojej historii w Dota",
  "732e_patch_dotaplus_advancedstats_desc": "Rośnijcie w siłę i oceniajcie swoją grę dzięki zaawansowanym statystykom bitewnym bezpośrednio w waszych profilach. Członkowie Dota Plus mają teraz dostęp do całkowicie przerobionych danych analitycznych rozgrywek w czasie rzeczywistym. Spójrzcie na szeroki przekrój swojego stylu gry, porządkując swoją pełną historię w Dota 2 według bohatera, roli, trybu gry i nie tylko.",
  "732e_patch_dotaplus_advancedstats_desc2": "Skupiacie się na ostatnich trafieniach? Wasza grupa statystyk o stworach już się tym zajęła. A może staracie się lepiej wspierać swoich sojuszników? Statystyki o bohaterach wsparcia od teraz pokażą wam więcej niż znak strażniczy.",
  "732e_patch_quickkeys_title": "Personalizowane szybkie rzucanie",
  "732e_patch_quickkeys_subtitle": "Dokładniejsza kontrola w zasięgu waszych opuszków",
  "732e_patch_quickkeys_desc": "Gracze korzystający z szybkiego rzucania mogą od teraz określić, które przedmioty i umiejętności z daną jednostką mają być aktywowane po naciśnięciu, a które po zwolnieniu klawisza. Sprawdźcie tę opcję, przechodząc do zakładki „Skróty klawiszowe” w ustawieniach gry i włączając „Skróty dla jednostek” i „Szybkie rzucanie”.",
  "732e_patch_friendslist_title": "Ulepszenia listy znajomych",
  "732e_patch_friendslist_subtitle": "Traktujcie swoich najlepszych przyjaciół w Dota 2 tak, jak na to zasługują",
  "732e_patch_friendslist_desc": "Dzięki funkcji ulubionych możecie od teraz oznaczać ludzi, z którymi gracie najwięcej, by mieć ich pod ręką na samej górze swojej listy znajomych. Sortujcie znajomych według ulubionych, grających w Dota, online i offline lub użyjcie nowo dodanej wyszukiwarki znajomych, by znaleźć dokładnie tę osobę, której szukacie.",
  "732e_patch_title": "Aktualizacja rozgrywki",
  "732e_patch_subtitle": "7.32E I WIĘCEJ",
  "732e_patch_turbo_title": "Zmiany w trybie Turbo",
  "732e_patch_turbo_intro": "Jako że popularność trybu Turbo wzrosła, chcemy upewnić się, że robimy wszystko, co tylko możemy dla tej grupy graczy. Wyczekuj kolejnych zmian w ramach naszych ciągłych prac nad ulepszaniem ogólnej rozgrywki.",
  "732e_patch_turbo_change_notes1": "Wszystkie wybory bohaterów są ukryte.",
  "732e_patch_turbo_change_notes2": "Usunięto fazę kary podczas wybierania bohaterów. Po zakończeniu standardowego czasu na wybór, wszelkie osoby bez wybranego bohatera zostaną zmuszone do wybrania jakiegokolwiek bohatera, jaki był wstępnie zaznaczony. Jeśli ten bohater jest niedostępny lub nie zaznaczono żadnego, gracze otrzymają losowego bohatera.",
  "732e_patch_turbo_change_notes3": "Zmieniono czas podwojenia premii przedmiotów Null Talisman, Wraith Band i Bracer z 25 minut na 12 minut.",
  "732e_patch_turbo_change_notes4": "Usunięto dodatkowe obrażenia zadawane wieżom przez wszystkie przyzwane jednostki. Jednostki nieprzyzwane (stwory na ścieżce i zdominowane) są wciąż mocniejsze przeciwko wieżom w porównaniu do gier poza trybem Turbo.",
  "732e_patch_turbo_change_notes5": "Umożliwiono zdobycie dwóch gwiazdek z wyzwań bohaterów zamiast tylko jednej.",
  "732e_patch_turbo_change_notes6": "Arkana Juggernauta „Dziedzictwo Miecza” od teraz w pełni zaliczają się na potrzeby zabójstw umiejętnością Omnislash.",
  "732e_patch_turbo_change_notes7": "Arkana Earthshakera „Kosmogrom” od teraz w pełni zaliczają się na potrzeby zabójstw i asyst umiejętnością Echo Slam. Umożliwiono także śledzenie obrażeń kombinacją oraz serii umiejętności.",
  "732e_patch_turbo_change_notes8": "Wiekopomny zestaw Invokera „Przypomnienie Mrocznego Kunsztu” od teraz w pełni zalicza się na potrzeby zabójstw umiejętnością Sun Strike.",
  "732e_patch_turbo_change_notes9": "Wiekopomny zestaw Lone Druida „Kocioł Xahryxa Rychłego Odrodzenia” od teraz w pełni zalicza się na potrzeby czasu trwania umiejętności Entangling Claws.",
  "732e_patch_turbo_change_notes10": "Wiekopomny zestaw Kunkki „Ostrze Wieloryba-Lewiatana Rychłego Odrodzenia” od teraz w pełni zalicza się na potrzeby trafiania bohaterów umiejętnością Torrent.",
  "732e_patch_turbo_change_notes11": "Wiekopomny zestaw Storm Spirita „Orchidea Gromu Rychłego Odrodzenia” od teraz w pełni zalicza się na potrzeby obrażeń umiejętnością Ball Lightning.",
  "732e_patch_turbo_change_notes12": "Wiekopomny zestaw Liona „Talizman Płetwiastego Króla Rychłego Odrodzenia” od teraz w pełni zalicza się na potrzeby przemiany wrogów umiejętnością Hex.",
  "732e_patch_turbo_change_notes13": "Wiekopomny zestaw Leshraca „Udręczone Berło Rychłego Odrodzenia” od teraz w pełni zalicza się na potrzeby ogłuszania wrogów umiejętnością Split Earth.",
  "732e_patch_turbo_change_notes14": "Arkana Legion Commander „Ostrza Voth Domosh” od teraz zliczają wygrane pojedynki umiejętności Duel.",
  "732e_patch_turbo_change_notes15": "Zaktualizowano zasady postępu w zdobywaniu arkanów dla następujących przedmiotów:",
  "732e_bug_fixes_title": "Poprawki błędów",
  "732e_bug_fixes_notes1": "Naprawiono problem powodujący, że przy zapisywanych powtórkach nie pojawiały się szczegóły meczu ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]problem 349[/u][/url]).",
  "732e_bug_fixes_notes2": "Naprawiono błąd powodujący, że bohaterowie czasami tracili swoje modele, materiały itp. do czasu ponownego połączenia z grą ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]problem 6070[/u][/url]).",
  "732e_bug_fixes_notes3": "Naprawiono błąd powodujący, że czas oczekiwania Refresh Orb czasami nie był aktywowany po użyciu Refresher Shard ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]problem 6668[/u][/url]).",
  "732e_bug_fixes_notes4": "Naprawiono błąd powodujący, że czasami nie można było użyć umiejętności Tree Dance od Monkey Kinga na bardzo dużym zasięgu rzutu ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]problem 717[/u][/url]).",
  "732e_bug_fixes_notes5": "Naprawiono błąd powodujący, że Lifestealer chybiał swoim pierwszym atakiem umiejętnością Infested, jeśli użyto jej na określoną odległość ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]problem 6801[/u][/url]).",
  "732e_bug_fixes_notes6": "Od teraz ataki umiejętności Jinada oraz Geminate będą mogły zostać wyprowadzone, będąc pod efektem złamania, ale nie uciszenia. Zachowanie jest od teraz spójne z innymi podobnymi umiejętnościami w grze ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]problem 6779[/u][/url]).",
  "732e_bug_fixes_notes7": "Naprawiono błąd powodujący, że efekt cząsteczkowy kuli śnieżnej Tuska nie był niszczony, jeśli kula śnieżna nie została wprawiona w ruch ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problem 6805[/u][/url]).",
  "732e_bug_fixes_notes8": "Bohaterowie nie mogą już inkantować umiejętności Fiend's Gate, będąc w kuli śnieżnej ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]problem 6670[/u][/url]).",
  "732e_bug_fixes_notes9": "Od teraz bohaterowie rzucający umiejętność Snowball, oprócz otrzymywania innych efektów statusów, są także ukorzeniani. Wcześniejsze zachowanie powodowało pewne błędy z efektami cząsteczkowymi, jeśli użyto niektórych umiejętności związanych z ruchem, będąc w kuli śnieżnej ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problem 6805[/u][/url]).",
  "732e_bug_fixes_notes10": "Naprawiono błąd powodujący, że leczenie sojuszników po użyciu umiejętności Illuminate, gdy Keeper of the Light jest w formie ducha, nie było wzmacniane przez wzmocnienie leczenia aktywne na tej postaci ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]problem 2176[/u][/url]).",
  "732e_bug_fixes_notes11": "Naprawiono błąd powodujący, że umiejętność Pulverize od Primal Beast okazjonalnie powodowała trwałe blokowanie się bohaterów na Primal Beast, jeśli zostało rzucone silne rozproszenie podczas ruchu w pionie powodowanego przez inną umiejętność, np. Earth Spike od Liona ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]problem 3528[/u][/url]).",
  "732e_bug_fixes_notes12": "Naprawiono błąd powodujący, że wskazówki umiejętności Ice Shard od Tuska oraz God's Strength od Svena nie wyświetlały zmniejszonych wartości czasu oczekiwania, jeśli wybrano talenty modyfikujące tę wartość. Jest to tylko zmiana w tekście ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]problem 575[/u][/url]).",
  "732e_bug_fixes_notes13": "Naprawiono błąd powodujący brak liczników czasu oczekiwania dla umiejętności opartych na ładunkach (w tym umiejętności, które mają tylko ładunki), kiedy wybrano odpowiadający im talent lub ulepszenie Aghanima ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]problem 315[/u][/url]).",
  "732e_bug_fixes_notes14": "Naprawiono błąd powodujący, że leczenie z przedmiotu Spirit Vessel nie było zaliczane na ekranie podsumowania meczu ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]problem 213[/u][/url]).",
  "732e_bug_fixes_notes15": "Naprawiono błąd powodujący, że efekty cząsteczkowe i dźwiękowe umiejętności Scream of Pain od Queen of Pain nie pojawiały się, kiedy użyto jej, gdy w zasięgu nie było żadnych celów ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]problem 5429[/u][/url]).",
  "732e_bug_fixes_notes16": "Naprawiono błąd powodujący, że role w grze nie były pokazywane poprawnie dla graczy, którzy rozłączyli się na początku meczu.",
  "732e_bug_fixes_notes17": "Naprawiono błąd powodujący, że umiejętność Heavenly Grace od Omniknighta była wyłączana przez efekt złamania ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]problem 1649[/u][/url]).",
  "732e_bug_fixes_notes18": "Naprawiono błąd powodujący, że Troll Warlord mógł użyć zasięgowego wariantu umiejętności Whirling Axes poza zasięgiem rzutu, by nadpisać wymuszenie ataku umiejętnością Battle Trance. Od teraz użycie Whirling Axes w ten sposób spowoduje aktywację umiejętności w danym kierunku.",
  "732e_bug_fixes_notes19": "Naprawiono niektóre przypadki niepojawiania się wiadomości na czacie (np. o rozłączeniu i ponownym połączeniu), jeśli gracz był wyciszony.",
  "732e_bug_fixes_notes20": "Dodano tekst „w wygranych grach” do opisu klejnotu śledzącego postęp odblokowywania drugich stylów arkanów dla Queen of Pain i Faceless Voida. Jest to tylko zmiana w tekście – zwycięstwa zawsze były wymagane dla tych dwóch bohaterów.",
  "732e_bug_fixes_notes21": "Dodano informacje do wskazówki glifu fortyfikacji ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]problem 6786[/u][/url]).",
  "732e_bug_fixes_notes22": "Do umiejętności, które mogą obrać za cel jednostki nietykalne oraz rozproszyć pewne stany nietykalności (np. Cyclone), dodano wskazówki wyświetlane po użyciu klawisza ALT, by wyraźnie wskazać tę informację.",
  "732e_bug_fixes_notes23": "Zaktualizowano wskazówki dla następujących umiejętności:",
  "732e_bug_fixes_notes24": "Nightmare od Bane'a",
  "732e_bug_fixes_notes25": "Boar Poison od Beastmastera",
  "732e_bug_fixes_notes26": "Wild Axes od Beastmastera",
  "732e_bug_fixes_notes27": "Dispel Magic warzątka burzy Brewmastera",
  "732e_bug_fixes_notes28": "Poison Sting pajączków od Broodmother",
  "732e_bug_fixes_notes29": "Ice Spire od Licha",
  "732e_bug_fixes_notes30": "Purge od Necronomicon Archera",
  "732e_bug_fixes_notes31": "Nullify od Nullifiera",
  "732e_bug_fixes_notes32": "Fortune's End od Oracle'a",
  "732e_bug_fixes_notes33": "Purge od Satyra Banishera",
  "732e_bug_fixes_notes34": "Demonic Cleanse od Shadow Demona",
  "732e_bug_fixes_notes35": "Demonic Purge od Shadow Demona",
  "732e_bug_fixes_notes36": "Storm Hammer od Svena",
  "732e_bug_fixes_notes37": "Pit of Malice od Underlorda.",
  "732e_bug_fixes_notes38": "Sprawiono, że przedmioty ze Skrytki Kolekcjonera II można komuś podarować po odpakowaniu. Celem jest zachowanie jednolitości warunków z pierwszą Skrytką Kolekcjonera.",
  "732e_bug_fixes_notes39": "Umożliwiono przypisywanie klawiszy do interfejsu ulepszenia talentów poprzez menu zaawansowanych skrótów klawiszowych.",
  "732e_bug_fixes_notes40": "Uniemożliwiono dołączanie do wyszukiwania gier, kiedy włączona jest flaga -dev. Pozwalało to wcześniej narzędziom zewnętrznym na modyfikowanie elementów interfejsu w sposób umożliwiający nadużycia.",
  "732e_bug_fixes_notes41": "Wyłączono niektóre dodatkowe sposoby na uzyskanie dostępu do profilu innego gracza podczas fazy wybierania bohaterów.",
  "732e_bug_fixes_notes42": "Klikanie na wrogach na górnym pasku gry od teraz będzie pokazywać ich ostatnią znaną lokalizację oraz stan ekwipunku."
}