// 1318.js

{
  "language": "finnish",
  "muerta_title": "Dead Reckoning -päivitys",
  "muerta_title_pre": " ",
  "muerta_title_post": "-päivitys",
  "muerta_title_date": "6.3.−4.4.2023",
  "muerta_play_trailer": "Toista traileri",
  "new_hero_tag": "Uusi sankari",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Sankari",
  "muerta_navigation_event": "Minipeli",
  "muerta_navigation_janitor": "Ominaisuudet",
  "muerta_navigation_gameplay": "Pelipäivitys",
  "muerta_role1": "Kärki",
  "muerta_role2": "Kaukotaistelija",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "Muertan tappavat temppulaukaukset olivat niin häkellyttäviä, että itse Viikatemies halusi hänet palkkalistoilleen. Kahdella pistoolillaan ja napakympeillään hän paimentaa eksyneet sielut tuonpuoleiseen, halusivat he sitä tai eivät. Ja jos sielut eivät suostu seuraamaan häntä, on hän aina valmis näyttämään todellisen olemuksensa murhanhimoisena haamuna.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta ampuu kimpoavan haamulaukauksen kohdehahmoon tai puuhun. Osuessaan luoti vahingoittaa ja hidastaa hetkellisesti sekä kimpoaa valittuun suuntaan. Kimmoke vahingoittaa kaikkia tielleen tulevia vihollisia, kunnes se osuu sankariin, jolloin se pelottaa hänet juoksemaan luodin kulkusuuntaan.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Kutsuu koolle joukon rauhattomia sieluja kiertämään kohdealuetta. Alueen sisällä olevien vihollisten liike- ja hyökkäysnopeus hidastuu. Sielut vahingoittavat ja hiljentävät vihollisia, joiden lävitse ne kulkevat.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Muertan laukauksilla on mahdollisuus ampua toinen luoti satunnaiseen viholliseen priorisoiden sankareita.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta muuttuu haamuksi ja saa immuniteetin fyysiselle vahingolle. Tämän aikana Muerta voi liikkua hahmojen läpi ja saa lisää hyökkäysvahinkoa. Kaikki hänen hyökkäyksensä tekevät loitsuvahinkoa, joten hän voi hyökätä eteerisiä vihollisia vastaan, muttei voi vahingoittaa loitsuimmuuneja vihollisia.",
  "muerta_heroes_title": "Yksityiskohtaiset tilastot Muertasta",
  "muerta_heroes_btn": "Näytä sankarin lisätiedot",
  "muerta_wallpaper": "Taustakuvat",
  "muerta_minigame_title_pre": " ",
  "muerta_minigame_title": "-minipeli",
  "muerta_minigame_subtitle": "NOPEAT JA KUOLLEET…",
  "muerta_minigame_subtitle2": "Muertan täytyy saada oikeat ruumiit oikeisiin hautoihin, ja hän tarvitsee apuasi! Jokaisen Dead Reckoning -tapahtuman aikana pelatun pelin alussa saat kohdevihollisen, jonka tappamisesta tai tapon avustuksesta kertyy pisteitä. Mutta ole varuillasi! Vihollisesi yrittää myös tappaa sinut, ja enemmän pisteitä ansainnut pelaaja saa kaksin verroin palkintoja!",
  "muerta_minigame_rules_title": "Kukat",
  "muerta_minigame_rules_desc": "Tapa liittolaistesi kanssa sinulle valittu kohde, niin saat pisteitä ja ansaitset Muertan <b>kukkia</b>. Kun päihität kohteesi pistesaldossa, saat lisää kukkia.",
  "muerta_minigame_rules_title2": "Aarre",
  "muerta_minigame_rules_desc2": "Vaihda kukkasi <b>Dead Reckoning -arkkuihin</b>, joista löytyy uusia esinekokoelmia ja tapahtumaan sopivia esineitä.",
  "muerta_minigame_rules_title3": "Avaimet",
  "muerta_minigame_rules_desc3": "Osta <b>Dead Reckoning -avain</b>, niin saat arkun auki ja pääset käsiksi palkintoon. Avain maksaa %1$s tai 20 000 sirpaletta sirpalekaupasta.",
  "muerta_treasure_title": "Dead Reckoning -aarre",
  "muerta_treasure_content_desc": "Ansaitsemalla kukkia voit avata nämä Dead Reckoning -teemaiset esinekokoelmat. Muerta on julkaisujuhlansa kunniaksi antanut jokaiselle viisi avainta, joilla pääsee alkuun. Lisäavaimia voit saada Dota Plus -sirpaleilla tai Dota-kaupasta.",
  "muerta_minigame_treasure_name1": "Haamunmanaaja",
  "muerta_minigame_treasure_name2": "Hiipuva kajo",
  "muerta_minigame_treasure_name3": "Alttaripallo",
  "muerta_minigame_treasure_name4": "Elämän ja kuoleman liekki",
  "muerta_minigame_treasure_name5": "Surmakäärme",
  "muerta_minigame_treasure_name6": "Aamunkoinsyömä",
  "muerta_minigame_treasure_name7": "Pyssyvainaa",
  "muerta_minigame_treasure_name8": "Henkikäärme",
  "janitors_corner_title": "Uudet ominaisuudet",
  "732e_patch_dotaplus_advancedstats_title": "Tarkennetut taistelutilastot",
  "732e_patch_dotaplus_advancedstats_subtitle": "Tutki tarkkoja Dota-tilastojasi",
  "732e_patch_dotaplus_advancedstats_desc": "Nosta pelisi aivan uudelle tasolle suoraan profiilissasi saatavilla olevien tarkennettujen taistelutilastojen avulla. Dota Plus -jäsenillä on nyt pääsy täysin uudistettuun, reaaliaikaiseen pelianalytiikkaan. Tutustu tarkemmin pelityyliisi lajittelemalla koko Dota-historiasi sankarin, roolin, pelimuodon ja muiden tekijöiden mukaan.",
  "732e_patch_dotaplus_advancedstats_desc2": "Kiinnostaako kätyritapot? Kätyritilastot kertovat kaiken. Tarvitsetko tukea tukirooleihin? Tukitilastot paljastavat virheesi jopa Sentry Wardia paremmin.",
  "732e_patch_quickkeys_title": "Yksilöity pikakäyttö",
  "732e_patch_quickkeys_subtitle": "Piirun verran parempi",
  "732e_patch_quickkeys_desc": "Pikakäytettävien kykyjen kohdalla voi nyt yksilöllisesti valita, tapahtuuko käyttö näppäintä painettaessa vai vapautettaessa. Löydät tämän asetusvalikon Pikanäppäimet-sivulta kytkemällä Hahmokohtaiset näppäimet päälle.",
  "732e_patch_friendslist_title": "Kaverilistaparannukset",
  "732e_patch_friendslist_subtitle": "Parhaat Dota-kaverit ennen kaikkea",
  "732e_patch_friendslist_desc": "Suosikki-ominaisuudella voit valita lempikaverisi ja nostaa heidät kaverilistasi kärkeen. Voit myös etsiä kavereita uudella hakutoiminnolla.",
  "732e_patch_title": "Pelipäivitys",
  "732e_patch_subtitle": "7.32E JA PALJON MUUTA",
  "732e_patch_turbo_title": "Muutokset Turbo-tilaan",
  "732e_patch_turbo_intro": "Turbo-tilan suosio jatkaa kasvuaan, ja haluammekin varmistaa, että sitä käyttävät pelaajat myös nauttivat siitä. Seuraa Turbo-pelikokemuksen parantamiseksi tehtäviä muutoksia.",
  "732e_patch_turbo_change_notes1": "Vihollisten sankarivalinnat eivät enää näy.",
  "732e_patch_turbo_change_notes2": "Sankarivalinnassa ei ole enää rangaistusaikaa, vaan valintavaihe päättyy välittömästi. Jos et ole lukinnut sankaria valintavaiheen päättyessä, valitsemasi sankari lukitaan automaattisesti. Jos sankari ei ole valittavissa tai et ole valinnut sankaria, saat satunnaisen sankarin.",
  "732e_patch_turbo_change_notes3": "Bracer, Wraith Band ja Null Talisman tuplaavat vaikutuksensa 12 minuutin kohdalla 25 minuutin sijaan.",
  "732e_patch_turbo_change_notes4": "Kutsutut kätyrit eivät enää tee lisävahinkoa torneihin. Linja- ja neutraalikätyrit tekevät yhä lisävahinkoa torneihin perus-Dotaan verrattuna.",
  "732e_patch_turbo_change_notes5": "Voit ansaita sankarihaasteillesi kaksi tähteä yhden sijaan.",
  "732e_patch_turbo_change_notes6": "Juggernautin Teränkantajan perintö laskee nyt Omnislash-tapot täysiksi tapoiksi.",
  "732e_patch_turbo_change_notes7": "Earthshakerin Planeetantuho laskee nyt Echo Slam -tapot ja avustukset täysiksi tapoiksi. Lisäksi yhdistelmät ja yhdistelmävahingot lasketaan myös Turbo-tilassa.",
  "732e_patch_turbo_change_notes8": "Invokerin Pimeän voiman jäänne laskee nyt Sun Strike -tapot täysiksi tapoiksi.",
  "732e_patch_turbo_change_notes9": "Lone Druidin Merkittävän elpymisen Xahryxin pata laskee nyt Entangling Claws -juurrutukset täysiksi juurrutuksiksi.",
  "732e_patch_turbo_change_notes10": "Kunkan Merkittävän elpymisen Jättiläisvalaan miekka laskee nyt Torrent-osumat täysiksi osumiksi.",
  "732e_patch_turbo_change_notes11": "Storm Spiritin Merkittävän elpymisen Salamoiva orkidea laskee nyt Ball Lightning -vahingon täydeksi vahingoksi.",
  "732e_patch_turbo_change_notes12": "Lionin Merkittävän elpymisen Kuningaskalan kirous laskee nyt Hex-kiroukset täysiksi kirouksiksi.",
  "732e_patch_turbo_change_notes13": "Leshracin Merkittävän elpymisen Piinattu sauva laskee nyt Split Earth -tainnutukset täysiksi tainnutuksiksi.",
  "732e_patch_turbo_change_notes14": "Legion Commanderin Voth Domoshin miekat laskevat nyt Duel-tappoja myös Turbo-tilassa.",
  "732e_patch_turbo_change_notes15": "Seuraavien esineiden tilastojenlaskenta on päivitetty:",
  "732e_bug_fixes_title": "Bugikorjauksia",
  "732e_bug_fixes_notes1": "Korjattiin tallennetuissa uusinnoissa ilmenneet virheet ottelutiedoissa: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]ongelma 349[/u][/url])",
  "732e_bug_fixes_notes2": "Korjattiin virhe, jonka takia sankareilta joskus puuttui esim. malli tai materiaali ennen uuden yhteyden muodostamista peliin: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]ongelma 6070[/u][/url])",
  "732e_bug_fixes_notes3": "Korjattiin virhe, jonka takia Refresher Orb ei aina jakanut latausaikaansa Refresher Shardin kanssa: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]ongelma 6668[/u][/url])",
  "732e_bug_fixes_notes4": "Korjattiin virhe, jonka Monkey Kingin Tree Dance ei toiminut erittäin pitkillä käyttöetäisyyksillä: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]ongelma 717[/u][/url])",
  "732e_bug_fixes_notes5": "Korjattiin virhe, jonka takia Lifestealerin Aghanim's Scepter -päivitetty Infest ei osunut ensimmäistä hyökkäystä kohteeseen, jos se oli liian kaukana Lifestealeristä: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]ongelma 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Jinadaa ja Geminate Attackiä voi nyt käyttää murrettuna, mutta ei hiljennettynä. Tämä muutos noudattaa yleisiä kykysääntöjä: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]ongelma 6779[/u][/url])",
  "732e_bug_fixes_notes7": "Korjattiin virhe, jonka takia Tuskin Snowballin kykytehosteet eivät kadonneet, jos Snowball ei jostain syystä lähtenyt liikkeelle: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]ongelma 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Fiend's Gaten läpi ei voi enää kulkea Snowballin sisältä: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]ongelma 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Snowballin luova sankari juurrutetaan nyt muiden vaikutusten lisäksi: tietyt liikekyvyt rikkoivat Snowballin kykytehosteita sen sisältä käytettynä ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]ongelma 6805[/u][/url])",
  "732e_bug_fixes_notes10": "Korjattiin virhe, jonka takia Keeper of the Lightin Spirit Formin aikana käytetty Illuminate ei liittolaisia parantaessaan ottanut huomioon parannusvahvistusta: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]ongelma 2176[/u][/url])",
  "732e_bug_fixes_notes11": "Korjattiin virhe, jossa Primal Beastin Pulverize saattoi jättää kohteen pysyvästi kiinni Primal Beastiin, jos samanaikaisesti siltä puhdistetaan muun kyvyn, kuten esimerkiksi Lionin Earth Spiken aiheuttama pystysuuntainen liike: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]ongelma 3528[/u][/url])",
  "732e_bug_fixes_notes12": "Tuskin Ice Shards ja Svenin God's Strength näyttävät nyt taitopuusta saatavien latausaikojen lyhennykset kykykuvauksissaan. Kyseessä oli vain tekstiongelma: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]ongelma 575[/u][/url])",
  "732e_bug_fixes_notes13": "Lisättiin puuttuvat latausajat latauksia käyttävien tai sellaisiksi taidolla tai Aghanimin päivityksen avulla muuttuvien kykyjen kuvauksista: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]ongelma 315[/u][/url])",
  "732e_bug_fixes_notes14": "Korjattiin virhe, jonka takia Spirit Vesselin parannus ei näkynyt pelinjälkeisessä tulostaulukossa: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]ongelma 213[/u][/url])",
  "732e_bug_fixes_notes15": "Korjattiin virhe, jossa Queen of Painin kykytehosteet ja -äänet puuttuivat, kun Scream of Painiä käytettiin ilman lähellä olevia vihollisia: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]ongelma 5429[/u][/url])",
  "732e_bug_fixes_notes16": "Pelin alussa lähteneiden pelaajien peliroolit näkyvät nyt oikein.",
  "732e_bug_fixes_notes17": "Omniknightin Heavenly Graceä ei voi enää murtaa: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]ongelma 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Korjattiin virhe, jonka takia Troll Warlord pystyi ohjaamaan itseään Battle Trancen aikana käyttämällä Whirling Axesin kaukotaistelukykyä sen kantaman ulkopuolella. Korjauksen jälkeen Troll Warlord käyttää kykyä kohdesuuntaan.",
  "732e_bug_fixes_notes19": "Tietyt ilmoitukset, kuten mykistettyjen pelaajien pelistä poistumis- ja peliin yhdistämisilmoitukset näkyvät jälleen.",
  "732e_bug_fixes_notes20": "Queen of Painin ja Faceless Voidin toisen tyylin salatieteellisten esineiden avaamisesta saatuun tilastoriimuun lisättiin maininta \"voitokkaissa peleissä\". Näiden kahden sankarin kohdalla salatieteelliset esineet ovat aina vaatineet voitokkaita pelejä, mutta se ei aikaisemmin näkynyt teksteissä.",
  "732e_bug_fixes_notes21": "Lisättiin puuttuvaa tietoa Glyph of Fortificationin kuvaukseen: ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]ongelma 6786[/u][/url])",
  "732e_bug_fixes_notes22": "Haavoittumattomiin vihollisiin kohdistettaviin ja tiettyihin haavoittumattomuusvahvistuksia puhdistaviin kykyihin (esim. Eul's Scepterin Cycloneen) lisättiin ALT-näppäimellä näkyvä tekstikuvaus.",
  "732e_bug_fixes_notes23": "Päivitettiin seuraavien kykyjen kuvaukset:",
  "732e_bug_fixes_notes24": "Banen Nightmare",
  "732e_bug_fixes_notes25": "Beastmasterin Call of the Wildin villisian myrkky",
  "732e_bug_fixes_notes26": "Beastmasterin Wild Axes",
  "732e_bug_fixes_notes27": "Brewmasterin Myrskysoturin Dispel Magic",
  "732e_bug_fixes_notes28": "Broodmotherin Spiderlingin Poison Sting",
  "732e_bug_fixes_notes29": "Lichin Ice Spire",
  "732e_bug_fixes_notes30": "Necronomicon Archerin Purge",
  "732e_bug_fixes_notes31": "Nullifierin Nullify",
  "732e_bug_fixes_notes32": "Oraclen Fortune's End",
  "732e_bug_fixes_notes33": "Satyr Banisherin Purge",
  "732e_bug_fixes_notes34": "Shadow Demonin Demonic Cleanse",
  "732e_bug_fixes_notes35": "Shadow Demonin Demonic Purge",
  "732e_bug_fixes_notes36": "Svenin Storm Hammer",
  "732e_bug_fixes_notes37": "Underlordin Pit of Malice",
  "732e_bug_fixes_notes38": "Keräilijän kätkö 2:n esineet voi nyt lahjoittaa avattuina, aivan kuten Keräilijän kätkö 1:n esineet.",
  "732e_bug_fixes_notes39": "Taitopuun pikanäppäimet voi nyt säätää näppäinten lisäasetuksista.",
  "732e_bug_fixes_notes40": "Pelejä ei voi enää hakea -dev-komennon ollessa päällä. Komennolla pystyi muuttamaan käyttöliittymää ja saavuttamaan epäreilun aseman.",
  "732e_bug_fixes_notes41": "Estettiin lisää keinoja nähdä muiden profiilit sankarivalinnan aikana.",
  "732e_bug_fixes_notes42": "Yläpalkin viholliskuvakkeiden klikkaaminen näyttää vihollisten viimeksi nähdyn sijainnin ja tavaraluettelon."
}