// 1182.js

{
  "language": "latam",
  "muerta_title": "Actualización del Juicio Mortal",
  "muerta_title_pre": "Actualización",
  "muerta_title_post": " ",
  "muerta_title_date": "Del 6 de marzo al 4 de abril de 2023",
  "muerta_play_trailer": "Reproducir avance",
  "new_hero_tag": "Nueva heroína",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Heroína",
  "muerta_navigation_event": "Minijuego",
  "muerta_navigation_janitor": "Características",
  "muerta_navigation_gameplay": "Actualización",
  "muerta_role1": "Asesino",
  "muerta_role2": "A distancia",
  "muerta_role3": "Devastador",
  "muerta_role4": "Incapacitador",
  "muerta_intro": "Con sus disparos aterradores, los espíritus invocados y un arma de repuesto, la destreza de Muerta para llevarse vidas por delante era tan asombrosa que la muerte misma la contrató. Muerta, una máquina de venganza con dos pistolas y puntería mortal. Muerta se lleva al otro mundo a quienes lo quieran o no. Y si necesitara ser más convincente, solo tiene que revelar su verdadera naturaleza de pesadilla espectral asesina para ayudarlos a morir un poco más rápido.",
  "muerta_ability1_title": "Disparo Mortal",
  "muerta_ability1_desc": "Muerta dispara un tiro fantasmal a una unidad enemiga o a un árbol. La bala impacta en el objetivo, lo daña y se ralentiza un poco para luego rebotar en la dirección deseada. El rebote causa daño a todas las unidades que atraviesa y se detiene al impactar en un héroe. Los héroes que reciban el impacto del rebote correrán en la dirección del disparo.",
  "muerta_ability2_title": "La Invocación",
  "muerta_ability2_desc": "Invoca a un grupo de espectros que lentamente rodean el lugar elegido. Los enemigos que estén en esa zona se ralentizan y su velocidad de ataque disminuye. Los espectros infligen daño y silencian a los enemigos cuando pasan a través de ellos.",
  "muerta_ability3_title": "Pistolera",
  "muerta_ability3_desc": "Los ataques de Muerta pueden hacer un segundo disparo a un objetivo distinto, dando prioridad a los héroes.",
  "muerta_ability4_title": "Perforar el Velo",
  "muerta_ability4_desc": "Muerta se transforma y se vuelve inmune al daño físico. Todo su daño de ataque se inflige como daño mágico. Muerta obtiene daño de ataque adicional y movimiento en fase. Muerta puede atacar a unidades etéreas, pero no inflige daño a los objetivos con inmunidad mágica.",
  "muerta_heroes_title": "Para ver en detalle las estadísticas de Muerta",
  "muerta_heroes_btn": "Visita la página de la heroína",
  "muerta_wallpaper": "Fondos de pantalla",
  "muerta_minigame_title_pre": "Minijuego del",
  "muerta_minigame_title": " ",
  "muerta_minigame_subtitle": "LOS RÁPIDOS Y LOS MUERTOS…",
  "muerta_minigame_subtitle2": "Muerta necesita que la ayuden a poner los cuerpos aún calientes en las tumbas frescas correctas... ¡para eso necesita de tu ayuda! Durante el evento del Juicio Mortal, se te asignará un objetivo al inicio de cada partida de Dota. Obtén puntos por víctimas y por asistencias. ¡Pero presta atención, pues tu rival también está sediento de sangre, y quien consiga más puntos recibe el doble de recompensa!",
  "muerta_minigame_rules_title": "Flores",
  "muerta_minigame_rules_desc": "Al conseguir víctimas y asistencias jugando contra el objetivo asignado recibes puntos y ganas <b>Flores</b> de Muerta. Obtén más puntos que tu objetivo para aumentar el botín.",
  "muerta_minigame_rules_title2": "Tesoro",
  "muerta_minigame_rules_desc2": "Intercambia Flores por <b>Cofres de Juicio Mortal</b> que están cargados de sets de objetos completamente nuevos y que incluyen objetos con el tema del evento.",
  "muerta_minigame_rules_title3": "Llaves",
  "muerta_minigame_rules_desc3": "Compra una <b>llave de Juicio Mortal</b> para abrir el cofre y revelar la recompensa que te espera en su interior. Las llaves cuestan %1$s o 20 000 fragmentos en la tienda de fragmentos.",
  "muerta_treasure_title": "Cofre del Juicio Mortal",
  "muerta_treasure_content_desc": "Cuantas más flores consigas, más posibilidades tendrás de conseguir los sets de objetos inspirados en el Juicio Mortal. Muerta ofrece cinco llaves a cada jugador para iniciar la celebración. Consigue todas las llaves adicionales que necesites intercambiando fragmentos o en la tienda de Dota.",
  "muerta_minigame_treasure_name1": "Cazador Espectral",
  "muerta_minigame_treasure_name2": "Luz Agonizante",
  "muerta_minigame_treasure_name3": "Esfera del Altar",
  "muerta_minigame_treasure_name4": "Calor Mortal",
  "muerta_minigame_treasure_name5": "Víbora de la Muerte",
  "muerta_minigame_treasure_name6": "Muñeco de los Muertos",
  "muerta_minigame_treasure_name7": "Pistola Terminal",
  "muerta_minigame_treasure_name8": "Alebrije",
  "janitors_corner_title": "Nuevas características",
  "732e_patch_dotaplus_advancedstats_title": "Estadísticas avanzadas de batalla",
  "732e_patch_dotaplus_advancedstats_subtitle": "Analiza a fondo los datos de tu historial de Dota",
  "732e_patch_dotaplus_advancedstats_desc": "Evalúa y lleva tu juego a otro nivel con las estadísticas avanzadas de batalla que aparecen directamente en tu perfil. Los miembros de Dota Plus ahora tienen acceso a una analítica de juego en tiempo real y completamente renovada. Analiza en profundidad tu estilo de juego al ordenar tu historial completo de juego en Dota por héroe, rol, modo de juego y mucho más.",
  "732e_patch_dotaplus_advancedstats_desc2": "¿Quieres enfocarte en los últimos golpes? Consulta el grupo de estadísticas de tus creeps. ¿Quieres mejorar tus habilidades en el rol de apoyo? Las estadísticas del rol ahora son más reveladoras que un Guardián Centinela.",
  "732e_patch_quickkeys_title": "Lanzamiento rápido personalizable",
  "732e_patch_quickkeys_subtitle": "Control más preciso al alcance de tu mano",
  "732e_patch_quickkeys_desc": "Los usuarios de lanzamiento rápido ahora pueden asignar individualmente qué habilidades específicas de cada unidad y qué objetos se usan al presionar o soltar teclas. Consulta en el menú de configuración, en la pestaña \"Teclas rápidas\", las \"Teclas rápidas específicas de unidades\" y \"Activar lanzamiento rápido\" para ver las habilidades y objetos correspondientes.",
  "732e_patch_friendslist_title": "Mejoras de la lista de amigos",
  "732e_patch_friendslist_subtitle": "Trata a tus mejores amigos de Dota como se merecen",
  "732e_patch_friendslist_desc": "Con la característica \"Favoritos\", ahora puedes etiquetar a las personas con las que más juegas para mantenerlos en los primeros lugares de tu lista de amigos. Ordena a tus amigos por \"Favoritos\", \"Están jugando\", \"En línea\" o \"Desconectados\". O utiliza la característica \"Búsqueda de amigos\" recientemente añadida para encontrar exactamente a quien estabas buscando.",
  "732e_patch_title": "Actualización",
  "732e_patch_subtitle": "7.32E Y MÁS",
  "732e_patch_turbo_title": "Cambios en el Modo Turbo",
  "732e_patch_turbo_intro": "A medida que el Modo Turbo se va haciendo más popular, queremos asegurarnos de que hacemos todo lo que podemos para ese grupo de jugadores. Estate atento a más cambios en el futuro a medida que seguimos mejorando la experiencia de juego en general.",
  "732e_patch_turbo_change_notes1": "Ahora puedes elegir héroes de forma oculta",
  "732e_patch_turbo_change_notes2": "Se eliminó la fase de penalidades al seleccionar héroes. Al concluir el tiempo de selección normal, la persona que no haya seleccionado a un héroe se verá obligada a seleccionar a cualquiera que hayan elegido tentativamente. En el caso de que ese héroe no esté disponible o de que no haya una selección tentativa, se les asignará un héroe aleatoriamente.",
  "732e_patch_turbo_change_notes3": "Talismán Anulador, Antifaz Espectral y Brazalete duplicarán sus bonificaciones a los 12 minutos, en lugar de hacerlo a los 25 minutos.",
  "732e_patch_turbo_change_notes4": "Se eliminó el daño adicional a las torres de todas las unidades invocadas. Las unidades no invocadas (creeps de senda, creeps dominados) todavía son fuertes en contra de las torres comparadas con las de Dota sin Turbo.",
  "732e_patch_turbo_change_notes5": "Todavía puedes obtener dos estrellas por los desafíos de héroe, en lugar de una sola.",
  "732e_patch_turbo_change_notes6": "El arcano Legado de Hoja de Juggernaut ahora da crédito completo por Víctimas de Omnilátigo.",
  "732e_patch_turbo_change_notes7": "El arcano Caída Planetaria de Earthshaker ahora otorga crédito completo por víctimas y asistencias de Golpe Resonante. También está activado el seguimiento de las habilidades encadenadas y del combo de daño.",
  "732e_patch_turbo_change_notes8": "Inmortal del Regreso de la Artesanía Oscura de Invoker ahora otorga crédito completo por víctimas de Impacto Solar.",
  "732e_patch_turbo_change_notes9": "Inmortal del Caldero de Xahryx del Renacimiento Eminente de Lone Druid ahora otorga crédito completo para duración de Garras Enredadoras.",
  "732e_patch_turbo_change_notes10": "Inmortal de la Hoja de la Ballena Leviathan del Renacimiento Inminente de Kunkka ahora otorga crédito completo por impactar a héroes con Torrente.",
  "732e_patch_turbo_change_notes11": "Inmortal de la Orquídea del Relámpago del Renacimiento Inminente de Storm Spirit ahora otorga crédito completo para daño de Rayo Esférico.",
  "732e_patch_turbo_change_notes12": "Inmortal del Encanto del Rey de Fin del Renacimiento Inminente de Lion ahora otorga crédito completo para maldecir enemigos.",
  "732e_patch_turbo_change_notes13": "Inmortal del Bastón Atormentado del Renacimiento Inminente de Leshrac ahora otorga crédito completo por aturdir enemigos con Dividir la Tierra.",
  "732e_patch_turbo_change_notes14": "El arcano de Legion Commander ahora cuenta las victorias en duelos.",
  "732e_patch_turbo_change_notes15": "Se actualizó lo siguiente en el progreso de los arcanos:",
  "732e_bug_fixes_title": "Correcciones",
  "732e_bug_fixes_notes1": "Se corrigió un problema por el cual los detalles de las partidas no se añadían correctamente a las repeticiones guardadas ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]fallo 349[/u][/url]).",
  "732e_bug_fixes_notes2": "Se corrigió un fallo por el que algunas veces los héroes no tenían sus modelos/materiales/etc. hasta que te volvías a conectar a la partida. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]fallo 6070[/u][/url]).",
  "732e_bug_fixes_notes3": "Se corrigió un fallo por el que algunas veces Orbe Revigorizante no pasaba a tiempo de recarga cuando se utilizaba Esquirla Revigorizante. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]fallo 6668[/u][/url]).",
  "732e_bug_fixes_notes4": "Se corrigió un fallo que impedía lanzar Danza Arbórea de Monkey King a mucha distancia ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]fallo 717[/u][/url]).",
  "732e_bug_fixes_notes5": "Se corrigió un fallo por el cual el primer ataque con Infestado de Lifestealer fallaba a ciertas distancias ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]fallo 6801[/u][/url]).",
  "732e_bug_fixes_notes6": "Jinada y Ataque Geminado ya se pueden lanzar al estar afectado por Ruptura, pero no al estar Silenciado. El comportamiento coincide ahora con el de otras habilidades similares del juego. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]fallo 6779[/u][/url]).",
  "732e_bug_fixes_notes7": "Se corrigió un fallo por el que el efecto de partículas de Bola de Nieve de Tusk no se destruía si Bola de Nieve no se podía lanzar ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]fallo 6805[/u][/url]).",
  "732e_bug_fixes_notes8": "Los héroes ya no pueden canalizar Portal Demoníaco cuando están dentro de una Bola de Nieve. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]fallo 6670[/u][/url]).",
  "732e_bug_fixes_notes9": "Los héroes que lanzan una Bola de Nieve ahora están inmovilizados además de los efectos de estado anteriores. Esto causaba problemas con algunos efectos de partículas cuando algunas habilidades de movimiento se lanzaban durante Bola de Nieve ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]fallo 6805[/u][/url]).",
  "732e_bug_fixes_notes10": "Se corrigió un fallo por el cual la amplificación de la curación de KotL no amplificaba la curación de aliados de Iluminar con Forma Espiritual ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]fallo 2176[/u][/url]).",
  "732e_bug_fixes_notes11": "Se corrigió un fallo por el que Pulverizar de Primal Beast hacía que algunas veces los héroes se estancaran con Primal Beast indefinidamente si ocurría una disipación dura durante el movimiento vertical de otro hechizo como Púa Terrenal de Lion. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]fallo 3528[/u][/url]).",
  "732e_bug_fixes_notes12": "Se corrigió que las descripciones emergentes de Fragmentos de Hielo de Tusk y Fuerza Divina de Sven no mostraran los valores reducidos de tiempo de recarga si se elegían los talentos apropiados. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]fallo 575[/u][/url]).",
  "732e_bug_fixes_notes13": "Se corrigieron los indicadores de tiempo de recarga faltantes para habilidades basadas en carga, incluyendo las habilidades que solo tienen cargas cuando se tomaba un talento correspondiente o una actualización de Aghanim ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]fallo 315[/u][/url]).",
  "732e_bug_fixes_notes14": "Se corrigió que la curación de Vasija Espiritual no contara para Curación en la pantalla después de la partida ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]fallo 213[/u][/url]).",
  "732e_bug_fixes_notes15": "Se corrigieron la partícula y efectos de sonido faltantes de Queen of Pain cuando se lanzaba Alarido de Dolor sin tener objetivos al alcance ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]fallo 5429[/u][/url]).",
  "732e_bug_fixes_notes16": "Los roles en el juego se muestran correctamente para los jugadores que no están conectados al inicio de la partida.",
  "732e_bug_fixes_notes17": "Se corrigió que Gracia Celestial de Omniknight se desactivaba con Ruptura. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]fallo 1649[/u][/url]).",
  "732e_bug_fixes_notes18": "Se corrigió un fallo por el que Troll Warlord podía anular los comandos de ataque forzado de Trance de Batalla lanzando comandos de lanzamiento de Hachas Giratorias (A Distancia) fuera del alcance de lanzamiento. Esta forma de lanzamiento ahora lanza Hachas Giratorias (A Distancia) en esa dirección.",
  "732e_bug_fixes_notes19": "Se corrigieron algunos casos en los que los mensajes de chat como desconectar y reconectar no se mostraban si el jugador estaba enmudecido.",
  "732e_bug_fixes_notes20": "Se añadió \"en partidas ganadas\" a la descripción de una gema para desbloquear estilos secundarios de objetos arcanos para Queen of Pain y Faceless Void. Esto es solo un cambio de texto; siempre se ha necesitado victorias para el progreso de objetos arcanos para estos dos héroes.",
  "732e_bug_fixes_notes21": "Se añadió información adicional a la descripción emergente de Glifo de Fortificación ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]fallo 6786[/u][/url]).",
  "732e_bug_fixes_notes22": "Para habilidades que pueden tener como objetivos a unidades invulnerables y disipar algunos estados invulnerables (Ciclón, etc.), se añadió ALT + descripciones emergentes para especificar que pueden tener como objetivos las unidades invulnerables.",
  "732e_bug_fixes_notes23": "Se actualizaron las descripciones emergentes de las siguientes habilidades:",
  "732e_bug_fixes_notes24": "Pesadilla de Bane",
  "732e_bug_fixes_notes25": "Veneno del Jabalí de Beastmaster",
  "732e_bug_fixes_notes26": "Hachas Salvajes de Beastmaster",
  "732e_bug_fixes_notes27": "Disipar Magia del Brewling de Tormenta de Brewmaster",
  "732e_bug_fixes_notes28": "Picadura Venenosa de la Cría de Araña de Broodmother",
  "732e_bug_fixes_notes29": "Aguja de Hielo de Lich",
  "732e_bug_fixes_notes30": "Purga del Arquero del Necronomicón",
  "732e_bug_fixes_notes31": "Anular de Nulificador",
  "732e_bug_fixes_notes32": "Fin de la Fortuna de Oracle",
  "732e_bug_fixes_notes33": "Purga del Embaucador Sátiro",
  "732e_bug_fixes_notes34": "Purga Demoníaca de Shadow Demon",
  "732e_bug_fixes_notes35": "Purga Demoníaca de Shadow Demon",
  "732e_bug_fixes_notes36": "Martillo de la Tormenta de Sven",
  "732e_bug_fixes_notes37": "Fosa de Malevolencia de Underlord",
  "732e_bug_fixes_notes38": "Los objetos del Alijo del Coleccionista 2 se pueden regalar después de desempacarlos, tal como ocurrió con los objetos del Alijo del Coleccionista 1.",
  "732e_bug_fixes_notes39": "Ahora es posible asignar teclas para diferentes opciones en la interfaz del usuario para talentos en el menú de atajos.",
  "732e_bug_fixes_notes40": "Se desactivó la capacidad de unirse al emparejamiento cuando la opción \"-dev\" está activada. Eso permitía que herramientas de terceros cambiaran determinados elementos de la interfaz de usuario de forma ventajosa.",
  "732e_bug_fixes_notes41": "Se desactivaron otras formas de acceder a perfiles de jugadores durante la fase de selección.",
  "732e_bug_fixes_notes42": "Durante una partida, al hacer clic sobre los enemigos en la barra superior se mostrará la última ubicación conocida y el estado de su inventario."
}