// 7588.js

{
  "language": "russian",
  "muerta_title": "Обновление «Смертная расплата»",
  "muerta_title_pre": "Обновление",
  "muerta_title_post": "\\n",
  "muerta_title_date": "С 6 марта по 4 апреля",
  "muerta_play_trailer": "Смотреть трейлер",
  "new_hero_tag": "Новая героиня",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Герой",
  "muerta_navigation_event": "Мини-игра",
  "muerta_navigation_janitor": "Возможности",
  "muerta_navigation_gameplay": "Обновление баланса",
  "muerta_role1": "Керри",
  "muerta_role2": "Дальн. бой",
  "muerta_role3": "Быстрый урон",
  "muerta_role4": "Контроль",
  "muerta_intro": "Устрашающие виртуозные выстрелы, призыв духов и запасное оружие наготове — Муэрта так умело отнимает жизни, что её взял под своё крыло сам Жнец. С безразличием в глазах и двумя пистолетами в руках Муэрта прокладывает путь к отмщению, отправляя на тот свет своенравные души, хотят ли они того или нет. И лишь самым неотступным она готова раскрыть свой истинный, призрачный облик, вершащий смертное возмездие ещё быстрее.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Муэрта выпускает призрачную пулю во врага или в дерево. Достигнув цели, пуля нанесёт ей урон и ненадолго замедлит её, после чего отрикошетит в указанном направлении. Рикошет наносит урон всем существам на пути и останавливается при попадании в героя, накладывая на жертву страх, отчего та бежит по направлению рикошета.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Призывает призраков, неторопливо кружащих в указанной области. Враги в ней медленнее передвигаются и атакуют. Проходя сквозь врагов, призраки наносят им урон и накладывают на них безмолвие.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "При каждой атаке Муэрта имеет шанс совершить дополнительный выстрел в случайную цель (в первую очередь — в героев).",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Муэрта принимает бесплотную форму, получая невосприимчивость к физическому урону и возможность проходить сквозь существ. Несмотря на бесплотность, Муэрта может атаковать, а её сопротивление магии не снижается. Урон от атак увеличивается и становится магическим, отчего Муэрта может атаковать других бесплотных существ, но такие атаки не наносят урона невосприимчивым к магии целям.",
  "muerta_heroes_title": "Подробные характеристики героя",
  "muerta_heroes_btn": "Страница героя",
  "muerta_wallpaper": "Обои",
  "muerta_minigame_title_pre": " ",
  "muerta_minigame_title": "Мини-игра",
  "muerta_minigame_subtitle": "КТО БЫСТРЕЕ, ТОТ ЖИВЕЕ...",
  "muerta_minigame_subtitle2": "Муэрте нужна помощь: кто-то должен отправить несчастных в причитающиеся им могилы... Тут-то вы и пригодитесь! Перед каждой игрой вам будет назначена цель, в убийстве которой нужно будет участвовать. Но будьте осторожны: этот противник тоже охотится за вашей головой, и кто из вас наберёт больше очков, тот получит двойную награду!",
  "muerta_minigame_rules_title": "Цветы",
  "muerta_minigame_rules_desc": "Убивайте или помогайте убить назначенную цель, чтобы получать <b>цветы</b> Муэрты. Наберите больше очков, чем ваша цель, и награда станет щедрее.",
  "muerta_minigame_rules_title2": "Сундуки",
  "muerta_minigame_rules_desc2": "Обменивайте цветы на сундуки <b>Dead Reckoning Chest</b>, под завязку набитые новыми наборами, в том числе тематическими.",
  "muerta_minigame_rules_title3": "Ключи",
  "muerta_minigame_rules_desc3": "Для открытия новых сундуков нужны ключи <b>Dead Reckoning Key</b>. Любой желающий может купить их в магазине за %1$s или 20 000 осколков!",
  "muerta_treasure_title": "Dead Reckoning Chest",
  "muerta_treasure_content_desc": "Чем больше вы соберёте цветов, тем выше шанс получить все тематические наборы предметов. В честь такого праздника Муэрта подарила каждому по пять ключей. Нужно больше? Их можно купить в магазине, в том числе и за осколки.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "Новые возможности",
  "732e_patch_dotaplus_advancedstats_title": "Расширенная боевая статистика",
  "732e_patch_dotaplus_advancedstats_subtitle": "Погрузитесь в свои игровые данные",
  "732e_patch_dotaplus_advancedstats_desc": "Оцените и повысьте свой уровень игры благодаря расширенной статистике прямо в профиле. Теперь у подписчиков Dota Plus есть доступ к полностью переработанной аналитике игровых данных в реальном времени. Узнайте о себе больше, сортируя полную историю игр по героям, ролям, режимам и не только.",
  "732e_patch_dotaplus_advancedstats_desc2": "Хотите стать мастером добиваний? Фильтр «Крипы» вам точно поможет. Помогать команде — ваше кредо? Фильтр «Поддержка» покажет больше, чем варды во вражеском лесу.",
  "732e_patch_quickkeys_title": "Настраиваемое быстрое применение",
  "732e_patch_quickkeys_subtitle": "Управление на кончиках пальцев",
  "732e_patch_quickkeys_desc": "Быстрое применение теперь можно редактировать не только для каждого существа, но и для отдельных предметов. Более того: для них можно индивидуально выбрать момент применения — при нажатии или отпускании клавиши. Чтобы эти параметры появились, просто включите быстрое применение в настройках.",
  "732e_patch_friendslist_title": "Улучшения списка друзей",
  "732e_patch_friendslist_subtitle": "Ведь друзья по Доте заслуживают особого обращения",
  "732e_patch_friendslist_desc": "Представляем функцию избранных друзей: теперь вы можете помечать тех, с кем чаще всего играете, чтобы они всегда были в самом верху вашего списка друзей. Также мы ввели сортировку этого списка по статусу пользователей и поиск по имени, чтобы вам было проще найти нужного союзника.",
  "732e_patch_title": "Обновление баланса",
  "732e_patch_subtitle": "7.32E И НЕ ТОЛЬКО",
  "732e_patch_turbo_title": "Изменения режима Turbo",
  "732e_patch_turbo_intro": "Режим Turbo становится всё популярнее, так что мы бы хотели сделать как можно больше и для его любителей. Следите за новостями — в будущем режим получит ещё больше улучшений.",
  "732e_patch_turbo_change_notes1": "Теперь все выбранные игроками герои скрыты",
  "732e_patch_turbo_change_notes2": "Убрано штрафное время на стадии выбора героев. По окончании основного времени игроку достанется герой, которого он выделил, но не выбрал. Если же игрок не выделил героя, которого можно выбрать, то ему достанется случайный персонаж.",
  "732e_patch_turbo_change_notes3": "Бонусы от Null Talisman, Wraith Band и Bracer теперь удваиваются на 12:00, а не на 25:00",
  "732e_patch_turbo_change_notes4": "Призванные существа больше не наносят дополнительный урон башням. Крипы на линии и существа, взятые под контроль, всё еще наносят увеличенный урон в сравнении с другими режимами.",
  "732e_patch_turbo_change_notes5": "Теперь за испытания героев можно получить максимум две звезды, а не одну",
  "732e_patch_turbo_change_notes6": "Теперь Arcana-предмет для Juggernaut полностью учитывает убийства, совершённые с помощью Omnislash",
  "732e_patch_turbo_change_notes7": "Теперь Arcana-предмет Planetfall для Earthshaker полностью учитывает убийства и помощи от способности Echo Slam. Отслеживание комбо и нанесённого урона также активированы.",
  "732e_patch_turbo_change_notes8": "Теперь Immortal-предмет Dark Artistry Throwback для Invoker полностью учитывает убийства способностью Sun Strike",
  "732e_patch_turbo_change_notes9": "Теперь Immortal-предмет Cauldron of Xahryx of Eminent Revival для Lone Druid полностью учитывает время оцепенения от способности Entangling Claws",
  "732e_patch_turbo_change_notes10": "Теперь Immortal-предмет Leviathan Whale Blade of Eminent Revival для Kunkka полностью учитывает попадания способностью Torrent",
  "732e_patch_turbo_change_notes11": "Теперь Immortal-предмет The Lightning Orchid of Eminent Revival для Storm Spirit полностью учитывает урон, нанесённый способностью Ball Lightning",
  "732e_patch_turbo_change_notes12": "Теперь Immortal-предмет Fin King's Charm of Eminent Revival для Lion полностью учитывает время проклятия врагов способностью Hex",
  "732e_patch_turbo_change_notes13": "Теперь Immortal-предмет Tormented Staff of Eminent Revival для Leshrac полностью учитывает попадания способностью Split Earth",
  "732e_patch_turbo_change_notes14": "Теперь Arcana-предмет для Legion Commander учитывает победы в дуэлях",
  "732e_patch_turbo_change_notes15": "Обновлён прогресс у следующих Arcana-предметов:",
  "732e_bug_fixes_title": "Исправления ошибок",
  "732e_bug_fixes_notes1": "Исправлена ошибка, из-за которой сохранённые записи не получали нужных данных об игре ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]проблема 349[/u][/url])",
  "732e_bug_fixes_notes2": "Исправлена ошибка, из-за которой у игрока могли не отображаться модели, текстуры и другие элементы некоторых героев, что исправлялось только повторным подключением к игре ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]проблема 6070[/u][/url])",
  "732e_bug_fixes_notes3": "Исправлена ошибка, из-за которой применение Refresher Shard иногда не начинало перезарядку у Refesher Orb ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]проблема 6668[/u][/url])",
  "732e_bug_fixes_notes4": "Исправлена ошибка, из-за которой Tree Dance у Monkey King не удавалось применить на очень большое расстояние ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]проблема 717[/u][/url])",
  "732e_bug_fixes_notes5": "Исправлена ошибка, из-за которой Lifestealer промахивался первой атакой по жертве Infest, если эта способность применялась с определённого расстояния ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]проблема 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Теперь Jinada и Geminate Attack срабатывают под действием истощения, если применить их вручную, а под безмолвием — нет, как и другие подобные способности ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]проблема 6779[/u][/url])",
  "732e_bug_fixes_notes7": "Исправлена ошибка, из-за которой эффект частиц способности Snowball у Tusk не пропадал, если снежный шар никуда не покатился ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]проблема 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Исправлена ошибка, из-за которой можно было применять Fiend's Gate изнутри снежного шара от Snowball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]проблема 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Теперь на героя, применяющего Snowball, помимо других эффектов накладывается оцепенение. Это поможет разрешить проблемы с эффектами частиц, когда герои применяли перемещающие способности, находясь в снежном коме ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]проблема 6805[/u][/url]).",
  "732e_bug_fixes_notes10": "Исправлена ошибка, из-за которой лечение от Illuminate у Keeper of the Light под действием Spirit Form не увеличивалось предметами, усиливающими лечение ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]проблема 2176[/u][/url])",
  "732e_bug_fixes_notes11": "Исправлена ошибка, из-за которой жертва способности Pulverize навсегда приклеивалась к лапе Primal Beast, если на неё применили сильное развеивание во время вертикального движения от другого заклинания, например, от Impale у Lion ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]проблема 3528[/u][/url])",
  "732e_bug_fixes_notes12": "Исправлена ошибка, из-за которой в описании способностей Ice Shards и God's Strength не менялось значение перезарядки при выборе уменьшающих её талантов. Ошибка была исключительно в тексте — сами перезарядки уменьшались должным образом ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]проблема 575[/u][/url]).",
  "732e_bug_fixes_notes13": "Исправлена ошибка, из-за которой индикаторы перезарядок не отображались у способностей с зарядами, в том числе если заряды появлялись только при изучении таланта или покупке предмета Аганима ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]проблема 315[/u][/url])",
  "732e_bug_fixes_notes14": "Исправлена ошибка, из-за которой эффект от Spirit Vessel не учитывался во вкладке «Лечение» послеигровой статистики ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]проблема 213[/u][/url])",
  "732e_bug_fixes_notes15": "Исправлена ошибка, из-за которой у Queen of Pain не использовались звуки и эффекты, если при применении Scream of Pain не было ни одной подходящей жертвы ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]проблема 5429[/u][/url])",
  "732e_bug_fixes_notes16": "Внутриигровые роли теперь правильно отображаются для игроков, которые отключились в начале игры.",
  "732e_bug_fixes_notes17": "Исправлена ошибка, из-за которой способность Heavenly Grace у Omniknight можно было отключить истощением ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]проблема 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Исправлена ошибка, из-за которой Troll Warlord мог отменить вынужденные атаки по цели, применив Whirling Axes (дальний бой) на точку за пределом радиуса применения. Теперь же подобная команда заставит применить способность в указанном направлении.",
  "732e_bug_fixes_notes19": "Исправлены случаи, когда сообщения об отключении и возвращении игрока не отображались, если он заглушён.",
  "732e_bug_fixes_notes20": "В описания Arcana-предметов Queen of Pain и Faceless Void добавлено, что прогресс для открытия второго стиля учитывается только в победных играх. Это исключительно текстовое изменение, поскольку и до этого показатели увеличивались только в случае победы.",
  "732e_bug_fixes_notes21": "Расширено описание укрепления построек ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]проблема 6786[/u][/url])",
  "732e_bug_fixes_notes22": "Теперь способности, которые могут применяться на неуязвимых существ и развеивать некоторые эффекты неуязвимости (например, ураган от Eul's Scepter), сообщают об этом в описании при нажатии на Alt",
  "732e_bug_fixes_notes23": "Обновлены описания следующих способностей:",
  "732e_bug_fixes_notes24": "Bane — Nightmare",
  "732e_bug_fixes_notes25": "Beastmaster — Poison у кабана",
  "732e_bug_fixes_notes26": "Beastmaster — Wild Axes",
  "732e_bug_fixes_notes27": "Brewmaster — Dispel Magic у воина шторма",
  "732e_bug_fixes_notes28": "Broodmother — Poison Sting у паучков",
  "732e_bug_fixes_notes29": "Lich — Ice Spire",
  "732e_bug_fixes_notes30": "Book of the Dead (и Necronomicon) — Purge у лучника",
  "732e_bug_fixes_notes31": "Nullifier — Nullify",
  "732e_bug_fixes_notes32": "Oracle — Fortune's End",
  "732e_bug_fixes_notes33": "Сатир-колдун — Purge",
  "732e_bug_fixes_notes34": "Shadow Demon — Demonic Cleanse",
  "732e_bug_fixes_notes35": "Shadow Demon — Demonic Purge",
  "732e_bug_fixes_notes36": "Sven — Storm Hammer",
  "732e_bug_fixes_notes37": "Underlord — Pit of Malice",
  "732e_bug_fixes_notes38": "Предметы из сокровищницы «Боевой пропуск 2022: Collector's Cache II» теперь можно дарить после распаковки",
  "732e_bug_fixes_notes39": "Клавиши для выбора талантов теперь можно менять в расширенных настройках управления",
  "732e_bug_fixes_notes40": "Отключена возможность искать игру, если клиент игры использует параметр запуска -dev, поскольку он позволял сторонним программам получить нечестное преимущество.",
  "732e_bug_fixes_notes41": "Отключены некоторые другие способы открыть профиль пользователя во время стадии выбора героев.",
  "732e_bug_fixes_notes42": "Нажатие на портрет врага в верхней части экрана теперь переместит камеру туда, где этот герой был замечен в последний раз, и отобразит его инвентарь на тот момент."
}