// 8554.js

{
  "language": "norwegian",
  "muerta_title": "Dead Reckoning-oppdateringen",
  "muerta_title_pre": " ",
  "muerta_title_post": " ",
  "muerta_title_date": "6. mars–4. april 2023",
  "muerta_play_trailer": "Se trailer",
  "new_hero_tag": "Ny helt",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Helt",
  "muerta_navigation_event": "Minispillet",
  "muerta_navigation_janitor": "Funksjoner",
  "muerta_navigation_gameplay": "Spilloppdatering",
  "muerta_role1": "Carry",
  "muerta_role2": "Fjernkamp",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "Med hennes fryktede rikosjettskudd, åndemaning og et sidevåpen til overs var Muertas evne til å ta liv så imponerende at selv døden hadde henne på lønningslisten. Som en tostemplet hevngjerrig drapsmaskin fører Muerta villfarne sjeler til den andre siden, enten de vil det eller ei. Og om de ikke lar seg overbevise med det første, er hun klar til å vise sitt sanne vesen som et morderisk, marerittaktig gjenferd om det hjelper dem å dø litt fortere.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta avfyrer et spøkelsesaktig skudd mot en fiendtlig enhet eller et tre. Når kulen treffer, gjør den skade og hemmer i en kort periode, og rikosjetterer deretter i valgt retning. Rikosjetten gjør skade på alle enheter den passerer gjennom, og stopper når den treffer en helt. Helter som treffes av rikosjetten, løper i samme retning som skuddet.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Tilkaller en flokk gjenferd som sakte sirkler rundt valgt område. Fiender innenfor området hemmes og får redusert angrepshastighet. Gjenferdene gjør skade og stilner fiender som rører dem.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Muertas angrep har en sjanse til å avfyre enda et skudd på et annet mål. Helter prioriteres.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta forvandler seg og blir immun mot fysisk skade. All angrepsskaden hennes gjøres som magisk skade. Muerta får ekstra angrepsskade og fri ferdsel. Muerta kan angripe eteriske enheter, men gjør ingen skade på mål som er immune mot magi.",
  "muerta_heroes_title": "For detaljer om Muerta",
  "muerta_heroes_btn": "Se heltens informasjonsside",
  "muerta_wallpaper": "Bakgrunnsbilder",
  "muerta_minigame_title_pre": " ",
  "muerta_minigame_title": "Minispillet",
  "muerta_minigame_subtitle": "DE RASKE OG DE DØDE …",
  "muerta_minigame_subtitle2": "Muerta trenger hjelp til å finne de rette varme likene til den rette ferske graven – og det er her du kommer inn! Du får tildelt et mål før hver Dota-kamp under begivenheten Dead Reckoning. Få poeng for drap og medvirkninger, men pass på – motstanderen er ute etter deg også, og den som får flest poeng, får dobbelt så mye belønning!",
  "muerta_minigame_rules_title": "Blomster",
  "muerta_minigame_rules_desc": "Få drap og medvirkninger mot det tildelte målet for å tjene poeng og motta Muertas <b>blomster</b>. Få flere poeng enn målet ditt for å øke fortjenesten din.",
  "muerta_minigame_rules_title2": "Skatt",
  "muerta_minigame_rules_desc2": "Bytt blomster mot <b>Dead Reckoning-kister</b>, som er fulle av helt nye gjenstandssett og gjenstander fra begivenheten.",
  "muerta_minigame_rules_title3": "Nøkler",
  "muerta_minigame_rules_desc3": "Kjøp en <b>Dead Reckoning-nøkkel</b> for å låse opp kisten og avsløre belønningene i den. Nøkler kan kjøpes for %1$s eller 20 000 skår i skårbutikken.",
  "muerta_treasure_title": "Dead Reckoning-kiste",
  "muerta_treasure_content_desc": "Få flere blomster for ekstra sjanser for å låse opp disse gjenstandssettene fra Dead Reckoning-begivenheten. Muerta har gitt alle fem nøkler for å sparke festen i gang. Skaff deg så mange du vil med skår eller Dota-butikken.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "Nye funksjoner",
  "732e_patch_dotaplus_advancedstats_title": "Avansert kampstatistikk",
  "732e_patch_dotaplus_advancedstats_subtitle": "Dykk ned i egen historikk i Dota",
  "732e_patch_dotaplus_advancedstats_desc": "Forbedre og evaluer spillingen din med avansert kampstatistikk direkte i profilen. Medlemmer av Dota Plus har nå tilgang til helt nye spillanalyser i sanntid. Dykk ned i spillestilen din ved å sortere hele historikken din i Dota etter helt, rolle, spillmodus og mer.",
  "732e_patch_dotaplus_advancedstats_desc2": "Fokus på siste stikk? Krypstatistikken tar for seg dette. Prøver du å forbedre støtteferdighetene dine? Støttestatistikken avslører nå mer enn en sentry ward.",
  "732e_patch_quickkeys_title": "Tilpass hurtigkast",
  "732e_patch_quickkeys_subtitle": "Bedre kontroll til fingerspissene",
  "732e_patch_quickkeys_desc": "Med hurtigkast kan man nå velge hvilke enhetsspesifikke evner og gjenstander som aktiveres med tastetrykk eller tasteslipp. Prøv det ved å velge «Enhetsspesifikke hurtigtaster» for evner og gjenstander i hurtigtastfanen i innstillingene.",
  "732e_patch_friendslist_title": "Forbedringer til venneliste",
  "732e_patch_friendslist_subtitle": "Gi bestevennene i Dota behandlingen de fortjener",
  "732e_patch_friendslist_desc": "Med favorittfunksjonen kan du nå merke folkene du spiller mest med, så de holder seg øverst på vennelisten. Venner sorteres etter rekkefølgen favoritter, spiller Dota, tilkoblet og frakoblet. Du kan også bruke den nye søkefunksjonen til å finne akkurat den vennen du leter etter.",
  "732e_patch_title": "Spilloppdatering",
  "732e_patch_subtitle": "7.32E OG MER",
  "732e_patch_turbo_title": "Endringer i turbomodus",
  "732e_patch_turbo_intro": "Siden turbomodus stadig blir mer populært, vil vi gjerne sørge for at vi gjør alt vi kan for disse spillerne. Vi skal fortsette å forbedre den helhetlige spillopplevelsen, så hold utkikk etter flere endringer fremover.",
  "732e_patch_turbo_change_notes1": "Alle heltevalg er nå hemmelige.",
  "732e_patch_turbo_change_notes2": "Fjernet straffefase ved valg av helter. Når tiden løper ut, blir alle som ikke har valgt en helt, tvunget til å velge foreløpige valg. Hvis denne helten ikke er tilgjengelig, eller hvis de ikke har et foreløpig valg, blir de tildelt en tilfeldig helt.",
  "732e_patch_turbo_change_notes3": "Null Talisman, Wraith Band og Bracer får dobbelt bonus ved 12 minutter istedenfor 25 minutter.",
  "732e_patch_turbo_change_notes4": "Fjernet ekstra skade mot tårn fra alle tilkalte enheter. Enheter som ikke tilkalles (stikryp, dominerte kryp), er fremdeles sterkere mot tårn sammenlignet med vanlig Dota.",
  "732e_patch_turbo_change_notes5": "Du kan nå tjene to stjerner for helteutfordringer istedenfor kun én.",
  "732e_patch_turbo_change_notes6": "Juggernauts arkana Bladeform Legacy gir nå full uttelling for drap med Omnislash.",
  "732e_patch_turbo_change_notes7": "Earthshakers arkana Planetfall gir nå full uttelling for drap og medvirkninger med Echo Slam. Sporing av evner på rad og komboskade er også slått på.",
  "732e_patch_turbo_change_notes8": "Invokers udødelige gjenstand Dark Artistry Throwback gir nå full uttelling for drap med Sun Strike.",
  "732e_patch_turbo_change_notes9": "Lone Druids udødelige gjenstand Cauldron of Xahryx of Eminent Revival gir nå full uttelling for varigheten til Entangling Claws.",
  "732e_patch_turbo_change_notes10": "Kunkkas udødelige gjenstand Leviathan Whale Blade of Eminent Revival gir nå full uttelling for å treffe helter med Torrent.",
  "732e_patch_turbo_change_notes11": "Storm Spirits udødelige gjenstand The Lightning Orchid of Eminent Revival gir nå full uttelling for skade med Ball Lightning.",
  "732e_patch_turbo_change_notes12": "Lions udødelige gjenstand Fin King's Charm of Eminent Revival gir nå full uttelling for å forhekse fiender.",
  "732e_patch_turbo_change_notes13": "Leshracs udødelige gjenstand Torment Staff of Eminent Revival gir nå full uttelling for å lamme fiender med Split Earth.",
  "732e_patch_turbo_change_notes14": "Legion Commanders arkana teller nå seire med Duel.",
  "732e_patch_turbo_change_notes15": "Arkanafremdrift er blitt oppdatert for følgende:",
  "732e_bug_fixes_title": "Feilrettinger",
  "732e_bug_fixes_notes1": "Fikset et problem med at lagrede repriser ikke fikk kampdetaljer fylt ut ordentlig ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]problem 349[/u][/url]).",
  "732e_bug_fixes_notes2": "Fikset et problem med at helter av og til manglet modeller/materialer/osv. inntil man koblet seg tilbake til en kamp ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]problem 6070[/u][/url]).",
  "732e_bug_fixes_notes3": "Fikset en feil som førte til at Refresher Orb ikke alltid ble satt til nedkjøling når Refresher Shard ble brukt ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]problem 6668[/u][/url]).",
  "732e_bug_fixes_notes4": "Fikset en feil med at Monkey Kings Tree Dance ikke kunne brukes over veldig lange avstander ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]problem 717[/u][/url]).",
  "732e_bug_fixes_notes5": "Fikset et problem med at Lifestealer bommet på første infiserte angrep på fiender hvis brukt på visse avstander ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]problem 6801[/u][/url]).",
  "732e_bug_fixes_notes6": "Angrep med Jinada og Geminate kan nå brukes når påvirket av avbrudd, men ikke når stilnet. Atferden samsvarer nå med andre lignende evner i spillet ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]problem 6779[/u][/url]).",
  "732e_bug_fixes_notes7": "Fikset et problem med at partikkeleffekten til Tusks Snowball ikke ble ødelagt hvis snøballen ikke ble kastet ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problem 6805[/u][/url]).",
  "732e_bug_fixes_notes8": "Helter kan ikke lenger kanalisere Fiend's Gate inni en snøball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]problem 6670[/u][/url]).",
  "732e_bug_fixes_notes9": "Helter som kaster en snøball, rotfestes nå i tillegg til tidligere statuseffekter. Dette forårsaket enkelte problemer med partikkeleffekter når enkelte bevegelsesevner ble brukt under Snowball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problem 6805[/u][/url]).",
  "732e_bug_fixes_notes10": "Fikset en feil med at helbredelsen til KotLs Illuminate i Spirit Form på allierte ikke ble forsterket av helbredelsesstyrkelsen til KotL ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]problem 2176[/u][/url]).",
  "732e_bug_fixes_notes11": "Fikset et problem med at Primal Beasts Pulverize av og til kunne føre til at helter satte seg fast på Primal Beast hvis en sterk fordrivelse ble brukt under vertikal bevegelse fra en annen formel, som Lions Earth Spike ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]problem 3528[/u][/url]).",
  "732e_bug_fixes_notes12": "Fikset at verktøytipsene til Tusks Ice Shard og Svens God Strength ikke viste reduserte nedkjølingsverdier hvis aktuelle talenter ble valgt. Dette er kun en endring til teksten ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]problem 575[/u][/url]).",
  "732e_bug_fixes_notes13": "Fikset manglende nedkjølingsindikatorer for ladningsbaserte evner, inkludert evner som kun har ladninger når et tilsvarende talent eller Aghanim-oppgradering velges ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]problem 315[/u][/url]).",
  "732e_bug_fixes_notes14": "Fikset at helbredelsen til Spirit Vessel ikke ble regnet som helbredelse på oppsummeringsskjermen etter kamper ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]problem 213[/u][/url]).",
  "732e_bug_fixes_notes15": "Fikset manglende partikkel- og lydeffekter for Queen of Pain når Scream of Pain ble brukt uten mål innenfor rekkevidde ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]problem 5429[/u][/url]).",
  "732e_bug_fixes_notes16": "Kamproller vises nå ordentlig for spillere som ble frakoblet på begynnelsen av kampen.",
  "732e_bug_fixes_notes17": "Fikset at Omniknights Heavenly Grace ble deaktivert av avbrudd ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]problem 1649[/u][/url]).",
  "732e_bug_fixes_notes18": "Fikset et problem med at Troll Warlord kunne overstyre tvungne angrepskommandoer fra Battle Trance ved å bruke kommandoer for Whirling Axes (fjernkamp) utenfor bruksrekkevidde. Bruk på denne måten sender nå Whirling Axes (fjernkamp) i den retningen.",
  "732e_bug_fixes_notes19": "Fikset noen tilfeller der samtalemeldinger om frakobling og tilkobling på nytt ikke ble vist hvis spilleren var dempet.",
  "732e_bug_fixes_notes20": "La til «i kamper du vant» i edelsteinbeskrivelser som låser opp sekundære arkanastiler for Queen of Pain og Faceless Void. Dette er bare en tekstendring, da det alltid har vært nødvendig å vinne for å ha arkanafremdrift for disse to heltene.",
  "732e_bug_fixes_notes21": "La til ytterligere informasjon i verktøytipset til Glyph of Fortification ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]problem 6786[/u][/url]).",
  "732e_bug_fixes_notes22": "La til verktøytips (ved trykk på Alt) på evner som kan brukes på uskadelige enheter og fordrive enkelte uskadelige tilstander (Cyclone osv.), for å spesifisere at de kan brukes på uskadelige enheter.",
  "732e_bug_fixes_notes23": "Oppdaterte verktøytipsene til følgende evner:",
  "732e_bug_fixes_notes24": "Nightmare (Bane)",
  "732e_bug_fixes_notes25": "Poison (Beastmasters villsvin)",
  "732e_bug_fixes_notes26": "Wild Axes (Beastmaster)",
  "732e_bug_fixes_notes27": "Dispel Magic (Brewmasters Storm Brewling)",
  "732e_bug_fixes_notes28": "Poison Sting (Broodmothers edderkopp)",
  "732e_bug_fixes_notes29": "Ice Spire (Lich)",
  "732e_bug_fixes_notes30": "Purge (Necronomicon Archer)",
  "732e_bug_fixes_notes31": "Nullify (Nullifier)",
  "732e_bug_fixes_notes32": "Fortune's End (Oracle)",
  "732e_bug_fixes_notes33": "Purge (Satyr Banisher)",
  "732e_bug_fixes_notes34": "Demonic Cleanse (Shadow Demon)",
  "732e_bug_fixes_notes35": "Demonic Purge (Shadow Demon)",
  "732e_bug_fixes_notes36": "Storm Hammer (Sven)",
  "732e_bug_fixes_notes37": "Pit of Malice (Underlord)",
  "732e_bug_fixes_notes38": "Gjenstander fra Collector's Cache 2 kan gis som gave etter utpakking (på samme måte som gjenstander fra Collector's Cache).",
  "732e_bug_fixes_notes39": "Grensesnittet for talentoppgradering kan nå tilordnes en hurtigtast i avanserte bindinger.",
  "732e_bug_fixes_notes40": "Deaktiverte muligheten for å bruke matchmaking når flagget -dev er i bruk. Dette gjorde at tredjepartsverktøy kunne endre grensesnittets elementer på måter som kunne misbrukes.",
  "732e_bug_fixes_notes41": "Deaktiverte flere måter å få tilgang til andres profiler under valgfasen.",
  "732e_bug_fixes_notes42": "Når du trykker på fiender i toppfeltet under en kamp, får du se deres sist sette plassering og oppakning."
}