// 7590.js

{
  "language": "italian",
  "muerta_title": "Aggiornamento del Giudizio Mortale",
  "muerta_title_pre": "Aggiornamento:",
  "muerta_title_post": " ",
  "muerta_title_date": "6 marzo 2023 - 4 aprile 2023",
  "muerta_play_trailer": "Guarda il trailer",
  "new_hero_tag": "Nuovo Eroe",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Eroe",
  "muerta_navigation_event": "Minigioco",
  "muerta_navigation_janitor": "Funzionalità",
  "muerta_navigation_gameplay": "Aggiornamento di gioco",
  "muerta_role1": "Carry",
  "muerta_role2": "A distanza",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "Con i suoi temibili colpi di pistola, gli spiriti evocati e un'arma da fuoco di riserva, l'abilità di Muerta nell'eliminare vite umane era così impressionante che la Morte stessa la mise sul suo libro paga. Vendicatrice spietata equipaggiata di due pistole, Muerta accompagna le anime ribelli verso l'aldilà, che lo vogliano oppure no. E qualora avessero bisogno di una spinta in più, è pronta a rivelare la sua vera forma di incubo spettrale assassino, nella speranza di donar loro una morte più rapida.",
  "muerta_ability1_title": "Proiettile mortale",
  "muerta_ability1_desc": "Muerta spara un colpo spettrale contro un'Unità o un albero nemico. Quando va a segno, il proiettile danneggia e rallenta per breve tempo, dopodiché rimbalza nella direzione bersagliata. Il proiettile rimbalzato danneggia tutte le Unità che attraversa, fermandosi quando colpisce un Eroe. Gli Eroi colpiti dal proiettile rimbalzato correranno nella direzione del colpo.",
  "muerta_ability2_title": "Riunione di famiglia",
  "muerta_ability2_desc": "Evoca un gruppo di spiriti che circondano lentamente la zona bersagliata. I nemici all'interno dell'area vengono rallentati e possono attaccare ad una velocità minore. I fantasmi danneggiano e silenziano i nemici quando li attraversano.",
  "muerta_ability3_title": "Pistolera",
  "muerta_ability3_desc": "Gli attacchi di Muerta hanno la possibilità di sparare un secondo proiettile contro un altro bersaglio, dando priorità agli Eroi.",
  "muerta_ability4_title": "Perforazione del velo",
  "muerta_ability4_desc": "Muerta si trasforma, diventando immune ai danni fisici. Il danno di tutti i suoi attacchi viene convertito in danno magico. Muerta ottiene un bonus al danno d'attacco e può muoversi attraverso le Unità. Muerta può attaccare le Unità eteree, ma non danneggia i bersagli immuni alla magia.",
  "muerta_heroes_title": "Per le statistiche dettagliate su Muerta",
  "muerta_heroes_btn": "Visita la pagina dell'Eroe",
  "muerta_wallpaper": "Sfondi",
  "muerta_minigame_title_pre": "Il minigioco",
  "muerta_minigame_title": " ",
  "muerta_minigame_subtitle": "PRONTI A MORIRE…",
  "muerta_minigame_subtitle2": "Muerta ha bisogno di una mano per collocare i giusti cadaveri nelle giuste tombe... ed è qui che entri in gioco tu! Durante l'evento del Giudizio Mortale, ti verrà assegnato un bersaglio prima di ogni partita di Dota. Accumula punti con le uccisioni e gli aiuti, ma fai attenzione: anche il tuo avversario è in cerca del tuo sangue, e chi otterrà più punti riceverà una ricompensa doppia!",
  "muerta_minigame_rules_title": "Fiori",
  "muerta_minigame_rules_desc": "Ottieni uccisioni e aiuti contro il tuo bersaglio per accumulare punti e guadagnare i <b>Fiori</b> di Muerta. Accumula più punti del tuo bersaglio per incrementare il tuo bottino.",
  "muerta_minigame_rules_title2": "Tesoro",
  "muerta_minigame_rules_desc2": "Scambia i tuoi Fiori con gli <b>Scrigni del Giudizio Mortale</b>, carichi di nuovissimi set di oggetti, tra cui oggetti a tema dell'evento.",
  "muerta_minigame_rules_title3": "Chiavi",
  "muerta_minigame_rules_desc3": "Acquista una <b>Chiave del Giudizio Mortale</b> per aprire lo scrigno e svelare la ricompensa al suo interno. Le chiavi sono disponibili per %1$s o 20.000 Frammenti nel negozio dei Frammenti.",
  "muerta_treasure_title": "Scrigno del Giudizio Mortale",
  "muerta_treasure_content_desc": "Più Fiori riuscirai e ottenere e maggiore sarà la possibilità di sbloccare questi set di oggetti del Giudizio Mortale. Muerta ha concesso a tutti cinque chiavi per iniziare i festeggiamenti. Procuratene altre usando i Frammenti o nel negozio di Dota in base alle tue necessità.",
  "muerta_minigame_treasure_name1": "Il Cacciatore Spettrale",
  "muerta_minigame_treasure_name2": "La Luce Morente",
  "muerta_minigame_treasure_name3": "La Sfera Sacrificale",
  "muerta_minigame_treasure_name4": "Il Calore della Morte",
  "muerta_minigame_treasure_name5": "La Vipera Mortale",
  "muerta_minigame_treasure_name6": "La Bambola dei Morti",
  "muerta_minigame_treasure_name7": "L'Arma dell'Aldilà",
  "muerta_minigame_treasure_name8": "Il Serpente Fantasma",
  "janitors_corner_title": "Nuove funzionalità",
  "732e_patch_dotaplus_advancedstats_title": "Statistiche di battaglia avanzate",
  "732e_patch_dotaplus_advancedstats_subtitle": "Analizza i dati del tuo storico di Dota",
  "732e_patch_dotaplus_advancedstats_desc": "Analizza ed eleva il tuo gioco con le statistiche di battaglia avanzate direttamente nel tuo profilo. I membri di Dota Plus ora hanno accesso ad analisi di gioco in tempo reale completamente rinnovate. Analizza più a fondo il tuo stile di gioco ordinando lo storico delle partite di Dota per Eroe, ruolo, modalità di gioco e molto altro ancora.",
  "732e_patch_dotaplus_advancedstats_desc2": "Ti vuoi concentrare sui colpi di grazia? Il gruppo delle statistiche sui creep ti viene in soccorso. Vuoi migliorare le tue abilità come Support? Le statistiche Support ora sono più rivelatrici di un Guardiano Sentinella.",
  "732e_patch_quickkeys_title": "Lancio rapido personalizzabile",
  "732e_patch_quickkeys_subtitle": "Maggiore controllo a portata di mano",
  "732e_patch_quickkeys_desc": "La funzionalità del lancio rapido è stata aggiornata in modo da poter assegnare individualmente quali oggetti e abilità specifiche di ciascuna Unità verranno attivate premendo o rilasciando un tasto. Accedi alla sezione delle scorciatoie nel menu delle impostazioni e prova questa novità selezionando \"Scorciatoie specifiche per le Unità\" e \"Attiva lancio rapido\" per abilità e oggetti.",
  "732e_patch_friendslist_title": "Miglioramenti alla lista amici",
  "732e_patch_friendslist_subtitle": "Offri ai tuoi migliori amici di Dota il trattamento che si meritano",
  "732e_patch_friendslist_desc": "Con la funzionalità Preferiti, ora puoi contrassegnare le persone con cui giochi di più per mantenerle in cima alla tua lista amici. Ordina gli amici in base ai tuoi preferiti, a chi sta giocando a Dota o a chi è online/offline, oppure usa la nuova funzionalità di ricerca degli amici per trovare esattamente chi stai cercando.",
  "732e_patch_title": "Aggiornamento di gioco",
  "732e_patch_subtitle": "7.32E E ALTRO",
  "732e_patch_turbo_title": "Modifiche alla modalità Turbo",
  "732e_patch_turbo_intro": "Con l'aumento della popolarità della modalità Turbo, vogliamo assicurarci di fare tutto il possibile per quel gruppo di giocatori. Tieni d'occhio le altre modifiche in arrivo mentre continuiamo a migliorare l'esperienza generale di gioco.",
  "732e_patch_turbo_change_notes1": "Ora le scelte degli Eroi rimangono nascoste a tutti gli avversari.",
  "732e_patch_turbo_change_notes2": "Rimossa la fase delle penalità nella scelta degli Eroi. Al termine della normale selezione, chiunque non abbia ancora selezionato un Eroe sarà obbligato a scegliere quello che ha selezionato provvisoriamente. Nel caso in cui un Eroe non sia disponibile o non ci siano selezioni provvisorie, verrà assegnato un Eroe a caso.",
  "732e_patch_turbo_change_notes3": "Il Talismano Etereo, la Benda Spettrale e il Bracciale raddoppieranno i bonus a 12 minuti invece che a 25.",
  "732e_patch_turbo_change_notes4": "Rimosso il danno aggiuntivo alle torri da tutte le Unità evocate. Le Unità non evocate (creep della corsia, creep dominati) continuano ad essere più efficaci contro le torri rispetto che nelle partite non Turbo.",
  "732e_patch_turbo_change_notes5": "Ora è possibile guadagnare due stelle per le sfide degli Eroi al posto di una.",
  "732e_patch_turbo_change_notes6": "Ora l'oggetto Arcano \"L'Eredità dello Spadaccino\" di Juggernaut registra completamente le uccisioni con Onnisquarcio.",
  "732e_patch_turbo_change_notes7": "Ora l'oggetto Arcano \"Dominio Planetario\" di Earthshaker registra completamente le uccisioni e gli aiuti con Ecosisma. Viene anche tenuta traccia delle combo di abilità e del danno delle combo.",
  "732e_patch_turbo_change_notes8": "Ora il set Immortale \"Ritorno del Maestro dell'Oscurità\" di Invoker registra completamente le uccisioni con Colpo solare.",
  "732e_patch_turbo_change_notes9": "Ora l'oggetto Immortale \"Calderone di Xahryx della Promessa di Rinascita\" di Lone Druid registra completamente la durata di Artigli intrappolanti.",
  "732e_patch_turbo_change_notes10": "Ora l'oggetto Immortale \"Lama di Balena Leviatana della Promessa di Rinascita\" di Kunkka registra completamente il numero di Eroi colpiti con Torrente.",
  "732e_patch_turbo_change_notes11": "Ora l'oggetto Immortale \"L'Orchidea Fulminea della Promessa di Rinascita\" di Storm Spirit registra completamente il danno di Fulmine globulare.",
  "732e_patch_turbo_change_notes12": "Ora l'oggetto Immortale \"Reliquia del Re Pinna della Promessa di Rinascita\" di Lion registra completamente la durata di Maledizione.",
  "732e_patch_turbo_change_notes13": "Ora l'oggetto Immortale \"Bastone Tormentato della Promessa di Rinascita\" di Leshrac registra completamente il numero di Eroi storditi con Spacca-terra.",
  "732e_patch_turbo_change_notes14": "Ora l'oggetto Arcano di Legion Commander registra le vittorie nei duelli.",
  "732e_patch_turbo_change_notes15": "Il progresso degli oggetti Arcani è stato aggiornato nei seguenti casi:",
  "732e_bug_fixes_title": "Bug risolti",
  "732e_bug_fixes_notes1": "Risolto il problema per cui i replay salvati non venivano popolati correttamente con i dettagli della partita ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]problema 349[/u][/url]).",
  "732e_bug_fixes_notes2": "Risolto il problema per cui talvolta agli Eroi mancavano modelli, materiali e altro ancora finché non ci si riconnetteva alla partita ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]problema 6070[/u][/url]).",
  "732e_bug_fixes_notes3": "Risolto il problema per cui di tanto in tanto il Globo del Ristoro non entrava in ricarica dopo l'utilizzo del Frammento del Ristoro ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]problema 6668[/u][/url]).",
  "732e_bug_fixes_notes4": "Risolto il problema per cui non era possibile utilizzare l'abilità Danza dell'albero di Monkey King a gittate molto elevate ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]problema 717[/u][/url]).",
  "732e_bug_fixes_notes5": "Risolto il problema per cui Lifestealer falliva il suo primo attacco di Infestazione contro i nemici se l'abilità veniva usata a determinate gittate ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]problema 6801[/u][/url]).",
  "732e_bug_fixes_notes6": "Ora le abilità Jinada e Attacco appaiato possono essere usate sotto l'effetto di Break, ma non durante un silenziamento. Ora questo comportamento è coerente con quello di altre abilità simili nel gioco ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]problema 6779[/u][/url]).",
  "732e_bug_fixes_notes7": "Risolto il problema per cui l'effetto particellare di Palla di neve di Tusk non veniva distrutto quando il lancio della Palla di neve non andava a buon fine ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problema 6805[/u][/url]).",
  "732e_bug_fixes_notes8": "Gli Eroi non possono più canalizzare l'abilità Passaggio demoniaco quando si trovano all'interno della Palla di neve ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]problema 6670[/u][/url]).",
  "732e_bug_fixes_notes9": "Ora gli Eroi che lanciano Palla di neve vengono radicati oltre a subire gli altri effetti negativi. Questa modifica è stata necessaria per via di problemi con gli effetti particellari quando venivano utilizzate alcune abilità di movimento durante l'uso di Palla di neve ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problema 6805[/u][/url]).",
  "732e_bug_fixes_notes10": "Risolto il problema per cui la guarigione applicata sugli alleati da Illuminazione durante Forma spirituale non veniva amplificata dal bonus di amplificazione della cura di Keeper of the Light ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]problema 2176[/u][/url]).",
  "732e_bug_fixes_notes11": "Risolto il problema per cui l'abilità Annientamento bloccava gli Eroi su Primal Beast per un tempo indefinito quando si verificava una dissipazione potente durante il movimento verticale di un'altra abilità, tra cui Spuntoni di roccia di Lion ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]problema 3528[/u][/url]).",
  "732e_bug_fixes_notes12": "Corrette le descrizioni delle abilità Frammenti di ghiaccio di Tusk e Forza divina di Sven per mostrare il tempo di ricarica corretto quando vengono scelti i talenti di riduzione del tempo di ricarica. Si tratta di una semplice modifica testuale ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]problema 575[/u][/url]).",
  "732e_bug_fixes_notes13": "Aggiunti gli indicatori mancanti del tempo di ricarica per le abilità che fanno uso di cariche, incluse le abilità che ottengono le cariche soltanto con un talento corrispondente o lo Scettro/Frammento di Aghanim ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]problema 315[/u][/url]).",
  "732e_bug_fixes_notes14": "Risolto il problema per cui la guarigione del Ricettacolo Spirituale non veniva considerata dalla statistica \"Cura\" nella schermata di post-partita ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]problema 213[/u][/url]).",
  "732e_bug_fixes_notes15": "Risolto il problema per cui gli effetti sonori e particellari dell'abilità Urlo del dolore di Queen of Pain risultavano mancanti se usata senza nessun bersaglio a portata ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]problema 5429[/u][/url]).",
  "732e_bug_fixes_notes16": "Ora i ruoli di gioco vengono mostrati correttamente ai giocatori che si sono disconnessi all'inizio della partita.",
  "732e_bug_fixes_notes17": "Risolto il problema per cui l'abilità Grazia divina di Omniknight veniva disabilitata dall'effetto di Break ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]problema 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Risolto il problema per cui Troll Warlord poteva ignorare gli attacchi forzati di Estasi della battaglia utilizzando Asce rotanti (distanza) fuori dalla gittata di lancio. Usare l'abilità in questo modo ora provocherà il lancio di Asce rotanti (distanza) in quella direzione.",
  "732e_bug_fixes_notes19": "Risolti alcuni casi in cui i messaggi di disconnessione e riconnessione non venivano mostrati ai giocatori bloccati in chat.",
  "732e_bug_fixes_notes20": "Aggiunta la dicitura \"in partite vittoriose\" alla descrizione delle gemme per sbloccare gli stili secondari dei set Arcani di Queen of Pain e Faceless Void. Si tratta di una semplice modifica testuale: il progresso degli Arcani di questi due Eroi richiedeva di vincere la partita anche in precedenza.",
  "732e_bug_fixes_notes21": "Aggiunte altre informazioni alla descrizione di Glifo della fortificazione ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]problema 6786[/u][/url]).",
  "732e_bug_fixes_notes22": "Nel caso di abilità che possono bersagliare Unità invulnerabili e dissipare alcuni stati di invulnerabilità (Ciclone e così via), sono state aggiunte descrizioni visualizzabili premendo ALT in cui viene specificato che possono essere usate sulle Unità invulnerabili.",
  "732e_bug_fixes_notes23": "Aggiornate le descrizioni delle seguenti abilità:",
  "732e_bug_fixes_notes24": "Incubo (Bane)",
  "732e_bug_fixes_notes25": "Veleno (Cinghiale di Beastmaster)",
  "732e_bug_fixes_notes26": "Asce selvagge (Beastmaster)",
  "732e_bug_fixes_notes27": "Spezza-incantesimi (guerriero della Tempesta di Brewmaster)",
  "732e_bug_fixes_notes28": "Puntura velenosa (Ragno di Broodmother)",
  "732e_bug_fixes_notes29": "Spira di ghiaccio (Lich)",
  "732e_bug_fixes_notes30": "Epurazione (Arciere del Necronomicon)",
  "732e_bug_fixes_notes31": "Nullificazione (Nullificatore)",
  "732e_bug_fixes_notes32": "Fine della fortuna (Oracle)",
  "732e_bug_fixes_notes33": "Epurazione (Satiro Banditore)",
  "732e_bug_fixes_notes34": "Purificazione demoniaca (Shadow Demon)",
  "732e_bug_fixes_notes35": "Epurazione demoniaca (Shadow Demon)",
  "732e_bug_fixes_notes36": "Martello della tempesta (Sven)",
  "732e_bug_fixes_notes37": "Fossa della malignità (Underlord)",
  "732e_bug_fixes_notes38": "Ora gli oggetti del Bottino del Collezionista 2 possono essere donati dopo l'apertura, così come accade per il Bottino del Collezionista 1.",
  "732e_bug_fixes_notes39": "Ora è possibile assegnare dei tasti alle opzioni nell'interfaccia dei talenti tramite il menu delle scorciatoie avanzate.",
  "732e_bug_fixes_notes40": "Ora non è più possibile unirsi alle partite di matchmaking in cui è stato usato il flag -dev. Ciò consentiva agli strumenti di terze parti di modificare gli elementi dell'interfaccia in modo deleterio.",
  "732e_bug_fixes_notes41": "Eliminati alcuni modi aggiuntivi per accedere al profilo di qualcuno durante la fase di scelta degli Eroi.",
  "732e_bug_fixes_notes42": "Ora è possibile fare clic sui nemici nella barra superiore durante una partita per mostrare la loro posizione e lo stato del loro inventario al momento dell'ultimo avvistamento."
}