// 7944.js

{
  "language": "german",
  "muerta_title": "Die Rache der Toten",
  "muerta_title_pre": "Das",
  "muerta_title_post": "Update",
  "muerta_title_date": "6. März 2023 – 4. April 2023",
  "muerta_play_trailer": "Trailer abspielen",
  "new_hero_tag": "Neue Heldin",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Held",
  "muerta_navigation_event": "Minispiel",
  "muerta_navigation_janitor": "Funktionen",
  "muerta_navigation_gameplay": "Gameplay-Update",
  "muerta_role1": "Carry",
  "muerta_role2": "Fernkampf",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "Mit ihren zwei Knarren, gefürchteten Trickschüssen und beschworenen Geistern zeigte Muerta ein derart tödliches Talent, dass sie von Gevatter Tod höchstselbst angeheuert wurde. Die zwei Pistolen waren ein Geschenk ihres Meisters, verfehlen niemals ihr Ziel und weisen verlorenen Seelen den Weg ins Jenseits. Wer dennoch Widerstand leistet, den sucht Muerta in ihrer wahren Gestalt heim und löscht als mörderischer geisterhafter Albtraum selbst das hellste Lebenslicht aus.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta feuert ein geisterhaftes Geschoss auf eine gegnerische Einheit oder einen Baum. Beim Aufprall verursacht die Kugel Schaden und verlangsamt das Ziel kurz, bevor sie in eine zuvor ausgewählte Richtung abprallt. Der Querschläger durchdringt Einheiten auf seinem Weg und fügt diesen Schaden zu. Wird ein Held getroffen, stoppt die Kugel und der getroffene Held flieht in Flugrichtung.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Beschwört eine Gruppe von Geistern, die langsam den Zielort umkreisen. Gegnerische Einheiten, die sich innerhalb des Zielorts befinden, werden verlangsamt und ihr Angriffstempo wird reduziert. Wenn gegnerische Einheiten beim Fluchtversuch mit den Geistern kollidieren, erleiden sie Schaden und werden verstummt.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Muertas Angriffe haben eine Chance, einen zweiten Schuss auf ein anderes Ziel abzufeuern. Dieser priorisiert Helden.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta verwandelt sich und wird immun gegen physischen Schaden. All ihr Angriffsschaden wird in magischen Schaden umgewandelt. Muerta erhält Bonusangriffsschaden und kann sich durch Objekte und Gegner hindurchbewegen. Muerta kann ätherische Einheiten angreifen, fügt aber Zielen mit Zauberimmunität keinen Schaden zu.",
  "muerta_heroes_title": "Für alle Details zu Muerta",
  "muerta_heroes_btn": "Heldenseite anzeigen",
  "muerta_wallpaper": "Hintergrundbilder",
  "muerta_minigame_title_pre": "Das",
  "muerta_minigame_title": "Minispiel",
  "muerta_minigame_subtitle": "SCHNELLER ALS DER TOD …",
  "muerta_minigame_subtitle2": "Muerta benötigt Hilfe, um die richtigen, noch warmen Körper in die entsprechenden frischen Gräber zu befördern … und hier kommen Sie ins Spiel. Ihnen wird während des Events „Die Rache der Toten“ vor jeder Dota-Partie ein Ziel zugeteilt. Kills und Assists an diesem bringen Ihnen Punkte, aber bleiben Sie wachsam! Ihr Gegner ist auch auf Ihr Blut aus und wer die meisten Punkte erzielt, erhält die doppelte Belohnung.",
  "muerta_minigame_rules_title": "Blumen",
  "muerta_minigame_rules_desc": "Mit Kills und Assists gegen das Ihnen zugewiesene Ziel verdienen Sie Punkte und Muertas <b>Blumen</b>. Sammeln Sie mehr Punkte als Ihr Ziel, um die Ausbeute zu erhöhen.",
  "muerta_minigame_rules_title2": "Schatz",
  "muerta_minigame_rules_desc2": "Tauschen Sie Ihre Blumen gegen <b>Truhen zur Rache der Toten</b>, prall gefüllt mit neuen Gegenstandssets und Gegenständen im Stil des Events.",
  "muerta_minigame_rules_title3": "Schlüssel",
  "muerta_minigame_rules_desc3": "Kaufen Sie einen <b>Schlüssel zur Rache der Toten</b>, um die Truhe zu öffnen und den Schatz im Innern zu enthüllen. Schlüssel können für %1$s oder 20.000 Splitter im Splittershop erworben werden.",
  "muerta_treasure_title": "Truhe zur Rache der Toten",
  "muerta_treasure_content_desc": "Sichern Sie sich mehr Blumen und erhöhen Sie Ihre Chancen, Gegenstandssets im Stil des Events „Rache der Toten“ freizuschalten. Muerta gewährt Ihnen zum Start des Events fünf Schlüssel. Nicht genug? Holen Sie sich mehr im Dota-Shop oder mit Splittern.",
  "muerta_minigame_treasure_name1": "Spektraler Jäger",
  "muerta_minigame_treasure_name2": "Schwindendes Licht",
  "muerta_minigame_treasure_name3": "Altarball",
  "muerta_minigame_treasure_name4": "Tödliche Hitze",
  "muerta_minigame_treasure_name5": "Todesotter",
  "muerta_minigame_treasure_name6": "Puppe der Toten",
  "muerta_minigame_treasure_name7": "Erloschene Pistole",
  "muerta_minigame_treasure_name8": "Seelenschlange",
  "janitors_corner_title": "Neue Funktionen",
  "732e_patch_dotaplus_advancedstats_title": "Erweiterter Schlachtenbericht",
  "732e_patch_dotaplus_advancedstats_subtitle": "Tauchen Sie ein in die Daten Ihrer Dota-Vergangenheit",
  "732e_patch_dotaplus_advancedstats_desc": "Analysieren Sie Ihr Spiel noch detaillierter mit den neuen Schlachtenberichten im Profilbildschirm. Dota-Plus-Mitglieder können nun auf komplett überarbeitete Echtzeitstatistiken zugreifen. Nehmen Sie Ihren Spielstil auseinander, indem Sie alle vergangenen Partien z. B. nach Held, Rolle oder Spielmodus sortieren.",
  "732e_patch_dotaplus_advancedstats_desc2": "Sie interessieren sich für Last Hits? Die Dienerstatistik liefert Antworten. Ihre Support-Fähigkeiten lassen zu wünschen übrig? Die Statistik zur Support-Rolle deckt jetzt mehr auf als ein Sentry Ward.",
  "732e_patch_quickkeys_title": "Anpassbares Schnellzaubern",
  "732e_patch_quickkeys_subtitle": "Mehr Kontrolle unter Ihren Fingerspitzen",
  "732e_patch_quickkeys_desc": "Beim Schnellzaubern kann nun individuell angepasst werden, welche einheitenspezifischen Fähigkeiten und Gegenstände beim Drücken einer Taste ausgelöst werden und welche beim Loslassen. Wählen Sie gleichzeitig „Einheitenspezifische Hotkeys“ und „Schnellzauber aktivieren“ für Fähigkeiten und Gegenstände im Hotkeys-Reiter des Einstellungsmenüs.",
  "732e_patch_friendslist_title": "Verbesserungen an der Freundesliste",
  "732e_patch_friendslist_subtitle": "Geben Sie Ihren liebsten Dota-Freunden die Anerkennung, die sie verdienen",
  "732e_patch_friendslist_desc": "Mit der Funktion „Favorit“ können Sie Freunde markieren, mit denen Sie am häufigsten zusammenzuspielen, damit diese auf Ihrer Freundesliste an oberster Stelle aufgeführt werden. Sortieren Sie Ihre Freunde nach „Favoriten“, „Spielen Dota“, „Online“ und „Offline“ oder finden Sie mit der neuen Freundessuche die gewünschte Person noch schneller.",
  "732e_patch_title": "Gameplay-Update",
  "732e_patch_subtitle": "7.32E UND MEHR",
  "732e_patch_turbo_title": "Änderungen am Turbomodus",
  "732e_patch_turbo_intro": "Da der Turbomodus immer beliebter wird, möchten wir die Fans mit allen Mitteln unterstützen. Deshalb arbeiten wir derzeit daran, das Gesamterlebnis für diesen Modus zu verbessern – halten Sie also zukünftig nach weiteren Änderungen Ausschau.",
  "732e_patch_turbo_change_notes1": "Die Heldenauswahl erfolgt jetzt verdeckt.",
  "732e_patch_turbo_change_notes2": "Wir haben die Strafphase bei der Auswahl von Helden entfernt. Wenn die reguläre Auswahlzeit abläuft, wird jedem Spieler, der noch keinen Helden festgelegt hat, der in diesem Moment vorläufig ausgewählte Held zugewiesen. Falls dieser Held nicht verfügbar ist oder kein Held ausgewählt wurde, wird ein zufälliger Held zugewiesen.",
  "732e_patch_turbo_change_notes3": "Die Boni von Null Talisman, Wraith Band und Bracer werden ab sofort nach zwölf Minuten anstatt nach 25 Minuten verdoppelt.",
  "732e_patch_turbo_change_notes4": "Beschworene Einheiten erhalten keinen Bonusschaden gegen Türme mehr. Nicht-beschworene Einheiten (Pfaddiener, dominierte Einheiten) fügen Türmen nach wie vor erhöhten Schaden zu (im Vergleich zu Partien, die nicht im Turbomodus gespielt werden).",
  "732e_patch_turbo_change_notes5": "Es können jetzt in Heldenherausforderungen zwei Sterne statt ein Stern verdient werden.",
  "732e_patch_turbo_change_notes6": "Das Arkana „Bladeform Legacy“ von Juggernaut rechnet jetzt Omnislash-Kills vollständig an.",
  "732e_patch_turbo_change_notes7": "Das Arkana „Planetfall“ von Earthshaker rechnet jetzt Echo-Slam-Kills und -Assists vollständig an. Die Nachverfolgung von verketteten Fähigkeiten und Komboschaden ist jetzt ebenfalls aktiviert.",
  "732e_patch_turbo_change_notes8": "Immortal-Gegenstand „Rückkehr zu den dunklen Künsten“ für Invoker rechnet jetzt Sun-Strike-Kills vollständig an.",
  "732e_patch_turbo_change_notes9": "Immortal-Gegenstand „Cauldron of Xahryx of Eminent Revival“ für Lone Druid rechnet jetzt die Dauer von Entangling Claws vollständig an.",
  "732e_patch_turbo_change_notes10": "Immortal-Gegenstand „Leviathan-Walklinge der baldigen Wiederkehr“ für Kunkka rechnet jetzt mit Torrent getroffene Helden vollständig an.",
  "732e_patch_turbo_change_notes11": "Immortal-Gegenstand „Die Blitzorchidee der baldigen Wiederkehr“ rechnet jetzt den Schaden von Ball Lightning vollständig an.",
  "732e_patch_turbo_change_notes12": "Immortal-Gegenstand „Des Finnenkönigs Talisman der baldigen Wiederkehr“ für Lion rechnet jetzt verhexte gegnerische Einheiten vollständig an.",
  "732e_patch_turbo_change_notes13": "Immortal-Gegenstand „Gepeinigter Stab der baldigen Wiederkehr“ für Leshrac rechnet jetzt mit Split Earth betäubte gegnerische Einheiten vollständig an.",
  "732e_patch_turbo_change_notes14": "Arkana „Legion Commander“ rechnet jetzt Duellsiege an.",
  "732e_patch_turbo_change_notes15": "Arkana-Fortschritt wurde aktualisiert:",
  "732e_bug_fixes_title": "Behobene Fehler",
  "732e_bug_fixes_notes1": "Fehler korrigiert, durch den gespeicherte Aufzeichnungen nicht ordnungsgemäß mit den Informationen zur jeweiligen Partie gefüllt wurden. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]Fehler Nr. 349[/u][/url])",
  "732e_bug_fixes_notes2": "Fehler korrigiert, durch den Modelle/Materialien/usw. von Helden gelegentlich fehlten, bis die Verbindung zum Spiel wiederhergestellt werden konnte. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]Fehler Nr. 6070[/u][/url])",
  "732e_bug_fixes_notes3": "Fehler korrigiert, durch den Refresher Orb gelegentlich nicht abklang, wenn Refresher Shard verwendet wurde. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]Fehler Nr. 6668[/u][/url])",
  "732e_bug_fixes_notes4": "Fehler korrigiert, durch den Tree Dance von Monkey King bei sehr langen Zauberreichweiten nicht gewirkt werden konnte. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]Fehler Nr. 717[/u][/url])",
  "732e_bug_fixes_notes5": "Fehler korrigiert, durch den der erste befallene Angriff von Lifestealer auf einige gegnerische Einheiten fehlschlug, wenn Infest auf bestimmten Reichweiten gewirkt wurde. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]Fehler Nr. 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Angriffe mit Jinada (Bounty Hunter) und Geminate (Weaver) können jetzt ausgeführt werden, während die Helden unterbrochen sind, aber nicht, wenn sie verstummt sind. Das Verhalten stimmt jetzt mit anderen, ähnlichen Fähigkeiten im Spiel überein. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]Fehler Nr. 6779[/u][/url])",
  "732e_bug_fixes_notes7": "Fehler korrigiert, durch den der Partikeleffekt von Tusks Snowball nicht zerstört wurde, wenn der Schneeball nicht geworfen werden konnte. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]Fehler Nr. 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Helden können nicht länger Fiend's Gate kanalisieren, während sie sich in einem Schneeball befinden. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]Fehler Nr. 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Helden werden beim Einsatz von Snowball jetzt zusätzlich zu den vorherigen Statuseffekten festgesetzt. Zuvor kam es zu einigen Problemen mit Partikeleffekten, wenn während Snowball bestimmte Bewegungsfähigkeiten aktiviert wurden. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]Fehler Nr. 6805[/u][/url])",
  "732e_bug_fixes_notes10": "Fehler korrigiert, durch den KotLs Heilung von Verbündeten mit Illuminate unter der Verwendung von Spirit Form nicht von KotLs Heilungsverstärkung verstärkt wurde. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]Fehler Nr. 2176[/u][/url])",
  "732e_bug_fixes_notes11": "Fehler korrigiert, durch den Primal Beasts Pulverize gelegentlich dazu führte, dass Helden dauerhaft an Primal Beast festgehangen haben, wenn Pulverize während der vertikalen Bewegung durch einen anderen Zauberspruch entzaubert wurde, beispielsweise durch Lions Earth Spike. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]Fehler Nr. 3528[/u][/url])",
  "732e_bug_fixes_notes12": "Die Beschreibungen von Tusks Ice Shards und Svens God's Strength zeigen jetzt die reduzierte Abklingzeit an, wenn die entsprechenden Talente ausgewählt wurden. Hierbei handelt es sich nur um eine Textänderung. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]Fehler Nr. 575[/u][/url])",
  "732e_bug_fixes_notes13": "Fehlende Abklingzeitindikatoren für Fähigkeiten mit Aufladungen hinzugefügt, inklusive Fähigkeiten, die nur dann Aufladungen haben, wenn ein damit verbundenes Talent oder eine Verstärkung mit Aghanims Zepter ausgewählt wurde. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]Fehler Nr. 315[/u][/url])",
  "732e_bug_fixes_notes14": "Fehler korrigiert, durch den die Heilung durch Spirit Vessel in der Spielanalyse nach dem Spiel nicht als Heilung gezählt wurde. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]Fehler Nr. 213[/u][/url])",
  "732e_bug_fixes_notes15": "Fehler korrigiert, durch den die Partikel- und Soundeffekte der Queen of Pain fehlten, wenn Scream of Pain ohne Ziele in Reichweite gewirkt wurde. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]Fehler Nr. 5429[/u][/url])",
  "732e_bug_fixes_notes16": "Die Rollen im Spiel werden für Spieler, deren Verbindung zu Beginn der Partie getrennt wurde, jetzt ordnungsgemäß angezeigt.",
  "732e_bug_fixes_notes17": "Fehler korrigiert, durch den Omniknights Heavenly Grace bei Unterbrechung deaktiviert wurde. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]Fehler Nr. 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Fehler korrigiert, durch den Troll Warlord die mit Battle Trance erzwungenen Angriffsbefehle durch die Ausführung von Whirling Axes (Fernkampf) außerhalb der Zauberreichweite überschreiben konnte. Stattdessen wirft er jetzt Whirling Axes (Fernkampf) in Richtung des anvisierten Ortes.",
  "732e_bug_fixes_notes19": "Einige Fälle behoben, in denen Chatnachrichten über eine getrennte oder wiederhergestellte Verbindung nicht angezeigt wurden, wenn der Spieler stummgeschaltet war.",
  "732e_bug_fixes_notes20": "Der Edelsteinbeschreibung zur Freischaltung der Sekundärstile der Arkanas von Queen of Pain und Faceless Void wurde der Text „in siegreichen Partien“ hinzugefügt. Hierbei handelt es sich nur um eine Textänderung. Für den Arkana-Fortschritt dieser beiden Helden waren schon immer Siege erforderlich.",
  "732e_bug_fixes_notes21": "Der Beschreibung der Glyphe der Verstärkung wurden zusätzliche Informationen hinzugefügt. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]Fehler Nr. 6786[/u][/url])",
  "732e_bug_fixes_notes22": "Fähigkeiten, die unverwundbare Ziele anvisieren und gewisse Zustände der Unverwundbarkeit entzaubern können (z. B. Cyclone), erwähnen dies nun in ihren ALT-Beschreibungen.",
  "732e_bug_fixes_notes23": "Beschreibungen der folgenden Fähigkeiten angepasst:",
  "732e_bug_fixes_notes24": "Banes Nightmare",
  "732e_bug_fixes_notes25": "Beastmasters Boar Poison",
  "732e_bug_fixes_notes26": "Beastmasters Wild Axes",
  "732e_bug_fixes_notes27": "Dispel Magic des Brewmaster-Sturmlings",
  "732e_bug_fixes_notes28": "Poison Sting von Broodmothers Spinnlingen",
  "732e_bug_fixes_notes29": "Lichs Ice Spire",
  "732e_bug_fixes_notes30": "Purge des Necronomicon-Bogenschützen",
  "732e_bug_fixes_notes31": "Nullify des Nullifiers",
  "732e_bug_fixes_notes32": "Oracles Fortune's End",
  "732e_bug_fixes_notes33": "Purge des Satyr Banishers",
  "732e_bug_fixes_notes34": "Shadow Demons Demonic Cleanse",
  "732e_bug_fixes_notes35": "Shadow Demons Demonic Purge",
  "732e_bug_fixes_notes36": "Svens Storm Hammer",
  "732e_bug_fixes_notes37": "Underlords Pit of Malice",
  "732e_bug_fixes_notes38": "Gegenstände aus der Truhe des Sammlers 2 können jetzt ebenso wie die Truhe des Sammlers 1 nach dem Auspacken verschenkt werden.",
  "732e_bug_fixes_notes39": "In den erweiterten Hotkeyeinstellungen können nun Hotkeys zur Aufwertung von Talenten zugewiesen werden.",
  "732e_bug_fixes_notes40": "Mit aktivierter Startoption „-dev“ kann nicht mehr an der Spielsuche teilgenommen werden. Drittanbietersoftware missbrauchte diese Einstellung, um Elemente der Benutzeroberfläche zu manipulieren.",
  "732e_bug_fixes_notes41": "Einige zusätzliche Zugriffsmöglichkeiten auf die Profile von Spielern während der Auswahlphase deaktiviert.",
  "732e_bug_fixes_notes42": "Das Klicken auf einen Gegner in der oberen Leiste zeigt während einer Partie jetzt dessen letzten bekannten Aufenthaltsort und seinen Inventarstatus an."
}