// 8794.js

{
  "language": "english",
  "muerta_title": "The Dead Reckoning Update",
  "muerta_title_pre": "The",
  "muerta_title_post": "Update",
  "muerta_title_date": "March 6, 2023 - April 4, 2023",
  "muerta_play_trailer": "Play Trailer",
  "new_hero_tag": "New Hero",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Hero",
  "muerta_navigation_event": "Mini-Game",
  "muerta_navigation_janitor": "Features",
  "muerta_navigation_gameplay": "Gameplay Update",
  "muerta_role1": "Carry",
  "muerta_role2": "Ranged",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "With her fearsome trickshots, summoned spirits, and a sidearm to spare, Muerta's knack for taking lives was so impressive, Death himself put her on the payroll. A twin-pistoled engine of dead-eyed vengeance, Muerta shepherds wayward souls to the other side, whether they want to get there or not. And if they need more convincing, she’s ready to reveal her true form as a murderous spectral nightmare if it helps them die a little faster.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta fires a ghostly bankshot at an enemy unit or tree. When the bullet strikes, it damages and briefly slows, then ricochets in the targeted direction. The ricochet damages all units that it passes through, stopping when it hits a hero. Heroes hit by the ricochet will run in the direction of the shot.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Summons a group of revenants that slowly circle the targeted location. Enemies within the area are slowed and have reduced attack speed. Revenants deal damage and silence enemies as they pass through them.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Muerta's attacks have a chance to fire a second shot at another target, prioritizing Heroes.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta transforms, becoming immune to physical damage. All of her attack damage is dealt as magical damage. Muerta gains bonus attack damage and phased movement. Muerta can attack ethereal units, but deals no damage to Magic Immune targets.",
  "muerta_heroes_title": "For detailed stats about Muerta",
  "muerta_heroes_btn": "View Hero Detail Page",
  "muerta_wallpaper": "Wallpapers",
  "muerta_minigame_title_pre": "The",
  "muerta_minigame_title": "Mini-Game",
  "muerta_minigame_subtitle": "THE QUICK AND THE DEAD…",
  "muerta_minigame_subtitle2": "Muerta needs help getting the right warm bodies in the right fresh graves... and that’s where you come in! You’ll get an assigned target before every Dota game during the Dead Reckoning event. Score points for Kills and Assists. But watch out — your opponent’s out for your blood too, and whoever scores more gets twice the reward!",
  "muerta_minigame_rules_title": "Flowers",
  "muerta_minigame_rules_desc": "Get Kills and Assists against your assigned target to score points and earn Muerta's <b>Flowers</b>. Score more points than your target to increase your haul.",
  "muerta_minigame_rules_title2": "Treasure",
  "muerta_minigame_rules_desc2": "Trade your Flowers for <b>Dead Reckoning Chests</b>, loaded with all-new item sets, and including event-themed items.",
  "muerta_minigame_rules_title3": "Keys",
  "muerta_minigame_rules_desc3": "Buy a <b>Dead Reckoning Key</b> to unlock the chest and unveil the reward inside. Keys are available for %1$s or 20,000 shards in the Shard Shop.",
  "muerta_treasure_title": "Dead Reckoning Chest",
  "muerta_treasure_content_desc": "Score more flowers for extra chances to unlock these Dead Reckoning-themed item sets. Muerta has granted everyone five keys to kick off the celebration. Snag as many more as you need using Shards or the Dota Store.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "New Features",
  "732e_patch_dotaplus_advancedstats_title": "Advanced Battle Stats",
  "732e_patch_dotaplus_advancedstats_subtitle": "Dive Into the Data of your Dota History",
  "732e_patch_dotaplus_advancedstats_desc": "Elevate — and evaluate — your game with advanced Battle Stats directly in your profile.  Dota Plus members now have access to completely revamped, real-time gameplay analytics. Dig deeper into your play style by sorting your complete Dota history by hero, role, game mode, and more.",
  "732e_patch_dotaplus_advancedstats_desc2": "Focusing on last hitting? Your Creeps stats group has you covered. Improving your support skills? Support stats are now more revealing than a sentry ward.",
  "732e_patch_quickkeys_title": "Customizable Quickcasting",
  "732e_patch_quickkeys_subtitle": "Finer Control at Your Fingertips",
  "732e_patch_quickkeys_desc": "Quickcast users can now individually assign which unit-specific abilities and items are triggered using key press or release. Check it out by selecting 'Unit Specific Hotkeys' and 'Enable Quickcast' for Abilities and Items in the Hotkeys tab of the Settings menu.",
  "732e_patch_friendslist_title": "Friends List Improvements",
  "732e_patch_friendslist_subtitle": "Give Your Best Dota Friends the Treatment They Deserve",
  "732e_patch_friendslist_desc": "With the Favorite feature, you can now tag the people you play with the most to keep them at the top of your friends list. Sort your friends in order of Favorites, Playing Dota, Online, and Offline. Or use the newly-added Friend Search feature to find exactly who you're looking for.",
  "732e_patch_title": "Gameplay Update",
  "732e_patch_subtitle": "7.32E AND MORE",
  "732e_patch_turbo_title": "Turbo Mode Changes",
  "732e_patch_turbo_intro": "As Turbo Mode increases in popularity, we’d like to make sure we’re doing all we can for that group of players. Keep an eye out for more changes going forward as we continue to improve the overall game experience.",
  "732e_patch_turbo_change_notes1": "All hero selections are now blind",
  "732e_patch_turbo_change_notes2": "Removed penalty phase when picking heroes. When regular draft time ends, any person that has not selected a hero will be forced to pick whomever they have tentatively picked. In the event that hero is unavailable or there is no tentative pick, they will be given a random hero",
  "732e_patch_turbo_change_notes3": "Null Talisman, Wraith Band, and Bracer will double their bonuses at 12 minutes instead of 25 minutes",
  "732e_patch_turbo_change_notes4": "Removed bonus damage to towers from all summoned units. Non-summoned units (lane creeps, dominated creeps) are still stronger against towers compared to non-Turbo Dota",
  "732e_patch_turbo_change_notes5": "You can now earn two stars for hero challenges instead of just one",
  "732e_patch_turbo_change_notes6": "Juggernaut's Bladeform Legacy Arcana now gives full credit for Omnislash Kills",
  "732e_patch_turbo_change_notes7": "Earthshaker's Planetfall Arcana now gives full credit for Echo Slam kills and assists. Tracking for ability chains and combo damage is also enabled",
  "732e_patch_turbo_change_notes8": "Invoker Dark Artistry Throwback Immortal now gives full credit for Sun Strike Kills",
  "732e_patch_turbo_change_notes9": "Lone Druid's Cauldron of Xahryx of Eminent Revival Immortal now gives full credit for Entangling Claws duration",
  "732e_patch_turbo_change_notes10": "Kunkka's Leviathan Whale Blade of Eminent Revival Immortal now gives full credit for hitting heroes with Torrent",
  "732e_patch_turbo_change_notes11": "Storm Spirit's The Lightning Orchid of Eminent Revival Immortal now gives full credit for Ball Lightning damage",
  "732e_patch_turbo_change_notes12": "Lion's Fin King's Charm of Eminent Revival Immortal now gives full credit for hexing enemies",
  "732e_patch_turbo_change_notes13": "Leshrac's Tormented Staff of Eminent Revival Immortal now gives full credit for stunning enemies with Split Earth",
  "732e_patch_turbo_change_notes14": "Legion Commander Arcana now counts Duel Victories",
  "732e_patch_turbo_change_notes15": "Arcana progress has been updated for the following:",
  "732e_bug_fixes_title": "Bug Fixes",
  "732e_bug_fixes_notes1": "Fixed an issue where saved replays were not being correctly populated with match details. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]issue 349[/u][/url])",
  "732e_bug_fixes_notes2": "Fixed the bug where heroes would sometimes be missing their models/materials/etc. until you reconnect to the game. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]issue 6070[/u][/url])",
  "732e_bug_fixes_notes3": "Fixed a bug where occasionally Refresher Orb wouldn't go on cooldown when Refresher Shard was used ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]issue 6668[/u][/url])",
  "732e_bug_fixes_notes4": "Fixed a bug where Monkey King's Tree Dance would fail to cast at very long cast ranges ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]issue 717[/u][/url])",
  "732e_bug_fixes_notes5": "Fixed a bug where Lifestealer would miss his first Infested attack on enemies if cast at certain ranges ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]issue 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Jinada and Geminate attacks are now castable while on Break but not when Silenced. Behavior is now consistent with other similar abilities in the game. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]issue 6779[/u][/url])",
  "732e_bug_fixes_notes7": "Fixed a bug where Tusks's Snowball's particle effect would not be destroyed if the Snowball failed to launch ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]issue 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Heroes can no longer channel Fiend's Gate while inside a Snowball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]issue 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Heroes that are the caster of a Snowball are now rooted in addition to the previous status effects. This was causing some particle effect issues when certain movement abilities were cast during Snowball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]issue 6805[/u][/url])",
  "732e_bug_fixes_notes10": "Fixed a bug where KotL's Illuminate with Spirit Form heal on allies would not be amplified by KotL's healing amplification ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]issue 2176[/u][/url])",
  "732e_bug_fixes_notes11": "Fixed a bug when Primal Beast's Pulverize could occasionally cause heroes to be stuck to Primal Beast indefinitely if a hard dispel occurred during the vertical motion from another spell such as Lion's Earth Spike ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]issue 3528[/u][/url])",
  "732e_bug_fixes_notes12": "Fixed Tusk's Ice Shard and Sven's God Strength tooltips not displaying the reduced cooldown values if the appropriate talents were chosen. This is only a text change ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]issue 575[/u][/url])",
  "732e_bug_fixes_notes13": "Fixed missing cooldown indicators for charge-based abilities, including abilities that only have charges when a corresponding talent or aghanim's upgrade is taken ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]issue 315[/u][/url])",
  "732e_bug_fixes_notes14": "Fixed Spirit Vessel heal not counting towards Healing on the postgame screen ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]issue 213[/u][/url])",
  "732e_bug_fixes_notes15": "Fixed Queen of Pain's missing particle and sound effects when Scream of Pain was cast without any targets in range ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]issue 5429[/u][/url])",
  "732e_bug_fixes_notes16": "In-game roles are correctly shown for players who are disconnected at the start of the game.",
  "732e_bug_fixes_notes17": "Fixed Omniknight Heavenly Grace being disabled by break. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]issue 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Fixed a bug where Troll Warlord could override Battle Trance's forced attack commands by issuing Whirling Axed (Ranged) cast commands outside of cast range. Casting in this manner will now cast Whirling Axes (Ranged) in that direction.",
  "732e_bug_fixes_notes19": "Fixed some cases where chat messages such as disconnect and reconnect were not being shown if the player was muted.",
  "732e_bug_fixes_notes20": "Added \"in Winning Games\" to gem description for unlocking Arcana secondary styles for Queen of Pain and Faceless Void. This is only a text change; victories have always been required for Arcana progress for these two heroes.",
  "732e_bug_fixes_notes21": "Added some additional information to Glyph of Fortification's tooltip ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]issue 6786[/u][/url])",
  "732e_bug_fixes_notes22": "For abilities that can target invulnerable units and dispel certain invulnerable states (Cyclone, etc.), added ALT + tooltips to specify that they can target invulnerable units.",
  "732e_bug_fixes_notes23": "Updated tooltips for the following abilities:",
  "732e_bug_fixes_notes24": "Bane's Nightmare",
  "732e_bug_fixes_notes25": "Beastmaster's Boar Poison",
  "732e_bug_fixes_notes26": "Beastmaster's Wild Axes",
  "732e_bug_fixes_notes27": "Brewmaster's Storm Brewling's Dispel Magic",
  "732e_bug_fixes_notes28": "Broodmother's Spiderling Poison Sting",
  "732e_bug_fixes_notes29": "Lich's Ice Spire",
  "732e_bug_fixes_notes30": "Necronomicon Archer's Purge",
  "732e_bug_fixes_notes31": "Nullifier's Nullify",
  "732e_bug_fixes_notes32": "Oracle's Fortune's End",
  "732e_bug_fixes_notes33": "Satyr Trickster's Purge",
  "732e_bug_fixes_notes34": "Shadow Demon's Demonic Cleanse",
  "732e_bug_fixes_notes35": "Shadow Demon's Demonic Purge",
  "732e_bug_fixes_notes36": "Sven's Storm Hammer",
  "732e_bug_fixes_notes37": "Underlord's Pit of Malice",
  "732e_bug_fixes_notes38": "Collector's Cache 2 items are giftable after unbundling to match Collector's Cache 1's giftability",
  "732e_bug_fixes_notes39": "Talent upgrade UI is now keybindable under Advanced Key Bindings",
  "732e_bug_fixes_notes40": "Disabled the ability to join matchmaking when the -dev flag is enabled. This allowed third party tools to modify elements of the UI in abusable ways.",
  "732e_bug_fixes_notes41": "Disabled some additional ways to access someone's profile during the picking phase.",
  "732e_bug_fixes_notes42": "Clicking on enemies via the top bar during a game will show their last seen location / inventory state",
  "NoCommaStub": ""
}