// 7445.js

{
  "language": "czech",
  "muerta_title": "Aktualizace Dead Reckoning",
  "muerta_title_pre": " ",
  "muerta_title_post": "Aktualizace",
  "muerta_title_date": "6. března – 4. dubna 2023",
  "muerta_play_trailer": "Přehrát trailer",
  "new_hero_tag": "Nová hrdinka",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Hrdinka",
  "muerta_navigation_event": "Minihra",
  "muerta_navigation_janitor": "Vlastnosti",
  "muerta_navigation_gameplay": "Herní aktualizace",
  "muerta_role1": "Carry",
  "muerta_role2": "Na dálku",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "Smrt si nevybírá. Muerta je však výjimkou potvrzující pravidlo, neboť Smrt si ji vybral jako svoji pravou i levou ruku. Vyzbrojena jeho dvěma zdobenými pistolemi, nadlidsky přesnou muškou a schopností ovládat závoj mezi světy tak nyní Muerta převádí zbloudilé duše na druhou stranu, ať už chtějí, nebo ne. A když narazí na někoho obzvlášť tvrdohlavého, změní se Muerta v přízračnou noční můru a zjedná si věčný klid.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta vystřelí na nepřítele nebo na strom přízračnou kulku, která zásahem udělí poškození, nakrátko svůj cíl zpomalí a následně se odrazí určeným směrem. Po odrazu udělí kulka poškození všem nepřátelům stojícím jí v cestě a zastaví se teprve o hrdinu, kterého vystraší a donutí utíkat směrem svého letu.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Muerta přivolá ze záhrobí skupinu přízraků, které začnou kroužit kolem cílové oblasti. Nepřátelům nacházejícím se uvnitř oblasti je snížena rychlost pohybu a útoku. Pokud nepřítel navíc projde přízrakem, utrží poškození a je umlčen.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Muerta má s každým útokem šanci vystřelit na jeden další cíl. Přednost mají hrdinové.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta změní svoji podobu, stane se imunní vůči fyzickému poškození a její útoky začnou udílet magické poškození. Také získá bonus k poškození útoku a bezhmotný pohyb. V této podobě může Muerta útočit na éterické nepřátele, ale neudílí žádné poškození nepřátelům imunním vůči magii.",
  "muerta_heroes_title": "Pro detaily o Muertě",
  "muerta_heroes_btn": "Zjistit více",
  "muerta_wallpaper": "Pozadí",
  "muerta_minigame_title_pre": " ",
  "muerta_minigame_title": "Minihra",
  "muerta_minigame_subtitle": "NADEŠEL ČAS ZÚČTOVÁNÍ...",
  "muerta_minigame_subtitle2": "Muerta potřebuje pomoc dostat správná těla do správných hrobů... a Vy jste ve správný čas na správném místě! Zatímco tedy probíhá událost Zúčtování ze záhrobí, před každým zápasem Vám je přiřazen cíl k eliminaci, za jehož zabití nebo asistenci při zabití dostanete body. Ale pozor, Váš soupeř má stejný úkol, a kdo získá do konce zápasu více bodů, odnese si dvojnásobnou odměnu!",
  "muerta_minigame_rules_title": "Květiny",
  "muerta_minigame_rules_desc": "Zabíjejte nebo asistujte při zabíjení cíle a získávejte body pro Muertiny <b>květiny</b>. Plus když získáte více bodů než cíl, odnesete si více květin.",
  "muerta_minigame_rules_title2": "Truhla",
  "muerta_minigame_rules_desc2": "Směňujte své květiny za truhly <b>Dead Reckoning Chest</b> plné nových setů, a to včetně několika tematicky laděných.",
  "muerta_minigame_rules_title3": "Klíče",
  "muerta_minigame_rules_desc3": "Pro otevření truhly a odhalení jejího obsahu je vyžadován klíč <b>Dead Reckoning Key</b>, který je možné zakoupit za %1$s nebo 20 000 plusových střepů.",
  "muerta_treasure_title": "Dead Reckoning Chest",
  "muerta_treasure_content_desc": "Získávejte další květiny, abyste svoji zbrojnici rozšířili o všechny nové sety. Muerta mimochodem v rámci oslav darovala všem pět klíčů zdarma. Další už si však budete muset zakoupit za plusové střepy nebo za skutečné peníze.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "Nové vlastnosti",
  "732e_patch_dotaplus_advancedstats_title": "Pokročilé bitevní statistiky",
  "732e_patch_dotaplus_advancedstats_subtitle": "Poučte se ze své herní historie",
  "732e_patch_dotaplus_advancedstats_desc": "Exkluzivně dostupné pro členy programu Dota Plus! Ponořte se přímo ze svého profilu do kompletně přepracovaných a v reálném čase aktualizovaných statistik, které obsahují celou Vaši herní historii a je možné je třídit dle hrdiny, role, herního módu a dalších filtrů.",
  "732e_patch_dotaplus_advancedstats_desc2": "Trénujete Last Hity? Pomůže Vám skupina statistik „Creepové“. Chcete být tím nejlepším Supportem? „Podpora“ odhalí víc než správně umístěná Sentry Warda.",
  "732e_patch_quickkeys_title": "Přizpůsobení rychlého sesílání",
  "732e_patch_quickkeys_subtitle": "Extrémně detailní nastavení kláves",
  "732e_patch_quickkeys_desc": "Pokud využíváte možnosti rychlého sesílání, můžete nyní jednotlivě nastavit, které schopnosti či předměty mají být používány po stisknutí a které naopak po puštění přiřazené klávesy. Stačí přejít do „Nastavení > Ovládání“ a zaškrtnout možnosti „Rychlé sesílání“ a „Zkratky pro jednotky“.",
  "732e_patch_friendslist_title": "Vylepšení seznamu přátel",
  "732e_patch_friendslist_subtitle": "Hýčkejte si své nejlepší parťáky na hraní",
  "732e_patch_friendslist_desc": "Chcete mít stále nablízku přátele, se kterými nejčastěji bráníte Ancienta? Přidejte si je do oblíbených a nezávisle na kategorii seznamu přátel je uvidíte hezky navrchu. Ztratil se Vám někdo v seznamu? Nově je v něm také možné vyhledávat!",
  "732e_patch_title": "Herní aktualizace",
  "732e_patch_subtitle": "7.32E A VÍCE",
  "732e_patch_turbo_title": "Změny módu Turbo",
  "732e_patch_turbo_intro": "Herní mód Turbo se těší čím dál tím větší popularitě, takže jsme si ho vzali do parády a provedli pár důležitých změn. Rozhodně však ještě nejsme hotovi a další úpravy budou následovat.",
  "732e_patch_turbo_change_notes1": "Všichni hrdinové vybraní jinými hráči jsou nyní tajní (vybírání probíhá „naslepo“)",
  "732e_patch_turbo_change_notes2": "Byla odstraněna fáze penalizace při výběru hrdinů. Jakmile nově skončí standardní čas na výběr, každý, kdo si nevybral hrdinu, dostane přiřazeného hrdinu, kterého měl nakliknutého. Pokud tento hrdina není dostupný nebo hráč neměl nakliknutého žádného hrdinu, je hrdina vybrán náhodně",
  "732e_patch_turbo_change_notes3": "Předměty Null Talisman, Wraith Band a Bracer nově zdvojnásobují své bonusy ve 12. minutě (dříve 25.)",
  "732e_patch_turbo_change_notes4": "Byl odstraněn bonus k poškození věží od všech vyvolaných jednotek. Nevyvolané jednotky (obyčejní creepové, creepové pod vlivem schopnosti Dominate) jsou však proti věžím stále silnější než v ostatních módech",
  "732e_patch_turbo_change_notes5": "Úkoly pro hrdiny lze nově dokončit na dvě hvězdy namísto jedné",
  "732e_patch_turbo_change_notes6": "Arcana předmět Bladeform Legacy (Juggernaut) nově počítá zabití pomocí schopnosti Omnislash v plné výši",
  "732e_patch_turbo_change_notes7": "Arcana předmět Planetfall (Earthshaker) nově počítá zabití a asistence pomocí schopnosti Echo Slam v plné výši (také bylo povoleno sledování sérií schopností a poškození komb)",
  "732e_patch_turbo_change_notes8": "Immortal předmět Dark Artistry Throwback (Invoker) nově počítá zabití pomocí schopnosti Sun Strike v plné výši",
  "732e_patch_turbo_change_notes9": "Immortal předmět Cauldron of Xahryx of Eminent Revival (Lone Druid) nově počítá trvání schopnosti Entangling Claws v plné výši",
  "732e_patch_turbo_change_notes10": "Immortal předmět Leviathan Whale Blade of Eminent Revival (Kunkka) nově počítá zásahy hrdinů pomocí schopnosti Torrent v plné výši",
  "732e_patch_turbo_change_notes11": "Immortal předmět Lightning Orchid of Eminent Revival (Storm Spirit) nově počítá poškození schopnosti Ball Lightning v plné výši",
  "732e_patch_turbo_change_notes12": "Immortal předmět Fin King's Charm of Eminent Revival (Lion) nově počítá trvání schopnosti Hex v plné výši",
  "732e_patch_turbo_change_notes13": "Immortal předmět Tormented Staff of Eminent Revival (Leshrac) nově počítá omráčení pomocí schopnosti Split Earth v plné výši",
  "732e_patch_turbo_change_notes14": "Arcana předmět Blades of Voth Domosh (Legion Commander) nově počítá výhry schopnosti Duel v plné výši",
  "732e_patch_turbo_change_notes15": "Bylo aktualizováno počítání postupu pro následující předměty:",
  "732e_bug_fixes_title": "Opravy chyb",
  "732e_bug_fixes_notes1": "Byla opravena chyba, kvůli které uložené záznamy nedisponovaly detaily příslušných zápasů ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]problém č. 349[/u][/url])",
  "732e_bug_fixes_notes2": "Byla opravena chyba, kvůli které hrdinům občas chyběly modely/materiály/apod., dokud nedošlo k opětovnému připojení do zápasu ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]problém č. 6070[/u][/url])",
  "732e_bug_fixes_notes3": "Byla opravena chyba, kvůli které po použití předmětu Refresher Shard nemusel naskočit cooldown předmětu Refresher Orb ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]problém č. 6668[/u][/url])",
  "732e_bug_fixes_notes4": "Byla opravena chyba, kvůli které nebylo možné použít schopnost Tree Dance (Monkey King) na velmi velkou vzdálenost ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]problém č. 717[/u][/url])",
  "732e_bug_fixes_notes5": "Byla opravena chyba, kvůli které Lifestealer vybavený předmětem Aghanim's Scepter minul prvním útokem schopnosti Infest, pokud byla použita z určité vzdálenosti od nepřítele ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]problém č. 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Útoky schopností Jinada (Bounty Hunter) a Geminate Attack (Weaver) lze nyní použít, zatímco je hrdina zlomen, ale ne zatímco je umlčen. Chování je tak konzistentní s ostatními podobnými schopnostmi ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]problém č. 6779[/u][/url])",
  "732e_bug_fixes_notes7": "Byla opravena chyba, kvůli které nezmizely částicové efekty schopnosti Snowball (Tusk), když sněhová koule nebyla vypuštěna ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problém č. 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Hrdinové už nemohou vyvolávat portál schopnosti Fiend's Gate (Underlord), zatímco se nachází uvnitř sněhové koule schopnosti Snowball (Tusk) ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]problém č. 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Hrdinové vyvolávající schopnost Snowball (Tusk) jsou nyní kromě ostatních stavových efektů také zakořeněni. Když byly totiž dříve ve sněhové kouli použity určité pohybové schopnosti, mohlo dojít k problémům s částicovými efekty ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]problém č. 6805[/u][/url])",
  "732e_bug_fixes_notes10": "Byla opravena chyba, kvůli které léčení spojenců pomocí schopnosti Illuminate (Keeper of the Light s aktivní schopností Spirit Form) nebylo ovlivňováno navýšením léčení ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]problém č. 2176[/u][/url])",
  "732e_bug_fixes_notes11": "Byla opravena chyba, kvůli které mohla schopnost Pulverize (Primal Beast) vyústit v nekonečné připojení hrdiny k Primal Beastovi, pokud během svislého pohybu došlo k silnému odstranění od jiné schopnosti, např. Earth Spike (Lion) ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]problém č. 3528[/u][/url])",
  "732e_bug_fixes_notes12": "Byly opraveny popisy schopností Ice Shards (Tusk) a God's Strength (Sven), které nezobrazovaly snížené hodnoty cooldownu vlivem vybrání příslušného talentu. Toto je pouze textová oprava ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]problém č. 575[/u][/url])",
  "732e_bug_fixes_notes13": "Byly opraveny chybějící indikátory cooldownu pro schopnosti s nabitími, a to včetně schopností, kterým nabití zajišťuje talent nebo předmět Aghanim's Scepter/Shard ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]problém č. 315[/u][/url])",
  "732e_bug_fixes_notes14": "Bylo opraveno léčení předmětu Spirit Vessel, které nebylo započítáváno v pozápasových statistikách ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]problém č. 213[/u][/url])",
  "732e_bug_fixes_notes15": "Byly opraveny chybějící částicové a zvukové efekty, když byla schopnost Scream of Pain (Queen of Pain) použita bez přítomnosti cílů ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]problém č. 5429[/u][/url])",
  "732e_bug_fixes_notes16": "Nově jsou správně zobrazovány role hráčů, kteří se odpojili na začátku zápasu",
  "732e_bug_fixes_notes17": "Byla opravena schopnost Heavenly Grace (Omniknight), která mohla být přerušena zlomením ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]problém č. 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Byla opravena chyba, kvůli které mohl Troll Warlord přepsat vynucené útočení schopnosti Battle Trance, když použil schopnost Whirling Axes (na dálku) mimo její dosah. Nově je při takovém počínání tato schopnost použita daným směrem",
  "732e_bug_fixes_notes19": "Byly opraveny případy, kdy nebyly v chatu zobrazeny zprávy o odpojení a opětovném připojení (a podobné), pokud byl hráč umlčen",
  "732e_bug_fixes_notes20": "Popisy gemů pro odemčení stylů Arcana předmětů pro Queen of Pain a Faceless Voida byly rozšířeny o slova „ve vyhraných zápasech“. Toto je pouze textová oprava, výhry byly vyžadovány už dříve",
  "732e_bug_fixes_notes21": "Popis schopnosti Glyph of Fortification byl rozšířen o dodatečné informace ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]problém č. 6786[/u][/url])",
  "732e_bug_fixes_notes22": "Schopnosti, které mohou zacílit nezranitelné jednotky a odstranit určité stavy nezranitelnosti (např. Cyclone apod.), byly doplněny o související informační text (když je při najetí na popis přidržena klávesa Alt)",
  "732e_bug_fixes_notes23": "Byly aktualizovány popisy následujících schopností:",
  "732e_bug_fixes_notes24": "Nightmare (Bane)",
  "732e_bug_fixes_notes25": "Poison (Beastmaster – Boar)",
  "732e_bug_fixes_notes26": "Wild Axes (Beastmaster)",
  "732e_bug_fixes_notes27": "Dispel Magic (Brewmaster – Storm)",
  "732e_bug_fixes_notes28": "Poison Sting (Broodmother – Spiderling)",
  "732e_bug_fixes_notes29": "Ice Spire (Lich)",
  "732e_bug_fixes_notes30": "Purge (Necronomicon Archer)",
  "732e_bug_fixes_notes31": "Nullify (předmět Nullifier)",
  "732e_bug_fixes_notes32": "Fortune's End (Oracle)",
  "732e_bug_fixes_notes33": "Purge (Satyr Banisher)",
  "732e_bug_fixes_notes34": "Demonic Cleanse (Shadow Demon)",
  "732e_bug_fixes_notes35": "Demonic Purge (Shadow Demon)",
  "732e_bug_fixes_notes36": "Storm Hammer (Sven)",
  "732e_bug_fixes_notes37": "Pit of Malice (Underlord)",
  "732e_bug_fixes_notes38": "Předměty z truhly Collector's Cache II lze nyní po rozbalení darovat (stejně jako předměty z truhly Collector's Cache)",
  "732e_bug_fixes_notes39": "Do „Nastavení > Ovládání > Pokročilé klávesové zkratky“ byla přidána možnost změnit zkratky pro vylepšování talentů",
  "732e_bug_fixes_notes40": "Bylo zakázáno vyhledávání oficiálních zápasů, zatímco je povolena značka „-dev“ (nástroje třetích stran díky ní mohly neférově měnit prvky rozhraní)",
  "732e_bug_fixes_notes41": "Bylo zamezeno několika dalším způsobům, jak se při výběru hrdinů dostat na profil jiného hráče",
  "732e_bug_fixes_notes42": "Když je při zápase ve vrchní liště kliknuto na nepřítele, je nově ukázána poslední pozice, na které byl spatřen + stav inventáře v daném čase"
}