// 6484.js

{
  "language": "thai",
  "muerta_title": "อัปเดตพิพากษ์มรณะ",
  "muerta_title_pre": " ",
  "muerta_title_post": "อัปเดต",
  "muerta_title_date": "6 มีนาคม 2023 - 4 เมษายน 2023",
  "muerta_play_trailer": "เล่นตัวอย่าง",
  "new_hero_tag": "ฮีโร่ใหม่",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "ฮีโร่",
  "muerta_navigation_event": "มินิเกม",
  "muerta_navigation_janitor": "คุณสมบัติ",
  "muerta_navigation_gameplay": "อัปเดตเกมเพลย์",
  "muerta_role1": "ตัวแคร์รี",
  "muerta_role2": "ระยะไกล",
  "muerta_role3": "ตัวนูค",
  "muerta_role4": "ตัวหยุด",
  "muerta_intro": "ด้วยกระสุนแฉลบอันน่าสะพรึง ดวงวิญญาณอัญเชิญของเธอ และปืนรองให้เหลือใช้ พรสวรรค์ของ Muerta ในการปลิดชีพนั้นน่าทึ่งขนาดยมทูตเองต้องให้เธอมาช่วยเหลือ Muerta ใช้พลังแห่งปืนพกควงคู่พร้อมความแค้นแสนมรณะ นำส่งดวงวิญญาณสู่แดนสนธยาโดยไม่สนว่าวิญญาณเหล่านั้นอยากข้ามพิภพหรือไม่ก็ตาม และถ้าหากเหยื่อเธอยังไม่เชื่อใจเต็มที่ เธอก็พร้อมเผยโฉมที่แท้จริงให้เห็นถึงร่างภูตอาฆาตสุดสยอง เผื่อจะช่วยให้เหยื่อตายเร็วขึ้นอีกนิด",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta ยิงกระสุนวิญญาณไปที่ต้นไม้หรือยูนิตศัตรู เมื่อกระสุนปะทะจะสร้างความเสียหายและลดความเร็วครู่หนึ่ง จากนั้นพุ่งกระดอนในทิศทางเป้าหมายที่กำหนด กระสุนที่พุ่งกระดอนจะสร้างความเสียหายต่อทุกยูนิตที่ทะลุผ่าน โดยจะหยุดเมื่อพุ่งชนฮีโร่ ฮีโร่ที่โดนกระสุนพุ่งกระดอนใส่จะวิ่งไปในทิศทางเดียวกับการยิง",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "อัญเชิญกลุ่มวิญญาณซึ่งจะวนรอบตำแหน่งเป้าหมายอย่างช้า ๆ ศัตรูในพื้นที่ดังกล่าวจะมีความเร็วในการเคลื่อนที่และโจมตีลดลง วิญญาณจะสร้างความเสียหายและใบ้ศัตรูที่เคลื่อนผ่าน",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "การโจมตีของ Muerta มีโอกาสยิงกระสุนนัดที่ 2 ไปยังเป้าหมายอีกตัวหนึ่ง หากมีฮีโร่อยู่จะเลือกยิงฮีโร่ก่อน",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta แปลงร่างของเธอ ทำให้เป็นอมตะต่อความเสียหายกายภาพ พลังโจมตีของเธอทั้งหมดจะสร้างเป็นความเสียหายเวทมนตร์ Muerta มีพลังโจมตีเพิ่มขึ้นและเคลื่อนที่ทะลุผ่านยูนิตได้ อีกทั้ง Muerta สามารถโจมตียูนิตในร่าง Ethereal แต่ไม่สามารถสร้างความเสียหายแก่เป้าหมายที่ป้องกันเวทโดยสมบูรณ์",
  "muerta_heroes_title": "สำหรับสถิติโดยละเอียดเกี่ยวกับ Muerta",
  "muerta_heroes_btn": "ดูหน้ารายละเอียดฮีโร่",
  "muerta_wallpaper": "วอลล์เปเปอร์",
  "muerta_minigame_title_pre": " ",
  "muerta_minigame_title": "มินิเกม",
  "muerta_minigame_subtitle": "เริ่มก่อนได้เปรียบ…",
  "muerta_minigame_subtitle2": "Muerta ต้องการความช่วยเหลือเพื่อนำศพร่างอุ่น ๆ ลงหลุมฝังใหม่ให้เหมาะเหม็ง... และก็ถึงเวลาคุณยื่นมือเข้ามาช่วยสงเคราะห์! ในระหว่างกิจกรรมพิพากษ์มรณะ คุณจะทราบเป้าหมายที่กำหนดก่อนเริ่ม Dota แต่ละเกม ทำคะแนนด้วยการสังหารและช่วยเหลือ แต่ระวังให้ดี ศัตรูของคุณย่อมออกไล่ล่าคุณด้วยเช่นกัน และใครก็ตามที่ทำคะแนนได้มากกว่าก็จะได้รับรางวัล 2 เท่า!",
  "muerta_minigame_rules_title": "ดอกไม้",
  "muerta_minigame_rules_desc": "สังหารหรือช่วยสังหารเป้าหมายที่กำหนดเพื่อทำคะแนนและรับ<b>ดอกไม้</b>ของ Muerta ทำคะแนนให้ได้มากกว่าเป้าหมายดังกล่าวเพื่อเพิ่มพูนรางวัลของคุณ",
  "muerta_minigame_rules_title2": "หีบสมบัติ",
  "muerta_minigame_rules_desc2": "แลกดอกไม้ของคุณเป็น<b>สมบัติพิพากษ์มรณะ</b> ซึ่งบรรจุเต็มไปด้วยชุดเซ็ตไอเท็มใหม่ทั้งหมด พร้อมกับไอเท็มธีมกิจกรรม",
  "muerta_minigame_rules_title3": "กุญแจ",
  "muerta_minigame_rules_desc3": "ซื้อ<b>กุญแจพิพากษ์มรณะ</b>เพื่อปลดล็อคหีบสมบัติและเปิดเผยรางวัลข้างใน สั่งซื้อกุญแจได้ในร้านค้าเศษมณีด้วยสนนราคา %1$s หรือ 20,000 เศษมณี",
  "muerta_treasure_title": "สมบัติพิพากษ์มรณะ",
  "muerta_treasure_content_desc": "ทำคะแนนดอกไม้ให้มากเข้าไว้เพื่อรับโอกาสปลดล็อคชุดเซ็ตไอเท็มธีมพิพากษ์มรณะ ซึ่ง Muerta ได้มอบกุญแจ 5 ดอกให้กับทุกคนเพื่อเริ่มการเฉลิมฉลอง คว้ากุญแจเพิ่มอีกตามต้องการโดยใช้เศษมณีหรือร้านค้า Dota",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "คุณสมบัติใหม่",
  "732e_patch_dotaplus_advancedstats_title": "สถิติการต่อสู้ขั้นสูง",
  "732e_patch_dotaplus_advancedstats_subtitle": "ดำดิ่งสู่ข้อมูลประวัติ Dota ของคุณ",
  "732e_patch_dotaplus_advancedstats_desc": "วิเคราะห์และยกระดับเกมของคุณด้วยสถิติการต่อสู้ขั้นสูงในหน้าโปรไฟล์ของคุณโดยตรง ต่อจากนี้สมาชิก Dota Plus จะสามารถเข้าถึงข้อมูลวิเคราะห์เกมเพลย์แบบเรียลไทม์ซึ่งได้รับการปรับปรุงยกโฉมใหม่ทั้งหมด เจาะลึกรูปแบบการเล่นของคุณโดยการจัดเรียงประวัติ Dota ทั้งหมดของคุณตามฮีโร่ ตำแหน่ง โหมดเกม และอีกมากมาย",
  "732e_patch_dotaplus_advancedstats_desc2": "มุ่งมั่นกับการ Last Hit ใช่หรือไม่? สถิติจำนวนครีปของคุณมีบอกข้อมูลให้หมด ต้องการพัฒนาทักษะการซัพพอร์ตหรือเปล่า? สถิติการซัพพอร์ตต่อจากนี้จะเปิดเผยข้อมูลให้แจ่มแจ้งยิ่งกว่า Sentry Ward",
  "732e_patch_quickkeys_title": "การร่ายทันทีแบบปรับแต่งได้",
  "732e_patch_quickkeys_subtitle": "ควบคุมอย่างละเอียดยิบได้ด้วยปลายนิ้วคุณ",
  "732e_patch_quickkeys_desc": "ผู้ใช้งานการร่ายทันทีต่อจากนี้สามารถเลือกตั้งค่าสกิลเฉพาะยูนิตและไอเท็มแต่ละอย่างได้แล้วว่าให้ทำงานเมื่อกดปุ่มลงหรือปล่อยปุ่มขึ้น ลองเข้าไปดูได้โดยการเลือก 'ปุ่มลัดแยกเฉพาะยูนิต' และ 'เปิดการใช้งานการร่ายทันที' สำหรับสกิลและไอเท็มในแท็บ 'ปุ่มลัด' ของเมนูการตั้งค่า",
  "732e_patch_friendslist_title": "ปรับปรุงรายชื่อเพื่อน",
  "732e_patch_friendslist_subtitle": "มอบพลังความรักแก่เพื่อน Dota คนสนิทของคุณให้สมกับที่คู่ควร",
  "732e_patch_friendslist_desc": "ด้วยคุณสมบัติเพื่อนโปรด ตอนนี้คุณจะสามารถติดแท็กคนที่เล่นด้วยบ่อยที่สุดเพื่อเก็บไว้ให้อยู่ด้านบนสุดของรายชื่อเพื่อนของคุณ จัดเรียงรายการเพื่อนตามลำดับคนโปรด, คนที่เล่น Dota, ออนไลน์ และออฟไลน์ หรือจะใช้คุณสมบัติค้นหาเพื่อนใหม่ล่าสุดสำหรับตามล่าหาคนที่คุณต้องการก็ได้เช่นกัน",
  "732e_patch_title": "อัปเดตเกมเพลย์",
  "732e_patch_subtitle": "7.32E และอีกมากมาย",
  "732e_patch_turbo_title": "การเปลี่ยนแปลงโหมด Turbo",
  "732e_patch_turbo_intro": "เมื่อโหมด Turbo ได้รับความนิยมเพิ่มขึ้น เราอยากทำให้มั่นใจว่าเราได้ทำทุกอย่างเพื่อเอื้ออำนวยสำหรับผู้เล่นกลุ่มนี้ คอยติดตามการเปลี่ยนแปลงเพิ่มเติมในอนาคตขณะที่เราดำเนินการพัฒนาประสบการณ์เกมโดยรวมต่อไป",
  "732e_patch_turbo_change_notes1": "การเลือกฮีโร่ทั้งหมดต่อจากนี้จะมองไม่เห็นโดยฝ่ายตรงข้าม",
  "732e_patch_turbo_change_notes2": "นำช่วงหักโกลด์ขณะเลือกฮีโร่ออก เมื่อเวลาดราฟต์ปกติสิ้นสุดลง ใครก็ตามที่ยังไม่ได้เลือกฮีโร่จะถูกบังคับให้เลือกฮีโร่ที่คลิกไฮไลต์ไว้ กรณีที่ฮีโร่ดังกล่าวไม่สามารถเลือกได้หรือไม่มีฮีโร่ไฮไลต์ไว้ ผู้เล่นนั้นจะได้ฮีโร่สุ่มแทน",
  "732e_patch_turbo_change_notes3": "Null Talisman, Wraith Band และ Bracer จะเพิ่มค่าสถานะเป็น 2 เท่าเมื่อถึง 12 นาที จากเดิม 25 นาที",
  "732e_patch_turbo_change_notes4": "นำความเสียหายเพิ่มเติมต่อป้อมจากยูนิตอัญเชิญทั้งหมดออก ยูนิตที่ไม่ได้มาจากการอัญเชิญ (ครีปเลน, ครีปที่ถูกควบคุม) ยังคงสร้างความเสียหายต่อป้อมมากกว่าเมื่อเทียบกับ Dota นอกโหมด Turbo",
  "732e_patch_turbo_change_notes5": "ต่อจากนี้คุณสามารถทำการท้าทายฮีโร่ได้ถึง 2 ดาวจากเดิมแค่ 1 ดาว",
  "732e_patch_turbo_change_notes6": "Arcana Bladeform Legacy ของ Juggernaut ต่อจากนี้จะนับแต้มการสังหารด้วย Omnislash เต็มจำนวน",
  "732e_patch_turbo_change_notes7": "Arcana Planetfall ของ Earthshaker ต่อจากนี้จะนับแต้มการสังหารและช่วยสังหารด้วย Echo Slam เต็มจำนวน และยังเปิดใช้งานการนับสกิลโดนศัตรูต่อเนื่องและคอมโบความเสียหาย",
  "732e_patch_turbo_change_notes8": "Immortal Dark Artistry Throwback ของ Invoker ต่อจากนี้จะนับแต้มการสังหารด้วย Sun Strike เต็มจำนวน",
  "732e_patch_turbo_change_notes9": "Immortal Cauldron of Xahryx of Eminent Revival ของ Lone Druid ต่อจากนี้จะนับแต้มระยะเวลา Entangling Claws เต็มจำนวน",
  "732e_patch_turbo_change_notes10": "Immortal Leviathan Whale Blade of Eminent Revival ของ Kunkka ต่อจากนี้จะนับแต้มฮีโร่ที่โดน Torrent เต็มจำนวน",
  "732e_patch_turbo_change_notes11": "Immortal The Lightning Orchid of Eminent Revival ของ Storm Spirit ต่อจากนี้จะนับแต้มความเสียหาย Ball Lightning เต็มจำนวน",
  "732e_patch_turbo_change_notes12": "Immortal Fin King's Charm of Eminent Revival ของ Lion ต่อจากนี้จะนับแต้ม Hex ศัตรูเต็มจำนวน",
  "732e_patch_turbo_change_notes13": "Immortal Tormented Staff of Eminent Revival ของ Leshrac ต่อจากนี้จะนับแต้มสตันศัตรูด้วย Split Earth เต็มจำนวน",
  "732e_patch_turbo_change_notes14": "Arcana ของ Legion Commander ต่อจากนี้จะนับจำนวนชัยชนะการดวลศึก",
  "732e_patch_turbo_change_notes15": "ความคืบหน้าของ Arcana ได้รับการอัปเดตดังต่อไปนี้:",
  "732e_bug_fixes_title": "การแก้ไขข้อบกพร่อง",
  "732e_bug_fixes_notes1": "แก้ไขปัญหารีเพลย์ที่บันทึกไว้ไม่แสดงข้อมูลรายละเอียดแมตช์อย่างถูกต้อง ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]ปัญหา 349[/u][/url])",
  "732e_bug_fixes_notes2": "แก้ไขข้อบกพร่องที่ฮีโร่บางครั้งมีโมเดล/วัสดุ/อื่น ๆ หายไปจนกว่าคุณจะเชื่อมต่อเข้าเกมอีกครั้ง ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]ปัญหา 6070[/u][/url])",
  "732e_bug_fixes_notes3": "แก้ไขข้อบกพร่องที่บางครั้ง Refresher Orb จะไม่ติดคูลดาวน์เมื่อใช้ Refresher Shard ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]ปัญหา 6668[/u][/url])",
  "732e_bug_fixes_notes4": "แก้ไขข้อบกพร่องที่ Tree Dance ของ Monkey King จะไม่สามารถร่ายได้หากร่ายด้วยระยะไกลมาก ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]ปัญหา 717[/u][/url])",
  "732e_bug_fixes_notes5": "แก้ไขข้อบกพร่องที่ Infest ของ Lifestealer จะพลาดการโจมตีครั้งแรกต่อยูนิตที่เข้าสิงหากร่ายจากบางระยะ ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]ปัญหา 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Jinada และ Geminate Attack ต่อจากนี้จะสามารถร่ายได้หากถูกปิดสกิลติดตัว และไม่สามารถร่ายได้หากถูกใบ้ พฤติกรรมดังกล่าวต่อจากนี้จะสอดคล้องกับสกิลอื่นที่ใกล้เคียงในเกม ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]ปัญหา 6779[/u][/url])",
  "732e_bug_fixes_notes7": "แก้ไขข้อบกพร่องที่เอฟเฟกต์อนุภาค Snowball ของ Tusk จะไม่ถูกทำลายหาก Snowball ไม่สามารถปล่อยออกมาได้ ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]ปัญหา 6805[/u][/url])",
  "732e_bug_fixes_notes8": "ฮีโร่ไม่สามารถยืนร่าย Fiend's Gate ขณะอยู่ใน Snowball ได้อีกต่อไป ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]ปัญหา 6670[/u][/url])",
  "732e_bug_fixes_notes9": "ฮีโร่ที่ร่าย Snowball ต่อจากนี้จะติดรากเพิ่มจากเอฟเฟกต์สถานะอื่นที่มีอยู่ เนื่องจากก่อนหน้านี้ก่อให้เกิดปัญหาเอฟเฟกต์อนุภาคเมื่อใช้สกิลเคลื่อนที่บางอย่างในระหว่าง Snowball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]ปัญหา 6805[/u][/url])",
  "732e_bug_fixes_notes10": "แก้ไขข้อบกพร่อง Illuminate ของ Keeper of the Light ในร่าง Spirit Form ที่การรักษาเพื่อนร่วมทีมจะไม่เพิ่มมากขึ้นตามอัตราเพิ่มการรักษาพลังชีวิตของ Keeper of the Light ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]ปัญหา 2176[/u][/url])",
  "732e_bug_fixes_notes11": "แก้ไขข้อบกพร่องที่ Pulverize ของ Primal Beast ในบางครั้งสามารถทำให้ฮีโร่ติดไปกับ Primal Beast อย่างถาวรหากเกิดการลบล้างขั้นสูงระหว่างเคลื่อนที่แนวตั้งจากสกิลอื่น เช่น Earth Spike ของ Lion ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]ปัญหา 3528[/u][/url])",
  "732e_bug_fixes_notes12": "แก้ไขคำอธิบาย Ice Shards ของ Tusk และ God's Strength ของ Sven ไม่แสดงค่าคูลดาวน์ลดลงหากเลือกทักษะพิเศษที่ลดคูลดาวน์ การเปลี่ยนแปลงนี้ส่งผลต่อตัวเลขที่แสดงเท่านั้น ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]ปัญหา 575[/u][/url])",
  "732e_bug_fixes_notes13": "แก้ไขตัวบอกคูลดาวน์หายไปสำหรับสกิลที่เป็นชาร์จ ซึ่งรวมถึงสกิลที่ได้ชาร์จเมื่อเลือกทักษะพิเศษหรืออัปเกรดด้วย Aghanim เท่านั้น ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]ปัญหา 315[/u][/url])",
  "732e_bug_fixes_notes14": "แก้ไขการรักษาด้วย Spirit Vessel ไม่นับรวมในจำนวนการรักษาบนหน้าหลังจบเกม ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]ปัญหา 213[/u][/url])",
  "732e_bug_fixes_notes15": "แก้ไขเอฟเฟกต์อนุภาคและเสียงที่หายไปของ Queen of Pain เมื่อร่าย Scream of Pain โดยไม่มีเป้าหมายอยู่ในระยะ ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]ปัญหา 5429[/u][/url])",
  "732e_bug_fixes_notes16": "ตำแหน่งในเกมจะแสดงอย่างถูกต้องสำหรับผู้เล่นที่ตัดการเชื่อมต่อขณะเริ่มเกม",
  "732e_bug_fixes_notes17": "แก้ไข Heavenly Grace ของ Omniknight ถูกปิดการทำงานโดยการปิดสกิลติดตัว ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]ปัญหา 1649[/u][/url])",
  "732e_bug_fixes_notes18": "แก้ไขข้อบกพร่องที่ Troll Warlord สามารถออกคำสั่งทับการบังคับโจมตีของ Battle Trance โดยการออกคำสั่งร่าย Whirling Axed (Ranged) นอกระยะร่าย การร่ายในลักษณะดังกล่าวต่อไปนี้จะร่าย Whirling Axes (Ranged) ในทิศทางนั้นแทน",
  "732e_bug_fixes_notes19": "แก้ไขบางกรณีที่ข้อความแช็ต เช่น การตัดการเชื่อมต่อและการเชื่อมต่ออีกครั้ง จะไม่แสดงหากผู้เล่นถูกปิดการสื่อสาร",
  "732e_bug_fixes_notes20": "เพิ่มคำอธิบายอัญมณี \"ในเกมที่ชนะ\" สำหรับการปลดล็อครูปแบบที่ 2 ของ Arcana สำหรับ Queen of Pain และ Faceless Void การเปลี่ยนแปลงนี้ส่งผลต่อข้อความที่แสดงเท่านั้น ก่อนหน้านี้จำเป็นต้องชนะเกมอยู่แล้วเพื่อสร้างความคืบหน้า Arcana สำหรับฮีโร่ทั้ง 2 นี้",
  "732e_bug_fixes_notes21": "เพิ่มข้อมูลเพิ่มเติมสำหรับคำอธิบาย Glyph of Fortification ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]ปัญหา 6786[/u][/url])",
  "732e_bug_fixes_notes22": "สำหรับสกิลที่สามารถเลือกเป้าหมายยูนิตที่เป็นอมตะและลบล้างสถานะอมตะบางอย่าง (เช่น Cyclone) จะเพิ่มคำอธิบายเมื่อกด ALT ค้างเพื่อระบุว่าสามารถเลือกเป้าหมายยูนิตในสถานะอมตะได้",
  "732e_bug_fixes_notes23": "อัปเดตคำอธิบายสำหรับสกิลต่อไปนี้:",
  "732e_bug_fixes_notes24": "Nightmare ของ Bane",
  "732e_bug_fixes_notes25": "Poison ของหมูป่า Beastmaster",
  "732e_bug_fixes_notes26": "Wild Axes ของ Beastmaster",
  "732e_bug_fixes_notes27": "Dispel Magic ของ Brewling ร่างลมของ Brewmaster",
  "732e_bug_fixes_notes28": "Poison Sting ของลูกแมงมุม Broodmother",
  "732e_bug_fixes_notes29": "Ice Spire ของ Lich",
  "732e_bug_fixes_notes30": "Purge ของ Necronomicon Archer",
  "732e_bug_fixes_notes31": "Nullify ของ Nullifier",
  "732e_bug_fixes_notes32": "Fortune's End ของ Oracle",
  "732e_bug_fixes_notes33": "Purge ของ Satyr Trickster",
  "732e_bug_fixes_notes34": "Demonic Cleanse ของ Shadow Demon",
  "732e_bug_fixes_notes35": "Demonic Purge ของ Shadow Demon",
  "732e_bug_fixes_notes36": "Storm Hammer ของ Sven",
  "732e_bug_fixes_notes37": "Pit of Malice ของ Underlord",
  "732e_bug_fixes_notes38": "ไอเท็ม Collector's Cache 2 สามารถมอบเป็นของขวัญได้หลังจากแกะชุดรวมเพื่อให้ตรงกับเงื่อนไขการมอบของขวัญสำหรับ Collector's Cache 1",
  "732e_bug_fixes_notes39": "UI อัปเกรดทักษะพิเศษต่อจากนี้จะสามารถกำหนดปุ่มได้แล้วในตัวเลือกปุ่มลัดขั้นสูง",
  "732e_bug_fixes_notes40": "ปิดไม่ให้เข้าร่วมค้นหาแมตช์หากกำลังเปิดใช้งานคำสั่ง -dev ซึ่งก่อนหน้านี้ทำให้เครื่องมือภายนอกสามารถปรับเปลี่ยนบางส่วนของ UI ในวิธีที่ไม่เหมาะสม",
  "732e_bug_fixes_notes41": "ปิดการใช้งานวิธีอื่นเพิ่มเติมสำหรับเข้าถึงโปรไฟล์ผู้เล่นในช่วงเลือกฮีโร่",
  "732e_bug_fixes_notes42": "เมื่อคลิกที่ฮีโร่ในแถบด้านบนระหว่างเกมต่อจากนี้จะแสดงตำแหน่งและสถานะช่องเก็บของสุดท้ายที่เห็น"
}