// 1506.js

{
  "language": "bulgarian",
  "muerta_title": "Обновлението „Мъртвешка разплата“",
  "muerta_title_pre": " ",
  "muerta_title_post": "Обновлението",
  "muerta_title_date": "06 март 2023 — 04 април 2023",
  "muerta_play_trailer": "Пускане на трейлъра",
  "new_hero_tag": "Нов герой",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "Герой",
  "muerta_navigation_event": "Миниигра",
  "muerta_navigation_janitor": "Характеристики",
  "muerta_navigation_gameplay": "Игрално обновление",
  "muerta_role1": "Carry",
  "muerta_role2": "Далекобойна",
  "muerta_role3": "Nuker",
  "muerta_role4": "Disabler",
  "muerta_intro": "Със страховитите ѝ невероятни изстрели, призовани духове и резервно оръжие, похватността на Muerta да отнема животи била толкова впечатляваща, че самата Смърт я наела на платена позиция. Задвижван от два пистолета инструмент за отмъщение с убийствен прицел, Muerta подбира своенравни души към отвъдното, независимо дали те искат да стигнат до там или не. А в случай че се нуждаят от още убеждаване, тя е готова да разкрие същинската си форма като убийствен призрачен кошмар, ако това би им помогнало да умрат малко по-бързо.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Muerta изстрелва призрачен рикоширащ изстрел към вражеска единица или дърво. При попадението куршумът нанася щети и забавя за кратко, след което рикошира в целевата посока. Рикошетът нанася щети на всички единици, през които премине, спирайки, когато удари герой. Ударените от рикошета герои ще побегнат в посоката на изстрела.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Призовава група привидения, които бавно наобикалят целевото местонахождение. Враговете в площта са забавени и скоростта им на атака е намалена. Привиденията нанасят щети и заглушават враговете, докато преминават през тях.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Атаките на Muerta разполагат с шанс да изстрелят втори изстрел към друга цел, приоритизирайки герои.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Muerta се преобразува, придобивайки имунитет към физически щети. Всичките ѝ щети на атака се нанасят като магически такива. Muerta придобива бонус щети на атака и сфазирано движение. Muerta може да атакува ефирни единици, но не нанася щети на цели с магически имунитет.",
  "muerta_heroes_title": "За подробни статистики относно Muerta",
  "muerta_heroes_btn": "Преглед на страницата с подробности за героя",
  "muerta_wallpaper": "Тапети",
  "muerta_minigame_title_pre": " ",
  "muerta_minigame_title": "Миниигра",
  "muerta_minigame_subtitle": "БЪРЗИТЕ И МЪРТВИТЕ…",
  "muerta_minigame_subtitle2": "Muerta се нуждае от помощ при сдобиването с подходящите свежи тела в правилните пресни гробове… Ето къде се намесвате Вие! Преди всяка Dota 2 игра по време на събитието Dead Reckoning ще Ви бъде възлагана цел. Отбелязвайте точки за убийства и асистенции. Но внимавайте — Вашият опонент също е настървен да лее кръвта Ви, а който отбележи повече точки, получава двойна награда!",
  "muerta_minigame_rules_title": "Цветя",
  "muerta_minigame_rules_desc": "Правете убийства и асистенции срещу възложената Ви цел, за да отбелязвате точки и да спечелите <b>цветята</b> на Muerta. Отбележете повече точки от целта си, за да увеличите това, което сте си набавили.",
  "muerta_minigame_rules_title2": "Съкровище",
  "muerta_minigame_rules_desc2": "Разменяйте своите цветя за <b>Dead Reckoning сандъци</b>, заредени със съвсем нови набори и включващи тематични за събитието артикули.",
  "muerta_minigame_rules_title3": "Ключове",
  "muerta_minigame_rules_desc3": "Купете <b>Dead Reckoning ключ</b>, за да отключите сандъка и да разкриете наградата в него. Ключовете са достъпни за %1$s или 20 000 къса в „Магазина за късове“.",
  "muerta_treasure_title": "Dead Reckoning сандък",
  "muerta_treasure_content_desc": "Спечелете повече цветя за екстра шансове да отключвате тези тематични Dead Reckoning набори с артикули. Muerta е връчила на всекиго по пет ключа, за да започне празненството. Докопайте се толкова много, колкото са Ви нужни, използвайки късове или Dota 2 магазина.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "Нови характеристики",
  "732e_patch_dotaplus_advancedstats_title": "Разширени бойни статистики",
  "732e_patch_dotaplus_advancedstats_subtitle": "Задълбочете се в данните от Вашата Dota 2 история",
  "732e_patch_dotaplus_advancedstats_desc": "Възвишете и оценете играта си с разширените бойни статистики директно от профила Ви. Dota Plus членовете вече разполагат с достъп до напълно преработен анализ на игралното преживяване в реално време. Задълбочете се в своя игрален стил, като сортирате пълната си Dota 2 история по герой, роля, игрален режим и още други.",
  "732e_patch_dotaplus_advancedstats_desc2": "Фокусирате се над последни удари? Групата Ви със статистики за крийпове ще се погрижи за това. Подобрявате уменията си като поддържащи играчи? Статистиките за Support вече разкриват повече от Sentry Ward.",
  "732e_patch_quickkeys_title": "Персонализирано бързо изпълняване",
  "732e_patch_quickkeys_subtitle": "По-фин контрол на върха на пръстите Ви",
  "732e_patch_quickkeys_desc": "Потребителите, използващи бързо изпълняване, вече могат индивидуално да възлагат кои специфични за единица умения и предмети да се задействат, използвайки натискане или освобождаване на клавиш. Изпробвайте го, като изберете „Специфични бързи клавиши за единици“ и „Включване на бързо изпълняване“ за умения и предмети в раздела „Бързи клавиши“ от менюто „Настройки“.",
  "732e_patch_friendslist_title": "Подобрения на списъка с приятели",
  "732e_patch_friendslist_subtitle": "Отдайте на най-добрите си Dota 2 приятели отношението, което заслужават",
  "732e_patch_friendslist_desc": "Чрез характеристиката „Любими“ вече можете да маркирате хората, с които играете най-много, за да ги държите в най-горната част на своя списък с приятели. Сортирайте приятелите си по ред от „Любими“, „Играещи Dota 2“, „На линия“ и „Извън линия“. Или използвайте нововъведената характеристика за „Търсене на приятели“, така че да намерите точно когото търсите.",
  "732e_patch_title": "Игрално обновление",
  "732e_patch_subtitle": "7.32E И ОЩЕ",
  "732e_patch_turbo_title": "Промени на Turbo режима",
  "732e_patch_turbo_intro": "С нарастващата популярността на Turbo режима бихме искали да се уверим, че правим всичко възможно за тази група играчи. Хвърляйте око за още промени в бъдеще, докато продължаваме да подобряваме цялостното игрално преживяване.",
  "732e_patch_turbo_change_notes1": "Всички избори на герои вече стават без информация за това какво подбират останалите потребители.",
  "732e_patch_turbo_change_notes2": "Премахната е наказателната фаза при избиране на герои. Когато редовното време за подбор приключи, всеки човек, който не е избрал герой, ще бъде принуден да вземе онзи, който временно е подбрал. В случай че този герой е недостъпен или няма временен избор, на играча ще бъде даден произволен герой.",
  "732e_patch_turbo_change_notes3": "Null Talisman, Wraith Band и Bracer ще удвояват своите бонуси при 12 вместо 25 минути.",
  "732e_patch_turbo_change_notes4": "Премахнати са бонус щетите към кулите от всички призовани единици. Тези, които не са призовани (крийпове в алеите, доминирани крийпове), все още са по-силни срещу кули в сравнение с Dota 2 режими, различни от Turbo.",
  "732e_patch_turbo_change_notes5": "Вече можете да спечелите две звезди за героични предизвикателства вместо само една.",
  "732e_patch_turbo_change_notes6": "Juggernaut: Bladeform Legacy Arcana — вече дава пълни заслуги за Omnislash убийства.",
  "732e_patch_turbo_change_notes7": "Earthshaker: Planetfall Arcana — вече дава пълни заслуги за Echo Slam убийства и асистенции. Проследяването за вериги от умения и комбинирани щети също е включено.",
  "732e_patch_turbo_change_notes8": "Invoker: Dark Artistry Throwback Immortal — вече дава пълни заслуги за Sun Strike убийства.",
  "732e_patch_turbo_change_notes9": "Lone Druid: Cauldron of Xahryx of Eminent Revival Immortal — вече дава пълни заслуги за Entangling Claws времетраенето.",
  "732e_patch_turbo_change_notes10": "Kunkka: Leviathan Whale Blade of Eminent Revival Immortal — вече дава пълни заслуги за удряне на герои с Torrent.",
  "732e_patch_turbo_change_notes11": "Storm Spirit: The Lightning Orchid of Eminent Revival Immortal — вече дава пълни заслуги за щети от Ball Lightning.",
  "732e_patch_turbo_change_notes12": "Lion: Fin King's Charm of Eminent Revival Immortal — вече дава пълни заслуги за изпълнен Hex върху врагове.",
  "732e_patch_turbo_change_notes13": "Leshrac: Tormented Staff of Eminent Revival Immortal — вече дава пълни заслуги за зашеметяване на врагове с Split Earth.",
  "732e_patch_turbo_change_notes14": "Legion Commander: Blades of Voth Domosh Arcana — вече отчита победите от Duel.",
  "732e_patch_turbo_change_notes15": "Arcana напредъкът е обновен за следните:",
  "732e_bug_fixes_title": "Поправки на грешки",
  "732e_bug_fixes_notes1": "Поправен е проблем, при който запазените повторения не се попълваха правилно с подробностите за мача ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]проблем 349[/u][/url]).",
  "732e_bug_fixes_notes2": "Поправена е грешка, при която моделите, материалите и т.н. на героите понякога липсваха, докато не се свържете повторно към играта ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]проблем 6070[/u][/url]).",
  "732e_bug_fixes_notes3": "Поправена е грешка, при която Refresher Orb периодично не влизаше във време за изчакване, когато се използва Refresher Shard ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]проблем 6668[/u][/url]).",
  "732e_bug_fixes_notes4": "Поправен е грешка, при която Tree Dance на Monkey King не успяваше да се изпълни при много дълги обсеги ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]проблем 717[/u][/url]).",
  "732e_bug_fixes_notes5": "Поправена е грешка, при която Lifestealer пропускаше първата си Infested атака върху врагове, ако бъде изпълнена на определени обсеги ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]проблем 6801[/u][/url]).",
  "732e_bug_fixes_notes6": "Атаките на Jinada и Geminate вече могат да се изпълняват, докато са пречупени, но не и когато са заглушени. Поведението вече е в съответствие с други подобни умения в играта ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]проблем 6779[/u][/url]).",
  "732e_bug_fixes_notes7": "Поправена е грешка, при която ефектът на частиците за Snowball на Tusk не биваше унищожен, ако Snowball не е успяла да се изстреля ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]проблем 6805[/u][/url]).",
  "732e_bug_fixes_notes8": "Героите вече не могат да изпълняват Fiend's Gate, докато са в Snowball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]проблем 6670[/u][/url]).",
  "732e_bug_fixes_notes9": "Героите, които са изпълнители на Snowball, вече са вкоренени в допълнение към предходните статус ефекти. Това причиняваше известни проблеми с ефекти на частици, когато определени умения за движение биваха изпълнявани по време на Snowball ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]проблем 6805[/u][/url]).",
  "732e_bug_fixes_notes10": "Поправена е грешка, при която Spirit Form лечението от Illuminate на KotL върху съюзници не се усилваше от усилването на лечението на KotL ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]проблем 2176[/u][/url]).",
  "732e_bug_fixes_notes11": "Поправена е грешка, при която Pulverize на Primal Beast можеше периодично да причини героите да бъдат заклещени към Primal Beast за неопределено време, ако е настъпило силно разсейване по време на вертикалното движение от друго заклинание, като например Earth Spike на Lion ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]проблем 3528[/u][/url]).",
  "732e_bug_fixes_notes12": "Поправено е, че поясненията за Ice Shards на Tusk и God's Strength на Sven не изобразяваха намалените стойности на времето за изчакване, ако подходящите таланти са избрани. Тази промяна засяга само текста ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]проблем 575[/u][/url]).",
  "732e_bug_fixes_notes13": "Поправени са липсващи индикатори за времето за изчакване на умения, базирани на заряди. Това включва умения, които имат заряди само когато е взето подобрение на съответния талант или Aghanim's Scepter ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]проблем 315[/u][/url]).",
  "732e_bug_fixes_notes14": "Поправено е, че лечението от Spirit Vessel не се отчиташе към секцията „Лечение“ на екрана след игра ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]проблем 213[/u][/url]).",
  "732e_bug_fixes_notes15": "Поправени са липсващите частици и звукови ефекти на Queen of Pain, когато Scream of Pain е изпълнено без никакви цели в обсега ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]проблем 5429[/u][/url]).",
  "732e_bug_fixes_notes16": "Игралните роли вече се показват правилно за потребители, които са се разкачили при старта на играта.",
  "732e_bug_fixes_notes17": "Поправено е, че Heavenly Grace на Omniknight биваше преустановявано чрез пречупване ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]проблем 1649[/u][/url]).",
  "732e_bug_fixes_notes18": "Поправена е грешка, при която Troll Warlord можеше да отмени командите за принудителна атака от Battle Trance. Това ставаше, като издаде команди за изпълняване на Whirling Axes (далекобойни) извън обсега им. Подобно изпълнение вече ще запраща Whirling Axes (далекобойни) в тази посока.",
  "732e_bug_fixes_notes19": "Поправени са някои случаи, при които чат съобщения, като например тези за разкачване и повторно свързване, не се показваха, ако играчът е бил заглушен.",
  "732e_bug_fixes_notes20": "Добавено е „в победни игри“ към описанието на скъпоценния камък за отключване на второстепенни стилове на Arcana за Queen of Pain и Faceless Void. Тази промяна засяга само текста. Победите винаги са били изисквани за постигане на напредъка за Arcana на тези двама герои.",
  "732e_bug_fixes_notes21": "Добавена е известна допълнителна информация към пояснението на Glyph of Fortification ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]проблем 6786[/u][/url]).",
  "732e_bug_fixes_notes22": "Добавени са пояснения чрез ALT + кликване за умения, които могат да се прицелват към неуязвими единици и да разсейват определени неуязвими състояния (Cyclone и т.н.). Това цели да уточни, че тези умения могат да се прицелват към неуязвими единици.",
  "732e_bug_fixes_notes23": "Обновени са поясненията за следните умения:",
  "732e_bug_fixes_notes24": "Bane — Nightmare",
  "732e_bug_fixes_notes25": "Beastmaster: Boar — Poison",
  "732e_bug_fixes_notes26": "Beastmaster — Wild Axes",
  "732e_bug_fixes_notes27": "Brewmaster: Storm Brewling — Dispel Magic",
  "732e_bug_fixes_notes28": "Broodmother: Spiderling — Poison Sting",
  "732e_bug_fixes_notes29": "Lich — Ice Spire",
  "732e_bug_fixes_notes30": "Necronomicon Archer — Purge",
  "732e_bug_fixes_notes31": "Nullifier — Nullify",
  "732e_bug_fixes_notes32": "Oracle — Fortune's End",
  "732e_bug_fixes_notes33": "Satyr Banisher — Purge",
  "732e_bug_fixes_notes34": "Shadow Demon — Demonic Cleanse",
  "732e_bug_fixes_notes35": "Shadow Demon — Demonic Purge",
  "732e_bug_fixes_notes36": "Sven — Storm Hammer",
  "732e_bug_fixes_notes37": "Underlord — Pit of Malice",
  "732e_bug_fixes_notes38": "Артикулите от Collector's Cache II са подаряеми след разопаковане, за да съответстват на подаряемостта на Collector's Cache I.",
  "732e_bug_fixes_notes39": "Потребителският интерфейс за подобряване на талантите вече може да бъде възложен към клавишна комбинация под „Разширени клавишни комбинации“.",
  "732e_bug_fixes_notes40": "Преустановена е способността за присъединяване към търсенето на мачове, когато е включен флагът „-dev“. Това позволяваше на инструменти от трети страни да модифицират елементи от потребителския интерфейс по злоупотребяващи начини.",
  "732e_bug_fixes_notes41": "Преустановени са някои допълнителни начини за достъп до нечий профил по време на фазата за подбора.",
  "732e_bug_fixes_notes42": "Кликването върху врагове чрез горната лента по време на игра ще покаже тяхното последно видяно местонахождение/състояние на инвентара."
}