// 5064.js

{
  "language": "greek",
  "muerta_title": "Η Ενημέρωση Dead Reckoning",
  "muerta_title_pre": "Η ΕΝΗΜΕΡΩΣΗ:",
  "muerta_title_post": " ",
  "muerta_title_date": "6 ΜΑΡΤΙΟΥ 2023 – 4 ΑΠΡΙΛΙΟΥ 2023",
  "muerta_play_trailer": "ΑΝΑΠΑΡΑΓΩΓΗ ΤΡΕΪΛΕΡ",
  "new_hero_tag": "ΝΕΑ ΗΡΩΙΔΑ",
  "muerta_name": "Muerta",
  "muerta_navigation_intro": "ΗΡΩΙΔΑ",
  "muerta_navigation_event": "ΜΙΝΙ ΠΑΙΧΝΙΔΙ",
  "muerta_navigation_janitor": "ΧΑΡΑΚΤΗΡΙΣΤΙΚΑ",
  "muerta_navigation_gameplay": "ΕΝΗΜΕΡΩΣΗ ΠΑΙΧΝΙΔΙΟΥ",
  "muerta_role1": "ΚΟΥΒΑΛΗΤΡΙΑ",
  "muerta_role2": "ΤΗΛΕΜΑΧΗ",
  "muerta_role3": "ΕΞΟΛΟΘΡΕΥΤΡΙΑ",
  "muerta_role4": "ΚΑΤΑΣΤΟΛΕΑΣ",
  "muerta_intro": "Με τις τρομακτικές βολές της, την ικανότητά της για κλήτευση πνευμάτων και το εφεδρικό της πιστόλι, το ταλέντο της Muerta στην αφαίρεση ζωών είναι τόσο εντυπωσιακό που την προσέλαβε ο Χάρος ο ίδιος. Η Muerta, μια μηχανή εκδίκησης με δυο πιστόλια και νεκρό βλέμμα, οδηγεί δύστροπες ψυχές προς τον κάτω κόσμο, είτε το θέλουν είτε όχι. Εάν πρέπει να χρησιμοποιήσει λίγη παραπάνω πειθώ, είναι έτοιμη να αποκαλύψει την πραγματική της μορφή ως φονικός εφιάλτης-φάντασμα για να τις βοηθήσει να πεθάνουν λίγο γρηγορότερα.",
  "muerta_ability1_title": "Dead Shot",
  "muerta_ability1_desc": "Η Muerta εκτοξεύει μια αντανακλαστική βολή-φάντασμα προς μια εχθρική μονάδα ή ένα δέντρο. Όταν χτυπήσει η σφαίρα, προκαλεί ζημιά και σύντομη επιβράδυνση και έπειτα εξοστρακίζεται στην κατεύθυνση του στόχου. Η εξοστράκιση προκαλεί ζημιά σε όλες τις μονάδες που διαπερνά και σταματά όταν πλήξει έναν ήρωα. Οι ήρωες που πλήττονται από την εξοστράκιση θα τρέξουν προς την κατεύθυνση της βολής.",
  "muerta_ability2_title": "The Calling",
  "muerta_ability2_desc": "Κλητεύει μια ομάδα αναστημένων, που περικυκλώνουν αργά τη στοχευμένη τοποθεσία. Οι εχθροί εντός της περιοχής αποκτούν μειωμένη ταχύτητα κίνησης και επίθεσης. Οι αναστημένοι προκαλούν ζημιά και σιγή στους εχθρούς τους οποίους διαπερνούν.",
  "muerta_ability3_title": "Gunslinger",
  "muerta_ability3_desc": "Οι επιθέσεις της Muerta έχουν την πιθανότητα πρόκλησης δεύτερης βολής σε κάποιον άλλον στόχο, με προτεραιότητα σε ήρωες.",
  "muerta_ability4_title": "Pierce the Veil",
  "muerta_ability4_desc": "Η Muerta μεταμορφώνεται και γίνεται απρόσβλητη από φυσική ζημιά. Όλη η ζημιά επίθεσής της προκαλείται ως μαγική ζημιά. Αποκτά επιπλέον ζημιά επίθεσης και διαπεραστική κίνηση. Μπορεί να επιτεθεί σε αιθέριες μονάδες, αλλά δεν προκαλεί ζημιά σε στόχους με μαγική απροσβλητότητα.",
  "muerta_heroes_title": "ΓΙΑ ΛΕΠΤΟΜΕΡΗ ΣΤΑΤΙΣΤΙΚΑ ΣΧΕΤΙΚΑ ΜΕ ΤΗ MUERTA",
  "muerta_heroes_btn": "ΠΡΟΒΟΛΗ ΣΕΛΙΔΑΣ ΛΕΠΤΟΜΕΡΕΙΩΝ ΗΡΩΙΔΑΣ",
  "muerta_wallpaper": "ΕΙΚΟΝΕΣ ΦΟΝΤΟΥ",
  "muerta_minigame_title_pre": "ΤΟ",
  "muerta_minigame_title": "ΜΙΝΙ ΠΑΙΧΝΙΔΙ",
  "muerta_minigame_subtitle": "ΓΡΗΓΟΡΟΙ ΚΑΙ ΘΑΝΑΣΙΜΟΙ…",
  "muerta_minigame_subtitle2": "Η Muerta χρειάζεται βοήθεια για να βάλει τα σωστά ζεστά πτώματα στους σωστούς φρέσκους τάφους... και εδώ μπαίνετε εσείς! Θα σας ανατίθεται ένας στόχος σε κάθε παιχνίδι Dota κατά τη διάρκεια του συμβάντος Dead Reckoning. Κερδίστε πόντους για σκοτωμούς και βοήθειες. Αλλά προσέξτε! Ο αντίπαλός σας θέλει επίσης να πάρει το αίμα σας πίσω και όποιος κερδίσει τους περισσότερους πόντους λαμβάνει τη διπλάσια ανταμοιβή!",
  "muerta_minigame_rules_title": "ΛΟΥΛΟΥΔΙΑ",
  "muerta_minigame_rules_desc": "Κατορθώστε σκοτωμούς και βοήθειες εναντίον του στόχου που σας έχει ανατεθεί, για να κερδίσετε πόντους και να αποκτήσετε τα <b>Λουλούδια</b> της Muerta. Αν κερδίσετε περισσότερους πόντους από τον στόχο σας, θα αυξήσετε τα κέρδη σας.",
  "muerta_minigame_rules_title2": "ΘΗΣΑΥΡΟΣ",
  "muerta_minigame_rules_desc2": "Ανταλλάξτε τα Λουλούδια σας με <b>Σεντούκια Dead Reckoning</b>, που διαθέτουν ολοκαίνουρια σετ αντικειμένων και αντικείμενα με θέμα το συμβάν.",
  "muerta_minigame_rules_title3": "ΚΛΕΙΔΙΑ",
  "muerta_minigame_rules_desc3": "Αγοράστε ένα <b>Κλειδί Dead Reckoning</b> για να ξεκλειδώσετε το σεντούκι και να αποκαλύψετε την ανταμοιβή που βρίσκεται μέσα. Τα κλειδιά είναι διαθέσιμα με %1$s ή 20.000 Πετράδια στο Μαγαζί Πετραδιών.",
  "muerta_treasure_title": "ΣΕΝΤΟΥΚΙ DEAD RECKONING",
  "muerta_treasure_content_desc": "Κερδίστε περισσότερα Λουλούδια για περισσότερες πιθανότητες να ξεκλειδώσετε αυτά τα σετ αντικειμένων με θέμα το Dead Reckoning. Η Muerta έδωσε πέντε κλειδιά σε όλους για να ξεκινήσουν οι εορτασμοί. Τσεπώστε όσα περισσότερα χρειάζεστε, χρησιμοποιώντας πετράδια ή το Κατάστημα Dota.",
  "muerta_minigame_treasure_name1": "Spectral Hunter",
  "muerta_minigame_treasure_name2": "Dying Light",
  "muerta_minigame_treasure_name3": "Altar Ball",
  "muerta_minigame_treasure_name4": "Dead Heat",
  "muerta_minigame_treasure_name5": "Death Adder",
  "muerta_minigame_treasure_name6": "Doll of the Dead",
  "muerta_minigame_treasure_name7": "Expired Gun",
  "muerta_minigame_treasure_name8": "Soul Serpent",
  "janitors_corner_title": "ΝΕΑ ΧΑΡΑΚΤΗΡΙΣΤΙΚΑ",
  "732e_patch_dotaplus_advancedstats_title": "ΣΥΝΘΕΤΑ ΣΤΑΤΙΣΤΙΚΑ ΜΑΧΗΣ",
  "732e_patch_dotaplus_advancedstats_subtitle": "Αναλύστε εκτενώς τα δεδομένα του ιστορικού σας στο Dota",
  "732e_patch_dotaplus_advancedstats_desc": "Αναβαθμίστε και αξιολογήστε το παιχνίδι σας με σύνθετα στατιστικά μάχης απευθείας στο προφίλ σας. Τα μέλη του Dota Plus έχουν πλέον πρόσβαση σε πλήρως ανανεωμένα αναλυτικά στοιχεία παιχνιδιού σε πραγματικό χρόνο. Αναλύστε το στιλ παιχνιδιού σας ταξινομώντας ολόκληρο το ιστορικό σας στο Dota ανά ήρωα, ρόλο, τύπο παιχνιδιού και πολλά άλλα.",
  "732e_patch_dotaplus_advancedstats_desc2": "Επικεντρώνεστε στις τελικές επιθέσεις; Τα στατιστικά σας για τα κριπάκια θα σώσουν την κατάσταση. Βελτιώνετε τις ικανότητες σας στην υποστήριξη; Τα στατιστικά υποστήριξης πλέον αποκαλύπτουν περισσότερα από ένα Sentry Ward.",
  "732e_patch_quickkeys_title": "ΠΡΟΣΑΡΜΟΣΙΜΗ ΓΡΗΓΟΡΗ ΕΚΤΕΛΕΣΗ",
  "732e_patch_quickkeys_subtitle": "Πιο ακριβής έλεγχος στην άκρη των δακτύλων σας",
  "732e_patch_quickkeys_desc": "Όσοι χρησιμοποιούν γρήγορη εκτέλεση μπορούν τώρα να ορίζουν ποια αντικείμενα και ποιες ικανότητες ενεργοποιούνται ανά συγκεκριμένη μονάδα, χρησιμοποιώντας πάτημα ή απελευθέρωση κουμπιού. Δοκιμάστε το επιλέγοντας «Πλήκτρα ανά μονάδα» και «Ενεργοποίηση γρήγορης εκτέλεσης» για ικανότητες και αντικείμενα στην καρτέλα πλήκτρων του μενού ρυθμίσεων.",
  "732e_patch_friendslist_title": "ΒΕΛΤΙΩΣΕΙΣ ΛΙΣΤΑΣ ΦΙΛΩΝ",
  "732e_patch_friendslist_subtitle": "Φερθείτε στους καλύτερους φίλους σας όπως τους αξίζει",
  "732e_patch_friendslist_desc": "Με τη λειτουργία «Αγαπημένοι», μπορείτε τώρα να επισημάνετε τα άτομα με τα οποία παίζετε περισσότερο, ώστε να μείνουν στην κορυφή της λίστας φίλων σας. Η λίστα φίλων σας ταξινομείται ως εξής: Αγαπημένοι, Παίζουν Dota, Σε σύνδεση και Εκτός σύνδεσης. Ή χρησιμοποιήστε τη νέα λειτουργία αναζήτησης φίλων για να βρείτε ακριβώς το άτομο που ψάχνετε.",
  "732e_patch_title": "ΕΝΗΜΕΡΩΣΗ ΠΑΙΧΝΙΔΙΟΥ",
  "732e_patch_subtitle": "7.32E ΚΑΙ ΠΟΛΛΑ ΑΛΛΑ",
  "732e_patch_turbo_title": "ΑΛΛΑΓΕΣ ΣΤΟΝ ΤΥΠΟ ΠΑΙΧΝΙΔΙΟΥ TURBO",
  "732e_patch_turbo_intro": "Καθώς ο τύπος παιχνιδιού Turbo γίνεται όλο και πιο δημοφιλής, φροντίζουμε να κάνουμε το καλύτερο δυνατό για όσους τον επιλέγουν. Έχετε το νου σας για περισσότερες αλλαγές μελλοντικά, καθώς συνεχίζουμε να βελτιώνουμε τη συνολική εμπειρία παιχνιδιού.",
  "732e_patch_turbo_change_notes1": "Όλες οι επιλογές ηρώων είναι τώρα κρυφές.",
  "732e_patch_turbo_change_notes2": "Αφαιρέθηκε η φάση ποινής κατά την επιλογή ηρώων. Όταν λήξει ο κανονικός χρόνος επιλογής, οποιοσδήποτε παίκτης δεν έχει επιλέξει κάποιον ήρωα θα αναγκάζεται να παίρνει τον ήρωα που είχε επιλέξει προσωρινά. Στην περίπτωση που εκείνος ο ήρωας δεν είναι διαθέσιμος ή δεν υπάρχει προσωρινή επιλογή, θα δίνεται στον παίκτη κάποιος τυχαίος ήρωας.",
  "732e_patch_turbo_change_notes3": "Οι επαυξήσεις των Null Talisman, Wraith Band και Bracer διπλασιάζονται στα 12 λεπτά, αντί για τα 25 λεπτά.",
  "732e_patch_turbo_change_notes4": "Αφαιρέθηκε η επιπλέον ζημιά σε πύργους από όλες τις κλητευμένες μονάδες. Οι μη κλητευμένες μονάδες (κριπάκια μετώπου, κυριαρχημένα κριπάκια) εξακολουθούν να είναι ισχυρότερες εναντίον πύργων σε σχέση με άλλους τύπους παιχνιδιού Dota, διαφορετικούς από το Turbo.",
  "732e_patch_turbo_change_notes5": "Μπορείτε τώρα να κερδίσετε δύο αστέρια για προκλήσεις ηρώων αντί για μόνο ένα.",
  "732e_patch_turbo_change_notes6": "Το Arcana «Bladeform Legacy» του Juggernaut τώρα προσμετρά πλήρως σκοτωμούς Omnislash.",
  "732e_patch_turbo_change_notes7": "Το Arcana «Planetfall» του Earthshaker τώρα προσμετρά πλήρως σκοτωμούς και βοήθειες Echo Slam. Έχει επίσης ενεργοποιηθεί η καταγραφή των συνδυασμών ικανοτήτων και της συνδυαστικής ζημιάς.",
  "732e_patch_turbo_change_notes8": "Το Immortal «Dark Artistry Throwback» του Invoker τώρα προσμετρά πλήρως σκοτωμούς Sun Strike.",
  "732e_patch_turbo_change_notes9": "Το Immortal «Cauldron of Xahryx of Eminent Revival» του Lone Druid τώρα προσμετρά πλήρως τη διάρκεια του Entangling Claws.",
  "732e_patch_turbo_change_notes10": "Το Immortal «Leviathan Whale Blade of Eminent Revival» του Kunkka τώρα προσμετρά πλήρως χτυπήματα ηρώων με Torrent.",
  "732e_patch_turbo_change_notes11": "Το Immortal «The Lightning Orchid of Eminent Revival» του Storm Spirit τώρα προσμετρά πλήρως τη ζημιά Ball Lightning.",
  "732e_patch_turbo_change_notes12": "Το Immortal «Fin King's Charm of Eminent Revival» του Lion τώρα προσμετρά πλήρως τη διάρκεια του Hex σε εχθρούς.",
  "732e_patch_turbo_change_notes13": "Το Immortal «Tormented Staff of Eminent Revival» του Leshrac τώρα προσμετρά πλήρως τα σαστίσματα εχθρών με Split Earth.",
  "732e_patch_turbo_change_notes14": "Το Arcana της Legion Commander τώρα προσμετρά τις νίκες σε μονομαχίες.",
  "732e_patch_turbo_change_notes15": "Η πρόοδος Arcana ενημερώθηκε για τα ακόλουθα:",
  "732e_bug_fixes_title": "ΔΙΟΡΘΩΣΕΙΣ ΣΦΑΛΜΑΤΩΝ",
  "732e_bug_fixes_notes1": "Διορθώθηκε πρόβλημα όπου οι λεπτομέρειες των αγώνων δεν συμπληρώνονταν σωστά στις αποθηκευμένες επαναλήψεις. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/349][u]πρόβλημα 349[/u][/url])",
  "732e_bug_fixes_notes2": "Διορθώθηκε σφάλμα όπου έλειπαν περιστασιακά τα μοντέλα/υλικά/κτλ. των ηρώων, μέχρι την επανασύνδεση στο παιχνίδι. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6070][u]πρόβλημα 6070[/u][/url])",
  "732e_bug_fixes_notes3": "Διορθώθηκε σφάλμα όπου το Refresher Orb δεν έμπαινε περιστασιακά σε επαναφόρτιση, μετά από χρήση του Refresher Shard. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6668][u]πρόβλημα 6668[/u][/url])",
  "732e_bug_fixes_notes4": "Διορθώθηκε σφάλμα αποτυχίας εκτέλεσης του Tree Dance του Monkey King, όταν το βεληνεκές εκτέλεσης ήταν πολύ μεγάλο. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/717][u]πρόβλημα 717[/u][/url])",
  "732e_bug_fixes_notes5": "Διορθώθηκε σφάλμα αστοχίας της πρώτης επίθεσης του Lifestealer υπό Infest, αν η εκτέλεση γινόταν σε συγκεκριμένες εμβέλειες ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6801][u]πρόβλημα 6801[/u][/url])",
  "732e_bug_fixes_notes6": "Πλέον είναι δυνατή η εκτέλεση των Jinada και Geminate Attack υπό Θραύση, αλλά όχι υπό Σιγή. Η συμπεριφορά είναι τώρα συνεπής με παρόμοιες ικανότητες εντός παιχνιδιού. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6779][u]πρόβλημα 6779[/u][/url])",
  "732e_bug_fixes_notes7": "Διορθώθηκε σφάλμα όπου τα εφέ σωματιδίων της χιονόμπαλας του Tusk δεν καταστρέφονταν, αν αποτύγχανε η εκτόξευση της χιονόμπαλας. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]πρόβλημα 6805[/u][/url])",
  "732e_bug_fixes_notes8": "Δεν είναι πλέον δυνατή η διοχέτευση του Fiend's Gate από ήρωες εντός μιας χιονόμπαλας. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6670][u]πρόβλημα 6670[/u][/url])",
  "732e_bug_fixes_notes9": "Οι ήρωες που εκτελούν Snowball πλέον ακινητοποιούνται, σε συνδυασμό με τις προηγούμενες επιδράσεις κατάστασης. Αυτό προκαλούσε μερικά προβλήματα εφέ σωματιδίων όταν εκτελούνταν ορισμένες ικανότητες κίνησης κατά τη διάρκεια της χιονόμπαλας. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6805][u]πρόβλημα 6805[/u][/url])",
  "732e_bug_fixes_notes10": "Διορθώθηκε σφάλμα όπου δεν εφαρμοζόταν η ενίσχυση θεραπείας του Keeper of the Light κατά τη θεραπεία συμμάχων από το Illuminate υπό Spirit Form. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/2176][u]πρόβλημα 2176[/u][/url])",
  "732e_bug_fixes_notes11": "Διορθώθηκε σφάλμα όπου το Pulverize του Primal Beast μπορούσε περιστασιακά να κάνει ήρωες να κολλάνε επ' αόριστον στο Primal Beast, αν είχε εφαρμοστεί μια ισχυρή κατάλυση κατά τη διάρκεια της κάθετης κίνησης από ένα άλλο ξόρκι, όπως το Earth Spike του Lion. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/3528][u]πρόβλημα 3528[/u][/url])",
  "732e_bug_fixes_notes12": "Διορθώθηκε πρόβλημα όπου δεν εμφανίζονταν οι μειωμένες τιμές επαναφόρτισης στα παράθυρα επεξήγησης για το Ice Shard του Tusk και το God's Strength του Sven, αν είχαν επιλεχθεί τα κατάλληλα ταλέντα. Πρόκειται απλά για αλλαγή κειμένου. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/575][u]πρόβλημα 575[/u][/url])",
  "732e_bug_fixes_notes13": "Διορθώθηκαν οι ενδείξεις επαναφόρτισης που έλειπαν για ικανότητες με φορτίσεις, συμπεριλαμβανομένων ικανοτήτων που έχουν φορτίσεις μόνο όταν αποκτιέται ένα αντίστοιχο ταλέντο ή μια αναβάθμιση Aghanim's. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/315][u]πρόβλημα 315[/u][/url])",
  "732e_bug_fixes_notes14": "Διορθώθηκε η μη προσμέτρηση της θεραπείας του Spirit Vessel στα στατιστικά θεραπείας στην οθόνη στατιστικών της λήξης παιχνιδιού. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/213][u]πρόβλημα 213[/u][/url])",
  "732e_bug_fixes_notes15": "Διορθώθηκαν τα εφέ σωματιδίων και τα ηχητικά εφέ της Queen of Pain που έλειπαν, όταν εκτελούταν το Scream of Pain χωρίς κανέναν στόχο εντός βεληνεκούς. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/5429][u]πρόβλημα 5429[/u][/url])",
  "732e_bug_fixes_notes16": "Οι ρόλοι εντός παιχνιδιού εμφανίζονται πλέον σωστά για παίκτες που αποσυνδέονται στην αρχή του παιχνιδιού.",
  "732e_bug_fixes_notes17": "Διορθώθηκε η δυνατότητα κατάλυσης του Heavenly Grace του Omniknight από Θραύση. ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/1649][u]πρόβλημα 1649[/u][/url])",
  "732e_bug_fixes_notes18": "Διορθώθηκε σφάλμα όπου ο Troll Warlord μπορούσε να παρακάμψει τις εντολές επιβεβλημένης επίθεσης του Battle Trance, δίνοντας εντολές για εκτέλεση του Whirling Axed (Τηλέμαχα) εκτός βεληνεκούς εκτέλεσης. Η εκτέλεση με αυτόν τον τρόπο θα εκτελέσει πλέον το Whirling Axes (Τηλέμαχα) σε εκείνη την κατεύθυνση.",
  "732e_bug_fixes_notes19": "Διορθώθηκαν μερικές περιπτώσεις όπου μηνύματα συνομιλίας, όπως αποσύνδεση και επανασύνδεση, δεν εμφανίζονταν αν ο παίκτης ήταν σε σίγαση.",
  "732e_bug_fixes_notes20": "Προστέθηκε το «σε νικητήρια παιχνίδια» στην περιγραφή πετραδιού για ξεκλείδωμα των δευτερευόντων στιλ των Arcana για την Queen of Pain και τον Faceless Void. Πρόκειται απλά για αλλαγή κειμένου, ανέκαθεν απαιτούνταν νίκες για την πρόοδο Arcana αυτών των δύο ηρώων.",
  "732e_bug_fixes_notes21": "Προστέθηκαν μερικές επιπλέον πληροφορίες στο παράθυρο επεξήγησης της Οχύρωσης ([url=https://github.com/ValveSoftware/Dota2-Gameplay/issues/6786][u]πρόβλημα 6786[/u][/url])",
  "732e_bug_fixes_notes22": "Για ικανότητες που μπορούν να στοχεύσουν άτρωτες μονάδες και να καταλύσουν ορισμένες καταστάσεις ατρωσίας (Κυκλώνας, κτλ.), προστέθηκαν παράθυρα επεξήγησης κρατώντας πατημένο το ALT, για να προσδιορίζεται ότι μπορούν να στοχεύσουν μονάδες με ατρωσία.",
  "732e_bug_fixes_notes23": "Ενημερώθηκαν τα παράθυρα επεξήγησης για τις ακόλουθες ικανότητες:",
  "732e_bug_fixes_notes24": "Το Nightmare του Bane",
  "732e_bug_fixes_notes25": "Το Poison του κάπρου του Beastmaster",
  "732e_bug_fixes_notes26": "Το Wild Axes του Beastmaster",
  "732e_bug_fixes_notes27": "Το Dispel Magic του Πολεμιστή Καταιγίδας του Brewmaster ",
  "732e_bug_fixes_notes28": "Το Poison Sting των αραχνιδίων της Broodmother",
  "732e_bug_fixes_notes29": "Το Ice Spire του Lich",
  "732e_bug_fixes_notes30": "Το Purge του Τοξότη του Necronomicon",
  "732e_bug_fixes_notes31": "Η Εκμηδένιση του Nullifier",
  "732e_bug_fixes_notes32": "Το Fortune's End του Oracle",
  "732e_bug_fixes_notes33": "Το Purge του Satyr Banisher",
  "732e_bug_fixes_notes34": "Το Demonic Cleanse του Shadow Demon",
  "732e_bug_fixes_notes35": "Το Demonic Purge του Shadow Demon",
  "732e_bug_fixes_notes36": "Το Storm Hammer του Sven",
  "732e_bug_fixes_notes37": "Το Pit of Malice του Underlord",
  "732e_bug_fixes_notes38": "Μπορείτε πλέον να χαρίσετε αντικείμενα Collector's Cache 2 αφού τα ξεπακετάρετε, παρόμοια με τα αντικείμενα από το Collector's Cache 1.",
  "732e_bug_fixes_notes39": "Είναι πλέον δυνατή η δέσμευση πλήκτρων για τη διεπαφή αναβάθμισης ταλέντων στα «Προχωρημένα πλήκτρα».",
  "732e_bug_fixes_notes40": "Απενεργοποιήθηκε η δυνατότητα χρήσης της εύρεσης παιχνιδιού όταν η σημαία -dev είναι ενεργοποιημένη. Επέτρεπε σε εργαλεία τρίτων να τροποποιούν στοιχεία της διεπαφής με καταχρηστικούς τρόπους.",
  "732e_bug_fixes_notes41": "Απενεργοποιήθηκαν μερικοί επιπλέον τρόποι πρόσβασης στο προφίλ κάποιου κατά τη διάρκεια της φάσης επιλογής.",
  "732e_bug_fixes_notes42": "Τώρα, με κλικ στο εικονίδιο των εχθρών στην πάνω μπάρα κατά τη διάρκεια ενός παιχνιδιού, θα εμφανίζεται η τελευταία γνωστή τους τοποθεσία και η κατάσταση λίστας αντικειμένων."
}