// 3668.js

{
  "language": "vietnamese",
  "new_frontiers_gameplay_number": "Cập nhật lối chơi 7.33",
  "new_frontiers_title": "Bản cập nhật 'Chiến tuyến mới'",
  "new_frontiers_title_short": "Chiến tuyến mới",
  "new_frontiers_subtitle": "Bản đồ mới, nhiều thay đổi lớn về lối chơi, và vô số điều khác. Thế giới hoàn toàn mới chờ bạn khám phá.",
  "new_frontiers_play_trailer": "Xem trailer",
  "new_frontiers_dota_team_intro": "Bản cập nhật 'Chiến tuyến mới' ra mắt bản đồ mới, thay đổi lớn về lối chơi, hệ thống xếp trận, giao diện người dùng, và — không đùa nha — còn nhiều hơn thế.<br><br>Nhiều đến mức nào á? Đến mức chẳng thể nhớ hết, chúng tôi cảm thấy hoảng loạn trong vài ngày, cho đến khi ai đó nhớ ra là chỉ việc ghi chép lại tất cả. Nên chúng tôi đã làm vậy. Giờ chúng tôi có thể đọc bất cứ khi nào mình muốn. Và bạn cũng vậy! Cứ cuộn chuột và đọc tiếp nha.",
  "new_frontiers_eldor_name": "Pháp sư Eldor",
  "new_frontiers_dota_team_name": "Đội ngũ Dota",
  "new_frontiers_section_title_map": "Bản đồ mới",
  "new_frontiers_section_title_major_gameplay": "Thay đổi lớn về lối chơi",
  "new_frontiers_section_title_matchmaking": "Hệ thống tìm trận",
  "new_frontiers_section_title_ui": "Giao diện",
  "new_frontiers_section_title_gameplay_update": "Thay đổi cân bằng",
  "new_frontiers_map_introduction": "Bản đồ Dota đã được mở rộng đáng kể. Mục tiêu chính của trò chơi không đổi — các làn đường không hề dời xa hơn, và mọi điều bạn cần để thắng vẫn nằm tại trung tâm màn chơi.<br><br>Nhưng với địa hình dàn rộng ra 40%, giờ dư dật không gian để đánh chiếm tài nguyên và khám phá chiến thuật mới mẻ. Cả hai khu rừng chính nay được tinh chỉnh lại hoàn toàn, thay đổi nơi cắm mắt, đường juke, cày cuốc và nhiều nữa.",
  "new_frontiers_map_subtitle": "Khám phá thế giới mới",
  "new_frontiers_map_roshan_title": "Tân gia tổ ấm Roshan",
  "new_frontiers_map_roshan_desc": "Roshan bán hố cũ ven sông và tận dụng những lợi thế trên bất động sản mới tậu. Giờ ngài đây có tới [i]hai[/i] hố mới tại góc tây bắc và đông nam của bản đồ. Đây chính là thiên đường của những người yêu hố, sang chảnh với chút xíu cảnh nhìn ra hồ máu và chỉ cách vài phút tới cửa hàng ẩn.<br><br>Mấy hố này chắc cũng gần phòng tập thể hình đây, vì Roshan giờ trở nên đô con hơn bao giờ hết. Roshan không còn rơi Aghanim's Shards nữa, và giờ sẽ tặng phô mai cho lần chết thứ hai thay vì ba. Lần chết thứ ba sẽ rơi Refresher Shard hoặc Scepter, tùy theo ngài đây đang ở hố Bắc hay Nam.",
  "new_frontiers_map_twin_gates_title": "Cổng đôi",
  "new_frontiers_map_twin_gates_desc": "Hai cánh cổng nay kết nối hai góc bản đồ ở gần trụ của đường dễ, cho phép người chơi tức thì dịch chuyển từ góc này đến góc kia của bản đồ.<br><br>Đây là một điều chỉnh về lối chơi, nhưng lại ẩn chứa một thay đổi lớn về cốt truyện. Bạn đoán đúng rồi đấy: Dota 2 giờ nằm trong PMEU (Vũ trụ Pac-Man mở rộng) một cách không chính thức.",
  "new_frontiers_map_lotus_pools_title": "Hồ sen",
  "new_frontiers_map_lotus_pools_desc": "Người chơi giờ có thể tìm thấy mấy cái Hồ Sen tại phía bên trái và phải của bản đồ (gần nơi hai làn quái gặp nhau). Ở đó định kỳ sản sinh hoa quả, mà khi ăn, sẽ cho mana và máu.<br><br>Người chơi có thể tích lũy loại quả này, rồi kết hợp để tạo thành loại lớn và giá trị cao hơn đến cuối trận. Quả lớn này thậm chí có thể kết hợp để [i]cực kỳ[/i] lớn hơn nữa. Vậy chuyện gì xảy ra nếu bạn kết hợp quả [i]cực kỳ[/i] lớn này? Chắc không có gì đâu nhỉ. (Ắt hẳn là có gì đó.)",
  "new_frontiers_map_tormentors_title": "Khổ hình",
  "new_frontiers_map_tormentors_desc": "Hai loại quái rừng hùng mạnh này xuất hiện tại mỗi căn cứ sau 20 phút, và chúng có bao tử đầy Aghanim’s Shard. Nhưng vấn đề là, thậm chí là hai luôn: 1) Khổ hình được trang bị khiên khủng, phản lại hầu như mọi sát thương bạn ném lên chúng. 2) Chúng mạnh lên sau mỗi lần bị giết. Vậy nên phải cần đến cả đội để hạ chúng.<br><br>Tin mừng là, như mấy con gấu sẽ lờ bạn đi để vồ người đi bộ đường dài, nếu bạn không làm gì chúng, thì chúng cũng sẽ không làm gì bạn.",
  "new_frontiers_map_watchers_title": "Gác canh",
  "new_frontiers_map_watchers_desc": "Gác canh tựa như Kẻ Hủy Diệt, nhưng để quan sát. Chúng không ngơi nghỉ. Chúng không biết đau. Chúng không biết sợ. Tuy thế, chúng biết làm biếng à nha. Chúng sẽ không quan sát cho đến khi bạn nhấp vào chúng. <br><br>Gác canh bắt đầu trận ở trạng thái không hoạt động và trung lập, nhưng khi được kích hoạt sẽ cho tầm nhìn xung quanh vị trí của nó trong bảy phút—hoặc đến khi quân địch phá bĩnh để tạm thời tắt nó. Khi một đội giết Roshan, tất cả Gác canh sẽ chuyển về phe đấy.",
  "new_frontiers_map_barriers_title": "Cổng hộ vệ",
  "new_frontiers_map_barriers_desc": "Cổng hộ vệ kết hợp thế giới giả tưởng hoành tráng của Dota với tính thực dụng của cửa nhà có thể khóa lại khi bạn đi chợ hay phá hủy Ancient. Đó là một cửa hậu trong căn cứ với khiên trường lực hữu dụng cho phép phe mình đi qua và ngăn kẻ địch lại. Khi kẻ địch tấn công mặt tiền, bạn có thể lẻn ra đằng sau.",
  "new_frontiers_map_wisdom_runes_title": "Rune tri thức",
  "new_frontiers_map_wisdom_runes_desc": "Khám phá rìa bản đồ để khai quật Rune tri thức, giúp tăng mức XP nhận được cho bất kỳ tướng nào đủ khôn ngoan để chiếm đoạt nó. Rune tri thức xuất hiện gần căn cứ của bạn, qua đó giúp cả đội dễ dàng bảo vệ nó hơn nhằm tránh những trận đang thua lại càng sấp mặt hơn.",
  "new_frontiers_map_shield_runes_title": "Rune khiên",
  "new_frontiers_map_shield_runes_desc": "Rune tăng lực ở sông giờ sẽ có thêm Rune khiên đầy trâu bò, cho bạn một lá chắn tương đương 50% máu tối đa. Băng trụ đồ sát đầu trận dễ dàng hơn — hoặc hiên ngang lên đồi không tầm nhìn để khiến bạn lẫn đội địch đều phải bất ngờ.",
  "new_frontiers_map_named_regions_title": "Danh lam thắng cảnh",
  "new_frontiers_map_named_regions_desc": "Bản đồ mở rộng giờ có thêm những khu vực đặc thù như Khu Mỏ, Cái Giếng, Nghĩa Địa, và Bức Tượng, từ đấy đồng đội dễ dàng biết chính xác kẻ giết bạn đang ở đâu. Tất cả đơn vị ở những khu vực này sẽ được hiệu chỉnh chỉ số theo chủ đề khu vực.",
  "new_frontiers_map_creep_camps_title": "12 bãi quái mới",
  "new_frontiers_map_creep_camps_desc": "Một số quái đã chán ngán việc bị chặt chém thường xuyên khi ở rừng, và vì thế đã lập 12 bãi quái mới rải rác khắp bản đồ được mở rộng này. Giờ thì bạn sẽ có nơi mới để đánh chén chúng.",
  "new_frontiers_map_outpost_title": "Tiền đồn mới",
  "new_frontiers_map_outpost_desc": "Bản đồ mở rộng mới giờ có thêm hai tiền đồn. Tiền đồn gốc đã được chuyển đến địa điểm mới, dấy lên câu hỏi liệu chúng còn là tiền đồn nguyên bản hay không. Khỏi nhờ bác học Lê Quý Đôn: Bình xưa, rượu cũ đó.",
  "new_frontiers_major_gameplay_features_desc": "Bản cập nhật 'Chiến tuyến mới' giới thiệu những thay đổi khủng lên tướng và hệ thống bạn yêu thích. Nói thẳng ra, bộ phận pháp lý khuyên chúng tôi rằng vì mục lối chơi này [i]dày đặc[/i] với những tính năng chấn động meta mà bạn nên từ từ ngâm cứu, trong vòng vài tuần tới, đặng không phải quá rạo rực để phải gọi phòng cháy chữa cháy.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Điểm nhấn tướng",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Dù tất cả tướng được cân bằng lại, một số được cân bằng nhiều hơn nhóm còn lại. Chúng tôi xin được điểm danh vài tướng tại đây.",
  "new_frontiers_major_gameplay_new_items_title": "Vật phẩm mới",
  "new_frontiers_major_gameplay_new_items_desc": "Cho mọi nhu cầu mua sắm của bạn.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Trang bị rừng mới",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Chúng tôi xin bổ sung bảy trang bị rừng mới, và giới thiệu lại vài món cũ thân thuộc.",
  "new_frontiers_major_gameplay_bkb_title": "Làm lại Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Kích hoạt Black King Bar giờ sẽ cho hóa giải cơ bản, và cho 50% kháng phép và miễn nhiễm bùa hại. Khi hiệu lực, hiệu ứng bất lợi từ bùa hại không ảnh hưởng bạn. Thêm nữa, bạn sẽ miễn nhiễm trước sát thương thuần và sát thương phản lại.<br><br>Nhưng cẩn thận: Nếu Black King Bar hết hiệu lực trước thời hạn của bất kỳ bùa hại nào, chúng sẽ áp dụng hiệu ứng bất lợi trong khoảng thời gian còn lại. Hiệu ứng xuyên được miễn nhiễm phép cũng sẽ xuyên được miễn nhiễm bùa hại.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Thuộc tính mới cho tướng",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Với việc huynh đệ tinh linh thứ tư vừa cho ra mắt gần đây, Void Spirit đáng lẽ không thuộc nhóm Sức Mạnh, Nhanh Nhẹn, hay Trí Tuệ. Để tách biệt hơn thì tướng này đáng lẽ nên thuộc một thể loại mới. Một dạng tướng [i]thứ tư[/i].<br><br>Xin giới thiệu các tướng Vạn Năng — một nhóm thuộc tính chính mới gồm các tướng hiện tại giờ nhận 0.6 sát thương từ mỗi thuộc tính, thuộc bất kỳ hệ nào. Kỹ sư của chúng tôi đảm bảo rằng số liệu được cân bằng một cách hoàn hảo. Trừ trường hợp nó không thể. Nhưng tin vui là tất cả chúng ta sẽ cùng nhau khám phá chuyến phiêu lưu vĩ đại này trong bản cập nhật 'Chiến tuyến mới'.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Làm lại cách rơi vật phẩm rừng",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Sát hại thú rừng từng có nghĩa là rơi ra các trang bị rừng ngầu ảo lòi... và thường là được trao cho tướng chủ lực, vốn thường không phải là bạn. Giờ giết quái rừng sẽ rơi ngẫu nhiên một token, cho phép bạn chọn từ [i]năm[/i] trang bị rừng có trong trận. Mỗi token đều có đủ năm lựa chọn, vậy nên người chơi cuối cùng đổi token cũng không thua thiệt gì.<br><br>Đội có thể đưa token cho bất kỳ ai cũng được— nhưng sau khi bạn chọn vật phẩm thì nó không thể chia sẻ được, vậy nên phân chia token cẩn trọng nhé.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Cân bằng quái rừng",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Quái rừng và kỹ năng của chúng giờ sẽ lớn mạnh theo thời gian. Thiệt đó, trận đấu càng kéo dài thì bãi quái càng khó tiêu diệt hơn, nhưng tướng với kỹ năng điều khiển quái giờ sẽ có thêm nhiều trợ tá đắc lực.",
  "new_frontiers_major_gameplay_kill_formula_title": "Tính lại công thức giết",
  "new_frontiers_major_gameplay_kill_formula_desc": "Chúng tôi làm lại công thức giết để khiến mạng chết đầu trận trở nên quan trọng và khuyến khích người chơi đi gank các đường khác hơn. Chúng tôi cũng sẽ giảm lượng vàng tăng thêm cho quái đường, khiến lợi ích của việc cày cuốc chúng giảm dần theo thời gian, và tạo động lực cho người chơi choảng nhau văng hết vàng.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Tính năng mới không choáng váng",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Điều khiển tướng của mình thì lúc nào cũng vui hơn là ngồi chờ. Thưa các bạn đam mê bấm chuột và chỉ trích việc ngồi chơi xơi nước, giấc mơ đã thành hiện thực: Sẵn sàng chơi tướng của mình nhiều hơn bao giờ hết.<br><br>Làm cách nào ư? Dễ thôi. Chúng tôi giảm hầu hết thời lượng của gần như mọi kiểu chế ngự trong trò chơi. Bằng cách nào mà nghĩ ra kế hoạch điên rồ này á? Dễ như ăn cháo. Ăn một cái rống của Beastmaster vào mặt và tự dưng có rất rất nhiều thời giờ để nghĩ.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Sau hai tháng đi ám các đường, Muerta cuối cùng cũng có Aghanim’s Scepter và Shard. Nếu chưa biết tướng này là ai, tìm hiểu thêm tại [url=https://www.dota2.com/deadreckoning]bản cập nhật Dead Reckoning[/url] nhé.",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi quá khờ để làm tướng Trí Tuệ. Vậy nên giờ không còn là tướng loại này nữa.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa giờ bắt đầu yếu như em bé, nhưng như em bé, cô sẽ lớn mạnh theo thời gian.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Hầu hết mọi kỹ năng của Clinkz, như những kỹ năng tuyệt nhất của cuộc đời, giờ có thể tạo xương.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden trước đây tạo ra bản sao hoàn hảo. Nhưng giờ có thể tạo ra bản thể [i]xịn hơn[/i]! Hay tệ hơn! Dù theo kiểu nào đi nữa, chắc chắn có khác biệt. Và không gây tranh cãi, chúng tôi nghĩ thế.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Người kiểu nào chơi tướng kiểu nấy, ai chơi Alchemist giờ cũng bẩm sinh tham lam.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "KỸ NĂNG THÊM CHO ARC WARDEN (GIỚI HẠN THỜI GIAN)",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Trong một khoảng thời gian giới hạn, khi chọn Arc Warden lúc chơi dưới phe Dire, bản sao Tempest mới là tướng chính, dùng tuyệt kỹ sẽ triệu hồi bản thể \"thường\".",
  "new_frontiers_matchmaking_desc": "Nói thẳng nói thật nè: Có tám tỷ người trên hành tinh, 99.99% trong số đó chơi Dota rất tệ. Điều này tức hệ thống tìm trận sẽ cực kỳ đánh đố, đặc biệt khi bạn rất giỏi Dota, và muốn chơi cùng với những người gần như nhưng hy vọng là không giỏi Dota bằng bạn. Chúng tôi đã thâu đêm suốt sáng và tính toán gãy tay để cải thiện chất lượng tìm trận đấu trên mọi thể loại, cho người chơi thuộc tất cả nhóm kỹ năng.",
  "new_frontiers_matchmaking_intro_title": "Tìm trận đấu với độ tự tin",
  "new_frontiers_matchmaking_intro_desc": "MMR (Chỉ số xếp trận) thực ra chỉ là hai con số: Hạng và độ tự tin hạng. Hạng của bạn là ước tính về kỹ năng, còn độ tự tin hạng là sự tự tin của chúng tôi về ước tính đó. Khi chơi một trận đấu, chúng tôi điều chỉnh hạng dựa trên thắng thua. Độ tự tin hạng cũng sẽ tăng lên, bởi chúng tôi có nhiều dữ liệu hơn.",
  "new_frontiers_matchmaking_details_old_title": "Vón cục ngoài ý muốn: Loại vón thốn nhất",
  "new_frontiers_matchmaking_details_old_desc": "Truyền thống, Dota dùng một thuật toán Elo cải biên để tính thay đổi về hạng và độ tự tin hạng. Nhưng theo thời gian chúng tôi nhận ra một vài vấn đề về cách tiếp cận này. Ví dụ, phân bổ MMR ngày một nghiêng về nhóm thấp hơn, tạo ra cụm tập trung ngoài ý muốn trong khoảng 0-1000 MMR. Vấn đề khác nữa là người chơi sau khoảng thời gian ngừng chơi và quay lại sẽ nhọc nhằn tiến tới MMR chuẩn, vì nhóm kỹ năng trước đó không còn phản ánh đúng.",
  "new_frontiers_matchmaking_details_new_title": "Cụm thông số mới và cải thiện",
  "new_frontiers_matchmaking_details_new_desc": "Để xử lý, chúng tôi chuyển qua một thuật toán khác mang tên Glicko, giúp bạn mau chóng và chính xác hợp trận với người chơi khác cùng trình độ. Trên phương diện toán học, Glicko cho phép chúng tôi chuẩn đoán tốt hơn độ tự tin hạng của người chơi vào tính toán, từ đấy đưa ra các quyết định thăng/hạ cấp hạng chuẩn xác hơn.\\n\\nQuá trình chuyển đổi hệ thống xếp trận sẽ cảm giác tựa như bắt đầu một mùa xếp hạng mới: [list][*]Tất cả người chơi sẽ được đặt lại vào chế độ căn chỉnh, ban đầu chia hạt giống theo như hạng trước đó.\\n[*]Quá trình căn chỉnh không còn dựa trên một số trận nhất định. Thay vào đó, người chơi được coi là căn chỉnh thành công khi điểm độ tự tin hạng của họ vượt qua ngưỡng nhất định.\\n[*]Sau khi căn chỉnh, khả năng cao là bạn sẽ có một huy hiệu hạng khác với trước đó. Tuy nhiên, kể cả khi huy hiệu bị đổi màu đáng kể, bạn có thể tin tưởng rằng mình sẽ xếp trận với người chơi cùng trình độ.\\n[*]Bạn không còn nhận/mất một lượng MMR cố định sau mỗi trận đấu. Nó sẽ thay đổi tùy theo nhiều biến số, bao gồm hạng và độ tự tin hạng của người tham gia trận. Tuy nhiên, chúng tôi sẽ giới hạn mức nhận/mất theo mỗi trận để ngăn các kết quả xấu ngoài mong đợi.[*]Độ tự tin hạng của người chơi sẽ tụt giảm theo thời gian nếu họ không chơi trận nào.[/list]Từ hậu trường, chúng tôi đã thử nghiệm song song cả hai hệ thống xếp trận được một thời gian để gầy dựng sự tin tưởng về những thay đổi này. Chúng tôi hiểu rằng MMR chuẩn xác là một trong nhiều yếu tố ảnh hưởng đến chất lượng trận đấu, và như tất cả thay đổi trong môi trường này, chúng tôi rất quan tâm đến việc lắng nghe phản hồi từ các bạn.",
  "new_frontiers_matchmaking_immortals_title": "Hệ thống tìm trận hạng Immortal",
  "new_frontiers_matchmaking_immortals_desc": "Tại hạng Immortal, biết người chơi khác, buôn dưa lê với họ, và chọn đúng điểm cân bằng giữa các vai trò còn quan trọng hơn cả MMR. Vậy nên chúng tôi thiết kế lại việc xếp trận ở hạng Immortal nhằm tính luôn điều đó.<br><br>Các trận ở hạng Immortal sẽ không dùng đội lập sẵn. Thay vào đó, hai đội trưởng sẽ chọn tám người chơi khác về phe mình, khiến đội của bạn trở nên nặng ký hơn so với chỉ phụ thuộc vào MMR để lên sàn. Nên nếu trận đấu của bạn có tệ, thì hãy tự trách mình thôi, các Immortal ơi.",
  "new_frontiers_ui_desc": "Mắt choáng tay đau không rõ từ đâu? Chúng tôi khuyên là cứ phớt lờ đi, chỉ là cách để cơ thể báo mình đang đói ấy mà. Bị xì lốp? Lái bằng mâm xe — vẫn đủ độ tròn. Điều quan trọng ở đây là: gần như mọi thứ trong cuộc sống có thể an toàn làm ngơ mà không để lại hậu quả.<br><br>Ngoại trừ thanh máu trong Dota. Thứ đó quan trọng lắm à nha. Đây là lý do tại sao mà một loạt giao diện thông tin liên quan đến thanh máu được đại tu bổ trong bản cập nhật này.",
  "new_frontiers_ui_shields_title": "Thanh máu và lá chắn",
  "new_frontiers_ui_shields_desc": "Bạn có biết Dota có khiên? Khiên phép, khiên vật lý, và khiên Aphotic. Muôn vàn luôn! Có thể bạn bỏ qua chúng. Hay như gần như phớt lờ. Bởi vì chả có cách nào để biết ban đầu có bao nhiêu khiên và sau đó còn lại bao nhiêu.<br><br>Nhưng kỷ nguyên tăm tối đấy kết thúc vào hôm nay. Giờ bạn sẽ thấy tất cả. Hoặc chí ít thấy cả hai thứ đó. Bạn thậm chí có thể thấy loại khiên đó là gì. Để ăn mừng việc các khiên cũ ấy giờ được nâng cấp đồ họa, chúng tôi cũng thêm một mớ kỹ năng mới có chúng trong đó<br><br>Chúng tôi cũng đặt lại khái niệm 'Khiên' thành 'Lá chắn' (Barrier), vậy nên bạn sẽ không bị nhầm lẫn rằng có Vanguard trên thanh máu. Khỏi cảm ơn nha.",
  "new_frontiers_ui_health_pips_title": "Thanh máu số lần đánh",
  "new_frontiers_ui_health_pips_desc": "Một vài đơn vị không có lượng máu truyền thống mà thay vào đó là nhận đủ số đòn để bị phá hủy. Giờ đây, thay vì đoán mò hay đếm thầm trong đầu với bộ não thiên tài, giờ chỉ cần nhìn lên đơn vị mà bạn đang tẩm quất thôi. Nó sẽ hiện từng chấm nhỏ đại diện cho số lần đòn có thể chịu trước thoát khỏi cái thể xác trần tục này (Trích từ thanh máu của Hamlet).",
  "new_frontiers_ui_health_cost_title": "Máu hao tốn",
  "new_frontiers_ui_health_cost_desc": "Dù hầu hết đa phần kỹ năng Dota tốn mana, một số khác thì tốn máu. Giờ các kỹ năng đấy sẽ thực sự hiện lượng máu tốn khi dùng. Nghe thủng tai phải không? Nghĩ lại cũng quái thật khi mà không một ai nghĩ đến việc này trước đây. Nhưng giờ thì có rồi đó.",
  "new_frontiers_gameplay_update_desc": "Đây quả là một danh sách dài. Điều làm chúng tuyệt vời hơn là có đến [i]hai[/i] danh sách dài thật dài lận cơ, nhưng tìm đâu ra khoảnh khắc đọc kiểu [i]ê, nhìn xem ngầu chưa kìa![/i] cho tất cả mọi thay đổi cân bằng khác mà bản cập nhật này có. Hay là cứ thế chơi luôn để biết. Tin tụi tui đi, chả cần nói để các bạn biết đọc sách hướng dẫn kỹ thuật về trò chơi điện tử vui thế nào đâu, đến mức việc tận hưởng trò chơi chỉ đứng thứ hai thôi đấy.  Danh sách này vẫn sẽ còn đây khi bạn quay lại.",
  "new_frontiers_misc_title": "Khác",
  "new_frontiers_misc_role_tokens": "Chúng tôi đã giảm số token xếp trận theo vai trò nhận được sau một trận thua khi 'chọn mọi vai trò'. Giờ đây, bạn sẽ có hai token khi thua. (Vẫn nhận đầy đủ bốn token khi thắng). Thay đổi này sẽ giúp cải thiện thái độ của người chơi trong chế độ xếp hạng theo vai trò, nơi mà một số người sẽ ưu tiên cày token hơn là chơi vai đã chọn một cách hiệu quả.",
  "new_frontiers_misc_removed_roles": "Chúng tôi đã loại bỏ Captains Mode khỏi chế độ xếp hạng, cũng như All Random và All Random Deathmatch khỏi chế độ thường. Gần như chẳng còn ai chơi những chế độ này và thời gian xếp trận thường kéo dài hơn một tiếng.",
  "new_frontiers_misc_model_editor": "Cập nhật này sẽ xóa trình chỉnh sửa model gốc. Tất cả file vmdl giờ sẽ được nạp vào công cụ mới, và model cũ được chuyển đổi vào lần nạp đầu tiên. Chúng tôi sẽ ra mắt một bản cập nhật sau đó để gỡ toàn bộ hỗ trợ cho việc nạp định dạng biên dịch cũ, vì thế chúng tôi khuyến khích tất cả tác giả Workshop nạp và chuyển đổi model sang định dạng mới, rồi biên dịch chúng lại ngay khi có thể.",
  "new_frontiers_misc_hold_animation": "Chúng tôi đã gỡ hỗ trợ cho phím \"HoldAnimation\" gốc khỏi đạo cụ linh động. Trận đấu tùy chỉnh nên được chuyển thủ công sang phím \"chế độ vòng lặp\" mới, hoặc biên dịch lại bản đồ để tự động nâng cấp các thiết lập đó.",
  "neutral_item_tier": "Trang bị rừng [b]bậc %1$s[/b]",
  "dota_ability_variable_health": "Máu",
  "dota_ability_variable_mana": "Mana",
  "dota_ability_variable_armor": "Giáp",
  "dota_ability_variable_damage": "Sát thương",
  "dota_ability_variable_str": "Sức mạnh",
  "dota_ability_variable_int": "Trí tuệ",
  "dota_ability_variable_agi": "Nhanh nhẹn",
  "dota_ability_variable_all": "Tất cả thuộc tính",
  "dota_ability_variable_primary_attribute": "Thuộc tính chính",
  "dota_ability_variable_attack": "Tốc độ đánh",
  "dota_ability_variable_hp_regen": "Hồi máu",
  "dota_ability_variable_lifesteal": "Hút máu",
  "dota_ability_variable_mana_regen": "Hồi mana",
  "dota_ability_variable_mana_regen_aura": "Hào quang hồi mana",
  "dota_ability_variable_spell_amp": "Sát thương phép",
  "dota_ability_variable_debuff_amp": "Thời gian bùa hại",
  "dota_ability_variable_move_speed": "Tốc độ chạy",
  "dota_ability_variable_evasion": "Né tránh",
  "dota_ability_variable_spell_resist": "Kháng phép",
  "dota_ability_variable_spell_lifesteal": "Hút máu phép",
  "dota_ability_variable_spell_lifesteal_creep": "Hút máu phép (Quái)",
  "dota_ability_variable_spell_lifesteal_hero": "Hút máu phép (Tướng)",
  "dota_ability_variable_selected_attrib": "Thuộc tính được chọn",
  "dota_ability_variable_attack_range": "Tầm đánh <font color='#7d7d7d'>(Chỉ đánh xa)</font>",
  "dota_ability_variable_attack_range_melee": "Tầm đánh <font color='#7d7d7d'>(Chỉ cận chiến)</font>",
  "dota_ability_variable_cast_range": "Tầm thi triển",
  "dota_ability_variable_status_resist": "Kháng hiệu ứng",
  "dota_ability_variable_projectile_speed": "Tốc độ đường đạn",
  "dota_ability_variable_manacost_reduction": "Giảm mana tốn",
  "dota_ability_variable_cooldown_reduction": "Giảm thời gian hồi",
  "dota_ability_variable_max_mana_percentage": "Mana tối đa thêm"
}