// 6523.js

{
  "language": "greek",
  "new_frontiers_gameplay_number": "ΕΝΗΜΕΡΩΣΗ ΠΑΙΧΝΙΔΙΟΥ 7.33",
  "new_frontiers_title": "Η ΕΝΗΜΕΡΩΣΗ ΝΕΟΙ ΟΡΙΖΟΝΤΕΣ",
  "new_frontiers_title_short": "ΝΕΟΙ ΟΡΙΖΟΝΤΕΣ",
  "new_frontiers_subtitle": "Νέος χάρτης, μεγάλες αλλαγές στον τρόπο παιχνιδιού και πολλά άλλα. Ένας ολοκαίνουριος κόσμος σας περιμένει.",
  "new_frontiers_play_trailer": "ΠΡΟΒΟΛΗ ΤΡΕΪΛΕΡ",
  "new_frontiers_dota_team_intro": "Η ενημέρωση Νέοι Ορίζοντες κυκλοφορεί με νέο χάρτη, μεγάλες αλλαγές στον τρόπο παιχνιδιού, στην εύρεση παιχνιδιού, στη διεπαφή χρήστη και (χωρίς πλάκα) σε πολλά άλλα.<br><br>Πόσα; Τόσα πολλά που ήταν δύσκολο να τα θυμηθούμε όλα και αρχίσαμε να πανικοβαλλόμαστε για μερικές μέρες, μέχρι που κάποιος θυμήθηκε ότι μπορούμε απλά να τα καταγράψουμε. Έτσι κι έγινε. Τώρα μπορούμε να τα διαβάσουμε ανά πάσα στιγμή. Όπως κι εσείς! Συνεχίστε προς τα κάτω για να τα διαβάζετε.",
  "new_frontiers_eldor_name": "Eldor ο μάγος",
  "new_frontiers_dota_team_name": "Η ομάδα Dota",
  "new_frontiers_section_title_map": "ΝΕΟΣ ΧΑΡΤΗΣ",
  "new_frontiers_section_title_major_gameplay": "ΜΕΓΑΛΕΣ ΑΛΛΑΓΕΣ ΠΑΙΧΝΙΔΙΟΥ",
  "new_frontiers_section_title_matchmaking": "ΕΥΡΕΣΗ ΠΑΙΧΝΙΔΙΟΥ",
  "new_frontiers_section_title_ui": "ΔΙΕΠΑΦΗ ΧΡΗΣΤΗ",
  "new_frontiers_section_title_gameplay_update": "ΑΛΛΑΓΕΣ ΙΣΟΡΡΟΠΙΑΣ",
  "new_frontiers_map_introduction": "Ο χάρτης Dota έχει επεκταθεί σε μεγάλο βαθμό. Η βασική αποστολή του παιχνιδιού παραμένει η ίδια. Τα μέτωπά σας δεν απομακρύνθηκαν περισσότερο το ένα από το άλλο και όλα όσα χρειάζεστε για να κερδίσετε εξακολουθούν να βρίσκονται στο κέντρο του χάρτη.<br><br>Αλλά με 40% περισσότερο έδαφος, υπάρχει αρκετός χώρος για να εκμεταλλευτείτε νέους πόρους και να ανακαλύψετε νέες στρατηγικές. Οι δύο κύριες ζούγκλες έχουν επίσης ανασχεδιαστεί συνολικά, αλλάζοντας την τοποθέτηση όρασης, τα μονοπάτια απόδρασης, το φαρμάρισμα και άλλα.",
  "new_frontiers_map_subtitle": "ΕΞΕΡΕΥΝΗΣΤΕ ΤΟΝ ΝΕΟ ΚΟΣΜΟ",
  "new_frontiers_map_roshan_title": "ΤΑ ΝΕΑ ΣΠΙΤΙΑ ΤΟΥ ROSHAN",
  "new_frontiers_map_roshan_desc": "Ο Roshan πούλησε το παλιό του σπίτι στο ποτάμι και εκμεταλλεύεται τη νέα του ακίνητη περιουσία. Τώρα έχει [i]δύο[/i] νέους φανταστικούς λάκκους, που βρίσκονται στην βόρειοδυτική και νοτιοανατολική άκρη του χάρτη. Είναι ο παράδεισος των λάτρεων λάκκων, με πανοραμική θέα των σιντριβανιών και λίγα λεπτά μακριά από τα Μυστικά Μαγαζιά.<br><br>Αυτοί οι λάκκοι είναι μάλλον πιο κοντά και σε κάποιο γυμναστήριο, καθώς ο Roshan είναι ακόμα πιο ανθεκτικός τώρα. Επίσης, ο Roshan δεν ρίχνει πλέον Aghanim's Shard και τώρα ρίχνει Cheese στον δεύτερό του θάνατο, αντί για τον τρίτο. Ο τρίτος θάνατος ρίχνει ένα Refresher Shard ή ένα Aghanim's Scepter, ανάλογα με το αν βρίσκεται στο βόρειο ή στο νότιο λάκκο.",
  "new_frontiers_map_twin_gates_title": "ΔΙΔΥΜΕΣ ΠΥΛΕΣ",
  "new_frontiers_map_twin_gates_desc": "Δύο πύλες συνδέουν τις άκρες του χάρτη κοντά στους πύργους ασφαλούς μετώπου, επιτρέποντας στους παίκτες να τηλεμεταφέρονται άμεσα από τη μία άκρη του χάρτη στην άλλη.<br><br>Αυτή είναι μια αλλαγή τρόπου παιχνιδιού, αλλά έχει και προφανείς επιπτώσεις στην ιστορία. Καλά μαντέψατε: Το Dota 2 πλέον ανήκει ανεπίσημα στο PMEU (Διευρυμένο Σύμπαν Pac Man).",
  "new_frontiers_map_lotus_pools_title": "ΣΙΝΤΡΙΒΑΝΙΑ ΛΩΤΩΝ",
  "new_frontiers_map_lotus_pools_desc": "Οι παίκτες μπορούν τώρα να βρουν σιντριβάνια λωτών στην αριστερή και δεξιά άκρη του χάρτη (κοντά στο σημείο που τα κύματα κριπακίων συναντιούνται για πρώτη φορά). Αναβιώνουν περιοδικά φρούτα που, όταν καταναλωθούν, παρέχουν ζωή και ενέργεια.<br><br>Οι παίκτες μπορούν να συσσωρεύσουν αυτά τα φρούτα και έπειτα να τα συνδυάσουν αργά στο παιχνίδι σε ένα ακόμα μεγαλύτερο φρούτο, υψηλότερης αξίας. Αυτό το μεγαλύτερο φρούτο μπορεί να συνδυαστεί σε ένα [i]απίστευτα[/i] μεγάλο φρούτο. Τι συμβαίνει αν συνδυάσετε το [i]απίστευτα[/i] μεγάλο φρούτο; Πιθανότατα τίποτα. (Σίγουρα κάτι).",
  "new_frontiers_map_tormentors_title": "TORMENTOR",
  "new_frontiers_map_tormentors_desc": "Αυτά τα δύο ισχυρά ουδέτερα κριπάκια αναβιώνουν κοντά στη βάση μετά το 20 λεπτό και διαθέτουν και τα δύο μια πληθώρα από Aghanim’s Shard. Αλλά υπάρχει μια παγίδα, και η παγίδα είναι ότι υπάρχουν δύο παγίδες: 1) Οι Tormentor είναι εξοπλισμένοι με μέγα ασπίδες, που αντανακλούν την περισσότερη από τη ζημιά που τους προκαλείτε. 2) Γίνονται πιο ισχυροί κάθε φορά που τους σκοτώνετε. Οπότε μάλλον θα χρειαστεί όλη την ομάδα σας για να κατατροπώσετε έναν από αυτούς.<br><br>Τα καλά νέα είναι ότι, όπως οι αρκούδες σας αγνοούν για να κατασπαράξουν έναν πεζοπόρο, αν τους αφήσετε ήσυχους, θα σας αφήσουν ήσυχους.",
  "new_frontiers_map_watchers_title": "ΠΑΡΑΤΗΡΗΤΕΣ",
  "new_frontiers_map_watchers_desc": "Οι Παρατηρητές είναι σαν τους Εξολοθρευτές, αλλά για παρακολούθηση. Είναι αμείλικτοι. Δεν γνωρίζουν τι θα πει πόνος. Δεν γνωρίζουν τι θα πει φόβος. Είναι, όμως, τεμπέληδες. Δεν θα αρχίσουν να παρακολουθούν μέχρι να κάνετε κλικ πάνω τους. <br><br>Οι Παρατηρητές ξεκινούν το παιχνίδι ανενεργοί και ουδέτεροι, αλλά όταν ενεργοποιηθούν, παρέχουν όραση στην περιοχή του Παρατηρητή για επτά λεπτά, ή μέχρι οι εχθροί σας το καταστείλουν προσωρινά. Όταν μια ομάδα σκοτώσει τον Roshan, όλοι οι Παρατηρητές παίρνουν το μέρος της.",
  "new_frontiers_map_barriers_title": "ΠΥΛΕΣ ΥΠΕΡΑΣΠΙΣΤΗ",
  "new_frontiers_map_barriers_desc": "Η Πύλη Υπερασπιστή συνδυάζει τη φανταχτερή υψηλή φαντασία του Dota με την πρακτικότητα των πορτών στο σπίτι σας που μπορείτε να κλειδώσετε όταν πάτε στο μπακάλικο για να καταστρέψετε το Αρχαίο του. Είναι μια πίσω πόρτα στη βάση σας με ένα εύχρηστο ενεργειακό πεδίο που επιτρέπει την ομάδα σας να περάσει, αλλά κρατάει μακριά την εχθρική ομάδα. Όσο ο εχθρός πολιορκεί τις κύριες εισόδους, εσείς μπορείτε να ξεμυτίσετε κρυφά από πίσω.",
  "new_frontiers_map_wisdom_runes_title": "ΡΟΥΝΟΙ WISDOM",
  "new_frontiers_map_wisdom_runes_desc": "Εξερευνήστε τον χάρτη για να ξεθάψετε ρούνους Wisdom, που παρέχουν ενισχύσεις εμπειρίας σε κάθε ήρωα που τους αρπάζει. Οι ρούνοι Wisdom αναβιώνουν κοντά στη βάση σας, προσφέροντας έναν εύκολο τρόπο άμυνας, ώστε να αποτρέψετε ένα χαμένο παιχνίδι από το βγει εκτός ελέγχου.",
  "new_frontiers_map_shield_runes_title": "ΡΟΥΝΟΙ SHIELD",
  "new_frontiers_map_shield_runes_desc": "Οι ρούνοι ισχύος του ποταμιού έλαβαν επίσης μια προσθήκη με τον νέο και δυνατό ρούνο Shield, που σας δίνει το 50% της μέγιστης ζωής σας ως ασπίδα. Εφορμήστε μέσα στην εμβέλεια ενός πύργου νωρίς στο παιχνίδι ή μπείτε μέσα σε ένα τυφλό σημείο για να αιφνιδιάσετε τόσο τον εαυτό σας όσο και την εχθρική ομάδα.",
  "new_frontiers_map_named_regions_title": "ΟΝΟΜΑΤΙΣΜΕΝΕΣ ΠΕΡΙΟΧΕΣ",
  "new_frontiers_map_named_regions_desc": "Ο διευρυμένος χάρτης τώρα διαθέτει ξεχωριστές περιοχές, όπως τα Ορυχεία, το Πηγάδι, το Νεκροταφείο και το Άγαλμα, τα οποία σας διευκολύνουν ακόμα περισσότερο στο να ειδοποιείτε τους συμπαίκτες σας για το πού σας σκοτώνει κάποιος. Μέσα σε αυτές τις περιοχές, όλες οι μονάδες λαμβάνουν τροποποιήσεις στα στατιστικά τους, ανάλογα με το θέμα της περιοχής.",
  "new_frontiers_map_creep_camps_title": "12 ΝΕΟΙ ΚΑΤΑΥΛΙΣΜΟΙ ΚΡΙΠΑΚΙΩΝ",
  "new_frontiers_map_creep_camps_desc": "Μερικά κριπάκια κουράστηκαν να σφαγιάζονται όλη την ώρα στη ζούγκλα και εγκαθίδρυσαν 12 νέους καταυλισμούς, που είναι διάσπαρτοι σε όλον τον διευρυμένο χάρτη. Ώστε να μπορείτε να τα σφάξετε και εκεί.",
  "new_frontiers_map_outpost_title": "ΝΕΑ ΦΥΛΑΚΙΑ",
  "new_frontiers_map_outpost_desc": "Ο νέος διευρυμένος χάρτης διαθέτει δύο νέα Φυλάκια. Τα αρχικά Φυλάκια μετακινήθηκαν σε νέες τοποθεσίες, με αποτέλεσμα να εγείρεται το ερώτημα του αν είναι πραγματικά τα αρχικά Φυλάκια. Καλή προσπάθεια, Σωκράτη. Ναι, είναι.",
  "new_frontiers_major_gameplay_features_desc": "Η ενημέρωση Νέοι Ορίζοντες εισάγει μεγάλες αλλαγές στους αγαπημένους σας ήρωες και συστήματα. Μάλιστα, οι νομικοί μας σύμβουλοι μάς συμβούλευσαν ότι αυτή η ενότητα του τρόπου παιχνιδιού είναι [i]τόσο γεμάτη[/i] με νέα και πρωτοποριακά χαρακτηριστικά, που θα πρέπει να τη διαβάσετε σιγά σιγά μέσα στις επόμενες εβδομάδες, ώστε να μην τρελαθείτε και καλέσετε το 166.",
  "new_frontiers_major_gameplay_hero_reworks_title": "ΑΞΙΟΣΗΜΕΙΩΤΟΙ ΗΡΩΕΣ",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Αν και όλοι οι ήρωες εξισορροπήθηκαν, μερικοί εξισορροπήθηκαν περισσότερο από τους άλλους. Ορίστε μερικοί από αυτούς.",
  "new_frontiers_major_gameplay_new_items_title": "ΝΕΑ ΑΝΤΙΚΕΙΜΕΝΑ",
  "new_frontiers_major_gameplay_new_items_desc": "Για όλες τις αγοραστικές σας ανάγκες.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "ΝΕΑ ΟΥΔΕΤΕΡΑ ΑΝΤΙΚΕΙΜΕΝΑ",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Προσθέσαμε επτά ολοκαίνουργια ουδέτερα αντικείμενα και φέραμε πίσω μερικά παλιά αγαπημένα.",
  "new_frontiers_major_gameplay_bkb_title": "ΑΝΑΣΧΕΔΙΑΣΜΟΣ BLACK KING BAR",
  "new_frontiers_major_gameplay_bkb_desc": "Όταν ενεργοποιείτε το Black King Bar, πλέον εφαρμόζεται μια απλή κατάλυση που παρέχει 50% μαγική αντίσταση και ατρωσία απομειώσεων. Όσο είναι ενεργό, οι αρνητικές επιδράσεις από απομειώσεις δεν σας επηρεάζουν. Επίσης, θα έχετε ατρωσία από καθαρή και αντανακλώμενη ζημιά.<br><br>Αλλά προσέξτε: Αν το Black King Bar λήξει πριν τη διάρκεια τυχόν απομειώσεων, οι απομειώσεις αυτές θα εφαρμοστούν για την υπόλοιπη διάρκεια. Οι επιδράσεις που διαπερνούν τη μαγική ατρωσία τώρα διαπερνούν επίσης την ατρωσία απομειώσεων.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "ΝΕΟΣ ΤΥΠΟΣ ΧΑΡΑΚΤΗΡΙΣΤΙΚΟΥ ΗΡΩΑ",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Ως το τέταρτο αδερφό πνεύμα που κυκλοφορήσαμε, ο Void Spirit δεν θα έπρεπε να ήταν ήρωας δύναμης, σβελτάδας ή ευφυΐας. Για να ξεχωρίσει, θα έπρεπε να είναι ένα νέο είδος ήρωα. Ένα [i]τέταρτο[/i] είδος ήρωα.<br><br>Παρουσιάζουμε τους Επιδέξιους ήρωες — ένα νέο σύνολο κύριου χαρακτηριστικού που αποτελείται από υπάρχοντες ήρωες που αποκτούν τώρα 0,6 ζημιά από κάθε στατιστικό οποιουδήποτε χαρακτηριστικού. Οι μηχανικοί μας μάς διαβεβαιώνουν ότι αυτός ο αριθμός είναι απόλυτα ισορροπημένος. Εκτός αν δεν είναι. Το καλό είναι ότι θα το μάθουμε όλοι μαζί στη μεγάλη περιπέτεια που φέρνει η ενημέρωση Νέοι Ορίζοντες.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "ΑΝΑΣΧΕΔΙΑΣΜΟΣ ΡΙΨΕΩΝ ΟΥΔΕΤΕΡΩΝ ΑΝΤΙΚΕΙΜΕΝΩΝ",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Παλιά, σκοτώνοντας πλάσματα του δάσους λαμβάνατε ένα νέο και φοβερό ουδέτερο αντικείμενο… το οποίο συνήθως πήγαινε στον κουβαλητή, δηλαδή όχι σε εσάς. Πλέον, όταν σκοτώνετε ουδέτερα κριπάκια, θα πέφτει τυχαία μια μάρκα, που θα σας επιτρέπει να επιλέξετε από [i]πέντε[/i] διαθέσιμα ουδέτερα αντικείμενα. Κάθε μάρκα προσφέρει μια πλήρη γκάμα πέντε επιλογών, ώστε ακόμα και ο τελευταίος παίκτης που την εξαργυρώνει να μπορεί να επιλέξει.<br><br>Οι ομάδες μπορούν να δώσουν μάρκες σε όποιον θέλουν, αλλά αφού επιλέξετε ένα αντικείμενο δεν μπορείτε να το μοιραστείτε, οπότε μοιράστε τις μάρκες σας υπεύθυνα.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "ΚΛΙΜΑΚΩΣΗ ΟΥΔΕΤΕΡΩΝ ΚΡΙΠΑΚΙΩΝ",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Τα ουδέτερα κριπάκια και οι ικανότητές τους τώρα κλιμακώνονται με το πέρασμα του χρόνου. Ναι, θα είναι πιο δύσκολο να εξαλείψετε καταυλισμούς καθώς το παιχνίδι εξελίσσεται, αλλά ήρωες με την ικανότητα ελέγχου κριπακίων θα έχουν σοβαρή υποστήριξη.",
  "new_frontiers_major_gameplay_kill_formula_title": "ΑΝΑΣΧΕΔΙΑΣΜΟΣ ΜΑΘΗΜΑΤΙΚΟΥ ΤΥΠΟΥ ΣΚΟΤΩΜΩΝ",
  "new_frontiers_major_gameplay_kill_formula_desc": "Ανασχεδιάσαμε τον μαθηματικό τύπο σκοτωμών για να δώσουμε μεγαλύτερη σημασία στους σκοτωμούς νωρίς στο παιχνίδι και να παροτρύνουμε τους παίκτες να κάνουν ενέδρα σε άλλα μέτωπα. Έχουμε μειώσει επίσης την κλιμάκωση χρυσού για κριπάκια μετώπου, κάνοντας το φαρμάρισμα κριπακίων λιγότερο επικερδές όσο εξελίσσεται το παιχνίδι, για να ενθαρρύνουμε τους παίκτες να βγάζουν χρυσό χτυπώντας ο ένας τον άλλον.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "ΚΑΤΙ ΝΕΟ ΓΙΑ ΝΑ ΞΕΚΟΛΛΗΣΕΤΕ",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Είναι πάντα πιο διασκεδαστικό να παίζετε με τον ήρωά σας, παρά να μην παίζετε με τον ήρωά σας. Είτε είστε φαν του να παίζετε με πράγματα και ενάντιοι του να μην παίζετε, τα όνειρά σας έχουν γίνει πραγματικότητα: Ετοιμαστείτε να παίξετε με τον ήρωά σας περισσότερο από ποτέ.<br><br>Πώς; Εύκολο. Μειώσαμε τη διάρκεια σχεδόν κάθε καταστολής στο παιχνίδι. Αναρωτιέστε πώς σκαρφιστήκαμε αυτό το τρελό σχέδιο; Ακόμα πιο εύκολο. Φάγαμε κατάμουτρα ένα Primal Roar από τον Beastmaster και είχαμε πολύ χρόνο για να σκεφτούμε.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Η Muerta κατάφερε επιτέλους, μετά από δύο μήνες που στοιχειώνει τα μέτωπα, να βρει το Aghanim’s Scepter και το Aghanim’s Shard. Αν δεν την έχετε δοκιμάσει ακόμα, μπρείτε να μάθετε περισσότερα στην [url=https://www.dota2.com/deadreckoning]ενημέρωση Dead Reckoning[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ο Ogre Magi είναι πολύ κουτός για να είναι ήρωας ευφυΐας. Οπότε δεν είναι πια.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Η Medusa τώρα ξεκινάει αδύναμη σαν μωρό, αλλά όπως τα μωρά, γίνεται πιο ισχυρή με τον καιρό.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Οι περισσότερες ικανότητες του Clinkz, όπως και οι καλύτερες ικανότητες στη ζωή, τώρα δημιουργούν σκελετούς.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Στο παρελθόν, ο Arc Warden δημιουργούσε ένα τέλειο κλώνο του εαυτού του. Πλέον, φτιάχνει μια [i]καλύτερη[/i] μορφή του εαυτού του! Ή χειρότερη! Όπως και να 'χει, είναι διαφορετική. Το σίγουρο είναι ότι δεν είναι καθόλου αμφιλεγόμενη.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Ο ήρωας Alchemist, όπως όλοι οι παίκτες Alchemist, είναι τώρα εγγενώς άπληστος.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ΜΠΟΝΟΥΣ ARC WARDEN ΓΙΑ ΠΕΡΙΟΡΙΣΜΕΝΟ ΧΡΟΝΟ",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Για περιορισμένο χρονικό διάστημα, όταν επιλέγετε Arc Warden όταν παίζετε για τους Dire, το αντίγραφο από Tempest Double θα είναι ο κύριος ήρωας και η εκτέλεση της απόλυτης ικανότητας θα κλητεύει τον «κανονικό» του εαυτό.",
  "new_frontiers_matchmaking_desc": "Ας είμαστε ειλικρινείς: Το 99.99% από τους οκτώ δισεκατομμύρια ανθρώπους στον πλανήτη είναι άθλιο στο Dota. Αυτό σημαίνει ότι, αρκετές φορές, η εύρεση παιχνιδιού είναι δύσκολη, ειδικά όταν είστε έμπειροι παίκτες και σας αρέσει να παίζετε με άτομα που είναι σχεδόν το ίδιο καλά, αλλά όχι καλύτερα από εσάς. Έχουμε κάνει πολλή δουλειά και υπολογισμούς για να βελτιώσουμε συνολικά την ποιότητα της εύρεσης παιχνιδιού, για παίκτες κάθε επιπέδου.",
  "new_frontiers_matchmaking_intro_title": "ΕΥΡΕΣΗ ΠΑΙΧΝΙΔΙΟΥ ΜΕ ΕΜΠΙΣΤΟΣΥΝΗ",
  "new_frontiers_matchmaking_intro_desc": "Η κατάταξη εύρεσης παιχνιδιού (MMR) αποτελείται στην ουσία από δύο αριθμούς: την κατάταξη και την εμπιστοσύνη κατάταξης. Η κατάταξή σας είναι μια εκτίμηση της ικανότητάς σας και η εμπιστοσύνη κατάταξής σας είναι η βεβαιότητά μας για αυτήν την εκτίμηση. Όταν παίζετε έναν αγώνα, προσαρμόζουμε την κατάταξή σας βάσει του αν κερδίσατε ή αν χάσατε. Η εμπιστοσύνη κατάταξής σας επίσης αυξάνεται, καθώς τώρα έχουμε περισσότερα δεδομένα.",
  "new_frontiers_matchmaking_details_old_title": "ΑΝΕΠΙΘΥΜΗΤΗ ΣΥΓΚΕΝΤΡΩΣΗ: ΤΟ ΧΕΙΡΟΤΕΡΟ ΕΙΔΟΣ ΣΥΓΚΕΝΤΡΩΣΗΣ",
  "new_frontiers_matchmaking_details_old_desc": "Το Dota χρησιμοποιούσε παραδοσιακά μια τροποποιημένη έκδοση του αλγόριθμου Elo για να ενσωματώσει αλλαγές κατάταξης και εμπιστοσύνης κατάταξης. Αλλά με τον καιρό παρατηρήσαμε μερικά προβλήματα με την προσέγγισή μας. Για παράδειγμα, η κατανομή των MMR μετατοπίστηκε σταδιακά χαμηλά, προκαλώντας μια ανεπιθύμητη συγκέντρωση στο εύρος MMR από 0 έως 1000. Ένα άλλο πρόβλημα ήταν ότι οι παίκτες που έκαναν ένα διάλειμμα και επέστρεφαν δυσκολεύονταν να επιστρέψουν σε ένα ακριβές MMR, επειδή το προηγούμενο επίπεδο ικανοτήτων τους δεν ήταν πλέον αντιπροσωπευτικό.",
  "new_frontiers_matchmaking_details_new_title": "ΝΕΑ ΚΑΙ ΒΕΛΤΙΩΜΕΝΗ ΣΥΓΚΕΝΤΡΩΣΗ",
  "new_frontiers_matchmaking_details_new_desc": "Για να το διευθετήσουμε αυτό, αλλάζουμε σε έναν διαφορετικό αλγόριθμο που ονομάζεται Glicko, που θα πρέπει να σας επιτρέψει να βρίσκετε παιχνίδια με άλλους παίκτες με παρόμοιο επίπεδο ικανοτήτων γρήγορα και με ακρίβεια. Από μαθηματική πλευρά, το Glicko μάς επιτρέπει να υπολογίσουμε καλύτερα την εμπιστοσύνη κατάταξης ενός παίκτη στους υπολογισμούς μας, με αποτέλεσμα πιο ακριβείς αποφάσεις σχετικά με κέρδη και απώλειες κατάταξης.\\n\\nΗ εναλλαγή στο νέο σύστημα εύρεσης παιχνιδιού θα έχει την αίσθηση μιας νέας σεζόν εύρεσης παιχνιδιού: [list][*]Όλοι οι παίκτες θα τοποθετηθούν ξανά σε μια σύντομη λειτουργία βαθμονόμησης, που θα έχει αρχικοποιηθεί από την προηγούμενη κατάταξή τους.\\n[*]Η βαθμονόμηση δεν απαιτεί πλέον έναν σταθερό αριθμό αγώνων. Αντ' αυτού ένας παίκτης θεωρείται βαθμονομημένος όποτε η εμπιστοσύνη κατάταξής του είναι πάνω από ένα συγκεκριμένο όριο.\\n[*]Με το πέρας της βαθμονόμησης, είναι πιθανό να καταλήξετε με ένα διαφορετικό μετάλλιο από αυτό που είχατε πριν. Ωστόσο, ακόμα και αν το μετάλλιό σας αλλάξει σημαντικά, θα πρέπει να αναμένετε να βρείτε αγώνες με παίκτες παρόμοιου επιπέδου ικανοτήτων.\\n[*]Οι αγώνες δεν έχουν πλέον σταθερό κέρδος/απώλεια MMR. Θα μεταβάλλεται βάσει ενός αριθμού παραγόντων, συμπεριλαμβανομένων των τιμών κατάταξης και εμπιστοσύνης κατάταξης των συμμετεχόντων. Ωστόσο, θα περιορίσουμε το κέρδος/απώλεια ανά αγώνα για να αποτρέψουμε ιδιαίτερα αρνητικές εκβάσεις.[*]Η εμπιστοσύνη κατάταξης ενός παίκτη θα φθίνει σιγά σιγά με τον πέρασμα του χρόνου, αν ο παίκτης δεν παίζει αγώνες.[/list]Εδώ και λίγο καιρό λειτουργούσαμε στο παρασκήνιο ταυτόχρονα και τα δύο συστήματα για να σιγουρευτούμε για αυτές τις αλλαγές. Καταλαβαίνουμε ότι το ακριβές MMR είναι μόλις ένας από τους πολλούς παράγοντες που επηρεάζουν την ποιότητα αγώνα και, όπως και για όλες τις αλλαγές σε αυτό το πεδίο, μας ενδιαφέρει να ακούσουμε την ανατροφοδότησή σας.",
  "new_frontiers_matchmaking_immortals_title": "ΕΥΡΕΣΗ ΠΑΙΧΝΙΔΙΟΥ IMMORTAL",
  "new_frontiers_matchmaking_immortals_desc": "Στη βαθμίδα Immortal, είναι πιο σημαντικό να γνωρίζετε τους άλλους παίκτες, να τα πάτε καλά μαζί τους και να επιλέγετε μια καλή ισορροπία ρόλων παρά απλά το MMR. Οπότε ανασχεδιάσαμε την εύρεση παιχνιδιού στο επίπεδο Immortal για να τα λάβει υπόψιν.<br><br>Οι αγώνες στις κατατάξεις Immortal δεν θα χρησιμοποιούν πλέον προκατασκευασμένες ομάδες. Πλέον, δύο αρχηγοί θα επιλέγουν τους άλλους οκτώ παίκτες σε κάθε ομάδα, που θα κάνουν την ομάδα πιο αποτελεσματική από ό,τι αν βασιζόμασταν απλά στο MMR για να καθορίσει τα ρόστερ. Οπότε, αν ο αγώνας σας είναι χάλια τώρα, δεν μπορείτε να κατηγορήσετε κανέναν άλλον παρά τους εαυτούς σας, παίκτες Immortal.",
  "new_frontiers_ui_desc": "Δεν βλέπετε καλά και πονάει όλο σας το χέρι; Σας συμβουλεύουμε να το αγνοήσετε. Αυτός είναι απλά ο τρόπος του σώματός σας να λέει ότι πεινάει. Πάθατε λάστιχο; Οδηγήστε πάνω στον τροχό, κι αυτός κυκλικός είναι. Το θέμα είναι: μπορείτε να αγνοήσετε σχεδόν τα πάντα στη ζωή χωρίς συνέπειες.<br><br>Εκτός από τις μπάρες ζωής στο Dota. Αυτές είναι σημαντικές. Για αυτόν το λόγο, οι πληροφορίες διεπαφής σχετικά με τη ζωή αναβαθμίστηκαν σημαντικά με αυτήν την ενημέρωση.",
  "new_frontiers_ui_shields_title": "ΦΡΑΓΜΑΤΑ ΜΠΑΡΑΣ ΖΩΗΣ",
  "new_frontiers_ui_shields_desc": "Γνωρίζατε ότι το Dota έχει ασπίδες; Μαγικές ασπίδες, φυσικές ασπίδες, αφωτικές ασπίδες. Κάθε είδους ασπίδα! Ίσως να μην έπεσαν στο μάτι σας. Ή κυρίως να τις αγνοήσατε. Επειδή κυρίως δεν υπάρχει τρόπος να γνωρίζετε με πόση ασπίδα ξεκινήσατε και πόση σας απέμεινε.<br><br>Αλλά αυτή η σκοτεινή εποχή αβεβαιότητας τελειώνει σήμερα. Τώρα θα βλέπετε τα πάντα. Ή τουλάχιστον και τα δύο από αυτά τα δύο πράγματα. Θα μπορείτε ακόμα να δείτε τι είδους ασπίδα είναι. Για να γιορτάσουμε το πόσο καλύτερες είναι όλες αυτές οι παλιές ασπίδες με αυτήν την οπτική αναβάθμιση, προσθέσαμε ένα σωρό ικανότητες που τις διαθέτουν.<br><br>Επίσης, τις μετονομάσαμε όλες από Ασπίδες σε Φράγματα, ώστε να μην μπερδευτείτε και νομίζετε ότι υπάρχει ένα Vanguard στην μπάρα ζωής σας. Δεν κάνει τίποτα.",
  "new_frontiers_ui_health_pips_title": "ΕΝΔΕΙΞΕΙΣ ΜΠΑΡΑΣ ΖΩΗΣ",
  "new_frontiers_ui_health_pips_desc": "Μερικές μονάδες δεν έχουν παραδοσιακά σύνολα ζωής και απαιτούν έναν συγκεκριμένο αριθμό επιθέσεων για να καταστραφούν. Τώρα, αντί για να μαντεύετε ή να κάνετε υπολογισμούς επιπέδου ιδιοφυΐας στο κεφάλι σας, μπορείτε απλά να κοιτάξετε τη μονάδα που θέλετε να δολοφονήσετε. Θα εμφανίζονται εύχρηστες μικρές ενδείξεις που αντιπροσωπεύουν τον αριθμό χτυπημάτων που μπορούν να λάβουν πριν αποδημήσουν σε μέρη εξωτικά.",
  "new_frontiers_ui_health_cost_title": "ΚΟΣΤΟΣ ΖΩΗΣ",
  "new_frontiers_ui_health_cost_desc": "Αν και οι περισσότερες ικανότητες στο Dota καταναλώνουν ενέργεια, κάποιες καταναλώνουν ζωή. Αυτές οι ικανότητες εμφανίζουν όντως το κόστος ζωής για την εκτέλεσή τους. Καθόλου κακό, έτσι; Βασικά, είναι κάπως τρελό που κανένας δεν σκέφτηκε να το προσθέσει. Τέλος πάντων, τώρα είναι εκεί.",
  "new_frontiers_gameplay_update_desc": "Η λίστα των πραγμάτων παραπάνω είναι τεράστια. Το μόνο πράγμα που θα μπορούσε να είναι καλύτερο θα ήταν [i]δύο[/i] τεράστιες λίστες πραγμάτων, αλλά πού θα βρούμε [i]ωπ για δείτε εδώ![/i] Συνεχίστε να διαβάζετε για να δείτε όλες τις άλλες αλλαγές ισορροπίας που επιφυλάσσει αυτή η ενημέρωση. Ή απλά μπείτε στο παιχνίδι και παίξτε. Πιστέψτε μας, δεν χρειάζεται να μας εξηγήσετε πόσο διασκεδαστικό είναι να διαβάζει κανείς τεχνικά εγχειρίδια σχετικά με βιντεοπαιχνίδια, αλλά και το να τα παίζετε είναι σχεδόν το ίδιο διασκεδαστικό. Αυτή η λίστα θα είναι ακόμα εδώ όταν επιστρέψετε.",
  "new_frontiers_misc_title": "ΔΙΑΦΟΡΑ",
  "new_frontiers_misc_role_tokens": "Μειώσαμε τις μάρκες σειράς ρόλων που παρέχονται όταν χάνετε έναν αγώνα στον οποίο επιλέξατε όλους τους ρόλους. Πλέον, θα κερδίζετε δύο μάρκες για κάθε ήττα. Θα συνεχίσετε να λαμβάνετε τέσσερις μάρκες για κάθε νίκη. Αυτή η αλλαγή θα βοηθήσει στην εξομάλυνση της συμπεριφοράς των παικτών σε ρόλους κατάταξης, όπου η απόκτηση μαρκών είναι πιο σημαντική από την καλή εκτέλεση ενός ρόλου που σας έχει ανατεθεί.",
  "new_frontiers_misc_removed_roles": "Αφαιρέσαμε το Captains Mode από τους αγώνες κατάταξης, καθώς και τα All Random και All Random Deathmatch από τους απλούς αγώνες. Σχεδόν κανένας δεν παίζει αυτούς τους τύπους παιχνιδιού και ο χρόνος σειράς είναι συχνά πάνω από μία ώρα.",
  "new_frontiers_misc_model_editor": "Αυτή η ενημέρωση αφαιρεί τον παραδοσιακό επεξεργαστή μοντέλων. Όλα τα αρχεία vmdl θα φορτώνουν στο νέο εργαλείο και τα παλιά μοντέλα θα μετατρέπονται όταν τα φορτώνετε για πρώτη φορά στο εργαλείο. Θα ακολουθήσει άλλη ενημέρωση, η οποία θα καταργήσει τη φόρτωση της παλιάς μεταγλωττισμένης μορφής, οπότε προτείνουμε σε όλους τους δημιουργούς του εργαστηρίου να φορτώσουν και να μετατρέψουν τα μοντέλα τους στη νέα μορφή και να τα μεταγλωττίσουν ξανά το συντομότερο δυνατόν.",
  "new_frontiers_misc_hold_animation": "Δεν υποστηρίζεται πλέον το παραδοσιακό κλειδί «HoldAnimation» από τα δυναμικά αντικείμενα. Τα προσαρμοσμένα παιχνίδια θα χρειαστεί να χρησιμοποιήσουν το νέο κλειδί «loop mode» ή να μεταγλωττίσουν ξανά τους χάρτες τους ώστε να αναβαθμίσουν αυτόματα αυτές τις ιδιότητες.",
  "neutral_item_tier": "Ουδέτερο [b]Βαθμίδας %1$s[/b]",
  "dota_ability_variable_health": "Ζωή",
  "dota_ability_variable_mana": "Ενέργεια",
  "dota_ability_variable_armor": "Άμυνα",
  "dota_ability_variable_damage": "Ζημιά",
  "dota_ability_variable_str": "Δύναμη",
  "dota_ability_variable_int": "Ευφυΐα",
  "dota_ability_variable_agi": "Σβελτάδα",
  "dota_ability_variable_all": "Όλα τα χαρακτηριστικά",
  "dota_ability_variable_primary_attribute": "Κύριο χαρακτηριστικό",
  "dota_ability_variable_attack": "Ταχύτητα επίθεσης",
  "dota_ability_variable_hp_regen": "Αναπλήρωση ζωής",
  "dota_ability_variable_lifesteal": "Κλοπή ζωής",
  "dota_ability_variable_mana_regen": "Αναπλήρωση ενέργειας",
  "dota_ability_variable_mana_regen_aura": "Αύρα αναπλήρωσης ενέργειας",
  "dota_ability_variable_spell_amp": "Ζημιά ξορκιών",
  "dota_ability_variable_debuff_amp": "Μείωση απομειώσεων",
  "dota_ability_variable_move_speed": "Ταχύτητα κίνησης",
  "dota_ability_variable_evasion": "Αποφυγή",
  "dota_ability_variable_spell_resist": "Μαγική αντίσταση",
  "dota_ability_variable_spell_lifesteal": "Κλοπή ζωής ξορκιών",
  "dota_ability_variable_spell_lifesteal_creep": "Κλοπή ζωής ξορκιών (Κριπάκια)",
  "dota_ability_variable_spell_lifesteal_hero": "Κλοπή ζωής ξορκιών (Ήρωες)",
  "dota_ability_variable_selected_attrib": "Επιλεγμένο χαρακτηριστικό",
  "dota_ability_variable_attack_range": "Βεληνεκές επίθεσης <font color='#7d7d7d'>(Μόνο τηλέμαχοι)</font>",
  "dota_ability_variable_attack_range_melee": "Βεληνεκές επίθεσης <font color='#7d7d7d'>(Μόνο αγχέμαχοι)</font>",
  "dota_ability_variable_cast_range": "Βεληνεκές εκτέλεσης",
  "dota_ability_variable_status_resist": "Αντίσταση κατάστασης",
  "dota_ability_variable_projectile_speed": "Ταχύτητα βλήματος",
  "dota_ability_variable_manacost_reduction": "Μείωση κόστους ενέργειας",
  "dota_ability_variable_cooldown_reduction": "Μείωση επαναφορτίσεων",
  "dota_ability_variable_max_mana_percentage": "Επιπλέον μέγιστη ενέργεια",
  "dota_ability_variable_aoe_bonus": "επιπλέον περιοχή επίδρασης"
}