// 1857.js

{
  "language": "swedish",
  "new_frontiers_gameplay_number": "Speluppdatering 7.33",
  "new_frontiers_title": "Uppdateringen New Frontiers",
  "new_frontiers_title_short": "New Frontiers",
  "new_frontiers_subtitle": "En ny karta, stora speländringar och så mycket mer. Upptäck en helt ny värld.",
  "new_frontiers_play_trailer": "Titta på trailern",
  "new_frontiers_dota_team_intro": "Den nya uppdateringen New Frontiers innehåller en ny karta, stora speländringar, ändringar av matchning och användargränssnitt och – vi skojar inte – så mycket mer!<br><br> Hur mycket mer? Så mycket att det blev svårt att komma ihåg allt. Det orsakade panik under ett par dagar, tills någon kom på att vi skulle kunna skriva ner det hela. Så då gjorde vi det. Nu kan vi läsa det när vi vill. Och du med! Skrolla vidare för att fortsätta läsningen.",
  "new_frontiers_eldor_name": "Magikern Eldor",
  "new_frontiers_dota_team_name": "Dota-teamet",
  "new_frontiers_section_title_map": "Ny karta",
  "new_frontiers_section_title_major_gameplay": "Stora speländringar",
  "new_frontiers_section_title_matchmaking": "Matchning",
  "new_frontiers_section_title_ui": "Användargränssnitt",
  "new_frontiers_section_title_gameplay_update": "Balansändringar",
  "new_frontiers_map_introduction": "Dota-kartan har utökats rejält. Huvudmålet i spelet är detsamma – vägarna har samma avstånd och allt som behövs för att vinna finns fortfarande i mitten av kartan.<br><br>Men med 40 % mer terräng finns det utrymme att skörda nya resurser och upptäcka nya strategier. De båda centrala djunglerna har också omorganiserats helt och därmed förändrat sikten, fintmöjligheterna, farmandet och mer.",
  "new_frontiers_map_subtitle": "Utforska den nya världen",
  "new_frontiers_map_roshan_title": "Roshans nya tillhåll",
  "new_frontiers_map_roshan_desc": "Roshan sålde sin gamla grop vid älven och drar nytta av all den nya marken. Han har nu [i]två[/i] nya fantastiska gropar i det nordvästra och sydöstra hörnet av kartan. Det är rena rama paradiset för alla gropälskare, med en grann utsikt över fontänerna och bara ett stenkast från de hemliga butikerna.<br><br>Det tycks också finnas ett gym i området, för Roshan är biffigare än någonsin. Roshan droppar inte längre Aghanim's Shard, men däremot Cheese vid sin andra död istället för vid den tredje. Vid hans tredje död droppas en Refresher Shard eller en Scepter, beroende på om han befinner sig i den norra eller södra gropen.",
  "new_frontiers_map_twin_gates_title": "Tvillingportar",
  "new_frontiers_map_twin_gates_desc": "Två portar förbinder den nya kartans hörn nära tornen vid den säkra vägen, vilket gör att spelare kan teleportera sig direkt från ena kanten av kartan till den andra.<br><br>Det är en förändring av spelupplägget, men påverkar uppenbarligen bakgrundshistorien. Du gissade rätt: Dota 2 är nu inofficiellt en del av PMUU (Pac-Mans utökade universum).",
  "new_frontiers_map_lotus_pools_title": "Lotusdammar",
  "new_frontiers_map_lotus_pools_desc": "Spelare kan nu hitta lotusdammar på vänster och höger sida av kartan (i närheten av där creepvågor först möts). De producerar då och då en frukt som ger mana och hälsa när man äter den.<br><br>Spelare kan samla frukterna och kombinera dem till en ännu större och kraftfullare frukt senare. Dessa större frukter kan i sin tur kombineras till en [i]otroligt[/i] stor frukt. Vad händer om du gör detsamma med de [i]otroligt[/i] stora frukterna? Antagligen ingenting (helt säkert någonting).",
  "new_frontiers_map_tormentors_title": "Tormentors",
  "new_frontiers_map_tormentors_desc": "Dessa två kraftfulla neutrala creeps spawnas nära varje bas efter 20 min, och båda har ett överflöd av Aghanim's Shards. Men det finns en hake, och haken är att det finns två hakar: 1) Tomentors är utrustade med megasköldar som reflekterar den mesta av den skada du utdelar. 2) De blir starkare varje gång du dödar dem. Så det krävs antagligen hela laget för att slå ut dem.<br><br> Den goda nyheten är att de lämnar dig ifred om du lämnar dem ifred.",
  "new_frontiers_map_watchers_title": "Watchers",
  "new_frontiers_map_watchers_desc": "Watchers är som Terminators, men används till övervakning. De är skoningslösa. De vet inte vad smärta eller rädsla är. Men de är lata. De håller inte koll förrän du klickar på dem. <br><br>Watchers är inledningsvis inaktiva och neutrala, men när de aktiveras ger de sikt i området under sju minuter – eller tills fienden saboterar det hela och tillfälligt inaktiverar dem. Alla Watchers går över till den sida som dödar Roshan.",
  "new_frontiers_map_barriers_title": "Försvarsport",
  "new_frontiers_map_barriers_desc": "Försvarsporten kombinerar Dotas skinande fantasivärld med något så praktiskt som en husdörr som du kan låsa när du går till affären för att förstöra dess Ancient. Det är en bakdörr till basen med ett praktiskt kraftfält som släpper igenom ditt lag och lämnar fienden utanför. När fienden attackerar framsidan kan du smyga in och ut via baksidan.",
  "new_frontiers_map_wisdom_runes_title": "Visdomsrunor",
  "new_frontiers_map_wisdom_runes_desc": "Utforska utkanterna av kartan för att hitta visdomsrunor som ger XP-boost till den hjälte klok nog att stjäla en. Visdomsrunor spawnas nära basen, och erbjuder en fördel när matcher håller på att gå utför.",
  "new_frontiers_map_shield_runes_title": "Sköldrunor",
  "new_frontiers_map_shield_runes_desc": "Flodrunor får också ett tillskott med den nya sköldrunan som ger 50 % av din max-HP som en barriär. Kasta dig in under ett torn för att få ett kill tidigt i matchen – eller gå upp för en kulle utan sikt för att överraska både dig själv och fiendelaget.",
  "new_frontiers_map_named_regions_title": "Namngivna områden",
  "new_frontiers_map_named_regions_desc": "Den utökade kartan har nu särskilda områden såsom Gruvorna, Brunnen, Gravplatsen och Statyn, vilket gör det lättare att meddela sina lagkamrater exakt var man är i färde att bli dödad. Alla enheter i dessa områden får områdesspecifika modifikationer.",
  "new_frontiers_map_creep_camps_title": "12 nya creepläger",
  "new_frontiers_map_creep_camps_desc": "Några av creepsen tröttnade på att hela tiden bli slaktade i djungeln och har därför etablerat 12 nya läger utspridda över den utökade kartan. Så nu har du fler platser att slakta dem på.",
  "new_frontiers_map_outpost_title": "Nya utposter",
  "new_frontiers_map_outpost_desc": "Den nya utökade kartan har två nya utposter. De ursprungliga utposterna har flyttats till nya platser, vilket kan få en att undra om de verkligen är de ursprungliga utposterna. Bra försök, Sokrates: De är det.",
  "new_frontiers_major_gameplay_features_desc": "Uppdateringen New Frontiers innebär stora ändringar av dina favorithjältar och -system. Vår juridiska avdelning har faktiskt rekommenderat oss att informera om att spelsektionen är [i]så fullsmockad[/i] med metadefinierade nya funktioner att du bör ta dig igenom dem långsamt under kommande veckor, så att du inte blir överstimulerad och måste ringa räddningstjänsten.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Hjältehöjdpunkter",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Alla hjältar har balanserats, men vissa mer än andra. Vi nämner några av dem här.",
  "new_frontiers_major_gameplay_new_items_title": "Nya föremål",
  "new_frontiers_major_gameplay_new_items_desc": "För alla behov.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Nya neutrala föremål",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Vi tillför sju helt nya neutrala föremål, och återför några gamla favoriter.",
  "new_frontiers_major_gameplay_bkb_title": "Omarbetad Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Vid aktivering av Black King Bar tillförs nu en grundläggande dispel, samt 50 % magiresistens och debuffimmunitet. Negativa effekter från en debuff påverkar inte dig så länge den är aktiv. Dessutom blir du immun mot ren och reflekterad skada.<br><br>Men var försiktig: Om Black King Bar upphör att gälla innan en debuffs varaktighet, appliceras debuffen under den kvarvarande varaktigheten. Effekter som går igenom magisk immunitet går också igenom debuffimmunitet.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Ny attributtyp för hjältar",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Void Spirit, den fjärde av de andliga bröderna, borde inte blivit vare sig en styrke-, agility-, eller intelligenshjälte. Han borde ha blivit en ny slags hjälte, för att särskilja sig från de andra. En [i]fjärde[/i] typ av hjälte.<br><br>Vi introducerar universalhjältar – en ny hjältetyp bestående av existerande hjältar som får 0,6 skada från alla attribut. Våra ingenjörer försäkrar oss om att denna siffra är alldeles perfekt balanserad. Ifall den inte är det. Men den goda nyheten är att vi kommer upptäcka det alla tillsammans under det storslagna äventyret uppdateringen New Frontiers medför.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Omarbetade neutrala föremålsdrops",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Att dräpa skogsvarelser brukade betyda att du fick ett nytt, häftigt föremål – som vanligen gavs bort till lagets carry som vanligen inte var du. Nu när du tar död på ett neutralt creep kan du ibland få en pollett som låter dig välja bland [i]fem[/i] tillgängliga neutrala föremål. Varje pollett erbjuder ett utbud av fem alternativ, så även den allra sista spelaren som löser in sin pollett får något bra.<br><br>Lag kan ge polletter till vem som helst, men när du väl har valt ett föremål kan det inte delas, så fördela era polletter på ett förnuftigt sätt.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Skalning av neutrala creeps",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Neutrala creeps och deras förmågor skalas nu med tiden. Det stämmer att läger blir svårare att rensa under spelets gång, men hjältar med förmågan att kontrollera creeps kommer att ha ordentlig support.",
  "new_frontiers_major_gameplay_kill_formula_title": "Omarbetad kill-formel",
  "new_frontiers_major_gameplay_kill_formula_desc": "Vi har omarbetat kill-formeln för att göra kills mer slagkraftiga tidigt i spelet och för att motivera spelare att ganka andra vägar. Vi har också minskat guldskalning för lanecreeps, vilket gör att farmande av creeps blir mindre lönsamt senare i spelet, och spelare uppmuntras till att slå guldet ur varandra istället.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Utan bedövning",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Att spela sin hjälte är alltid roligare än att inte spela sin hjälte. Alla som är fans av spelande och kritiska till icke-spelande: era drömmar har blivit verklighet! Gör dig redo att spela din hjälte mer än någonsin tidigare.<br><br>Du undrar hur? Lätt. Vi minskade varaktigheten för nästan varje inaktiveringsförmåga i spelet. Hur kom vi på den här galna idén? Ännu lättare att svara. Vi fick Beastmasters Roar rätt upp i ansiktet och plötsligt hade vi mycket tid att tänka.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Efter att ha hemsökt vägarna i två månader har Muerta äntligen hittat Aghanim’s Scepter och Shard. Om du inte har kollat in henne än, läs mer på [url=https://www.dota2.com/deadreckoning]Dead Reckoning-sidan[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi är för dum för att vara en intelligenshjälte. Så han är inte det längre.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa börjar lika svag som en bebis, men likt en bebis blir hon starkare med tiden.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "De flesta av Clinkz förmågor skapar nu läskiga skelett.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden brukade skapa en perfekt klon av sig själv, men nu skapar han en [i]bättre[/i] version av sig själv! Eller en värre! Hur som helst, den är annorlunda. Och helt okontroversiell, inbillar vi oss.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Hjälten Alchemist, precis som alla Alchemist-spelare, är nu girig i sin natur.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ARC WARDEN – TIDSBEGRÄNSAD BONUS",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Under en begränsad tid kommer Tempest Double att vara huvudhjälten – och användning av hans ultimata förmåga framkallar hans ”normala” jag – när du väljer att spela Arc Warden som Dire.",
  "new_frontiers_matchmaking_desc": "Låt oss vara helt ärliga här: Det finns åtta miljarder människor på jorden och 99,99 % är helt kassa på Dota. Det betyder att matchning kan vara en utmaning, särskilt om du är bra på Dota och gillar att spela med människor som är nästan men förhoppningsvis inte precis lika bra på Dota som du är. Vi har utfört en hel del arbete och matematiska uträkningar för att allmänt förbättra kvaliteten på vår matchning för spelare på alla nivåer.",
  "new_frontiers_matchmaking_intro_title": "Pålitlig matchning",
  "new_frontiers_matchmaking_intro_desc": "Matchningsrang (MMR) består egentligen bara av två siffror: rang och rangpålitlighet. Din rang är en uppskattning av din skicklighet och din rangpålitlighet är vårt förtroende för den uppskattningen. När du spelar en match justerar vi din rang baserat på om du vinner eller förlorar. Din rangpålitlighet går också upp, för nu har vi mer data.",
  "new_frontiers_matchmaking_details_old_title": "Oönskade klumpar: den värsta typen av klump",
  "new_frontiers_matchmaking_details_old_desc": "Dota har traditionellt använt en modifierad version av Elo-algoritmen för att implementera förändringar av rang och rangpålitlighet. Med tiden har vi dock märkt några problem med detta tillvägagångssätt. Exempelvis har fördelningen av MMR gradvis flyttat sig lägre ner, vilket orsakar en oönskad klump vid 0–1000 MMR. Ett annat problem var att spelare som tog en paus och återvände hade svårt att komma tillbaka till korrekt MMR eftersom deras tidigare skicklighetsnivå inte längre var representativ.",
  "new_frontiers_matchmaking_details_new_title": "Ny och förbättrad algoritm",
  "new_frontiers_matchmaking_details_new_desc": "För att komma till rätta med detta byter vi till en annan algoritm, Glicko, som matchar dig snabbt och exakt med andra spelare på liknande skicklighetsnivå. På den matematiska sidan låter Glicko oss bättre inkludera en spelares rangpålitlighet i våra beräkningar, vilket resulterar i mer exakta beslut om ökning och minskning av rang.\\n\\nBytet till vårt nya matchningssystem kommer att kännas lite som början på en ny matchningssäsong: [list][*]Alla spelare placeras i ett kort kalibreringsläge utifrån deras tidigare rang.\\n[*]Kalibrering är inte längre ett fast antal matchningar. Istället anses en spelare vara kalibrerad när hens rangpålitlighet ligger över en viss tröskel.\\n[*]Vid kalibreringen får du troligtvis en annan medalj än den du hade tidigare. Men även om din medalj förändras avsevärt blir du matchad med spelare med liknande skicklighetsnivå.\\n[*] Matcher kommer inte längre att ha fast vinst/förlust av MMR. Detta varierar istället baserat på ett antal faktorer, inklusive deltagarnas rang och pålitlighet. Vi begränsar dock vinst/förlust per match för att förhindra särskilt negativa resultat.[*]En spelares rangpålitlighet sänks sakta över tid om spelaren inte spelar matcher.[/list]Vi har kört båda matchningssystemen samtidigt bakom kulisserna ett tag nu för att hjälpa oss att bygga upp förtroende för dessa förändringar. Vi förstår att korrekt MMR bara är en av många faktorer som påverkar matchningskvaliteten, och som alltid är vi intresserade av att höra er feedback.",
  "new_frontiers_matchmaking_immortals_title": "Immortal-matchning",
  "new_frontiers_matchmaking_immortals_desc": "Vid rangen Immortal är det viktigare att känna de andra spelarna, samarbeta och ha en bra rollbalans, än bara MMR. Vi har därför gjort om matchning på Immortal-nivå för att ta hänsyn till detta.<br><br>Matcher på Immortal-nivå använder inte längre fördefinierade lag. Istället väljer två kaptener de andra åtta spelarna i varje lag, vilket gör det mer slagkraftigt än om man enbart hade litat på MMR för att sätta ihop laguppställningen. Så om en match suger nu har ni bara er själva att skylla.",
  "new_frontiers_ui_desc": "Ser du suddigt och har smärta som strålar ut i armen? Vårt råd är att strunta i det, det är bara kroppens sätt att säga till att den är lite hungrig. Har du fått punktering på däcket? Kör på fälgen, den är fortfarande rund. Vår poäng är: man kan tryggt ignorera i stort sett allt i livet utan att det får konsekvenser.<br><br>Förutom Dotas hälsomätare. Den är viktig. Det är därför som en massa HP-relaterad gränssnittsinformation får en rejäl uppgradering med den här uppdateringen.",
  "new_frontiers_ui_shields_title": "Barriärer på hälsomätaren",
  "new_frontiers_ui_shields_desc": "Visste du att det finns sköldar i Dota? Magiska sköldar, fysiska sköldar, afotiska sköldar. Alla möjliga sköldar! Du kanske har missat det. Eller mest ignorerat det. För det fanns inget sätt att veta hur mycket sköld du började med eller hur mycket du hade kvar.<br><br>Men osäkerhetens mörka tidsåldern tar slut idag. Nu kan du se allt. Eller åtminstone dessa två saker. Du kan till och med se vilken typ av sköld det är. För att fira hur mycket bättre alla dessa gamla sköldar är med den här visuella uppgraderingen har vi lagt till ett gäng nya förmågor med sköldar.<br><br>Vi har också döpt om dem från sköldar till barriärer, så att du inte blir förvirrad och tror att det finns en Vanguard på din hälsomätare. Varsågod.",
  "new_frontiers_ui_health_pips_title": "Indikatorer på hälsomätaren",
  "new_frontiers_ui_health_pips_desc": "Vissa enheter har inte typiska HP-pooler och kräver ett visst antal attacker för att förstöra dem. Istället för att gissa eller utföra geniala beräkningar, kan du nu helt enkelt titta på enheten som du vill ta kål på. Praktiska små indikatorer visas som representerar antalet träffar som behövs innan den lämnar jordelivet.",
  "new_frontiers_ui_health_cost_title": "HP-kostnad",
  "new_frontiers_ui_health_cost_desc": "En stor del av Dotas förmågor använder mana, men vissa använder HP. För den senare typen visas nu kostnaden i HP. Inte illa va? Det är galet att ingen har tänkt på det här tidigare. Men nu är det gjort.",
  "new_frontiers_gameplay_update_desc": "Det är en lång lista med saker där uppe. Det enda som möjligen skulle kunna vara bättre är [i]två[/i] långa listor med saker, men var kan vi ... [i]nämen, kolla in det här![/i] Läs vidare för information om alla andra balansförändringar som den här uppdateringen har i beredskap. Eller hoppa direkt in i spelet och spela. Vi vet hur roligt det är att läsa tekniska spelmanualer men att spela dem är nästan lika kul. Den här listan finns fortfarande kvar när du kommer tillbaka.",
  "new_frontiers_misc_title": "Övrigt",
  "new_frontiers_misc_role_tokens": "Vi har minskat antalet rollköpolletter som beviljas när man förlorar en match med alla roller valda. Nu tjänar du två polletter för en förlust (och fortfarande fyra polletter vid vinst). Denna förändring bör hjälpa till att förbättra spelarbeteendet, då införskaffning av polletter gavs prioritet istället för att spela en tilldelad roll effektivt.",
  "new_frontiers_misc_removed_roles": "Vi tog bort Captains Mode från rankade matcher och All Random och All Random Deathmatch från orankade matcher. Nästan ingen spelar dessa lägen och kötiderna överstiger ofta en timme.",
  "new_frontiers_misc_model_editor": "Den här uppdateringen tar bort den äldre modellredigeraren. Alla vmdl-filer läses nu in i det nya verktyget och gamla modeller konverteras när du läser in dem i verktyget för första gången. Vi kommer att släppa en efterföljande uppdatering för att helt ta bort stödet för inläsning av det gamla kompilerade formatet, så vi uppmuntrar alla Workshop-skapare att läsa in och konvertera sina modeller till det nya formatet och kompilera om dem så fort som möjligt.",
  "new_frontiers_misc_hold_animation": "Vi har tagit bort stödet för den gamla ”HoldAnimation”-nyckeln från dynamiska element. Anpassade spel måste manuellt byta till den nya ”loop mode”-nyckeln, eller kompilera om kartorna för att automatiskt uppdatera dessa egenskaper.",
  "neutral_item_tier": "[b]Nivå %1$s[/b] Neutralt föremål",
  "dota_ability_variable_health": "Hälsa",
  "dota_ability_variable_mana": "Mana",
  "dota_ability_variable_armor": "Skydd",
  "dota_ability_variable_damage": "Skada",
  "dota_ability_variable_str": "Styrka",
  "dota_ability_variable_int": "Intelligens",
  "dota_ability_variable_agi": "Agility",
  "dota_ability_variable_all": "Alla attribut",
  "dota_ability_variable_primary_attribute": "Primärt attribut",
  "dota_ability_variable_attack": "Attackhastighet",
  "dota_ability_variable_hp_regen": "HP-regeneration",
  "dota_ability_variable_lifesteal": "Livstjälande",
  "dota_ability_variable_mana_regen": "Manaregeneration",
  "dota_ability_variable_mana_regen_aura": "Manaregeneration (aura)",
  "dota_ability_variable_spell_amp": "Förmågeskada",
  "dota_ability_variable_debuff_amp": "Debuffvaraktighet",
  "dota_ability_variable_move_speed": "Förflyttningshastighet",
  "dota_ability_variable_evasion": "Undvikande",
  "dota_ability_variable_spell_resist": "Magiresistens",
  "dota_ability_variable_spell_lifesteal": "Magisk livstjälande",
  "dota_ability_variable_spell_lifesteal_creep": "Magisk livstjälande (creeps)",
  "dota_ability_variable_spell_lifesteal_hero": "Magisk livstjälande (hjältar)",
  "dota_ability_variable_selected_attrib": "Valt attribut",
  "dota_ability_variable_attack_range": "Attackräckvidd <font color='#7d7d7d'>(endast avståndskamp)</font>",
  "dota_ability_variable_attack_range_melee": "Attackräckvidd <font color='#7d7d7d'>(endast närstrid)</font>",
  "dota_ability_variable_cast_range": "Användningsräckvidd",
  "dota_ability_variable_status_resist": "Statusresistens",
  "dota_ability_variable_projectile_speed": "Projektilhastighet",
  "dota_ability_variable_manacost_reduction": "Manakostnadsreducering",
  "dota_ability_variable_cooldown_reduction": "Cooldownreducering",
  "dota_ability_variable_max_mana_percentage": "Max. manabonus",
  "dota_ability_variable_aoe_bonus": "AoE-bonus"
}