// 744.js

{
  "language": "brazilian",
  "new_frontiers_gameplay_number": "Atualização de jogabilidade 7.33",
  "new_frontiers_title": "Atualização das Novas Fronteiras",
  "new_frontiers_title_short": "Novas Fronteiras",
  "new_frontiers_subtitle": "Um novo mapa, grandes mudanças na jogabilidade e muito mais. É um mundo completamente novo.",
  "new_frontiers_play_trailer": "Assista ao trailer",
  "new_frontiers_dota_team_intro": "A Atualização das Novas Fronteiras vem com um novo mapa, grandes alterações de jogabilidade, alterações na criação de partidas e — sem brincadeira — muito, muito mais.<br><br>\"Mais quanto?\" Tanto, mas tanto, que era difícil lembrar de tudo, o que nos deixou alguns dias em pânico até alguém dar a ideia de anotar. Agora, podemos ler quando quisermos. E você também! Comece a rolar para saber mais.",
  "new_frontiers_eldor_name": "Eldor, o feiticeiro",
  "new_frontiers_dota_team_name": "A equipe do Dota",
  "new_frontiers_section_title_map": "Novo mapa",
  "new_frontiers_section_title_major_gameplay": "Grandes alterações na jogabilidade",
  "new_frontiers_section_title_matchmaking": "Criação de partidas",
  "new_frontiers_section_title_ui": "Interface do usuário",
  "new_frontiers_section_title_gameplay_update": "Alterações de equilíbrio",
  "new_frontiers_map_introduction": "O mapa do Dota foi expandido como nunca antes. O objetivo principal permanece o mesmo — as trilhas seguem do mesmo tamanho, e tudo que você precisa para vencer continua no centro do mapa.<br><br>Mas com mais 40% de terreno, há bastante espaço para colher novos recursos e descobrir novas estratégias. As florestas principais de ambas as equipes também foram redispostas, mudando o posicionamento de visão, rotas de fuga, acúmulo de ouro e mais.",
  "new_frontiers_map_subtitle": "Explore o novo mundo",
  "new_frontiers_map_roshan_title": "Os novos lares de Roshan",
  "new_frontiers_map_roshan_desc": "Roshan vendeu o seu antigo covil no rio e está tirando proveito dos seus feitos imobiliários. Agora, ele tem [i]dois[/i] covis fantásticos e novinhos em folha localizados no noroeste e sudeste do mapa, com vistas imperdíveis para as fontes e a minutos de distância das Lojas Secretas.<br><br>Aliás, também deve ter uma academia por perto — só isso explica Roshan estar ainda mais forte. E ele não larga mais Fragmentos de Aghanim, larga um Queijo a partir da segunda (e não terceira) morte, e larga um Fragmento Restaurador ou um Cetro de Aghanim a partir da terceira morte, dependendo se estiver no covil do norte ou do sul.",
  "new_frontiers_map_twin_gates_title": "Portais Gêmeos",
  "new_frontiers_map_twin_gates_desc": "Dois portais, que ficam próximos às torres da trilha segura, conectam as extremidades do mapa, permitindo que os jogadores se teletransportem instantaneamente de um canto do mapa ao outro.<br><br>Esta é uma alteração de jogabilidade, mas tem um impacto óbvio na história. Qual? Sim, esse mesmo: a partir de agora, o Dota 2 extraoficialmente faz parte do UEPM (Universo Expandido de Pac-Man).",
  "new_frontiers_map_lotus_pools_title": "Fontes de Lótus",
  "new_frontiers_map_lotus_pools_desc": "Agora, os jogadores podem achar Fontes de Lótus nas laterais do mapa (próximo do primeiro ponto de encontro das ondas de criaturas). Elas periodicamente dão frutos que, quando consumidos, restauram mana e vida.<br><br>É possível guardar mais de um Lótus e combiná-los em Lótus grandes e mais poderosos. É possível até mesmo combinar os Lótus grandes em Lótus [i]incrivelmente[/i] grandes. O que acontece ao combinar [i]esses[/i] Lótus? Provavelmente, nada. (Certamente, alguma coisa.)",
  "new_frontiers_map_tormentors_title": "Atormentadores",
  "new_frontiers_map_tormentors_desc": "Essas duas criaturas neutras poderosas nascem próximo a cada base aos 20 minutos de partida, com Fragmentos de Aghanim para dar. \"Tem alguma pegadinha?\" Duas: 1) Os Atormentadores possuem megaescudos, que refletem boa parte do dano que você causar a eles. 2) Eles ficam mais fortes sempre que renascerem. Então é uma boa ideia trazer a equipe toda para derrotá-los.<br><br>A boa notícia é que, assim como um urso ignora você para mutilar um alpinista, é só deixá-los em paz que eles deixarão você em paz.",
  "new_frontiers_map_watchers_title": "Vigias",
  "new_frontiers_map_watchers_desc": "Os Vigias são como os Exterminadores do Futuro, só que vigiam o presente. Eles são implacáveis. Eles não sentem dor. Eles não sentem medo. Mas são preguiçosos, e não vigiam até você clicá-los.<br><br>Os Vigias começam a partida desativados e neutros, mas quando ativados, concedem visão ao seu redor por sete minutos — a menos que os seus inimigos o desativem. Quando uma equipe matar Roshan, todos os Vigias trabalharão para ela.",
  "new_frontiers_map_barriers_title": "Portões do Defensor",
  "new_frontiers_map_barriers_desc": "O Portão do Defensor combina o lado fantástico do Dota com a praticidade da porta de casa, que você pode trancar sempre que vai ao mercado destruir o Ancestral de lá. É uma porta dos fundos da sua base com um campo de força conveniente que deixa a sua equipe passar, mas impede inimigos. Enquanto a equipe adversária estiver batendo na sua porta, é só dar meia-volta e pegá-los por trás.",
  "new_frontiers_map_wisdom_runes_title": "Runas de Sabedoria",
  "new_frontiers_map_wisdom_runes_desc": "Explore as extremidades do mapa para encontrar as Runas de Sabedoria, que concedem XP a qualquer herói esperto o suficiente para pegá-las. Há uma Runa de Sabedoria próximo de cada base, oferecendo uma forma mais segura de evitar que uma partida vá de mal a pior.",
  "new_frontiers_map_shield_runes_title": "Runas de Proteção",
  "new_frontiers_map_shield_runes_desc": "As Runas de Poder do rio também têm uma novidade: a resistente Runa de Proteção, que concede uma barreira com 50% da sua vida máxima. Vá além da torre inimiga para assegurar uma vítima nos primeiros minutos — ou suba uma colina sem visão para ver que surpresas aguardam lá (ou seja você a surpresa).",
  "new_frontiers_map_named_regions_title": "Regiões Nomeadas",
  "new_frontiers_map_named_regions_desc": "Agora, o mapa expandido apresenta regiões distintas, como As Minas, O Poço, O Cemitério e A Estátua, facilitando que a sua equipe saiba exatamente onde é que estão matando você. Todas as unidades nessas regiões ganham modificadores temáticos.",
  "new_frontiers_map_creep_camps_title": "12 novos acampamentos",
  "new_frontiers_map_creep_camps_desc": "Algumas criaturas ficaram cansadas de serem massacradas o tempo inteiro na floresta e estabeleceram 12 novos acampamentos pelo mapa expandido. Agora, você também pode massacrá-las por lá.",
  "new_frontiers_map_outpost_title": "Novos postos avançados",
  "new_frontiers_map_outpost_desc": "O novo mapa expandido conta com dois postos avançados novos. Os postos originais foram realocados, o que levanta a dúvida se eles realmente são os postos originais. Boa tentativa, Sócrates — eles são, sim.",
  "new_frontiers_major_gameplay_features_desc": "A Atualização das Novas Fronteiras vem com grandes alterações aos seus heróis e sistemas favoritos. Inclusive, o nosso departamento jurídico pediu para avisar que esta seção está [i]tão densamente recheada[/i] de novos recursos que afetarão o meta, que é recomendado que você leia aos poucos, mesmo que leve algumas semanas, para que não sofra de superestimulação e precise chamar os bombeiros.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Heróis em destaque",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Embora todos os heróis tenham sido reequilibrados, alguns — como os listados abaixo — foram mais reequilibrados que outros.",
  "new_frontiers_major_gameplay_new_items_title": "Novos itens",
  "new_frontiers_major_gameplay_new_items_desc": "Tire o Riki do bolso e comece a gastar de verdade!",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Novos itens neutros",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Colocamos sete itens neutros inéditos para jogo, e trouxemos de volta alguns favoritos de atualizações passadas.",
  "new_frontiers_major_gameplay_bkb_title": "Bastão Preto da Realeza reformulado",
  "new_frontiers_major_gameplay_bkb_desc": "Agora, ativar o Bastão Preto da Realeza aplica uma dissipação básica, e concede 50% de resistência mágica e imunidade a efeitos. Enquanto estiver ativo, efeitos negativos não afetarão você, e você terá imunidade a dano puro e refletido.<br><br>Mas cuidado: caso a imunidade do Bastão Preto da Realeza termine antes dos efeitos negativos, eles serão aplicados pelas suas durações restantes. Efeitos que ignoram imunidade a magias agora ignoram imunidade a efeitos.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Novo tipo de herói",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Como o quarto irmão espírito que lançamos, o Void Spirit não deveria ser um herói de Força, Agilidade ou Inteligência. Para se diferenciar dos demais, ele realmente deveria ter sido um novo tipo de herói. Um [i]quarto[/i] tipo.<br><br>Apresentando os heróis Universais — um novo grupo composto por heróis existentes que agora ganham 0,6 de dano por ponto de cada atributo. Os nossos engenheiros nos asseguraram que esse valor é perfeitamente equilibrado... até desequilibrar. A boa notícia é que descobriremos juntos na grande aventura que é a Atualização das Novas Fronteiras.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Reformulação da obtenção de itens neutros",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Antigamente, quem assassinava criaturas selvagens era recompensado com um item neutro bacana... que normalmente iria para o carregador da equipe... que não costuma ser você. Agora, você tem a chance de obter uma ficha ao matar uma criatura neutra, que pode ser trocada por um de [i]cinco[/i] itens neutros aleatórios. As opções não são compartilhadas, então o último jogador a trocar uma ficha não terá que ficar com as sobras.<br><br>É possível dar a ficha para qualquer um da equipe — mas os itens resgatados com as fichas não podem ser compartilhados, então usem-nas com sabedoria.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Criaturas neutras aprimoráveis",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Agora, as criaturas neutras e as suas habilidades são aprimoradas com o tempo. Sim, isso significa que não será tão fácil fazer a limpa com o andar da partida, mas heróis que podem controlar criaturas terão um reforço e tanto. ",
  "new_frontiers_major_gameplay_kill_formula_title": "Reformulação do cálculo de recompensas por vítima",
  "new_frontiers_major_gameplay_kill_formula_desc": "Reformulamos o cálculo de recompensas por vítima para que abates no início da partida tenham maior impacto e motivem os jogadores a emboscar outras trilhas. Também reduzimos a escala de ouro para criaturas de trilha, tornando-as menos lucrativas com o andar da partida — encorajando os jogadores a tirarem o ouro uns dos outros!",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Ficar parado é coisa do passado",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Sempre é mais divertido controlar o seu herói do que não poder controlar o seu herói. Se você concorda, temos uma notícia incrível: prepare-se para controlar o seu herói mais do que nunca.<br><br>Como? Fácil! Reduzimos a duração de praticamente todas as desativações do jogo. Como tivemos essa ideia maluca? Mais fácil ainda! Um Beastmaster simplesmente Rugiu na nossa cara, e de repente tivemos bastante tempo para pensar.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Após dois meses assombrando as trilhas, a Muerta enfim obteve um Cetro e um Fragmento de Aghanim. Não sabe de quem estamos falando? Conheça-a na página da [url=https://www.dota2.com/deadreckoning]Atualização da Retaliação Mortal[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi é burro demais para ser um herói de Inteligência. Então ele não é mais.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Agora, Medusa começa fraca como um bebê. Mas, assim como um bebê, ela pode ficar mais forte.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Agora, a maioria das habilidades de Clinkz, assim como as piores habilidades na vida, criam esqueletos.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "O Arc Warden costumava criar um clone perfeito de si mesmo. Agora, porém, ele cria uma versão [i]melhor[/i]! Ou pior! Enfim, uma versão diferente. E nada controversa (pelo menos é o que achamos).",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "O herói Alchemist, assim como todos os jogadores de Alchemist, agora é ganancioso por natureza.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "EFEITO LIMITADO DO ARC WARDEN",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Por tempo limitado, quando você escolhe o Arc Warden na equipe dos Temidos, a Duplicata Tempestuosa será o herói principal, e usar a Ultimate invocará a sua versão \"normal\".",
  "new_frontiers_matchmaking_desc": "Sejamos sinceros: há mais de oito bilhões de pessoas no planeta, e 99,99% delas são terríveis no Dota. Isso significa que a criação de partidas pode ser um desafio, especialmente se você é bom no Dota e gosta de jogar com pessoas que são quase (mas de preferência não) tão boas quanto você no jogo. Fizemos várias alterações e cálculos matemáticos para aprimorar a qualidade da criação de partidas, para todos os níveis de jogadores.",
  "new_frontiers_matchmaking_intro_title": "Criando partidas com confiança",
  "new_frontiers_matchmaking_intro_desc": "A avaliação da criação de partidas (MMR) é feita de apenas dois números: classificação e nível de confiança. A sua classificação é uma estimativa da sua habilidade, e o seu nível de confiança é o quanto essa estimativa é confiável. Quando você joga uma partida, ajustamos a sua classificação de acordo com o resultado da partida (vitória ou derrota). O seu nível de confiança também sobe, porque temos uma informação a mais.",
  "new_frontiers_matchmaking_details_old_title": "Aglomeração indesejada",
  "new_frontiers_matchmaking_details_old_desc": "Tradicionamente, o Dota tem usado uma versão modificada do algoritmo Elo para implementar mudanças na classificação e no nível de confiança. Porém, começamos a notar alguns problemas com essa abordagem com o tempo. Primeiro, a distribuição de MMRs foi graduamente pendendo para baixo, causando um agrupamento indesejado no intervalo de 0 a 1.000. Segundo, jogadores que tiravam férias do jogo e depois voltavam tinham dificuldade em obter um MMR preciso, pois o nível de habilidade anterior não era mais um valor fidedigno.",
  "new_frontiers_matchmaking_details_new_title": "Agrupamentos novos e aprimorados",
  "new_frontiers_matchmaking_details_new_desc": "Como solução, estamos trocando para um outro algoritmo, chamado Glicko, que deve colocar você em uma partida com outros jogadores de habilidade similar de forma rápida e precisa. Do lado matemático, o Glicko nos permite melhor considerar o nível de confiança na classificação do jogador nos nossos cálculos, resultando em decisões mais precisas de ganhos ou perdas de classificação.\\n\\nA troca para o nosso novo sistema de criação de partidas será semelhante ao início de uma nova temporada competitiva: [list][*]Todos os jogadores serão postos em uma calibração breve, baseada inicialmente na classificação anterior.\\n[*]A calibração não termina mais após uma quantidade predefinida de partidas. Agora, um jogador é considerado calibrado quando o nível de confiança estiver acima de um valor específico.\\n[*]Ao finalizar a calibração, é provável que receberá uma medalha diferente da que tinha antes. Contudo, mesmo se tiver um salto ou queda significativa, você ainda será posto em partidas com jogadores de habilidade similar.\\n[*]As partidas não terão mais uma variação fixa de MMR. A variação será determinada com base em diversos fatores, incluindo a classificação e o nível de confiança nas classificações dos participantes. Contudo, haverá uma variação máxima para evitar casos extremos.[*]O nível de confiança na classificação cairá com o tempo caso não jogue partidas.[/list]Temos executado ambos os sistemas de criação de partida concomitantemente nos últimos meses para que as alterações sejam feitas com confiança. Compreendemos que um MMR preciso é apenas um de vários fatores que afetam a qualidade das partidas e, como todas as alterações do tipo, temos interesse em ouvir os seus comentários.",
  "new_frontiers_matchmaking_immortals_title": "Criação de partidas Imortais",
  "new_frontiers_matchmaking_immortals_desc": "Na medalha Imortal, conhecer os outros jogadores, dar-se bem com eles e escolher um bom equilíbrio de funções é mais importante que apenas o MMR. Portanto, refizemos a criação de partidas nesse nível apropriadamente.<br><br>A partir de agora, partidas entre Imortais não terão mais equipes formadas automaticamente. Em vez disso, dois jogadores virarão os capitães de cada equipe, e revezarão para escolher dentre os outros oito, fazendo com que a sua equipe tenha maior qualidade do que se fosse montada apenas segundo o MMR. Portanto, Imortais, se as suas partidas não terminarem bem a partir de agora, a culpa é de vocês.",
  "new_frontiers_ui_desc": "Visão borrada e dores agudas no braço? O nosso conselho é que ignore esses sintomas — é só o seu corpo dizendo que está com fome. O pneu furou? É só usar o aro — ele também é redondo, afinal. O que queremos dizer é que praticamente tudo na vida pode ser ignorado sem consequências graves.<br><br>Menos as barras de vida no Dota. Elas são importantíssimas. Por isso, vários elementos de interface relacionados à vida estão sendo aperfeiçoados nesta atualização.",
  "new_frontiers_ui_shields_title": "Barreiras na barra de vida",
  "new_frontiers_ui_shields_desc": "Você sabia que Dota tem escudos? Escudos mágicos, escudos físicos, escudos afóticos... O que não falta é escudo! Mas talvez não tenha percebido ou tenha decidido ignorá-los, já que não havia como saber quanto de escudo você havia obtido ou quanto ainda restava.<br><br>Mas os tempos sombrios da falta de informação acabam hoje. Agora, você pode ver tudo. Ou pelo menos as duas coisas que citamos. Dá até para ver o tipo do escudo! Em comemoração a esse aprimoramento visual aos bons e velhos escudos, adicionamos várias habilidades novas que os concedem.<br><br>Aproveitamos e renomeamos os \"escudos\" para \"barreiras\", assim ninguém fica achando que tem uma Vanguarda na barra de vida. De nada!",
  "new_frontiers_ui_health_pips_title": "Barrinhas de vida",
  "new_frontiers_ui_health_pips_desc": "Algumas unidades não têm valores de vida tradicionais e são destruídas após uma quantidade específica de ataques. Agora, em vez de tentar adivinhar ou — se for doutor em matemática — [i]contar[/i], basta olhar para a unidade que você deseja assassinar. Acima dela, haverá pequenas barrinhas, que representam quantos ataques restam até que os vermes possam roer as suas frias carnes (citação póstuma da barra de vida de Brás Cubas).",
  "new_frontiers_ui_health_cost_title": "Custo de vida",
  "new_frontiers_ui_health_cost_desc": "Embora a maioria das habilidades do Dota consuma mana, algumas consomem vida. Agora, essas habilidades exibem o quanto de vida elas custam para serem usadas. Nada mal, concorda? Aliás, como ninguém pensou em fazer isso antes? Não importa, antes tarde do que nunca.",
  "new_frontiers_gameplay_update_desc": "Caramba, que listão! A única coisa melhor que um listão são [i]dois[/i] listões, mas onde será que acharemos... [i]Mas olha que surpresa[/i]! Continue lendo para saber de todas as outras alterações desta atualização. Ou abra o jogo e jogue. Cá entre nós, não precisamos que você nos diga o quão divertido é ler manuais técnicos sobre jogos... Jogá-los chega bem perto. Vá em frente, a lista continuará aqui quando terminar.",
  "new_frontiers_misc_title": "Diversos",
  "new_frontiers_misc_role_tokens": "Reduzimos a quantidade de buscas por função concedidas ao perder uma partida com todas as funções selecionadas. Agora, você receberá duas buscas por derrota (e continuará recebendo quatro por vitória). Essa alteração deve ajudar a coibir certos comportamentos no modo competitivo baseado em funções, em que jogadores focavam mais em acumular buscas do que jogar para valer com a função que lhe foi atribuída.",
  "new_frontiers_misc_removed_roles": "Removemos o Modo de Capitães da criação de partidas competitivas e os modos Todos Aleatórios e Mata-Mata Aleatório da criação de partidas casuais. Quase ninguém jogava nesses modos, e o tempo na fila facilmente ultrapassava uma hora.",
  "new_frontiers_misc_model_editor": "Removemos o antigo editor de modelos. Agora, todos os arquivos VMDL serão carregados na nova ferramenta, e modelos antigos serão convertidos ao abri-los pela primeira vez. Lançaremos uma atualização futura que removerá completamente a compatibilidade com o antigo formato compilado, então recomendamos a todos os autores da Oficina que carreguem e convertam os seus modelos para o novo formato, e recompile-os o mais breve possível.",
  "new_frontiers_misc_hold_animation": "Removemos a compatibilidade com a antiga chave \"HoldAnimation\" das propriedades dinâmicas. Modos de jogo alternativos devem trocar manualmente para a nova chave \"loop mode\" ou recompilar os seus mapas para que tais propriedades sejam automaticamente atualizadas.",
  "neutral_item_tier": "Item neutro — [b]Classe %1$s[/b]",
  "dota_ability_variable_health": "de vida",
  "dota_ability_variable_mana": "de mana",
  "dota_ability_variable_armor": "de armadura",
  "dota_ability_variable_damage": "de dano",
  "dota_ability_variable_str": "de Força",
  "dota_ability_variable_int": "de Inteligência",
  "dota_ability_variable_agi": "de Agilidade",
  "dota_ability_variable_all": "a todos os atributos",
  "dota_ability_variable_primary_attribute": "de atributo primário",
  "dota_ability_variable_attack": "de velocidade de ataque",
  "dota_ability_variable_hp_regen": "de regeneração de vida",
  "dota_ability_variable_lifesteal": "de roubo de vida",
  "dota_ability_variable_mana_regen": "de regeneração de mana",
  "dota_ability_variable_mana_regen_aura": "de regeneração de mana (aura)",
  "dota_ability_variable_spell_amp": "de dano arcano",
  "dota_ability_variable_debuff_amp": "de duração de efeitos negativos",
  "dota_ability_variable_move_speed": "de velocidade de movimento",
  "dota_ability_variable_evasion": "de chance de esquiva",
  "dota_ability_variable_spell_resist": "de resistência mágica",
  "dota_ability_variable_spell_lifesteal": "de roubo de vida arcano",
  "dota_ability_variable_spell_lifesteal_creep": "de roubo de vida arcano (criaturas)",
  "dota_ability_variable_spell_lifesteal_hero": "de roubo de vida arcano (heróis)",
  "dota_ability_variable_selected_attrib": "ao atributo selecionado",
  "dota_ability_variable_attack_range": "de alcance de ataque <font color='#7d7d7d'>(longa distância)</font>",
  "dota_ability_variable_attack_range_melee": "de alcance de ataque <font color='#7d7d7d'>(corpo a corpo)</font>",
  "dota_ability_variable_cast_range": "de alcance de uso",
  "dota_ability_variable_status_resist": "de resistência estática",
  "dota_ability_variable_projectile_speed": "de velocidade do projétil",
  "dota_ability_variable_manacost_reduction": "de redução de custos de mana",
  "dota_ability_variable_cooldown_reduction": "de redução de intervalo entre usos",
  "dota_ability_variable_max_mana_percentage": "de mana máx. adicional"
}