// 895.js

{
  "language": "english",
  "new_frontiers_gameplay_number": "Gameplay Update 7.33",
  "new_frontiers_title": "The New Frontiers Update",
  "new_frontiers_title_short": "New Frontiers",
  "new_frontiers_subtitle": "A new map, major gameplay changes, and so much more. It's a whole new world to explore.",
  "new_frontiers_play_trailer": "Watch Trailer",
  "new_frontiers_dota_team_intro": "The New Frontiers Update is shipping a new map, major gameplay changes, matchmaking changes, user interface changes, and — we’re not kidding here — so much more.<br><br>How much more? So much that it actually got hard to remember it all, and we started to panic for a few days until someone remembered we could just write it down. So we did. Now we can read it any time we like. And you can too! Start scrolling to read on.",
  "new_frontiers_eldor_name": "Eldor the wizard",
  "new_frontiers_dota_team_name": "The Dota Team",
  "new_frontiers_section_title_map": "New Map",
  "new_frontiers_section_title_major_gameplay": "Major Gameplay Changes",
  "new_frontiers_section_title_matchmaking": "Matchmaking",
  "new_frontiers_section_title_ui": "User Interface",
  "new_frontiers_section_title_gameplay_update": "Balance Changes",
  "new_frontiers_map_introduction": "The Dota map has been massively expanded. The core objective of the game remains the same — your lanes aren’t further away from each other, and everything you need to win is still in the center of the map.<br><br>But with 40% more terrain, there’s plenty of room to reap new resources and discover new strategies. Both main jungles have also been fully reconfigured, shaking up vision placement, juke routes, farming and more.",
  "new_frontiers_map_subtitle": "Explore the new world",
  "new_frontiers_map_roshan_title": "Roshan's New Homes",
  "new_frontiers_map_roshan_desc": "Roshan’s sold his old river pit and is taking advantage of all this new real estate. He’s now got [i]two[/i] fantastic new pits located in the northwest and southeast corners of the map. It’s a pit-lover’s paradise, boasting peekaboo views of the fountains and just minutes away from the Secret Shops.<br><br>These pits must also be close to a gym, because Roshan’s even tankier now. Roshan also no longer drops Aghanim's Shards, and now drops Cheese on his second death instead of third. His third death drops a Refresher Shard or a Scepter, depending on whether he’s in North Pit or South Pit.",
  "new_frontiers_map_twin_gates_title": "Twin Gates",
  "new_frontiers_map_twin_gates_desc": "Two gates now connect the corners of the map near the safe lane towers, allowing players to teleport instantly from one edge of the map to the other.<br><br>This is a gameplay change, but it has obvious lore implications. You guessed it: Dota 2 now unofficially exists in the PMEU (Pac Man Expanded Universe).",
  "new_frontiers_map_lotus_pools_title": "Lotus Pools",
  "new_frontiers_map_lotus_pools_desc": "Players can now find Lotus Pools on the left and right sides of the map (near where the creep waves first meet). They periodically spawn fruit that, when eaten, grants mana and HP.<br><br>Players can stockpile this fruit, and then combine it into even larger, higher-value fruit in the late game. This larger fruit can even be combined into [i]incredibly[/i] large fruit. What happens if you combine the [i]incredibly[/i] large fruit? Probably nothing. (Definitely something.)",
  "new_frontiers_map_tormentors_title": "Tormentors",
  "new_frontiers_map_tormentors_desc": "These two powerful neutral creeps spawn near each base after 20 minutes, and both have a bellyful of Aghanim’s Shards. But there’s a catch, and the catch is that there’s two catches: 1) Tormentors are equipped with megashields, which reflect most of the damage you throw at them. 2) They grow stronger every time you kill them. So it’ll probably require your entire team to take one down.<br><br>The good news is, much like bears ignoring you to maul a hiker, if you leave them alone, they’ll leave you alone.",
  "new_frontiers_map_watchers_title": "Watchers",
  "new_frontiers_map_watchers_desc": "Watchers are like Terminators, but for watching. They are relentless. They don’t know pain. They don’t know fear. They are lazy, though. They won’t start watching until you click on them. <br><br>Watchers begin the game inactive and neutral, but once activated, grant vision over the Watcher’s area for seven minutes—or until your enemies sabotage it to temporarily disable it. When a team kills Roshan, all Watchers will turn to their side.",
  "new_frontiers_map_barriers_title": "Defender's Gates",
  "new_frontiers_map_barriers_desc": "Defender’s Gate combines the sparkly high fantasy of Dota with the practicality of doors on your house that you can lock when you go to the grocery store to destroy its Ancient. It’s a back door to your base with a handy force field that lets your team through and keeps the enemy team out. While the enemy is assaulting the front, you can sneak in and out through the back.",
  "new_frontiers_map_wisdom_runes_title": "Wisdom Runes",
  "new_frontiers_map_wisdom_runes_desc": "Explore the edges of the map to unearth Wisdom Runes, which grant XP boosts to any hero wise enough to steal one. Wisdom Runes spawn near your base, offering an easy-to-defend way to keep a losing game from spinning out of control.",
  "new_frontiers_map_shield_runes_title": "Shield Runes",
  "new_frontiers_map_shield_runes_desc": "River Power Runes also get an addition with the beefy new Shield Rune, which gives 50% of your Max HP as a barrier. Dive a tower for a kill in the early game — or walk up a blind hill to surprise both yourself and the enemy team.",
  "new_frontiers_map_named_regions_title": "Named Regions",
  "new_frontiers_map_named_regions_desc": "The expanded map now features distinct regions like The Mines, The Well, The Graveyard, and The Statue, making it even easier to let your teammates know exactly where someone is killing you. All units in these regions gain region-themed modifiers to their stats.",
  "new_frontiers_map_creep_camps_title": "12 New Creep Camps",
  "new_frontiers_map_creep_camps_desc": "Some of the creeps got tired of getting butchered all the time in the jungle, and have established  12 new camps scattered throughout the expanded map. So now you can butcher them there too.",
  "new_frontiers_map_outpost_title": "New Outposts",
  "new_frontiers_map_outpost_desc": "The new expanded map features two new Outposts. The original outposts have been moved to new locations, which raises the obvious question of whether they’re truly the original outposts. Nice try, Socrates: They are.",
  "new_frontiers_major_gameplay_features_desc": "The New Frontiers Update introduces major changes to your favorite heroes and systems. In fact, our legal department advised us to tell you that this gameplay section is [i]so densely packed[/i] with meta-defining new features that you should read them slowly, over the course of the next few weeks, so you don’t get overstimulated and have to call the fire department.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Hero Highlights",
  "new_frontiers_major_gameplay_hero_reworks_desc": "While all heroes have been balanced, some have been balanced more than others. We're calling out a few of those here.",
  "new_frontiers_major_gameplay_new_items_title": "New Items",
  "new_frontiers_major_gameplay_new_items_desc": "For all your purchasing needs.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "New Neutral Items",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "We’re tossing seven all-new neutral items to the mix, and bringing back some old favorites.",
  "new_frontiers_major_gameplay_bkb_title": "Black King Bar Reworked",
  "new_frontiers_major_gameplay_bkb_desc": "Activating Black King Bar now applies a basic dispel, and grants 50% Magic resistance and Debuff Immunity. While it’s active, negative effects from debuffs don't affect you. Plus, you’ll have immunity from Pure and Reflected Damage.<br><br>But be careful: If Black King Bar expires before the duration of any of the debuffs, the debuffs will be applied for whatever duration is left. Effects that pierce magic immunity now also pierce debuff immunity.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "New Hero Attribute Type",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "As the fourth spirit brother we’d released, Void Spirit shouldn’t have been a Strength, Agility, or Intelligence hero. To stand apart, he really should have been a new kind of hero. A [i]fourth[/i] kind of hero.<br><br>Introducing Universal heroes — a new main stat group composed of existing heroes that now gain 0.6 damage from each stat, of any attribute. Our engineers assure us this number is perfectly balanced. Unless it isn’t. But the good news is we’re all going to find out together in the grand adventure that is the New Frontiers Update.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Neutral Item Drops Reworked",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Murdering forest creatures used to mean getting a cool new neutral item... that usually went to the carry, who usually wasn’t you. Now killing a neutral creep randomly drops a token, which lets you choose from [i]five[/i] available neutral items. Each token offers a full array of five options, so even the last player to redeem their token has a real choice.<br><br>Teams can give tokens to anyone to use — but once you select an item it can’t be shared, so divvy your tokens wisely.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Neutral Creep Scaling",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Neutral creeps and their abilities now scale over time. Yes, camps will get harder to wipe out as the game goes on, but heroes with the ability to control creeps are going to have some serious backup.",
  "new_frontiers_major_gameplay_kill_formula_title": "Kill Formula Reworked",
  "new_frontiers_major_gameplay_kill_formula_desc": "We’ve reworked the Kill formula to make early game kills more impactful and motivate players to gank other lanes. We’ve also reduced gold scaling for lane creeps, making creep farming less profitable as the game progresses, and encouraging players to beat the gold out of each other instead.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "An Unstunning New Feature",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Playing your hero is always more fun than sitting around not playing your hero. Well, fans of playing things and critics of not playing things, your dreams have come true: Get ready to play your hero more than ever before.<br><br>How? Easy. We reduced the duration of almost every disable in the game. How did we come up with this insane plan? Even easier. We took a Beastmaster Roar to the face and suddenly had a lot of time to think.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "After two months of haunting the lanes, Muerta has finally found her Aghanim’s Scepter and Shard. If you haven’t checked her out yet, learn more over at the [url=https://www.dota2.com/deadreckoning]Dead Reckoning Update[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi is too dumb to be an Intelligence hero. So he isn’t anymore.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa now starts weak as a baby, but like a baby, she can get stronger over time.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Most of Clinkz’s abilities, like the best abilities in life, now create skeletons.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden used to create a perfect clone of himself. But now he makes a [i]better[/i] version of himself! Or worse! Either way, it’s different. And uncontroversial, we imagine.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Alchemist the hero, like all Alchemist players, is now innately greedy.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ARC WARDEN LIMITED TIME BONUS",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "For a limited time only, when you choose Arc Warden when playing for the Dire, the Tempest Double will be the main hero, and casting his Ultimate will summon his \"normal\" self.",
  "new_frontiers_matchmaking_desc": "Let’s be honest: There are eight billion people on the planet, and 99.99% of them are terrible at Dota. This means matchmaking can be a challenge, especially if you’re good at Dota, and like playing with people who are almost but hopefully not quite as good at Dota as you are. We've done a bunch of work and a bunch of math to improve the quality of our matchmaking across the board, for players of all skills levels.",
  "new_frontiers_matchmaking_intro_title": "Matchmaking with Confidence",
  "new_frontiers_matchmaking_intro_desc": "Matchmaking Rating (MMR) is really just made of two numbers: Rank and Rank Confidence. Your Rank is an estimate of your skill, and your Rank Confidence is our confidence in that estimate. When you play a match, we adjust your Rank based on whether you win or lose. Your Rank Confidence also goes up, because now we have more data.",
  "new_frontiers_matchmaking_details_old_title": "Undesired Clumping: The Worst Kind of Clumping",
  "new_frontiers_matchmaking_details_old_desc": "Dota has traditionally used a modified version of the Elo algorithm to implement Rank and Rank Confidence changes. But over time we've noticed a few problems with our approach. For one example, the distribution of MMRs has gradually shifted lower, causing an undesired clumping in the 0-1000 MMR range. Another problem was that players who took a break and returned were having a hard time getting back to an accurate MMR, because their previous skill level was no longer representative.",
  "new_frontiers_matchmaking_details_new_title": "New and Improved Clumping",
  "new_frontiers_matchmaking_details_new_desc": "To address this, we're switching to a different algorithm called Glicko, which should let you quickly and accurately get matched with other players at a similar skill level. On the math side, Glicko lets us better factor a player's Rank Confidence into our calculations, resulting in more accurate decisions about Rank gains and losses.\\n\\nThe switch to our new matchmaking system will feel a little like the start of a new matchmaking season: [list][*]All players will be placed back into a short calibration mode, initially seeded by their previous rank.\\n[*]Calibration is no longer a fixed number of matches. Instead, a player is considered calibrated whenever their Rank Confidence is above a certain threshold.\\n[*]Upon calibration, it is likely that you will end up with a different medal than you had before. However, even if your medal changes significantly, you should expect to be matched with players of a similar skill level.\\n[*]Matches will no longer have a fixed MMR gain/loss. It will be variable based on a number of factors, including the Ranks and Rank Confidence of the participants. However, we will cap the gain/loss per match to prevent particularly negative outcomes.[*]A player's Rank Confidence will slowly lower over time if the player does not play matches.[/list]We've been running both matchmaking systems simultaneously behind the scenes for a while now to help us build confidence in these changes. We understand that accurate MMR is only one of many factors that impact match quality, and like all changes in this space we're interested in hearing your feedback.",
  "new_frontiers_matchmaking_immortals_title": "Immortal Matchmaking",
  "new_frontiers_matchmaking_immortals_desc": "At Immortal rank, knowing the other players, gelling with them, and choosing a nice balance of roles is more important than just MMR. So we’ve redesigned matchmaking at the Immortal level to account for that.<br><br>Matches in the Immortal ranks won’t use pre-made teams anymore. Instead, two captains will get to draft the other eight players onto each team, making your team more impactful than if you’d just relied on MMR to assign lineups. So if your match sucks now, you’ve got no one to blame but yourselves, Immortals.",
  "new_frontiers_ui_desc": "Blurry vision and shooting pains down your arm? Our advice is ignore it, that’s just your body’s way of saying it’s hungry. Got a flat tire? Drive on the rim — it’s still round. The point is: pretty much everything in life can be safely ignored without consequence.<br><br>Except Dota health bars. That stuff is important. Which is why a bunch of health-related UI info is getting a massive upgrade with this update.",
  "new_frontiers_ui_shields_title": "Health Bar Barriers",
  "new_frontiers_ui_shields_desc": "Did you know Dota has shields? Magic shields, physical shields, aphotic shields. All sorts of shields! Maybe you missed them. Or mostly ignored them. Because there was no way to know how much shield you started with or how much you had left.<br><br>But that dark age of uncertainty ends today. Now you can see everything. Or at least both of those two things. You can even see which type of shield it is. To celebrate how much better all those old shields are with this visual upgrade, we’ve added a bunch of new abilities that feature them.<br><br>We also renamed them from Shields to Barriers, so you don't get confused thinking there's a Vanguard on your health bar. You're welcome.",
  "new_frontiers_ui_health_pips_title": "Health Bar Pips",
  "new_frontiers_ui_health_pips_desc": "Some units don’t have traditional health pools and require a specific number of attacks to destroy them. Now, instead of the usual guesswork or some genius-level counting in your head, you can just look at the unit you want to murder. It’ll show handy little pips that represent the number of hits it can take before it shuffles off this mortal coil (quote from Hamlet’s health bar).",
  "new_frontiers_ui_health_cost_title": "Health Cost",
  "new_frontiers_ui_health_cost_desc": "While most abilities in Dota consume mana, some consume health instead. Now those abilities actually display the HP cost of casting them. Not bad, huh? Actually kind of crazy nobody thought to put it there before. Anyway, it’s there now.",
  "new_frontiers_gameplay_update_desc": "That’s a huge list of stuff up there. The only thing that could possibly make it better is [i]two[/i] huge lists of stuff, but where are we gonna find [i]hey would you look at this![/i] Read on for all of the other balance changes this update has in store. Or just jump right into the game and play. Believe us, we don’t need you to tell us how fun reading technical manuals about video games is, but man, playing them is a pretty close second.  This list’ll still be here when you get back.",
  "new_frontiers_misc_title": "Miscellaneous",
  "new_frontiers_misc_role_tokens": "We've reduced the number of Role Queue tokens granted when you lose an 'all roles selected' match. Now you’ll earn two tokens for a loss. (Winning still grants the full four tokens.) This change should help smooth out player behavior around Ranked Roles, where farming tokens sometimes takes precedence over playing an assigned role effectively.",
  "new_frontiers_misc_removed_roles": "We removed Captains Mode from Ranked and cut All Random and All Random Deathmatch from unranked. Almost no one plays these modes and queue times easily exceed one hour.",
  "new_frontiers_misc_model_editor": "This update removes the legacy model editor. All vmdl files will now load in the new tool, and old models will be converted when you first load them in the tool. We will release a subsequent update to completely remove support for loading the old compiled format, so we encourage all workshop authors to load and convert their models to the new format and recompile them asap.",
  "new_frontiers_misc_hold_animation": "We've removed support for the legacy \"HoldAnimation\" key from dynamic props. Custom games should either manually switch to the new \"loop mode\" key, or recompile their maps in order to automatically upgrade those properties.",
  "neutral_item_tier": "[b]Tier %1$s[/b] Neutral Item",
  "dota_ability_variable_health": "Health",
  "dota_ability_variable_mana": "Mana",
  "dota_ability_variable_armor": "Armor",
  "dota_ability_variable_damage": "Damage",
  "dota_ability_variable_str": "Strength",
  "dota_ability_variable_int": "Intelligence",
  "dota_ability_variable_agi": "Agility",
  "dota_ability_variable_all": "All Attributes",
  "dota_ability_variable_primary_attribute": "Primary Attribute",
  "dota_ability_variable_attack": "Attack Speed",
  "dota_ability_variable_hp_regen": "Health Regeneration",
  "dota_ability_variable_lifesteal": "Lifesteal",
  "dota_ability_variable_mana_regen": "Mana Regeneration",
  "dota_ability_variable_mana_regen_aura": "Mana Regeneration Aura",
  "dota_ability_variable_spell_amp": "Spell Damage",
  "dota_ability_variable_debuff_amp": "Debuff Duration",
  "dota_ability_variable_move_speed": "Movement Speed",
  "dota_ability_variable_evasion": "Evasion",
  "dota_ability_variable_spell_resist": "Magic Resistance",
  "dota_ability_variable_spell_lifesteal": "Spell Lifesteal",
  "dota_ability_variable_spell_lifesteal_creep": "Spell Lifesteal (Creeps)",
  "dota_ability_variable_spell_lifesteal_hero": "Spell Lifesteal (Heroes)",
  "dota_ability_variable_selected_attrib": "Selected Attribute",
  "dota_ability_variable_attack_range": "Attack Range <font color='#7d7d7d'>(Ranged Only)</font>",
  "dota_ability_variable_attack_range_melee": "Attack Range <font color='#7d7d7d'>(Melee Only)</font>",
  "dota_ability_variable_cast_range": "Cast Range",
  "dota_ability_variable_status_resist": "Status Resistance",
  "dota_ability_variable_projectile_speed": "Projectile Speed",
  "dota_ability_variable_manacost_reduction": "Manacost Reduction",
  "dota_ability_variable_cooldown_reduction": "Cooldown Reduction",
  "dota_ability_variable_max_mana_percentage": "Max Mana Bonus",
  "dota_ability_variable_aoe_bonus": "AoE Bonus",
  "NoCommaStub": ""
}