// 8773.js

{
  "language": "japanese",
  "new_frontiers_gameplay_number": "ゲームプレイアップデート7.33",
  "new_frontiers_title": "New Frontiersアップデート",
  "new_frontiers_title_short": "New Frontiers",
  "new_frontiers_subtitle": "新しいマップ、ゲームプレイの大幅な変更など盛りだくさん。まったく新しい世界を探索しましょう。",
  "new_frontiers_play_trailer": "予告編を見る",
  "new_frontiers_dota_team_intro": "New Frontiersアップデートには、新しいマップ、ゲームプレイの大幅な変更、マッチメイキングやユーザーインターフェイスの変更、そして他にも多数の変更点があり、本当に盛りだくさんです。<br><br>どのくらい盛りだくさんかというと、私たちでもすべてを覚えておけないほどです。誰かが書き留めておくことを思い出すまで、数日間パニックに陥りそうになりました。そんな訳で、変更点を書き留めておいたので、いつでも読めるようになりました。そして皆さんにもお読みいただけます！ぜひスクロールして読み進めてください。",
  "new_frontiers_eldor_name": "魔術師エルドー",
  "new_frontiers_dota_team_name": "Dotaチーム",
  "new_frontiers_section_title_map": "新マップ",
  "new_frontiers_section_title_major_gameplay": "ゲームプレイの大幅な変更",
  "new_frontiers_section_title_matchmaking": "マッチメイキング",
  "new_frontiers_section_title_ui": "ユーザーインターフェイス",
  "new_frontiers_section_title_gameplay_update": "バランス調整",
  "new_frontiers_map_introduction": "Dotaマップが大幅に拡張されました。ただし、ゲームの主なゴールはそのままです。レーン間の距離に変更はなく、勝利のために必要なものは、引き続きすべてマップの中央にあります。<br><br>マップ範囲が40%拡大したことで、新しいリソースを獲得し、新しい戦略を発見する余地も拡大します。各メインジャングルも完全に再構成されており、ビジョンの配置、抜け道、ファーミングなども大きく変わっています。",
  "new_frontiers_map_subtitle": "新しい世界を探索",
  "new_frontiers_map_roshan_title": "ロシャンの新たなすみか",
  "new_frontiers_map_roshan_desc": "ロシャンは川にある穴ぐらを売却し、新居での生活を楽しんでいます。ロシャンの新しい素敵な穴ぐらは、マップの北西と南東の角に[i]2つ[/i]あります。新居からは泉を覗き見ることができ、シークレットショップにも近いという好立地なので、穴ぐら愛好家にとっては楽園のような場所です。<br><br>ロシャンはこれまで以上にタンキーになったため、新居はジムの近くに設ける必要がありました。また、ロシャンはAghanim's Shardをドロップしなくなり、Cheeseをドロップするタイミングは3度目ではなく2度目の死亡時になりました。3度目の死亡時は、ロシャンが北または南にいるかによって、Refresher ShardまたはAghanim's Scepterをドロップします。",
  "new_frontiers_map_twin_gates_title": "ツインゲート",
  "new_frontiers_map_twin_gates_desc": "2つのゲートがセーフレーンタワーの近くのマップの両端をつなぐようになり、プレイヤーはマップの端から端まで瞬時にテレポートできるようになりました。<br><br>これはゲームプレイへの変更ですが、ゲームの伝承にも影響するものです。ご想像のとおり、Dota 2は非公式ながらPMEU（Pac Man Expanded Universe）の一部となりました。",
  "new_frontiers_map_lotus_pools_title": "ロータスプール",
  "new_frontiers_map_lotus_pools_desc": "マップの左側と右側（クリープの群れ同士が最初にぶつかる場所の近く）にロータスプールができました。そこには一定時間毎にフルーツが出現し、それらを食べるとマナとHPが増えます。<br><br>プレイヤーはこのフルーツを集め、ゲーム後半でそれをさらに大きく価値の高いフルーツにすることができます。この大きなフルーツは、[i]信じられないほど[/i]大きなフルーツにすることもできます。[i]信じられないほど[/i]大きなフルーツにしたらどうなるのか？ おそらく何もないでしょう（間違いなく何かありそうですが。）",
  "new_frontiers_map_tormentors_title": "トーメンター",
  "new_frontiers_map_tormentors_desc": "これら2体の強力なニュートラルクリープは、ゲーム開始から20分後にベースの近くに出現します。2体ともおなかにAghanim’s Shardをたっぷり詰め込んでいます。ただし、落とし穴があります。それも2つもです。1）トーメンターはメガシールドを装備しており、受けたダメージのほとんどを跳ね返します。2）倒すたびに強力になります。そのため、おそらくチーム全員で協力して戦う必要があります。<br><br>良い情報としては、トーメンターは、熊が他の登山客を襲うためにあなたを無視するのと同じように、あなたがトーメンターを放っておけば、彼らもあなたに襲いかかることありません。",
  "new_frontiers_map_watchers_title": "ウォッチャーズ",
  "new_frontiers_map_watchers_desc": "ウォッチャーはターミネーターに似ていますが、監視するためのものです。彼らは情け容赦がなく、痛みを感じず、恐れを知りません。ただし、彼らは怠け者で、クリックするまで監視を始めません。<br><br>ゲーム開始時点のウォッチャーズは、アクティブではなく中立ですが、アクティブになると、7分間（または敵が一時的に無効にするために妨害するまで）ウォッチャーの周囲に視界を与えます。どちらかのチームがロシャンを倒すと、すべてのウォッチャーはそのチームのものになります。",
  "new_frontiers_map_barriers_title": "ディフェンダーズゲート",
  "new_frontiers_map_barriers_desc": "ディフェンダーズゲートは、Dotaのきらきらしたファンタジーと、スーパーに出かける際にドアに鍵をかけるような実用性を組み合わせたもので、エンシェントを破壊するために使用できます。これはベースの便利な裏口のようなもので、味方の侵入を許可し、敵の侵入を防ぎます。敵が正面を攻撃している間に、裏からこっそり出入りすることができます。",
  "new_frontiers_map_wisdom_runes_title": "ウィズダムルーン",
  "new_frontiers_map_wisdom_runes_desc": "マップの端を探索して、ウィズダムルーンを発掘すると、それを得たヒーローにはXPブーストが付与されます。ウィズダムルーンはベースの近くに出現し、劣勢のゲームを立て直すための防御手段を提供します。",
  "new_frontiers_map_shield_runes_title": "シールドルーン",
  "new_frontiers_map_shield_runes_desc": "リバーパワールーンにも、最大HPの50%をバリアとして付与する屈強なシールドルーンが追加されました。序盤戦でタワーにダイブしてキルを奪ったり、視界のない丘を駆け上がって敵チームとあなた自身を驚かせたりしてください。",
  "new_frontiers_map_named_regions_title": "地域名",
  "new_frontiers_map_named_regions_desc": "拡張されたマップには「The Mines」「The Well」「The Graveyard」「The Statue」のような区別された地域があり、誰かに殺されそうになったときに、チームメイトに正確な場所を伝えやすくなっています。それらの地域にいるすべてのユニットは、地域ごとのテーマに応じたモディファイアによりステータス数値が変化します。",
  "new_frontiers_map_creep_camps_title": "12の新しいクリープキャンプ",
  "new_frontiers_map_creep_camps_desc": "ジャングルでいつも殺されてばかりいることに嫌気がさした一部のクリープたちが、拡張されたマップのあちこちに12の新しいキャンプを移動させました。新しいキャンプまで倒しに行きましょう。",
  "new_frontiers_map_outpost_title": "新しいアウトポスト",
  "new_frontiers_map_outpost_desc": "新たに拡張されたマップには、2つの新しいアウトポストがあります。これまでのアウトポストが新しい場所に移動しただけなのですが、本当に同じアウトポストなのかという疑問を持つ方もいらっしゃることでしょう。まったく同じです。",
  "new_frontiers_major_gameplay_features_desc": "New Frontiersアップデートでは、皆さんのお気に入りのヒーローやシステムに大きな変化がもたらされます。弊社の法務部からは、このゲームプレイセクションにはメタ的新機能が[i]ぎっしり詰まっている[/i]ため、過度の刺激を受けて救急車を呼ぶことにならないように、今後数週間かけてゆっくり読むようにというアドバイスが届いています。",
  "new_frontiers_major_gameplay_hero_reworks_title": "ヒーローのアップデート概要",
  "new_frontiers_major_gameplay_hero_reworks_desc": "バランス調整はすべてのヒーローで行われましたが、一部のヒーローに対しては他のヒーローより大きな調整が加えられました。その一部をここで紹介します。",
  "new_frontiers_major_gameplay_new_items_title": "新アイテム",
  "new_frontiers_major_gameplay_new_items_desc": "あらゆる購入ニーズに対応中です。",
  "new_frontiers_major_gameplay_new_neutral_items_title": "新しいニュートラルアイテム",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "7つの新しいアイテムを加え、過去の人気アイテムの一部を復活させました。",
  "new_frontiers_major_gameplay_bkb_title": "一新されたBlack King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Black King Barを有効化すると基本ディスペルが適用され、50%の魔法耐性とデバフ無効が付与されます。効果持続中は、デバフのネガティブな効果による影響がなくなります。さらに、ピュアダメージおよび反射ダメージを受けなくなります。<br><br>ただし、注意が必要なのは、デバフ持続時間中にBlack King Barの効果が切れると、残った時間のデバフは適用される点です。魔法無効を貫通する効果は、デバフ無効を貫通する効果になります。",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "新しいヒーロー属性タイプ",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "4人目のスピリット系ヒーローとして登場したヴォイドスピリットは、ストレングス、アジリティ、インテリジェンスのどれにも属すべきではなく、他と区別するために、[i]第4のタイプ[/i]のヒーローとするべきでした。<br><br>それが、ユニバーサルヒーローです。既存のヒーローたちが新たに加わるこの新しい属性タイプでは、各属性から0.6ダメージを得ます。この数字のバランスが完璧であると、弊社のエンジニアは自信を持っていますが、完璧ではない可能性もあります。このNew Frontiersアップデートの壮大な冒険を通して、一緒に探究していきましょう。",
  "new_frontiers_major_gameplay_neutral_item_token_title": "一新されたニュートラルアイテムドロップ",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "これまでは、森にすむ生き物を倒すと、素敵なニュートラルアイテムが手に入っていました。ただし、そのアイテムは通常あなたではなく、キャリーの手に渡っていました。今後は、ニュートラルクリープを倒すと、ランダムにトークンがドロップされ、[i]5つの[/i]ニュートラルアイテムから選択できるようになります。各トークンに5つの選択肢が提供されるため、トークンを最後に引き換えるプレイヤーにも完全な選択肢が残されます。<br><br>トークンはチーム内で受け渡して使用することができますが、一度アイテムを選択すると、共有できないため、トークンの配分には気を付けてください。",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "ニュートラルクリープのスケーリング",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "ニュートラルクリープとそのアビリティが時間の経過とともにスケーリングするようになりました。そうです、ゲームが進むにつれてキャンプを一掃するのは難しくなりますが、クリープをコントロールするアビリティを持つヒーローにはかなりの援護がつきます。",
  "new_frontiers_major_gameplay_kill_formula_title": "キルの計算式を修正",
  "new_frontiers_major_gameplay_kill_formula_desc": "キルの計算式に手を加えて、ゲーム序盤のキルをよりインパクトのあるものにし、他のレーンを急襲する動機を与えました。また、レーンクリープのゴールドスケーリングを下げることで、ゲームが進むにつれてクリープを倒すことによる収益性が下がるようになりました。これにより、プレイヤーはゴールドを獲得するために相手を倒すように促されます。",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "スタンに対する驚くべき変更",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "ヒーローをプレイすることは、じっとしたままヒーローをプレイしないよりも楽しいですよね。ということで、じっとするよりプレイする方を好むプレイヤーの皆さん、あなたの希望が叶いました！これまで以上にヒーローをプレイできるようになります。<br><br>これをどうやって実現したかというと、答えは簡単です。ゲーム内のほぼすべてのディスエイブルの持続時間を短くしました。こんなばかげたアイデアをどうやって思いついたかって？その答えはもっと簡単です。ビーストマスターのPrimal Roarをまともにくらって、考える時間がたっぷりあったのです。",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Dotaに登場してから2か月間レーンに恐怖をもたらしてきたムエルタに、Aghanim’s ScepterとAghanim’s Shardのアップグレードが遂に追加されました。ムエルタの詳細をまだチェックしていない場合は、[url=https://www.dota2.com/deadreckoning]Dead Reckoningアップデート[/url]をご覧ください。",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "オーガマギは、インテリジェンスヒーローにしてはあまりに知能が低いため、インテリジェンスヒーローではなくなりました。",
  "new_frontiers_major_gameplay_hero_rework_medusa": "メドゥーサは赤ちゃんのように弱い状態で始まり、時間が経つにつれて強くなります。",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "クリンクズのアビリティのほとんどがスケルトンを作れるようになりました（人生で最高の能力のようですね）。",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "かつてアークウォーデンは自分自身の完全なクローンを作ることができました。しかし、今後は自分の[i]より良い[/i]バージョンのクローンを作ることができます！いや、より悪いバージョンかもしれません！どっちにしても、今までとは違います。そして、この変更による論争は生まれないはずです。",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "アルケミストは、このヒーローを選ぶプレイヤーと同様に、先天的に貪欲になりました。",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "アークウォーデンの期間限定ボーナス",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "期間限定で、Dire側でプレイする際にアークウォーデンを選択すると、テンペストダブルがメインヒーローになり、アルティメットをキャストすると「通常」のアークウォーデンが召喚されます。",
  "new_frontiers_matchmaking_desc": "地球上には80億の人がいますが、正直に言って、そのうち99.9%はDotaがとても下手です。よって、マッチメイキングは困難なことがあります。Dotaが得意で、自分と同じか自分より少し低いくらいのスキルレベルのプレイヤーと対戦するのが好きな人にとってはなおさらです。今回のアップデートでは、あらゆるスキルレベルのプレイヤーのマッチメイキングクオリティを全面的に改善するためのさまざまな作業や計算を行いました。",
  "new_frontiers_matchmaking_intro_title": "安心できるマッチメイキング",
  "new_frontiers_matchmaking_intro_desc": "マッチメイキングレーティング（MMR）は、ランクとランクコンフィデンスという2つの数値で構成されます。ランクはあなたのスキルの推定値で、ランクコンフィデンスはその推定値に対する信頼度です。マッチをプレイすると、ランクは勝敗に応じて調整されます。また、データが増えることで、ランクコンフィデンスが上がります。",
  "new_frontiers_matchmaking_details_old_title": "望ましくない深刻な凝集",
  "new_frontiers_matchmaking_details_old_desc": "DotaではこれまでEloアルゴリズムの修正版を使用して、ランクとランクコンフィデンスの変更を実装してきました。しかし、時が経つにつれて、このアプローチにはいくつかの問題があることに気づきました。ひとつの例としては、MMRの分布が徐々に低い方に移行し、MMRが0～1000の範囲で望ましくない凝集が発生していたことです。もうひとつの問題として、しばらくプレイしていなかったプレイヤーがゲームに戻ってきたときに、過去のスキルレベルが反映されないために、正確なMMRに戻ることに苦労してしまうということがありました。",
  "new_frontiers_matchmaking_details_new_title": "新しく改善されたアルゴリズム",
  "new_frontiers_matchmaking_details_new_desc": "上記の問題に対処するため、Dotaで使用するアルゴリズムを、Glickoという別のアルゴリズムに変更しました。これにより同程度のスキルのプレイヤーとの迅速かつ正確なマッチメイキングが可能になるはずです。数字に関していえば、Glickoを使用することで、プレイヤーのランクコンフィデンスがより適切に計算されるようになり、ランクアップやランクダウンに関する決定がより正確になります。\\n\\n新しいマッチメイキングシステムへの切り替えは、新しいマッチメイキングシーズンの始まりのように感じられることでしょう。[list][*]すべてのプレイヤーは以前のランクでシードされた短期間のキャリブレーションモードに戻されます。\\n[*]キャリブレーションの試合数は固定ではなくなります。ランクコンフィデンスが一定のしきい値を超えた時点で、そのプレイヤーのキャリブレーションが完了したと見なされます。\\n[*]キャリブレーションによって、メダルが以前とは異なる可能性がありますが、メダルが大幅に変わったとしても、マッチメイキングはスキルレベルが同程度のプレイヤーと行われるはずです。\\n[*]マッチごとのMMRの増減幅が固定ではなくなりました。今後は、参加プレイヤーのランクやランクコンフィデンスなど、さまざまな要因に基づいて変動します。ただし、度を超えたネガティブな結果を避けるため、1マッチあたりの増減には限度を設けます。[*]しばらくマッチをプレイしていないプレイヤーのランクコンフィデンスは徐々に低下していきます。[/list]これらの変更に対する信頼性を高めるために、しばらくの間、密かに両方のマッチメイキングシステムを同時に使用してきました。MMRの正確性が、マッチの質に影響する多くの要因の一つに過ぎないことは、私たちも理解しています。他のすべての変更点と同様に、この件に関する皆さんからのご意見をお待ちしています。",
  "new_frontiers_matchmaking_immortals_title": "イモータルマッチメイキング",
  "new_frontiers_matchmaking_immortals_desc": "イモータルランクにおいては、他のプレイヤーを熟知し、彼らと協力し、バランスのとれた役割を選ぶことが、一般的なMMRより重要になります。その点を考慮して、イモータルレベルのマッチメイキングを再設計しました。<br><br>イモータルランクでのマッチでは今後、事前に組んだチームは使用しません。その代わりに、各チームの2人のキャプテンが残り8人のプレイヤーをドラフトで選択します。これにより、MMRに頼ってラインナップを決める場合よりも、チームへの影響が高まります。イモータルランクの皆さん、マッチの結果が気に入らなくても、今後は人のせいにしないでくださいね。",
  "new_frontiers_ui_desc": "視界がぼやけて、腕に激しい痛みがある？そんな時の私たちからのアドバイスは、とにかく無視することです。お腹が空いて、身体が反応しているだけでしょう。タイヤがパンクした？そのまま運転しましょう。パンクしていても車輪は丸いんですから。要は、人生におけるほとんどのことは、無視しても大丈夫だということです。<br><br>しかし、Dotaのヘルスバーは違います。これはとても重要です。よって今回、ヘルス関連のUIが大幅にアップデートされています。",
  "new_frontiers_ui_shields_title": "ヘルスバーのバリア",
  "new_frontiers_ui_shields_desc": "Dotaにシールドがあったことをご存じですか？魔法シールド、物理シールド、アフォティックシールドなど、色々なシールドがありました！全く知らなかった方や、知っていても気に留めなかった方が多いかもしれません。というのも、最初にどれだけのシールドがあり、どれくらい残っているのか知る方法がなかったんです。<br><br>しかし、暗中模索の時代は終わりました。これからはすべてを確認できます。文字通り「すべて」ではないかもしれませんが、少なくとも上記の2つとシールドのタイプは確認できます。また、今回のビジュアルアップグレードで従来のシールドが改善されたことを記念して、シールドを特徴とした新しいアビリティを多数追加しています。<br><br>さらに今回、「シールド」の名称を「バリア」に変更しました。これで、ヘルスバーにヴァンガードがいると勘違いすることはありませんね。",
  "new_frontiers_ui_health_pips_title": "ヘルスバーの目盛り",
  "new_frontiers_ui_health_pips_desc": "一部のユニットには従来のヘルスプールはなく、倒すには特定の攻撃回数が必要です。今後はこの攻撃回数を知るのに、勘に頼る必要も、天才レベルの能力で数え続ける必要もありません。ユニットに表示される小さな目盛りを見るだけで、この世のしがらみとの別れ（『ハムレット』からの引用）までに必要なヒット数が分かります。",
  "new_frontiers_ui_health_cost_title": "ヘルスコスト",
  "new_frontiers_ui_health_cost_desc": "Dotaのアビリティのほとんどはマナを消費しますが、一部にはヘルスを消費するものもあります。それらのアビリティは今後、キャストするための実際のヘルスコストを表示するようになります。かなり良い変更ですよね？これまで誰も思いつかなかったことが不思議なくらいです。いずれにせよ、今はあるので安心ですね。",
  "new_frontiers_gameplay_update_desc": "これまでに紹介したものだけでも、膨大なリストですね！リストを[i]もう一つ[/i]追加して、もっと膨大にしてしまいましょう。「それで一体どこが変わったの？」とお思いの方は、今回のアップデートでバランス調整されたすべての項目を以下でチェックしてください。または、すぐにゲームに飛び込んでプレイしてみてください。ビデオゲームの技術マニュアルを読むのがどれだけ楽しいかは言わずもがなですが、実際のゲームプレイにはその次くらいの楽しさがあります。このリストは、あなたがゲームプレイを終えて戻ってきたときにもまだ残っていますのでご安心を。",
  "new_frontiers_misc_title": "その他の変更",
  "new_frontiers_misc_role_tokens": "「すべての役割が選択された」マッチで負けた場合に付与されるRole Queueトークンの数を減らしました。今後は、負けた時に獲得できるトークン数が2個になります（勝った場合はこれまでと変わらず4個）。この変更は、割り当てられた役割を効果的にプレイすることよりも、トークンを貯めることが優先されがちな、Ranked Rolesにおけるプレイヤーの行動を改善するのに役立つはずです。",
  "new_frontiers_misc_removed_roles": "ランクマッチからキャプテンモードを削除し、ノーマルマッチからオールランダムとオールランダムデスマッチを削除しました。これらのモードは、プレイする人がほとんどおらず、待ち時間も簡単に1時間を超えていました。",
  "new_frontiers_misc_model_editor": "今回のアップデートで、従来のモデルエディターが削除されました。すべてのvmdlファイルは新しいツールで読み込まれるようになり、古いモデルは、ツールでの初回読み込み時に変換されます。今後リリースするアップデートで、古いコンパイル済みフォーマットの読み込みサポートを完全に削除します。そのため、すべてのワークショップ作成者には、モデルを新しいフォーマットに変換し、できるだけ早く再コンパイルすることをお勧めします。",
  "new_frontiers_misc_hold_animation": "動的プロップから従来の「HoldAnimation」キーのサポートを削除しました。カスタムゲームにおいては、手動で新しい「loop mode」キーに切り替えるか、マップを再コンパイルしてこれらのプロパティを自動的にアップグレードする必要があります。",
  "neutral_item_tier": "[b]ティアー%1$s[/b] ニュートラルアイテム",
  "dota_ability_variable_health": "ヘルス",
  "dota_ability_variable_mana": "マナ",
  "dota_ability_variable_armor": "アーマー",
  "dota_ability_variable_damage": "ダメージ",
  "dota_ability_variable_str": "ストレングス",
  "dota_ability_variable_int": "インテリジェンス",
  "dota_ability_variable_agi": "アジリティ",
  "dota_ability_variable_all": "すべての属性",
  "dota_ability_variable_primary_attribute": "主要属性",
  "dota_ability_variable_attack": "攻撃速度",
  "dota_ability_variable_hp_regen": "ヘルス自然回復",
  "dota_ability_variable_lifesteal": "ライフ吸収",
  "dota_ability_variable_mana_regen": "マナ自然回復",
  "dota_ability_variable_mana_regen_aura": "マナ自然回復オーラ",
  "dota_ability_variable_spell_amp": "スペルダメージ",
  "dota_ability_variable_debuff_amp": "デバフ持続時間",
  "dota_ability_variable_move_speed": "移動速度",
  "dota_ability_variable_evasion": "回避",
  "dota_ability_variable_spell_resist": "魔法耐性",
  "dota_ability_variable_spell_lifesteal": "スペル ライフ吸収",
  "dota_ability_variable_spell_lifesteal_creep": "スペル ライフ吸収（クリープ）",
  "dota_ability_variable_spell_lifesteal_hero": "スペル ライフ吸収（ヒーロー）",
  "dota_ability_variable_selected_attrib": "選択中の属性",
  "dota_ability_variable_attack_range": "攻撃範囲<font color='#7d7d7d'>（遠距離のみ）</font>",
  "dota_ability_variable_attack_range_melee": "攻撃範囲<font color='#7d7d7d'>（近接のみ）</font>",
  "dota_ability_variable_cast_range": "キャスト範囲",
  "dota_ability_variable_status_resist": "ステータス耐性",
  "dota_ability_variable_projectile_speed": "発射体速度",
  "dota_ability_variable_manacost_reduction": "マナコスト削減",
  "dota_ability_variable_cooldown_reduction": "クールダウン短縮",
  "dota_ability_variable_max_mana_percentage": "最大マナボーナス"
}