// 2780.js

{
  "language": "norwegian",
  "new_frontiers_gameplay_number": "Spilloppdatering 7.33",
  "new_frontiers_title": "Nye grenser",
  "new_frontiers_title_short": "Nye grenser",
  "new_frontiers_subtitle": "Et nytt kart, store spillendringer og mye, mye mer. Det er en helt ny verden å utforske.",
  "new_frontiers_play_trailer": "Se trailer",
  "new_frontiers_dota_team_intro": "Nye grenser kommer med et nytt kart, store spillendringer, endringer til matchmaking, endringer til grensesnittet og – vi tuller ikke – mye, mye mer.<br><br>Hvor mye mer? Så mye at det ble vanskelig å huske på alt, så vi begynte å få panikk i noen dager helt til noen kom på at vi bare kunne skrive det ned. Det gjorde vi. Nå kan vi lese det når som helst. Og det kan du også! Bare bla videre for å se.",
  "new_frontiers_eldor_name": "Magikeren Eldor",
  "new_frontiers_dota_team_name": "Dota-teamet",
  "new_frontiers_section_title_map": "Nytt kart",
  "new_frontiers_section_title_major_gameplay": "Store spillendringer",
  "new_frontiers_section_title_matchmaking": "Matchmaking",
  "new_frontiers_section_title_ui": "Grensesnitt",
  "new_frontiers_section_title_gameplay_update": "Balanseendringer",
  "new_frontiers_map_introduction": "Kartet i Dota har fått en stor utvidelse. Hovedmålet i spillet er det samme – stiene er ikke lenger unna hverandre, og alt du trenger for å vinne, er fremdeles i midten av kartet.<br><br>Men med 40 % mer terreng er det rikelig med plass til å høste nye ressurser og oppdage nye strategier. Begge hovedjunglene er også helt omorganiserte, som har rusket opp i plassering av sikt, steder å finte, høsting og mer.",
  "new_frontiers_map_subtitle": "Utforsk den nye verden",
  "new_frontiers_map_roshan_title": "Roshans nye hjem",
  "new_frontiers_map_roshan_desc": "Roshan har solgt den gamle gropen sin i elva og drar fordel av all den nye plassen. Han har nå [i]to[/i] fantastiske nye groper plassert helt nordvest og sørøst på kartet. Et drømmested for de som digger groper og storslått utsyn til fjellene, og det ligger bare minutter unna de hemmelige butikkene.<br><br>Disse gropene må også være i nærheten av et treningssenter, fordi Roshans er enda kraftigere nå. Roshan slipper ikke lenger Aghanim's Shard og slipper nå Cheese ved det andre dødsfallet istedenfor det tredje. Ved det tredje dødsfallet slipper han nå en Refresher Shard eller et Scepter, avhengig om han er i den nordre eller sørlige gropen.",
  "new_frontiers_map_twin_gates_title": "Tvillingporter",
  "new_frontiers_map_twin_gates_desc": "To porter forbinder nå hjørnene av kartet ved tårnene i den trygge stien, som gjør at spillere kan teleportere fra den ene utkanten av kartet til den andre.<br><br>Dette er en spillendring, men det har åpenbare implikasjoner for historien. Du gjettet riktig: Dota 2 finnes nå uoffisielt i PMUU (Pac Mans utvidede univers).",
  "new_frontiers_map_lotus_pools_title": "Lotusvann",
  "new_frontiers_map_lotus_pools_desc": "Spillere kan nå finne lotusvann på venstre og høyre side av kartet (nær der krypbølgene først møtes). De lager frukt regelmessig, som gir mana og helse ved å spise dem.<br><br>Spillere kan hamstre denne frukten, og deretter kombinere dem til en enda større og bedre frukt senere. Den store frukten kan til og med kombineres til en [i]utrolig[/i] stor frukt. Hva skjer om du kombinerer den [i]utrolig[/i] store frukten? Sikkert ingenting. (Definitivt noe.)",
  "new_frontiers_map_tormentors_title": "Plageånder",
  "new_frontiers_map_tormentors_desc": "Disse to sterke nøytrale krypene dukker opp nær basen etter 20 minutter, og begge har flust med Aghanim’s Shards. Men det er en hake, og det er at det er to haker: 1) Plageånder har megaskjold, som reflekterer mesteparten av skaden du kaster på dem. 2) De vokser seg sterkere hver gang du dreper dem. Så du trenger nok hele laget for å ta knekken på dem.<br><br>Den gode nyheten er at på samme måte som bjørner ignorerer deg for å kveste en turgåer, lar de deg være hvis du lar dem være.",
  "new_frontiers_map_watchers_title": "Våkelys",
  "new_frontiers_map_watchers_desc": "Våkelys er som terminatorer, men for å våke. De er nådeløse. De kjenner ikke smerte. De kjenner ikke frykt. De er late, dog. De begynner ikke å følge med før du har trykket på dem. <br><br>Våkelys begynner kampen uvirksomme og nøytrale, men når de tennes, gir de sikt over området sitt i sju minutter – eller inntil fienden slukker det for å sette det ut av stand en stund. Når et lag dreper Roshan, blir alle våkelys med på deres side.",
  "new_frontiers_map_barriers_title": "Forsvarsporter",
  "new_frontiers_map_barriers_desc": "Forsvarsporter forener all fantasien i Dota med noe så praktisk som dørene til huset ditt, som du kan låse når du skal på butikken for å kjøpe noen trylledrikker. Det er en bakdør til basen med et hendig kraftfelt, som slipper eget lag gjennom og holder fienden ute. Mens fienden banker på hoveddøren, kan du snike deg inn og ut bakveien.",
  "new_frontiers_map_wisdom_runes_title": "Visdomsruner",
  "new_frontiers_map_wisdom_runes_desc": "Utforsk kantene på kartet for å avdekke visdomsruner, som gir XP-økning til alle helter vise nok til å plukke dem opp. Visdomsruner dukker opp nær basen, så de byr på en forsvarlig måte å hindre at en foreløpig tapt kamp løper løpsk.",
  "new_frontiers_map_shield_runes_title": "Skjoldruner",
  "new_frontiers_map_shield_runes_desc": "Elveruner får også et nytt tilskudd med den nye skjoldrunen, som gir deg 50 % av maks helse som en barriere. Kast deg inn under et tårn for å drepe tidlig i kampen – eller gå blindt opp en bakke for å overraske både deg selv og fienden.",
  "new_frontiers_map_named_regions_title": "Navngitte regioner",
  "new_frontiers_map_named_regions_desc": "Det utvidede kartet har nå avgrensede regioner som gruvene, brønnen, gravplassen og statuen, som gjør det enda enklere å gi lagkamerater beskjed om akkurat hvor noen dreper deg. Alle enheter i disse regionene får regionens særegne modifikasjoner.",
  "new_frontiers_map_creep_camps_title": "12 nye krypleirer",
  "new_frontiers_map_creep_camps_desc": "Noen av krypene gikk lei av å bli slaktet hele tiden i jungelen, og har derfor satt opp 12 nye leirer rundt kanten av det utvidede kartet. Så nå kan du slakte dem der også.",
  "new_frontiers_map_outpost_title": "Nye utposter",
  "new_frontiers_map_outpost_desc": "Det nye utvidede kartet har to nye utposter. De opprinnelige utpostene er blitt flyttet til nye steder, som reiser tvil om de faktisk var de opprinnelige utpostene eller ei. Godt forsøk, Sokrates – de er det.",
  "new_frontiers_major_gameplay_features_desc": "Denne grensesprengende oppdateringen innfører store endringer til helter og systemer. Faktisk har den juridiske avdelingen vår rådet oss til å fortelle deg at denne spilldelen er [i]såpass tettpakket[/i] med metadefinerende nye endringer at du bør lese gjennom veldig sakte, gjennom de neste ukene, slik at du ikke blir overstimulert og må ringe brannvesenet.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Utvalgte helter",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Alle heltene er blitt balanserte, men noen er blitt mer endret enn andre. Vi viser frem noen av disse her.",
  "new_frontiers_major_gameplay_new_items_title": "Nye gjenstander",
  "new_frontiers_major_gameplay_new_items_desc": "Bli med på kjøpefesten.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Nye nøytrale gjenstander",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Vi byr på sju helt nye nøytrale gjenstander, og henter tilbake noen gamle favoritter.",
  "new_frontiers_major_gameplay_bkb_title": "Omarbeidet Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Ved bruk påfører Black King Bar nå en grunnleggende fordrivelse, og gir 50 % magiresistens og svekkelsesimmunitet. Du påvirkes ikke av negative effekter fra svekkelser mens den er aktiv. Dessuten har du immunitet mot ren og reflektert skade.<br><br>Men pass på: Hvis Black King Bar utløper før eventuelle svekkelser, får svekkelsene virkning igjen i den gjenværende tiden. Effekter som går gjennom formelimmunitet, går nå også gjennom svekkelsesimmunitet.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Ny type helteattributt",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Da vi gav ut den fjerde åndebroren, Void Spirit, burde han ikke ha vært en styrke-, smidighets- eller intelligenshelt. For å skille seg ut burde han egentlig ha vært en ny type helt. En [i]fjerde[/i] type helt.<br><br>Vi presenterer allsidighetshelter – en gruppe eksisterende helter som har et nytt primært attributt og som nå får 0,6 skade fra hvert av de andre attributtene. Ingeniørene våre forsikrer oss om at dette tallet er aldeles perfekt balansert. Med mindre det ikke er det. Men den gode nyheten er at det skal vi alle finne ut sammen i det storslåtte eventyret av en oppdatering.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Omarbeidet slipp av nøytrale gjenstander",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Å jakte på skapninger i skogen pleide å gi kule nye nøytrale gjenstander … som vanligvis gikk til carryen, som vanligvis ikke var deg. Nå slippes det tilfeldig en mynt når du dreper et nøytralt kryp, som lar deg velge mellom [i]fem[/i] mulige nøytrale gjenstander. Hver mynt byr på alle fem mulighetene, så selv den siste spilleren til å bytte inn mynten sin, har et skikkelig valg.<br><br>Lag kan gi myntene sine til hvem som helst, men når du har valgt en gjenstand, kan den ikke deles. Så fordel myntene med omhu.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Nøytrale kryp vokser",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Nøytrale kryp og evnene deres vokser seg sterkere over tid. Ja, leirer blir vanskeligere å rydde av veien ut i kampen, men helter med evnen til å kontrollere kryp kommer til å ha skikkelig oppbakking.",
  "new_frontiers_major_gameplay_kill_formula_title": "Omarbeidet drapsformel",
  "new_frontiers_major_gameplay_kill_formula_desc": "Vi har endret drapsformelen slik at drap tidlig i kampen er mer virkningsfullt og motiverer spillere til å ganke andre stier. Vi har også redusert gullskalering for stikryp, noe som gjør høsting av kryp mindre lønnsomt lenger ut i kampen, og det oppfordrer spillere til å banke gullet ut av hverandre i stedet.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Ikke like lamslått",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Det er alltid mer moro å spille helten enn å sitte stille uten å spille den. Og ja, fans av å spille ting og kritikere av å ikke spille ting, drømmene deres har gått i oppfyllelse: Gjør dere klare til å spille helten enda mer enn noen gang.<br><br>Hvordan? Enkelt. Vi har redusert varigheten til nesten hver uskadeliggjøring i spillet. Hvordan kom vi frem til denne vanvittige planen? Enda enklere. Vi ble skreket i trynet av en Beastmasters Roar og hadde plutselig mye tid til å tenke.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Etter to måneder med hjemsøking har Muerta endelig funnet Aghanim’s Scepter og Shard. Hvis du ikke har sett henne i aksjon ennå, kan du lese mer på [url=https://www.dota2.com/deadreckoning]Dead Reckoning-oppdateringen[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi er for dum til å være en intelligenshelt. Så nå er han ikke det lenger.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa begynner nå svak som en baby, men som en baby kan hun vokse seg sterkere over tid.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "De fleste av Clinkz’ evner lager nå skjelett. Det skjer lett, om du vil.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden pleide å lage en perfekt klone av seg selv. Men nå lager han en [i]bedre[/i] utgave av seg selv! Eller verre! Annerledes i alle fall. Og uten kontroverser, innbiller vi oss.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Helten Alchemist, som alle Alchemist-spillere, er nå grådig av natur.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ARC WARDEN – TIDSBEGRENSET BONUS",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "I en begrenset tidsperiode når du velger Arc Warden som Dire, blir Tempest Double til hovedhelten, og når du bruker ultimaten, tilkalles hans vanlige selv.",
  "new_frontiers_matchmaking_desc": "La oss være ærlige – det er åtte milliarder personer på planeten, og 99,99 % av dem er elendige i Dota. Det betyr at matchmaking kan være en utfordring, spesielt hvis du er god i Dota og liker å spille med folk som er nesten, men forhåpentlig ikke fullt så gode i Dota som deg. Vi har gjort en hel del arbeid og en hel del matte for å forbedre matchmakingens kvalitet over hele linjen, for spillere på alle ferdighetsnivå.",
  "new_frontiers_matchmaking_intro_title": "Matchmaking med pålitelighet",
  "new_frontiers_matchmaking_intro_desc": "Matchmakingrangen (MMR) består egentlig bare av to tall: rang og rangpålitelighet. Rangen er en vurdering av ferdighet, og rangpålitelighet er hvor pålitelig den vurderingen er. Når du spiller en kamp, justerer vi rangen avhengig av om du vinner eller taper. Rangpålitelighet går også opp, fordi nå har vi mer data.",
  "new_frontiers_matchmaking_details_old_title": "Uønskede klumper: Den verste typen klumper",
  "new_frontiers_matchmaking_details_old_desc": "Dota har vanligvis brukt en modifisert versjon av Elo-algoritmen for å innføre endringer av rang og rangpålitelighet. Men over tid har vi lagt merke til noen problemer med denne fremgangsmåten. For eksempel har fordelingen av MMR gradvis flyttet seg lavere, som har ført til uønskede klumper i intervallet 0–1000 MMR. Et annet problem var at spillere som tok en pause og kom tilbake igjen, hadde vanskeligheter med å komme seg tilbake til en nøyaktig MMR, fordi deres tidligere ferdighetsnivå ikke lenger var representativt for dem.",
  "new_frontiers_matchmaking_details_new_title": "Ny og forbedret klumping",
  "new_frontiers_matchmaking_details_new_desc": "For å ta tak i dette bytter vi til en annen algoritme kalt Glicko, som raskt og nøyaktig skal plassere deg med andre spillere på lignende ferdighetsnivå. Når det kommer til matten, gjør Glicko det bedre for oss å ta med en spillers rangpålitelighet i beregningene våre, som fører til mer nøyaktige beslutninger om økning eller tap av rang.\\n\\nDette byttet til det nye matchmakingsystemet kommer til å være litt som begynnelsen på en ny matchmakingsesong: [list][*]Alle spillere plasseres tilbake i en kort kalibrering, som tar utgangspunkt i tidligere rang.\\n[*]Kalibrering er ikke lenger et bestemt antall kamper. En spiller blir istedenfor ferdig kalibrert når rangpåliteligheten deres er over en viss terskel.\\n[*]Ved kalibrering ender du trolig opp med en annen medalje enn den du hadde tidligere. Selv om medaljen endres betydelig, bør du forvente å spille med spillere på lignende ferdighetsnivå.\\n[*]Kampene har ikke lenger fast MMR-økning/-tap. Det kommer an på en rekke faktorer, deriblant rangen og rangpåliteligheten til deltakerne. Vi begrenser derimot økning/tap per kamp for å hindre særlig negative utfall.[*]En spillers rangpålitelighet senkes over tid hvis spilleren ikke spiller kamper.[/list]Vi har kjørt begge matchmakingsystemene bak kulissene en stund nå for å gjøre oss tryggere på disse endringene. Vi skjønner at nøyaktig MMR bare er én av mange faktorer som påvirker kampkvaliteten, og som med alle endringer på dette området vil vi gjerne høre hva dere synes.",
  "new_frontiers_matchmaking_immortals_title": "Immortal matchmaking",
  "new_frontiers_matchmaking_immortals_desc": "I rangen Immortal er det viktigere å kjenne de andre spillerne, være på samme bølgelengde og velge en fin rollebalanse enn bare MMR. Så vi har omgjort matchmakingen for de i Immortal for å ta høyde for dette.<br><br>Kamper i Immortal deler ikke lenger inn i lag på forhånd. I stedet får to kapteiner velge de åtte andre spillerne til hvert lag, som kan gjøre laget mer slagkraftig enn hvis du var avhengig av at MMR delte opp lagene. Så hvis kampen er dritt nå, kan dere bare skylde på dere selv, Immortals.",
  "new_frontiers_ui_desc": "Sløret syn og stikkende smerter nedover armen? Vårt råd er å ignorere det, det er bare kroppens måte å si at den er sulten. Punktert dekk? Kjør på felgen – den er jo fremdeles rund. Poenget er: Stort sett alt i livet kan trygt ignoreres uten følger.<br><br>Unntatt helselinjene i Dota. Det er viktige saker. Og derfor får en hel del helserelatert informasjon i grensesnittet en enorm oppgradering i denne oppdateringen.",
  "new_frontiers_ui_shields_title": "Barrierer på helselinjen",
  "new_frontiers_ui_shields_desc": "Viste du at Dota har skjold? Magiske skjold, fysiske skjold, afotiske skjold. Alle slags skjold! Kanskje du gikk glipp av dem. Eller hovedsakelig ignorerte dem. Fordi det var ingen måte å vite hvor mye skjold du begynte med eller hvor mye du hadde igjen.<br><br>Men nå trenger du ikke lenger leve i uvisshet. Nå kan du se alt – eller i hvert fall begge de to tingene. Du kan til og med se hva slags skjold det er. For å feire hvor mye bedre alle de gamle skjoldene er med denne visuelle oppgraderingen, har vi lagt til en rekke nye evner som har dem.<br><br>Vi har også døpt dem om fra skjold til barrierer, så du ikke blir forvirret og tror det er en Vanguard på helselinjen. Bare hyggelig.",
  "new_frontiers_ui_health_pips_title": "Merker på helselinjen",
  "new_frontiers_ui_health_pips_desc": "Noen enheter har ikke vanlige helsepotter og krever et visst antall angrep for å bli ødelagt. Nå, istedenfor den vanlige gjettingen eller telling i hodet som et slags geni, kan du bare se på enheten du vil ta av dage. Der får du se noen nyttige små merker som representerer antall treff den kan ta, før den har kastet disse støvets lenker (sitat fra Hamlets helselinje).",
  "new_frontiers_ui_health_cost_title": "Helsekostnad",
  "new_frontiers_ui_health_cost_desc": "Selv om de fleste evnene i Dota bruker mana, er det noen som bruker helse i stedet. Nå viser disse evnene faktisk helsekostnaden sin. Ikke verst, hva? Faktisk ganske rart at ingen tenkte på å legge det der tidligere. Ja, ja, nå er det der.",
  "new_frontiers_gameplay_update_desc": "Det var en diger liste med greier der oppe. Det eneste som kan gjøre det bedre, er [i]to[/i] digre lister med greier, men hvor skal vi finne … [i]neimen se her![/i] Les videre for alle de andre balanseendringene denne oppdateringen har å by på. Eller bare hopp rett inn i spillet og spill selv. Tro oss, du trenger ikke fortelle oss hvor gøy det er å lese tekniske håndbøker om videospill, men altså, å spille dem kommer på en god andreplass. Denne listen ligger fremdeles her når du kommer tilbake.",
  "new_frontiers_misc_title": "Diverse",
  "new_frontiers_misc_role_tokens": "Vi har redusert antallet rollekøpolletter som tildeles når du taper en kamp med alle roller valgt. Nå tjener du to polletter for et tap. (Seier gir fremdeles alle fire pollettene.) Denne endringen skal hjelpe med å forbedre atferden til spillere rundt rangerte roller, der samling av polletter av og til ble viktigere enn å spille en tilordnet rolle på en effektiv måte.",
  "new_frontiers_misc_removed_roles": "Vi har fjernet Captains Mode fra rangert og All Random og All Random Deathmatch fra urangert. Nesten ingen spiller disse modusene, og køene blir ofte over en time lange.",
  "new_frontiers_misc_model_editor": "Denne oppdateringen fjerner det gamle modellredigeringsprogrammet. Alle vmdl-filer lastes nå i det nye verktøyet, og gamle modeller konverteres når du først laster dem i verktøyet. Vi kommer til å gi ut en etterfølgende oppdatering for å fullstendig fjerne støtte for lasting av det gamle kompilerte formatet, så vi oppfordrer alle skapere i workshopen til å laste og konvertere modellene sine til det nye formatet, og kompilere dem på nytt, så snart det lar seg gjøre.",
  "new_frontiers_misc_hold_animation": "Vi har fjernet støtte for den gamle nøkkelen «HoldAnimation» fra dynamiske rekvisitter. Tilpassede spill bør enten manuelt bytte over til den nye nøkkelen «loop mode», eller kompilere kartene på nytt for å automatisk oppgradere disse egenskapene.",
  "neutral_item_tier": "[b]Kategori %1$s[/b] – nøytral gjenstand",
  "dota_ability_variable_health": "helse",
  "dota_ability_variable_mana": "mana",
  "dota_ability_variable_armor": "rustning",
  "dota_ability_variable_damage": "skade",
  "dota_ability_variable_str": "styrke",
  "dota_ability_variable_int": "intelligens",
  "dota_ability_variable_agi": "smidighet",
  "dota_ability_variable_all": "alle attributter",
  "dota_ability_variable_primary_attribute": "primært attributt",
  "dota_ability_variable_attack": "angrepshastighet",
  "dota_ability_variable_hp_regen": "helseregenerasjon",
  "dota_ability_variable_lifesteal": "helseran",
  "dota_ability_variable_mana_regen": "manaregenerasjon",
  "dota_ability_variable_mana_regen_aura": "manaregenerasjonsaura",
  "dota_ability_variable_spell_amp": "formelskade",
  "dota_ability_variable_debuff_amp": "svekkelsesvarighet",
  "dota_ability_variable_move_speed": "bevegelseshastighet",
  "dota_ability_variable_evasion": "unnvikelse",
  "dota_ability_variable_spell_resist": "magiresistens",
  "dota_ability_variable_spell_lifesteal": "formelhelseran",
  "dota_ability_variable_spell_lifesteal_creep": "formelhelseran (kryp)",
  "dota_ability_variable_spell_lifesteal_hero": "formelhelseran (helt)",
  "dota_ability_variable_selected_attrib": "valgt attributt",
  "dota_ability_variable_attack_range": "angrepsrekkevidde <font color='#7d7d7d'>(kun fjernkamp)</font>",
  "dota_ability_variable_attack_range_melee": "angrepsrekkevidde <font color='#7d7d7d'>(kun nærkamp)</font>",
  "dota_ability_variable_cast_range": "bruksrekkevidde",
  "dota_ability_variable_status_resist": "statusresistens",
  "dota_ability_variable_projectile_speed": "prosjektilhastighet",
  "dota_ability_variable_manacost_reduction": "redusert manakostnad",
  "dota_ability_variable_cooldown_reduction": "nedkjølingsreduksjon",
  "dota_ability_variable_max_mana_percentage": "ekstra maks mana",
  "dota_ability_variable_aoe_bonus": "ekstra virkeområde"
}