// 2017.js

{
  "language": "french",
  "new_frontiers_gameplay_number": "Mise à jour du gameplay 7.33",
  "new_frontiers_title": "Mise à jour des frontières redessinées",
  "new_frontiers_title_short": "Frontières redessinées",
  "new_frontiers_subtitle": "Une nouvelle carte, des modifications majeures apportées au gameplay et bien plus encore ! Un tout nouveau monde vous attend.",
  "new_frontiers_play_trailer": "Voir la bande-annonce",
  "new_frontiers_dota_team_intro": "La mise à jour des frontières redessinées est là : découvrez une nouvelle carte, des modifications du gameplay majeures, des changements au niveau du matchmaking et de l'interface, et — sans rire — une tonne d'autres altérations.<br><br>« Combien ? », nous demanderez-vous. Tellement qu'il devient difficile de se souvenir de toutes. Ça nous a fait paniquer pendant quelques jours, mais heureusement que quelqu'un nous a rappelé qu'on pouvait tout simplement en garder une trace écrite… Ce qu'on a fait. Maintenant, on peut tout lire, tout comme vous ! Faites défiler pour commencer votre lecture.",
  "new_frontiers_eldor_name": "Eldor le sorcier",
  "new_frontiers_dota_team_name": "L'équipe de Dota",
  "new_frontiers_section_title_map": "Nouvelle carte",
  "new_frontiers_section_title_major_gameplay": "Modifications du gameplay majeures",
  "new_frontiers_section_title_matchmaking": "Matchmaking",
  "new_frontiers_section_title_ui": "Interface",
  "new_frontiers_section_title_gameplay_update": "Changements d'équilibrage",
  "new_frontiers_map_introduction": "La carte de Dota a été massivement étendue. L'objectif principal du jeu ne change pas, la taille des lanes est identique, et tout ce dont vous avez besoin pour gagner est toujours au cœur de la carte.<br><br>Mais un terrain 40 % plus grand, c'est d'autant plus d'espace pour collecter de nouvelles ressources et mettre au point des stratégies inédites. Les deux jungles principales ont également été revues de fond en comble, modifiant ainsi la disposition des obstacles, l'agencement des sentiers et des camps de creeps, et bien d'autres choses encore.",
  "new_frontiers_map_subtitle": "Explorez un monde nouveau",
  "new_frontiers_map_roshan_title": "Nouveaux antres de Roshan",
  "new_frontiers_map_roshan_desc": "Roshan a vendu sa vieille fosse située dans la rivière et a investi dans du neuf : [i]deux[/i] nouveaux antres magnifiques placés aux extrémités nord-ouest et sud-est de la carte. Ces antres profitent d'un merveilleux vis-à-vis sur les fontaines et sont tout près des échoppes secrètes.<br><br>Ils doivent surement être aussi non loin d'une salle de sport, car Roshan a gagné en masse. En plus, Roshan ne donne plus d'exemplaires d'Aghanim's Shard, et lâche maintenant Cheese à sa deuxième mort au lieu de sa troisième. À partir de sa troisième mort, il lâche soit Refresher Shard, soit Aghanim's Scepter, selon qu'il se trouve dans son antre du nord ou du sud.",
  "new_frontiers_map_twin_gates_title": "Portails",
  "new_frontiers_map_twin_gates_desc": "Deux portails relient maintenant les extrémités de la carte près des tours de la Safe Lane, et vous pouvez les utiliser pour vous téléporter instantanément d'un coin de la carte vers l'autre.<br><br>Il s'agit d'un changement au niveau du gameplay, mais ceci n'est bien évidemment pas sans implication sur l'histoire de Dota. Vous l'avez deviné : Dota 2 existe maintenant de manière officieuse dans l'univers étendu de Pac-Man.",
  "new_frontiers_map_lotus_pools_title": "Bassins de lotus",
  "new_frontiers_map_lotus_pools_desc": "Des bassins de lotus ont été disposés aux côtés gauche et droit de la carte, près du premier point de rencontre des vagues de creeps. Des lotus y apparaissent de temps en temps : ils accordent des PV et du mana quand on les mange.<br><br>Ces lotus peuvent être stockés et combinés en une version améliorée au fil de la partie. Cette version améliorée peut elle-même être combinée en un lotus [i]gigantesque[/i]. Et qu'est-ce qui se passe si l'on combine ce lotus [i]gigantesque[/i] ? Probablement rien. (À vous de voir.)",
  "new_frontiers_map_tormentors_title": "Fossoyeurs",
  "new_frontiers_map_tormentors_desc": "Ces deux bâtiments surpuissants apparaissent près de chaque base au bout de la 20ᵉ minute, et ils sont prêts à vous donner moult Aghanim’s Shards. Mais il faut les mériter : non seulement les fossoyeurs sont équipés de mégaboucliers qui renvoient la plupart des dégâts subis, mais ils gagnent en puissance à chaque fois qu'ils sont détruits. Si vous comptez en décimer un, mieux vaut faire appel à toute votre équipe.<br><br>Une bonne nouvelle toutefois : comme les abeilles, si vous les laissez tranquilles, ils vous laisseront tranquille.",
  "new_frontiers_map_watchers_title": "Vigiles",
  "new_frontiers_map_watchers_desc": "Les vigiles sont comme des Terminators… mais ont comme simple mission de surveiller. Ils sont implacables. Ils ne connaissent ni la douleur ni la peur. Mais ils sont fainéants. Pour qu'ils commencent leur mission, il faut les réveiller en cliquant dessus.<br><br>Au début de la partie, les vigiles sont inactifs et ne sont associés à aucune équipe. Une fois activés, ils accordent la vision de la zone pendant 7 minutes, ou jusqu'à ce que l'équipe adverse ne les désactive temporairement. Quand une équipe vient à bout de Roshan, tous les vigiles de la carte s'activent pour elle.",
  "new_frontiers_map_barriers_title": "Barrières de protection",
  "new_frontiers_map_barriers_desc": "Les barrières de protection combinent le côté fantastique de Dota et l'aspect pratique des portes de votre domicile : comme ces dernières, vous pouvez les fermer à clé quand vous partez à la supérette pour détruire son Ancient. Cette porte dérobée est dotée d'un champ de force qui laisse passer les membres de votre équipe, mais bloque l'accès à votre base à l'équipe adverse. Quand l'équipe ennemie attaque votre base, vous pouvez l'emprunter pour vous faufiler par derrière.",
  "new_frontiers_map_wisdom_runes_title": "Runes de Wisdom",
  "new_frontiers_map_wisdom_runes_desc": "Explorez les recoins de la carte pour déterrer des runes de Wisdom, qui accordent de l'XP aux unités héroïques les plus aventureuses. Ces runes apparaissent près de votre base et vous donnent ainsi la possibilité de renverser le cours d'une partie qui semble compromise.",
  "new_frontiers_map_shield_runes_title": "Runes de Shield",
  "new_frontiers_map_shield_runes_desc": "Une nouvelle rune fait aussi son entrée parmi les runes de la rivière : la rune de Shield. Celle-ci accorde un bouclier qui équivaut à 50 % de vos PV max. Cette protection ouvre la porte à bon nombre de stratégies : jetez-vous sous une tour adverse pour faire une victime en début de partie, ou bien escaladez à l'aveugle un terrain en hauteur pour tenter de prendre l'équipe ennemie par surprise.",
  "new_frontiers_map_named_regions_title": "Régions spécifiques",
  "new_frontiers_map_named_regions_desc": "La carte étendue dispose maintenant de régions distinctes : les mines, le puits, le cimetière et la statue. Il est maintenant encore plus facile d'indiquer à votre équipe où vous êtes en train de vous faire attaquer. Toutes les unités présentes dans ces régions bénéficient de bonus spécifiques.",
  "new_frontiers_map_creep_camps_title": "12 nouveaux camps de creeps",
  "new_frontiers_map_creep_camps_desc": "Certains creeps étaient las de se faire massacrer sans cesse dans la jungle. En conséquence se sont établis 12 nouveaux camps, répartis sur l'ensemble de la nouvelle carte. Maintenant, vous savez où les trouver pour les massacrer à nouveau.",
  "new_frontiers_map_outpost_title": "Nouveaux avant-postes",
  "new_frontiers_map_outpost_desc": "La nouvelle carte dispose de deux nouveaux avant-postes. Les avant-postes existants ont été déplacés. Pour différencier les nouveaux des anciens, on s'est demandé si on ne devait pas les appeler les « après-postes ».",
  "new_frontiers_major_gameplay_features_desc": "La mise à jour des frontières redessinées apporte des modifications majeures à vos unités héroïques et concepts favoris. À dire vrai, notre service juridique nous a conseillé de vous dire que, comme cette section sur les changements relatifs au gameplay est [i]archibondée[/i] de nouvelles fonctionnalités qui altèrent la méta, vous devriez prendre le temps de la parcourir lentement, sur plusieurs semaines, afin d'éviter que votre tête ne surchauffe et que vous ne deviez appeler les secours.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Modifications héroïques majeures",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Toutes les unités héroïques ont subi un rééquilibrage, mais certaines plus que d'autres… Les voici mises à l'honneur.",
  "new_frontiers_major_gameplay_new_items_title": "Nouveaux objets",
  "new_frontiers_major_gameplay_new_items_desc": "Tout ce que vous avez toujours rêvé d'acheter.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Nouveaux objets neutres",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Ce sont sept nouveaux objets neutres qui viennent s'ajouter à la liste, en plus d'anciens objets qui font leur grand retour.",
  "new_frontiers_major_gameplay_bkb_title": "Modifications apportées à Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Black King Bar applique maintenant une dissipation basique et accorde 50 % de résistance à la magie ainsi que l'immunité contre les effets négatifs. Pendant sa durée, les effets négatifs sont neutralisés, et vous bénéficiez d'une immunité contre les dégâts purs et renvoyés.<br><br>Mais attention : si l'effet de Black King Bar expire avant la fin des effets négatifs, ces derniers seront appliqués le reste de la durée. Les effets qui outrepassent l'immunité contre la magie outrepassent maintenant également l'immunité contre les effets négatifs.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Nouvel attribut héroïque",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Void Spirit, le quatrième frère esprit qui a fait son entrée dans le monde de Dota, n'aurait pas dû être une unité héroïque de type force, agilité ou intelligence. Pour vraiment se démarquer des autres, il aurait dû constituer un nouveau type d'unité héroïque. Un [i]quatrième[/i] genre d'unité héroïque.<br><br>Cette mise à jour ajoute un quatrième attribut : la polyvalence. Les unités héroïques polyvalentes gagnent 0,6 de dégâts par point de chaque attribut. Notre équipe surdiplômée en charge de l'équilibrage assure que cette valeur a été choisie avec grande précision… mais reste à voir quels sont ses effets concrets sur le terrain. Nous pourrons le découvrir ensemble au cours de cette formidable aventure que promet d'être cette mise à jour des frontières redessinées.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Méthode d'obtention des objets neutres modifiée",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Auparavant, le massacre de créatures de la forêt était souvent récompensé par un superbe objet neutre… et cet objet allait en général à l'unité héroïque Carry de l'équipe, qui n'était pas vous la plupart du temps. Maintenant, les creeps neutres ont une chance de lâcher un jeton à leur mort. Vous pouvez l'utiliser pour choisir parmi [i]cinq[/i] objets neutres. Chaque jeton offre une sélection de cinq objets : ainsi, même la dernière personne à activer son jeton a l'embarras du choix.<br><br>Les jetons peuvent être partagés à souhait, mais une fois qu'un objet est choisi, celui-ci ne peut pas être partagé. Utilisez donc vos jetons avec discernement !",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Amélioration progressive des creeps neutres",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Les creeps neutres et leurs capacités gagnent maintenant en puissance au fil du temps. Les camps deviendront donc plus difficiles à décimer en fin de partie, mais les unités héroïques ayant la capacité de contrôler les creeps promettent d'être redoutables.",
  "new_frontiers_major_gameplay_kill_formula_title": "Nouvelle formule de récompense par victime",
  "new_frontiers_major_gameplay_kill_formula_desc": "La formule de récompense par victime a été modifiée afin d'accroitre l'impact des victimes en début de partie et de motiver les embuscades dans d'autres lanes. En outre, nous avons réduit l'augmentation progressive de la prime d'or des creeps de lane afin de rendre le farming de creeps moins profitable au fil de la partie et ainsi plutôt encourager les combats d'équipe pour obtenir de l'or.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Gardez le contrôle",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Dota est bien plus amusant quand on peut contrôler son unité héroïque. Vous êtes d'accord ? Bonne nouvelle : préparez-vous à l'incarner d'autant plus.<br><br>Comment ? Facile. La durée de presque toutes les neutralisations a été réduite. Comment est-ce qu'on a eu cette idée de génie ? Encore plus facile. On s'est pris Roar de Beastmaster en pleine figure, ce qui nous a largement laissé le temps d'y réfléchir.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Cela fait maintenant plus de deux mois que Muerta hante les lanes, et elle a enfin trouvé son Aghanim’s Scepter et son Aghanim’s Shard. Son nom ne vous dit rien ? Découvrez-la sur la [url=https://www.dota2.com/deadreckoning]page de la mise à jour Dead Reckoning[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi est trop bête pour avoir l'intelligence comme attribut principal : il a donc logiquement perdu cet attribut.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "En début de partie, Medusa est maintenant faiblarde comme un bébé. Mais comme un bébé, elle peut devenir plus forte.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "La plupart des capacités de Clinkz font maintenant apparaitre des squelettes.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden avait la capacité de créer un clone parfait de lui-même. Mais maintenant, il peut créer une [i]meilleure[/i] version de lui-même ! Ou pire ! Dans tous les cas, il s'agit d'une version différente. Et qui n'est pas du tout sujette à controverse.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Alchemist, comme toutes les personnes qui l'incarnent, est maintenant cupide par nature.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "EFFET LIMITÉ POUR ARC WARDEN",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Pour une durée limitée, quand vous choisissez Arc Warden dans l'équipe du Dire, le clone de Tempest Double est votre unité héroïque principale, et lancer sa capacité ultime invoque sa version « normale ».",
  "new_frontiers_matchmaking_desc": "Soyons honnêtes une seconde : il y a huit milliards d'êtres humains sur cette planète, et 99 % d'entre eux sont absolument nuls à Dota… ce qui rend la tâche de création de parties complexe. Surtout si vous avez un bon niveau et que vous souhaitez jouer avec des personnes qui sont presque, mais pas tout à fait non plus, aussi bonnes que vous. Grâce à diverses modifications et formules mathématiques, nous avons amélioré la qualité du système de matchmaking pour l'ensemble des rangs.",
  "new_frontiers_matchmaking_intro_title": "Un matchmaking de confiance",
  "new_frontiers_matchmaking_intro_desc": "Le MMR n'est en réalité calculé qu'à partir de deux valeurs : votre rang et l'indice de confiance relatif à ce rang. Votre rang est une estimation de votre niveau, tandis que l'indice de confiance mesure à quel point cette estimation est correcte. Quand vous participez à une partie, votre rang est modifié selon si vous gagnez ou si vous perdez. Votre indice de confiance augmente également, car des données supplémentaires ont pu être collectées.",
  "new_frontiers_matchmaking_details_old_title": "Les problèmes de l'ancien algorithme",
  "new_frontiers_matchmaking_details_old_desc": "Depuis toujours, Dota utilise une version modifiée de l'algorithme Elo pour ajuster les rangs et les indices de confiance. Au fil du temps, nous avons toutefois remarqué quelques problèmes avec cette approche. Par exemple, la distribution des MMR est progressivement descendue, ce qui a eu comme effet indésirable d'agglomérer un certain nombre de personnes dans un intervalle de 0 à 1 000 de MMR. Entre autres, les personnes qui faisaient une pause avaient du mal à retrouver un MMR juste quand elles reprenaient le jeu, car leur ancien niveau n'était plus représentatif.",
  "new_frontiers_matchmaking_details_new_title": "Nouvel algorithme amélioré",
  "new_frontiers_matchmaking_details_new_desc": "Afin de résoudre ces problèmes, nous prévoyons d'utiliser un autre algorithme, Glicko, qui devrait vous permettre de jouer avec des personnes d'un niveau similaire de manière précise et rapide. D'un point de vue mathématique, Glicko nous permet de mieux prendre en compte l'indice de confiance d'une personne dans nos calculs, ce qui résulte en des décisions plus précises au niveau des gains et pertes de rang.\\n\\nLa transition donnera l'impression qu'une nouvelle saison de matchmaking a commencé. [list][*]Tout le monde devra effectuer une courte calibration. Cette calibration est basée sur le rang de la saison précédente.\\n[*]La calibration ne correspond plus à un nombre fixe de parties. À la place, la calibration se termine quand l'indice de confiance du rang atteint un certain seuil.\\n[*]À la fin de la calibration, vous obtiendrez surement une médaille différente de celle que vous aviez avant. Toutefois, même si votre médaille change considérablement, vous devriez participer à des parties avec des personnes de même niveau.\\n[*]Le gain ou la perte de MMR ne sera plus fixe. À la place, le nombre de points de MMR gagnés ou perdus chaque partie dépendra de certains facteurs, comme les rangs et l'indice de confiance des rangs des personnes dans la partie. Il y aura toutefois une limite de points gagnés ou perdus, notamment pour éviter des conséquences trop négatives.\\n[*]Votre indice de confiance décroitra au fil du temps si vous ne jouez pas.[/list]\\nCela fait maintenant quelque temps que les deux systèmes de matchmaking sont utilisés en coulisse afin d'évaluer ces changements. Nous comprenons qu'un MMR seul ne constitue qu'un facteur parmi tant d'autres qui contribuent à la qualité des parties, et comme toutes les modifications de ce type, nous avons hâte de connaitre vos retours.",
  "new_frontiers_matchmaking_immortals_title": "Matchmaking pour les personnes de rang Immortal",
  "new_frontiers_matchmaking_immortals_desc": "Pour les joueurs et joueuses de rang Immortal, le MMR importe bien moins que leurs partenaires de jeu, une bonne entente au sein du groupe et un bon équilibrage des équipes. À cet effet, nous avons apporté des modifications au système de matchmaking pour le rang Immortal.<br><br>À partir d'aujourd'hui, les parties avec des personnes de rang Immortal n'ont plus d'équipes préconstituées. À la place, deux capitaines ont la charge de choisir les quatre autres personnes qui viendront composer leur équipe. Ainsi, chaque équipe a maintenant un impact beaucoup plus fort que lorsque le MMR seul était pris en compte. Aux joueuses et joueurs concernés : si vos parties se passent mal désormais, vous ne pouvez vous en prendre qu'à vous !",
  "new_frontiers_ui_desc": "Vous voyez flou et vous avez des douleurs lancinantes dans le bras ? Rien de grave : c'est juste votre corps qui vous dit qu'il a faim. Votre pneu a crevé ? Continuez à rouler : la jante est encore ronde, après tout. Voici où on veut en venir : on peut quasiment tout traiter avec indifférence dans la vie, ce sans conséquences majeures.<br><br>Sauf pour les barres de PV de Dota. Les ignorer peut couter cher. C'est pour cela que de nombreux éléments de l'interface relatifs aux points de vie ont reçu une amélioration dans le cadre de cette mise à jour.",
  "new_frontiers_ui_shields_title": "Affichage des protections",
  "new_frontiers_ui_shields_desc": "Vous saviez qu'il y avait des boucliers dans Dota ? Des boucliers magiques, physiques, aphotiques… Il y en a de toutes sortes ! Ça vous a peut-être échappé, ou vous avez simplement décidé de ne pas y prêter attention, car il n'y avait aucun moyen de savoir le nombre de dégâts que le bouclier pouvait encaisser dès son application ou à un instant t.<br><br>Ces temps d'incertitude prennent fin aujourd'hui : maintenant, vous pouvez tout voir. Du moins, ces deux choses-là. Et vous pouvez aussi voir le type de bouclier. Pour célébrer ces améliorations visuelles, un grand nombre de nouvelles capacités appliquent des boucliers.<br><br>Enfin, ces boucliers s'appellent maintenant des « protections », terme qu'on aurait peut-être dû utiliser dès le début…",
  "new_frontiers_ui_health_pips_title": "Barres de vie segmentées",
  "new_frontiers_ui_health_pips_desc": "Certaines unités ne disposent pas d'une barre de vie classique et un certain nombre d'attaques sont nécessaires pour en venir à bout. Plus besoin de deviner ou de compter la quantité d'attaques requises : il vous suffit de regarder l'unité que vous voulez faire tomber. La barre de vie de ce type d'unité est maintenant segmentée de manière à représenter le nombre de coups à lui infliger avant de jeter dans son cœur expirant un froid inconnu (citation de la barre de vie de [i]Phèdre[/i]).",
  "new_frontiers_ui_health_cost_title": "Couts en PV",
  "new_frontiers_ui_health_cost_desc": "Une bonne partie des capacités de Dota ont besoin de mana, mais certaines ont besoin de PV. Pour ces dernières, le cout en PV est maintenant affiché. Pas mal, hein ? C'est fou que personne n'y ait pensé avant. Mais maintenant, c'est fait.",
  "new_frontiers_gameplay_update_desc": "Eh bien, ça en fait, des choses ! Qu'est-ce qui pourrait surpasser cette liste, à part une [i]deuxième[/i] liste gigantesque comme celle-ci… [i]Hé mais regardez ![/i]<br>Continuez à faire défiler pour lire les autres changements d'équilibrage de cette mise à jour. Ou, si vous n'avez pas peur de l'inconnu, jetez-vous dans le grand bain en lançant directement une partie. On vous l'accorde, c'est super amusant de lire les notices techniques des jeux… mais y jouer, c'est aussi bien. Cette liste ne disparaitra pas sous peu : vous pouvez y revenir quand vous voulez.",
  "new_frontiers_misc_title": "Divers",
  "new_frontiers_misc_role_tokens": "Nous avons réduit le nombre de jetons accordés à la sélection de rôles quand vous perdez un match où tous les rôles ont été sélectionnés. Une défaite vous accorde maintenant deux jetons (une victoire vous en octroie toujours quatre). Ce changement devrait permettre d'améliorer le comportement des joueurs et joueuses face au matchmaking classé avec rôles, quand parfois l'accumulation de jetons recevait trop d'importance aux dépens de la prise au sérieux des rôles assignés.",
  "new_frontiers_misc_removed_roles": "Captains Mode a été supprimé des modes disponibles en matchmaking classé. De même, All Random et All Random Deathmatch ont été supprimés des modes disponibles en matchmaking non classé. Quasiment personne ne joue à ces modes et les temps de recherche sont fréquemment supérieurs à une heure.",
  "new_frontiers_misc_model_editor": "Cette mise à jour supprime l'ancien éditeur de modèle. Tous les fichiers vmdl seront maintenant chargés dans le nouvel outil et les anciens modèles seront convertis lors de votre premier chargement. Nous sortirons une mise à jour ultérieure pour supprimer complètement la prise en charge de la mise en ligne de l'ancien format compilé. Il est donc conseillé de convertir vos anciens modèles au nouveau format et de les recompiler au plus vite.",
  "new_frontiers_misc_hold_animation": "L'ancienne clé « HoldAnimation » n'est plus prise en charge au sein des modèles dynamiques. Les parties personnalisées devront soit basculer manuellement sur la nouvelle clé « loop mode », soit recompiler leurs cartes afin de mettre à jour automatiquement leurs propriétés.",
  "neutral_item_tier": "Objet neutre de [b]niv. %1$s[/b]",
  "dota_ability_variable_health": "PV",
  "dota_ability_variable_mana": "de mana",
  "dota_ability_variable_armor": "d'armure",
  "dota_ability_variable_damage": "de dégâts",
  "dota_ability_variable_str": "de force",
  "dota_ability_variable_int": "d'intelligence",
  "dota_ability_variable_agi": "d'agilité",
  "dota_ability_variable_all": "pour tous les attributs",
  "dota_ability_variable_primary_attribute": "pour l'attribut principal",
  "dota_ability_variable_attack": "de vitesse d'attaque",
  "dota_ability_variable_hp_regen": "de régénération de PV",
  "dota_ability_variable_lifesteal": "de vol de vie",
  "dota_ability_variable_mana_regen": "de régénération de mana",
  "dota_ability_variable_mana_regen_aura": "de régénération de mana (aura)",
  "dota_ability_variable_spell_amp": "de dégâts des sorts",
  "dota_ability_variable_debuff_amp": "de durée pour les effets négatifs",
  "dota_ability_variable_move_speed": "de vitesse de déplacement",
  "dota_ability_variable_evasion": "d'évasion",
  "dota_ability_variable_spell_resist": "de résistance à la magie",
  "dota_ability_variable_spell_lifesteal": "de vol de vie pour les sorts",
  "dota_ability_variable_spell_lifesteal_creep": "de vol de vie pour les sorts (creeps)",
  "dota_ability_variable_spell_lifesteal_hero": "de vol de vie pour les sorts (unités héroïques)",
  "dota_ability_variable_selected_attrib": "pour l'attribut sélectionné",
  "dota_ability_variable_attack_range": "de portée d'attaque <font color='#7d7d7d'>(à distance seulement)</font>",
  "dota_ability_variable_attack_range_melee": "de portée d'attaque <font color='#7d7d7d'>(au corps à corps seulement)</font>",
  "dota_ability_variable_cast_range": "de portée d'incantation",
  "dota_ability_variable_status_resist": "de résistance aux statuts",
  "dota_ability_variable_projectile_speed": "de vitesse pour les projectiles",
  "dota_ability_variable_manacost_reduction": "de réduction des couts en mana",
  "dota_ability_variable_cooldown_reduction": "de réduction des temps de recharge",
  "dota_ability_variable_max_mana_percentage": "de mana max."
}