// 5011.js

{
  "language": "portuguese",
  "new_frontiers_gameplay_number": "Atualização de jogabilidade 7.33",
  "new_frontiers_title": "Atualização New Frontiers",
  "new_frontiers_title_short": "New Frontiers",
  "new_frontiers_subtitle": "Um mapa novo, grandes mudanças na jogabilidade e muito mais. Um mundo completamente novo para explorar.",
  "new_frontiers_play_trailer": "Ver trailer",
  "new_frontiers_dota_team_intro": "A atualização New Frontiers inclui um mapa novo, grandes alterações à jogabilidade e à interface, mudanças no matchmaking e (sem exagerar) muito, muito mais.<br><br>É tanta coisa que ficou difícil memorizar tudo e até entrámos em pânico durante alguns dias até que alguém se lembrou que podíamos simplesmente anotar tudo. E foi isso que fizemos. Agora podemos ler quando quisermos. E tu também! Desce na página para leres as novidades.",
  "new_frontiers_eldor_name": "Eldor, o feiticeiro",
  "new_frontiers_dota_team_name": "A equipa do Dota",
  "new_frontiers_section_title_map": "Mapa novo",
  "new_frontiers_section_title_major_gameplay": "Grandes alterações à jogabilidade",
  "new_frontiers_section_title_matchmaking": "Matchmaking",
  "new_frontiers_section_title_ui": "Interface de utilizador",
  "new_frontiers_section_title_gameplay_update": "Alterações ao equilíbrio",
  "new_frontiers_map_introduction": "O mapa do Dota foi expandido consideravelmente. O objetivo principal continua a ser o mesmo: as lanes ainda estão à mesma distância uma da outra e tudo o que precisas para vencer ainda está no centro do mapa.<br><br>Porém, com mais 40% de terreno, tens bastante espaço para juntar novos recursos e descobrir novas estratégias. As duas selvas principais também foram refeitas, mudando o posicionamento de visão, rotas de fuga, farming e muito mais.",
  "new_frontiers_map_subtitle": "Explora o novo mundo",
  "new_frontiers_map_roshan_title": "As novas tocas do Roshan",
  "new_frontiers_map_roshan_desc": "O Roshan vendeu o seu antigo covil no rio e está a tirar partido de todos estes novos terrenos. Ele tem agora [i]dois[/i] novos e fantásticos covis situados no noroeste e sudeste do mapa, com vista para as Fontes e a minutos de distância das Lojas Secretas.<br><br>Estes covis devem ter algum ginásio por perto, porque agora o Roshan está ainda mais rijo. Além disso, já não deixa para trás Aghanim's Shards quando morre (e larga um Cheese quando morre pela segunda vez em vez da terceira). Ao morrer pela terceira vez, ele deixa para trás um Refresher Shard (se morrer no covil de cima) ou um Aghanim's Scepter (se morrer no covil de baixo).",
  "new_frontiers_map_twin_gates_title": "Portais Geminados",
  "new_frontiers_map_twin_gates_desc": "Dois portais, situados perto das torres das safe lanes (noroeste e sudeste), conectam os cantos do mapa e permitem que os jogadores se teletransportem instantaneamente de uma extremidade do mapa para a outra).<br><br>Esta é só uma alteração a nível da jogabilidade, mas pode ter consequências na história do jogo. É isso mesmo: o Dota 2 agora existe não‑oficialmente no UEPM (Universo Expandido do Pac‑Man).",
  "new_frontiers_map_lotus_pools_title": "Fontes de Lótus",
  "new_frontiers_map_lotus_pools_desc": "Os jogadores podem agora encontrar Fontes de Lótus no lado esquerdo e direito do mapa (perto do ponto onde os grupos de creeps se cruzam). As Fontes de Lótus brotam frutos que, quando comidos, concedem mana e vida.<br><br>Os jogadores podem guardar estes frutos e até combiná‑los para criar um fruto maior e mais poderoso. Estes frutos maiores podem até ser combinados para criar outro [i]incrivelmente[/i] maior. E o que acontece se combinares vários frutos [i]incrivelmente[/i] maiores? Nada, provavelmente. (Deve acontecer alguma coisa, de certeza.)",
  "new_frontiers_map_tormentors_title": "Tormentors",
  "new_frontiers_map_tormentors_desc": "Estes dois creeps neutros poderosos aparecem perto de cada base após 20 minutos e ambos estão carregadinhos de Aghanim's Shards. Mas há um senão e esse senão é que há dois senões: 1) Os Tormentors estão equipados com megaescudos, que refletem a maioria do dano que lhes causares. 2) Ficarão mais fortes sempre que os derrotares. Provavelmente vais precisar de trazer a equipa inteira para derrotar um.<br><br>A boa notícia é que, tal como um urso que te ignora para chacinar um alpinista, os Tormentors não te fazem mal nenhum se os deixares em paz.",
  "new_frontiers_map_watchers_title": "Vigias",
  "new_frontiers_map_watchers_desc": "Os Vigias são como os Exterminadores, só que vigiam. São implacáveis. Não sentem dor. Não têm medo. Mas são preguiçosos. Só começam a vigiar assim que clicares neles.<br><br>Os Vigias começam a partida desativados e neutros, mas, uma vez ativados, concedem visão sobre a área durante sete minutos. Ou até que os teus inimigos o desativem (temporariamente). Quando uma equipa mata o Roshan, todos os Vigias passam a trabalhar para essa equipa.",
  "new_frontiers_map_barriers_title": "Portões Defensivos",
  "new_frontiers_map_barriers_desc": "Os portões defensivos combinam a fantasia do Dota com o pragmatismo das portas da tua casa, que costumas trancar quando vais ao supermercado destruir o Ancient da vida real. É uma \"porta das traseiras\" da tua base com um campo de força conveniente que deixa a tua equipa passar, mas impede inimigos de entrar. Enquanto a equipa inimiga estiver a atacar a tua base pela frente, podes sair sorrateiramente pelas traseiras para os surpreender.",
  "new_frontiers_map_wisdom_runes_title": "Runas de Sabedoria",
  "new_frontiers_map_wisdom_runes_desc": "Explora os limites do mapa para descobrires Runas de Sabedoria, que concedem XP a qualquer herói que as apanhar. Runas de Sabedoria aparecem perto da tua base, oferecendo uma forma mais segura de evitar que uma partida difícil acabe em derrota.",
  "new_frontiers_map_shield_runes_title": "Runas de Escudo",
  "new_frontiers_map_shield_runes_desc": "As Runas de Poder do rio também têm uma novidade: a Runa de Escudo, que concede um escudo com 50% da tua vida máxima. Aproxima-te demasiado de uma torre inimiga para matares alguém no início da partida. Ou sobe uma colina sem visão para te surpreenderes (ou surpreenderes a equipa inimiga).",
  "new_frontiers_map_named_regions_title": "Regiões com nomes específicos",
  "new_frontiers_map_named_regions_desc": "O mapa expandido agora contém regiões distintas (As Minas, O Poço, O Cemitério e A Estátua), permitindo que os teus aliados saibam exatamente onde é que morreste. Todas as unidades nestas regiões recebem um bónus temático específico.",
  "new_frontiers_map_creep_camps_title": "12 novos acampamentos de creeps",
  "new_frontiers_map_creep_camps_desc": "Alguns dos creeps cansaram-se de ser sempre massacrados na selva e estabeleceram 12 novos acampamentos por todo o mapa expandido. Por isso, agora também os podes massacrar noutros sítios.",
  "new_frontiers_map_outpost_title": "Novos Postos Avançados",
  "new_frontiers_map_outpost_desc": "O novo mapa expandido contém dois novos Postos Avançados e os originais foram movidos para novas posições, o que levanta a pergunta se eles são mesmo os postos originais. Boa tentativa, Sócrates: claro que são.",
  "new_frontiers_major_gameplay_features_desc": "Esta atualização inclui grandes alterações aos teus heróis e sistemas favoritos. Aliás, o nosso departamento jurídico até nos aconselhou a dizer que esta secção é tão [i]densamente recheada[/i] de coisas que vão afetar o meta, que devias lê-la aos poucos, ao longo das próximas semanas, para que a tua cabeça não expluda e tenhas de chamar os bombeiros.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Heróis em destaque",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Embora todos os heróis tenham sido reequilibrados, alguns foram mais do que outros. Listámos alguns nesta secção.",
  "new_frontiers_major_gameplay_new_items_title": "Itens novos",
  "new_frontiers_major_gameplay_new_items_desc": "Com 0% de IVA.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Novos itens neutros",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Adicionámos sete itens neutros inéditos e trouxemos de volta alguns favoritos que tinham sido removidos.",
  "new_frontiers_major_gameplay_bkb_title": "Novo Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Agora, ativar o item Black King Bar aplica dissipação básica e concede imunidade a debuffs + 50% de resistência a magia. Enquanto estiver ativo, efeitos negativos de debuffs não te afetam. Além disso, serás imune a dano puro e refletido.<br><br>Mas lembra-te: se o efeito do Black King Bar terminar antes dos debuffs, estes serão aplicados ao longo das respetivas durações restantes. Efeitos que ignoram imunidade a magia agora ignoram imunidade a debuffs.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Novo tipo de herói",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Void Spirit, o quarto irmão espírito que lançámos, não devia ser um herói de Força, de Agilidade nem de Inteligência. Para se diferenciar dos irmãos, ele devia ter sido um tipo novo de herói. Um [i]quarto[/i] tipo.<br><br>Apresentamos os heróis Universais: um novo grupo composto de heróis existentes que agora ganham 0,6 de dano por 1 ponto de cada atributo. Os nossos engenheiros garantiram-nos que este número é perfeitamente equilibrado... a não ser que não seja. Mas a boa notícia é que vamos descobrir se é ou não na grande aventura que é a atualização New Frontiers.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Nova forma de obter itens neutros",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Antes, assassinar criaturas da floresta recompensava-te com um belo de um item neutro... que costumava ir para o Carry da equipa, o qual não eras tu, normalmente. Agora, ao matar um creep neutro, tens a probabilidade de obter uma ficha que podes trocar por um de [i]cinco[/i] itens neutros disponíveis. As opções não são partilhadas entre jogadores, o que significa que até o último jogador a usar uma ficha não precisa de se preocupar com a disponibilidade de um determinado item.<br><br>Os jogadores podem dar fichas a qualquer outro companheiro de equipa. Porém, itens provenientes de fichas não podem ser partilhados, então usa as tuas fichas com prudência.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Creeps neutros melhorados",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Os creeps neutros e as respetivas habilidades são agora melhoradas com o passar do tempo. Sim, quanto mais tempo se passar na partida, mais difícil será \"limpar\" um acampamento, mas os heróis que podem controlar creeps vão ter um belo exército nas suas mãos.",
  "new_frontiers_major_gameplay_kill_formula_title": "Nova fórmula de recompensa por vítima",
  "new_frontiers_major_gameplay_kill_formula_desc": "Modificámos a fórmula que calcula a recompensa por vítima para que mortes causadas no início da partida tenham um maior impacto e motivem os jogadores a emboscar noutras lanes. Também reduzimos o aumento gradual da recompensa em ouro concedida pela morte de creeps para que sejam menos lucrativos com o decorrer da partida, encorajando assim os jogadores a matarem-se uns aos outros pelo seu ouro.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Ficar parado é coisa do passado",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Controlar o teu herói é mais divertido do que não poder controlar o teu herói. Temos então boas notícias para aqueles que gostam de controlar coisas e para aqueles que odeiam não controlar coisas: preparem-se para poder controlar mais do que nunca o vosso herói.<br><br>Como? É fácil: reduzimos a duração de quase todas as incapacitações no jogo. Como é que tivemos esta ideia maluca? Mais fácil ainda: levámos com um Primal Roar do Beastmaster e de repente tivemos muito tempo para pensar sobre o assunto.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Depois de dois meses a assombrar as lanes, a Muerta finalmente pode interagir com o Aghanim's Scepter e o Aghanim's Shard. Se ainda não conheces esta nova heroína, visita a página da [url=https://www.dota2.com/deadreckoning]atualização Dead Reckoning[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "O Ogre Magi é demasiado burro para ser um herói de Inteligência. Então já não é.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Agora, a Medusa começa fraca como um bebé. Mas, como um bebé, ela pode ficar mais forte com o passar do tempo.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Agora, a maioria das habilidades do Clinkz, assim como as melhores habilidades na vida, criam esqueletos.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "O Arc Warden costumava criar um clone perfeito de si próprio. Mas agora, ele cria uma versão [i]melhor[/i] dele próprio! Ou pior! Seja como for, é uma versão diferente. E pouco controversa, esperamos nós.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "O herói Alchemist, tal como todos aqueles que jogam com o Alchemist, é agora ganancioso por natureza.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "EFEITO LIMITADO DO ARC WARDEN",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Por tempo limitado, quando escolheres o Arc Warden na equipa dos Dire, o Tempest Double será o herói principal e usar a habilidade Ultimate irá invocar a versão \"normal\".",
  "new_frontiers_matchmaking_desc": "Sejamos honestos: existem mais de oito mil milhões de pessoas no planeta e 99,9% delas são terríveis a jogar Dota. O que significa que o matchmaking pode ser um desafio, especialmente se fores um ás no Dota e gostares de jogar com pessoas que são quase (mas de preferência não) tão boas como tu no Dota. Fizemos bastantes alterações e contas para melhorar a qualidade do nosso matchmaking para jogadores de todos os níveis de habilidade.",
  "new_frontiers_matchmaking_intro_title": "Matchmaking com confiança",
  "new_frontiers_matchmaking_intro_desc": "A classificação de matchmaking (conhecida como MMR) é constituída por apenas dois números: um para a classificação e outro para o nível de confiança na classificação. Quando jogas uma partida, ajustamos a tua classificação de acordo com o resultado e o teu nível de confiança também sobe, porque agora temos mais dados.",
  "new_frontiers_matchmaking_details_old_title": "Aglomeração indesejada: o pior tipo de aglomeração",
  "new_frontiers_matchmaking_details_old_desc": "Tradicionalmente, o Dota tem utilizado uma versão modificada do algoritmo Elo para implementar alterações na classificação e no nível de confiança. Porém, com o passar do tempo, reparámos em alguns problemas com a nossa abordagem. Primeiro, a distribuição de MMRs tendia gradualmente para baixo, causando uma aglomeração indesejada no intervalo de 0 a 1000 de MMR. Segundo, os jogadores que paravam de jogar regularmente e depois voltavam mais tarde tinham muitas dificuldades em obter um MMR preciso, porque o respetivo nível de habilidade anterior já não representava a realidade.",
  "new_frontiers_matchmaking_details_new_title": "Aglomeração nova e melhorada",
  "new_frontiers_matchmaking_details_new_desc": "Para resolvermos este problema, estamos a mudar para um algoritmo diferente, chamado Glicko, que deve colocar-te numa partida, de forma rápida e precisa, com outros jogadores de habilidade semelhante. Matematicamente falando, o Glicko permite-nos considerar melhor o nível de confiança na classificação de um jogador nos nossos cálculos, resultando em decisões mais precisas sobre ganhos ou perdas de classificação.\\n\\nA mudança para o nosso novo sistema de matchmaking será um pouco parecida com o início de uma nova temporada competitiva: [list][*]Todos os jogadores estarão num modo de calibração breve, baseada inicialmente na classificação anterior.\\n[*]A calibração já não se trata de um número fixo de partidas. Em vez disso, um, jogador será considerado \"calibrado\" quando o respetivo nível de confiança na classificação estiver acima de um valor específico.\\n[*]Ao concluir a calibração, é provável que recebas uma medalha diferente da que tinhas antes. Porém, mesmo se houver uma grande diferença entre as medalhas, deverás ser colocado em partidas com jogadores de habilidade semelhante.\\n[*]As partidas irão deixar de ter um valor fixo de ganho/perda de MMR. O valor será variável, com base em diversos fatores, como as classificações e o nível de confiança dos participantes. Porém, será imposto um limite no ganho/perda por partida para impedir casos extremos.[*]O nível de confiança na classificação irá descer ao longo do tempo se o jogador não jogar partidas.[/list]Temos andado a usar ambos os sistemas de matchmaking em simultâneo nos últimos meses para testarmos a eficácia destas alterações. Sabemos que um MMR preciso é apenas um dos vários fatores que afetam a qualidade das partidas e, como em todas as alterações deste tipo, gostaríamos de saber o que jogadores como tu acham.",
  "new_frontiers_matchmaking_immortals_title": "Matchmaking Imortal",
  "new_frontiers_matchmaking_immortals_desc": "Para um jogador com a medalha de classificação Imortal, conhecer os outros jogadores, dar-se bem com eles e escolher um bom equilíbrio entre os cargos é muito mais importante do que apenas o MMR. Com isso em mente, alterámos a experiência do matchmaking ao nível Imortal.<br><br>A partir de agora, partidas entre jogadores Imortais deixarão de ter equipas pré-criadas pelo sistema. Em vez disso, dois jogadores serão os capitães e terão de escolher os outros oito jogadores para cada equipa, fazendo com que a tua equipa tenha um maior impacto do que se fosse formada com base no MMR. Portanto, Imortais, se a partir de agora as vossas partidas não forem lá grande coisa, a culpa é vossa.",
  "new_frontiers_ui_desc": "Vista turva e dores agudas no braço? O nosso conselho é ignorares, isso é só o teu corpo a dizer que estás com fome. Furaste um pneu? Não pares, depois mudas. O que queremos dizer é que tudo na vida pode ser ignorado sem consequências graves.<br><br>Exceto as barras de vida no Dota. Isso sim, é importante. E é por isso que vários aspetos da interface relacionados com a vida foram melhorados nesta atualização.",
  "new_frontiers_ui_shields_title": "Barreiras na barra de vida",
  "new_frontiers_ui_shields_desc": "Sabias que o Dota tem escudos? Escudos mágicos, escudos físicos, escudos afóticos... Escudos para todos os gostos! Se calhar não reparaste, ou simplesmente decidiste ignorá-los, porque não havia maneira de saber quanto escudo tinhas ou quanto ainda restava.<br><br>Mas esses tempos de incerteza acabam hoje. Agora podes ver tudo. Ou pelo menos duas das coisas que mencionámos acima. Podes até ver o tipo de escudo! Os escudos antigos ficaram com tão bom aspeto com esta alteração visual, que decidimos celebrar ao adicionar um monte de habilidades novas que os usam.<br><br>Também mudamos o nome dos \"escudos\" para \"barreiras\", para que ninguém pense que agora o Vanguard vai aparecer na barra de vida. Não tens de quê!",
  "new_frontiers_ui_health_pips_title": "Barras de vida segmentadas",
  "new_frontiers_ui_health_pips_desc": "Algumas unidades não têm \"vida\" no sentido tradicional e costuma ser necessário um determinado número de ataques para as destruir. Agora, em vez de tentar adivinhar ou contar como um génio, basta olhar para a unidade que queres assassinar. A respetiva barra de vida será segmentada de acordo com o número de ataques necessários para que a unidade possa falecer, patinar, bater as botas, esticar o pernil, conviver com as minhocas... (citação da barra de vida dos Gato Fedorento).",
  "new_frontiers_ui_health_cost_title": "Custo de vida",
  "new_frontiers_ui_health_cost_desc": "Embora a maioria das habilidades do Dota consuma mana, algumas consomem vida. Agora, essas habilidades indicam quanta vida é necessária para as usar. Nada mau, hein? É incrível como ninguém pensou em fazer isso antes. Mas bom, está resolvido.",
  "new_frontiers_gameplay_update_desc": "Ufa, que lista enorme de alterações! A única coisa que a poderia tornar melhor seria algo como... [i]duas[/i] listas enormes de alterações, mas onde é que iríamos arranjar... [i]ena pá, mas o que é isto!?[/i] Continua a ler para descobrires todas as outras alterações que esta atualização tem na manga. Ou abre o jogo e começa a jogar. Acredita, não precisas de nos dizer como ler manuais técnicos sobre videojogos é divertido a valer, mas olha que jogá-los não anda muito longe disso. Esta lista vai continuar aqui quando voltares.",
  "new_frontiers_misc_title": "Diversos",
  "new_frontiers_misc_role_tokens": "Reduzimos o número de entradas na fila com cargos concedidas ao perder uma partida com todos os cargos selecionados. Agora, irás receber duas entradas por derrota (e irás continuar a receber quatro por vitória). Esta alteração visa ajudar a apaziguar certos comportamentos no modo competitivo com cargos, onde os jogadores estavam mais preocupados em juntar entradas do que jogar devidamente com o cargo que lhes tinha sido atribuído.",
  "new_frontiers_misc_removed_roles": "Removemos o Modo de Capitães do matchmaking competitivo e os modos Todos Aleatórios e Deathmatch Aleatório do matchmaking casual. Quase ninguém jogava estes modos e o tempo na fila facilmente ultrapassava uma hora.",
  "new_frontiers_misc_model_editor": "Removemos o antigo editor de modelos. Todos os ficheiros vdml serão carregados na nova ferramenta e os modelos antigos serão convertidos quando os abrires na ferramenta. Iremos lançar uma atualização futura para removermos por completo a compatibilidade com o antigo formato compilado. Por isso, recomendamos a todos os colaboradores do Workshop que carreguem e convertam os seus modelos para o formato novo e que os recompilem o mais rapidamente possível.",
  "new_frontiers_misc_hold_animation": "Removemos a compatibilidade com a antiga chave \"HoldAnimation\" das propriedades dinâmicas. Os autores de modos customizados devem trocar manualmente para a nova chave \"loop mode\" ou recompilar os seus mapas para que essas propriedades sejam atualizadas automaticamente.",
  "neutral_item_tier": "Item neutro de [b]classe %1$s[/b]",
  "dota_ability_variable_health": "de vida",
  "dota_ability_variable_mana": "de mana",
  "dota_ability_variable_armor": "de armadura",
  "dota_ability_variable_damage": "de dano",
  "dota_ability_variable_str": "de Força",
  "dota_ability_variable_int": "de Inteligência",
  "dota_ability_variable_agi": "de Agilidade",
  "dota_ability_variable_all": "a todos os atributos",
  "dota_ability_variable_primary_attribute": "ao atributo principal",
  "dota_ability_variable_attack": "de rapidez de ataque",
  "dota_ability_variable_hp_regen": "de regeneração de vida",
  "dota_ability_variable_lifesteal": "de roubo de vida",
  "dota_ability_variable_mana_regen": "de regeneração de mana",
  "dota_ability_variable_mana_regen_aura": "de regeneração de mana (aura)",
  "dota_ability_variable_spell_amp": "de dano de feitiços",
  "dota_ability_variable_debuff_amp": "à duração de debuffs",
  "dota_ability_variable_move_speed": "de rapidez de movimento",
  "dota_ability_variable_evasion": "de evasão",
  "dota_ability_variable_spell_resist": "de resistência a magia",
  "dota_ability_variable_spell_lifesteal": "de roubo de vida por habilidades",
  "dota_ability_variable_spell_lifesteal_creep": "de roubo de vida por habilidades (creeps)",
  "dota_ability_variable_spell_lifesteal_hero": "de roubo de vida por habilidades (heróis)",
  "dota_ability_variable_selected_attrib": "ao atributo selecionado",
  "dota_ability_variable_attack_range": "de alcance de ataque <font color='#7d7d7d'>(só à distância)</font>",
  "dota_ability_variable_attack_range_melee": "de alcance de ataque <font color='#7d7d7d'>(só corpo a corpo)</font>",
  "dota_ability_variable_cast_range": "de alcance de uso",
  "dota_ability_variable_status_resist": "de resistência a debuffs",
  "dota_ability_variable_projectile_speed": "à rapidez dos projéteis",
  "dota_ability_variable_manacost_reduction": "de redução dos custos de mana",
  "dota_ability_variable_cooldown_reduction": "de redução de cooldowns",
  "dota_ability_variable_max_mana_percentage": "de mana máxima",
  "dota_ability_variable_aoe_bonus": "de área de efeito adicional"
}