// 290.js

{
  "language": "czech",
  "new_frontiers_gameplay_number": "Herní aktualizace 7.33",
  "new_frontiers_title": "Aktualizace New Frontiers",
  "new_frontiers_title_short": "New Frontiers",
  "new_frontiers_subtitle": "Rozšířená mapa, zásadní změny hratelnosti a mnohem více. Nový svět volá – nenechte ho čekat!",
  "new_frontiers_play_trailer": "Přehrát trailer",
  "new_frontiers_dota_team_intro": "Aktualizace New Frontiers zahrnuje rozšířenou mapu, zásadní změny hratelnosti, vylepšení vyhledávání zápasů, novinky v uživatelském rozhraní a mnohem, mnohem více.<br><br>Abychom na něco nezapomněli, všechno jsme sepsali na této stránce, kde k tomu máte přístup i Vy. Nasaďte brýle na čtení a hurá do scrollování!",
  "new_frontiers_eldor_name": "Čaroděj Eldor",
  "new_frontiers_dota_team_name": "Tým hry Dota 2",
  "new_frontiers_section_title_map": "Rozšířená mapa",
  "new_frontiers_section_title_major_gameplay": "Zásadní změny hratelnosti",
  "new_frontiers_section_title_matchmaking": "Vyhledávání zápasů",
  "new_frontiers_section_title_ui": "Uživatelské rozhraní",
  "new_frontiers_section_title_gameplay_update": "Změny vybalancování",
  "new_frontiers_map_introduction": "Na mapě hry Dota 2 nezůstal kámen na kameni. To však ještě neznamená, že by se změnila její pravidla – linky nejsou dál od sebe a to hlavní, co potřebujete k ubránění nebo zničení Ancienta, je pořád ve středu bojiště.<br><br>Proč se ale nepodívat i do rozšířených okrajů, které dohromady nabízí 40 % nového terénu překypujícího zdroji a netušenými strategickými možnostmi. A tušíte správně, změn se dočkaly také staré dobré džungle. Teď nové lepší džungle!",
  "new_frontiers_map_subtitle": "Prozkoumejte novou mapu",
  "new_frontiers_map_roshan_title": "Roshanovy nové domovy",
  "new_frontiers_map_roshan_desc": "Roshan prodal starou díru v řece a rozhodl se rozšířit svoji působnost. Nově má tak [i]dvě[/i] navoněná doupata nacházející se v severozápadním a jihovýchodním rohu mapy, každé pár minut pěšky od tajného obchodu a s nádherným výhledem do válkou zmučené krajiny. Až mu skoro závidíme!<br><br>Jo a někde poblíž doupat bude nejspíš i posilovna se sýrovým bufetem, protože Roshan nabral na svalové hmotě a už z něj po smrti nevypadne předmět Aghanim's Shard. Namísto toho z něj po druhé smrti vypadne předmět Cheese a po třetí a všech následujících smrtích předmět Refresher Shard nebo Aghanim's Scepter (v závislosti na tom, kde byl zabit).",
  "new_frontiers_map_twin_gates_title": "Cestovní brány",
  "new_frontiers_map_twin_gates_desc": "Dva rohy mapy poblíž věží na bezpečných linkách ode dneška spojují cestovní brány umožňující okamžitý přesun z jedné strany na druhou.<br><br>Změna je to primárně herní, ale zasahuje i do příběhového pozadí. Ano, Dota 2 nově neoficiálně existuje v PMEU (tedy Pac-Manově rozšířeném univerzu).",
  "new_frontiers_map_lotus_pools_title": "Lotosová jezírka",
  "new_frontiers_map_lotus_pools_desc": "Na levém a pravém okraji mapy (kousek od míst, kde se poprvé setkávají vlny creepů) se ode dneška nachází turisty vyhledávaná lotosová jezírka, v nichž lze vždy po chvíli nalézt léčivé lotosy poskytující manu a zdraví.<br><br>Když lotosů nasbíráte více kusů, můžete z nich vytvořit jeden větší a hodnotnější. Který ve spojení s dalším takovým vytvoří [i]opravdu[/i] velký a léčivý lotos. Co by se stalo, kdybyste zkombinovali více takových [i]opravdu[/i] velkých lotosů? Nejspíš nic, ale kdo ví.",
  "new_frontiers_map_tormentors_title": "Tormentoři",
  "new_frontiers_map_tormentors_desc": "Tormentoři (nebo chcete-li „Trýznitelé“) jsou dvě mocné entity sídlící od 20. minuty každého zápasu poblíž základen obou týmů, které mají své hranaté žaludky plné předmětů Aghanim’s Shard. Pochopitelně je tu háček. Respektive dva háky: 1) Tormentoři jsou chráněni superštíty odrážejícími většinu poškození. 2) Vždy když je Tormentor zabit, vrátí se ještě silnější. Takže nedoporučujeme bojovat na férovku, ale spíš s celým týmem za zády.<br><br>Jednu dobrou zprávu však máme. Když budete Tormentory ignorovat, budou ignorovat i oni Vás.",
  "new_frontiers_map_watchers_title": "Pozorovatelé",
  "new_frontiers_map_watchers_desc": "Pozorovatelé jsou něco jako terminátoři, ale pro strážení oblastí. Jsou totiž nelítostní. Neznají bolest. Neznají strach. Akorát tedy znají lenost, takže dokud na ně nekliknete, ani očičko neotevřou.<br><br>Všichni pozorovatelé jsou vždy na začátku zápasu neaktivní a neutrální, nicméně jak pozorovatele aktivujete, na sedm minut poskytne dohled kolem sebe. Pokud ho nepřítel nesabotuje. Nebo nepřátelský tým nezabije Roshana, což všechny pozorovatele přinutí změnit kabát (holt chtějí být na straně vítězů, nesuďte je).",
  "new_frontiers_map_barriers_title": "Zadní vrátka",
  "new_frontiers_map_barriers_desc": "Zadní vrátka jsou kombinací nezaměnitelného fantasy stylu hry Dota 2 a praktického vynálezu zamykacích dveří. Tahle silová pole na okrajích základen tak pustí ven (nebo dovnitř) pouze právoplatné obyvatele a nepřátele pošlou k šípku. Takže až příště cizáci zaklepou na hlavní bránu, vezměte to zadem a překvapte je!",
  "new_frontiers_map_wisdom_runes_title": "Runy vědomostí",
  "new_frontiers_map_wisdom_runes_desc": "Prozkoumejte nové okraje mapy a možná narazíte na runu vědomostí, která Vám poskytne nášup XP neboli zkušeností. Runy vědomostí se navíc objevují poblíž základen, takže to k nim není daleko ani ve chvílích, kdy Vám teče do bot a každá rada je dobrá.",
  "new_frontiers_map_shield_runes_title": "Runy ochrany",
  "new_frontiers_map_shield_runes_desc": "Seznam run vylepšení objevujících se v řece byl obohacen o runu ochrany, která hrdinům poskytuje štít o hodnotě 50% z jejich maximálního zdraví. Vítaná pomoc, když se chcete vydat do temných oblastí mapy a nevíte co (nebo kdo) tam na Vás čeká.",
  "new_frontiers_map_named_regions_title": "Pojmenované oblasti",
  "new_frontiers_map_named_regions_desc": "Rozšířené okraje mapy zahrnují užitečné orientační body, podle kterých jsou také pojmenované: Studna, Hřbitov, Socha a Doly. Aneb až příště natáhnete bačkory, budete spojencům moci říct, kde mají hledat Vaše ostatky. Každá oblast navíc poskytuje návštěvníkům tematické buffy.",
  "new_frontiers_map_creep_camps_title": "12 nových kempů",
  "new_frontiers_map_creep_camps_desc": "Některé neutrální creepy už nebavilo umírat v džungli, a tak v rozšířených částech mapy založili 12 nových kempů. Změna scenérie při jejich masakrování prospěje určitě i Vám...",
  "new_frontiers_map_outpost_title": "Nová stanoviště",
  "new_frontiers_map_outpost_desc": "Na rozšířených okrajích mapy se nachází také dvě nová stanoviště. A původní stanoviště byla přesunuta na jiná místa, což logicky nutí otázku, jestli jsou stále ještě původní. Málem jsi nás dostal, Sokrate, ale jsou.",
  "new_frontiers_major_gameplay_features_desc": "Víte, kolik zásadních změn hrdinů a herních systémů přináší aktualizace New Frontiers? Tolik, až nám právníci poradili napsat tohle: „Seznam změn hratelnosti je tak [i]napěchovaný[/i] novinkami překopávajícími metu, že byste ho měli číst velmi pomalu a v rámci několika následujících týdnů, neboť při rychlém čtení hrozí zdravotní komplikace.“",
  "new_frontiers_major_gameplay_hero_reworks_title": "Vybraní hrdinové",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Ano, všichni hrdinové jsou vybalancovaní, ale někteří jsou vybalancovanější více. Tady jich pár máte.",
  "new_frontiers_major_gameplay_new_items_title": "Nové předměty",
  "new_frontiers_major_gameplay_new_items_desc": "Aneb ať máte za co utrácet zlaťáky.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Nové neutrální předměty",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Aneb ať máte za co směňovat neutrální žetony. Nechybí návrat několika klasik!",
  "new_frontiers_major_gameplay_bkb_title": "Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Dávejte pozor, tohle je důležité. Aktivací předmětu Black King Bar je na Vás nově aplikováno standardní odstranění a získáte imunitu vůči debuffům doplněnou o 50% odolnost vůči magii. Plus Vám neublíží neredukované ani odražené poškození.<br><br>Ale! Pokud efekt předmětu Black King Bar vyprší dřív než některý z debuffů (které na Vás nepřátelé mohou sázet bez omezení), tento debuff Vás ovlivní po zbývající dobu svého trvání. A pro úplnost: efekty dříve prorážející imunitu vůči kouzlům nově proráží imunitu vůči debuffům.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Všestrannost",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Void Spirit, jakožto čtvrtý bratr v rodince duchů, neměl spadat pod sílu, obratnost nebo inteligenci. Ne, měl mít nový atribut. [i]Čtvrtý[/i] atribut.<br><br>S mírným zpožděním tedy představujeme atribut „Všestrannost“, který technicky vzato není atribut, zahrnuje překonvertované staré hrdiny a tito hrdinové získávají 0,6 bodu k poškození za každý bod jiného atributu. Což je prý perfektně vybalancovaná hodnota. Ale kdyby náhodou ne, přijdeme na to společně při hraní aktualizace New Frontiers.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Neutrální žetony",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Vraždění lesních tvorů dříve přinášelo kromě tíživého pocitu viny také sem tam nějaký neutrální předmět. Který si ale stejně nárokoval nenasytný carry... S tím je teď konec! Pocit viny zůstává, nicméně z creepů nově náhodně vypadávají žetony, které lze aktivací proměnit na jeden z [i]pěti[/i] neutrálních předmětů. Tento výběr předmětů je pak specifický pro každého hráče, takže se nebojte, že by Vám někdo vyfouknul užitečné nádobíčko.<br><br>Žetony je možné sdílet mezi spoluhráči, ale jakmile je žeton proměněn na předmět, už se s ním nehne. Volte moudře!",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Škálování neutrálních creepů",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Neutrální creepové se zhlédli v hrdinech a jejich schopnosti mají nově více úrovní. Praktické dopady? Čištění kempů je těžší s postupem času, ale hrdinové zaměření na „správu zoo“ mohou začít slavit.",
  "new_frontiers_major_gameplay_kill_formula_title": "Vzorec pro asistence",
  "new_frontiers_major_gameplay_kill_formula_desc": "S dnešní aktualizací došlo k přepracování vzorce pro výpočet odměn za asistování při zabíjení, takže zabíjení v raných fázích zápasu je hodnotnější a hráči jsou motivováni ke gankování. Dále bylo redukováno navyšování odměn za zabíjení creepů na linkách, což má zase odradit od farmení v pozdních fázích a větší atraktivitě potyček mezi hrdiny.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Ne-omračující novinka",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Hraní je vždy větší zábava než sezení a koukání na to, jak je Váš hrdina zdánlivě nekonečně dlouho omráčen. Souhlasíte? Pak pro Vás máme skvělé zprávy.<br><br>Redukovali jsme totiž trvání (případně dobu omráčení) skoro všech přerušení dostupných ve hře. Jak nás taková šílenost mohla napadnout? Víte, to na nás tuhle Beastmaster použil Primal Roar a my si stihli dojít na záchod...",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Po dvou měsících strašení na linkách Muerta konečně vymyslela, jaká vylepšení chce od předmětů Aghanim's Scepter a Shard. Říkáte, že Muertu neznáte? Mrkněte na [url=https://www.dota2.com/deadreckoning]aktualizaci Dead Reckoning[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Vždy nám přišlo, že Ogre Magi je příliš hloupý na to, aby byl mezi inteligentními hrdiny. A tak už není.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa nově začíná slaboučká jako nemluvně. Ale stejně jako nemluvně může nabrat pořádné svaly.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Většina Clinkzových schopností po sobě nově zanechává kostlivce. Kde je změna? Inu, teď jen neleží nečinně na zemi.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden byl schopen vytvořit svoji dokonalou kopii. Ale teď je schopen vytvořit [i]lepší[/i] verzi sebe samého. Nebo horší. Tak jako tak, už to není kopie.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Alchemist se nově chová jako jeho hráči – je od narození chamtivý až běda.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ČASOVĚ OMEZENÁ ZMĚNA ARC WARDENA",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Po omezenou dobu platí, že když Arc Warden hraje v týmu Dire, hlavním „hrdinou“ je jeho kopie od schopnosti Tempest Double, jejíž ultimátní schopnost vytvoří „normálního“ Arc Wardena.",
  "new_frontiers_matchmaking_desc": "Ruku na srdce, po Zemi chodí nějakých osm miliard lidí a 99,99 % z nich neumí hrát Dotu. Což znamená, že vyhledávání zápasů ne vždy funguje, obzvlášť, pokud jste v Dotě opravdu dobří a chcete hrát s ostatními, kteří jsou na tom podobně (ale o trošičku hůř). Proto jsme sedli ke kalkulačkám a skrze nové systémy vylepšili vyhledávání zápasů. Pro všechny nezávisle na skillu!",
  "new_frontiers_matchmaking_intro_title": "Věrohodnost hodnocení",
  "new_frontiers_matchmaking_intro_desc": "MMR neboli hodnocení je zjednodušeně řečeno kombinací dvou čísel: hodnocení a věrohodnosti ocenění. Zatímco hodnocení je odhadem Vašich dovedností, věrohodnost hodnocení je naše důvěra v přesnost tohoto odhadu. Když tedy odehrajete zápas, v závislosti na výsledku upravíme Vaše hodnocení a zároveň stoupne jeho věrohodnost, protože budeme mít víc dat.",
  "new_frontiers_matchmaking_details_old_title": "Nežádoucí shlukování",
  "new_frontiers_matchmaking_details_old_desc": "Doteď byl pro zanášení změn hodnocení a věrohodnosti hodnocení používán upravený koeficient Elo. S postupem času jsme si ale všimli několika problémů. Například toho, že rozložení hodnocení se pomalu posunulo směrem dolů a došlo k nežádoucímu „shlukování“ hráčů v rozsahu mezi 0–1000 body hodnocení. Dalším problémem byl fakt, že hráči, kteří se vrátili po pauze, měli problém se dostat zpět na přesné hodnocení, neboť jejich předchozí úroveň dovedností už nebyla reprezentativní.",
  "new_frontiers_matchmaking_details_new_title": "Vylepšené shlukování",
  "new_frontiers_matchmaking_details_new_desc": "Abychom problémy vyřešili, přecházíme s touto aktualizací na koeficient zvaný Glicko, který umožňuje rychlé a přesné spojování s hráči podobných dovedností. Pokud Vás zajímá matematická stránka věci, pak vězte, že Glicko do výpočtů lépe zahrnuje věrohodnost hodnocení, což ve výsledku zpřesňuje zvýšení nebo snížení hodnocení.\\n\\nSamotný přechod na nový systém vyhledávání zápasů je v lecčem podobný začátku nové sezóny hodnocení: [list][*]Všichni hráči budou nakrátko umístěni do kalibrace rozložené podle předchozích hodnocení.\\n[*]Kalibrace už netrvá fixní počet zápasů. Namísto toho je hráč kalibrován, jakmile věrohodnost jeho hodnocení přesáhne určitou mez.\\n[*]Je pravděpodobné, že hráči po kalibraci skončí s jinou medailí hodnocení. I když však bude medaile výrazně odlišná od předešlé, mohou očekávat, že budou spojováni s hráči podobných dovedností.\\n[*]Nárůst/úbytek hodnocení už není fixní číslo. Nově jde o proměnnou založenou na více faktorech, mezi něž patří hodnocení a věrohodnosti hodnocení všech zúčastněných. I tato proměnná má však vrchní limit, abychom zabránili obzvláště záporným výsledkům.[*]Věrohodnost hodnocení pomalu klesá, když hráč nehraje.[/list]Oba systémy vyhledávání zápasů (tzn. starý a nový) byly už nějakou dobu potají používány souběžně, takže změny máme vyzkoušené a jsme s nimi spokojeni. Zároveň ale chápeme, že přesné hodnocení je pouze jedním z mnoha faktorů ovlivňujících kvalitu zápasů, takže se nebojte ozvat a říct nám, co si myslíte Vy.",
  "new_frontiers_matchmaking_immortals_title": "Výběr bohů",
  "new_frontiers_matchmaking_immortals_desc": "Na nejvyšší úrovni (tím myslíme hodnocení „Bůh“) už číslo MMR není tak důležité jako třeba možnost domluvit s hráči role, kterých se v zápase ujmou. Takže jsme tomu přizpůsobili vyhledávání zápasů.<br><br>Konkrétně ode dneška platí, že hráči hodnocení „Bůh“ už nejsou do týmů rozřazováni systémem, a namísto toho se vždy dva kapitáni chopí výběru hráčů do svých týmů. Chcete jim to usnadnit? Nastavte svůj preferovaný tým a roli. A pamatujte: pokud zápas nestál za moc, není to naše chyba, ale Vaše.",
  "new_frontiers_ui_desc": "Rozostřené vidění a bolest vystřelující do ruky? To se Vám jen tělo snaží říct, že má hlad. Píchlá pneumatika? Dojeďte na ráfku, přece jenom je taky kulatý. Zkrátka a dobře, v životě můžete bez následků ignorovat skoro vše, co Vám postaví do cesty.<br><br>Ale ukazatele zdraví v Dotě, ty ignorovat nedoporučujeme, a proto jsme se zaměřili na jejich vzhled.",
  "new_frontiers_ui_shields_title": "Zobrazení štítů",
  "new_frontiers_ui_shields_desc": "Věděli jste, že v Dotě jsou štíty? A to nemyslíme štíty jako předměty, ale štíty proti magickému, fyzickému nebo libovolnému poškození! Ani bychom Vám neměli za zlé, kdybyste si jich nikdy nevšimli nebo je nevnímali, protože nebylo jednoduše patrné, jak „pevný“ který štít byl a kolik z něj ještě zbývalo.<br><br>Dobu nejistoty však nahrazuje nová doba přehlednosti, takže štíty jsou od sebe snadno rozeznatelné a na první pohled z nich vyčtete, kolik bodů jim zbývá.<br><br>Z této změny jsme mimochodem měli takovou radost, že jsme přidali pár nových schopností zaměřených na absorpci poškození právě skrze štíty.",
  "new_frontiers_ui_health_pips_title": "Nestandardní ukazatele",
  "new_frontiers_ui_health_pips_desc": "Některé jednotky nehrají podle tradičních pravidel (tzn. ukazatelů s body zdraví) a vyžadují k zabití nebo zničení určitý počet útoků. Nevíme jak Vy, ale my si dřív museli dělat čárky na stole. Teď máme stůl nový a nechceme si ho zničit, a tak byly přidány ukazatele zdraví s obdélníčky reprezentujícími vyžadovaný počet útoků.",
  "new_frontiers_ui_health_cost_title": "Spotřeba zdraví",
  "new_frontiers_ui_health_cost_desc": "Ačkoli většina schopností ve hře jezdí na manu, některé chtějí krev. Pardon, zdraví. Abychom tyto dva zdroje odlišili, přidali jsme souvisejícím schopnostem nové zobrazení spotřeby zdraví. A neptejte se, proč nám to trvalo tak dlouho, když je to extrémně prostá a užitečná věc. Hlavní je, že ode dneška už to ve hře je!",
  "new_frontiers_gameplay_update_desc": "Že to byl do tohoto bodu pořádně macatý seznam? Přemýšlíme, čím to trumfnout. No jasně, [i]druhým[/i] seznamem, který se potáhne na kilometry daleko! Pokud Vás tedy ještě nebolí oči, pokračujte ve čtení dalších změn vybalancování. V opačném případě si dejte pauzu. Ideálně přímo ve hře, kde si novinky můžete sami osahat, což je pro jejich naučení druhá nejlepší věc hned po čtení. A nebojte, seznam Vám nikam neuteče, na to je moc přecpaný...",
  "new_frontiers_misc_title": "Různé",
  "new_frontiers_misc_role_tokens": "Snížili jsme počet žetonů vyhledávání podle role získaných za prohru zápasu, pro který si hráči vybrali všechny role. Nyní lze tedy za takovou prohru získat dva žetony (a za výhru stále čtyři). Tato změna snad pomůže zlepšit chování hráčů, co se žetonů vyhledávání týče, protože jejich sbírání bylo pro některé očividně přednější než hraní přiřazené role.",
  "new_frontiers_misc_removed_roles": "Z vyhledávání hodnocených zápasů byl odstraněn mód Kapitánský výběr a z vyhledávání nehodnocených zápasů byly odstraněny módy Všichni náhodně a Deathmatch – všichni náhodně. Tyto módy skoro nikdo nehrál a na zápas se čekalo hodiny.",
  "new_frontiers_misc_model_editor": "Společně s touto aktualizací byl ze hry odstraněn zastaralý editor modelů. Všechny soubory formátu VMDL se nyní otevřou v novém nástroji a staré modely budou při prvním otevření konvertovány. V budoucí aktualizaci kompletně odstraníme podporu načítání starého zkompilovaného formátu, takže tvůrce žádáme, aby co nejdříve konvertovali své modely na nový formát a znovu je zkompilovali.",
  "new_frontiers_misc_hold_animation": "Z dynamických objektů byla odstraněna podpora pro zastaralou hodnotu „HoldAnimation“. Tvůrci uživatelských módů mohou ručně přepnout na novou hodnotu „loop mode“, nebo znovu zkompilovat mapy pro automatický upgrade vlastností.",
  "neutral_item_tier": "Neutrální předmět [b]%1$s. hodnosti[/b]",
  "dota_ability_variable_health": "Zdraví",
  "dota_ability_variable_mana": "Mana",
  "dota_ability_variable_armor": "Brnění",
  "dota_ability_variable_damage": "Poškození",
  "dota_ability_variable_str": "Síla",
  "dota_ability_variable_int": "Inteligence",
  "dota_ability_variable_agi": "Obratnost",
  "dota_ability_variable_all": "Všechny atributy",
  "dota_ability_variable_primary_attribute": "Primární atribut",
  "dota_ability_variable_attack": "Rychlost útoku",
  "dota_ability_variable_hp_regen": "Regenerace zdraví",
  "dota_ability_variable_lifesteal": "Lifesteal",
  "dota_ability_variable_mana_regen": "Regenerace many",
  "dota_ability_variable_mana_regen_aura": "Aura regenerující manu",
  "dota_ability_variable_spell_amp": "Poškození schopností",
  "dota_ability_variable_debuff_amp": "Trvání debuffů",
  "dota_ability_variable_move_speed": "Rychlost pohybu",
  "dota_ability_variable_evasion": "Úhyb",
  "dota_ability_variable_spell_resist": "Odolnost vůči magii",
  "dota_ability_variable_spell_lifesteal": "Lifesteal kouzly",
  "dota_ability_variable_spell_lifesteal_creep": "Lifesteal kouzly (creepové)",
  "dota_ability_variable_spell_lifesteal_hero": "Lifesteal kouzly (hrdinové)",
  "dota_ability_variable_selected_attrib": "Vybraný atribut",
  "dota_ability_variable_attack_range": "Dosah útoku <font color='#7d7d7d'>(pouze na dálku)</font>",
  "dota_ability_variable_attack_range_melee": "Dosah útoku <font color='#7d7d7d'>(pouze na blízko)</font>",
  "dota_ability_variable_cast_range": "Dosah schopností",
  "dota_ability_variable_status_resist": "Odolnost vůči změně stavu",
  "dota_ability_variable_projectile_speed": "Rychlost projektilu",
  "dota_ability_variable_manacost_reduction": "Redukce spotřeby many",
  "dota_ability_variable_cooldown_reduction": "Redukce cooldownů",
  "dota_ability_variable_max_mana_percentage": "Bonus k max. maně"
}