// 1060.js

{
  "language": "german",
  "new_frontiers_gameplay_number": "Gameplay-Update 7.33",
  "new_frontiers_title": "Das Update „Neue Horizonte“",
  "new_frontiers_title_short": "Neue Horizonte",
  "new_frontiers_subtitle": "Eine überarbeitete Karte, tiefgreifende Änderungen am Gameplay und vieles mehr. Eine vollkommen neue Welt wartet darauf, erkundet zu werden.",
  "new_frontiers_play_trailer": "Trailer ansehen",
  "new_frontiers_dota_team_intro": "Das Update „Neue Horizonte“ enthält eine überarbeitete Karte, tiefgreifende Änderungen am Gameplay, Verbesserungen an der Spielsuche, Änderungen an der Benutzeroberfläche und – das ist kein Scherz! – noch vieles mehr.<br><br>Wie viel mehr? So viel, dass es tatsächlich schwierig ist, alles zu behalten. Das versetzte uns in leichte Panik, bis jemand auf die glorreiche Idee kam, alles aufzuschreiben. Gesagt, getan. Ab sofort können wir also jederzeit nachlesen. Und das gilt auch für Sie! Scrollen Sie los und erfahren Sie mehr.",
  "new_frontiers_eldor_name": "Eldor der Zauberer",
  "new_frontiers_dota_team_name": "Das Dota-Team",
  "new_frontiers_section_title_map": "Überarbeitete Karte",
  "new_frontiers_section_title_major_gameplay": "Tiefgreifende Gameplay-Änderungen",
  "new_frontiers_section_title_matchmaking": "Spielsuche",
  "new_frontiers_section_title_ui": "Benutzeroberfläche",
  "new_frontiers_section_title_gameplay_update": "Änderungen an der Spielbalance",
  "new_frontiers_map_introduction": "Die Dota-Karte wurde erheblich vergrößert. Das Hauptziel des Spiels bleibt jedoch gleich: Ihre Pfade liegen nicht weiter voneinander entfernt als sonst und alles, was Sie zum Sieg benötigen, finden Sie nach wie vor im Zentrum der Karte.<br><br>Mit 40 % mehr Terrain gibt es jedoch viel mehr Möglichkeiten zum Sammeln neuer Ressourcen und zur Entwicklung neuer Strategien. Beide Hauptdschungel wurden ebenfalls völlig überarbeitet, sodass die Platzierung von Wards, das versteckte Auflauern zwischen Bäumen, das Farmen von Lagern und vieles mehr eine neue Herausforderung darstellt.",
  "new_frontiers_map_subtitle": "Erkunden Sie die neue Welt",
  "new_frontiers_map_roshan_title": "Roshans neue Heimstätten",
  "new_frontiers_map_roshan_desc": "Roshan hat seine alte Inselgrube im Fluss verkauft und auf dem Immobilienmarkt kräftig zugeschlagen. Er hat jetzt [i]zwei[/i] fantastische neue Domizile im Nordwesten und Südosten der Karte. Sie sind der Traum eines jeden Grubenliebhabers, mit schöner Aussicht auf die Brunnen und nur wenige Minuten entfernt von den Geheimläden.<br><br>Diese Gruben scheinen auch in der Nähe eines Fitnesscenters liegen, da Roshan jetzt sogar noch muskulärer ist, als zuvor. Er lässt auch nicht länger Aghanims Splitter fallen und vergibt Käse jetzt bei seinem zweiten Tod anstatt bei seinem dritten. Bei seinem dritten Tod hinterlässt er jetzt einen Refresher Shard oder ein Zepter, je nachdem, ob er in seiner nördlichen oder südlichen Grube haust.",
  "new_frontiers_map_twin_gates_title": "Zwillingstore",
  "new_frontiers_map_twin_gates_desc": "Zwei Tore verbinden jetzt die Ecken der Karte in der Nähe der Safe-Lane-Türme und erlauben es Spielern, sofort von einer Ecke der Karte zur anderen zu teleportieren.<br><br>Dies ist eine Gameplay-Änderung, die offensichtlich Auswirkungen auf die Hintergrundgeschichte hat. Sie haben es erraten: Dota 2 ist jetzt inoffiziell Teil des PMEU (des erweiterten Pac-Man-Universums).",
  "new_frontiers_map_lotus_pools_title": "Lotosbrunnen",
  "new_frontiers_map_lotus_pools_desc": "Spieler können jetzt auf der linken und rechten Seite der Karte Lotosbrunnen finden (in der Nähe der Stelle, an der sich die Dienerwellen zum ersten Mal treffen). Diese spawnen regelmäßig Früchte, die beim Konsumieren Mana und LP gewähren.<br><br>Spieler, die diese Früchte lagern, können diese in der späten Spielphase kombinieren und von den größeren, ergiebigeren Früchten profitieren. Diese größeren Früchte können sogar zu einer [i]unglaublich[/i] großen Frucht kombiniert werden. Was geschieht, wenn Sie die [i]unglaublich[/i] große Frucht herstellen? Wahrscheinlich nichts. (Definitiv etwas!)",
  "new_frontiers_map_tormentors_title": "Peiniger",
  "new_frontiers_map_tormentors_desc": "Diese zwei neutralen Einheiten spawnen nach 20 Minuten in der Nähe jeder Basis und haben sich die Bäuche mit Aghanims Splittern vollgeschlagen. Es gibt nur ein Problem, nämlich, dass es zwei Probleme gibt: 1. Peiniger sind mit Megaschilden ausgestattet, die den meisten Schaden auf einen Angreifer wieder zurück reflektieren. 2. Mit jedem ihrer Tode werden sie immer stärker. Es erfordert also wahrscheinlich Ihr gesamtes Team, um einen davon zu besiegen.<br><br>Die gute Nachricht? Wenn Sie die Peiniger in Ruhe lassen, werden auch Sie in Ruhe gelassen.",
  "new_frontiers_map_watchers_title": "Wächter",
  "new_frontiers_map_watchers_desc": "Wächter sind wie Terminatoren, nur, dass sie überwachen. Sie sind unbarmherzig. Sie kennen keinen Schmerz. Sie kennen keine Furcht. Sie sind aber faul. Sie hören nicht auf, zu überwachen, wenn Sie auf sie klicken.<br><br>Wächter beginnen die Partie inaktiv und neutral. Sobald sie aber aktiviert wurden, gewähren sie für sieben Minuten Sicht über das Gebiet des Wächters – oder bis Ihre Gegner ihn sabotieren und temporär deaktivieren. Wenn ein Team Roshan tötet, schließen sich alle Wächter deren Seite an.",
  "new_frontiers_map_barriers_title": "Tor der Verteidiger",
  "new_frontiers_map_barriers_desc": "Das Tor der Verteidiger kombiniert die fantastische Welt von Dota mit dem praktischen Nutzen Ihrer Haustür, die Sie abschließen können, wenn Sie zum Supermarkt gehen, um dort einen Ancient zu zerstören. Das Tor ist eine Hintertür zu Ihrer Basis mit einer praktischen Energiebarriere, die Ihr Team durch- und das gegnerische Team außen vor lässt. Während der Gegner Sie also von vorn angreift, können Sie von hinten rein- und rausschleichen.",
  "new_frontiers_map_wisdom_runes_title": "Runen der Weisheit",
  "new_frontiers_map_wisdom_runes_desc": "Erforschen Sie die Ecken der Karte, um Runen der Weisheit zu entdecken. Jedem Helden, der weise eine stibitzt, wird ein Extraschub EP gewährt. Runen der Weisheit spawnen in der Nähe Ihrer Basis und bieten Ihrem Team einen einfach zu verteidigenden Konter, bevor eine verloren geglaubte Partie völlig außer Kontrolle geraten kann.",
  "new_frontiers_map_shield_runes_title": "Runen des Schutzes",
  "new_frontiers_map_shield_runes_desc": "Die Kraftrunen im Fluss erhalten mit der mächtigen neuen Schutzrune, die 50 % der max. LP als Barriere verleiht, ebenfalls einen Neuzugang. Damit können Sie sich früh in der Partie weit hinter die Linien gegnerischer Türme für einen Kill vorwagen – oder durch den Nebel des Krieges verdeckte Bereiche erkunden und dort auf gleichermaßen überraschte Gegner treffen.",
  "new_frontiers_map_named_regions_title": "Namhafte Regionen",
  "new_frontiers_map_named_regions_desc": "In den erweiterten Kartenbereichen finden sich nun besondere Regionen, die als „Die Minen“, „Der Brunnen“, „Der Friedhof“ und „Die Statue“ bezeichnet werden. So ist es noch einfacher, seinen Teamkameraden mitzuteilen, wo genau man getötet wird. Alle Einheiten in diesen Regionen erhalten regionsspezifische Modifikatoren für ihre Werte.",
  "new_frontiers_map_creep_camps_title": "12 neue Lager neutraler Einheiten",
  "new_frontiers_map_creep_camps_desc": "Einige der neutralen Einheiten hatten es satt, ständig im Dschungel niedergemetzelt zu werden, und haben 12 neue Lager im erweiterten Kartenbereich errichtet. Nun kann man sie also auch dort niedermetzeln.",
  "new_frontiers_map_outpost_title": "Neue Außenposten",
  "new_frontiers_map_outpost_desc": "Die neuen erweiterten Kartenbereiche enthalten zwei neue Außenposten. Die ursprünglichen Außenposten wurden an neuen Orten errichtet, was zu der naheliegenden Frage führt, ob es sich wirklich um die ursprünglichen Außenposten handelt. Netter Versuch, Sokrates: Es sind dieselben.",
  "new_frontiers_major_gameplay_features_desc": "Das Neue-Horizonte-Update führt große Änderungen an Ihren Lieblingshelden und -systemen ein. Tatsächlich hat uns unsere Rechtsabteilung empfohlen, Ihnen mitzuteilen, dass dieser Gameplay-Bereich [i]so vollgepackt[/i] ist mit meta-definierenden neuen Funktionen, dass Sie diesen innerhalb der nächsten paar Wochen langsam lesen sollten, damit Sie sich nicht zu sehr aufregen und den Notruf bemühen müssen.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Helden im Rampenlicht",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Alle Helden sind nun ausbalanciert, aber manche sind ausbalancierter. Wir möchten hier einige davon besonders hervorheben.",
  "new_frontiers_major_gameplay_new_items_title": "Neue Gegenstände",
  "new_frontiers_major_gameplay_new_items_desc": "Alles, was das Sammlerherz begehrt.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Neue neutrale Gegenstände",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Wir haben sieben brandneue neutrale Gegenstände in unsere Kollektion aufgenommen und einige alte Lieblinge zurückgebracht.",
  "new_frontiers_major_gameplay_bkb_title": "Black King Bar überarbeitet",
  "new_frontiers_major_gameplay_bkb_desc": "Die Aktivierung von Black King Bar wirkt jetzt eine Standardentzauberung und gewährt 50 % Magieresistenz sowie Immunität gegen Schwächungseffekte. Während der Gegenstand aktiv ist, haben bereits wirkende Schwächungseffekte keinen Einfluss mehr auf Ihren Helden. Des Weiteren ist Ihr Held gegen reinen und reflektierten Schaden immun.<br><br>Seien Sie aber vorsichtig: Wenn Black King Bar vor dem Ablauf eines Schwächungseffekts aufhört zu wirken, wird der Schwächungseffekt für den verbleibenden Zeitraum angewendet. Effekte, die die Zauberimmunität durchdringen, durchdringen auch die Immunität gegen Schwächungseffekte.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Neues Heldenattribut",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Als der vierte, von uns freigelassene Geisterbruder hätte Void Spirit eigentlich kein Stärke-, Agilitäts- oder Intelligenzheld sein dürfen. Um sich wirklich abzuheben, hätte er eigentlich eine neue Art von Held sein müssen. Eine [i]vierte[/i] Art von Held.<br><br>Deshalb präsentieren wir stolz die universellen Helden – eine neue Hauptattributsgruppe, die sich aus bestehenden Helden zusammensetzt, die jetzt von jedem Attribut 0,6 Schaden erhalten. Unsere Ingenieure versichern, dass diese Zahl perfekt ausbalanciert ist. Es sei denn, das stimmt nicht. Stürzen wir uns also in das Abenteuer des Neue-Horizonte-Updates und finden es gemeinsam heraus.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Funde neutraler Gegenstände überarbeitet",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Das Niedermetzeln von Kreaturen des Dschungels bedeutete früher, dass man einen coolen neuen neutralen Gegenstand bekam … und der für gewöhnlich an den Carry-Helden ging – der in der Regel nicht Sie waren. Jetzt lässt eine neutrale Einheit beim Tod eine Marke fallen, mit der Sie aus [i]fünf[/i] verfügbaren neutralen Gegenständen auswählen können. Jede Marke bietet eine Auswahl mit fünf Optionen, sodass selbst der letzte Spieler, der seine Marken einlöst, eine echte Wahl hat.<br><br>Marken können von jedem beliebigen Teammitglied genutzt werden. Sobald aber ein Gegenstand ausgewählt wurde, kann dieser nicht geteilt werden – gehen Sie also beim Aufteilen Ihrer Marken weise um!",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Skalierung neutraler Einheiten",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Neutrale Einheiten und ihre Fähigkeiten skalieren nun im Laufe der Zeit. Das bedeutet, dass es im Verlauf einer Partie immer schwieriger wird, Lager neutraler Einheiten zu farmen. Dadurch bekommen Helden, die Einheiten kontrollieren können, einen recht schlagkräftigen Vorteil.",
  "new_frontiers_major_gameplay_kill_formula_title": "Formel für Heldenkills überarbeitet",
  "new_frontiers_major_gameplay_kill_formula_desc": "Wir haben die Formel für Heldenkills überarbeitet, damit Kills in der frühen Spielphase eine noch größere Wirkung entfalten und Spieler dazu motiviert werden, Überfälle auf andere Pfade vorzubereiten. Wir haben auch die Skalierung der Goldprämien für Pfaddiener reduziert, um das Farmen von Dienern im Verlauf des Spiels weniger profitabel zu machen und Spieler dazu zu ermutigen, das Gold aus anderen Helden herauszuprügeln.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Geht auch ohne Betäubung",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Es macht immer mehr Spaß, seinen Lieblingshelden zu spielen, als herumzusitzen und seinen Helden nicht zu spielen. Nun, liebe Fans des Dauerspielens und liebe Kritiker von Spielaussetzern – Ihre Träume sind wahr geworden: Machen Sie sich bereit, Ihren Helden noch mehr als je zuvor zu spielen!<br><br>Wie? Ganz einfach. Wir haben die Dauer von fast jeder Deaktivierung reduziert. Wie sind wir auf diesen wahnsinnigen Plan gekommen? Noch einfacher. Ein Roar des Beastmasters hat uns voll im Gesicht erwischt und wir hatten plötzlich jede Menge Zeit zum Nachdenken.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Nach zwei Monaten, in denen Muerta die Pfade heimgesucht hat, erhielt sie nun endlich das Zepter und die Splitter von Aghanim. Falls Sie sie noch nicht kennengelernt haben, schauen Sie doch mal auf der [url=https://www.dota2.com/deadreckoning]Website zur Rache der Toten[/url] vorbei.",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi ist zu dumm, um ein Intelligenz-Held zu sein. Deshalb ist er keiner mehr.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa ist anfangs so schwach wie ein Baby, aber wie ein Baby wird sie mit der Zeit noch stärker.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Wenn das Leben dir Clinkz in der zufälligen Heldenauswahl gibt, erschaff einfach Skelette.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden konnte einst einen perfekten Doppelgänger von sich selbst erschaffen. Aber jetzt erschafft er eine [i]bessere[/i] Version von sich selbst! Oder auch nicht. Jedenfalls ist dieser anders. Und ziemlich authentisch, denken wir.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Der Held Alchemist ist jetzt, wie alle Alchemist-Spieler, von Natur aus gierig.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ZEITLICH BEGRENZTER EFFEKT FÜR ARC WARDEN",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Nur für kurze Zeit: Wenn Sie als Dire spielen und Arc Warden auswählen, wird der Doppelgänger zum Haupthelden und beschwört mit seiner ultimativen Fähigkeit sein „normales“ Selbst.",
  "new_frontiers_matchmaking_desc": "Seien wir mal ehrlich: Es gibt 8 Milliarden Leute auf der Welt und 99,99 % davon sind unglaublich schlecht in Dota. Das bedeutet, dass die Spielsuche eine Herausforderung sein kann, insbesondere, wenn Sie gut in Dota sind, und es lieben, mit Leuten zu spielen, die hoffentlich fast, aber nicht ganz so gut Dota spielen, wie Sie. Wir haben viel Arbeit und viel Mathematik aufgewendet, um die allgemeine Qualität unserer Spielsuche für Spieler aller Spielstärken zu verbessern.",
  "new_frontiers_matchmaking_intro_title": "Spielsuche mit tatsächlicher Spielstärke",
  "new_frontiers_matchmaking_intro_desc": "Die Matchmaking-Wertung (MMW) besteht tatsächlich nur aus zwei Zahlen: dem Rang und der Bewertungsabweichung. Ihr Rang ist eine Einschätzung Ihres spielerischen Könnens und die Bewertungsabweichung errechnet sich über die Wahrscheinlichkeit, dass Ihre Wertungszahl auch Ihrer tatsächlichen Spielstärke entspricht. Wenn Sie eine Partie spielen, passen wir Ihren Rang auf Basis von Siegen und Niederlagen an. Ihre Bewertungsabweichung wird ebenfalls geringer, da sich Ihre Wertungszahl mit zusätzlichen Daten einpendelt.",
  "new_frontiers_matchmaking_details_old_title": "Ungewollte Anhäufungen: Das schlechteste Ergebnis eines Verteilungsalgorithmus",
  "new_frontiers_matchmaking_details_old_desc": "Dota verwendete traditionell eine modifizierte Version des Elo-Algorithmus, um Änderungen an Rängen und an der Bewertungsabweichung zu implementieren. Mit der Zeit haben wir allerdings bemerkt, dass es mit unserem Ansatz einige Probleme gibt. Beispielsweise hat sich die Verteilung der MMWs allmählich nach unten verschoben und eine ungewollte Anhäufung im MMW-Bereich von 0 bis 1000 verursacht. Ein weiteres Problem war, dass Spieler, die nach einer längeren Pause zurückkehrten, es viel schwerer hatten, eine korrekten MMW zu erhalten, da ihre vorherige Spielstärke nicht mehr repräsentativ war.",
  "new_frontiers_matchmaking_details_new_title": "Neuer und verbesserter Verteilungsalgorithmus",
  "new_frontiers_matchmaking_details_new_desc": "Um dieses Problem zu lösen, wechseln wir zu einem anderen Algorithmus: Glicko. Dieser sollte Sie während der Spielsuche schnell und präzise mit Spielern ähnlicher Spielstärke für Partien zusammenbringen. Mathematisch betrachtet ermöglicht es uns der Glicko-Algorithmus, die Bewertungsabweichung besser in unseren Berechnungen einzubeziehen, wodurch wir genauere Entscheidungen zum Verdienst und Verlust von Rängen erhalten.\\n\\nDer Wechsel zu unserem neuen Matchmaking-System wird sich ein wenig so anfühlen, wie zu Beginn einer neuen MMW-Saison: [list][*]Alle Spieler durchlaufen eine kurze Kalibrierungsphase und werden dafür anfänglich auf ihren vorherigen Rang gesetzt.\\n[*]Die Kalibrierung wird nicht mehr über eine feste Anzahl an Partien vorgenommen. Stattdessen wird ein Spieler als kalibriert betrachtet, wenn dessen Bewertungsabweichung eine bestimmte Schwelle übersteigt.\\n[*]Nach der Kalibrierung ist es wahrscheinlich, dass Sie auf einer anderen Medaille als zuvor landen. Auch wenn Ihre Medaillenänderung bedeutend ausfallen sollte, sollten Sie hiernach Spielern ähnlicher Spielstärke begegnen.\\n[*]Partien resultieren nicht mehr in einen festen Verdienst/Verlust von MMW. Diese basieren vielmehr auf diversen Faktoren, inklusive der Ränge und Bewertungsabweichungen der Mitspieler. Der Verdienst/Verlust wird jedoch pro Partie gekappt, um besonders negative Ergebnisse zu verhindern.[*]Wenn ein Spieler keine Partien spielt, erhöht sich die Bewertungsabweichung des Spielers mit der Zeit.[/list]Wir haben hinter den Kulissen beide Matchmaking-Systeme seit einer Weile zeitgleich ausgeführt. Deshalb haben wir volles Vertrauen in diese Änderungen. Uns ist klar, dass eine korrekte MMW nur einer von vielen Faktoren ist, die sich auf die Spielqualität auswirken. Wie bei allen Änderungen in diesem Bereich sind wir auch hier an Ihrem Feedback interessiert.",
  "new_frontiers_matchmaking_immortals_title": "Spielsuche im Immortal-Rang",
  "new_frontiers_matchmaking_immortals_desc": "Im Immortal-Rang ist es oft wichtiger, andere Spieler zu kennen, sich mit ihnen zu verständigen und eine gute Rollenbalance zu finden, als nur den MMW zu berücksichtigen. Dementsprechend haben wir die Spielsuche für den Immortal-Rang umgearbeitet.<br><br>Partien im Immortal-Rang werden nicht mehr mit bereits aufgestellten Teams gestartet. Stattdessen stellen zwei Kapitäne ihr jeweiliges Teams aus den übrigen acht Spielern zusammen. Im Vergleich zu einer Zuweisung, die auf dem MMW der Spieler basiert, werden die Teams hierdurch wesentlich schlagkräftiger. Leider bedeutet dies auch, dass die Schuld nur noch bei Ihnen liegt, wenn Ihre Immortal-Partien trotzdem den Bach runtergehen.",
  "new_frontiers_ui_desc": "Leiden Sie unter verschwommener Sicht und Schmerzen im Arm? Wir raten Ihnen, das zu ignorieren, da Ihr Körper damit nur sagen will, dass er hungrig ist. Sie haben einen platten Reifen? Fahren Sie auf der Felge – die ist immer noch rund. Der Punkt ist: Fast alles im Leben kann ohne Konsequenzen sicher ignoriert werden.<br><br>Außer die Lebensanzeigen von Dota. Die sind wichtig. Und deshalb haben wir mit diesem Update einige der mit den Lebenspunkten verbundenen Benutzeroberflächeninformationen gewaltig verbessert.",
  "new_frontiers_ui_shields_title": "Barrierenindikatoren auf Lebensbalken",
  "new_frontiers_ui_shields_desc": "Wussten Sie, dass es in Dota Schilde gibt? Magische Schilde, physische Schilde, dunkle Schilde … alle möglichen Arten von Schilden! Vielleicht haben Sie sie nur übersehen. Oder auch einfach ignoriert. Denn es gab bisher keine Möglichkeit herauszufinden, wie viele Schildpunkte man anfänglich hatte oder wie viele noch übrig waren.<br><br>Aber dieses dunkle Zeitalter der Ungewissheit ist nun vorüber. Jetzt entgeht niemandem mehr, was andere „im Schilde führen“. Zumindest sind die beiden vorher genannten Punkte ersichtlich. Auch lässt sich jetzt die Art des Schildes feststellen! Da die alten Schilde mit dieser visuellen Aufwertung so viel besser aussehen, haben wir beschlossen, dies mit einer Reihe neuer Fähigkeiten, die davon Gebrauch machen, zu feiern.<br><br>Außerdem haben wir die Schilde in „Barrieren“ umbenannt, um Verwechslungen mit Vanguard zu vermeiden. Gern geschehen.",
  "new_frontiers_ui_health_pips_title": "Segmentierter Lebensbalken",
  "new_frontiers_ui_health_pips_desc": "Einige Einheiten verfügen nicht über die traditionellen Lebenspunkte und bedürfen einer bestimmten Anzahl an Angriffen, um vernichtet zu werden. Statt wie bisher eine übermenschliche Fähigkeit zum Mitzählen besitzen zu müssen oder einfach zu raten, können Sie künftig einfach die Einheit genauer betrachten, die Sie im Visier haben. Praktisch segmentierte Balken repräsentieren die benötigten Treffer, bevor Ihr Gegner den Drang des Irdischen abschüttelt (Zitat aus dem Lebensbalken von Hamlet).",
  "new_frontiers_ui_health_cost_title": "LP-Kosten",
  "new_frontiers_ui_health_cost_desc": "Während die meisten Fähigkeiten in Dota Mana verbrauchen, gibt es auch einige, die stattdessen Lebenspunkte aufzehren. Diese Fähigkeiten zeigen nun auch die entsprechenden LP-Kosten für das Wirken an. Nicht schlecht, oder? Eigentlich verrückt, dass niemand früher auf diese Idee gekommen ist. Wie auch immer, besser spät als nie.",
  "new_frontiers_gameplay_update_desc": "Das ist eine gewaltige Liste an Dingen, die wir bislang aufgeführt haben. Das könnte nur durch [i]zwei[/i] gewaltige Listen getoppt werden, aber wo finden wir mehr … [i]Schau mal einer an![/i] Lesen Sie einfach weiter, wenn Sie sich für alle anderen Änderungen an der Spielbalance interessieren, die dieses Update parat hat. Oder springen Sie direkt ins Spiel! Glauben Sie uns, Sie müssen uns gar nicht erzählen, wie viel Spaß es macht, technische Handbücher zu Videospielen zu lesen. Aber diese zu spielen, ist fast genauso spaßig. Unsere Listen warten hier auf Sie, wenn Sie zurückkommen.",
  "new_frontiers_misc_title": "Verschiedenes",
  "new_frontiers_misc_role_tokens": "Wir haben die Anzahl an Marken für die Rollensuche reduziert, die beim Verlieren einer Partie mit der Auswahl aller Rollen gewährt werden. Sie verdienen jetzt zwei Marken pro Niederlage. (Beim Sieg verdienen Sie nach wie vor vier Marken.) Diese Änderung sollte dabei helfen, das Spielerverhalten in Ranglistenspielen mit Rollen zu verbessern, bei denen das Farmen von Marken gegenüber dem effektiven Spielen der ausgewählten Rolle gelegentlich Vorrang nahm.",
  "new_frontiers_misc_removed_roles": "Wir haben den „Captains Mode“ aus Ranglistenspielen sowie „All Random“ und „All Random Deathmatch“ aus allen normalen Spielen entfernt. Fast niemand spielte diese Modi und die Wartezeiten waren oft länger als eine Stunde.",
  "new_frontiers_misc_model_editor": "Mit diesem Update wurde der Editor für klassische Modelle entfernt. Alle VMDL-Dateien werden jetzt im neuen Werkzeug geladen und alle alten Modelle beim ersten Laden im Werkzeug konvertiert. In einem späteren Update entfernen wir dann die Unterstützung zum Laden alter kompilierter Formate vollständig. Deshalb fordern wir alle Workshop-Autoren dazu auf, ihre Modelle so bald wie möglich in das neue Format zu konvertieren und erneut zu kompilieren.",
  "new_frontiers_misc_hold_animation": "Wir haben den klassichen „HoldAnimation“-Schlüssel für dynamische Elemente entfernt. Benutzerdefinierte Spiele sollten entweder manuell zum neuen „loop mode“-Schlüssel wechseln oder ihre Karten erneut kompilieren, um automatisch auf diese neuen Eigenschaften aktualisiert zu werden.",
  "neutral_item_tier": "Neutraler Gegenstand ([b]Stufe %1$s[/b])",
  "dota_ability_variable_health": "Lebenspunkte",
  "dota_ability_variable_mana": "Mana",
  "dota_ability_variable_armor": "Rüstung",
  "dota_ability_variable_damage": "Schaden",
  "dota_ability_variable_str": "Stärke",
  "dota_ability_variable_int": "Intelligenz",
  "dota_ability_variable_agi": "Agilität",
  "dota_ability_variable_all": "auf alle Attribute",
  "dota_ability_variable_primary_attribute": "auf Primärattribut",
  "dota_ability_variable_attack": "Angriffstempo",
  "dota_ability_variable_hp_regen": "Lebensregeneration",
  "dota_ability_variable_lifesteal": "Lebensraub",
  "dota_ability_variable_mana_regen": "Manaregeneration",
  "dota_ability_variable_mana_regen_aura": "Manaregeneration (Aura)",
  "dota_ability_variable_spell_amp": "Zauberschaden",
  "dota_ability_variable_debuff_amp": "Schwächungsdauer",
  "dota_ability_variable_move_speed": "Bewegungstempo",
  "dota_ability_variable_evasion": "Ausweichchance",
  "dota_ability_variable_spell_resist": "Magieresistenz",
  "dota_ability_variable_spell_lifesteal": "Zauberlebensraub",
  "dota_ability_variable_spell_lifesteal_creep": "Zauberlebensraub (Einheiten)",
  "dota_ability_variable_spell_lifesteal_hero": "Zauberlebensraub (Helden)",
  "dota_ability_variable_selected_attrib": "auf ausgewähltes Attribut",
  "dota_ability_variable_attack_range": "Angriffsreichweite <font color='#7d7d7d'>(nur für Fernkampfhelden)</font>",
  "dota_ability_variable_attack_range_melee": "Angriffsreichweite <font color='#7d7d7d'>(nur für Nahkampfhelden)</font>",
  "dota_ability_variable_cast_range": "Zauberreichweite",
  "dota_ability_variable_status_resist": "Statusresistenz",
  "dota_ability_variable_projectile_speed": "Projektiltempo",
  "dota_ability_variable_manacost_reduction": "Manakostenreduzierung",
  "dota_ability_variable_cooldown_reduction": "Abklingzeitreduzierung",
  "dota_ability_variable_max_mana_percentage": "max. Manabonus",
  "dota_ability_variable_aoe_bonus": "Wirkungsbereichsbonus"
}