// 6937.js

{
  "language": "ukrainian",
  "new_frontiers_gameplay_number": "Ігроладне оновлення 7.33",
  "new_frontiers_title": "Оновлення «Нові фронтири»",
  "new_frontiers_title_short": "Нові фронтири",
  "new_frontiers_subtitle": "Нова мапа, великі ігроладні зміни й багато іншого. Цілковито новий світ для дослідження.",
  "new_frontiers_play_trailer": "Дивитися трейлер",
  "new_frontiers_dota_team_intro": "Оновлення «Нові фронтири» містить нову мапу, великі зміни ігроладу, пошуку матчів, користувацького інтерфейсу і — ми тут не жартуємо — ще дуже багато іншого.<br><br>Як багато? Так багато, що дійсно важко все пригадати, і ми вже почали панікувати, аж доки хтось не згадав, що можна це все записати. Що ми і зробили. Тепер можемо перечитувати, коли забажаємо. І ви теж можете! Прокручуйте вниз.",
  "new_frontiers_eldor_name": "Елдор-чарівник",
  "new_frontiers_dota_team_name": "Команда Dota",
  "new_frontiers_section_title_map": "Нова мапа",
  "new_frontiers_section_title_major_gameplay": "Великі ігроладні зміни",
  "new_frontiers_section_title_matchmaking": "Пошук матчів",
  "new_frontiers_section_title_ui": "Інтерфейс",
  "new_frontiers_section_title_gameplay_update": "Зміни балансу",
  "new_frontiers_map_introduction": "Мапа Dota суттєво розширилася. Ключова ціль гри залишилася незмінною — ваші лінії на тій самій відстані одна від одної й усе необхідне для перемоги так само розташоване в центрі мапи.<br><br>Та 40% додаткового ландшафту відкривають чимало простору для збирання нових ресурсів і виявлення нових стратегій. Основні ліси також було цілковито перероблено з точки зору розташування огляду, таємних маршрутів, фарму тощо.",
  "new_frontiers_map_subtitle": "Досліджуйте новий світ",
  "new_frontiers_map_roshan_title": "Нові домівки Рошана",
  "new_frontiers_map_roshan_desc": "Рошан продав своє старе лігво на річці та скористався вигідною ситуацією на ринку нерухомості. Тепер він щасливий власник [i]двох[/i] чудових нових лігв у північно-західному та південно-східному кутках мапи. То справжній рай для лігволюбів із неймовірними краєвидами та лише в кількох хвилинах ходу від таємної крамниці.<br><br>Також схоже, що десь поруч із ними знаходиться тренажерна зала, бо Рошан став ще міцнішим. Він більше не носить Уламки Аґаніма, але натомість після другої смерті з нього випадає сир, а після третьої — Уламок відновлення або Скіпетр Аґаніма, залежно від того, в якому він лігві.",
  "new_frontiers_map_twin_gates_title": "Подвійні портали",
  "new_frontiers_map_twin_gates_desc": "Два портали поєднують кути мапи біля веж легкої лінії, що дозволяє гравцям миттєво телепортуватися з одного краю мапи на інший.<br><br>Хоча це ігроладна зміна, але вона пов’язана з історією світу гри. Ви вгадали: Dota 2 тепер офіційно входить до ПВМП… ой, до РВПМ (розширеного всесвіту Пакмена).",
  "new_frontiers_map_lotus_pools_title": "Ставки лотоса",
  "new_frontiers_map_lotus_pools_desc": "Гравці тепер можуть знайти ставки лотоса в лівій та правій частині мапи (біля місць, де зустрічаються перші хвилі кріпів). Періодично там з’являються лотоси, які дають ману та здоров’я.<br><br>Гравці можуть збирати їх, а потім комбінувати в більший і цінніший лотос у пізній грі. А великі лотоси можна поєднати у [i]велетенський[/i] лотос. А що трапиться, якщо поєднати [i]велетенські[/i] лотоси? Імовірно, нічого (однак точно щось).",
  "new_frontiers_map_tormentors_title": "Мучителі",
  "new_frontiers_map_tormentors_desc": "Це два могутніх нейтральних кріпа, які з’являються біля кожної бази на 20-й хвилині гри й зберігають Уламки Аґаніма. Та є нюанс, і він у тому, що тут два нюанси. 1) Мучителі мають мегащит, який відбиває більшість спрямованої в них шкоди. 2) Вони стають могутнішими кожного разу, як ви їх убили. Тож для знищення одного може знадобитися вся команда.<br><br>Добра новина в тому, що якщо їх не чіпати, то й вони вас не чіпатимуть.",
  "new_frontiers_map_watchers_title": "Споглядачі",
  "new_frontiers_map_watchers_desc": "Споглядачі — це мов Термінатори, тільки для спостереження. Вони невтомні. Вони не відчувають біль. Вони не знають страху. Втім, вони також ліниві. Вони не почнуть споглядати, допоки ви не клацнете їх.<br><br>На початку гри споглядачі неактивні й нейтральні, а після активації вони дають видимість навколо себе на 7 хвилин, або доки вороги не здійснять диверсію, щоби тимчасово вимкнути їх. Коли команда вбиває Рошана, то всі споглядачі стають на її бік.",
  "new_frontiers_map_barriers_title": "Захисні брами",
  "new_frontiers_map_barriers_desc": "Захисні брами поєднують високий фентезійний стиль Dota із практичністю дверей вашого будинку, які ви можете замикати, коли йдете в супермаркет знищити тамтешнього Древнього. Це задні двері до вашої бази зі зручним силовим полем, яке пропускає вашу команду й не пускає ворогів. Коли ворог нападає через центральний вхід, то ви можете втекти через задній.",
  "new_frontiers_map_wisdom_runes_title": "Руни мудрості",
  "new_frontiers_map_wisdom_runes_desc": "Розшукуйте руни мудрості на краях мапи. Вони підвищують досвід героя, достатньо мудрого, щоби їх підняти. З’являються в місцях поруч із вашою базою й посилюють оборонну здатність, не дозволяючи грі повністю вийти з-під контролю в несприятливій ситуації.",
  "new_frontiers_map_shield_runes_title": "Руни захисту",
  "new_frontiers_map_shield_runes_desc": "Річкові руни підсилення отримали поповнення — нову потужну руну захисту, яка створює щит із 50% вашого максимального здоров’я. З нею ви можете заходити за ворожу вежу для вбивства в ранній грі або ж підійматися на пагорб, щоби здивувати ворогів або здивуватися самому.",
  "new_frontiers_map_named_regions_title": "Іменні області",
  "new_frontiers_map_named_regions_desc": "Розширена мапа тепер містить різні області, як-от Копальні, Колодязь, Кладовище та Статуя. Вони дозволять вам легко повідомити союзникам про місце, де вас убивають. Усі істоти в цих зонах отримують особливі модифікатори.",
  "new_frontiers_map_creep_camps_title": "12 нових таборів кріпів",
  "new_frontiers_map_creep_camps_desc": "Деякі кріпи стомилися від того, що їх постійно винищують у лісі, і заснували 12 нових таборів по всій розширеній мапі. Тож тепер ви можете винищувати їх і там.",
  "new_frontiers_map_outpost_title": "Нові застави",
  "new_frontiers_map_outpost_desc": "Нова розширена мапа містить дві нові застави, а старі переміщено в інші місця, що серйозно ставить питання, чи дійсно можна називати їх старими. Гарна спроба, Сократе. Можна.",
  "new_frontiers_major_gameplay_features_desc": "Оновлення «Нові фронтири» впроваджує великі зміни до ваших улюблених героїв та механік. Власне, наш юридичний відділ порадив нам сказати вам: розділ ігроладних змін настільки [i]щільно набитий[/i] визначальними для гри особливостями, що вам слід читати його повільно й упродовж кількох наступних тижнів, бо інакше ви можете занадто перейнятися й вам доведеться викликати пожежників.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Огляд змін героїв",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Хоча ми перебалансували всіх героїв, але деяких більше за інших. Ось найпомітніші з них.",
  "new_frontiers_major_gameplay_new_items_title": "Нові предмети",
  "new_frontiers_major_gameplay_new_items_desc": "Вибір на будь-який гаманець.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Нові нейтральні предмети",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Ми додали сім цілковито нових нейтральних предметів, а також повернули кількох старих улюбленців.",
  "new_frontiers_major_gameplay_bkb_title": "Перероблено Посох чорного короля",
  "new_frontiers_major_gameplay_bkb_desc": "Активація Посоха чорного короля тепер застосовує базове розвіювання й дає 50% опору до магії та імунітет до негативних ефектів. Під час дії на вас не накладаються негативні ефекти. Також ви отримуєте імунітет до абсолютної та відбитої шкоди.<br><br>Та будьте обережними: якщо термін дії Посоха чорного короля завершиться раніше дії негативних ефектів, то вони застосуються на решту свого часу дії. Ефекти, що пробивають імунітет до чарів, тепер також пробивають імунітет до негативних ефектів.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Новий тип характеристик героя",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Після випуску четвертого брата-духа, стало очевидно, що Порожнечий Дух не може бути героєм сили, спритності чи інтелекту. Аби відрізнятися, він має бути новим типом героя. [i]Четвертим[/i] типом героя.<br><br>Тому ми вводимо універсальних героїв: нову групу героїв за основною характеристикою, яка складається з наявних героїв, котрі тепер отримують 0,6 до шкоди від кожної характеристики. Наші інженери запевнили, що це число ідеально збалансоване. Якщо тільки вони чогось не пропустили. Та добра новина в тому, що ми всі можемо самостійно перевірити це у великій пригоді, в яку вирушимо з виходом оновлення «Нові фронтири».",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Перероблено випадіння нейтральних предметів",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Убивство нещасних лісових істот виключно задля отримання чудового нового нейтрального предмета… зазвичай є справою лідера команди, яким ви буваєте не часто. Тепер убивство нейтрального кріпа може дати жетон, який дозволить вам обрати з-поміж [i]п’ятьох[/i] доступних нейтральних предметів. Кожен жетон дає рівно п’ять варіантів, тож навіть останній гравець, який використовуватиме свій жетон, матиме реальний вибір.<br><br>Гравці команди можуть передавати жетони один одному, але після вибору предмета передати його вже не можна, тож використовуйте жетони з розумом.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Масштабування нейтральних кріпів",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Тепер нейтральні кріпи та їхні здібності з часом масштабуються. Так, табори буде важче зачищати на пізніших стадіях гри, але герої, що можуть контролювати кріпів, отримуватимуть суттєве посилення.",
  "new_frontiers_major_gameplay_kill_formula_title": "Перероблено формулу вбивства",
  "new_frontiers_major_gameplay_kill_formula_desc": "Ми переробили формулу вбивства, щоби ранні вбивства мали більший вплив на гру й мотивували гравців робити несподівані атаки на інші лінії. Ми також зменшили масштабування золота для лінійних кріпів, щоби фарм кріпів ставав менш вигідним на пізніших етапах гри і для заохочення гравців добувати золото один з одного.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Неприголомшлива нова особливість",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Грати своїм героєм завжди цікавіше, ніж просто сидіти й не грати ним. Тож прихильники гри та критики не-гри: ваша мрія стала реальністю. Приготуйтеся грати своїм героєм більше, ніж будь-коли раніше.<br><br>Як? Просто. Ми зменшили тривалість майже всіх знерухомлень у грі. Як нам спав на думку такий божевільний план? Ще простіше. Ми отримали в обличчя Первісний рик Звіромайстра й несподівано в нас з’явилося багато часу подумати.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Після двох місяців полювання на лініях Муерта нарешті знайшла свій Скіпетр і Уламок Аґаніма. Якщо ви ще не знайомилися з нею, то більше можна довідатися в [url=https://www.dota2.com/deadreckoning]оновленні «Смертельна відплата»[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Огр-Маг занадто тупий, щоби бути героєм інтелекту. Тож тепер він ним не є.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Медуза тепер починає слабкою, мов немовля. Та, як і немовля, з часом вона стає все сильнішою.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Більшість зі здібностей Клінкза, як і найкращі життєві здібності, тепер створюють скелетів.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Вартовий раніше створював досконалу копію самого себе. Тепер же він створює [i]кращу[/i] версію себе! Або гіршу! У будь-якому разі іншу. І, напевно, не контроверсійну.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Алхімік, як і всі гравці на Алхіміку, тепер має вроджену жадібність.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ОБМЕЖЕНИЙ У ЧАСІ БОНУС ВАРТОВОГО",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Лише впродовж обмеженого часу, коли ви обираєте Вартового в грі за Пітьму, його Буремний двійник буде головним героєм, а чаклування ультимативної здібності викликатиме «звичайного» героя.",
  "new_frontiers_matchmaking_desc": "Будьмо чесними: на планеті вісім мільярдів людей, і 99,99% із них жахливо грають у Dota. Це значить, що пошук матчів може бути справжнім випробуванням, особливо якщо ви добре граєте в Dota й любите грати з людьми, які теж грають непогано (але, в ідеалі, не настільки добре, як ви). Ми виконали чимало роботи й математичних розрахунків, щоби покращити роботу нашого пошуку матчів для гравців із будь-яким рівнем навичок.",
  "new_frontiers_matchmaking_intro_title": "Відповідний пошук матчів",
  "new_frontiers_matchmaking_intro_desc": "Рейтинг пошуку матчів (MMR) складається з двох чисел: рейтингу та відповідності рейтингу. Ваш рейтинг — це оцінка вашого рівня навичок, а ваша відповідність рейтингу — це наша довіра цій оцінці. Коли ви граєте матч, то ми трішки змінюємо ваш рейтинг залежно від виграшу чи програшу. Ваша відповідність рейтингу також зростає, бо тепер ми маємо більше даних.",
  "new_frontiers_matchmaking_details_old_title": "Проблеми стародавнього алгоритму",
  "new_frontiers_matchmaking_details_old_desc": "Традиційно Dota використовувала модифіковану версію алгоритму Elo для змін рейтингу та відповідності рейтингу. Та з часом ми помітили кілька проблем цього підходу. Наприклад, розподіл очок рейтингу поступово знижувався, що створювало небажане скупчення в діапазоні 0—1000. Іншу проблему мали гравці, які робили перерву і їм було дуже складно повернутися до правильного рейтингу, бо їхній попередній рівень навичок уже не відповідав реаліям.",
  "new_frontiers_matchmaking_details_new_title": "Новий покращений алгоритм",
  "new_frontiers_matchmaking_details_new_desc": "Для виправлення старих проблем ми перейшли на новий алгоритм Glicko, який дозволяє вам швидко й точно потрапляти в матч із гравцями схожого рівня навичок. У математичному розрізі Glicko дозволяє нам краще враховувати в обчисленнях відповідність гравця рейтингу, що дозволить приймати точніші рішення щодо набуття та втрати очок рейтингу.\\n\\nПерехід на нову систему пошуку матчів відчуватиметься немов початок нового сезону пошуку матчів:\\n[list][*]Усі гравці потраплять у короткотривалий режим калібрування, де будуть посіяні відповідно до свого попереднього рейтингу.\\n[*]Калібрування більше не складатиметься з фіксованої кількості матчів. Натомість гравець вважатиметься відкаліброваним, якщо його відповідність рейтингу буде вищою за певний поріг.\\n[*]Після калібрування може трапитися, що ви отримаєте іншу медаль, ніж мали до цього. Однак навіть якщо ваша медаль відчутно зміниться, ви отримаєте можливість грати з гравцями свого рівня.\\n[*]Матчі більше не даватимуть фіксованої кількості очок рейтингу за виграш чи програш. Ця кількість варіюватиметься з урахуванням багатьох факторів, включно з рейтингом і відповідністю рейтингу учасників. Утім ми обмежили максимальні числа за матч, щоб уникнути особливо негативних наслідків.\\n[*]Відповідність рейтингу гравця поступово зменшуватиметься, якщо він не гратиме.[/list]\\nПротягом певного часу ми паралельно використовували обидві системи, що дозволило нам переконатися в надійності цих змін. Ми розуміємо, що точний рейтинг — лише один із багатьох факторів, що впливають на якість матчів, тому, як і у випадках інших змін у цій сфері, ми зацікавлені у ваших відгуках.",
  "new_frontiers_matchmaking_immortals_title": "Пошук матчів для безсмертних",
  "new_frontiers_matchmaking_immortals_desc": "На безсмертному ранзі значно більшу роль за рейтинг відіграє знання інших гравців та взаємодія з ними, а також вибір балансу ролей. Тому ми переробили пошук матчів на безсмертному рівні з урахуванням цього.<br><br>Матчі безсмертного рангу більше не розподілятимуть гравців за командами випадковим чином. Натомість два капітани відбиратимуть з-поміж інших восьми гравців членів своєї команди. Це може дати значно кращий результат, ніж просто автоматично розподілити гравців згідно рейтингу. Тож тепер, безсмертні, можете скаржитися лише на себе, якщо ваш матч буде невдалим.",
  "new_frontiers_ui_desc": "Запаморочення та больові спазми в руках? Можете ігнорувати, це просто тіло намагається сказати вам, що ви зголодніли. Спустило шину? Їдьте на обідку — він теж круглий. Суть проста: багато що в житті можна безпечно проігнорувати без наслідків.<br><br>Однак не покажчики здоров’я в Dota. Це дійсно важливо. Саме тому в цьому оновленні ми покращили багато елементів інтерфейсу, пов’язаних зі здоров’ям.",
  "new_frontiers_ui_shields_title": "Бар’єри на смузі здоров’я",
  "new_frontiers_ui_shields_desc": "Чи знали ви, що в Dota присутні захисні щити? Магічні щити, фізичні щити, темні щити… Усі види щитів! Ви могли це пропустити. Чи проігнорувати. А все через те, що не було способу дізнатися, з яким рівнем щита ви починали та скільки його залишалося.<br><br>Та сьогодні завершується темна доба невідання. Тепер ви зможете бачити все. Тобто принаймні всі два елементи. А також тип щита. Щоби відзначити, якими чудовими стали старі щити завдяки новому візуальному покращенню, ми додали нові здібності з ними.<br><br>Ми також перейменували їх зі щитів на бар’єри, аби ви не думали, що на вашій смузі здоров’я видно предмет із крамниці. Можете не дякувати.",
  "new_frontiers_ui_health_pips_title": "Підказки на смузі здоров’я",
  "new_frontiers_ui_health_pips_desc": "Деякі істоти не мають традиційного рівня здоров’я й вимагають певної кількості ударів для знищення. Тепер замість звичного гадання чи обчислення геніальних математичних операцій ви можете просто глянути на істоту, яку хочете вбити. Над нею ви побачите маленькі сегменти, які позначають кількість ударів для того, щоби земні марноти відшуміли (як написано на смузі здоров’я Гамлета).",
  "new_frontiers_ui_health_cost_title": "Витрата здоров’я",
  "new_frontiers_ui_health_cost_desc": "Хоча для більшості здібностей у Dota потрібна мана, є й кілька таких, які використовують здоров’я. Тепер ці здібності показують, скільки здоров’я потрібно для їхнього застосування. Непогано, так? Дивно, чому ніхто раніше не додумався це додати. Втім, це вже тут.",
  "new_frontiers_gameplay_update_desc": "Це дійсно велетенський список. Єдине, що може зробити його кращим, — [i]ще один[/i] такий велетенський список, але де нам його знайти… [i]Ого, а гляньте ось на це![/i] Читайте далі про всі зміни балансу, які з’явилися з цим оновленням. Або ж одразу заходьте в гру й починайте грати. Повірте, ми й без вас знаємо, як це весело читати технічні посібники для відеоігор, ну а грати в них — на почесному другому місці. Цей список й далі буде тут, коли ви повернетеся.",
  "new_frontiers_misc_title": "Різне",
  "new_frontiers_misc_role_tokens": "Ми зменшили кількість жетонів рольової черги, які видаються за програш в матчі за будь-якою роллю. Тепер за поразку ви отримуватимете два жетони, а за перемогу — чотири, як і раніше. Ця зміна має пом’якшити поведінку гравців у рейтингових іграх за роллю, коли намагання заробити жетони превалює над ефективною грою на призначеній ролі.",
  "new_frontiers_misc_removed_roles": "Ми вилучили режим Captain's Mode та прибрали режими All Random та All Random Deathmatch із нерейтингових ігор. Мало хто грає в ці режими й час очікування часто перевищує годину.",
  "new_frontiers_misc_model_editor": "Це оновлення вилучає старий редактор моделей. Усі VMDL-файли тепер вивантажуватимуться до нового інструменту, а старі моделі конвертуватимуться, коли ви вперше відкриєте їх у новому інструменті. Пізніше ми випустимо оновлення, де повністю вилучимо підтримку завантаження старого скомпільованого формату, тож ми заохочуємо всіх авторів майстерні завантажити й переконвертувати свої моделі в новий формат і якомога швидше заново їх скомпілювати.",
  "new_frontiers_misc_hold_animation": "Ми вилучили підтримку старого ключа «HoldAnimation» з динамічних властивостей. Для ігор у нестандартному режимі слід або вручну змінити ключ на новий «циклічний режим», або перекомпілювати відповідні мапи для автоматичного оновлення властивостей.",
  "neutral_item_tier": "Нейтральний предмет [b]%1$s-го ступеня[/b]",
  "dota_ability_variable_health": "до здоров’я",
  "dota_ability_variable_mana": "до мани",
  "dota_ability_variable_armor": "до броні",
  "dota_ability_variable_damage": "до шкоди",
  "dota_ability_variable_str": "до сили",
  "dota_ability_variable_int": "до інтелекту",
  "dota_ability_variable_agi": "до спритності",
  "dota_ability_variable_all": "до всіх характеристик",
  "dota_ability_variable_primary_attribute": "до основної характеристики",
  "dota_ability_variable_attack": "до швидкості атаки",
  "dota_ability_variable_hp_regen": "до регенерації здоров’я",
  "dota_ability_variable_lifesteal": "до вампіризму",
  "dota_ability_variable_mana_regen": "до регенерації мани",
  "dota_ability_variable_mana_regen_aura": "до аури регенерації мани",
  "dota_ability_variable_spell_amp": "до шкоди від чарів",
  "dota_ability_variable_debuff_amp": "до дії негативного ефекту",
  "dota_ability_variable_move_speed": "до швидкості руху",
  "dota_ability_variable_evasion": "до ухилення",
  "dota_ability_variable_spell_resist": "до опору магії",
  "dota_ability_variable_spell_lifesteal": "до вампіризму від чарів",
  "dota_ability_variable_spell_lifesteal_creep": "до вампіризму від чарів (кріпи)",
  "dota_ability_variable_spell_lifesteal_hero": "до вампіризму від чарів (герої)",
  "dota_ability_variable_selected_attrib": "до вибраної характеристики",
  "dota_ability_variable_attack_range": "до дальності атаки <font color='#7d7d7d'>(дальній бій)</font>",
  "dota_ability_variable_attack_range_melee": "до дальності атаки <font color='#7d7d7d'>(ближній бій)</font>",
  "dota_ability_variable_cast_range": "до дальності чаклування",
  "dota_ability_variable_status_resist": "до опору ефектам",
  "dota_ability_variable_projectile_speed": "до швидкості снарядів",
  "dota_ability_variable_manacost_reduction": "до зменшення витрати мани",
  "dota_ability_variable_cooldown_reduction": "до зменшення зарядки",
  "dota_ability_variable_max_mana_percentage": "до макс. додаткової мани"
}