// 1727.js

{
  "language": "finnish",
  "new_frontiers_gameplay_number": "Pelipäivitys 7.33",
  "new_frontiers_title": "Uusi rajamaa -päivitys",
  "new_frontiers_title_short": "Uusi rajamaa",
  "new_frontiers_subtitle": "Uusi pelikenttä, merkittäviä pelimuutoksia ja paljon muuta. Täysin uusi maailma tutkittavaksi.",
  "new_frontiers_play_trailer": "Katso traileri",
  "new_frontiers_dota_team_intro": "Uusi rajamaa -päivityksen myötä julkaistaan uusi pelikenttä, merkittäviä muutoksia peliin, pelihakuun ja käyttöliittymään ja paljon muuta.<br><br>Kuinka paljon? Niin paljon, että kaikkia muutoksia on vaikea muistaa. Meihin iski paniikki muutamaksi päiväksi, kunnes jollakin välähti: nehän voisi kirjoittaa muistiin. Niin tehtiin. Nyt voimme vilkaista muutoksia milloin vain. Ja niin voit sinäkin! Vieritä sivua ja lue lisää.",
  "new_frontiers_eldor_name": "Eldor-velho",
  "new_frontiers_dota_team_name": "Dota-tiimi",
  "new_frontiers_section_title_map": "Uusi pelikenttä",
  "new_frontiers_section_title_major_gameplay": "Merkittäviä pelimuutoksia",
  "new_frontiers_section_title_matchmaking": "Pelihaku",
  "new_frontiers_section_title_ui": "Käyttöliittymä",
  "new_frontiers_section_title_gameplay_update": "Kaikki muutokset",
  "new_frontiers_map_introduction": "Dotan pelikenttä on kokenut suunnattoman laajennuksen. Pelin päätavoite pysyy samana: linjat ovat samalla etäisyydellä toisistaan kuin ennenkin ja pelin voittoon tarvittavat elementit ovat edelleen keskellä karttaa.<br><br>Mutta 40 % suurempi maasto helpottaa strategian hiomista ja resurssien kasaamista. Päämetsät on päivitetty täysin, ja muun muassa näkymät, salareitit ja kätyrileirit on pantu uuteen uskoon.",
  "new_frontiers_map_subtitle": "Tutki uutta maailmaa",
  "new_frontiers_map_roshan_title": "Roshanin uudet tukikohdat",
  "new_frontiers_map_roshan_desc": "Roshan myi vanhan jokiluolansa ja hyödynsi kuumana käyvää kiinteistökauppaa. Sillä on nyt [i]kaksi[/i] upeata luolaa kartan luoteis- ja kaakkoisnurkissa. Luolista on näkymä lähteille ja salakaupat ovat kivenheiton päässä.<br><br>Myös kuntosalin on oltava lähellä, koska Roshanista on tullut aikamoinen lihaskimppu. Roshan ei enää pudota Aghanim's Shardeja. Se pudottaa nyt Cheesen kuoltuaan toisen kerran aiemman kolmannen kerran sijaan. Kolmas kuolema pudottaa Refresher Shardin tai Scepterin riippuen siitä, kummassa luolassa Roshan on.",
  "new_frontiers_map_twin_gates_title": "Kaksoisportit",
  "new_frontiers_map_twin_gates_desc": "Kaksi porttia yhdistää pelikentän kulmat sisälinjan tornien läheisyydessä, joten pelaajat voivat nyt siirtyä välittömästi kentän laidasta toiseen.<br><br>Tämä on merkittävä pelimuutos, joka vaikuttaa myös aika vakavasti taustatarinaan. Olet aivan oikeassa: Dota 2 on nyt epävirallisesti osa PMJU:ta (Pac-Manin jatkettua universumia).",
  "new_frontiers_map_lotus_pools_title": "Lootuslähteet",
  "new_frontiers_map_lotus_pools_desc": "Uudet Lootuslähteet löytyvät pelikentän molemmilta puolilta läheltä kohtaa, jossa kätyriaallot kohtaavat ensimmäisen kerran. Lähteistä nousee ajoittain hedelmiä, joiden syöminen antaa manaa ja terveyttä.<br><br>Pelaajat voivat varastoida hedelmiä ja yhdistää ne suuremmaksi ja herkullisemmaksi hedelmäksi pelin edetessä. Tämän superhedelmän yhdistämistä voi jatkaa [i]uskomattomaan[/i] jättihedelmään. Mitäköhän tapahtuisi, jos yhdistäisit näitä [i]uskomattomia[/i] jättihedelmiä keskenään? Tuskin mitään. (Ihan varmasti jotain.)",
  "new_frontiers_map_tormentors_title": "Piinaajat",
  "new_frontiers_map_tormentors_desc": "Nämä kaksi riuskaa neutraalikätyriä syntyvät tukikohtien viereen 20 minuutin jälkeen ja ovat täpötäynnä Aghanim's Shardeja. Mutta piinaajiin liittyy yksi juju, ja se juju on, että jujuja on kaksi. 1) Piinaajilla on megasuojat, jotka heijastavat takaisin lähes kaiken vahingon, jonka nakkaat niitä kohti. 2) Niistä tulee sitä vahvempia, mitä useammin tapat ne. Sen vuoksi niiden tuhoaminen vaatii todennäköisesti koko tiimin apua.<br><br>Onni onnettomuudessa on se, että ne jättävät rauhaan, jos niitä ei häiritse.",
  "new_frontiers_map_watchers_title": "Tarkkailijat",
  "new_frontiers_map_watchers_desc": "Tarkkailijat ovat kuin terminaattoreita sillä erolla, että niiden tehtävä on tarkkailla. Ne ovat armottomia ja pelottomia. Ne eivät tunne kipua. Ne ovat myös laiskoja, eivätkä aloita tarkkailemista ennen kuin klikkaat niitä.<br><br>Jokainen Tarkkailija on pelin alussa poissa käytöstä, mutta aktivoimisen jälkeen se antaa aktivoineelle joukkueelle näkökentän Tarkkailijan ympärille seitsemäksi minuutiksi — tai kunnes viholliset sabotoivat sen, jolloin Tarkkailijasta tulee tilapäisesti käyttökelvoton. Jos tiimi tappaa Roshanin, kaikki Tarkkailijat siirtyvät tiimin riveihin.",
  "new_frontiers_map_barriers_title": "Puolustajan portit",
  "new_frontiers_map_barriers_desc": "Puolustajan portissa yhdistyvät Dotan fantasiamaailma ja tavallisten ovien käytännöllisyys. Voit lukita sen ja mennä ruokaostoksille tuhoamaan Muinaislinnoituksen. Se on tukikohtasi takaovi, jonka kätevä voimakenttä päästää tiimisi sisään, mutta pitää viholliset ulkona. Vihollisen pommittaessa etuovea voit livahtaa ulos ja takaisin sisään takaoven kautta.",
  "new_frontiers_map_wisdom_runes_title": "Viisausriimut",
  "new_frontiers_map_wisdom_runes_desc": "Kolua pelikentän nurkat ja löydä Viisausriimut, jotka antavat kokemusta sille, joka on tarpeeksi viisas koskettaakseen niitä. Viisausriimut syntyvät tukikohtasi viereen ja tarjoavat helposti puolustettavan tavan estää tappiollista peliä karkaamasta käsistä.",
  "new_frontiers_map_shield_runes_title": "Suojariimut",
  "new_frontiers_map_shield_runes_desc": "Joen voimariimut saavat lisäyksen uudesta tehokkaasta Suojariimusta, joka antaa 50 % enimmäisterveydestäsi lisäsuojaa. Syöksy tornin kimppuun ja hae tappoja alkupelissä tai kipua pimeää ylämäkeä ja yllätä niin itsesi kuin vihollisetkin.",
  "new_frontiers_map_named_regions_title": "Nimetyt alueet",
  "new_frontiers_map_named_regions_desc": "Uudelta kartalta löytyy nyt uusia alueita, kuten Kaivospesä, Vesikaivo, Luutarha ja Patsasaukio. Tiimikavereille on entistä helpompi kertoa tarkalleen, missä joku yrittää tappaa sinut. Kaikki hahmot saavat alueella käyntinsä ajaksi alueteemaisen vahvistuksen.",
  "new_frontiers_map_creep_camps_title": "12 uutta kätyrileiriä",
  "new_frontiers_map_creep_camps_desc": "Osa kätyreistä kyllästyi metsässä teurastetuksi tulemiseen, joten ne muodostivat 12 uutta leiriä kartan laajennetuille ulkoreunoille. Nyt voit teurastaa niitä sielläkin.",
  "new_frontiers_map_outpost_title": "Uudet vartiopisteet",
  "new_frontiers_map_outpost_desc": "Uudella, laajennetulla pelikentällä on kaksi uutta vartiopistettä. Alkuperäiset vartiopisteet siirrettiin uusiin paikkoihin, mikä panee miettimään, olivatko ne edes samat vartiopisteet. Hyvä yritys, Plutarkhos, mutta ovat ne.",
  "new_frontiers_major_gameplay_features_desc": "Uusi rajamaa -päivitys tuo merkittäviä muutoksia sankareihin ja järjestelmiin. Itse asiassa, lakiosastomme neuvoikin meitä kertomaan, että pelitoimintojen osio on [i]niin tupaten täynnä[/i] peliä muuttavia ominaisuuksia, että kannattaa lukea se hitaasti seuraavien viikkojen aikana, jottei pää mene niin pyörälle, että pitää lähteä lääkäriin.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Sankarimuutokset",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Kaikkia sankareita on tasapainotettu, toisia enemmän ja toisia vähemmän. Tässä muutamia heistä.",
  "new_frontiers_major_gameplay_new_items_title": "Uudet esineet",
  "new_frontiers_major_gameplay_new_items_desc": "Nyt on esinettä joka lähtöön.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Uudet neutraaliesineet",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Seitsemän upouuden neutraaliesineen lisäksi tarjolla on nyt myös muutama paluun tehnyt vanha suosikki.",
  "new_frontiers_major_gameplay_bkb_title": "Uudistettu Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Black King Barin aktivointi puhdistaa nyt heikosti sekä antaa 50 % loitsunvastustusta ja heikennysimmuniteetin. Sen aikana heikennykset eivät vaikuta sinuun, ja saat immuniteetin puhdasta ja heijastettua vahinkoa vastaan.<br><br>Ole silti varovainen: jos Black King Bar päättyy ennen heikennyksen päättymistä, heikennys vaikuttaa välittömästi jäljellä olevan keston ajan. Vaikutukset, jotka lävistivät loitsuimmuniteetin, lävistävät nyt myös heikennysimmuniteetin.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Uusi sankaripiirretyyppi",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Void Spiritin, neljännen henkiveljen, ei olisi pitänyt olla voima-, ketteryys- tai älykkyyssankari. Jatkaakseen sarjaa sen olisi pitänyt olla täysin uudenlainen sankari. <br><br>Saammeko esitellä yleissankarin. Kyseessä on uusi sankaripiirre, joka koostuu olemassa olevista sankareista, jotka nyt saavat 0,6 vahinkoa kaikista piirteistä. Insinöörimme vakuuttavat, että tämä luku on täydellisesti tasapainotettu. Paitsi jos se ei ole. Onneksi se selviää pelaamalla suurta seikkailua nimeltä Uusi rajamaa -päivitys.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Neutraaliesineiden vaihtokauppa",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Metsän eläinten listiminen tiesi ennen uutta hienoa neutraaliesinettä... joka päätyi usein kärkipelaajalle, joka et yleensä ollut sinä itse. Nyt neutraalikätyrin tappo tietää polettia, jolla saa valita [i]viidestä[/i] saatavilla olevasta neutraaliesineestä. Jokaiseen polettiin liittyy viisi vaihtoehtoa, joten viiimeisellekin poletin saajalle on tarjolla valinnan varaa.<br><br>Tiimit voivat antaa poletteja kenelle tahansa, mutta kun esine on valittu, sitä ei voi jakaa, joten polettien suhteen kannattaa olla tarkka.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Neutraalikätyrien voimistuminen",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Neutraalikätyrit ja niiden kyvyt voimistuvat nyt ajan myötä. Kyllä, leirejä on vaikeampi tuhota pelin edetessä, mutta kätyreitä ohjaamaan pystyvillä sankareilla on nyt kunnon taustajoukot.",
  "new_frontiers_major_gameplay_kill_formula_title": "Päivitetty tappokaava",
  "new_frontiers_major_gameplay_kill_formula_desc": "Tappokaavaa päivitettiin, jotta alkupelin tapoista tulisi vaikuttavampia ja pelaajat vaihtaisivat linjoja väijytysten toivossa. Linjakätyreiden kullan skaalausta vähennettiin, jotta kätyrien tappaminen olisi pelin edetessä vähemmän tuottavaa ja pelaajat yrittäisivät sen sijaan kerätä kultaa nuijimalla toisiaan.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Lyhyempi lamaannustila",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Sankarin pelaaminen on paljon hauskempaa, kun sillä voi oikeasti pelata. Nyt sekä pelaamisen kannattajien ja pelaamattomuuden kritisoijien unelmat toteutuvat: sankareilla voi nyt pelata entistä enemmän.<br><br>Miten teimme sen? Helposti. Lyhensimme lähes kaikkien lamautusten kestoa. Miten keksimme niinkin älyttömän suunnitelman? Helposti. Beastmasterin korviahuumaava karjahdus iski päin naamaa, ja yhtäkkiä oli aikaa pohdiskella asioita.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Kuljettuaan riivaamassa linjoilla kaksi kuukautta Muerta on viimein löytänyt Aghanim’s Scepterin ja Shardin. Jos et tunne Muertaa vielä, lue lisää [url=https://www.dota2.com/deadreckoning]Dead Reckoning -päivityksestä[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magilla on niin vähän älliä, ettei se ansaitse älykkyyttä. Nyt sitä on tasan nolla.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa on nyt aluksi pikkulapsen tavoin hutera ja kokematon, mutta voimistuu ajan myötä.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Clinkz on kova tyyppi, koska sen kyvyt luovat nyt luurankoja.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden loi aiemmin täydellisen kopion itsestään, mutta nyt kopio on [i]parempi![/i] Tai huonompi! Joka tapauksessa erilainen ja mitä todennäköisimmin vähemmän hiuksia halkova.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Alchemist ja kaikki sillä pelaavat ovat luontaisesti ahneita.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ARC WARDENIN VÄLIAIKAINEN MUUTOS",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Nyt rajoitetun ajan: kun valitset Diren puolella Arc Wardenin, pelaatkin Tempest Doublena, ja sen Ultimate-kyky kutsuukin esiin oikean Arc Wardenin.",
  "new_frontiers_matchmaking_desc": "Ollaan rehellisiä. Maailmassa on kahdeksan miljardia ihmistä, joista 99,99 % ei osaa pelata Dotaa. Se tietää sitä, että pelihaussa on omat haasteensa. Varsinkin, jos sattuu olemaan Dotassa verraton ja haluaa pelikaveriksi melkein, muttei aivan yhtä hyviä pelaajia. Pelihaun parantamiseen kaikilla taitotasoilla kautta linjan on käytetty matematiikkaa ja lukemattomia työtunteja.",
  "new_frontiers_matchmaking_intro_title": "Tarkempi pelihaku",
  "new_frontiers_matchmaking_intro_desc": "Pelihaun ranking-pisteet (MMR) koostuvat kahdesta asiasta: rankingista ja ranking-varmuudesta. Ranking on arvio taidoistasi ja ranking-varmuus sitä, että me luotamme arvioon. Jokaisen ottelusi jälkeen säädämme tasoasi sen mukaan, voitatko vai häviätkö. Ranking-varmuus taas kasvaa, koska dataa kerääntyy enemmän.",
  "new_frontiers_matchmaking_details_old_title": "Ryhmäjako pahimmasta päästä",
  "new_frontiers_matchmaking_details_old_desc": "Dota on perinteisesti hyödyntänyt Elo-algoritmin muokattua versiota rankingin ja ranking-varmuuden muutosten teossa. Ajan myötä olemme huomanneet, että siinä on omat ongelmansa. Esimerkiksi pelihaun ranking-pisteiden keskitaso on pikkuhiljaa laskenut, mikä on johtanut ikävään pelaajakeskittymään 0–1 000 ranking-pisteen kohdalla. Toinen ongelma oli se, että jos pelaaja piti taukoa, paluu paikkansapitäviin ranking-pisteisiin oli vaikeaa, koska entistä taitotasoa ei enää laskettu.",
  "new_frontiers_matchmaking_details_new_title": "Uusi ja parempi ryhmäjako",
  "new_frontiers_matchmaking_details_new_desc": "Ongelmien ratkaisemiseksi siirrymme käyttämään uutta algoritmiä nimeltä Glicko, jonka pitäisi yhdistää pelaajat nopeasti ja luotettavasti muiden samantasoisten kanssa. Glickon ansiosta meidän on myös helpompi ottaa laskuihin pelaajan ranking-varmuus, mikä tietää tarkempia päätöksiä rankingin voittojen ja tappioiden suhteen.\\n\\nUuteen pelihakuun siirtyminen tuntuu vähän samalta kuin uuden pelihakukauden avaus. \\n[list][*]Kaikki pelaajat palautetaan lyhyeen uudelleenkalibrointitilaan, joka perustuu edelliseen rankingiin. \\n[*]Kalibrointi ei perustu enää tiettyyn määrään otteluita. Pelaaja katsotaan kalibroiduksi, kun ranking-varmuus ylittää tietyn rajan.\\n[*]Kalibroinnin jälkeen saat todennäköisesti aiemmasta mitalista poikkevan mitalin, mutta vaikka muutos olisi suurikin, sinut yhdistetään samanlaisen taitotason pelaajiin. \\n[*]Otteluiden voitoista/tappioista ei enää saa aina saman verran MMR-pisteitä. Jatkossa pisteet lasketaan muuttujasta, joka perustuu useampaan tekijään, kuten pelaajien rankingiin ja ranking-varmuuteen. Kullekin ottelulle määritellään voitto- ja tappiokatto ikävien tulosten välttämiseksi.\\n[*]Pelaajan ranking-varmuus laskee ajan myötä, jos pelaaja ei pelaa pitkään aikaan.[/list]Pelihakujärjestelmät ovat olleet yhtä aikaa käytössä kulisseissa varmistamassa, että voimme tehdä muutokset luottavaisin mielin. Tiedämme, että tarkka MMR on vain yksi otteluiden laatuun vaikuttava tekijä. Otamme mieluusti palautetta siitä ja muista muutoksista.",
  "new_frontiers_matchmaking_immortals_title": "Kuolemattomien pelihaku",
  "new_frontiers_matchmaking_immortals_desc": "Kuolemattoman taitotason kohdalla tarkkaa ranking-pistemäärää tärkeämpää alkaa olemaan se, miten tuntee muut pelaajat ja miten kenenkin kanssa peli sujuu. Sen vuoksi Kuolemattoman taitotason pelihaku uudistettiin.<br><br>Kuolemattoman taitotason peleissä pelaajia ei enää automaattisesti jaeta joukkueisiin, vaan kapteenit valitsevat joukkueisiinsa kahdeksan jäsentä. Joukkueista tulee satunnaisvalintaa tehokkaampia. Jos pelit menevät mönkään, voitte syyttää vain itseänne, Kuolemattomat.",
  "new_frontiers_ui_desc": "Huippaako? Älä siitä välitä, juo vettä. Puhkesiko rengas? Kyllä vanteillakin pystyy ajamaan. Yritämme sanoa, että melkein kaiken elämässä voi jättää huomioimatta.<br><br>Paitsi Dotan terveyspalkit. Ne ovat todella tärkeitä. Siksi päivityksessä kiinnitettiin erityistä huomiota käyttöliittymän terveysongelmiin.",
  "new_frontiers_ui_shields_title": "Suojapalkit",
  "new_frontiers_ui_shields_desc": "Tiesitkö, että Dotassa on suojia? Loitsusuojia, fyysisiä suojia, kykyjen nimissä olevia suojia... kaiken maailman suojia! Et ehkä ole huomannut niitä tai olet vain muuten vaan ollut välittämättä niistä, koska et vain ole yksinkertaisesti nähnyt, paljonko ne suojaavat tai paljonko niitä on jäljellä.<br><br>Epävarmuuden aikakausi on ohi: nyt voit nähdä kaiken. Tai ainakin nuo kaksi aikaisemmin mainittua asiaa. Nyt jopa näet, minkä tyyppinen suoja on kyseessä. Juhlistaaksemme tätä historiallista hetkeä ja nauttiaksemme näistä näkyvistä suojista lisäsimme uusia suojia antavia kykyjä.",
  "new_frontiers_ui_health_pips_title": "Osumapistepalkit",
  "new_frontiers_ui_health_pips_desc": "Joillain hahmoilla ei ole tavanmukaista terveyttä, vaan ne vaativat tietyn verran osumia tuhoutuakseen. Nyt lukemia ei tarvitse arvailla tai laskea päässä, vaan ne näkyvät suoraan murhattavan kohteen yläpuolella. Terveyspalkki näkyy nyt yksinkertaisina pykälinä, jotka kertovat, montako osumaa se voi ottaa ennen kuin poiss' on maalliset nuo ahdistukset (lainaus Hamletin terveyspalkista).",
  "new_frontiers_ui_health_cost_title": "Terveystarve",
  "new_frontiers_ui_health_cost_desc": "Vaikka suurin osa kyvyistä käyttääkin manaa, jotkut niistä vaativat terveyttä sen sijaan. Nyt näiden kykyjen terveystarve näkyy käyttöliittymässä. Eikö olekin hyvä idea? Jotenkin yllättävää, että sen keksimiseen meni näin kauan. Mutta se on nyt hoidettu.",
  "new_frontiers_gameplay_update_desc": "Siinäpä pitkä lista. Ainoa asia, joka voisi tehdä siitä paremman, olisi [i]toinen[/i] pitkä lista. Mutta mistä me nyt sellaisen tähän hätään löytäisimme? [i]Kappas vaan![/i] Lue alta kaikki päivityksen kyky- ja esinemuutokset. Tai hyppää suoraan peliin ja ylläty. Meille ei tarvitse kertoa, miten hauskaa pelien ohjevihkojen plärääminen on, mutta kyllä pelaaminenkin on aika pirun hauskaa. Tämä lista ei katoa mihinkään. Voit aina palata lukemaan sitä.",
  "new_frontiers_misc_title": "Sekalaiset",
  "new_frontiers_misc_role_tokens": "Vähensimme roolijonojen polettien määrää, jonka saa, kun häviää kaikki valitut roolit -pelin. Nyt saat kaksi polettia jokaisesta häviöstä. Voittamisesta saa edelleen täydet neljä polettia. Tämän muutoksen tavoitteena on tasoittaa pelaajakäyttäytymistä ranked-rooleissa, joissa kullan kerääminen voi joskus mennä pelaamisen edelle.",
  "new_frontiers_misc_removed_roles": "Poistimme kapteenitilan ranked-otteluista ja satunnaisvalinnan ja satunnaisen surmamatsin tavallisista peleistä. Harva enää pelaa näitä pelitiloja, ja jonotusajat venyivät helposti yli tuntiin.",
  "new_frontiers_misc_model_editor": "Tämä päivitys poistaa perinteisen mallieditorin. Kaikki vmdl-tiedostot ladataan nyt uuteen työkaluun, ja vanhat mallit muunnetaan, kun lataat ne työkaluun ensimmäistä kertaa. Julkaisemme toisen päivityksen, jossa poistetaan tuki vanhan kootun formaatin lataukselta kokonaan. Kannattaa siis ladata ja muuntaa tekemäsi mallit uuteen formaattiin ja koota ne uudelleen niin pian kuin mahdollista.",
  "new_frontiers_misc_hold_animation": "Olemme poistaneet tuen dynaamisten varusteiden vanhalta HoldAnimation-avaimelta. Modien tulisi joko manuaalisesti vaihtaa uuteen loop mode -avaimeen tai koota pelikentät uudelleen niin, että ne automaattisesti päivittyvät uusiin ominaisuuksiin.",
  "neutral_item_tier": "[b]%1$s. tason[/b] neutraaliesine",
  "dota_ability_variable_health": "terveyttä",
  "dota_ability_variable_mana": "manaa",
  "dota_ability_variable_armor": "panssaria",
  "dota_ability_variable_damage": "vahinkoa",
  "dota_ability_variable_str": "voimaa",
  "dota_ability_variable_int": "älykkyyttä",
  "dota_ability_variable_agi": "ketteryyttä",
  "dota_ability_variable_all": "kaikkia piirteitä",
  "dota_ability_variable_primary_attribute": "pääpiirrettä",
  "dota_ability_variable_attack": "hyökkäysnopeutta",
  "dota_ability_variable_hp_regen": "terveydenpalautumista",
  "dota_ability_variable_lifesteal": "vampirismia",
  "dota_ability_variable_mana_regen": "mananpalautumista",
  "dota_ability_variable_mana_regen_aura": "mananpalautumisaura",
  "dota_ability_variable_spell_amp": "kykyvahinkoa",
  "dota_ability_variable_debuff_amp": "heikennysvahvistusta",
  "dota_ability_variable_move_speed": "liikenopeutta",
  "dota_ability_variable_evasion": "väistökykyä",
  "dota_ability_variable_spell_resist": "loitsunvastustusta",
  "dota_ability_variable_spell_lifesteal": "loitsuvampirismia",
  "dota_ability_variable_spell_lifesteal_creep": "loitsuvampirismia (kätyreistä)",
  "dota_ability_variable_spell_lifesteal_hero": "loitsuvampirismia (sankareista)",
  "dota_ability_variable_selected_attrib": "valittua piirrettä",
  "dota_ability_variable_attack_range": "hyökkäysetäisyyttä <font color='#7d7d7d'>(kaukotaistelijoille)</font>",
  "dota_ability_variable_attack_range_melee": "hyökkäysetäisyyttä <font color='#7d7d7d'>(lähitaistelijoille)</font>",
  "dota_ability_variable_cast_range": "käyttöetäisyyttä",
  "dota_ability_variable_status_resist": "heikennysvastustusta",
  "dota_ability_variable_projectile_speed": "ammusnopeutta",
  "dota_ability_variable_manacost_reduction": "manantarpeen vähennystä",
  "dota_ability_variable_cooldown_reduction": "latausaikojen lyhennystä",
  "dota_ability_variable_max_mana_percentage": "enimmäismanaa",
  "dota_ability_variable_aoe_bonus": "vaikutusaluelisää"
}