// 4722.js

{
  "language": "bulgarian",
  "new_frontiers_gameplay_number": "Игрално обновление 7.33",
  "new_frontiers_title": "Обновлението „Нови предели“",
  "new_frontiers_title_short": "Нови предели",
  "new_frontiers_subtitle": "Нова карта, значителни промени на игралното преживяване и още много други. Очаква Ви един цял нов свят, който да проучвате.",
  "new_frontiers_play_trailer": "Гледайте трейлъра",
  "new_frontiers_dota_team_intro": "Обновлението „Нови предели“ поднася нова карта, големи промени в игралното преживяване, промени за търсенето на мачове, промени на потребителския интерфейс и не на шега — още много повече.<br><br>Още колко повече? Толкова много, че в действителност ни стана трудно да помним всичко и в продължение на няколко дни бяхме започнали да изпадаме в паника… Докато някой се сети, че бихме могли просто да си записваме. Така и направихме. Вече можем да четем списъка с промените по всяко време, когато искаме. Вие също можете да го сторите! Започнете да скролирате, за да прочетете по-нататък.",
  "new_frontiers_eldor_name": "Елдор магьосникът",
  "new_frontiers_dota_team_name": "Екипът на Dota 2",
  "new_frontiers_section_title_map": "Нова карта",
  "new_frontiers_section_title_major_gameplay": "Значителни промени на игралното преживяване",
  "new_frontiers_section_title_matchmaking": "Търсене на мачове",
  "new_frontiers_section_title_ui": "Потребителски интерфейс",
  "new_frontiers_section_title_gameplay_update": "Промени в баланса",
  "new_frontiers_map_introduction": "Картата на Dota 2 беше масивно разширена. Основната цел на играта си остава същата. Алеите Ви не са по-далеч една от друга и всичко, от което се нуждаете, за да спечелите, все още е в центъра на картата.<br><br>Но с 40% повече терен, има предостатъчно място за извличане на нови ресурси и откриване на свежи стратегии. И двете основни джунгли също са напълно преконфигурирани, разтърсвайки разположението на видимостта, маршрутите за подвеждащи маневри, ферменето и още други.",
  "new_frontiers_map_subtitle": "Проучете новия свят",
  "new_frontiers_map_roshan_title": "Новите домове на Roshan",
  "new_frontiers_map_roshan_desc": "Roshan продаде старата си речна яма и се възползва от всички тези благоприятни нови възможности за недвижими имоти. Вече има [i]две[/i] фантастични нови ями, разположени в северозападните и югоизточните краища на картата. Това е рай за любителите на ямите, славещ се с невероятна гледка към фонтаните, а само няколко минути път го делят и от тайните магазини.<br><br>Тези ями трябва също да са в близост до фитнес зала, защото сега Roshan носи още повече на бой. Също така от Roshan вече не се падат Aghanim's Shards. Roshan вече пуска сирене при втората си смърт вместо при третата. Щом умре за трети път се пада Refresher Shard или Aghanim's Scepter, в зависимост от това дали е в северната или южната яма.",
  "new_frontiers_map_twin_gates_title": "Двойни порти",
  "new_frontiers_map_twin_gates_desc": "Две порти вече свързват краищата на картата близо до кулите от безопасните алеи. Това позволява на играчите да се телепортират мигновено от единия край на картата до другия.<br><br>Това е промяна на игралното преживяване, но има очевидни последици и за сюжета. Предположихте правилно — Dota 2 вече съществува неофициално в разширената вселена на Pac Man.",
  "new_frontiers_map_lotus_pools_title": "Лотосови вирове",
  "new_frontiers_map_lotus_pools_desc": "Играчите вече могат да намерят лотосови вирове от лявата и дясната страна на картата (близо до мястото, където вълните от крийпове се срещат за пръв път). Там периодично се появяват плодове, които при изяждане предоставят мана и здраве.<br><br>Играчите могат да трупат запаси от този плод, а след това да го комбинират. Впоследствие ще получат още по-голям плод с по-висока стойност в късната игра. Той може дори да се комбинира в [i]невероятно[/i] голям плод. А какво става, ако комбинирате [i]невероятно[/i] големия плод? Вероятно нищо. (Определено става нещо.)",
  "new_frontiers_map_tormentors_title": "Мъчители",
  "new_frontiers_map_tormentors_desc": "Тези две мощни неутрални структури се появяват близо до всяка база след 20 минути. И в двете се таят Aghanim’s Shards. Но има уловка, а уловката е, че има две уловки: 1) Мъчителите са оборудвани с мега щитове, които отразяват повечето щети, които им се нанасят. 2) Силата им нараства всеки път, когато ги разгромите. Така че вероятно ще Ви е нужен целият отбор, за да повалите някой от тях.<br><br>Добрата новина е, че подобно на мечките, които игнорират Вас, за да разкъсат турист, ако ги оставите необезпокоявани, те ще Ви оставят намира.",
  "new_frontiers_map_watchers_title": "Наблюдатели",
  "new_frontiers_map_watchers_desc": "Наблюдателите са като терминатори, но за наблюдаване. Те са непреклонни. Те не знаят какво е болка. Те не знаят какво е страх. Обаче са мързеливи. Те няма да започнат да наблюдават, докато не кликнете върху тях.<br><br>Наблюдателите започват играта неактивни и неутрални, но след като бъдат активирани, предоставят визия над своята площ за седем минути или докато враговете Ви не ги саботират, преустановявайки я временно. Когато даден отбор убие Roshan, всички наблюдатели ще се обърнат на негова страна.",
  "new_frontiers_map_barriers_title": "Отбранителни порти",
  "new_frontiers_map_barriers_desc": "Отбранителната порта съчетава искрящата епична фантазия на Dota 2 с практичността на вратите във Вашата къща, които можете да заключите, щом отидете до бакалницата, за да унищожите нейния Ancient. Това е заден вход към базата Ви с полезно силово поле, което пропуска Вашия отбор и не допуща вражеския. Докато врагът напада отпред, Вие можете да се промъквате, влизайки и излизайки, през задния вход.",
  "new_frontiers_map_wisdom_runes_title": "Руни на мъдростта",
  "new_frontiers_map_wisdom_runes_desc": "Проучвайте краищата на картата, за да разкриете руни на мъдростта, предоставящи подсилване на опита за всеки герой, който е достатъчно мъдър да си открадне една от тях. Руните на мъдростта се появяват близо до Вашата база, предлагайки лесен начин за защита, чрез който да предотвратите губеща игра да излезе извън контрол.",
  "new_frontiers_map_shield_runes_title": "Руни за щит",
  "new_frontiers_map_shield_runes_desc": "Речните подсилващи руни също получават допълнение с мощната нова руна за щит, която дава 50% от максимално Ви здраве като бариера. Впуснете се към кула, за да се докопате до убийство в ранната игра. Или се изкачете по някой хълм на сляпо, за да изненадате както себе си, така и вражеския отбор.",
  "new_frontiers_map_named_regions_title": "Наименувани региони",
  "new_frontiers_map_named_regions_desc": "Разширената карта вече включва отличителни региони като „Мините“, „Кладенецът“, „Гробището“ и „Статуята“, улеснявайки още повече осведомяването на Вашите съотборници относно това къде точно някой Ви убива. Всички единици в тези региони придобиват регионални модификатори на своите статистики.",
  "new_frontiers_map_creep_camps_title": "12 нови лагера на крийпове",
  "new_frontiers_map_creep_camps_desc": "На някои от крийповете им писна през цялото време да бъдат жестоко избивани в джунглата и установиха 12 нови лагера, разпръснати из цялата разширена карта. Така че вече можете да ги избивате и там.",
  "new_frontiers_map_outpost_title": "Нови аванпостове",
  "new_frontiers_map_outpost_desc": "Новата разширена карта включва два нови аванпоста. Оригиналните аванпостове са преместени на нови местонахождения. А това повдига очевидния въпрос дали те наистина са оригиналните аванпостове. Добър опит, Сократ! Оригиналните са.",
  "new_frontiers_major_gameplay_features_desc": "Обновлението „Нови предели“ представя значителни промени за Вашите любими герои и системи. Всъщност нашият правен отдел ни посъветва да Ви кажем следното — тази секция за игралното преживяване е [i]толкова плътно е натъпкана[/i] с нови характеристики, определящи метата, че би трябвало да я четете бавно през следващите няколко седмици, с цел да избегнете предизвикването на прекомерна превъзбуда и викането на спасителен екип.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Отличени герои",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Макар че всички герои бяха балансирани… Някои бяха балансирани повече от други. Ще огласим неколцина от тях тук.",
  "new_frontiers_major_gameplay_new_items_title": "Нови предмети",
  "new_frontiers_major_gameplay_new_items_desc": "За всичките Ви покупателни нужди.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Нови неутрални предмети",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Забъркваме седем съвсем нови неутрални артикула към смесицата и връщаме някои стари любими.",
  "new_frontiers_major_gameplay_bkb_title": "Black King Bar е преработен",
  "new_frontiers_major_gameplay_bkb_desc": "Активирането на Black King Bar вече прилага базово разсейване и предоставя 50% магическа устойчивост и имунитет срещу дебъфове. Докато BKB е активен, отрицателните ефекти от дебъфовете не Ви влияят. Плюс това ще имате имунитет срещу същински и отразени щети.<br><br>Но бъдете внимателни! Ако продължителността на Black King Bar изтече преди времетраенето на някой от дебъфовете, ефектите им ще бъдат приложени за оставащото време. Проникващите през имунитет срещу магии ефекти, вече също проникват през имунитета срещу дебъфове.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Нов тип атрибут за герои",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Като четвъртия духовен брат, който пуснахме, Void Spirit не трябваше да бъде силов, ловък или интелигентен герой. С цел да се откроява, той наистина трябваше да бъде нов вид герой. [i]Четвърти[/i] вид герой.<br><br>Представяме универсалните герои. Нова основна група статистики, съставена от съществуващи герои, които вече придобиват 0,6 щети от всяка статистика на всеки атрибут. Нашите инженери ни уверяват, че тази стойност е перфектно балансирана. Освен ако не е. Но добрата новина е, че всички ще разберем заедно в грандиозното приключение, което е обновлението „Нови предели“.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Падането на неутрални предмети е преработено",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Изтрепването на горски създания някога означаваше получаване на готин нов неутрален предмет… Той обичайно отиваше при Carry играча, който обикновено не сте били Вие. Сега убиването на неутрален крийп произволно пуска жетон, който Ви позволява да избирате от [i]пет[/i] налични неутрални предмета. Всеки жетон предлага пълен набор от пет опции, така че дори последният играч, който употреби своя, има реален избор.<br><br>Отборите могат да дават използването на жетони на всеки, но щом изберете предмет, той не може да бъде споделян, така че разпределяйте жетоните си разумно.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Пропорционално подсилване на неутралните крийпове",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Неутралните крийпове и техните умения вече пропорционално нарастват с течение на времето. Да, лагерите ще стават все по-трудни за затриване, докато играта напредва, но героите с умението да контролират крийпове ще имат сериозни подкрепления.",
  "new_frontiers_major_gameplay_kill_formula_title": "Формулата за убийства е преработена",
  "new_frontiers_major_gameplay_kill_formula_desc": "Преработихме формулата за убийствата. Така правим убийствата в ранната игра по-въздействащи и мотивираме играчите да причакват за нападение над други алеи. Също така намалихме пропорционалното връчване на злато за убийства на крийпове в алеите. Така правим фарменето на крийпове по-малко доходоносно с напредването на играта и вместо това насърчаваме играчите да трепят други герои, за да се докопат до приходи.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Отшеметяваща нова характеристика",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Това да играете своя герой винаги е по-забавно, отколкото да седите, без да играете с него. Е, почитатели на играенето с разни неща и критици на бездействието, мечтите Ви се сбъднаха. Пригответе се да играете своя герой повече от всякога досега.<br><br>Как? Лесно. Намалихме времетраенето на почти всяко преустановяване в играта. Как ни хрумна този безумен план? Дори още по-лесно. Понесохме последствията след попадение от Primal Roar на Beastmaster в лицето и изведнъж имахме много време за размисъл.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "След два месеца витаене из алеите, Muerta най-сетне намери своя Aghanim's Scepter и Shard. Ако все още не сте я проверили, научете още от страницата за [url=https://www.dota2.com/deadreckoning]обновлението „Мъртвешка разплата“[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi е прекалено тъп, за да бъде интелигентен герой. Ето защо вече не е такъв.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa вече започва слаба като бебе. Но, подобно на бебе, може да стане по-силна с течение на времето.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Повечето от уменията на Clinkz, като най-добрите умения в живота, вече създават скелети.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden създаваше перфектен свой клонинг. Но вече прави [i]по-добра[/i] своя версия! Или по-лоша! Така или иначе е различен. Както и непротиворечив, поне така предполагаме.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Героят Alchemist, както всички негови играчи, вече е алчен по рождение.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ОГРАНИЧЕН ВРЕМЕВИ БОНУС ЗА ARC WARDEN",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Само за ограничен времеви период, когато изберете да играете с Arc Warden за Dire, Tempest Double ще бъде основният герой, а изпълняването на неговия ултимат ще призовава „нормално“ му аз.",
  "new_frontiers_matchmaking_desc": "Нека бъдем честни. На планетата има осем милиарда души и 99,99% от тях са ужасни в Dota 2. Това означава, че търсенето на мачове може да бъде предизвикателство, особено ако сте добри в Dota 2 и обичате да играете с хора, които са почти, но да се надяваме, не толкова добри в Dota 2, колкото Вас. Свършихме купища работа и бая математика, за да подобрим качеството при търсене на мачове по всички параграфи за играчите от всяко ниво на умение.",
  "new_frontiers_matchmaking_intro_title": "Достоверно търсене на мачове",
  "new_frontiers_matchmaking_intro_desc": "Рейтингът за търсене на мачове (РТМ) всъщност се състои само от две числа: ранг и рангова довереност. Вашият ранг е приблизителна оценка на уменията Ви. А Вашата рангова довереност е нашата увереност в тази приблизителна оценка. Когато изиграете мач, коригираме ранга Ви спрямо това дали печелите или губите. Вашата рангова довереност също се повишава, защото вече разполагаме с повече данни.",
  "new_frontiers_matchmaking_details_old_title": "Нежеланото скупчване е най-лошият вид скупчване",
  "new_frontiers_matchmaking_details_old_desc": "Dota 2 традиционно използваше модифицирана версия на ЕЛО алгоритъма за въвеждането на промени в ранга и ранговата довереност. Но с течение на времето забелязахме няколко проблема с подхода ни. Ето например, разпределението на рейтинга за търсене на мачове (РТМ) постепенно се беше изместило по-ниско, причинявайки нежелано скупчване в диапазона 0 — 1 000 MMR. Друг проблем беше, че играчите, които си вземаха почивка, изпитваха трудност да достигнат точен рейтинг за търсене на мачове при завръщането си, защото предходното им ниво на умение вече не беше показателно.",
  "new_frontiers_matchmaking_details_new_title": "Ново и подобрено скупчване",
  "new_frontiers_matchmaking_details_new_desc": "С цел да адресираме това, преминаваме към различен алгоритъм, наречен „Глико“. Той би трябвало да Ви позволи да бъдете бързо и точно съпоставяни срещу други играчи със сходно ниво на умение. От математическата страна на нещата, Глико“ ни позволява по-добре да вземаме предвид довереността на ранга на играча в изчисленията ни. В резултат от това решенията относно придобиването и загубата на ранга са по-точни.\\n\\nПреминаването към новата ни система за търсене на мачове до известна степен ще Ви се стори като началото на нов сезон за търсенето на мачове:\\n[list]\\n[*]Всички играчи ще бъдат поставени обратно в кратък режим за калибриране, където първоначално ще бъдат отсети по предходния им ранг;\\n[*]Калибрирането вече не е фиксиран брой мачове. Вместо това даден играч се счита за калибриран, когато достоверността на ранга му е над определен праг;\\n[*]Щом калибрирането приключи, има вероятност да се окажете с различен медал от предходния. Въпреки това, дори ако медалът Ви се промени значително, трябва да очаквате да бъдете съпоставяни срещу други играчи със сходно ниво на умение;\\n[*]Мачовете вече няма да имат фиксирано придобиване или загуба на рейтинг (РТМ). Това вече ще бъде променлива, базирана на редица фактори, включващи ранговете и ранговата довереност на участниците. Въпреки това, ще ограничим придобиването или загубата за мач, така че да предотвратим особено отрицателни резултати;\\n[*]Ранговата довереност на даден играч бавно ще намалява с течение на времето, ако потребителят не пуска мачове.\\n[/list]\\nОт известно време пускаме едновременно и двете системи за търсене на мачове зад кулисите, с цел това да ни помогне да изградим увереност в тези промени. Разбираме, че точният рейтинг (РТМ) е само един от многото фактори, които оказват влияние върху качеството на търсене на мачове, и както всички промени в това пространство, сме заинтересовани да чуем Вашите отзиви.",
  "new_frontiers_matchmaking_immortals_title": "Безсмъртно търсене на мачове",
  "new_frontiers_matchmaking_immortals_desc": "При ранг „Безсмъртен“ познаването на другите играчи, общуването с тях и изборът на добър баланс за ролите е по-важен фактор от просто рейтинга за търсене на мачове. Ето защо преработихме търсенето на мачове при ниво „Безсмъртен“, за да отчетем това.<br><br>Мачовете сред ранг „Безсмъртен“ вече няма да използват предварително създадени отбори. Вместо това, двама капитани ще могат да подбират останалите осем играчи във всеки отбор. Това ще направи отбора Ви по-въздействащ, отколкото ако просто разчитате на рейтинга за търсене на мачове (РТМ) за възлагането на съставите. Така че, ако сега мачът Ви е гаден, няма кого другиго да обвинявате, освен самите Вас в ранг „Безсмъртен“.",
  "new_frontiers_ui_desc": "Замъглено зрение и пронизващи болки по ръката? Съветът ни е да ги игнорирате, това е просто начинът, по който тялото Ви казва, че е гладно. Спукали сте гума? Карайте на джанта — нали пак е кръгла. Мисълта ни е, че почти всичко в живота може спокойно да бъде игнорирано без последствия.<br><br>Освен лентите за здравето в Dota 2. Това нещо е важно. Ето защо куп информация за потребителския интерфейс относно здравето, получава масивно подобрение в това обновление.",
  "new_frontiers_ui_shields_title": "Бариери на лентата за здравето",
  "new_frontiers_ui_shields_desc": "Знаете ли, че Dota 2 има щитове? Магически щитове, физически щитове, Aphotic Shields. Всякакви сортове щитове! Може би сте ги пропуснали. Или в повечето случаи сте ги игнорирали. Защото нямаше начин да разберете с колко щит сте започнали или колко Ви е останал.<br><br>Но тази мрачна епоха на несигурност приключва днес. Вече можете да видите всичко. Или поне тези две неща. Дори можете да видите какъв тип е щитът. С цел да отпразнуваме колко по-добри са всички тези стари щитове с това визуално подобрение, добавихме куп нови умения, които ги включват.<br><br>Също така преименувахме щитовете на бариери, така че да не се объркате, мислейки си, че имате Vanguard в лентата за здравето. Пак заповядайте.",
  "new_frontiers_ui_health_pips_title": "Сегменти на лентата със здравето",
  "new_frontiers_ui_health_pips_desc": "Някои единици не разполагат с традиционно налично здраве. Вместо това се изискват определен брой атаки, за да ги унищожите. Сега, вместо обичайните догадки или някакво гениално преброяване наум, можете просто да погледнете към единицата, която искате да убиете. Тя ще показва полезни малки сегменти, които представляват броя удари, които може да поеме, преди да се свлече в предсмъртна агония (цитат от лентата за здравето на Хамлет).",
  "new_frontiers_ui_health_cost_title": "Нужно здраве",
  "new_frontiers_ui_health_cost_desc": "Макар че повечето способности в Dota 2 консумират мана, вместо това някои имат изискване за здраве. Сега тези способности действително изобразяват нужното здраве за тяхното изпълняване. Не е зле, а? Всъщност е някак шантаво, че никой не се е сетил да постави това там по-рано. Както и да е, вече е там.",
  "new_frontiers_gameplay_update_desc": "Това е огромен списък с какви ли не неща. Единственото нещо, което би могло да го подобри, са [i]два[/i] огромни списъка с какви ли не неща, но къде ще намерим… [i]Хей, я виж ти![/i] Прочетете по-нататък за всички останали промени в баланса, които това обновление е подготвило. Или просто направо се впуснете в играта. Уверяваме Ви, че няма нужда да ни казвате колко е забавно да четете технически ръководства относно видеоигри, но човече, това да ги играете е на почетно второ място. Този списък все още ще бъде тук, когато се върнете.",
  "new_frontiers_misc_title": "Разнообразни",
  "new_frontiers_misc_role_tokens": "Намалихме броя на предоставяните жетони за опашката с роли, когато загубите мач с „избрани всички роли“. Вече ще печелите два жетона за загуба. Побеждаването все още предоставя пълния брой от четири жетона. Тази промяна би трябвало да спомогне за уравновесяване на поведението на играчите при ролите с класиране, където фарменето на жетони понякога превъзхождаше ефективното изиграване на дадена възложена роля;",
  "new_frontiers_misc_removed_roles": "Премахнахме Captains Mode от търсенето на мачове с класиране и отрязахме All Random и All Random Deathmatch от тези без класиране. Почти никой не играе тези режими и времето в опашката лесно надвишаваше един час;",
  "new_frontiers_misc_model_editor": "Това обновление премахва класическия редактор за модели. Всички vmdl файлове вече ще се зареждат в новия инструмент, а старите модели ще бъдат конвертирани, когато ги заредите за пръв път в него. Ще пуснем последващо обновление, така че напълно да премахнем поддръжката за зареждане на стария компилиран формат. Затова насърчаваме всички автори в работилницата да заредят, конвертират и прекомпилират своите модели в новия формат възможно най-скоро;",
  "new_frontiers_misc_hold_animation": "Премахнахме поддръжката за класическия ключ „HoldAnimation“ от динамичните реквизити. Персонализираните игри трябва ръчно да превключат към новия ключ „Режим за повтаряне\" или да прекомпилират своите карти, с цел автоматично да подобрят тези свойства.",
  "neutral_item_tier": "[b]Поредица %1$s[/b] неутрален предмет",
  "dota_ability_variable_health": "здраве",
  "dota_ability_variable_mana": "мана",
  "dota_ability_variable_armor": "броня",
  "dota_ability_variable_damage": "щети",
  "dota_ability_variable_str": "сила",
  "dota_ability_variable_int": "интелект",
  "dota_ability_variable_agi": "ловкост",
  "dota_ability_variable_all": "на всички атрибути",
  "dota_ability_variable_primary_attribute": "основен атрибут",
  "dota_ability_variable_attack": "скорост на атака",
  "dota_ability_variable_hp_regen": "регенерация на здраве",
  "dota_ability_variable_lifesteal": "кражба на здраве",
  "dota_ability_variable_mana_regen": "регенерация на мана",
  "dota_ability_variable_mana_regen_aura": "аура за регенерация на мана",
  "dota_ability_variable_spell_amp": "щети от заклинания",
  "dota_ability_variable_debuff_amp": "времетраене на дебъфа",
  "dota_ability_variable_move_speed": "скорост на движение",
  "dota_ability_variable_evasion": "избягване",
  "dota_ability_variable_spell_resist": "магическа устойчивост",
  "dota_ability_variable_spell_lifesteal": "кражба на здраве от заклинания",
  "dota_ability_variable_spell_lifesteal_creep": "кражба на здраве от заклинания (крийпове)",
  "dota_ability_variable_spell_lifesteal_hero": "кражба на здраве от заклинания (герои)",
  "dota_ability_variable_selected_attrib": "избран атрибут",
  "dota_ability_variable_attack_range": "обсег на атака <font color='#7d7d7d'>(само за далекобойни)</font>",
  "dota_ability_variable_attack_range_melee": "обсег на атака <font color='#7d7d7d'>(само за ръкопашни)</font>",
  "dota_ability_variable_cast_range": "обсег за изпълняване",
  "dota_ability_variable_status_resist": "статус на устойчивост",
  "dota_ability_variable_projectile_speed": "скорост на снарядите",
  "dota_ability_variable_manacost_reduction": "намаляване на нужната мана",
  "dota_ability_variable_cooldown_reduction": "намаляване на изчакването",
  "dota_ability_variable_max_mana_percentage": "бонус макс. мана",
  "dota_ability_variable_aoe_bonus": "бонус площ на ефекта"
}