// 5371.js

{
  "language": "latam",
  "new_frontiers_gameplay_number": "Actualización 7.33",
  "new_frontiers_title": "Actualización \"Nuevas Fronteras\"",
  "new_frontiers_title_short": "Nuevas Fronteras",
  "new_frontiers_subtitle": "Un nuevo mapa, cambios importantes en la jugabilidad y mucho más. Todo un nuevo mundo para explorar.",
  "new_frontiers_play_trailer": "Ver avance",
  "new_frontiers_dota_team_intro": "La actualización \"Nuevas Fronteras\" llega con un nuevo mapa, cambios importantes en la jugabilidad, en los emparejamientos y en la interfaz, y (no estamos bromeando) mucho, mucho más.<br><br>Pero, ¿cuánto más? Hay tanto que se nos hizo difícil recordarlo todo, luego empezamos a entrar en pánico hasta que alguien mencionó que simplemente podemos anotarlo todo. Y así fue. ¡Ahora tú también puedes leer los cambios! Desplázate por la pantalla para seguir leyendo.",
  "new_frontiers_eldor_name": "Eldor el Mago",
  "new_frontiers_dota_team_name": "El equipo de Dota",
  "new_frontiers_section_title_map": "Nuevo mapa",
  "new_frontiers_section_title_major_gameplay": "Cambios importantes en la jugabilidad",
  "new_frontiers_section_title_matchmaking": "Emparejamientos",
  "new_frontiers_section_title_ui": "Interfaz de usuario",
  "new_frontiers_section_title_gameplay_update": "Cambios de balance",
  "new_frontiers_map_introduction": "El mapa de Dota ha sido expandido inmensamente. El objetivo principal del juego es el mismo; las sendas no están más lejos las unas de las otras y todo lo que necesitas ganar sigue en el centro del mapa.<br><br>Sin embargo, con un 40 % más de terreno, hay espacio de sobra para recoger nuevos recursos y descubrir nuevas estrategias. Las dos junglas principales se han reconfigurado completamente, cambiando de forma radical la disposición de la visión, los puntos de evasión, el farmeo y mucho más.",
  "new_frontiers_map_subtitle": "Explora el nuevo mundo",
  "new_frontiers_map_roshan_title": "Las nuevas guaridas de Roshan",
  "new_frontiers_map_roshan_desc": "Roshan vendió su viejo foso en el río y se está aprovechando del nuevo panorama inmobiliario. Ahora tiene [i]dos[/i] nuevos fantásticos fosos situados en las esquinas noroeste y sudeste del mapa. Son un paraíso para los amantes de los fosos que presume de vistas clandestinas a las fuentes y están tan solo a unos minutos de las Tiendas Secretas.<br><br>Estos fosos deben estar también cerca de un gimnasio, porque Roshan se ha puesto aún más fornido que antes. Además, Roshan ya no suelta Fragmentos de Aghanim y ahora suelta Queso tras su segunda muerte en lugar de la tercera. Su tercera muerte otorga una Esquirla Revigorizante o un cetro, dependiendo de si murió en el foso del norte o el del sur.",
  "new_frontiers_map_twin_gates_title": "Portales Gemelos",
  "new_frontiers_map_twin_gates_desc": "Ahora dos portales conectan las esquinas del mapa cerca de las torres en las sendas seguras, permitiendo a los jugadores teletransportarse instantáneamente de un borde del mapa al otro.<br><br>Este es un cambio de jugabilidad, lo que conlleva cambios en la historia. Así es, Dota 2 ahora forma parte de manera no oficial del PMEU (Universo Extendido de Pac Man).",
  "new_frontiers_map_lotus_pools_title": "Fuentes de Loto",
  "new_frontiers_map_lotus_pools_desc": "Los jugadores ahora pueden encontrar Fuentes de Loto en las partes derecha e izquierda del mapa (cerca de donde se reúnen las primeras oleadas de creeps). Estas fuentes otorgan frutos periódicamente que dan maná y vida cuando se comen.<br><br>Los jugadores pueden acumular los frutos y combinarlos en frutos más grandes y de mayor valor en las últimas fases de la partida. Esos frutos más grandes pueden incluso combinarse para producir un fruto [i]increíblemente[/i] grande. ¿Y qué ocurre cuando combinas el fruto [i]increíblemente[/i] grande? Probablemente nada, seguramente algo.",
  "new_frontiers_map_tormentors_title": "Torturadores",
  "new_frontiers_map_tormentors_desc": "Estos dos poderosos creeps neutrales aparecen cerca de cada base tras 20 minutos, y ambos tienen la barriga repleta de Fragmentos de Aghanim. Pero hay un problema, y el problema es que hay dos problemas: 1) Los Torturadores están equipados con unos megaescudos que reflejan la mayor parte del daño que se les inflige. 2) Se hacen más fuertes cada vez que los matas. Así que probablemente sea necesario un equipo entero para matar a uno solo.<br><br>La buena noticia es que igual que los osos, te dejarán tranquilo si tú los dejas tranquilos.",
  "new_frontiers_map_watchers_title": "Vigilantes",
  "new_frontiers_map_watchers_desc": "Los Vigilantes son como los Terminators, pero para la vigilancia. Son implacables. No conocen el dolor. No conocen el miedo. Pero son flojos. No empezarán a vigilar hasta que hagas clic en ellos. <br><br>Los vigilantes comienzan la partida inactivos y neutrales, pero una vez que se activan, otorgan visión en la zona del Vigilante durante diez minutos, o hasta que tus enemigos los saboteen para desactivarlos temporalmente. Cuando un equipo mata a Roshan, todos los Vigilantes se pasarán a ese equipo.",
  "new_frontiers_map_barriers_title": "Puertas del Defensor",
  "new_frontiers_map_barriers_desc": "La Puerta del Defensor combina la fantasía centelleante de Dota con la practicidad de las puertas de tu casa, las cuales puedes cerrar con llave cuando vas al supermercado para destruir a su Ancestral. Es una puerta trasera a tu base con un útil campo de fuerza que deja pasar a tu equipo, pero deja fuera al equipo enemigo. Cuando el enemigo está atacando el frente, puedes escabullirte por detrás.",
  "new_frontiers_map_wisdom_runes_title": "Runas de la Sabiduría",
  "new_frontiers_map_wisdom_runes_desc": "Explora los bordes del mapa para desenterrar las Runas de la Sabiduría, las cuales conceden una bonificación de EXP a cualquier héroe lo suficientemente sabio para robar una. Las Runas de la Sabiduría aparecen cerca de tu base, proporcionando una manera de evitar perder el control total de una partida que se está perdiendo.",
  "new_frontiers_map_shield_runes_title": "Runas Escudo",
  "new_frontiers_map_shield_runes_desc": "Entre las Runas de Poder del Río ahora también podrás encontrar la nueva y poderosa Runa Escudo, la cual proporciona un escudo con el 50 % de tu vida máxima. Lánzate al ataque de una torre enemiga para conseguir una víctima al principio de la partida, o sube una colina sin visión para sorprenderte a ti mismo y al equipo enemigo.",
  "new_frontiers_map_named_regions_title": "Regiones con nombres específicos",
  "new_frontiers_map_named_regions_desc": "El mapa expandido ahora cuenta con regiones distintivas como \"Las Minas\", \"El Pozo\", \"El Cementerio\" y \"La Estatua\", que permiten alertar más fácilmente a tus compañeros del lugar en el que te están matando. Los atributos de todas las unidades que se encuentren en estas regiones obtendrán modificaciones temáticas específicas de la región.",
  "new_frontiers_map_creep_camps_title": "12 nuevos campamentos de creeps",
  "new_frontiers_map_creep_camps_desc": "Algunos de los creeps se cansaron de que los maten una y otra vez en la jungla y ahora se han realojado en 12 nuevos campamentos esparcidos por todo el mapa extendido. Así que puedes matarlos ahí también.",
  "new_frontiers_map_outpost_title": "Nuevos puestos avanzados",
  "new_frontiers_map_outpost_desc": "El nuevo mapa expandido incluye dos nuevos puestos avanzados. Los puestos avanzados originales pasaron a nuevas ubicaciones, lo que plantea la duda de si realmente son los puestos avanzados originales. ¿A quién tratas de impresionar?: Lo son.",
  "new_frontiers_major_gameplay_features_desc": "La actualización \"Nuevas Fronteras\" presenta cambios importantes en tus héroes y sistemas favoritos. Tantos, que nuestro departamento legal nos aconsejó que te dijéramos que esta sección de jugabilidad está [i]tan densamente repleta[/i] de novedades metadefinitorias que deberías leerlas con tranquilidad, durante las próximas semanas, para que no termines sobreestimulado y tengas que llamar a emergencia. ",
  "new_frontiers_major_gameplay_hero_reworks_title": "Cambios importantes en los héroes",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Aunque se han hecho cambios de balance en todos los héroes, algunos han cambiado más que otros. Aquí resaltamos algunos de ellos.",
  "new_frontiers_major_gameplay_new_items_title": "Objetos nuevos",
  "new_frontiers_major_gameplay_new_items_desc": "Para todas tus necesidades de compra.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Nuevos objetos neutrales",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Agregamos siete objetos neutrales totalmente nuevos al repertorio, y vamos a traer de vuelta algunos objetos antiguos favoritos.",
  "new_frontiers_major_gameplay_bkb_title": "Cambios en la Vara del Rey Negro",
  "new_frontiers_major_gameplay_bkb_desc": "Ahora, al activar la Vara del Rey Negro se aplica una disipación básica, y otorga 50 % de resistencia mágica e inmunidad de efecto negativo. Cuando está activa, sus efectos negativos no te afectan. Además, tendrás inmunidad al Daño Puro y Reflejado.<br><br>Pero ten cuidado: si los efectos de la vara del Rey Negro expiran antes que la duración de algunos de los efectos negativos, estos se aplicarán durante el tiempo restante que quede. Los efectos que atraviesan la inmunidad mágica ahora también atraviesan la inmunidad a los efectos negativos.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Nuevo tipo de atributo para héroes",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Como el cuarto hermano de espíritu que hemos lanzado, Void Spirit no debería ser un héroe de Fuerza, Agilidad o Inteligencia. Para diferenciarse, debería haber sido realmente un nuevo tipo de héroe. Un [i]cuarto[/i] tipo de héroe.<br><br>Presentamos a los héroes universales: un nuevo grupo principal de estadísticas compuesto de héroes existentes que ahora obtienen 0.6 de daño de cada estadística, de cualquier atributo. Nuestros ingenieros nos aseguran que esta cifra está perfectamente balanceada. Salvo que no lo esté. Pero la buena noticia es que lo descubriremos juntos en la gran aventura de la actualización \"Nuevas Fronteras\".",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Una nueva manera de obtener objetos neutrales",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Eliminar a las criaturas del bosque solía significar que recibías un nuevo objeto neutral... que normalmente iba para el asesino, que por lo general no eras tú. Ahora, al eliminar a un creep neutral se obtiene aleatoriamente una ficha, que te permite elegir de entre [i]cinco[/i] objetos neutrales disponibles. Cada ficha ofrece una variedad de cinco opciones, de manera que hasta el último jugador en canjear su ficha tiene una elección real.<br><br>Los equipos pueden distribuir las fichas para que las use cualquiera —pero una vez que se elige un objeto ya no se puede compartir, así que divide tus fichas sabiamente.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Aumento gradual de creeps neutrales",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Ahora los creeps neutrales y sus habilidades pueden ser aumentados gradualmente conforme pasa el tiempo. Así es, ahora los campamentos serán más difíciles de matar conforme va avanzando la partida, pero los héroes con la habilidad de controlar creeps ahora tendrán refuerzos significativos.",
  "new_frontiers_major_gameplay_kill_formula_title": "Nueva fórmula de recompensa por víctima",
  "new_frontiers_major_gameplay_kill_formula_desc": "Hemos rediseñado la fórmula de recompensa por víctima para que las víctimas del inicio del juego tengan una mayor repercusión y motiven a los jugadores a emboscar otras sendas. También hemos reducido el aumento de oro para los creeps en las sendas, haciendo que el farmeo de creeps sea menos rentable a medida que avanza la partida, y en lugar de ello, alentar a los jugadores a ganarse el oro en combate.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Aturdimientos más cortos",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Jugar con tu héroe es siempre más divertido que quedarte sentado sin jugar a tu héroe. Bueno, fans de jugar cosas y críticos de no jugarlas, sus sueños se han hecho realidad: prepárense para jugar sus héroes mucho más que nunca.<br><br>¿Cómo? Muy fácil. Redujimos la duración de casi todas las desactivaciones en el juego. ¿Cómo se nos ocurrió este plan tan extravagante? Mucho más fácil. Bastó un rugido de Beastmaster en el rostro para que repentinamente tuviéramos el tiempo suficiente para pensarlo.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Después de dos meses de atormentar las sendas, finalmente Muerta ha encontrado su Cetro y Fragmento de Aghanim. Si aún no le has echado un vistazo, busca más información sobre ella en la [url=https://www.dota2.com/deadreckoning]actualización del Juicio Mortal[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi es demasiado tonto para poder ser un héroe de inteligencia. Así que ya no lo es.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa comienza ahora débil como un bebé, pero al igual que un bebé, con el tiempo puede fortalecerse.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Ahora, la mayoría de las habilidades de Clinkz, al igual que las mejores habilidades de la vida, crean esqueletos.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden solía crear un clon perfecto de sí mismo. ¡Pero ahora crea una [i]mejor[/i] versión! ¡O peor! Como sea, una versión diferente. Y nada polémico (al menos eso creemos).",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "El héroe Alchemist, como todos los que usan a Alchemist, ahora es avaro por naturaleza.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "BONIFICACIÓN DE EFECTO LIMITADO PARA ARC WARDEN",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Solo por tiempo limitado, cuando eliges Arc Warden para el equipo Dire, el Duplicado de la Tempestad será el héroe principal, y usar su habilidad definitiva invocará su versión \"normal\".",
  "new_frontiers_matchmaking_desc": "Seamos honestos: hay ocho mil millones de personas en el planeta, y el 99.99 % de la población no es buena en Dota. Esto hace que los emparejamientos sean un desafío, especialmente si eres bueno en Dota y te gusta jugar con gente que es casi tan buena como tú (pero no tanto). Hemos trabajado mucho y hecho muchos números para mejorar la calidad de nuestros emparejamientos en general para los jugadores de cualquier nivel.",
  "new_frontiers_matchmaking_intro_title": "Emparejamientos confiables",
  "new_frontiers_matchmaking_intro_desc": "La clasificación de emparejamiento (MMR) depende de dos números: el rango y la confianza en el rango. Tu rango es un cálculo aproximado de tu habilidad, y la confianza en tu rango es la certeza que tenemos acerca de ese rango. Cuando juegas una partida, tu rango se ajusta en función de si pierdes o ganas, pero la confianza en tu rango siempre sube porque tenemos más datos.",
  "new_frontiers_matchmaking_details_old_title": "Agrupaciones poco deseables: el peor tipo de agrupación",
  "new_frontiers_matchmaking_details_old_desc": "Dota siempre ha utilizado una versión modificada del algoritmo Elo para implementar cambios en los rangos y en la confianza en los rangos. Pero, con el paso del tiempo, hemos observado algunos problemas en este método. Por ejemplo, la distribución de las clasificaciones de emparejamiento ha ido bajando paulatinamente, dando lugar a agrupaciones poco deseables en los rangos de 0 a 1000 de MMR. Por otro lado, los jugadores que dejaban de jugar durante una temporada no conseguían una clasificación precisa cuando volvían porque su nivel anterior de habilidad dejaba de ser representativo.",
  "new_frontiers_matchmaking_details_new_title": "Novedades y mejoras en las agrupaciones",
  "new_frontiers_matchmaking_details_new_desc": "Para solucionar esto, vamos a utilizar un algoritmo diferente denominado Glicko, con el que deberías encontrar partidas con jugadores de tu nivel rápidamente. En lo matemático, Glicko nos permite calcular mejor el nivel de confianza en el rango del jugador, lo cual genera decisiones más precisas sobre las ganancias y pérdidas de rango.\\n\\nEl paso al nuevo sistema de emparejamiento se parecerá un poco al inicio de una nueva temporada de emparejamientos: [list][*]Todos los jugadores se situarán de nuevo en un breve modo de calibración, basado inicialmente en sus rangos anteriores.\\n[*]La calibración ya no consiste en un número fijo de partidas, sino que los jugadores se consideran calibrados cuando la confianza en su rango supera un determinado umbral.\\n[*]Tras la calibración, es posible que termines con una medalla diferente a la que tenías antes. Sin embargo, aunque tu medalla cambie de forma considerable, se te emparejará con jugadores de un nivel de habilidad similar al tuyo.\\n[*]Las partidas ya no tienen una proporción fija de pérdidas y ganancias de MMR, sino que la proporción será variable y se basará en una serie de factores, como los rangos y la confianza en los rangos de los participantes. De todas formas, habrá un límite por partida para evitar resultados especialmente negativos.\\n[*]La confianza en el rango de los jugadores disminuye con el tiempo si no juegan partidas.[/list]Hemos probado los dos sistemas de emparejamiento a la vez durante cierto tiempo para estar seguros de estos cambios. Sabemos que una clasificación de emparejamiento precisa es solo uno de los muchos factores que afectan a la calidad de las partidas y, como con todos los cambios en este ámbito, nos interesa mucho saber su opinión.",
  "new_frontiers_matchmaking_immortals_title": "Emparejamiento en el rango Inmortal",
  "new_frontiers_matchmaking_immortals_desc": "Con el rango Inmortal, conocer a los otros jugadores, compenetrarse con ellos y encontrar un buen balance entre los roles es más importante que la clasificación de emparejamiento (MMR). Por eso, hemos rediseñado el emparejamiento para el nivel Inmortal.<br><br>Las partidas de este rango ya no utilizarán equipos predefinidos, sino que dos capitanes seleccionarán a los otros ocho jugadores de cada equipo, lo cual permite crear equipos con más efectividad que las alineaciones generadas en relación con la MMR. Así que, si tu partida es un desastre, ya no puedes echarle la culpa a nadie. Asume tu responsabilidad, Inmortal.",
  "new_frontiers_ui_desc": "Si ves borroso y te dan calambres en el brazo, te recomendamos que lo ignores. Es simplemente tu cuerpo diciéndote que tiene hambre. ¿Tienes un neumático desinflado? No te detengas —lo importante es que siga rodando. Lo que queremos decir es que prácticamente todo en esta vida se puede ignorar sin mayor consecuencia.<br><br>Excepto las barras de vida de Dota. Esas sí que son importantes y por eso, en esta actualización, hemos realizado mejoras significativas de muchas partes de la IU relacionadas con la vida.",
  "new_frontiers_ui_shields_title": "Barreras de la barra de vida",
  "new_frontiers_ui_shields_desc": "¿Sabías que en Dota hay escudos? Escudos mágicos, físicos, afóticos... ¡Todo tipo de escudos! Igual no los viste o simplemente los ignoraste, porque no había forma de saber cuánto escudo tenías al principio o cuánto te quedaba.<br><br>Pero esa era oscura de incertidumbre termina aquí. Ya puedes verlo todo. O al menos esas dos cosas. Incluso puedes ver qué tipo de escudo es. Para celebrar cuánto han mejorado todos esos escudos antiguos con esta nueva visibilidad, hemos añadido unas cuantas habilidades nuevas en las que se utilizan.<br><br>También les hemos cambiado el nombre de Escudos a Barreras, para que no creas que tienes una Vanguardia en la barra de vida. De nada.",
  "new_frontiers_ui_health_pips_title": "Marcas en la barra de vida",
  "new_frontiers_ui_health_pips_desc": "Algunas unidades no tienen las reservas de vida tradicionales y es necesario un número concreto de ataques para destruirlas. Ahora, en lugar de estar adivinando como siempre y haciendo cuentas mentalmente, solo tienes que mirar a la unidad a la que quieres matar. Verás unas marcas muy útiles que representan cuántos golpes hacen falta para despojarlo de su envoltura mortal (como decía Hamlet).",
  "new_frontiers_ui_health_cost_title": "Costo de vida",
  "new_frontiers_ui_health_cost_desc": "Aunque en Dota la mayoría de las habilidades consumen maná, algunas consumen vida. Ahora, esas habilidades indican cuánta vida cuesta lanzarlas. No está mal, ¿eh? Es increíble que no se le ocurriera a nadie ponerlo hasta ahora. En fin, ahí lo tienen.",
  "new_frontiers_gameplay_update_desc": "La lista de novedades es enorme. Lo único que podría superarla es que fueran [i]dos[/i] listas enormes, pero [i]¡de dónde vamos a sacar más sorpresas![/i] Sigue leyendo para enterarte de todos los cambios de balance que te esperan en esta actualización. O lánzate a jugar. Ya sabemos que leer manuales técnicos sobre videojuegos es divertidísimo, pero jugar se le acerca bastante. Esta lista seguirá aquí cuando vuelvas.",
  "new_frontiers_misc_title": "Otros cambios",
  "new_frontiers_misc_role_tokens": "Redujimos el número de fichas de la cola con roles que se conceden al perder una partida con todos los roles seleccionados. Ahora obtendrás dos fichas por cada derrota (las victorias siguen concediendo las cuatro fichas). Este cambio debería ayudar a suavizar el comportamiento de los jugadores en las clasificatorias con roles, en las que la acumulación de fichas a veces se vuelve más importante que jugar con un rol asignado.",
  "new_frontiers_misc_removed_roles": "Eliminamos el modo capitán de las partidas clasificatorias, y los modos \"Todos aleatorio\" y \"Todos aleatorio a muerte\" de las no clasificatorias. Casi nadie juega estos modos y las colas duran fácilmente más de una hora.",
  "new_frontiers_misc_model_editor": "Con esta actualización, desaparece el editor de modelos heredado. Todos los archivos .vmdl se cargan ahora en la herramienta nueva, y los modelos antiguos se convierten al cargarlos por primera vez en la herramienta. Lanzaremos otra actualización más adelante para eliminar completamente la compatibilidad con el formato compilado antiguo, por lo que animamos a todos los creadores del Workshop a que carguen sus modelos para convertirlos al nuevo formato y recompilarlos lo antes posible.",
  "new_frontiers_misc_hold_animation": "Eliminamos la compatibilidad con la antigua clave \"HoldAnimation\" de las propiedades dinámicas. Las partidas personalizadas deben cambiar manualmente a la nueva llave \"loop mode\" o volver a compilar sus mapas para que estas propiedades se actualicen de manera automática.",
  "neutral_item_tier": "Objeto neutral de [b]nivel %1$s[/b]",
  "dota_ability_variable_health": "de vida",
  "dota_ability_variable_mana": "de maná",
  "dota_ability_variable_armor": "de armadura",
  "dota_ability_variable_damage": "de daño",
  "dota_ability_variable_str": "de fuerza",
  "dota_ability_variable_int": "de inteligencia",
  "dota_ability_variable_agi": "de agilidad",
  "dota_ability_variable_all": "a todos los atributos",
  "dota_ability_variable_primary_attribute": "de atributo principal",
  "dota_ability_variable_attack": "de velocidad de ataque",
  "dota_ability_variable_hp_regen": "de regeneración de vida",
  "dota_ability_variable_lifesteal": "de robo de vida",
  "dota_ability_variable_mana_regen": "de regeneración de maná",
  "dota_ability_variable_mana_regen_aura": "de aura de regeneración de maná",
  "dota_ability_variable_spell_amp": "de daño por hechizos",
  "dota_ability_variable_debuff_amp": "de duración del efecto negativo",
  "dota_ability_variable_move_speed": "de velocidad de movimiento",
  "dota_ability_variable_evasion": "de evasión",
  "dota_ability_variable_spell_resist": "de resistencia mágica",
  "dota_ability_variable_spell_lifesteal": "de robo de vida por hechizo",
  "dota_ability_variable_spell_lifesteal_creep": "de robo de vida por hechizo (creeps)",
  "dota_ability_variable_spell_lifesteal_hero": "de robo de vida por hechizo (héroes)",
  "dota_ability_variable_selected_attrib": "al atributo seleccionado",
  "dota_ability_variable_attack_range": "de alcance de ataque <font color='#7d7d7d'>(solo a distancia)</font>",
  "dota_ability_variable_attack_range_melee": "de alcance de ataque <font color='#7d7d7d'>(solo cuerpo a cuerpo)</font>",
  "dota_ability_variable_cast_range": "de alcance de lanzamiento",
  "dota_ability_variable_status_resist": "de resistencia a efectos negativos",
  "dota_ability_variable_projectile_speed": "de velocidad de los proyectiles",
  "dota_ability_variable_manacost_reduction": "de reducción de costo de maná",
  "dota_ability_variable_cooldown_reduction": "de reducción de tiempo de recarga",
  "dota_ability_variable_max_mana_percentage": "de bonificación máxima de maná"
}