// 1730.js

{
  "language": "thai",
  "new_frontiers_gameplay_number": "อัปเดตเกมเพลย์ 7.33",
  "new_frontiers_title": "อัปเดตพรมแดนใหม่",
  "new_frontiers_title_short": "พรมแดนใหม่",
  "new_frontiers_subtitle": "แผนที่ใหม่ การเปลี่ยนแปลงเกมเพลย์ครั้งใหญ่ และอีกมากมาย ดั่งเป็นโลกใบใหม่ให้สำรวจ",
  "new_frontiers_play_trailer": "ชมตัวอย่าง",
  "new_frontiers_dota_team_intro": "อัปเดตพรมแดนใหม่มาพร้อมกับแผนที่ใหม่ การเปลี่ยนแปลงเกมเพลย์ครั้งใหญ่ การเปลี่ยนแปลงระบบค้นหาแมตช์ การเปลี่ยนแปลงอินเตอร์เฟซผู้ใช้ และอื่น ๆ อีกมากล้นเหลือไม่ได้พูดเล่น ๆ<br><br>มากขนาดไหนน่ะหรือ? ขนาดที่เริ่มจำได้ไม่หมด แล้วเราก็แตกตื่นไปสองสามวันจนมีคนบอกว่าไม่ลองจดไว้ล่ะ เราก็เลยเขียนให้ได้อ่านเมื่อใดก็ตามที่ปรารถนา และคุณก็เข้ามาอ่านได้เช่นกัน! เลื่อนลงไปข้างล่างเพื่อเริ่มเลย",
  "new_frontiers_eldor_name": "Eldor จอมพ่อมด",
  "new_frontiers_dota_team_name": "ทีม Dota",
  "new_frontiers_section_title_map": "แผนที่ใหม่",
  "new_frontiers_section_title_major_gameplay": "การเปลี่ยนแปลงเกมเพลย์ครั้งใหญ่",
  "new_frontiers_section_title_matchmaking": "ระบบค้นหาแมตช์",
  "new_frontiers_section_title_ui": "อินเตอร์เฟซผู้ใช้",
  "new_frontiers_section_title_gameplay_update": "การเปลี่ยนแปลงสมดุล",
  "new_frontiers_map_introduction": "แผนที่ Dota ได้ถูกขยายขึ้นอย่างมหึมา เป้าหมายหลักของเกมยังคงเช่นเดิม เลนของคุณไม่ได้ห่างกันกว่าเก่า และทุกอย่างที่คุณต้องใช้เพื่อคว้าชัยชนะยังคงอยู่ในใจกลางแผนที่<br><br>แต่ด้วยดินแดนมากขึ้น 40% ย่อมมีพื้นที่ให้เก็บเกี่ยวทรัพยากรใหม่และค้นหากลยุทธ์ล่ามาแรง ป่าหลักทั้งสองฝั่งได้รับการปรับใหม่หมดจด ทำให้เปลี่ยนแปลงตำแหน่งการมองเห็น เส้นทางหลบป่า จุดฟาร์ม และอีกมากมาย",
  "new_frontiers_map_subtitle": "สำรวจโลกใบใหม่",
  "new_frontiers_map_roshan_title": "บ้านใหม่ของ Roshan",
  "new_frontiers_map_roshan_desc": "Roshan ได้ขายพื้นที่หลุมเก่าของเขาทอดตลาดไปเรียบร้อย และฉกฉวยประโยชน์จากอสังหาใหม่ทั้งหมดนี้ ซึ่งตอนนี้เขาก็มีหลุมใหม่แสนสดใสถึง [i]2[/i] หลุมด้วยกันในบริเวณมุมซ้ายบนและขวาล่างของแผนที่ เป็นดั่งสรวงสวรรค์ของชาวชอบหลุม ด้วยวิวแอบมองบ่อน้ำพุ ห่างจากร้านค้าลับเพียงไม่กี่นาที<br><br>หลุมเหล่านี้น่าจะอยู่ใกล้ยิมด้วย เพราะ Roshan ต่อจากนี้ถึกยิ่งขึ้นอีก นอกจากนั้น Roshan ไม่ดรอป Aghanim's Shard อีกต่อไป และดรอป Cheese ในการตายครั้งที่สองแทนครั้งที่สาม ส่วนการตายครั้งที่สามจะดรอป Refresher Shard หรือ Scepter ขึ้นอยู่กับว่าเขาอยู่ในหลุมเหนือหรือหลุมใต้",
  "new_frontiers_map_twin_gates_title": "Twin Gate",
  "new_frontiers_map_twin_gates_desc": "ต่อจากนี้ประตูทั้ง 2 จะเชื่อมต่อมุมแผนที่ใกล้กับป้อมเซฟเลน ทำให้ผู้เล่นสามารถเทเลพอร์ตจากมุมแผนที่ไปอีกมุมหนึ่งได้ทันที<br><br>การเปลี่ยนแปลงนี้เกี่ยวข้องกับเกมเพลย์ แต่ก็มีความหมายต่อประวัติความเป็นมาของเกมแน่นอน ใช่แล้ว: Dota 2 ได้เข้าร่วมจักรวาลขยายของแพ็ก-แมนอย่างไม่เป็นทางการเป็นที่เรียบร้อย",
  "new_frontiers_map_lotus_pools_title": "Lotus Pool",
  "new_frontiers_map_lotus_pools_desc": "ผู้เล่นสามารถพบ Lotus Pool ได้ในฝั่งซ้ายและขวาของแผนที่ (ใกล้ตำแหน่งที่ครีปชุดแรกพบกัน) บ่อดังกล่าวจะให้กำเนิดผลไม้ที่เมื่อทานแล้วมอบมานาและพลังชีวิต<br><br>ผู้เล่นสามารถสะสมผลไม้นี้ได้และจากนั้นรวมกันเป็นผลไม้ที่ใหญ่ขึ้นและมีมูลค่ามากขึ้นในช่วงท้ายเกม ซึ่งผลไม้ใหญ่นี้สามารถรวมเพิ่มเติมเป็นผลไม้ชิ้น[i]ใหญ๊[/i]ใหญ่ แล้วถ้ารวมผลไม้ชิ้น[i]ใหญ๊[/i]ใหญ่นี้ไปอีกล่ะ? คงไม่มีอะไรหรอก (มีอะไรแน่นอน)",
  "new_frontiers_map_tormentors_title": "Tormentor",
  "new_frontiers_map_tormentors_desc": "ครีปป่าทรงพลังทั้งสองนี้จะเกิดใกล้กับฐานหลังจากนาทีที่ 20 และทั้งคู่ก็อัดแน่นไปด้วย Aghanim’s Shard แต่ก็มีเงื่อนไขหนึ่ง และเงื่อนไขหนึ่งที่ว่าก็คือมี 2 เงื่อนไข: 1) Tormentor หุ้มล้อมด้วยโล่ยักษ์ ซึ่งสะท้อนความเสียหายส่วนใหญ่ที่คุณสร้าง 2) พวกมันจะแข็งแกร่งขึ้นทุกครั้งที่คุณฆ่าได้สำเร็จ ดังนั้นจึงอาจต้องใช้ทั้งทีมเพื่อรุมทำลาย<br><br>ข่าวดีก็คือ เหมือนหมีส่วนใหญ่ที่มักไม่สนใจคุณและไปขย้ำนักปีนเขาโดดเดี่ยวแทน หากคุณปล่อยมันไว้เฉย ๆ มันก็จะไม่ทำอะไรคุณเช่นกัน",
  "new_frontiers_map_watchers_title": "Watcher",
  "new_frontiers_map_watchers_desc": "Watcher ก็เป็นเหมือนกับเทอร์มิเนเตอร์ แต่มีหน้าที่เฝ้าสังเกตพื้นที่ พวกมันเป็นยอดทรหด พวกมันไม่รู้จักความเจ็บปวด พวกมันไม่รู้จักความกลัว แต่พวกมันจะขี้เกียจหน่อย เพราะพวกมันไม่เริ่มเฝ้าดูพื้นที่จนกว่าคุณจะคลิกใส่ <br><br>Watcher เริ่มเกมโดยไม่ทำงานและไม่อยู่ฝ่ายใด แต่เมื่อเปิดใช้งานแล้วจะมอบการมองเห็นในพื้นที่ของ Watcher เป็นเวลา 7 นาที หรือจนกว่าศัตรูทำลายเพื่อปิดการทำงานชั่วคราว เมื่อมีทีมสังหาร Roshan แล้ว Watcher ทั้งหมดจะเปลี่ยนฝั่งเป็นทีมดังกล่าว",
  "new_frontiers_map_barriers_title": "Defender's Gate",
  "new_frontiers_map_barriers_desc": "Defender's Gate หลอมรวมโลกแฟนตาซีแห่ง Dota สุดหวือหวาเข้ากับความสะดวกใช้งานได้จริงของประตูบ้านคุณที่คุณสามารถล็อกไว้เมื่อไปที่ร้านขายของชำเพื่อทำลาย Ancient โดยจะเป็นประตูหลังสู่ฐานของคุณที่มีสนามพลังสุดสะดวกซึ่งยอมให้ทีมคุณผ่านแต่กั้นไม่ให้ศัตรูเข้า ขณะที่ศัตรูบุกเข้ามาทางหน้าบ้าน คุณก็สามารถแอบหนีเข้าออกผ่านประตูหลังได้",
  "new_frontiers_map_wisdom_runes_title": "รูน Wisdom",
  "new_frontiers_map_wisdom_runes_desc": "สำรวจขอบแผนที่เพื่อตามล่าหารูน Wisdom ซึ่งมอบ XP เพิ่มเติมให้แก่ฮีโร่ใดก็ตามที่ฉลาดพอจะฉกฉวย รูน Wisdom จะเกิดใกล้ฐานของคุณ ทำให้มีวิธีป้องกันง่าย ๆ ช่วยไม่ให้เกมที่แพ้อยู่แล้วต้องดิ่งจนเกินควบคุม",
  "new_frontiers_map_shield_runes_title": "รูน Shield",
  "new_frontiers_map_shield_runes_desc": "รูนเสริมพลังในแม่น้ำได้รับการเติมเสริมด้วยรูน Shield ใหม่สุดแกร่ง ซึ่งมอบบาเรีย 50% ของพลังชีวิตสูงสุดของคุณ บุกโจมตีใต้ป้อมเพื่อเก็บแต้มสังหารช่วงต้นเกม หรือจะเดินขึ้นเขาที่มองไม่เห็นเพื่อเซอร์ไพรส์ทั้งคุณและทีมศัตรู",
  "new_frontiers_map_named_regions_title": "พื้นที่มีชื่อ",
  "new_frontiers_map_named_regions_desc": "แผนที่ส่วนขยายประกอบไปด้วยพื้นที่ลักษณะแตกต่างกัน เช่น เหมือง บ่อน้ำ สุสาน และรูปปั้น ทำให้คุณสามารถบอกเพื่อนร่วมทีมได้ง่ายขึ้นว่าศัตรูตามล่าฆ่าคุณอยู่ตรงไหน ยูนิตทั้งหมดในบริเวณเหล่านี้จะได้รับบัฟพิเศษตามธีมของแต่ละพื้นที่",
  "new_frontiers_map_creep_camps_title": "แคมป์ครีปใหม่ 12 จุด",
  "new_frontiers_map_creep_camps_desc": "ครีปบางตัวเริ่มรู้สึกเบื่อที่โดนฆ่าในป่าอยู่ตลอดเวลา จึงได้จัดตั้ง 12 แคมป์ใหม่กระจายทั่วส่วนขยายของแผนที่ ทำให้คุณสามารถตามไปฆ่าตรงนั้นได้เช่นกัน",
  "new_frontiers_map_outpost_title": "Outpost ใหม่",
  "new_frontiers_map_outpost_desc": "แผนที่ส่วนขยายมาพร้อมกับ Outpost ใหม่ 2 แห่ง ส่วน Outpost ดั้งเดิมได้ย้ายไปยังตำแหน่งใหม่ ซึ่งทำให้เกิดข้อฉงนใจว่ายังเรียกว่า Outpost เดิมได้อย่างแท้จริงอยู่หรือไม่ อย่าคิดมากเจ้าหนูจอมฉงนทั้งหลาย ก็พอเรียกได้ว่าอันเดิมน่ะแหละ",
  "new_frontiers_major_gameplay_features_desc": "อัปเดตพรมแดนใหม่นำเสนอการเปลี่ยนแปลงครั้งสำคัญให้กับฮีโร่โปรดของคุณและระบบต่าง ๆ ซึ่งที่จริงแล้ว ฝ่ายกฎหมายของเราแนะนำให้แจ้งเตือนคุณว่าส่วนเกมเพลย์นี้[i]อัดแน่นเต็มคาราเบล[/i]ด้วยคุณสมบัติใหม่ที่จะกำหนดรูปแบบการเล่น ขนาดที่คุณควรค่อย ๆ อ่านในช่วงหลายสัปดาห์ข้างหน้า คุณจะได้ไม่ต้องกระตุ้นสั่นประสาทมากเกินไปจนต้องโทรเรียกรถพยาบาล",
  "new_frontiers_major_gameplay_hero_reworks_title": "ไฮไลต์ฮีโร่",
  "new_frontiers_major_gameplay_hero_reworks_desc": "แม้ฮีโร่ทุกตัวได้รับการปรับสมดุล บางตัวก็ถูกปรับมากเป็นพิเศษ เราจึงขอแสดงตัวอย่างให้ดูตรงนี้",
  "new_frontiers_major_gameplay_new_items_title": "ไอเท็มใหม่",
  "new_frontiers_major_gameplay_new_items_desc": "ให้คุณได้สั่งซื้อจับจอง",
  "new_frontiers_major_gameplay_new_neutral_items_title": "ไอเท็มครีปป่าใหม่",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "เราได้โยนไอเท็มครีปป่าใหม่ล่าสุด 7 ชิ้นเข้าไปในกลุ่มไอเท็ม และนำไอเท็มโปรดเก่า ๆ บางชิ้นกลับมา",
  "new_frontiers_major_gameplay_bkb_title": "Black King Bar ปรับใหม่",
  "new_frontiers_major_gameplay_bkb_desc": "ต่อจากนี้เมื่อกดใช้ Black King Bar จะทำการลบล้างพื้นฐาน และได้รับความต้านทานเวทมนตร์ 50% พร้อมกับการป้องกันดีบัฟ ขณะไอเท็มทำงาน เอฟเฟกต์ด้านลบจากดีบัฟจะไม่มีผลต่อคุณ อีกทั้งคุณจะเป็นอมตะต่อความเสียหายโดยตรงและความเสียหายสะท้อน<br><br>แต่ระวังนิดนึง: หาก Black King Bar หมดเวลาก่อนระยะเวลาดีบัฟสิ้นสุดลง ดีบัฟจะส่งผลตามระยะเวลาที่เหลืออยู่ เอฟเฟกต์ที่ทะลุการป้องกันเวทโดยสมบูรณ์ต่อจากนี้จะทะลุการป้องกันดีบัฟเช่นกัน",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "ประเภทค่าสถานะใหม่ของฮีโร่",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "ในฐานะพี่น้องชาว Spirit ตนที่ 4 ที่เราได้เผยแพร่ออกมา Void Spirit ไม่ควรเป็นทั้งฮีโร่ Strength, Agility หรือ Intelligence เขาควรเป็นฮีโร่ประเภทใหม่เพื่อแสดงความแตกต่าง เป็นฮีโร่ประเภทที่ [i]4[/i]<br><br>ขอแนะนำ ฮีโร่ Universal — กลุ่มค่าสถานะหลักประเภทใหม่ ประกอบด้วยฮีโร่ที่มีอยู่แล้วซึ่งต่อจากนี้จะได้รับพลังโจมตี 0.6 หน่วยจากแต่ละค่าสถานะไม่ว่าจะเป็นประเภทใดก็ตาม วิศวกรของเรายืนยันว่าตัวเลขนี้สมดุลแล้วแน่นอน เว้นแต่กรณีที่ไม่สมดุล แต่ก็ไม่ต้องกลัวไปเพราะเราจะได้ทราบไปด้วยกันในการผจญภัยครั้งใหญ่ที่เรียกว่าอัปเดตพรมแดนใหม่นี้นี่เอง",
  "new_frontiers_major_gameplay_neutral_item_token_title": "การดรอปไอเท็มครีปป่าปรับใหม่",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "การสังหารสัตว์น้อยในป่าก่อนหน้านี้หมายความว่าจะได้ไอเท็มครีปป่าชิ้นใหม่สุดเฟี้ยว... ซึ่งมักตกเป็นของฮีโร่แคร์รี ซึ่งมักจะไม่ใช่คุณ ต่อจากนี้เมื่อฆ่าครีปป่าจะมีโอกาสดรอปเหรียญ ให้คุณสามารถเลือกจากไอเท็มครีปป่าที่มี [i]5[/i] ชิ้น แต่ละเหรียญจะมอบครบ 5 ตัวเลือก ดังนั้นแม้ผู้เล่นคนสุดท้ายแลกเหรียญก็ยังมีโอกาสให้ตัดสินใจได้อยู่<br><br>ทีมสามารถมอบเหรียญให้ใครใช้ก็ได้ แต่เมื่อคุณเลือกไอเท็มแล้วจะไม่สามารถแบ่งปันได้ ดังนั้นจงแบ่งปันเหรียญของคุณอย่างมีสติ",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "ระดับครีปป่าตามเวลา",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "ครีปป่าและสกิลครีปต่อจากนี้จะมีระดับเพิ่มขึ้นตามเวลา ใช่แล้ว แคมป์จะฆ่ายากขึ้นเมื่อเวลาในเกมผ่านไป แต่ฮีโร่ที่มีสกิลควบคุมครีปก็จะได้มีพวกพ้องสุดโหดทีเดียว",
  "new_frontiers_major_gameplay_kill_formula_title": "สูตรสังหารปรับใหม่",
  "new_frontiers_major_gameplay_kill_formula_desc": "เราได้ปรับสูตรคำนวณการสังหารใหม่เพื่อให้การสังหารต้นเกมมีผลมากขึ้นและเสริมแรงจูงใจให้ผู้เล่นไปแกงค์เลนอื่น เรายังลดการปรับเพิ่มโกลด์สำหรับเลนครีปตามเวลา ทำให้การฟาร์มครีปมีกำไรน้อยลงเมื่อเวลาในเกมผ่านไป และช่วยกระตุ้นผู้เล่นให้ฟาดโกลด์จากผู้เล่นอื่นแทน",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "คุณสมบัติใหม่ที่ไม่น่าสตัน",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "การได้เล่นฮีโร่ของคุณย่อมสนุกกว่าการนั่งเฉย ๆ และไม่ได้เล่นฮีโร่ของคุณ ดังนั้น เหล่าแฟน ๆ ผู้ชอบเล่น และเหล่านักวิจารณ์การไม่ได้เล่นทั้งหลาย ความฝันของคุณได้กลายเป็นจริงแล้ว: เตรียมพร้อมเล่นฮีโร่ของคุณได้มากกว่าเดิม<br><br>อย่างไรน่ะหรือ? ง่ายมาก เราได้ลดระยะเวลาของสกิลหยุดเกือบทั้งหมดในเกม เราคิดแผนสุดคลั่งขนาดนี้ได้อย่างไรกัน? ง่ายยิ่งกว่า เราโดนสกิล Primal Roar ของ Beastmaster เข้าเต็มหน้าและก็ได้มีเวลานั่งคิดมากมายนั่นเอง",
  "new_frontiers_major_gameplay_hero_rework_muerta": "หลังจากเข้ามาหลอกหลอนในเลนเป็นเวลา 2 เดือน ในที่สุด Muerta ก็ได้พบ Aghanim’s Scepter และ Shard ของเธอ หากคุณยังไม่ทราบเกี่ยวกับเธอ ลองเข้าไปดูรายละเอียดเพิ่มเติมได้ที่[url=https://www.dota2.com/deadreckoning]อัปเดตพิพากษ์มรณะ[/url]",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi โง่งั่งเกินกว่าจะเป็นฮีโร่ Intelligence ก็เลยไม่ได้เป็นอีกต่อไป",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa ต่อไปนี้จะเริ่มต้นอ่อนแอดั่งทารก แต่ก็เหมือนเด็ก เธอสามารถแข็งแกร่งขึ้นได้ตามเวลาผ่านไป",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "สกิลของ Clinkz ส่วนใหญ่ เหมือนดั่งความสามารถที่ดีที่สุดในชีวิต ต่อจากนี้จะสร้างโครงกระดูก",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden เคยสร้างร่างโคลนสมบูรณ์แบบของตัวเอง แต่ต่อจากนี้เขาจะสามารถร่างตัวเองที่[i]ดีกว่าเดิม[/i]! หรือแย่กว่าเดิม! อย่างไรก็ตาม เป็นร่างแตกต่าง และไม่น่าเป็นปัญหา เราหวังว่านะ",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "ฮีโร่ Alchemist เหมือนกับผู้เล่น Alchemist ทุกคน ย่อมมีความโลภโดยกำเนิด",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "โบนัสเวลาจำกัดสำหรับ ARC WARDEN",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "ด้วยเวลาจำกัดเท่านั้น เมื่อคุณเลือก Arc Warden ขณะเล่นฝั่ง Dire ร่าง Tempest Double จะกลายเป็นฮีโร่หลัก และเมื่อร่ายสกิลอัลติเมทจะอัญเชิญร่าง \"ปกติ\" ของเขาขึ้นมา",
  "new_frontiers_matchmaking_desc": "พูดกันตามตรง โลกใบนี้มีมนุษย์อยู่กว่า 8 พันล้านคน และ 99.99% ของผู้คนนั้นเล่น Dota ไม่เก่งสักนิด หมายความว่าการค้นหาแมตช์ย่อมเป็นเรื่องท้าทาย โดยเฉพาะอย่างยิ่งถ้าคุณเล่น Dota เก่งและอยากเล่นกับผู้คนที่เก่งพอ ๆ กันแต่หวังว่าไม่เก่งเกินหน้าเกินตาคุณ เราได้ทำการปรับปรุงและคำนวณสูตรเพื่อพัฒนาคุณภาพระบบค้นหาแมตช์ของเราอย่างถ้วนหน้าสำหรับผู้เล่นในทุกระดับความสามารถ",
  "new_frontiers_matchmaking_intro_title": "ค้นหาแมตช์ด้วยความเชื่อมั่น",
  "new_frontiers_matchmaking_intro_desc": "คะแนนการจัดอันดับ (MMR) ที่จริงแล้วมาจากตัวเลข 2 ชุดด้วยกัน: คะแนนอันดับและค่าความเชื่อมั่นอันดับ คะแนนอันดับของคุณเป็นค่าประมาณทักษะคุณ และค่าความเชื่อมั่นอันดับของคุณคือความมั่นใจของเราในการประมาณดังกล่าว เมื่อคุณเล่นแมตช์ เราจะปรับคะแนนอันดับของคุณขึ้นอยู่กับว่าคุณชนะหรือแพ้ ค่าความเชื่อมั่นอันดับก็จะเพิ่มขึ้นตามไปด้วยเนื่องจากเรามีข้อมูลมากขึ้น",
  "new_frontiers_matchmaking_details_old_title": "การเกาะกลุ่มที่ไม่ต้องการ ย่อมเป็นการเกาะกลุ่มที่แย่ที่สุด",
  "new_frontiers_matchmaking_details_old_desc": "แต่เดิม Dota ใช้อัลกอริทึม Elo เวอร์ชันดัดแปลงเพื่อทำการเปลี่ยนแปลงคะแนนอันดับและค่าความเชื่อมั่นอันดับ แต่เมื่อเวลาผ่านไปเราสังเกตพบปัญหาบางประการจากวิธีนี้ ตัวอย่างหนึ่งเช่น การกระจายของ MMR นั้นค่อย ๆ น้อยลงเรื่อย ๆ ทำให้เกิดการเกาะกลุ่มที่ไม่ต้องการในช่วง 0-1000 MMR อีกปัญหาหนึ่งคือผู้เล่นที่หยุดพักไปและกลับมาเล่นใหม่มักพบความยากลำบากที่จะกลับมาได้ MMR ที่แม่นยำ เพราะระดับทักษะก่อนหน้านี้ไม่ได้เป็นค่าสะท้อนถูกต้องอีกต่อไป",
  "new_frontiers_matchmaking_details_new_title": "การเกาะกลุ่มใหม่และดีขึ้น",
  "new_frontiers_matchmaking_details_new_desc": "เพื่อแก้ปัญหาดังกล่าว เราได้เปลี่ยนไปใช้อัลกอริทึมอีกแบบชื่อว่า Glicko ซึ่งคาดว่าทำให้คุณสามารถจับคู่กับผู้เล่นอื่นในระดับทักษะเดียวกันได้อย่างรวดเร็วและแม่นยำ ในส่วนด้านการคำนวณนั้น Glicko ทำให้เราใช้ค่าความเชื่อมั่นอันดับของผู้เล่นในการคำนวณของเราได้ดีขึ้น ส่งผลให้ตัดสินใจเพิ่มหรือลดคะแนนอันดับได้แม่นยำกว่าเดิม\\n\\nการเปลี่ยนระบบค้นหาแมตช์ของเราเป็นระบบใหม่จะรู้สึกเหมือนกับตอนเริ่มต้นฤดูกาลจัดอันดับใหม่: [list][*]ผู้เล่นทุกคนจะเข้าสู่โหมดปรับเทียบสั้น ๆ โดยมีคะแนนเริ่มต้นตามอันดับก่อนหน้านี้\\n[*]การปรับเทียบจะไม่ใช้จำนวนเกมตายตัวอีกต่อไป โดยผู้เล่นจะถือว่าปรับเทียบเสร็จสิ้นเมื่อค่าความเชื่อมั่นอันดับเพิ่มสูงกว่าค่ากำหนด\\n[*]เมื่อปรับเทียบแล้ว มีโอกาสที่คุณจะมีเหรียญตราอันดับต่างไปจากเดิม อย่างไรก็ตาม แม้เหรียญตราของคุณเปลี่ยนแปลงไปอย่างมากแต่สามารถคาดหวังได้ว่าจะยังคงจับคู่กับผู้เล่นในระดับทักษะใกล้เคียงกัน\\n[*]แมตข์จะไม่เพิ่ม/ลด MMR คงที่อีกต่อไป โดยจะเปลี่ยนแปลงจากหลายปัจจัยรวมถึงคะแนนอันดับและค่าความเชื่อมั่นอันดับของผู้เข้าร่วม อย่างไรก็ตาม เราจะมีค่าเพิ่ม/ลดสูงสุดต่อแมตช์เพื่อป้องกันไม่ให้เกิดผลเสีย[*]ค่าความเชื่อมั่นอันดับของผู้เล่นจะลดลงช้า ๆ ตามเวลาหากผู้เล่นดังกล่าวไม่ได้เล่นในแมตช์[/list]เราได้ใช้งานระบบค้นหาแมตช์ทั้งสองควบคู่กันหลังบ้านมาสักพักหนึ่งแล้วเพื่อช่วยสร้างความมั่นใจในการเปลี่ยนแปลงเหล่านี้ เราเข้าใจว่า MMR ที่แม่นยำเป็นเพียงแค่หนึ่งในปัจจัยที่ส่งผลต่อคุณภาพแมตช์ และเช่นเดียวกับการเปลี่ยนแปลงทุกอย่างในนี้ เราสนใจที่จะได้รับฟังความคิดเห็นจากคุณ",
  "new_frontiers_matchmaking_immortals_title": "ระบบค้นหาแมตช์ Immortal",
  "new_frontiers_matchmaking_immortals_desc": "ในระดับ Immortal การได้รู้จักผู้เล่นอื่น สานความสัมพันธ์ต่อกัน และเลือกตำแหน่งให้สมดุลนั้นสำคัญยิ่งกว่าแค่ MMR ดังนั้นเราจึงออกแบบระบบค้นหาแมตช์ใหม่สำหรับอันดับ Immortal โดยพิจารณาจากปัจจัยดังกล่าว<br><br>แมตช์ในอันดับ Immortal จะไม่ใช้ทีมที่สร้างขึ้นให้อีกต่อไป โดยเปลี่ยนเป็นกัปตัน 2 คนดราฟต์ผู้เล่นอื่นอีก 8 คนเข้าทีม ทำให้ทีมของคุณแกร่งได้กว่าแค่พึ่ง MMR สำหรับสร้างทีม ดังนั้นหากแมตช์ของคุณแย่ในตอนนี้ ก็ไม่มีใครให้โทษนอกจากตัวคุณเองแล้วนะ เหล่าผู้เล่น Immortal",
  "new_frontiers_ui_desc": "สายตาพร่ามัว รู้สึกเจ็บแปลบกลางแขน? เราขอแนะนำให้อย่าสนใจอะไรมาก ก็แค่ร่างกายสื่อสารว่ากำลังหิวเท่านั้น รถยางแบน? วิ่งด้วยกระทะล้อสิ มีทรงกลม ๆ เหมือนกัน สิ่งที่จะสื่อก็คือ: แทบทุกอย่างในชีวิตสามารถเพิกเฉยเชิดใส่ได้อย่างปลอดภัยไร้ผลกระทบ<br><br>ยกเว้นแถบพลังชีวิต Dota ที่สำคัญยิ่งกว่าสิ่งใด ดังนั้นข้อมูล UI เกี่ยวกับพลังชีวิตจึงได้รับการอัปเกรดครั้งใหญ่ในอัปเดตนี้",
  "new_frontiers_ui_shields_title": "แถบพลังชีวิตบาเรีย",
  "new_frontiers_ui_shields_desc": "ทราบหรือไม่ว่าในเกม Dota มีโล่ด้วย? โล่ป้องกันเวทมนตร์ โล่ป้องกันกายภาพ โล่ Aphotic Shield โล่มากมายทุกประเภท! ก่อนหน้านี้คุณอาจไม่ทันได้สังเกต หรือไม่ได้สนใจ เนื่องจากไม่มีวิธีบอกว่าคุณมีโล่เริ่มต้นหรือเหลืออยู่เท่าไหร่<br><br>แต่ยุคแห่งความมืดมัวไม่แน่นอนจะสิ้นสุดลงในวันนี้ เพราะต่อไปคุณจะได้เห็นทุกอย่าง หรืออย่างน้อยก็ 2 อย่างที่พูดเมื่อกี้นี้ คุณยังสามารถเห็นประเภทของโล่เช่นกัน เพื่อเป็นการเฉลิมฉลองว่าโล่เก่าเหล่านั้นดีขึ้นขนาดไหนจากการอัปเกรดระบบแสดงผลนี้ เราจึงได้เพิ่มสกิลใหม่ที่มีโล่หลายสกิลด้วยกัน<br><br>เรายังเปลี่ยนชื่อจากโล่เป็นบาเรียอีกด้วย เพื่อที่คุณจะได้ไม่ต้องสับสนนึกว่าพูดถึง Vanguard ด้านบนแถบพลังชีวิตของคุณ ยินดีที่ได้ช่วยเหลือ",
  "new_frontiers_ui_health_pips_title": "จุดแถบพลังชีวิต",
  "new_frontiers_ui_health_pips_desc": "บางยูนิตไม่ได้มีพลังชีวิตตามแบบฉบับทั่วไปและต้องใช้จำนวนการโจมตีเพื่อทำลาย ต่อจากนี้ แทนที่ต้องนั่งเดาหรือใช้การนับในสมองระดับอัจฉริยะ คุณสามารถดูแค่ยูนิตที่ต้องการฆ่า โดยจะแสดงจุดเล็ก ๆ แสนสะดวกซึ่งแสดงจำนวนการโจมตีก่อนที่ยูนิตจะต้องพบกับสัจธรรมชีวิต (อ้างอิงจากหนังสือธรรมะ)",
  "new_frontiers_ui_health_cost_title": "พลังชีวิตที่ใช้",
  "new_frontiers_ui_health_cost_desc": "แม้สกิลส่วนใหญ่ใน Dota นั้นใช้มานา แต่บางสกิลก็ใช้พลังชีวิตแทน ต่อจากนี้สกิลดังกล่าวจะแสดงพลังชีวิตที่สูญเสียเมื่อร่ายสกิล ฟังดูดีใช่ไหมล่ะ? และก็ฟังดูแปลกใช่ไหมที่ก่อนหน้านี้ไม่เคยมีใครคิดจะเอามาแสดงให้เห็น อย่างไรก็เถอะ ตอนนี้มีให้ดูแล้วนะ",
  "new_frontiers_gameplay_update_desc": "ด้านบนเป็นรายการเปลี่ยนแปลงที่ใหญ่อลังพอตัว สิ่งเดียวที่อาจทำให้ดีขึ้นได้คือรายการใหญ่อลัง [i]2[/i] อันด้วยกัน แต่จะหาได้จากไหนกันนะ [i]อ้อ ลองดูนี่สิ![/i] อ่านต่อเพื่อดูการเปลี่ยนแปลงปรับสมดุลอื่น ๆ ทั้งหมดที่มาพร้อมอัปเดตนี้ หรือลองกระโดดเข้าเกมและเล่นเลยก็ได้ เชื่อเราสิ ไม่ต้องบอกเราก็ได้ว่าการอ่านคู่มือข้อมูลเทคนิคเกี่ยวกับวิดีโอเกมนั้นมันสนุกขนาดไหน แต่ถ้าได้ลองเล่นจริง ๆ เลยก็คงน่าสนุกไม่แพ้กัน รายการนี้จะยังคงอยู่ที่นี่รอให้คุณกลับมาอ่านแน่นอน",
  "new_frontiers_misc_title": "เบ็ดเตล็ด",
  "new_frontiers_misc_role_tokens": "เราได้ลดจำนวนเหรียญเข้าคิวตามตำแหน่งที่มอบให้เมื่อคุณแพ้ในแมตช์ \"เลือกตำแหน่งทั้งหมด\" ตอนนี้คุณจะได้รับ 2 เหรียญเมื่อแพ้หนึ่งแมตช์ (การชนะจะยังทำให้ได้รับเหรียญเต็ม 4 เหรียญ) การเปลี่ยนแปลงครั้งนี้น่าจะช่วยปรับพฤติกรรมของผู้เล่นในโหมดจัดอันดับตามตำแหน่ง ซึ่งบางครั้งให้ความสำคัญกับการสะสมเหรียญมากกว่าการเล่นตำแหน่งที่ได้รับอย่างมีประสิทธิภาพ",
  "new_frontiers_misc_removed_roles": "เราได้ลบ Captains Mode ออกจากโหมดจัดอันดับ และตัด All Random และ All Random Deathmatch ออกจากโหมดไม่จัดอันดับ ซึ่งแทบไม่มีใครเล่นโหมดเหล่านี้และใช้เวลาเข้าคิวเล่นนานเกินหนึ่งชั่วโมง",
  "new_frontiers_misc_model_editor": "อัปเดตนี้จะลบตัวแก้ไขโมเดลดั้งเดิมออก ตอนนี้ไฟล์ vmdl ทั้งหมดจะโหลดในเครื่องมือใหม่ และจะแปลงโมเดลเก่าเมื่อคุณโหลดลงในเครื่องมือเป็นครั้งแรก เราจะเผยแพร่อัปเดตฉบับถัดไปเพื่อลบการโหลดรูปแบบเก่าที่คอมไพล์ไว้และเคยรองรับมาก่อนออกให้หมด ดังนั้นเราขอแนะนำให้ผู้สร้างผลงานในเวิร์กชอปทุกคนโหลดและแปลงโมเดลของตนไปเป็นรูปแบบใหม่และคอมไพล์อีกครั้งโดยเร็วที่สุด",
  "new_frontiers_misc_hold_animation": "เราได้ลบการรองรับค่าหลัก \"HoldAnimation\" แบบดั้งเดิมออกจากคุณสมบัติแบบไดนามิกแล้ว ในเกมแบบกำหนดเอง ผู้เล่นควรเปลี่ยนไปใช้ค่าหลัก \"โหมดวนซ้ำ\" แบบใหม่ด้วยตนเอง หรือคอมไพล์แผนที่อีกครั้ง เพื่ออัปเกรดคุณสมบัติเหล่านั้นโดยอัตโนมัติ",
  "neutral_item_tier": "ไอเท็มครีปป่า[b]ระดับ %1$s[/b]",
  "dota_ability_variable_health": "พลังชีวิต",
  "dota_ability_variable_mana": "มานา",
  "dota_ability_variable_armor": "เกราะป้องกัน",
  "dota_ability_variable_damage": "พลังโจมตี",
  "dota_ability_variable_str": "Strength",
  "dota_ability_variable_int": "Intelligence",
  "dota_ability_variable_agi": "Agility",
  "dota_ability_variable_all": "ค่าสถานะทั้งหมด",
  "dota_ability_variable_primary_attribute": "ค่าสถานะหลัก",
  "dota_ability_variable_attack": "ความเร็วในการโจมตี",
  "dota_ability_variable_hp_regen": "อัตราฟื้นฟูพลังชีวิต",
  "dota_ability_variable_lifesteal": "ดูดพลังชีวิต",
  "dota_ability_variable_mana_regen": "อัตราฟื้นฟูมานา",
  "dota_ability_variable_mana_regen_aura": "ออราอัตราฟื้นฟูมานา",
  "dota_ability_variable_spell_amp": "ความเสียหายสกิล",
  "dota_ability_variable_debuff_amp": "ระยะเวลาดีบัฟ",
  "dota_ability_variable_move_speed": "ความเร็วในการเคลื่อนที่",
  "dota_ability_variable_evasion": "อัตราหลบหลีก",
  "dota_ability_variable_spell_resist": "ความต้านทานเวทมนตร์",
  "dota_ability_variable_spell_lifesteal": "สกิลดูดพลังชีวิต",
  "dota_ability_variable_spell_lifesteal_creep": "สกิลดูดพลังชีวิต (ครีป)",
  "dota_ability_variable_spell_lifesteal_hero": "สกิลดูดพลังชีวิต (ฮีโร่)",
  "dota_ability_variable_selected_attrib": "ค่าสถานะที่เลือก",
  "dota_ability_variable_attack_range": "ระยะการโจมตี <font color='#7d7d7d'>(เฉพาะระยะไกล)</font>",
  "dota_ability_variable_attack_range_melee": "ระยะการโจมตี <font color='#7d7d7d'>(เฉพาะระยะประชิด)</font>",
  "dota_ability_variable_cast_range": "ระยะร่าย",
  "dota_ability_variable_status_resist": "ความต้านทานสถานะ",
  "dota_ability_variable_projectile_speed": "ความเร็วกระสุน",
  "dota_ability_variable_manacost_reduction": "ลดมานาที่ใช้",
  "dota_ability_variable_cooldown_reduction": "ลดคูลดาวน์",
  "dota_ability_variable_max_mana_percentage": "เพิ่มมานาสูงสุด",
  "dota_ability_variable_aoe_bonus": "เพิ่มพื้นที่"
}