// 4317.js

{
  "language": "hungarian",
  "new_frontiers_gameplay_number": "7.33-as játékmenet-frissítés",
  "new_frontiers_title": "Az Új határvidék frissítés",
  "new_frontiers_title_short": "Új határvidék",
  "new_frontiers_subtitle": "Új pálya, jelentős játékmenet-változások és még oly sok minden. Egy egész új világ vár felfedezésre.",
  "new_frontiers_play_trailer": "Előzetes megnézése",
  "new_frontiers_dota_team_intro": "Az Új határvidék frissítés új pályát, jelentős játékmenet-változásokat, játékkeresési és kezelőfelület-változtatásokat és – nem viccelünk – még oly sok mindent vonultat fel.<br><br>Mennyi mindent? Annyit, hogy igazából nehéz is mindenre visszaemlékezni, és pár napig pánikoltunk, amíg valakinek eszébe nem jutott, hogy akár le is írhatnánk. Így is tettünk. Most bármikor elolvashatjuk, amikor szeretnénk. És te is! Kezdj el lefelé görgetni a továbbolvasáshoz.",
  "new_frontiers_eldor_name": "Eldor, a varázsló",
  "new_frontiers_dota_team_name": "A Dota csapat",
  "new_frontiers_section_title_map": "Új pálya",
  "new_frontiers_section_title_major_gameplay": "Jelentős játékmenet-változások",
  "new_frontiers_section_title_matchmaking": "Játékkeresés",
  "new_frontiers_section_title_ui": "Kezelőfelület",
  "new_frontiers_section_title_gameplay_update": "Egyensúly-változtatások",
  "new_frontiers_map_introduction": "A Dota pálya jelentősen kibővült. A játék fő célja ugyanaz marad — a vonalaitok nincsenek messzebb egymástól, és minden, amire a győzelemhez szükségetek van, továbbra is a pálya közepén található.<br><br>De 40%-kal több tereppel bőven van hely új nyersanyagok learatására és új stratégiák felfedezésére. A két fő dzsungel is teljesen át lett rendezve, felfrissítve a látómezők elhelyezését, a menekülési útvonalakat, a farmolást és sok mást.",
  "new_frontiers_map_subtitle": "Fedezd fel az új világot",
  "new_frontiers_map_roshan_title": "Roshan új lakóhelyei",
  "new_frontiers_map_roshan_desc": "Roshan eladta a régi barlangját a folyónál, és kihasználja a sok új ingatlanlehetőséget. Mostantól [i]két[/i] fantasztikus új barlangja van a pálya északnyugati és délkeleti sarkában. Ezek igazi barlanglakó-paradicsomok, rálátással a Forrásokra, és csak néhány percre a Titkos Boltoktól.<br><br>Egy edzőteremhez is közel kell lenniük, mert Roshan keményebb, mint valaha. Mostantól nem dob Aghanim's Shardokat, Cheese-t viszont a harmadik halála helyett a másodikkor dob. Harmadik halálakor Refresher Shardot vagy egy Sceptert dob attól függően, hogy az északi vagy a déli barlangban van-e.",
  "new_frontiers_map_twin_gates_title": "Ikerkapuk",
  "new_frontiers_map_twin_gates_desc": "Mostantól két kapu köti össze a pálya sarkait a biztonságos vonali tornyok közelében, lehetővé téve, hogy a játékosok azonnal átteleportáljanak a pálya egyik széléről a másikra.<br><br>Ez egy játékmenet-változtatás, de vannak nyilvánvaló háttértörténeti összefüggései. Kitaláltad: a Dota 2 mostantól nem hivatalosan a PMKU (Pac Man kibővített univerzum) része.",
  "new_frontiers_map_lotus_pools_title": "Lótuszmedencék",
  "new_frontiers_map_lotus_pools_desc": "A játékosok mostantól Lótuszmedencéket találnak a pálya bal és jobb oldalain (annak a helynek a közelében, ahol a creephullámok először találkoznak). Ezek rendszeresen olyan gyümölcsöket teremnek, amelyek elfogyasztáskor manát és ÉP-t adnak.<br><br>A játékosok betárazhatnak ebből a gyümölcsből, majd a játék későbbi részében nagyobb, magasabb értékekkel rendelkező gyümölccsé kombinálhatják azokat. Még ez a gyümölcs is kombinálható egy [i]hihetetlenül[/i] nagy gyümölccsé. És mi történik, ha a [i]hihetetlenül[/i] nagy gyümölcsöt kombinálod? Valószínűleg semmi. (Határozottan valami.)",
  "new_frontiers_map_tormentors_title": "Gyötrők",
  "new_frontiers_map_tormentors_desc": "Ez a két erős, semleges épület húsz perc után jelenik meg a két bázis közelében, és mindkettő dugig van Aghanim’s Sharddal. Ám van egy bökkenő, ami pedig az, hogy két bökkenő is van: 1. A Gyötrők megapajzzsal vannak felszerelve, ami visszaveri a sebzés nagyját, amit rájuk küldesz. 2. Valahányszor megölöd őket, egyre erősebbek lesznek. Szóval valószínűleg az egész csapatotokra szükség lesz az elintézésükhöz.<br><br>A jó hír viszont, hogy az épp egy túrázót marcangoló medvékhez hasonlóan, ha békén hagyod őket, ők is békén fognak hagyni.",
  "new_frontiers_map_watchers_title": "Figyelők",
  "new_frontiers_map_watchers_desc": "A Figyelők olyanok, akár egy terminátor, csak éppen figyelésre. Könyörtelenek. Nem ismerik a fájdalmat. Nem ismerik a félelmet. Viszont lusták. Addig nem kezdenek figyelni, míg rájuk nem kattintasz.<br><br>A Figyelők inaktívan és semlegesen kezdik a játékot, de aktiválva látómezőt adnak a területükön, hét percig, vagy amíg az ellenség az átmeneti kiiktatásukra nem szabotálja azokat. Amikor egy csapat megöli Roshant, az összes Figyelő az ő oldalukra áll.",
  "new_frontiers_map_barriers_title": "A Védelmező Kapui",
  "new_frontiers_map_barriers_desc": "A Védelmező Kapui a Dota szikrázó magas fantasyjét kombinálják a házadon található ajtók hasznosságával, amiket kulcsra zárhatsz, míg elmégy a boltba elpusztítani az Ősüket. Hátsó ajtó a bázisotokra, egy ügyes kis erőtérrel, ami a ti csapatotokat átengedi, az ellenséges csapatot pedig kívül tartja. Miközben az ellenség elöl ostromol, te hátul szépen be- és kilopózhatsz.",
  "new_frontiers_map_wisdom_runes_title": "Bölcsesség rúnák",
  "new_frontiers_map_wisdom_runes_desc": "Kutasd át a pálya széleit Bölcsesség rúnák felfedezéséért, amelyek TP-növelést biztosítanak bármely hősnek, aki elég bölcs ahhoz, hogy ellopjon egyet. A Bölcsesség rúnák bázisod közelében jelennek meg, könnyen védhető módot kínálva a vesztésre álló játékok irányíthatatlan elszabadulásának megakadályozására.",
  "new_frontiers_map_shield_runes_title": "Pajzs rúnák",
  "new_frontiers_map_shield_runes_desc": "A folyó rúnái is új példányt kapnak az erőteljes Pajzs rúnával, ami maximális életerőd 50%-át adja pajzs formájában. Vesd be magad egy torony alá ölésért a játék korai szakaszában, vagy sétálj fel vakon egy magaslatra, meglepve mind magadat, mind az ellenséges csapatot.",
  "new_frontiers_map_named_regions_title": "Nevesített területek",
  "new_frontiers_map_named_regions_desc": "A kibővített pálya mostantól olyan nevezetes területekkel rendelkezik, mint a Bányák, a Kút, a Temető és a Szobor, még könnyebbé téve csapattársaid tájékoztatását arról, hol öl épp téged valaki. Az ezeken a területeken levő összes egység a terület témájához illő értékmódosítókat kap.",
  "new_frontiers_map_creep_camps_title": "12 új creeptábor",
  "new_frontiers_map_creep_camps_desc": "Néhány creep belefáradt, hogy állandóan lemészárolják a dzsungelben, ezért létrehoztak 12 új tábort szétszórva szerte a kibővített pályán. Úgyhogy mostantól ott is lemészárolhatod őket.",
  "new_frontiers_map_outpost_title": "Új helyőrségek",
  "new_frontiers_map_outpost_desc": "Az új, kibővített pálya két új helyőrséget vonultat fel. Az eredeti helyőrségek új helyekre lettek áthelyezve, ami felveti a nyilvánvaló kérdést, hogy azok vajon tényleg az eredeti helyőrségek-e. Szép próbálkozás, Szókratész. Igen, azok.",
  "new_frontiers_major_gameplay_features_desc": "Az Új határvidék frissítés nagy változásokat hoz kedvenc hőseidhez és rendszereidhez. Ami azt illeti, a jogi részlegünk azt tanácsolta, tájékoztassunk arról, hogy ennek a játékmenet-szekciónak [i]annyira tömény[/i] a meta-meghatározó új tartalma, hogy lassan, a következő néhány hétre elosztva javasolt olvasni, nehogy túlstimuláld magad, és ki kelljen hívni a tűzoltókat.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Hőskiemelések",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Bár minden hős ki lett egyensúlyozva, némely hősök jobban, mint mások. Itt megnevezünk ezek közül néhányat.",
  "new_frontiers_major_gameplay_new_items_title": "Új tárgyak",
  "new_frontiers_major_gameplay_new_items_desc": "Amit csak venni szeretnél.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Új semleges tárgyak",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Bedobunk hét vadonatúj semleges tárgyat, és visszahozunk néhány régi kedvencet.",
  "new_frontiers_major_gameplay_bkb_title": "Átdolgozott Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "A Black King Bar aktiválása mostantól alap megszüntetést alkalmaz, és 50% mágiaellenállást, valamint gyengítésimmunitást ad. Amíg aktív, a gyengítések negatív hatásai nem hatnak rád. Plusz, immunis leszel a tiszta és visszavert sebzésre.<br><br>De légy óvatos: ha a Black King Bar bármelyik gyengítés időtartama előtt jár le, a gyengítés alkalmazódni fog a hátralevő időtartamára. A mágiaimmunitáson áthatoló hatások mostantól a gyengítésimmunitáson is áthatolnak.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Új hőstulajdonság-típus",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "A negyediknek kiadott lélektestvérként Void Spiritnek nem Erő-, Ügyesség- vagy Intelligencia-hősnek kellett volna lennie. Hogy elkülönüljön, igazából újfajta hősnek kellett volna lennie. Egy [i]negyedik[/i] fajta hősnek.<br><br>Bemutatjuk az Univerzális hősöket, a meglevő hősök egy új főtulajdonság-csoportját, akik mostantól 0,6 sebzést kapnak minden tulajdonságuk minden pontja után. A mérnökeink biztosítottak minket arról, hogy ez az érték tökéletesen ki van egyensúlyozva. Kivéve, ha nem. A jó hír viszont, hogy mind együtt fogjuk ezt kideríteni abban a nagy kalandban, aminek Új határvidék frissítés a neve.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Átdolgozott semleges tárgydobás",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Az erdei teremtmények legyilkolása régebben azt jelentette, kapsz egy szuper új semleges tárgyat... ami általában a végjátékoshoz került, aki meg általában nem te voltál. Mostantól egy semleges creep megölése véletlenszerűen egy zsetont dob, amivel [i]öt[/i] elérhető semleges tárgyból választhatsz. Mindegyik zseton a teljes ötválasztékos sort kínálja, így a zsetonját legutolsónak beváltó játékosnak is valódi választása van.<br><br>A csapatok bárkinek odaadhatják a zsetont felhasználásra, de miután tárgyat választottál, azt nem lehet megosztani, sáfárkodj hát bölcsen a zsetonjaiddal.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Semleges creepek fejlődése",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "A semleges creepek és a képességeik mostantól idővel fejlődnek. Igen, az idő haladtával a táborokat nehezebb lesz kiirtani, a creepek irányításának képességével rendelkező hősök viszont kapnak némi komoly erősítést.",
  "new_frontiers_major_gameplay_kill_formula_title": "Átdolgozott ölési képlet",
  "new_frontiers_major_gameplay_kill_formula_desc": "Átdolgoztuk az ölési képletet, hogy a játék eleji öléseknek nagyobb legyen a hatása, és motiválják a játékosokat más vonalak gankelésére. Csökkentettük a vonali creepek aranynövekedését is, kevésbé nyereségessé téve a creepfarmolást a játék előrehaladtával, így arra ösztönözve a játékosokat, hogy inkább egymásból pofozzák ki az aranyat.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Elég a bénáskodásból",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "A hősöddel játszani mindig szórakoztatóbb, mint üldögélve nem játszani a hősöddel. Hát, játékért rajongók és nem-játék kritikusok, álmaitok valóra váltak: készüljetek minden eddiginél többet játszani a hősötökkel.<br><br>Hogyan? Egyszerűen. A játék szinte összes bénításának időtartamát lecsökkentettük. Hogyan ötlöttük ki ezt az eszelős tervet? Még egyszerűbben. Kaptunk a képünkbe egy Beastmaster-üvöltést, és hirtelen jó sok időnk lett gondolkodni.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Miután két hónapja kísértett a vonalakon, Muerta végre megtalálta Aghanim’s Scepterét és Shardját. Ha még nem ismerkedtél meg vele, nézz rá a [url=https://www.dota2.com/deadreckoning]Halálos leszámolás frissítésre[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi túl buta ahhoz, hogy intelligencia-hős legyen. Így mostantól nem az.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa mostantól kezdetben olyan gyenge, mint egy csecsemő, de éppúgy, mint egy csecsemő, idővel jól megerősödik.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Clinkz képességeinek többsége, mint a legjobb képességek az életben, mostantól csontvázakat hoz létre.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden régen önmaga tökéletes másolatát hozta létre. Most viszont [i]jobb[/i] másolatot hoz létre magából! Vagy rosszabbat. Akárhogy is, eltérőt. És, úgy gondolnánk, ellentmondásmenteset.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Alchemist, a hős, csakúgy, mint minden Alchemist-játékos, mostantól ösztönösen mohó.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ARC WARDEN KORLÁTOZOTT IDEJŰ BÓNUSZ",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Csak korlátozott ideig, amikor a Dire oldalon játszva Arc Wardent választod, a Tempest Double lesz a fő hős, a „normál” alakja pedig az ultimate-jének varázslásával lesz megidézhető.",
  "new_frontiers_matchmaking_desc": "Valljuk be: nyolcmilliárd ember van a bolygón, és 99,99%-uk pocsék Dota-játékos. Ez azt jelenti, a játékkeresés kihívás lehet, főleg, ha az ember jó a Dotában, és olyanokkal szeret játszani, akik majdnem, de remélhetőleg nem teljesen ugyanolyan jók, mint ő. Melóztunk egy csomót, és kimatekoztuk, hogyan lehet javítani a játékkeresés minőségén a teljes ranglistán, az összes ügyességszintű játékosnak.",
  "new_frontiers_matchmaking_intro_title": "Játékkeresés magabiztosan",
  "new_frontiers_matchmaking_intro_desc": "A játékkeresési rangsor (JáR) igazából csak két számból áll: a rangból és a rangbizonyosságból. A rangod a becsült ügyességed, a rangbizonyosságod pedig, hogy mennyire vagyunk biztosak ebben a becslésben.",
  "new_frontiers_matchmaking_details_old_title": "Nem kívánatos tömörülés: a legrosszabb fajta",
  "new_frontiers_matchmaking_details_old_desc": "A Dota hagyományosan az Élő-algoritmus egy módosított változatát használta a rang- és rangbizonyosság-változások elvégzésére. De idővel észrevettünk néhány problémát e megközelítésünkkel. Például, a JáR eloszlása fokozatosan egyre alacsonyabbra tolódott, nem kívánatos tömörülést okozva a 0 és 1000 közötti JáR-tartományban. Egy másik probléma volt, hogy az olyan játékosoknak, akik szünetet tartottak, majd visszatértek, nehéz volt visszakerülni a pontos JáR-hoz, mert a korábbi ügyességszintjük már nem képviselte őket megfelelően.",
  "new_frontiers_matchmaking_details_new_title": "Új, fejlesztett tömörülés",
  "new_frontiers_matchmaking_details_new_desc": "Ennek megoldására egy másik, Glicko nevű algoritmusra váltunk, aminek lehetővé kellene tennie a gyors és pontos játékba kerülést hasonló ügyességszintű játékosokkal. Matematika tekintetében a Glicko lehetővé teszi, hogy jobban figyelembe vegyük a játékosok rangbizonyosságát a számításainkban, ami pontosabb rangnövekedési- és csökkenési döntéseket eredményez.\\n\\nAz új játékkeresési rendszerünkre váltás kezdetben kicsit olyan érzés lesz, mint egy új játékkereső szezon indulása:\\n[list]\\n[*]Minden játékos visszakerül egy rövid kalibrációs módba, ami a korábbi rang alapján lesz beosztva.\\n[*]A kalibráció mostantól nem fix számú meccs. Ehelyett a játékos akkor tekintett kalibráltnak, amikor a rangbizonyossága egy adott küszöb fölött van.\\n[*]Valószínű, hogy kalibrálás után más medálnál fogsz kikötni, mint amid korábban volt. Ám még ha jelentősen változik is a medálod, arra számíthatsz, hogy hasonló ügyességszintű játékosokkal fogsz meccsbe kerülni.\\n[*]A meccseknek mostantól nem fix JáR-növekedése/-csökkenése lesz. Változó érték lesz, ami egy sor tényezőn alapul, köztük a résztvevők rangján és rangbizonyosságán. A meccsenkénti növekedést/csökkentést azonban korlátozni fogjuk a különösképp negatív eredmények megelőzésére.\\n[*]A játékosok rangbizonyossága idővel lassan csökkenni fog, ha a játékos nem játszik meccseket.\\n[/list]\\n\\nA háttérben egy ideje már egyszerre működtettük a két játékkereső rendszert, hogy segítsen bizalmat építeni bennünk e változtatások felé. Tudjuk, hogy a pontos JáR csak egy a sok tényező közül, amelyek hatással vannak a meccsminőségre, és mint minden változtatásnál e területen, érdeklődve várjuk a visszajelzéseteket.",
  "new_frontiers_matchmaking_immortals_title": "Halhatatlan játékkeresés",
  "new_frontiers_matchmaking_immortals_desc": "Halhatatlan rangnál a többi játékos ismerete, a velük való összhang és kellemesen kiegyensúlyozott szerepek választása fontosabb, mint pusztán a JáR. Ezért Halhatatlan szinten újraterveztük a játékkeresést ennek figyelembe vételére.<br><br>A Halhatatlan rangú meccsek többé nem előre összeállított csapatokat fognak használni. Ehelyett két kapitány választhatja ki a többi nyolc játékost az egyes csapatokba, sokkal hatásosabbá téve a csapatokat, mint ha csak a JáR-ra támaszkodva alakítottátok volna ki a felállást. Így aztán, Halhatatlanok, ha vacak a meccsetek, mostantól csak magatokat hibáztathatjátok.",
  "new_frontiers_ui_desc": "Homályosan látsz, és hasogató fájdalmat érzel a karodban? Azt tanácsoljuk, ne törődj vele; csak a tested jelzi ezzel azt, hogy éhes. Defektet kaptál? Hajts tovább a felnin; az is kerek. A lényeg: az életben nagyjából mindent biztonságosan figyelmen kívül lehet hagyni, következmények nélkül.<br><br>Kivéve a Dota életerősávjait. Azok fontosak. Ezért kap ebben a frissítésben hatalmas fejlesztést egy csomó életerőhöz kapcsolódó kezelőfelület információ.",
  "new_frontiers_ui_shields_title": "Életerősáv-védőpajzsok",
  "new_frontiers_ui_shields_desc": "Tudtad, hogy a Dotában vannak pajzsok? Mágikus pajzsok, fizikai pajzsok, fénytelen pajzsok. Mindenféle pajzs! Talán nem vetted észre őket. Vagy jobbára nem törődtél velük. Mert nem lehetett tudni, mennyi pajzzsal kezdtél, sem, hogy mennyi maradt belőle.<br><br>De a bizonytalanság e sötét korszaka ma véget ér. Mostantól mindent látni fogsz. De legalábbis e két dolgot. Még azt is látni fogod, milyen fajta pajzs az. Annak megünneplésére, mennyivel jobbak azok a régi pajzsok ezzel a látványfejlesztéssel, hozzáadtunk egy rakás új képességet, amiben vannak olyanok.<br><br>És át is neveztük őket pajzsról védőpajzsra, hogy ne zavarodj bele, azt gondolva, van egy Vanguard az életerősávodon. Szívesen.",
  "new_frontiers_ui_health_pips_title": "Életerősáv-vonalkák",
  "new_frontiers_ui_health_pips_desc": "Némely egységeknek nincs hagyományos életereje, és bizonyos számú támadás kell az elpusztításukhoz. Mostantól a szokásos találgatás, vagy valami lángelme-szintű fejszámolás helyett egyszerűen rá tudsz nézni az egységre, amit le akarsz gyilkolászni. Hasznos kis vonalkákat fog mutatni, amelyek azt a találatszámot jelzik, amennyit még elvisel, mielőtt elcsoszogna e halandó létből (idézet Hamlet életerősávjáról).",
  "new_frontiers_ui_health_cost_title": "Életerőköltség",
  "new_frontiers_ui_health_cost_desc": "Bár a Dotában a képességek legtöbbje manát fogyaszt, néhányuk helyette életerőt. Mostantól ezek a képességek ténylegesen mutatják a varázslásuk ÉP-költségét. Nem rossz, mi? Igazából őrület, hogy eddig senkinek nem jutott eszébe odatenni. Mindegy, most már ott van.",
  "new_frontiers_gameplay_update_desc": "Hatalmas listányi dolog van felsorolva odafent. Az egyetlen, ami ezt esetleg még jobbá tudná tenni, az [i]két[/i] hatalmas listányi dolog volna, de ugyan hol találnánk... [i]hé, nézzenek oda![/i] Olvass tovább minden egyéb egyensúly-változtatásért, amit ez a frissítés tartogat. Vagy csak ugorj be egyenesen magába a játékba, és játssz. Hidd el, nekünk nem kell magyaráznod, mennyire szórakoztató játékok műszaki kézikönyvét olvasni, de öregem, a velük való játék elég szoros második helyezett. Ez a lista akkor is itt lesz, amikor visszajössz.",
  "new_frontiers_misc_title": "Egyebek",
  "new_frontiers_misc_role_tokens": "Lecsökkentettük az „Összes szerep kiválasztva” meccs elvesztésekor kapott szerepes soros zsetonok számát. Mostantól csak két zsetont kapsz egy vereségért. (A győzelemért továbbra is a teljes négy zseton jár.) E változtatásnak segítenie kellene elsimítani a játékosviselkedést a rangsorolt szerepes meccsek körül, amiknél a zsetonok farmolása néha elsőbbséget élvez a kijelölt szerep hatékony játszásához képest.",
  "new_frontiers_misc_removed_roles": "Eltávolítottuk a Captains Mode-ot a rangsorolt, valamint az All Random és All Random Deathmatchet a rangsorolatlan játékkeresésből. Szinte senki sem játszik e módokkal, és a sorbanállási idő könnyedén meghaladja az egy órát.",
  "new_frontiers_misc_model_editor": "E frissítés eltávolítja a hagyományos modellszerkesztőt. Mostantól minden vdml fájl az új eszközben fog betöltődni, a régi modellek pedig át lesznek konvertálva, amikor először töltöd be azokat az eszközben. Ki fogunk adni egy későbbi frissítést a régi, összeállított formátum betöltés támogatásának eltávolítására, ezért arra bátorítunk minden Műhelyben dolgozót, hogy amint lehet, töltse be és konvertálja a modelljeit az új formátumra, és állítsa össze újból azokat.",
  "new_frontiers_misc_hold_animation": "Eltávolítottuk a támogatást a hagyományos „HoldAnimation” beállításhoz a dinamikus kellékekből. Az egyedi játékokat vagy manuálisan az új „loop mode” beállításra kellene váltani, vagy újból össze kellene állítani a pályáikat ezen tulajdonságok automatikus frissítéséhez.",
  "neutral_item_tier": "[b]%1$s. szintű[/b] semleges tárgy",
  "dota_ability_variable_health": "életerő",
  "dota_ability_variable_mana": "mana",
  "dota_ability_variable_armor": "páncél",
  "dota_ability_variable_damage": "sebzés",
  "dota_ability_variable_str": "erő",
  "dota_ability_variable_int": "intelligencia",
  "dota_ability_variable_agi": "ügyesség",
  "dota_ability_variable_all": "minden tulajdonság",
  "dota_ability_variable_primary_attribute": "elsődleges tulajdonság",
  "dota_ability_variable_attack": "támadási sebesség",
  "dota_ability_variable_hp_regen": "életerő-töltődés",
  "dota_ability_variable_lifesteal": "életlopás",
  "dota_ability_variable_mana_regen": "manatöltődés",
  "dota_ability_variable_mana_regen_aura": "manatöltődés aura",
  "dota_ability_variable_spell_amp": "varázslatsebzés",
  "dota_ability_variable_debuff_amp": "gyengítési időtartam",
  "dota_ability_variable_move_speed": "mozgási sebesség",
  "dota_ability_variable_evasion": "kitérés",
  "dota_ability_variable_spell_resist": "mágiaellenállás",
  "dota_ability_variable_spell_lifesteal": "varázslat-életlopás",
  "dota_ability_variable_spell_lifesteal_creep": "varázslat-életlopás (creepen)",
  "dota_ability_variable_spell_lifesteal_hero": "varázslat-életlopás (hősön)",
  "dota_ability_variable_selected_attrib": "kiválasztott tulajdonság",
  "dota_ability_variable_attack_range": "harctáv <font color='#7d7d7d'>(csak távolsági)</font>",
  "dota_ability_variable_attack_range_melee": "harctáv <font color='#7d7d7d'>(csak közelharci)</font>",
  "dota_ability_variable_cast_range": "varázslási távolság",
  "dota_ability_variable_status_resist": "hatásellenállás",
  "dota_ability_variable_projectile_speed": "lövedéksebesség",
  "dota_ability_variable_manacost_reduction": "manaköltség-csökkentés",
  "dota_ability_variable_cooldown_reduction": "újratöltődés-csökkentés",
  "dota_ability_variable_max_mana_percentage": "max. mana bónusz",
  "dota_ability_variable_aoe_bonus": "hatóterület-bónusz"
}