// 8034.js

{
  "language": "italian",
  "new_frontiers_gameplay_number": "Aggiornamento 7.33",
  "new_frontiers_title": "Aggiornamento \"Nuove frontiere\"",
  "new_frontiers_title_short": "Nuove frontiere",
  "new_frontiers_subtitle": "Una nuova mappa, grandi cambiamenti al gameplay e altro ancora. Un mondo tutto nuovo da esplorare.",
  "new_frontiers_play_trailer": "Guarda il trailer",
  "new_frontiers_dota_team_intro": "L'aggiornamento \"Nuove frontiere\" include una nuova mappa, grandi modifiche al gameplay, cambiamenti al sistema di matchmaking, modifiche all'interfaccia utente e tanto altro.<br><br>Cosa intendiamo per tanto? Talmente tanto che è diventato difficile ricordarsi tutto e siamo andati in panico per diversi giorni finché non ci è venuta la brillante idea di scriverci le modifiche. Detto fatto: ora possiamo leggerle in qualsiasi momento e anche tu puoi approfittarne! Scorri in basso per scoprire le novità.",
  "new_frontiers_eldor_name": "Il mago Eldor",
  "new_frontiers_dota_team_name": "Il team di Dota",
  "new_frontiers_section_title_map": "Nuova mappa",
  "new_frontiers_section_title_major_gameplay": "Grandi cambiamenti al gameplay",
  "new_frontiers_section_title_matchmaking": "Matchmaking",
  "new_frontiers_section_title_ui": "Interfaccia",
  "new_frontiers_section_title_gameplay_update": "Modifiche di bilanciamento",
  "new_frontiers_map_introduction": "La mappa di Dota è stata enormemente ampliata. L'obiettivo principale del gioco rimane lo stesso: la distanza tra le corsie non è cambiata e tutto il necessario per vincere una partita si trova ancora al centro della mappa.<br><br>Ma con il 40% di terreno in più, c'è parecchio spazio per raccogliere nuove risorse e scoprire nuove strategie. Entrambe le giungle principali sono state completamente riconfigurate, cambiando i punti di posizionamento dei Guardiani, i percorsi di fuga, il farming e altro ancora.",
  "new_frontiers_map_subtitle": "Esplora un mondo nuovo",
  "new_frontiers_map_roshan_title": "Le nuove tane di Roshan",
  "new_frontiers_map_roshan_desc": "Roshan ha venduto la sua vecchia tana lungo il fiume e si è approfittato dei nuovi terreni. Ora possiede ben [i]due[/i] fantastiche tane posizionate negli angoli nord-ovest e sud-est della mappa, con una meravigliosa vista sulle Fontane e soltanto a pochi minuti di distanza dai negozi segreti.<br><br>Queste tane devono anche essere vicine a una qualche palestra, perché Roshan non è mai stato così muscoloso. Roshan non lascia più i Frammenti di Aghanim, bensì un Formaggio quando muore per la seconda volta e uno Scettro di Aghanim o un Frammento del Ristoro quando muore per la terza volta, in base alla tana in cui si trova (nord o sud).",
  "new_frontiers_map_twin_gates_title": "Portali gemelli",
  "new_frontiers_map_twin_gates_desc": "Ora due portali collegano gli angoli opposti della mappa nei pressi delle torri nelle Safe Lane, consentendo ai giocatori di teletrasportarsi istantaneamente da un bordo all'altro della mappa.<br><br>Questa è una modifica al gameplay, ma si ripercuote anche sulla storia del gioco. Hai indovinato: ora Dota 2 fa parte in modo non ufficiale dell'universo esteso di Pac-Man.",
  "new_frontiers_map_lotus_pools_title": "Stagni di Loto",
  "new_frontiers_map_lotus_pools_desc": "Ora i giocatori possono trovare degli Stagni di Loto sui lati destro e sinistro della mappa (vicino ai punti in cui le ondate di creep si incontrano). In questi stagni crescono dei frutti in grado di ripristinare la salute e il mana di chi li mangia.<br><br>I giocatori possono accumulare questi frutti e combinarli per creare un frutto più grande e potente. Questo frutto più grande può poi essere combinato in un frutto [i]incredibilmente[/i] grande. Cosa succederà se provi a combinare il frutto [i]incredibilmente[/i] grande? Probabilmente nulla, ma tentar non nuoce.",
  "new_frontiers_map_tormentors_title": "Oppressori",
  "new_frontiers_map_tormentors_desc": "Questi due potenti creep neutrali compaiono accanto a ciascuna base dopo 20 minuti con un carico pieno di Frammenti di Aghanim. Ma c'è un inghippo, ossia che ci sono due inghippi: 1) gli Oppressori sono dotati di megascudi in grado di deviare gran parte del danno che subiscono e 2) diventano più potenti ogni volta che muoiono. Ciò significa che eliminarne uno potrebbe richiedere l'intera squadra.<br><br>La buona notizia è che, proprio come gli orsi che ti ignorano per dilaniare un escursionista, se li lasci in pace, anche loro non ti daranno fastidio.",
  "new_frontiers_map_watchers_title": "Vedette",
  "new_frontiers_map_watchers_desc": "Le Vedette sono come i Terminator dello spionaggio. Sono inarrestabili, non provano dolore e non conoscono la paura, ma sono delle inguaribili pigrone: inizieranno a fare il proprio dovere di vedetta soltanto quando ci cliccherai sopra.<br><br>Le Vedette sono inizialmente inattive e neutrali, ma la loro attivazione consente di ottenere visione dell'area per sette minuti, oppure finché i nemici non le manomettono per disattivarle temporaneamente. Quando una squadra uccide Roshan, tutte le Vedette si schiereranno per quella fazione.",
  "new_frontiers_map_barriers_title": "Barriere protettive",
  "new_frontiers_map_barriers_desc": "Le barriere protettive uniscono la vivacità dei contenuti fantasy di Dota con la praticità delle porte di casa tua che chiudi a chiave quando vai al supermercato per distruggere il suo Antico. Si tratta di una \"porta sul retro\" per la tua base con un utile campo di forza che favorisce l'ingresso degli alleati e impedisce al nemico di entrare. Durante un assalto frontale della tua base da parte degli avversari, questa porta consentirà di entrare e uscire a piacimento dal retro.",
  "new_frontiers_map_wisdom_runes_title": "Rune della Saggezza",
  "new_frontiers_map_wisdom_runes_desc": "Ai confini della mappa si nascondono le Rune della Saggezza, che permettono di ricevere un bonus di esperienza agli Eroi abbastanza sapienti da raccoglierne una. Le Rune della Saggezza compaiono vicino alla tua base e offrono un modo facile per impedire che una partita difficoltosa possa sfuggire di mano.",
  "new_frontiers_map_shield_runes_title": "Rune della Protezione",
  "new_frontiers_map_shield_runes_desc": "Anche le Rune del Potere nel fiume si aggiornano con la nuovissima Runa della Protezione, in grado di convertire il 50% della tua salute massima in una barriera. Buttati all'attacco di una torre nelle prime fasi della partita o sali su una collina senza visibilità per sorprendere sia te stesso che la squadra nemica.",
  "new_frontiers_map_named_regions_title": "Regioni specifiche",
  "new_frontiers_map_named_regions_desc": "La nuova mappa include regioni distinte come le Miniere, il Pozzo, il Cimitero e la Statua, facilitando ulteriormente la comunicazione con i tuoi compagni di squadra a cui vuoi dire esattamente dove ti stanno uccidendo. Tutte le Unità in queste regioni ottengono alcuni modificatori a tema.",
  "new_frontiers_map_creep_camps_title": "12 nuovi campi dei creep",
  "new_frontiers_map_creep_camps_desc": "Alcuni dei creep si sono stancati di venire massacrati senza sosta nella giungla e hanno quindi allestito 12 nuovi campi sparsi in tutta la mappa ampliata. Ora potranno venire massacrati anche lì.",
  "new_frontiers_map_outpost_title": "Nuovi Avamposti",
  "new_frontiers_map_outpost_desc": "Ora la mappa include due nuovi Avamposti. Gli Avamposti originali sono stati posizionati altrove, il che porterà a chiedersi se si tratti davvero degli Avamposti originali. Non provateci, amanti di Socrate: sì, lo sono.",
  "new_frontiers_major_gameplay_features_desc": "L'aggiornamento \"Nuove frontiere\" introduce modifiche importanti ai tuoi Eroi e sistemi preferiti. Il nostro ufficio legale ci ha consigliato di dire che questa sezione dedicata al gameplay è [i]talmente ricolma[/i] di nuove funzionalità che impattano sul metagioco da richiedere una lettura lenta nel corso di alcune settimane. Questo serve per evitare una stimolazione eccessiva che potrebbe richiedere l'intervento dei pompieri.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Eroi in evidenza",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Anche se tutti gli Eroi sono stati bilanciati, alcuni sono stati bilanciati più di altri. Di seguito ne riportiamo alcuni.",
  "new_frontiers_major_gameplay_new_items_title": "Nuovi oggetti",
  "new_frontiers_major_gameplay_new_items_desc": "Per tutte le tue esigenze.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Nuovi oggetti neutrali",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Abbiamo aggiunto sette nuovissimi oggetti neutrali e ne abbiamo reintrodotti altri che erano stati rimossi.",
  "new_frontiers_major_gameplay_bkb_title": "Nuovo Bastone del Re Nero",
  "new_frontiers_major_gameplay_bkb_desc": "Ora l'attivazione del Bastone del Re Nero applica una dissipazione di base e rende immuni agli effetti negativi con il 50% di resistenza alla magia. Mentre è attivo, tutti gli effetti negativi vengono neutralizzati e sarai immune al danno puro e riflesso.<br><br>Ma fai attenzione: se l'effetto del Bastone del Re Nero scompare prima degli effetti negativi, questi verranno applicati per la durata restante. Ora gli effetti che ignorano l'immunità alla magia ignorano anche l'immunità agli effetti negativi.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Nuovo tipo di Eroe",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Void Spirit, il quarto fratello spirito che abbiamo rilasciato, non sarebbe dovuto essere un Eroe di Forza, Agilità o Intelligenza, ma un tipo di Eroe tutto nuovo per potersi distinguere al meglio. Un [i]quarto[/i] tipo di Eroe.<br><br>Ti presentiamo gli Eroi Universali, un nuovo gruppo composto da Eroi già esistenti il cui danno aumenta di 0,6 per ogni punto in qualsiasi attributo. I nostri ingegneri ci assicurano che questo numero è perfettamente bilanciato... almeno fino a prova contraria. La buona notizia è che lo scopriremo tutti insieme durante la grande avventura dell'aggiornamento \"Nuove frontiere\".",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Nuova modalità per ottenere gli oggetti neutrali",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "In precedenza, uccidere le creature della foresta significava entrare in possesso di un nuovo oggetto neutrale... solitamente destinato al Carry della squadra, che solitamente non eri tu. Uccidendo un creep neutrale, ora avrai la possibilità di ottenere un gettone con cui potrai scegliere tra [i]cinque[/i] oggetti neutrali. I gettoni offrono sempre cinque opzioni diverse, quindi non serve affrettarsi per usarli prima degli altri.<br><br>I giocatori possono cedere i gettoni a chiunque altro, ma una volta selezionato un oggetto, questo non sarà condivisibile.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Potenziamento dei creep neutrali",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Ora i creep neutrali e le rispettive abilità migliorano con il passare del tempo. Sì, più tempo passa e più sarà difficile fare piazza pulita nei campi dei neutrali, ma gli Eroi con l'abilità di controllare i creep potranno farsi dei compagni molto potenti.",
  "new_frontiers_major_gameplay_kill_formula_title": "Nuova formula per la ricompensa delle uccisioni",
  "new_frontiers_major_gameplay_kill_formula_desc": "Abbiamo modificato la formula per calcolare la ricompensa in oro delle uccisioni, con l'obiettivo di rendere più incisive le uccisioni nelle prime fasi della partita e di motivare i giocatori a prendere d'assalto le altre corsie. Abbiamo anche ridotto l'aumento progressivo della ricompensa in oro per l'uccisione dei creep di corsia, rendendone il farming meno conveniente con il passare del tempo ed incoraggiando i giocatori a scontrarsi l'uno con l'altro.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Mantieni il controllo",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Se anche tu sei dell'idea che poter usare il tuo Eroe è sempre più divertente che non poter usare il tuo Eroe, abbiamo un'ottima notizia per te: preparati ad usare il tuo Eroe come mai prima d'ora.<br><br>In che modo? Facile: abbiamo ridotto la durata di quasi tutte le disabilitazioni nel gioco. Come ci è venuta questa idea malsana? Presto detto: ci siamo scontrati con un Ruggito primitivo di Beastmaster e improvvisamente abbiamo avuto moltissimo tempo per pensare.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Dopo due mesi passati a infestare le corsie, Muerta ha finalmente trovato il suo Scettro e il suo Frammento di Aghanim. Se devi ancora scoprirla, consulta la pagina dell'[url=https://www.dota2.com/deadreckoning]aggiornamento del Giudizio Mortale[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi è troppo sciocco per essere un Eroe di Intelligenza, quindi ora non lo è più.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Ora la potenza di Medusa a inizio partita è simile a quella di un bambino. Proprio come un bambino, però, anche lei diventa più forte con il passare del tempo.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Ora gran parte delle abilità di Clinkz, proprio come le scelte sbagliate nella vita vera, possono creare degli scheletri (nell'armadio).",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden era solito creare un clone perfetto di se stesso. Ora riesce a produrre una versione [i]migliore[/i] di se stesso! Oppure peggiore? In ogni caso, è diverso. E sicuramente non controverso, ci contiamo.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Ora l'Eroe Alchemist è avido per natura, proprio come tutti i giocatori che lo usano in partita.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "EFFETTO LIMITATO PER ARC WARDEN",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Soltanto per un periodo limitato, scegliendo Arc Warden nella squadra dei Dire, il clone di Tempesta Doppia sarà l'Eroe principale e l'utilizzo della Ultimate evocherà la versione \"normale\" di se stesso.",
  "new_frontiers_matchmaking_desc": "Siamo sinceri: sul pianeta ci sono 8 miliardi di persone e il 99,99% di loro non sa giocare a Dota. Questo significa che il matchmaking può rivelarsi complicato, soprattutto se sei un bravo giocatore di Dota e ti piace giocare con persone del tuo stesso calibro (preferibilmente di un calibro leggermente inferiore). Abbiamo fatto qualche calcolo matematico e ci siamo impegnati per migliorare la qualità complessiva del matchmaking per i giocatori di tutti i livelli di abilità.",
  "new_frontiers_matchmaking_intro_title": "Matchmaking più accurato",
  "new_frontiers_matchmaking_intro_desc": "Il livello di abilità (MMR) si compone di due semplici numeri, uno per il grado e uno per il livello di confidenza. Il grado è una stima delle tue abilità, mentre il livello di confidenza indica quanto siamo sicuri di tale stima. Quando giochi una partita, il tuo grado viene modificato in base al risultato e, poiché i dati a nostra disposizione sono aumentati, anche il livello di confidenza salirà di conseguenza.",
  "new_frontiers_matchmaking_details_old_title": "I problemi del vecchio algoritmo",
  "new_frontiers_matchmaking_details_old_desc": "Dota utilizza da sempre una versione modificata dell'algoritmo Elo per implementare le modifiche al grado e al livello di confidenza. Ci siamo però accorti con il passare del tempo di alcuni problemi in questo approccio. Ad esempio, la distribuzione del livello di abilità (MMR) ha iniziato gradualmente a tendere verso il basso, provocando un raggruppamento indesiderato nell'intervallo di MMR da 0 a 1000. Inoltre, l'algoritmo faceva parecchia fatica a ricalcolare l'MMR dei giocatori che tornavano su Dota dopo un periodo di pausa prolungato, poiché il loro livello di abilità precedente non era più valido.",
  "new_frontiers_matchmaking_details_new_title": "Il nuovo algoritmo migliorato",
  "new_frontiers_matchmaking_details_new_desc": "Per risolvere questi problemi, abbiamo deciso di ricorrere a un nuovo algoritmo chiamato Glicko che ti abbinerà in modo rapido e preciso ad altri giocatori con un livello di abilità simile. Matematicamente parlando, Glicko ci consente di considerare meglio il livello di confidenza di un giocatore nei nostri calcoli, portando a decisioni più accurate in merito a guadagno e perdita di MMR.\\n\\nIl passaggio al nostro nuovo sistema di matchmaking sembrerà un po' come l'inizio di una nuova stagione competitiva: [list][*]Tutti i giocatori dovranno sottoporsi a una breve calibrazione, inizialmente basata sul grado precedente.\\n[*]La calibrazione non richiede più un certo numero di partite. Ora un giocatore può completare la calibrazione soltanto quando il livello di confidenza è superiore a una certa soglia.\\n[*]A calibrazione avvenuta, è probabile che ti venga assegnata una medaglia diversa da quella che avevi in precedenza. Tuttavia, anche se il tuo grado cambia notevolmente, dovresti comunque essere abbinato con giocatori di livello simile.\\n[*]Le partite non avranno più un valore fisso di guadagno/perdita di MMR. Questo numero varierà in base a diversi fattori, tra cui il grado e il livello di confidenza dei partecipanti. Ogni partita, però, ha un limite massimo di guadagno/perdita di MMR per prevenire risultati particolarmente negativi.\\n[*]Il livello di confidenza di un giocatore decrescerà lentamente col passare del tempo se il giocatore non partecipa a nessuna partita.[/list]\\nÈ da un po' di tempo che usiamo contemporaneamente entrambi i sistemi di matchmaking per testare l'efficacia di queste modifiche. Abbiamo compreso che un MMR accurato è soltanto uno dei tanti fattori che impattano sulla qualità di una partita, e come tutte le modifiche in questo ambito, siamo interessati a scoprire cosa ne pensano i giocatori.",
  "new_frontiers_matchmaking_immortals_title": "Matchmaking Immortale",
  "new_frontiers_matchmaking_immortals_desc": "Per un giocatore di grado Immortale, conoscere gli altri giocatori, comunicare con loro e scegliere un buon bilanciamento dei ruoli è ancora più importante dell'MMR. Abbiamo quindi modificato l'esperienza di matchmaking del grado Immortale per soddisfare queste esigenze.<br><br>Le partite dei giocatori di grado Immortale non saranno più composte da squadre predefinite. Ora saranno due capitani a dover scegliere i restanti otto giocatori, affinché le squadre possano avere un impatto maggiore rispetto a quando venivano create soltanto in base all'MMR. Quindi, cari giocatori Immortali, se una partita non vi va a genio, adesso la colpa è solo vostra.",
  "new_frontiers_ui_desc": "Visione offuscata e dolore lancinante al braccio? È solo il nostro corpo che ci comunica di essere a corto di cibo, quindi il nostro consiglio è di ignorare questi sintomi. Hai bucato una ruota? Non preoccupartene e continua a guidare. Il punto è che praticamente tutto nella vita può essere ignorato senza alcuna conseguenza.<br><br>Le barre della salute di Dota fanno eccezione. Data la loro estrema importanza, questo aggiornamento migliora notevolmente le informazioni sull'interfaccia relative alla salute.",
  "new_frontiers_ui_shields_title": "Barriere sulla barra della salute",
  "new_frontiers_ui_shields_desc": "Sapevi che su Dota esistono gli scudi? Scudi magici, fisici, afotici... Chi più ne ha più ne metta! Forse te li sei persi, o magari li hai semplicemente ignorati. Questo perché non c'era modo di sapere quanto scudo avevi inizialmente e quanto ne rimaneva.<br><br>Quel buio periodo di incertezza è finalmente giunto al termine. Ora puoi vedere tutto, o quantomeno le due cose citate sopra e il tipo di scudo attivato. Per festeggiare i miglioramenti visivi di quei vecchi scudi, abbiamo aggiunto qualche nuova abilità che li utilizza.<br><br>Inoltre, adesso gli scudi si chiamano \"barriere\", giusto per evitare qualsiasi tipo di confusione. Prego!",
  "new_frontiers_ui_health_pips_title": "Barre della salute segmentate",
  "new_frontiers_ui_health_pips_desc": "Alcune Unità non usano i classici punti salute e la loro uccisione richiede un certo numero di attacchi. Adesso, invece di contare a mente o tirare a indovinare, basterà semplicemente guardare l'Unità che vuoi eliminare. La rispettiva barra della salute sarà suddivisa in segmenti che rappresentano il numero di attacchi ancora necessari prima che \"tra gli spenti ad abitar sen giva\" (citazione della barra della salute di Leopardi).",
  "new_frontiers_ui_health_cost_title": "Costo in salute",
  "new_frontiers_ui_health_cost_desc": "Nonostante la maggior parte delle abilità di Dota consumino mana, alcune invece consumano salute. Ora queste abilità mostrano il costo effettivo in punti salute per il lancio. Niente male, vero? In effetti è incredibile che nessuno ci abbia pensato finora. In ogni caso, ora c'è.",
  "new_frontiers_gameplay_update_desc": "Finora abbiamo letto una lista infinita di modifiche. L'unica cosa che può migliorare la giornata è una [i]seconda[/i] lista infinita di modifiche, ma dove potremmo mai... [i]Un attimo, e questa cos'è?![/i] Continua a leggere per scoprire tutte le altre modifiche di bilanciamento introdotte con questo aggiornamento. In alternativa, puoi sempre tuffarti in partita e iniziare a giocare. Non serve che tu ci dica quanto sia divertente leggere i manuali tecnici dei videogiochi, ma giocarci effettivamente è quasi altrettanto bello. Questa lista rimarrà qui dov'è anche più tardi.",
  "new_frontiers_misc_title": "Varie",
  "new_frontiers_misc_role_tokens": "Abbiamo ridotto il numero di partite con ruoli ottenibili dopo una sconfitta nelle partite con \"tutti i ruoli selezionati\". Ora otterrai due partite dopo una sconfitta e quattro dopo una vittoria. Questa modifica dovrebbe aiutare a correggere il comportamento dei giocatori nelle partite classificate con ruoli, in cui talvolta guadagnare altre partite era più importante di impegnarsi a giocare con il ruolo assegnato.",
  "new_frontiers_misc_removed_roles": "Abbiamo rimosso la modalità Captains Mode dal matchmaking classificato e le modalità All Random e All Random Deathmatch dal matchmaking non classificato. Quasi nessuno giocava a queste modalità e la creazione delle partite richiedeva più di un'ora.",
  "new_frontiers_misc_model_editor": "Questo aggiornamento rimuove il vecchio editor dei modelli. Ora tutti i file VMDL possono essere caricati nel nuovo strumento e i vecchi modelli saranno convertiti alla prima apertura. Rilasceremo un aggiornamento successivo per rimuovere completamente la compatibilità con il vecchio formato compilato, quindi invitiamo tutti gli autori del Workshop a convertire i propri modelli nel nuovo formato e ricompilarli al più presto.",
  "new_frontiers_misc_hold_animation": "Abbiamo rimosso la compatibilità con la vecchia chiave \"HoldAnimation\" delle proprietà dinamiche. Le modalità di gioco personalizzate devono passare manualmente alla nuova chiave \"loop mode\" o ricompilare le rispettive mappe per aggiornare automaticamente tali proprietà.",
  "neutral_item_tier": "Oggetto neutrale di [b]grado %1$s[/b]",
  "dota_ability_variable_health": "di salute",
  "dota_ability_variable_mana": "di mana",
  "dota_ability_variable_armor": "di armatura",
  "dota_ability_variable_damage": "di danno",
  "dota_ability_variable_str": "di Forza",
  "dota_ability_variable_int": "di Intelligenza",
  "dota_ability_variable_agi": "di Agilità",
  "dota_ability_variable_all": "a tutti gli attributi",
  "dota_ability_variable_primary_attribute": "all'attributo primario",
  "dota_ability_variable_attack": "di velocità d'attacco",
  "dota_ability_variable_hp_regen": "di rigenerazione della salute",
  "dota_ability_variable_lifesteal": "di prosciugamento della salute",
  "dota_ability_variable_mana_regen": "di rigenerazione del mana",
  "dota_ability_variable_mana_regen_aura": "di rigenerazione del mana (aura)",
  "dota_ability_variable_spell_amp": "di danno degli incantesimi",
  "dota_ability_variable_debuff_amp": "di durata degli effetti negativi",
  "dota_ability_variable_move_speed": "di velocità di movimento",
  "dota_ability_variable_evasion": "di elusività",
  "dota_ability_variable_spell_resist": "di resistenza alla magia",
  "dota_ability_variable_spell_lifesteal": "di prosciugamento della salute dagli incantesimi",
  "dota_ability_variable_spell_lifesteal_creep": "di prosciugamento della salute dagli incantesimi (creep)",
  "dota_ability_variable_spell_lifesteal_hero": "di prosciugamento della salute dagli incantesimi (Eroi)",
  "dota_ability_variable_selected_attrib": "all'attributo selezionato",
  "dota_ability_variable_attack_range": "di gittata d'attacco <font color='#7d7d7d'>(solo Eroi a distanza)</font>",
  "dota_ability_variable_attack_range_melee": "di gittata d'attacco <font color='#7d7d7d'>(solo Eroi da mischia)</font>",
  "dota_ability_variable_cast_range": "di gittata di lancio",
  "dota_ability_variable_status_resist": "di resistenza agli stati alterati",
  "dota_ability_variable_projectile_speed": "di velocità dei proiettili",
  "dota_ability_variable_manacost_reduction": "di riduzione dei costi in mana",
  "dota_ability_variable_cooldown_reduction": "di riduzione dei tempi di ricarica",
  "dota_ability_variable_max_mana_percentage": "di mana massimo aggiuntivo"
}