// 5732.js

{
  "language": "turkish",
  "new_frontiers_gameplay_number": "OYNANIŞ GÜNCELLEMESİ 7.33",
  "new_frontiers_title": "Yeni Sınırlar Güncellemesi",
  "new_frontiers_title_short": "YENİ SINIRLAR",
  "new_frontiers_subtitle": "Yeni bir harita, büyük oynanış değişiklikleri ve çok daha fazlası. Keşfedebileceğiniz bir dünya yenilik bu güncellemede.",
  "new_frontiers_play_trailer": "FRAGMANI İZLE",
  "new_frontiers_dota_team_intro": "Yeni Sınırlar Güncellemesi, yeni bir haritanın yanı sıra büyük oynanış, eşleştirme, kullanıcı arayüzü değişikliklerini ve (şaka yapmıyoruz) çok daha fazlasını beraberinde getiriyor.<br><br>Ne kadar mı fazla? O kadar fazla ki aslında hepsini hatırlamak çok zorlaştı ve birkaç gün boyunca panik yapmaya başladık. Neyse ki biri bunları yazabileceğimizi hatırlattı, biz de öyle yaptık. Artık istediğimiz zaman okuyabiliriz. Siz de okuyabilirsiniz! Devam etmek için kaydırmaya başlayabilirsiniz.",
  "new_frontiers_eldor_name": "Büyücü Eldor",
  "new_frontiers_dota_team_name": "Dota Ekibi",
  "new_frontiers_section_title_map": "YENİ HARİTA",
  "new_frontiers_section_title_major_gameplay": "BÜYÜK OYNANIŞ DEĞİŞİKLİKLERİ",
  "new_frontiers_section_title_matchmaking": "EŞLEŞTİRME",
  "new_frontiers_section_title_ui": "Kullanıcı Arayüzü",
  "new_frontiers_section_title_gameplay_update": "DENGE DEĞİŞİKLİKLERİ",
  "new_frontiers_map_introduction": "Dota haritası çok büyüdü. Oyunun ana amacı değişmedi, kulvarlarınız arasındaki mesafe aynı ve kazanmak için ihtiyacınız olan her şey hâlâ haritanın merkezinde.<br><br>Ancak %40 daha büyük arazi size yeni kaynaklar toplama ve yeni stratejiler geliştirme imkânı sunacak. İki ana orman da tamamen yeniden tasarlandı: Görüş yerleştirme yerlerinde, kaçış rotalarında, yaratık kamplarında ve çok daha fazlasında değişiklik yapıldı.",
  "new_frontiers_map_subtitle": "YENİ DÜNYAYI KEŞFEDİN",
  "new_frontiers_map_roshan_title": "ROSHAN'IN YENİ İNLERİ",
  "new_frontiers_map_roshan_desc": "Roshan nehirdeki eski çukurunu satıp yaptığı yatırımlarla iki yeni in satın aldı. Roshan artık haritanın kuzeybatı ve güneydoğu uçlarında bulunan [i]iki[/i] yeni güzel ine sahip. Bu inler, kaynaklara bakan harika bir manzaraya sahiptir ve Gizli Dükkân'lara çok yakındır.<br><br>Bu inler muhtemelen bir spor salonuna da yakın olmalı zira Roshan çok daha kaslı görünüyor. Ayrıca, Roshan artık Aghanim's Shard düşürmüyor ve artık üçüncü ölümü yerine ikinci ölümünde Peynir düşürüyor. Üçüncü ölümünden sonra, kuzeyde mi yoksa güneyde mi olduğuna bağlı olarak Refresher Shard veya Aghanim's Scepter düşürüyor.",
  "new_frontiers_map_twin_gates_title": "İKİZ GEÇİT",
  "new_frontiers_map_twin_gates_desc": "Güvenli kulvardaki kulelerinin yanında artık iki geçit bulunuyor ve haritanın köşelerini birbirine bağlayarak oyuncuların haritanın bir ucundan diğerine anında ışınlanmasına olanak tanıyor.<br><br>Bu bir oynanış güncellemesidir ancak oyun hikâyesi için bariz etkileri de vardır. Doğru tahmin ettiniz: Dota 2 artık gayri resmî olarak PMGE'de (Pac-Man Genişletilmiş Evreni) yer alıyor.",
  "new_frontiers_map_lotus_pools_title": "NİLÜFER HAVUZLARI",
  "new_frontiers_map_lotus_pools_desc": "Nilüfer havuzları, haritanın sol ve sağ taraflarına, yaratık dalgalarının ilk karşılaştığı yerin yakınına yerleştirildi. Bu havuzlar aralıklarla yenildiğinde can ve mana veren meyveler üretir.<br><br>Bu meyveler istiflenebilir ve oyun ilerledikçe daha büyük ve değerli bir hâl alacak şekilde birleştirilebilir. Bu birleştirilmiş hâlleri de [i]devasa[/i] bir meyve olacak şekilde birleştirilebilir. Peki bu [i]devasa[/i] meyveyi birleştirirseniz ne olur? Muhtemelen hiçbir şey. (Kesinlikle bir şey olur.)",
  "new_frontiers_map_tormentors_title": "İŞKENCECİLER",
  "new_frontiers_map_tormentors_desc": "Bu iki güçlü tarafsız yaratık, oyun başladıktan 20 dakika sonra her üssün yakınında ortaya çıkar ve karınları Aghanim's Shard ile doludur. Ancak şöyle bir durum var: İşkenceciler, verdiğiniz hasarın çoğunu yansıtan mega kalkanlara sahip olmalarının yanı sıra, her ölümlerinde daha da güçlenirler. Birini öldürmek için muhtemelen tüm takım bir arada olmanız gerekecek.<br><br>Şöyle olumlu bir yanları da var: Siz onlara dokunmadığınız sürece, onlar da size dokunmaz.",
  "new_frontiers_map_watchers_title": "GÖZETLEYİCİLER",
  "new_frontiers_map_watchers_desc": "Gözetleyiciler, Terminatörlerin sadece gözetleyen versiyonları gibidir. Amansızdırlar. Acı hissetmezler. Korku nedir bilmezler. Ama tembeldirler. Üzerlerine tıklayana kadar gözetlemeye başlamazlar.<br><br>Gözetleyiciler oyuna devre dışı ve tarafsız başlar, ancak etkinleştirildiğinde, yedi dakika boyunca veya düşmanlarınız tarafından geçici olarak devre dışı bırakılmak üzere sabote edilene kadar bulundukları alan üzerinde görüş sağlarlar. Bir takım Roshan'ı öldürdüğünde, tüm gözetleyiciler o takımın tarafına geçer.",
  "new_frontiers_map_barriers_title": "SAVUNMA KAPILARI",
  "new_frontiers_map_barriers_desc": "Savunma Kapıları, Dota'nın yüksek fantezi dünyasını evinizin kapılarının pratikliğiyle birleştirir. Artık tıpkı evden markete çıkarken kapınızı kilitlediğiniz gibi Dota'da Kadim Kale'yi yok etmek için çıkarken üssünüzü kilitleyebileceksiniz. Bu güç alanı, takımınızın üyelerinin geçmesine izin veren pratik bir arka kapı görevi görür. Bu kapıdan düşman takım geçemez. Düşman takım üssünüze saldırdığında, arkadan sızmak için burayı kullanabilirsiniz.",
  "new_frontiers_map_wisdom_runes_title": "BİLGELİK RÜNLERİ",
  "new_frontiers_map_wisdom_runes_desc": "Maceraya düşkün kahraman birimlere TP kazandıran bilgelik rünlerini ortaya çıkarmak için haritanın köşelerini keşfedin. Bu rünler üssünüzün yakınında çıkar ve size kaybetmek üzere olduğunuz bir maçın gidişatını değiştirme olanağı sağlar.",
  "new_frontiers_map_shield_runes_title": "KALKAN RÜNLERİ",
  "new_frontiers_map_shield_runes_desc": "Nehrin rünleri arasına sağlam yeni bir rün geliyor: Kalkan rünü. Bu rün maksimum SP'nizin %50'sini size kalkan olarak verir. Bu kalkan sayesinde oyun başlarında leş elde etmek için kendinizi bir düşman kulesinin altına atabilir veya hem kendinizi hem de düşman ekibini şaşırtmak için ne sizin ne de düşmanların görüşü olan bir tepeye çıkabilirsiniz.",
  "new_frontiers_map_named_regions_title": "ADLANDIRILMIŞ BÖLGELER",
  "new_frontiers_map_named_regions_desc": "Genişletilmiş harita artık farklı bölgelere sahip: Madenler, Kuyu, Mezarlık ve Heykel. Takımınıza nerede saldırıya uğradığınızı söylemek artık daha da kolay. Bu bölgelerde bulunan tüm birimler bölge temalı bonuslardan yararlanır.",
  "new_frontiers_map_creep_camps_title": "12 YENİ YARATIK KAMPI",
  "new_frontiers_map_creep_camps_desc": "Bazı yaratıklar, sürekli olarak ormanda katledilmekten artık bıktı ve genişletilmiş haritanın farklı yerlerinde bulunan 12 yeni kampı kurdu. Artık onları kendi kamplarında da katledebilirsiniz.",
  "new_frontiers_map_outpost_title": "YENİ İLERİ KARAKOLLAR",
  "new_frontiers_map_outpost_desc": "Genişletilmiş haritada yeni iki ileri karakol var. Orijinal ileri karakollar yeni konumlara taşındı ve bu da onların gerçekten orijinal ileri karakollar olup olmadığı sorusunu gündeme getirdi. İyi denemeydi Montaigne, onların orijinal olduğundan bir şüphemiz yok.",
  "new_frontiers_major_gameplay_features_desc": "Yeni Sınırlar Güncellemesi, en sevdiğiniz kahramanlar ve sistemlerde büyük değişiklikler içeriyor. Aslında, hukuk departmanımız bize bu oynanış bölümünün metayı etkileyecek şeylerle [i]yoğun bir şekilde dolup taştığını[/i] ve bu nedenle bunları önümüzdeki birkaç hafta boyunca azar azar okumanız gerektiğini söylememizi tavsiye etti; zira öbür türlü aşırı heyecandan alev alıp itfaiyeyi çağırmanız gerekebilir.",
  "new_frontiers_major_gameplay_hero_reworks_title": "ÖNE ÇIKAN KAHRAMANLAR",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Her ne kadar tüm kahramanlar dengelenmiş olsa da bazıları diğerlerine kıyasla daha fazla dengelendi. Bunları da burada öne çıkarmak istedik.",
  "new_frontiers_major_gameplay_new_items_title": "YENİ EŞYALAR",
  "new_frontiers_major_gameplay_new_items_desc": "İhtiyacınız olabilecek her şey.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "YENİ TARAFSIZ EŞYALAR",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Yedi yeni tarafsız eşyayı oyuna ekledik ve bazı eski favorileri geri getirdik.",
  "new_frontiers_major_gameplay_bkb_title": "BLACK KING BAR DEĞİŞTİ",
  "new_frontiers_major_gameplay_bkb_desc": "Black King Bar etkinleştirildiğinde artık basit etki geçirme uyguluyacak, ayrıca %50 büyü direnci ve zayıflatmalara karşı bağışıklık sağlayacak. Etkin olduğu süre boyunca, zayıflatmaların negatif etkileri sizi etkilemez. Bunun dışında saf ve yansıyan hasara karşı da bağışıklık kazanırsınız.<br><br>Ancak dikkatli olun: Black King Bar'ın etkisi, herhangi bir zayıflatmadan önce sona ererse, bu zayıflatmalar kalan süreleri boyunca uygulanır. Büyü bağışıklığını delen durumlar artık zayıflatma bağışıklığını da delecek.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "YENİ KAHRAMAN ÖZELLİK TÜRÜ",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Oyuna eklediğimiz dördüncü ruh kardeşi olan Void Spirit aslında kuvvet, çeviklik veya zekâ özellikleri bazlı bir kahraman olmamalıydı. Diğer kahramanlarından ayrılmak için farklı ve yeni bir kahraman olmalıydı. [i]Dördüncü[/i] bir tür kahraman.<br><br>Evrensel kahramanlarla tanışın. Mevcut kahramanların oluşturduğu bu yeni ana özellik grubundaki kahramanlar sahip oldukları her özellik puanından 0,6 hasar kazanır. Mühendislerimiz, bu sayının mükemmel bir şekilde dengeli olduğundan emin... Ancak oyun içinde işler değişebilir. Fakat iyi haber şu ki, Yeni Sınırlar Güncellemesi'nde hepimiz bu sayının ne kadar dengeli olduğunu oynarken göreceğiz.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "TARAFSIZ EŞYA DÜŞMESİ DEĞİŞTİ",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Eskiden, ormandaki yaratıkları öldürdüğünüzde genellikle harika bir tarafsız eşya elde ediyordunuz... Ve bu eşya genellikle takımın çoğu zaman siz olmayan sırtlayıcısına gidiyordu. Artık tarafsız yaratıkları öldürdüğünüzde üstlerinden rastgele olarak bir jeton düşebilecek. Bir jeton elde ettiğinizde de bunu [i]beş[/i] tarafsız eşya arasından seçim yapmak için kullanabileceksiniz. Her jeton, beş eşya seçeneği sunar, bu nedenle jetonunu kullanan son kişi bile gerçekten istediği bir şeyi seçebilecek.<br><br>Jetonlar istenildiği gibi paylaşılabilir, ancak jetonla elde edilen bir eşya paylaşılamaz. Bu yüzden jetonlarınızı akıllıca dağıtın!",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "TARAFSIZ YARATIK GELİŞİMİ",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Tarafsız yaratıklar ve yetenekleri artık zamanla gelişmektedir. Evet, kampları temizlemek oyunun ilerleyen dakikalarında daha zor olacak; ancak yaratıkları kontrol etme yeteneğine sahip kahramanlar ciddi bir desteğe sahip olacak.",
  "new_frontiers_major_gameplay_kill_formula_title": "ÖLDÜRME FORMÜLÜ DEĞİŞTİ",
  "new_frontiers_major_gameplay_kill_formula_desc": "Öldürme formülünü, oyunun başlarındaki leşlerin etkisini artırmak ve oyuncuları diğer kulvarlara saldırmaya motive etmek için değiştirdik. Ek olarak, oyun ilerledikçe yaratık keserek altın kasmayı daha az kârlı hale getirmek ve bunun yerine altın elde etmek için takım savaşlarını teşvik etmek için yaratık altın ödülü ölçeklemesini düşürdük.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "SERSEMLETMEYEN YENİ ÖZELLİK",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Kahramanınızı oynamak, kahramanınızı oynamamaktan her zaman daha eğlencelidir. Artık bir şeyler oynama hayranlarının ve bir şeyler oynamamayı eleştirenlerin hayalleri gerçek oldu: Kahramanınızı her zamankinden daha fazla oynamaya hazırlanın.<br><br>Nasıl mı? Kolay. Oyundaki neredeyse her devre dışı bırakmanın süresini azalttık. Bu çılgın plan nasıl mı aklımıza geldi? Daha da kolay. Yüzümüze Beastmaster'ın Roar yeteneğini yedik ve birdenbire düşünecek çok zamanımız oldu.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Kulvarlara dadanmasının üzerinden geçen iki aydan sonra Muerta artık Aghanim's Scepter ve Shard'ını buldu. Henüz bakmadıysanız, daha fazla bilgiye [url=https://www.dota2.com/deadreckoning]Ölülerin İntikamı Güncellemesi[/url] sayfasından ulaşabilirsiniz.",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi, bir zekâ kahramanı olmak için çok aptaldı. O yüzden artık bir zekâ kahramanı değil.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa artık bir bebek gibi savunmasız başlayacak ama tıpkı bebeklerde de olduğu gibi zamanla güçlenecek.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Clinkz'in birçok yeteneği, hayattaki diğer birçok en iyi yetenek gibi, iskelet çıkaracak.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden önceden kendisinin mükemmel bir kopyasını yaratıyordu. Ancak artık kendisinin [i]daha iyi[/i] bir hâlini yaratacak! Ya da daha kötü! Her iki şekilde de, ortada bir değişiklik olduğu baki. Ve bu değişikliğin pek polemiğe neden olacağını da sanmıyoruz.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Alchemist, tıpkı onu oynayan Alchemist oyuncuları gibi doğuştan açgözlü.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ARC WARDEN İÇİN SINIRLI SÜRELİ BONUS",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Sınırlı bir süreliğine, Dire tarafında oynarken Arc Warden'ı seçtiğinizde ana kahramanınız Tempest Double olacak ve son yeteneği olan Ultimate'ı kullandığınızda \"normal\" hâlini çağıracak.",
  "new_frontiers_matchmaking_desc": "Biraz dürüst olalım: Gezegende sekiz milyar insan var ve bunların %99,99'u kesinlikle Dota'da çok kötü ve bu da eşleştirme işini karmaşık bir hâle getiriyor. Özellikle de Dota'da iyiyseniz ve sizin kadar iyi olmasa da neredeyse sizin kadar iyi olan insanlarla oynamak istersiniz. Çeşitli değişiklikler ve matematiksel formüller aracılığıyla, her seviyeden oyuncu için eşleştirme sistemimizin kalitesini iyileştirdik.",
  "new_frontiers_matchmaking_intro_title": "GÜVENLE EŞLEŞİN",
  "new_frontiers_matchmaking_intro_desc": "Eşleştirme derecesi (ED) genellikle iki değerden ibarettir: Derece ve o derece için güven endeksi. Dereceniz, yeteneğinizin sayısal dengidir, güven endeksiniz ise bu denklikten emin olma değerimizdir. Bir maç oynadığınızda, derecenizi galibiyet ve mağlubiyet elde etmeniz durumuna göre değiştiririz. Güven endeksiniz de elimizde daha fazla veri olduğu için yükselmiş olur.",
  "new_frontiers_matchmaking_details_old_title": "İSTENMEYEN GRUPLANDIRMA: EN KÖTÜ GRUPLANDIRMA TÜRÜ",
  "new_frontiers_matchmaking_details_old_desc": "Dota geçmişte, dereceleri ve güven endeksi değişikliklerini ayarlamak için Elo algoritmasının değiştirilmiş bir sürümünü kullanmıştır. Ancak zamanla, bu yaklaşımla ilgili bazı sorunlar olduğunu fark ettik. Örneğin, ED'lerin dağılımı zamanla azalarak oyuncuların 0 -1000 MMR aralığında istenmeyen bir şekilde gruplandırılması gibi istenmeyen bir etkiye sahip oldu. Başka bir sorun da ara veren ve eski dereceleri artık onları temsil etmeyen oyuncuların oyuna döndüklerinde doğru ED seviyelerine ulaşmakta yaşadıkları güçlüklerdi.",
  "new_frontiers_matchmaking_details_new_title": "YENİ VE GELİŞMİŞ GRUPLANDIRMA",
  "new_frontiers_matchmaking_details_new_desc": "Bu sorunları çözmek için, benzer seviyedeki insanlarla doğru ve hızlı bir şekilde eşleşmenize izin verecek başka bir algoritma olan Glicko'yu kullanacağız. İşin matematik kısmına bakacak olursak Glicko, bir oyuncunun derece güven endeksini hesaplamalarımıza daha iyi bir şekilde katmamıza olanak sağlayarak, derece kazanma ve kaybetme durumlarına dair daha doğru kararlar vermemize olanak sağlayacak.\\n\\nYeni eşleştirme sistemimize yapacağımız geçiş, yeni bir eşleştirme sezonunun başı gibi hissettirecek: [list][*]Her oyuncu kısa bir ölçümleme moduna sokulacak. Bu ölçümleme oyuncunun bir önceki derecesine dayanacak. \\n[*]Ölçümleme artık sabit sayıda maça karşılık gelmiyor. Bunun yerine ölçümleme, bir oyunucunun derece güven endeksi belirli bir eşiğe ulaştığında sona erecek. \\n[*]Ölçümleme sonunda muhtemelen daha önce sahip olduğunuzdan farklı bir madalya alacaksınız. Ancak madalyanız önemli ölçüde değişse bile benzer yetenek seviyesindeki oyuncularla eşleşeceksiniz. \\n[*]Maçlardaki ED kazancı veya kaybı artık sabit olmayacak. Bunun yerine, oyundaki kişilerin dereceleri ve derece güven endeksleri dâhil olmak üzere bir dizi faktöre bağlı olacak. Ancak, özellikle olumsuz sonuçlardan kaçınmak için maç başına kazanılan veya kaybedilen ED puanlarının bir sınırı olacak.[*]Maç yapmayan oyuncuların güven endeksi zamanla azalacak.[/list] Her iki eşleştirme sistemi de bu değişiklikleri değerlendirmek için bir süredir arka planda kullanılıyordu. Doğru ED'nin kaliteli oyunlara katkıda bulunan birçok faktörden sadece biri olduğunun farkındayız ve bu alanda yaptığımız tüm değişikliklerde olduğu gibi geri bildirimlerinizi duymak için can atıyoruz.",
  "new_frontiers_matchmaking_immortals_title": "ÖLÜMSÜZ EŞLEŞTİRMESİ",
  "new_frontiers_matchmaking_immortals_desc": "Ölümsüz seviyesindeki oyuncular için önemli olanın ED değil, diğer insanları tanımak, onlarla iyi geçinmek ve dengeli takımlar kurmak olduğunu biliyoruz. Bu amaçla, Ölümsüz seviyesi için eşleştirme sisteminde değişiklikler yaptık.<br><br>Bugünden itibaren, Ölümsüz seviyesindeki eşleşmelerde önceden toplanmış takımlar kullanılmayacak. Bunun yerine iki kaptan, takımlarını oluşturmak için sekiz oyuncu arasından dört oyuncu seçecek ve böylece sadece ED baz alınarak oluşturulan takımlara kıyasla daha etkili bir takım meydana gelmiş olacak. Yani artık bu seviyedeki maçlarınız kötü geçerse, kendinizden başka kimseyi suçlayamayacaksınız.",
  "new_frontiers_ui_desc": "Bulanık görüyorsunuz ve kolunuz mu ağrıyor? Bir şeyler atıştırın. Lastiğiniz mi patladı? Jantlarınız da yuvarlak, onlar üzerinde gitmeye devam edin. Demek istediğimiz şu: Hayattaki hemen her şey olumsuz sonuçlara yol açmadan göz ardı edilebilir.<br><br>Bunun istisnalarından biri Dota'nın sağlık çubuklarıdır. Bu çubuklar önemlidir. Bu nedenle, bu güncellemede sağlıkla ilgili birçok arayüz öğesi çok büyük güncellemeler aldı.",
  "new_frontiers_ui_shields_title": "SAĞLIK ÇUBUĞU BARİYERLERİ",
  "new_frontiers_ui_shields_desc": "Dota'da kalkanların olduğunu biliyor muydunuz? Büyü kalkanları, fiziksel kalkanlar, zifir kalkanlar. Her türden kalkan! Belki de gözden kaçırdınız veya çoğunlukla göz ardı ettiniz. Çünkü ne kadar kalkanınızın olduğunu ve ne kadarının kaldığını bilmenize imkân yoktu.<br><br>Ama bu belirsizliğin olduğu karanlık çağ artık sona eriyor. Artık her şeyi görebilirsiniz. Ya da bu iki şeyin her ikisini de. Hangi tür kalkanınızın olduğunu bile görebilirsiniz. Bu görsel yükseltmeyle tüm eski kalkanların ne kadar iyi olduğunu kutlamak için, onları öne çıkaran bir dizi yeni yetenek ekledik.<br><br>Ayrıca adlarını \"Kalkan\"dan \"Bariyer\"e değiştirdik ki sağlık çubuğunuzda Vanguard var diye kafanız karışmasın. Rica ederiz.",
  "new_frontiers_ui_health_pips_title": "SAĞLIK ÇUBUĞU BELİRTEÇLERİ",
  "new_frontiers_ui_health_pips_desc": "Bazı birimlerde bildiğimiz sağlık havuzundan yoktur ve yok edilmeleri için belirli sayıda saldırı gerekir. Artık, normalde tahminsel olarak veya bir dâhi gibi kafanızda saymak yerine, öldürmek istediğiniz birimin sağlık çubuğuna bakabilirsiniz. Saldırdığınız ölümlü varlığı ortadan kaldırmak için gerekli saldırı sayısını gösteren küçük belirteçler göreceksiniz (Hamlet'in sağlık çubuğundan bir alıntı).",
  "new_frontiers_ui_health_cost_title": "SAĞLIK BEDELİ",
  "new_frontiers_ui_health_cost_desc": "Dota'da çoğu yetenek mana tüketirken bazıları da sağlık tüketir. Artık bu yetenekler, kullanıldığında ne kadar sağlığa mâl olduğunu gösterecek. Fena değil, değil mi? Nasıl oldu da daha önce kimse bunu düşünmedi bilmiyoruz. Ama artık var.",
  "new_frontiers_gameplay_update_desc": "Yukarıda devasa boyutlarda bir liste yer alıyor. Bunu taçlandırabilecek en iyi şeyse [i]başka bir[/i] devasa liste olmalı. Ama öyle bir listeyi nereden bulacağız... [i]Hey şuna bir bakın![/i] Bu güncellemenin sunduğu diğer tüm denge değişiklikleri için okumaya devam edin. Ya da hemen oyuna girin ve oynayın. İnanın bize, video oyunlarıyla ilgili teknik kılavuzları okumanın ne kadar eğlenceli olduğunu söylemenize ihtiyacımız yok ama onları deneyimlemek de bir o kadar harika. Geri döndüğünüzde bu liste hâlâ burada olacak.",
  "new_frontiers_misc_title": "DİĞER",
  "new_frontiers_misc_role_tokens": "\"Tüm roller seçiliyken\" bir maç kaybedildiğinde Rol Sırası için verilen jeton sayısı azaltıldı. Şimdi bir kayıp için iki jeton kazanacaksınız (Kazanmak yine de dört jetonun tamamını verir.). Bu değişiklik, dereceli rollerde oynayan oyuncuların bazen jeton kasmak için atandığı rolleri oynamamasının önüne geçmeye yardımcı olacaktır.",
  "new_frontiers_misc_removed_roles": "Kaptan Modu'nu Dereceli eşleştirmeden kaldırdık ve Tümü Rastgele ve Tümü Rastgele Ölüm Maçı'nı derecesiz aramadan çıkardık. Bu modları neredeyse kimse oynamıyordu ve maç arama süresi 1 saati rahatlıkla geçiyordu.",
  "new_frontiers_misc_model_editor": "Bu güncelleme, eski model düzenleyiciyi kaldırır. Artık tüm vmdl dosyaları yeni araca yüklenecek ve eski modeller araca ilk yüklediğinizde dönüştürülecektir. Eski derlenmiş formatın yükleme desteğini tamamen kaldırmak için daha sonra bir güncelleme yayınlayacağız. Bu nedenle tüm atölye üreticilerinin modellerini yükleyip yeni formata dönüştürmesini ve en kısa zamanda yeniden derleme yapmasını tavsiye ediyoruz.",
  "new_frontiers_misc_hold_animation": "Dinamik öğeler için klasik \"HoldAnimation\" anahtarını kaldırdık. Özel oyunlar ya manuel olarak yeni \"loop mode\" anahtarına geçmeli ya da bu yeni özelliklere otomatik olarak güncellemek için haritalarını yeniden derlemelidir.",
  "neutral_item_tier": "[b]%1$s. Seviye[/b] Tarafsız Eşya",
  "dota_ability_variable_health": "Sağlık",
  "dota_ability_variable_mana": "Mana",
  "dota_ability_variable_armor": "Zırh",
  "dota_ability_variable_damage": "Hasar",
  "dota_ability_variable_str": "Kuvvet",
  "dota_ability_variable_int": "Zekâ",
  "dota_ability_variable_agi": "Çeviklik",
  "dota_ability_variable_all": "Tüm Özellikler",
  "dota_ability_variable_primary_attribute": "Birincil Özellik",
  "dota_ability_variable_attack": "Saldırı Hızı",
  "dota_ability_variable_hp_regen": "Sağlık Yenilenmesi",
  "dota_ability_variable_lifesteal": "Can Çalma",
  "dota_ability_variable_mana_regen": "Mana Yenilenmesi",
  "dota_ability_variable_mana_regen_aura": "Mana Yenilenmesi Aurası",
  "dota_ability_variable_spell_amp": "Büyü Hasarı",
  "dota_ability_variable_debuff_amp": "Zayıflatma Süresi",
  "dota_ability_variable_move_speed": "Hareket Hızı",
  "dota_ability_variable_evasion": "Kaçınma",
  "dota_ability_variable_spell_resist": "Büyü Direnci",
  "dota_ability_variable_spell_lifesteal": "Büyü Can Çalması",
  "dota_ability_variable_spell_lifesteal_creep": "Büyü Can Çalması (Yaratık)",
  "dota_ability_variable_spell_lifesteal_hero": "Büyü Can Çalması (Kahraman)",
  "dota_ability_variable_selected_attrib": "Seçilmiş Özellik",
  "dota_ability_variable_attack_range": "Saldırı Menzili <font color='#7d7d7d'>(Sadece Menzilli)</font>",
  "dota_ability_variable_attack_range_melee": "Saldırı Menzili <font color='#7d7d7d'>(Sadece Yakın Dövüşçü)</font>",
  "dota_ability_variable_cast_range": "Kullanma Menzili",
  "dota_ability_variable_status_resist": "Durum Direnci",
  "dota_ability_variable_projectile_speed": "Atış Hızı",
  "dota_ability_variable_manacost_reduction": "Mana Bedeli Azaltması",
  "dota_ability_variable_cooldown_reduction": "Dolum Süresi Azaltması",
  "dota_ability_variable_max_mana_percentage": "Maks. Mana Bonusu",
  "dota_ability_variable_aoe_bonus": "Etki Alanı Bonusu"
}