// 4845.js

{
  "language": "russian",
  "new_frontiers_gameplay_number": "Обновление 7.33",
  "new_frontiers_title": "Обновление «Новые горизонты»",
  "new_frontiers_title_short": "Новые горизонты",
  "new_frontiers_subtitle": "Новая карта, масштабные игровые изменения и многое, многое другое. Перед вами открывается новый мир.",
  "new_frontiers_play_trailer": "Смотреть трейлер",
  "new_frontiers_dota_team_intro": "В обновлении «Новые горизонты» мы представляем новую карту, масштабные изменения игрового процесса, системы подбора игр и интерфейса и — это не преувеличение — многое, многое другое.<br><br>Насколько многое? Скажем так: в какой-то момент мы начали забывать, что именно изменилось, и нам стало не по себе. Но потом кто-то вспомнил, что изменения можно записать, чем мы и занялись. Теперь мы можем читать их список когда пожелаем. И вы тоже! Просто мотайте страницу вниз.",
  "new_frontiers_eldor_name": "Волшебник Эльдор",
  "new_frontiers_dota_team_name": "Команда Dota 2",
  "new_frontiers_section_title_map": "Обновление карты",
  "new_frontiers_section_title_major_gameplay": "Крупные изменения геймплея",
  "new_frontiers_section_title_matchmaking": "Система подбора игр",
  "new_frontiers_section_title_ui": "Интерфейс",
  "new_frontiers_section_title_gameplay_update": "Правки баланса",
  "new_frontiers_map_introduction": "Карта значительно расширилась, но цель игры осталась прежней. Линии не отдалились друг от друга, и всё нужное для победы по-прежнему находится в центре карты.<br><br>На расширившейся на 40% территории нашлось место и новым ресурсам, и неизведанным стратегиям. Оба основных леса тоже не обошлись без масштабных изменений обзора, тропинок, лагерей крипов и не только.",
  "new_frontiers_map_subtitle": "Откройте для себя новый мир",
  "new_frontiers_map_roshan_title": "Новые дома Рошана",
  "new_frontiers_map_roshan_desc": "Рошан продал своё старое речное логово и грамотно распорядился открывшимися возможностями. Теперь у него сразу [i]два[/i] чудесных логова, расположенные в северо-западном и юго-восточном углах карты. Два маленьких пещерных рая могут похвастаться роскошными видами на фонтаны и шаговой доступностью потайных лавок.<br><br>Судя по всему, неподалёку есть и тренажёрный зал, поскольку Рошан стал ещё крепче. Также за его убийство больше не даётся Aghanim's Shard, а сыр выпадает уже после второй его смерти. После третьей же смерти из Рошана выпадет Refresher Shard или Aghanim's Scepter — в зависимости от того, в каком логове его убили.",
  "new_frontiers_map_twin_gates_title": "Парные порталы",
  "new_frontiers_map_twin_gates_desc": "Эти врата соединяют углы карты рядом с башнями на лёгких линиях, позволяя игрокам мгновенно переместиться в другой конец карты.<br><br>Парные порталы не только меняют геймплей, но и расширяют сюжет игры. Вы не ослышались: Dota 2 неофициально стала частью так называемой PMEU (расширенной вселенной Pac-Man).",
  "new_frontiers_map_lotus_pools_title": "Пруды лотосов",
  "new_frontiers_map_lotus_pools_desc": "Теперь на правом и левом краях карты, неподалёку от места встречи первых волн крипов, находятся пруды лотосов. Каждые несколько минут в них появляется по съедобному цветку, восстанавливающему герою ману и здоровье.<br><br>Накопив несколько цветков, игрок может собрать их в цветок побольше и пополезнее, а пару таких цветков можно собрать в [i]огромный[/i]. Но можно ли собрать во что-нибудь [i]огромный[/i] цветок? Наверное, нельзя. (Наверняка можно.)",
  "new_frontiers_map_tormentors_title": "Терзатели",
  "new_frontiers_map_tormentors_desc": "Эти могучие крипы-одиночки появляются рядом с каждой базой после 20 минут игры, и каждый из них под завязку набит осколками Аганима. Но есть одно «но», состоящее из двух «но»: 1) у Терзателей есть мегабарьеры, отражающие большинство урона в нападающих и 2) они становятся сильнее с каждой своей смертью. Так что вряд ли вы справитесь с ними без помощи союзников.<br><br>Хорошая новость заключается в том, что Терзатели ведут себя как медведи, предпочитающие вам нерадивого туриста: если вы не трогаете их, они не трогают вас.",
  "new_frontiers_map_watchers_title": "Смотрители",
  "new_frontiers_map_watchers_desc": "Смотрители — это как Терминатор, если бы он умел только смотреть. Они беспощадны. Они не знают боли. Они не знают страха. Правда, они ленивые. Смотритель не станет смотреть, пока на него не нажмут.<br><br>В начале игры все Смотрители неактивны и нейтральны. Включив Смотрителя, вы получите обзор области на семь минут — или пока враги его не сломают. Когда команда убивает Рошана, все Смотрители переходят на её сторону.",
  "new_frontiers_map_barriers_title": "Защитные врата",
  "new_frontiers_map_barriers_desc": "Эти врата сочетают волшебство высокого фэнтези с удобством самой что ни на есть реальной входной двери, которую можно закрыть, чтобы спокойно уйти за продуктами (и рапирой). Запасной вход на вашу базу снабжён удобным силовым полем, которое пропускает союзников и не даёт пройти врагам. Даже если противник стучится в вашу дверь, никто не помешает вам выскользнуть с фланга.",
  "new_frontiers_map_wisdom_runes_title": "Руны мудрости",
  "new_frontiers_map_wisdom_runes_desc": "Мудрое решение заглянуть на край карты вознаграждается этими рунами, дающими опыт. Они появляются недалеко от базы, что позволяет сохранять контроль над игрой, даже если вы проигрываете.",
  "new_frontiers_map_shield_runes_title": "Руны щита",
  "new_frontiers_map_shield_runes_desc": "Список речных рун усиления пополнила стойкая руна щита, дающая барьер в размере 50% от максимального здоровья героя. Смело забегайте под чужую башню или заходите в тёмный лес — противники удивятся не меньше вашего.",
  "new_frontiers_map_named_regions_title": "Именованные области",
  "new_frontiers_map_named_regions_desc": "На расширенной карте появились четыре тематических области: «Шахта», «Колодец», «Кладбище» и «Статуя». Используйте эти названия — так вашим союзникам будет ещё легче понять, где именно вас убивают. А ещё существам в этих областях даются особые бонусы к характеристикам.",
  "new_frontiers_map_creep_camps_title": "12 новых нейтральных лагерей",
  "new_frontiers_map_creep_camps_desc": "Некоторым крипам надоело то и дело погибать в лесу, поэтому они разбили ещё 12 лагерей в новых районах карты. Ведь там вы их точно не найдёте.",
  "new_frontiers_map_outpost_title": "Новые аванпосты",
  "new_frontiers_map_outpost_desc": "На расширенной карте появились два новых аванпоста, а прежние аванпосты оказались на новых местах. Встаёт очевидный вопрос: прежние ли это аванпосты? Хорошая попытка, Сократ. Конечно, прежние.",
  "new_frontiers_major_gameplay_features_desc": "Обновление «Новые горизонты» фундаментально изменило ваших любимых героев и механики. Юристы даже посоветовали нам предупредить читателей: следующий раздел [i]настолько плотно[/i] набит новшествами, меняющими правила игры, что его следует изучать постепенно в течение нескольких недель, иначе вы перенапряжётесь и будете вынуждены вызвать пожарных.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Избранные герои",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Несбалансированных героев не осталось, но некоторые могли оказаться сбалансированнее других. О них мы и расскажем.",
  "new_frontiers_major_gameplay_new_items_title": "Новые предметы",
  "new_frontiers_major_gameplay_new_items_desc": "Для тех, кому не терпится потратить денежки.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Новые нейтральные предметы",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Мы добавили в ассортимент семь совершенно новых предметов и вернули несколько старых любимцев.",
  "new_frontiers_major_gameplay_bkb_title": "Изменения Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Теперь Black King Bar применяет на владельца обычное развеивание, увеличивает сопротивление магии на 50% и даёт невосприимчивость к эффектам, во время которой не действуют отрицательные эффекты, а также игнорируется чистый и отражённый урон.<br><br>Но будьте осторожны: если эффект закончится позже невосприимчивости от Black King Bar, он будет действовать оставшееся время. А способности, игнорировавшие полную защиту от магии, проходят и сквозь невосприимчивость к эффектам.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Новый тип героев",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Четвёртый брат-дух — Дух пустоты — не должен был принадлежать к силе, ловкости или интеллекту. Чтобы выделиться по-настоящему, он должен был стать новым типом героя. [i]Четвёртым[/i] типом героя.<br><br>Представляем универсальных героев — новую основную группу героев, получающих 0,6 урона за единицу любого атрибута. Программисты заверили нас, что баланс соблюдён идеально. Или наоборот. Хорошая новость состоит в том, что окончательный результат мы узнаем вместе, в большом приключении под названием «Новые горизонты».",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Изменения выпадения нейтральных предметов",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Раньше убийство лесных существ приносило крутой нейтральный предмет... керри-герою, на котором, как правило. играли не вы. Теперь с нейтральных крипов падают жетоны, которые позволяют выбрать один из [i]пяти[/i] нейтральных предметов. Такой ассортимент есть у каждого жетона, так что даже последнему игроку будет из чего выбирать.<br><br>А ещё жетон можно отдать союзнику, однако передать полученный предмет будет нельзя, так что делитесь жетонами с умом.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Усиление нейтральных крипов",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Теперь нейтральные крипы и их способности становятся сильнее со временем. Да, зачищать лагеря будет всё сложнее и сложнее, зато герои, подчиняющие крипов, смогут обзавестись внушительной свитой.",
  "new_frontiers_major_gameplay_kill_formula_title": "Новая формула убийства",
  "new_frontiers_major_gameplay_kill_formula_desc": "Мы переработали формулу убийств, чтобы в ранней игре они значили больше и побуждали игроков атаковать другие линии. А ещё мы уменьшили прирост золота за крипов на линиях, чтобы с ходом игры фарм становился всё менее выгодным, а игроки предпочитали выбивать золото друг из друга.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "(Не)оглушительная новость",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Играть за своего героя всегда веселее, чем не играть. Так возрадуйтесь же, фанаты играния и ненавистники неиграния, ибо ваши мечты сбываются: теперь вы сможете играть на своём герое больше, чем когда-либо.<br><br>В чём суть? Всё просто. Мы уменьшили длительность почти всех способностей, выводящих из строя. Как мы пришли к этой безумной идее? Всё ещё проще. На нас рыкнул Повелитель зверей, и у нас появилось много времени на подумать.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "После двух месяцев блуждания по линиям Муэрта наконец получила предметы Аганима. Если вы с ней ещё не знакомы, загляните на страницу [url=https://www.dota2.com/deadreckoning]обновления «Смертная расплата»[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Огр-маг туповат для героя интеллекта. Мы это исправили.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Теперь Медуза начинает игру слабой как дитя, но, как и дитя, со временем она может стать сильнее.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Большинство способностей Клинкза, как и лучшие способности в реальной жизни, теперь создают скелетов.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Раньше Расколотый страж создавал свою идеальную копию. Теперь же он создаёт копию [i]получше[/i]! Или похуже. Но точно другую. Надеемся, по этому поводу не будет споров.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Алхимик, под стать игрокам на Алхимике, обзавёлся врождённой жадностью.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ВРЕМЕННЫЙ БОНУС ДЛЯ ARC WARDEN",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Мы ненадолго ввели особое изменение: при игре за силы Тьмы привычный Arc Warden заменяется на свою электрическую копию с новым набором способностей, а использование ульта призовёт обычную версию героя.",
  "new_frontiers_matchmaking_desc": "Давайте честно: в мире 8 миллиардов людей, и 99,99% из них ужасно играют в Доту. Следовательно, подбор игр — штука сложная, особенно если те, кто играют в Доту хорошо, хотят играть против тех, кто играют в Доту почти так же, но чуть похуже. Поэтому мы серьёзно попотели и провели множество расчётов, чтобы улучшить качество подбора игр для абсолютно всех игроков.",
  "new_frontiers_matchmaking_intro_title": "Уверенный подбор игр",
  "new_frontiers_matchmaking_intro_desc": "Рейтинг подбора игры (MMR) состоит, в сущности, всего из двух чисел: ранга и уверенности в нём. Ранг обозначает ваш примерный уровень игры, а уверенность в рейтинге — нашу уверенность в подсчётах. По окончании каждой игры мы изменяем ранг в зависимости от того, победили вы или проиграли. При этом растёт и уверенность, ведь мы получили больше данных.",
  "new_frontiers_matchmaking_details_old_title": "Нежелательная группировка — худшая из возможных",
  "new_frontiers_matchmaking_details_old_desc": "До сих пор ранг и уверенность в нём изменялись с помощью модифицированной версии алгоритма Эло, но со временем мы заметили некоторые проблемы такого подхода. К примеру, распределение рейтинга постепенно сдвинулось, из-за чего игроки в диапазоне от 0 до 1000 рейтинга группировались не лучшим образом. Кроме того, не всегда получалось определить точный рейтинг игрока, вернувшегося после длительного перерыва, поскольку его прежний уровень игры больше не был актуален.",
  "new_frontiers_matchmaking_details_new_title": "Новая, улучшенная группировка",
  "new_frontiers_matchmaking_details_new_desc": "Чтобы решить эти проблемы, мы перешли на другой алгоритм под названием Glicko, который будет быстро и исправно находить для вас других игроков схожего мастерства. Если конкретно, новый алгоритм позволяет нам лучше учитывать уверенность в ранге при подсчётах, благодаря чему повышение и понижение ранга происходит более точно.\\n\\nПереход на новую систему подбора игр будет чем-то похож на начало нового рейтингового сезона:\\n[list][*]Все игроки проходят короткий режим калибровки, основанный на прошлом ранге.\\n[*]Калибровка больше не длится фиксированное число матчей. Теперь игрок считается прошедшим калибровку, когда уверенность в его ранге достигает определённого значения.\\n[*]Вероятно, после калибровки ваша медаль ранга изменится. Тем не менее, даже если она стала совсем другой, вам будут встречаться игроки схожего мастерства.\\n[*]Теперь изменение рейтинга зависит от нескольких факторов, в том числе от ранга и уверенности в нём всех участников игры. Тем не менее, мы ограничим максимальное изменение рейтинга, чтобы избежать особенно негативных результатов.\\n[*]В периоды неактивности уверенность в ранге игрока постепенно снижается.[/list]\\n\\nМы используем обе системы подбора игр уже некоторое время, чтобы убедиться, что принимаем верное решение. Мы понимаем, что точный рейтинг — это лишь один из многих факторов, влияющих на качество игры, и, как и при других изменениях этой системы, хотим услышать ваши мнения.",
  "new_frontiers_matchmaking_immortals_title": "Титанический подбор игры",
  "new_frontiers_matchmaking_immortals_desc": "На ранге «Титан» сыгранность и хороший баланс ролей не уступают в важности рейтингу. Чтобы это учесть, мы изменили систему подбора на этом уровне мастерства.<br><br>Теперь команды на ранге «Титан» не определяются заранее. Вместо этого два капитана по очереди выбирают игроков, отчего состав команд стал важнее, чем когда за него отвечал рейтинг. И теперь в плохой команде «Титаны» могут винить только самих себя.",
  "new_frontiers_ui_desc": "Мутнеет в глазах и стреляет в руке? Ничего страшного, просто ваше тело просит еды. Спустило колесо? Езжайте прямо на диске, всё равно он круглый. Мораль? По большому счёту, почти всё в жизни можно игнорировать, не боясь последствий.<br><br>Кроме полосок здоровья в Доте. Они важнее всего. Так что в этом обновлении мы значительно улучшили различные элементы интерфейса, связанные со здоровьем.",
  "new_frontiers_ui_shields_title": "Барьеры на полосе здоровья",
  "new_frontiers_ui_shields_desc": "А вы знали, что в Доте есть такие «щиты»? Физические, магические, огненные... Да всякие! Возможно, вы их не замечали. Или попросту игнорировали, потому что не было понятно, сколько щита есть и сколько осталось.<br><br>Но смутные времена неопределённости подошли к концу. Теперь вы видите всё. Ну, или хотя бы здоровье щитов. И даже тип щита. А чтобы отметить, насколько щиты стали круче выглядеть, мы добавили в игру ещё несколько щитов.<br><br>Кроме того, мы переименовали «щиты» в «барьеры», чтобы вы точно не подумали, что на шкале вашего здоровья оказался Vanguard. Не благодарите.",
  "new_frontiers_ui_health_pips_title": "Индикатор числа атак",
  "new_frontiers_ui_health_pips_desc": "У некоторых существ нет здоровья в привычном понимании, а для их убийства требуется определённое число атак. Теперь вместо игры в угадайку или трудоёмких подсчётов вы можете просто бросить взгляд на существо, которое хотите убить. Новенькие отметки над ним обозначают, сколько ударов осталось нанести по существу до того, как вы, цитируя полосу здоровья Гамлета, снимете с него покров земного чувства.",
  "new_frontiers_ui_health_cost_title": "Расход здоровья",
  "new_frontiers_ui_health_cost_desc": "Большинство способностей в Доте расходуют ману, но есть и такие, на которые тратится здоровье. И теперь в интерфейсе отображается расход здоровья на их применение. Недурно, да? Просто невероятно, что никто до сих пор до этого не додумался. Но мы всё сделали.",
  "new_frontiers_gameplay_update_desc": "Сколько же наверху текста. А знаете, что может быть ещё лучше? [i]Вдвое[/i] больше текста. Но где мы найдём ещё столько же... [i]Ой, вы только поглядите![/i] Ниже вы сможете прочесть обо всех изменениях баланса в этом обновлении. Или просто запускайте игру и попробуйте всё сами. Уж поверьте, мы отлично знаем, как весело читать техническую документацию к игре, но играть — тоже не самое скучное занятие. А эта куча текста никуда не денется.",
  "new_frontiers_misc_title": "Прочее",
  "new_frontiers_misc_role_tokens": "Мы уменьшили число жетонов ролевого поиска, которые игрок получает за поражение в матче, если при поиске у него выбраны все роли. Теперь за проигрыш даются два жетона (за победу всё ещё даются четыре). Так мы надеемся изменить отношение игроков к ролевому поиску, в котором некоторые больше заинтересованы не в победе, а в зарабатывании жетонов.",
  "new_frontiers_misc_removed_roles": "Мы убрали режим Captains Mode из рейтинговых игр, а All Random и All Random Deathmatch — из обычных. В эти режимы почти никто не играл, и время поиска зачастую превышало час.",
  "new_frontiers_misc_model_editor": "В этом обновлении мы удалили старый редактор моделей. Все файлы .vmdl теперь будут открываться в новом приложении, которое автоматически конвертирует старые модели при первом их открытии. В дальнейшем мы выпустим обновление, которое полностью удалит поддержку моделей старого формата, так что рекомендуем всем авторам Мастерской как можно скорее загрузить, конвертировать и перекомпилировать старые модели.",
  "new_frontiers_misc_hold_animation": "Мы удалили поддержку использовавшегося в прошлом ключа HoldAnimation для динамических объектов. Создатели пользовательских игр должны либо перейти на новый ключ loop mode, либо перекомпилировать свои карты, чтобы замена произошла автоматически.",
  "neutral_item_tier": "Нейтральный предмет [b]%1$s разряда[/b]",
  "dota_ability_variable_health": "к здоровью",
  "dota_ability_variable_mana": "к мане",
  "dota_ability_variable_armor": "к броне",
  "dota_ability_variable_damage": "к урону",
  "dota_ability_variable_str": "к силе",
  "dota_ability_variable_int": "к интеллекту",
  "dota_ability_variable_agi": "к ловкости",
  "dota_ability_variable_all": "ко всем атрибутам",
  "dota_ability_variable_primary_attribute": "к основному атрибуту",
  "dota_ability_variable_attack": "к скорости атаки",
  "dota_ability_variable_hp_regen": "к восстановлению здоровья",
  "dota_ability_variable_lifesteal": "к вампиризму",
  "dota_ability_variable_mana_regen": "к восстановлению маны",
  "dota_ability_variable_mana_regen_aura": "к восстановлению маны в ауре",
  "dota_ability_variable_spell_amp": "к урону от заклинаний",
  "dota_ability_variable_debuff_amp": "к длительности отрицательных эффектов",
  "dota_ability_variable_move_speed": "к скорости передвижения",
  "dota_ability_variable_evasion": "к уклонению",
  "dota_ability_variable_spell_resist": "к сопротивлению магии",
  "dota_ability_variable_spell_lifesteal": "к вампиризму заклинаниями",
  "dota_ability_variable_spell_lifesteal_creep": "к вампиризму заклинаниями (от крипов)",
  "dota_ability_variable_spell_lifesteal_hero": "к вампиризму заклинаниями (от героев)",
  "dota_ability_variable_selected_attrib": "к выбранному атрибуту",
  "dota_ability_variable_attack_range": "к дальности атаки <font color='#7d7d7d'>(в дальнем бою)</font>",
  "dota_ability_variable_attack_range_melee": "к дальности атаки <font color='#7d7d7d'>(в ближнем бою)</font>",
  "dota_ability_variable_cast_range": "к дальности применения заклинаний",
  "dota_ability_variable_status_resist": "к сопротивлению эффектам",
  "dota_ability_variable_projectile_speed": "к скорости снарядов",
  "dota_ability_variable_manacost_reduction": "к уменьшению расхода маны",
  "dota_ability_variable_cooldown_reduction": "к уменьшению перезарядок заклинаний",
  "dota_ability_variable_max_mana_percentage": "к максимальной мане",
  "dota_ability_variable_aoe_bonus": "к радиусу заклинаний"
}