// 3153.js

{
  "language": "danish",
  "new_frontiers_gameplay_number": "Spilopdatering 7.33",
  "new_frontiers_title": "Opdatering: De nye grænser",
  "new_frontiers_title_short": "De nye grænser",
  "new_frontiers_subtitle": "En ny bane, store spilændringer og meget mere. Det er en helt ny verden at udforske.",
  "new_frontiers_play_trailer": "Se traileren",
  "new_frontiers_dota_team_intro": "De nye grænser er en opdatering, der inderholder en ny bane, store spilændringer samt ændringer til matchmaking, brugergrænsefladen og – vi laver ikke sjov – meget, meget mere.<br><br>Hvor meget mere? Så meget, at det faktisk var svært at huske det hele, og vi begyndte at gå lidt i panik, indtil der var en, som sagde, vi bare kunne skrive det ned. Så det gjorde vi. Og nu kan vi læse det, når vi vil. Og det kan du også! Rul ned for at læse videre.",
  "new_frontiers_eldor_name": "Troldmanden Eldor",
  "new_frontiers_dota_team_name": "Dota-teamet",
  "new_frontiers_section_title_map": "Ny bane",
  "new_frontiers_section_title_major_gameplay": "Store spilændringer",
  "new_frontiers_section_title_matchmaking": "Matchmaking",
  "new_frontiers_section_title_ui": "Brugergrænseflade",
  "new_frontiers_section_title_gameplay_update": "Balanceringsændringer",
  "new_frontiers_map_introduction": "Banen i Dota er blevet udvidet markant. Spillets kernemål er stadig det samme – lanes er ikke flyttet længere væk fra hinanden, og alt det, man skal bruge for at vinde, er stadig i midten af banen.<br><br>Men med 40% mere terræn er der masser af plads til at anskaffe sig nye ressourcer og finde på nye strategier. Begge centrale jungleområder er blevet ændret fuldkomment, hvilket har vendt op og ned på udsyn, flugtruter, farming og mere.",
  "new_frontiers_map_subtitle": "Udforsk den nye verden",
  "new_frontiers_map_roshan_title": "Roshans nye hjemsteder",
  "new_frontiers_map_roshan_desc": "Roshan har solgt sin grav i floden og udnytter al den ledige plads i banen. Nu har han [i]to[/i] fantastiske nye grave, der befinder sig i banens nordvestlige og nordøstlige hjørne. De er et paradis for gravelskere som ham og byder på en flot udsigt til basernes springvand og kort afstand til de hemmelige butikker.<br><br>Disse grave ligger også tæt på træningscenteret, for Roshan er endnu mere hårdfør end tidligere. Roshan kan ikke længere smide Aghanim's Shard, men smider i stedet Cheese, når han dør for anden gang i stedet for tredje gang. Ved sit tredje dødsfald smider han Refresher Shard eller Scepter, afhængigt af om han er i nord- eller sydgraven.",
  "new_frontiers_map_twin_gates_title": "Tvillingeporte",
  "new_frontiers_map_twin_gates_desc": "To porte forbinder nu banens hjørner ved tårnene i Safe Lanes, så spillere kan teleportere fra det ene hjørne af banen til det andet.<br><br>Det her er en spilændring, men det har naturligvis historiemæssige konsekvenser. Du gættede rigtigt: Dota 2 findes nu uofficielt i PMUU (Pac-Mans udvidede univers).",
  "new_frontiers_map_lotus_pools_title": "Lotusdamme",
  "new_frontiers_map_lotus_pools_desc": "Spillere kan nu finde lotusdamme i venstre og højre side af banen (i nærheden af, hvor krybene først støder ind i hinanden). De gror frugt, som giver mana og HP, når de spises.<br><br>Spillere kan samle frugterne og kombinere dem til en endnu større og værdifuld frugt sent i spillet. Den store frugt kan endda kombineres til en [i]utroligt[/i] stor frugt. Hvad sker der, når man kombinerer den [i]utroligt[/i] store frugt? Sikkert ikke noget særligt. (Helt klart noget særligt).",
  "new_frontiers_map_tormentors_title": "Plageånder",
  "new_frontiers_map_tormentors_desc": "Disse to mægtige neutrale kryb dukker op nær hver base efter 20 minutter, og de er begge fyldt med Aghanim's Shards. Der er dog en ulempe, og ulempen er, at der er to ulemper. 1) Plageånder har kæmpeskjolde, som reflekterer det meste af din skade tilbage på dig. 2) De bliver stærkere, hver gang man dræber dem. Så det vil nok kræve hele holdets indsats at slå dem ihjel.<br><br>Den gode nyhed er, at de nok skal lade dig være, så længe du gør det samme.",
  "new_frontiers_map_watchers_title": "Vogtere",
  "new_frontiers_map_watchers_desc": "Vogtere er ligesom Plageånder, men bruges til at vogte med. De er utrættelige. De kender ikke til smerte. De kender ikke til frygt. Men de er dovne. De begynder ikke at vogte, før du klikker på dem.<br><br>Vogtere er inaktive og neutrale i starten af spillet, men når de aktiveres, giver de udsyn i deres område i syv minutter, eller indtil fjenderne saboterer dem for midlertidigt at deaktivere dem. Når et hold dræber Roshan, skifter alle vogtere til holdets side.",
  "new_frontiers_map_barriers_title": "Forsvarsporte",
  "new_frontiers_map_barriers_desc": "Forsvarsporte kombinerer Dotas livlige fantasi med brugbarheden af døre i dit hjem, som du kan låse, når du tager over i supermarkedet for at smadre dets Ancient. En forsvarsport er en bagdør til basen med et brugbart kraftfelt, der lader jeres hold passere, men holder fjenderne ude. Mens fjenden angriber fronten af basen, kan I snige jer ud ad bagdøren og rundt om.",
  "new_frontiers_map_wisdom_runes_title": "Visdomsruner",
  "new_frontiers_map_wisdom_runes_desc": "Udforsk kanterne i banen for at finde visdomsruner, som giver XP-boosts til enhver helt, som er klog nok til at stjæle en. Visdomsruner dukker op nær jeres base og byder på en nem måde for holdet at anskaffe sig en fordel i svære kampe, så sejren ikke er helt tabt.",
  "new_frontiers_map_shield_runes_title": "Skjoldruner",
  "new_frontiers_map_shield_runes_desc": "Flodruner får også noget nyt med den nye skjoldrune, som giver 50% af dit maksimale HP som barriere. Kast dig ind under et tårn for at få et drab tidligt i kampen – eller gå op ad en bakke uden udsyn for at overraske både dig selv og fjenden.",
  "new_frontiers_map_named_regions_title": "Navngivne områder",
  "new_frontiers_map_named_regions_desc": "Den udvidede bane indeholder nu særskilte områder såsom Minerne, Brønden, Kirkegården og Statuen, hvilket gør det endnu lettere for dine holdkammerater at vide præcis, hvor det er, du bliver dræbt. Alle enheder i disse områder får ændret deres egenskaber, så de matcher områdernes tema.",
  "new_frontiers_map_creep_camps_title": "12 nye kryblejre",
  "new_frontiers_map_creep_camps_desc": "Nogle af krybene blev trætte af at blive dræbt i junglen hele tiden, så de har stiftet 12 nye lejre rundt omkring i den udvidede bane. Så nu kan du også slagte dem dér.",
  "new_frontiers_map_outpost_title": "Nye udkigstårne",
  "new_frontiers_map_outpost_desc": "Den nye udvidede bane har to nye udkigstårne. De oprindelige udkigstårne er blevet flyttet nye steder hen, hvilket får os til at spekulere på, om de virkelig var de oprindelige udkigstårne. Godt forsøgt, Sokrates: Det er de.",
  "new_frontiers_major_gameplay_features_desc": "De nye grænser er en opdatering, som byder på store ændringer til dine yndlingshelte og -systemer. Faktisk har vores juridiske afdeling rådet os til at fortælle, at denne spilsektion er [i]så tætpakket[/i] med metadefinerende nye funktioner, at du bør læse dem langsomt, i løbet af de næste par uger, så du ikke bliver overstimuleret og bliver nødt til at ringe til brandvæsnet.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Heltehøjdepunkter",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Alle helte har fået nogle balancejusteringer, nogle mere end andre. Vi nævner et par af dem her.",
  "new_frontiers_major_gameplay_new_items_title": "Nye genstande",
  "new_frontiers_major_gameplay_new_items_desc": "Køb alt, hvad du har brug for.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Nye neutrale genstande",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Vi tilføjer syv helt nye neutrale genstande og henter nogle gamle favoritter frem igen.",
  "new_frontiers_major_gameplay_bkb_title": "Ny Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Aktivering af Black King Bar påfører nu en simpel fordrivelse og giver 50% magisk resistens og svækkelsesimmunitet. Mens genstanden er aktiv, vil negative effekter fra svækkelser ikke påvirke dig. Du bliver også immun over for ren og reflekteret skade.<br><br>Men vær forsigtig! Hvis Black King Bar udløber, før svækkelserne gør, bliver du ramt af svækkelserne i deres tilbageværende varighed. Effekter, der går gennem magisk immunitet, går også gennem svækkelsesimmunitet nu.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Ny type helteattribut",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Void Spirit, den fjerde af de åndelige brødre, vi udgav, skulle hverken have været en styrke-, agilitets- eller intelligenshelt. For at gøre ham unik skulle han faktisk have været en ny slags helt. En [i]fjerde[/i] slags helt.<br><br>Vi introducerer universelle helte – en ny heltetype bestående af flere af de nuværende helte, som får 0,6 skade af alle attributter. Vores ingeniører har forsikret os, at det her tal er fuldkomment balanceret. Medmindre det ikke er. Men den gode nyhed er, at vi alle sammen finder ud af det i opdateringens store eventyr.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Nye neutrale genstandsdrops",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Mord på skovens skabninger plejede at betyde, at man modtog en sej, ny neutral genstand... som man var nødt til at give væk til holdets carry, som sædvanligvis ikke var dig. Dræbte neutrale kryb smider nu tilfældigt en polet, som kan bruges til at vælge blandt [i]fem[/i] tilgængelige neutrale genstande. Hver polet tilbyder fem genstande, så selv den sidste spiller har fem genstande at vælge imellem.<br><br>Spillerne kan give poletterne til andre på holdet – men når først man har valgt en genstand, kan den ikke deles med andre, så fordel jeres poletter fornuftigt.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Skalering af neutrale kryb",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Neutrale kryb og deres evner skaleres over tid. Ja, lejrene bliver sværere at rydde senere i spillet, men helte med evner, der kan kontrollere kryb, kan udnytte dette til deres fordel.",
  "new_frontiers_major_gameplay_kill_formula_title": "Ændret drabsudregning",
  "new_frontiers_major_gameplay_kill_formula_desc": "Vi har ændret drabsudregningen for at gøre drab tidligt i spillet mere betydningsfulde og for at motivere spillerne til at ganke hinanden. Vi har også reduceret guldskaleringen for holdenes kryb, så det bliver mindre fordelagtigt at farme kryb, som kampen skrider frem, hvilket også opfordrer spillerne til at slå guldet ud af hinanden i stedet.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Ikke så lamslående",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Det er altid sjovere at spille sin helt end ikke at gøre det. Til fans af at spille og til kritikere af ikke at gøre det: jeres drøm er gået i opfyldelse. Gør jer klar til at spille jeres helt mere end nogensinde før.<br><br>Hvordan det? Simpelt. Vi har reduceret varigheden på næsten alle uskadeliggørende effekter i spillet. Hvordan kom vi frem til sådan en vanvittig plan? Endnu simplere. Vi fik skreget ørerne røde af Beastmasters råb, og pludselig havde vi rigelig tid til at tænke over tingene.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Efter to måneders søgen har Muerta endelig fundet sine opgraderinger med Aghanim’s Scepter og Shard. Hvis du ikke har set hende endnu, kan du læse mere på hendes [url=https://www.dota2.com/deadreckoning]opdateringsside[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi er for dum til at være en intelligenshelt. Så det er han ikke længere.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa starter nu ud som en svag baby, men ligesom babyer bliver hun stærkere med tiden.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "De fleste af Clinkz' evner skaber nu skeletter. Der er endda et inden i dig!",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden plejede at skabe en perfekt klon af sig selv. Men nu skaber han en [i]bedre[/i] udgave af sig selv! Eller en værre en! Uanset hvad, så er den anderledes. Og ret ukontroversiel, tænker vi.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Helten Alchemist har nu medfødt grådighed ligesom dem, der spiller ham.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "ARC WARDEN – TIDSBEGRÆNSET BONUS",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "I en begrænset periode vil Tempest Double være den primære helt, når du vælger Arc Warden som Dire, og når du bruger hans ultimate, hidkaldes hans \"normale\" jeg.",
  "new_frontiers_matchmaking_desc": "Lad os indse det: Der er otte milliarder folk i verden, og 99,99% af dem er elendige til Dota. Det betyder, at matchmaking kan være lidt af en udfordring, især hvis du er god til Dota og kan lide at spille med folk, der er næsten, men forhåbentligt ikke, lige så gode til Dota, som du er. Vi har lavet en hel del arbejde og en hel del beregninger for at forbedre kvaliteten af matchmaking for spillere på alle færdighedsniveauer.",
  "new_frontiers_matchmaking_intro_title": "Matchmaking med pålidelighed",
  "new_frontiers_matchmaking_intro_desc": "Matchmakingrangen (MMR) består faktisk kun af to tal: Rangen og rangpålideligheden. Din rang er et estimat af dit færdighedsniveau, og rangpålideligheden er, hvor pålideligt estimatet er. Når du spiller en kamp, justerer vi din rang, afhængigt af om du vinder eller taber. Din rangpålidelighed stiger også, fordi vi nu har mere data.",
  "new_frontiers_matchmaking_details_old_title": "Uønsket gruppering: Den værste slags gruppering",
  "new_frontiers_matchmaking_details_old_desc": "Dota har traditionelt brugt en modificeret udgave af Elo-algoritmen til at implementere ændringer til rang og rangpålidelighed. Med tiden har vi dog bemærket flere problemer med vores tilgang. For eksempel har fordelingen af MMR efterhånden flyttet sig lavere, hvilket har forårsaget uønsket gruppering af spillere med 0-1000 forskel i MMR. Et andet problem har været, at spillere, der har holdt pause fra spillet og er kommet tilbage, har haft svært ved at skaffe sig MMR, fordi deres færdighedsniveau ikke svarer til det, de havde tidligere.",
  "new_frontiers_matchmaking_details_new_title": "Ny og forbedret gruppering",
  "new_frontiers_matchmaking_details_new_desc": "For at håndtere dette har vi skiftet til en anden algoritme kaldet Glicko, som hurtigt og præcist bør matche dig med andre spillere af lignende færdighedsniveau. Set med matematiske øjne gør Glicko os i stand til bedre at tage spillernes rangpålidelighed med i vores beregninger, hvilket fører til mere præcise beslutninger om fortjenester og tab af rang.\\n\\nOvergangen til vores nye matchmakingsystem vil føles en smule som starten på en ny matchmakingsæson: [list][*]Alle spillere anbringes i en kort kalibreringstilstand ud fra deres forrige rang.\\n[*]Kalibrering består ikke længere af et fast antal kampe. I stedet anses spillere som værende kalibreret, når deres rangpålidelighed overstiger en vis tærskel.\\n[*]Når du er kalibreret, ender du sandsynligvis med en anden medalje end den, du havde før. Men selv hvis din medalje ændrer sig betydeligt, kan du forvente at blive matchet med spillere i lignende færdighedsniveau.\\n[*]Kampe har ikke længere fast fortjeneste/tab af MMR. Det vil variere afhængigt af en række faktorer, herunder deltagernes rang og rangpålidelighed. Vi begrænser dog fortjenesten/tabet per kamp for at forhindre særligt negative udfald.\\n[*]En spillers rangpålidelighed falder langsomt over tid, hvis spilleren ikke spiller nogen kampe.[/list]Vi har haft begge matchmakingsystemer i brug bag kulisserne i noget tid nu for at opbygge tillid til ændringerne. Vi ved, at præcis MMR er én blandt mange faktorer, der afgør kampenes kvalitet, og som med alle andre ændringer til matchmaking vil vi gerne høre jeres feedback.",
  "new_frontiers_matchmaking_immortals_title": "Immortal matchmaking",
  "new_frontiers_matchmaking_immortals_desc": "I rangen Immortal er det vigtigere at kende de andre spillere, være på samme bølgelængde og vælge en god rollebalance end bare MMR. Så vi har ændret matchmakingen i Immortal for at tage højde for dette.<br><br>Kampe i Immortal bruger ikke længere foruddefinerede hold. I stedet vælger to kaptajner de andre otte spillere på hvert hold, så holdet bliver stærkere, end hvis man bare brugte MMR til at sammensætte hold. Så hvis jeres hold er dårligt nu, er det jeres egen skyld, Immortals.",
  "new_frontiers_ui_desc": "Sløret syn og stikkende smerter ned gennem armen? Vores råd er at ignorere det, det er bare kroppens måde at sige, at den er sulten. Punkteret dæk? Kør på fælgen – den er jo stadigvæk rund. Pointen er, at stort set alt i livet trygt kan ignoreres, uden at det får konsekvenser.<br><br>Undtagen helbredsbjælken i Dota. Den er vigtig. Og derfor får en hel del helbredsrelaterede oplysninger i brugergrænsefladen en kæmpe opgradering med denne opdatering.",
  "new_frontiers_ui_shields_title": "Barrierer på helbredsbjælken",
  "new_frontiers_ui_shields_desc": "Vidste du, at Dota har skjolde? Magiske skjolde, fysiske skjolde, afotiske skjolde. Alle mulige skjolde! Måske har du misset dem. Eller mest ignoreret dem. For før kunne man ikke vide, hvor meget skjold man startede med, eller hvor meget man havde tilbage.<br><br>Men nu behøver du ikke leve i uvished. Nu kan du se alt. Eller i hvert fald disse to ting. Du kan endda se, hvilken slags skjold det er. For at fejre, hvor meget bedre alle disse gamle skjolde er med denne visuelle opgradering, har vi tilføjet en hel masse nye evner, som bruger dem.<br><br>Vi har også omdøbt dem fra skjolde til barrierer, så du ikke bliver forvirret og tror, at det er en fortrop på helbredsbjælken. Det var så lidt.",
  "new_frontiers_ui_health_pips_title": "Ikoner på helbredsbjælken",
  "new_frontiers_ui_health_pips_desc": "Nogle enheder har ikke traditionelle HP-puljer og kræver et vist antal angreb for at blive ødelagt. I stedet for det sædvanlige gætværk eller at tælle det hele i hovedet som et eller andet geni kan du nu bare se på den enhed, du vil dræbe. Du vil kunne se nogle små smarte ikoner, som repræsenterer, hvor mange angreb enheden kan klare, før den smøger støvets lænker af sig (citat fra Hamlets helbredsbjælke).",
  "new_frontiers_ui_health_cost_title": "HP-omkostning",
  "new_frontiers_ui_health_cost_desc": "Mens de fleste evner i Dota forbruger mana, er der nogle, som i stedet forbruger HP. Disse evner viser nu, hvor meget HP det rent faktisk koster at bruge dem. Ikke så tosset, hva'? Lidt vildt, at der ikke var nogen, der tænkte på det før. Nå, men nu står det der.",
  "new_frontiers_gameplay_update_desc": "Sikke da en lang liste med ting deroppe. Det eneste, som kan gøre det bedre, er [i]to[/i] lange lister med ting, men hvor finder vi... [i]hov, se her![/i] Læs videre for at se alle de andre balanceændringer, som denne opdatering har at byde på. Eller spring direkte ud i spillet! Tro os, du behøver ikke at fortælle os, hvor sjovt det er at læse tekniske håndbøger om computerspil, men altså, at spille dem kommer på en solid andenplads. Denne liste skal nok være her, når du kommer tilbage.",
  "new_frontiers_misc_title": "Diverse",
  "new_frontiers_misc_role_tokens": "Vi har reduceret antallet af rollekøpoletter, som tildeles, når du taber en kamp med alle roller valgt. Nu optjener du to poletter for et nederlag. (Du får stadig fire poletter for en sejr). Denne ændring burde hjælpe med at forbedre spilleradfærden med rangerede roller, hvor farmingpoletter nogle gange går forud for at spille effektivt med en valgt rolle.",
  "new_frontiers_misc_removed_roles": "Vi har fjernet Captains Mode fra rangerede kampe og strøget All Random og All Random Deathmatch fra ikke-rangerede kampe. Næsten ingen spiller disse tilstande, og køtiden overstiger nemt en time.",
  "new_frontiers_misc_model_editor": "Denne opdatering fjerner den gamle modeleditor. Alle .vmdl-filer indlæses nu i værktøjet, og gamle modeller konverteres, når du først indlæser dem i værktøjet. Vi udgiver en efterfølgende opdatering for helt at fjerne understøttelse til at indlæse det gamle kompilerede format, så vi opfordrer alle indholdsskabere i værkstedet til at indlæse og konvertere deres modeller til det nye format og kompilere dem igen snarest muligt.",
  "new_frontiers_misc_hold_animation": "Vi har fjernet understøttelse af den gamle \"HoldAnimation\"-nøgle fra de dynamiske egenskaber. Brugerdefinerede spil skal enten manuelt skifte til den nye \"loop mode\"-nøgle, eller deres baner skal kompileres igen for automatisk at opgradere egenskaberne.",
  "neutral_item_tier": "[b]Niveau %1$s[/b] – neutral genstand",
  "dota_ability_variable_health": "helbred",
  "dota_ability_variable_mana": "mana",
  "dota_ability_variable_armor": "rustning",
  "dota_ability_variable_damage": "skade",
  "dota_ability_variable_str": "styrke",
  "dota_ability_variable_int": "intelligens",
  "dota_ability_variable_agi": "agilitet",
  "dota_ability_variable_all": "alle attributter",
  "dota_ability_variable_primary_attribute": "primær attribut",
  "dota_ability_variable_attack": "angrebshastighed",
  "dota_ability_variable_hp_regen": "HP-regenerering",
  "dota_ability_variable_lifesteal": "livsstjæl",
  "dota_ability_variable_mana_regen": "mana-regenerering",
  "dota_ability_variable_mana_regen_aura": "mana-regenereringsaura",
  "dota_ability_variable_spell_amp": "evneskade",
  "dota_ability_variable_debuff_amp": "svækkelsesvarighed",
  "dota_ability_variable_move_speed": "bevægelseshastighed",
  "dota_ability_variable_evasion": "undvigelse",
  "dota_ability_variable_spell_resist": "magisk resistens",
  "dota_ability_variable_spell_lifesteal": "evnelivsstjæl",
  "dota_ability_variable_spell_lifesteal_creep": "evnelivsstjæl (kryb)",
  "dota_ability_variable_spell_lifesteal_hero": "evnelivsstjæl (helte)",
  "dota_ability_variable_selected_attrib": "valgt attribut",
  "dota_ability_variable_attack_range": "angrebsrækkevidde <font color='#7d7d7d'>(kun afstandskamp)</font>",
  "dota_ability_variable_attack_range_melee": "angrebsrækkevidde <font color='#7d7d7d'>(kun nærkamp)</font>",
  "dota_ability_variable_cast_range": "kasterækkevidde",
  "dota_ability_variable_status_resist": "statusresistens",
  "dota_ability_variable_projectile_speed": "projektilhastighed",
  "dota_ability_variable_manacost_reduction": "mana-omkostningsreduktion",
  "dota_ability_variable_cooldown_reduction": "nedkølingsreduktion",
  "dota_ability_variable_max_mana_percentage": "Maks. manabonus"
}