// 7027.js

{
  "language": "polish",
  "new_frontiers_gameplay_number": "Aktualizacja rozgrywki 7.33",
  "new_frontiers_title": "Aktualizacja Nowe Rubieże",
  "new_frontiers_title_short": "Nowe Rubieże",
  "new_frontiers_subtitle": "Nowa mapa, znaczące zmiany w rozgrywce i wiele więcej. Do odkrycia czeka cały nowy świat.",
  "new_frontiers_play_trailer": "Obejrzyj zwiastun",
  "new_frontiers_dota_team_intro": "Aktualizacja Nowe Rubieże wprowadza nową mapę, znaczące zmiany w rozgrywce, zmiany w systemie wyszukiwania gier i interfejsie oraz wiele, wiele więcej (nie żartujemy).<br><br>Jak wiele? Tak wiele, że ciężko to wszystko spamiętać i panikowaliśmy kilka dni, aż ktoś przypomniał sobie, że można to wszystko spisać. No i tak zrobiliśmy, dzięki czemu możemy zaczytywać się w tych zmianach, kiedy nam się żywnie spodoba. I wy też! Przewińcie niżej, by przekonać się o tym na własne oczy.",
  "new_frontiers_eldor_name": "Czarodziej Eldor",
  "new_frontiers_dota_team_name": "Zespół Dota",
  "new_frontiers_section_title_map": "Nowa mapa",
  "new_frontiers_section_title_major_gameplay": "Znaczące zmiany w rozgrywce",
  "new_frontiers_section_title_matchmaking": "System wyszukiwania gier",
  "new_frontiers_section_title_ui": "Interfejs użytkownika",
  "new_frontiers_section_title_gameplay_update": "Zmiany w balansie",
  "new_frontiers_map_introduction": "Mapa w Dota 2 została niebywale rozszerzona. Główny cel gry pozostaje ten sam – ścieżki nie zostały oddalone od siebie i wciąż zwycięstwo bądź porażkę określa to, co dzieje się na środku mapy.<br><br>Jednak dodatkowe 40% terenu pod ręką przekłada się na mrowie zasobów do zdobycia i nowe strategie do odkrycia. Pełnej zmiany doczekały się także obydwie główne dżungle, przetasowując pole widzenia znaków, ścieżki do zmylania przeciwników, miejsca do farmienia i wiele więcej.",
  "new_frontiers_map_subtitle": "Odkryjcie nowy świat",
  "new_frontiers_map_roshan_title": "Nowe domy Roshana",
  "new_frontiers_map_roshan_desc": "Roshan sprzedał swoją starą jamę przy rzece i garściami czerpie korzyści z nowych połaci terenu. Od teraz ma on [i]dwie[/i] nowe, fantastyczne jamy zlokalizowane w północno-zachodnim i południowo-wschodnim rogu mapy. Jest to raj dla miłośników jam, a tym dwóm czaru dodają przepiękne widoki na fontanny i szybki dojazd do ukrytych sklepów.<br><br>Najwidoczniej w ich pobliżu jest też siłownia, bo Roshan jest teraz jeszcze bardziej napakowany. Od teraz Roshan nie będzie już upuszczać Aghanim's Shard, a Cheese wypadnie z niego po drugiej zamiast po trzeciej śmierci. Za trzecim razem otrzymacie Refresher Shard lub Aghanim's Scepter, w zależności od tego, czy jest on w północnej, czy południowej jamie.",
  "new_frontiers_map_twin_gates_title": "Bliźniacze bramy",
  "new_frontiers_map_twin_gates_desc": "Dwie bramy łączą od teraz ze sobą narożniki mapy blisko wież na bezpiecznej ścieżce, pozwalając graczom na natychmiastową teleportację z jednej krawędzi mapy do drugiej.<br><br>Jest to zmiana w rozgrywce, ale jej następstwa dla świata gry i jego fabuły są oczywiste. Zgadliście: od dziś Dota 2 nieoficjalnie istnieje w ramach RUPM (Rozszerzonego Uniwersum Pac-Mana).",
  "new_frontiers_map_lotus_pools_title": "Baseny lotosu",
  "new_frontiers_map_lotus_pools_desc": "Baseny lotosu można znaleźć po lewej i prawej stronie mapy (w pobliżu miejsca pierwszego spotkania fal stworów). Okresowo wydają one owoce, które po zjedzeniu przyznają punkty zdrowia i many.<br><br>Te owoce można gromadzić, by następnie połączyć je w jeszcze większy, bardziej wartościowy owoc w późnej fazie gry. Z kolei te większe owoce można połączyć w [i]niewiarygodnie[/i] ogromny owoc. Co się stanie, jeśli połączycie te [i]niewiarygodnie[/i] ogromne owoce? Raczej nic (na pewno coś się stanie).",
  "new_frontiers_map_tormentors_title": "Dręczyciele",
  "new_frontiers_map_tormentors_desc": "Te dwa mocarne neutralne stwory pojawiają się obok każdej bazy po 20 minutach i obydwa są wypełnione po brzegi Odłamkami Aghanima. Jednak jest pewien haczyk, mianowicie taki, że są 2 haczyki: a) dręczyciele mają na podorędziu megatarcze, które odbijają większość zadanych im obrażeń prosto w was; b) stają się silniejsi za każdym razem, gdy ich zabijecie. Czyli prawdopodobnie trzeba będzie zebrać cały zespół, by pokonać jednego takiego bydlaka.<br><br>Dobra wiadomość jest taka, że tak jak w przypadku niedźwiedzi zostawiających w spokoju tych, co udają martwych (i zapewne udających się dalej, by rozszarpać inny cel, ale to szczegół), jeśli wy zostawicie ich w spokoju, to oni zostawią was.",
  "new_frontiers_map_watchers_title": "Obserwatorzy",
  "new_frontiers_map_watchers_desc": "Obserwatorzy są niczym dręczyciele, ale służą do obserwowania. Nie dają za wygraną. Nie znają bólu. Nie znają strachu. Ale rozleniwić się to już potrafią. Nie zaczną obserwować do momentu kliknięcia ich.<br><br>W momencie rozpoczęcia gry obserwatorzy są neutralni i nieaktywni, ale po aktywowaniu ich przyznają wizję na swoich obszarach na 7 minut lub do momentu wrogiego sabotażu, który ich tymczasowo wyłączy. Kiedy drużyna zabije Roshana, wszyscy obserwatorzy stają się jej sojusznikami.",
  "new_frontiers_map_barriers_title": "Bramy obrońcy",
  "new_frontiers_map_barriers_desc": "Bramy obrońcy łączą w sobie efekciarskie fantasy świata Dota z praktycznością drzwi waszego domu, które zamykacie, gdy idziecie zniszczyć Starożytnego w lokalnym warzywniaku. Jest to tylna furtka dla waszej bazy z przydatnym polem siłowym, które przepuszcza członków waszej drużyny i uniemożliwia wejście wrogom. Gdy oni szturmują przednie wejście, wy możecie wkradać i wykradać się tyłem.",
  "new_frontiers_map_wisdom_runes_title": "Runy mądrości",
  "new_frontiers_map_wisdom_runes_desc": "Odkrywajcie krawędzie mapy, by wydobyć runy mądrości przyznające premie do PD każdemu bohaterowi, który jest na tyle mądry, by takową ukraść. Runy mądrości pojawiają się blisko bazy, oferując łatwy w obronie sposób na to, by kiepsko idąca gra nie wymknęła się spod kontroli.",
  "new_frontiers_map_shield_runes_title": "Runy tarczy",
  "new_frontiers_map_shield_runes_desc": "Runy mocy przy rzece również mają coś nowego, a jest tym nowa i mocarna runa tarczy, która przyznaje barierę w postaci 50% maksymalnego zdrowia. Rzućcie się pod wieżę we wczesnej fazie gry, by zabić wroga, albo wpakujcie się na ślepo pod górę, by zapewnić niespodziankę sobie i waszym przeciwnikom.",
  "new_frontiers_map_named_regions_title": "Nazwane regiony",
  "new_frontiers_map_named_regions_desc": "Rozszerzona mapa zawiera wyraźnie odmienne regiony takie jak kopalnie, studnię, cmentarz i posąg, przez co jeszcze łatwiej dacie znać waszym członkom drużyny, gdzie akurat ktoś was zabija. Wszystkie jednostki w tych regionach zyskują modyfikatory statystyk z motywem danego regionu.",
  "new_frontiers_map_creep_camps_title": "12 nowych obozów stworów",
  "new_frontiers_map_creep_camps_desc": "Niektórym stworom znudziło się bycie ciągle zarzynanymi w dżungli i w związku z tym rozbiły 12 nowych obozów rozsianych po całej rozszerzonej mapie. Tak, abyście mogli je zarzynać i tam.",
  "new_frontiers_map_outpost_title": "Nowe posterunki",
  "new_frontiers_map_outpost_desc": "Na rozszerzonej mapie znajdują się 2 nowe posterunki. Oryginalne posterunki zostały przeniesione do nowych lokalizacji, co rodzi oczywiste pytanie, czy *na pewno* są one oryginalnymi. Niezła próba, Sokratesie: tak, są.",
  "new_frontiers_major_gameplay_features_desc": "Aktualizacja Nowe Rubieże wprowadza znaczne zmiany do waszych ulubionych bohaterów i systemów. I to na tyle znacznych, że nasz dział prawny doradził nam poinformować was, że niniejsza sekcja o rozgrywce jest [i]tak napakowana[/i] nowymi funkcjami definiującymi całą metę, że powinniście na spokojnie usiąść i pomyśleć, najlepiej na kolejne parę tygodni, abyście nie podjarali się na tyle, by wzywać straż pożarną.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Wyróżnieni bohaterowie",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Wszyscy bohaterowie zostali zbalansowani, ale niektórzy są bardziej zbalansowani od innych. Nasze reflektory kierujemy na kilkoro z nich.",
  "new_frontiers_major_gameplay_new_items_title": "Nowe przedmioty",
  "new_frontiers_major_gameplay_new_items_desc": "Na wszystkie wasze zakupowe potrzeby.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Nowe przedmioty neutralne",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Dorzucamy do puli 7 całkowicie nowych przedmiotów neutralnych i przywracamy kilkoro starych ulubieńców.",
  "new_frontiers_major_gameplay_bkb_title": "Przerobiony Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Od teraz aktywacja Black King Bara nakłada zwykłe rozproszenie oraz przyznaje 50% odporności na magię i niewrażliwość na działanie negatywnych efektów. Dodatkowo otrzymujecie też niewrażliwość na pełne i odbite obrażenia.<br><br>Ale uwaga: jeśli aktywacja Black King Bara wygaśnie przed zakończeniem negatywnych efektów, to te efekty zostaną nałożone na pozostały im czas. Efekty pomijające niewrażliwość na czary od teraz także pomijają niewrażliwość na negatywne efekty.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Nowy typ atrybutu bohatera",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Void Spirit, czwarty z udostępnionych duchowych braci, nie powinien był być bohaterem, którego głównym atrybutem jest Siła, Zręczność czy Inteligencja. Aby wyróżniał się z tłumu, powinien on być bohaterem nowego rodzaju. [i]Czwartego[/i] rodzaju.<br><br>Przedstawiamy bohaterów uniwersalnych – grupę postaci o nowej głównej statystyce złożoną z istniejących bohaterów. Zyskują oni 0,6 pkt. obrażeń za każdą statystykę (dowolnego atrybutu). Nasi inżynierowie zapewniają nas, że ta wartość jest idealnie zbalansowana. No chyba że nie jest. Dobra wiadomość jest taka, że wkrótce wszyscy razem przekonamy się o tym w czekającej na nas wielkiej przygodzie, jaką jest aktualizacja Nowe Rubieże.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Przerobione zdobywanie przedmiotów neutralnych",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Mordowanie leśnych stworów oznaczało wcześniej zdobycie nowego, fajnego przedmiotu neutralnego... który zazwyczaj wędrował do gracza carry, którymi zazwyczaj wy nie byliście. Od teraz zabicie neutralnego stwora losowo przyznaje żeton, który pozwala wam wybrać spośród [i]pięciu[/i] dostępnych neutralnych przedmiotów. Każdy żeton oferuje dostęp do wszystkich 5 opcji, więc nawet ostatni gracz wymieniający swój żeton ma prawdziwy wybór.<br><br>Członkowie drużyny mogą przekazywać żetony między sobą, ale wybranym przedmiotem już nie można się podzielić, więc dysponujcie swoimi żetonami rozważnie.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Skalowanie neutralnych stworów",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Od teraz neutralne stwory oraz ich zdolności skalują się w czasie. Tak, ciężej będzie czyścić obozy w miarę postępu gry, ale bohaterowie zdolni do przejmowania kontroli nad innymi jednostkami zyskają potężne wsparcie.",
  "new_frontiers_major_gameplay_kill_formula_title": "Przerobiony wzór obliczania wartości za zabójstwa",
  "new_frontiers_major_gameplay_kill_formula_desc": "Przerobiliśmy ten wzór, by przyłożyć większą wagę do zabójstw we wczesnej fazie gry i zachęcić graczy do gankowania innych ścieżek. Zmniejszyliśmy także skalowanie złota za stwory na ścieżkach, czyniąc farmienie ich mniej opłacalnym oraz zachęcając graczy do farmienia siebie nawzajem.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Odgłuszająca nowa funkcja",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Granie waszym bohaterem zawsze daje więcej frajdy niż sterczenie jak kogut i niegranie nim. No cóż, fani grania w grę oraz krytycy niegrania w grę, wasze marzenia właśnie się spełniły: przygotujcie się na granie waszym bohaterem więcej niż kiedykolwiek.<br><br>Jak? Normalnie. Skróciliśmy czas trwania prawie każdej umiejętności wyłączającej was z gry. Jak wpadliśmy na ten szalony plan? Jeszcze normalniej. Przyjęliśmy ryk Beastmastera prosto w twarz i nagle znalazło się mnóstwo czasu na rozmyślania.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Po dwóch miesiącach nawiedzania ścieżek Muerta wreszcie znalazła swój Odłamek i Berło Aghanima. Jeśli jeszcze nie sprawdziliście jej w akcji, poznajcie ją bliżej na [url=https://www.dota2.com/deadreckoning]stronie aktualizacji Porachunków Umarłych[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi jest zbyt tępy, by być bohaterem Inteligencji. Więc już nim nie jest.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa od teraz rozpoczyna jako malutkie dziecko, ale niczym każde dziecko, staje się silniejsze wraz z upływem czasu.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Od teraz większość umiejętności Clinkza, niczym najlepsze umiejętności w życiu, tworzy szkielety.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden tworzył wcześniej idealnego klona samego siebie. Ale teraz tworzy [i]lepszą[/i] wersję samego siebie! Albo gorszą! Tak czy siak, jest inna. I nie wzbudza kontrowersji (chyba).",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Jaki bohater, tacy i gracze: Alchemist jest teraz chciwy przez cały czas.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "OGRANICZONA CZASOWO PREMIA DLA ARC WARDENA",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Jeśli wybierzecie Arc Wardena, grając po stronie Mrocznych, głównym bohaterem będzie klon z umiejętności Tempest Double, a użycie tejże przyzwie jego „normalne” wcielenie. Akcja trwa przez ograniczony czas od wydania aktualizacji (lub do wyczerpania zapasów).",
  "new_frontiers_matchmaking_desc": "Bądźmy szczerzy: na świecie żyje 8 miliardów ludzi i jakieś 99,99% z nich jest słabych w Dota 2. To oznacza, że dobieranie meczów stanowi wyzwanie, zwłaszcza jeśli jesteście zdolnymi graczami i akurat lubicie grać z ludźmi, którzy są prawie, ale miejmy nadzieję, że nie do końca, tak dobrzy jak wy. Zajęliśmy się trochę robotą i trochę matematyką, by usprawnić jakość systemu wyszukiwania rozgrywek dla graczy na każdym poziomie umiejętności.",
  "new_frontiers_matchmaking_intro_title": "Pewne wyszukiwanie gier",
  "new_frontiers_matchmaking_intro_desc": "Punkty rankingowe (MMR) składają się tak naprawdę z dwóch liczb: rangi i pewności rangi. Wasza ranga jest szacunkiem waszych umiejętności, a pewność rangi jest naszą pewnością na temat tego szacunku. Kiedy rozgrywacie mecz, dostosowujemy waszą rangę na podstawie tego, czy wygracie, czy przegracie. Wasza pewność rangi również rośnie, ponieważ od teraz mamy więcej danych.",
  "new_frontiers_matchmaking_details_old_title": "Niechciane gromadzenie to najgorsze gromadzenie",
  "new_frontiers_matchmaking_details_old_desc": "Z historycznego punktu widzenia Dota 2 korzystała ze zmodyfikowanej wersji algorytmu Elo, by wdrażać zmiany w systemie obliczania rangi i pewności rangi. Jednak z czasem zauważyliśmy kilka problemów związanych z tym podejściem. Przykładowo, dystrybucja punktów MMR stopniowo przesuwała się w dół, powodując niepożądany nadmiar graczy w przedziale 0 – 1000 MMR. Innym problemem było to, że gracze wracający do gry po przerwie mieli trudności z powrotem do ich prawidłowej wartości MMR, ponieważ poprzednia ranga już nie odzwierciedlała ich umiejętności.",
  "new_frontiers_matchmaking_details_new_title": "Nowe i ulepszone gromadzenie",
  "new_frontiers_matchmaking_details_new_desc": "Aby odnieść się do tej sprawy, zmieniamy używany algorytm na Glicko. Powinno to umożliwić szybsze i dokładniejsze dobieranie was do gier z innymi graczami na podobnym poziomie umiejętności. Od strony matematycznej Glicko pozwala nam na lepsze uwzględnienie pewności rangi gracza w naszych obliczeniach, co przekłada się na trafniejsze decyzje dotyczące przyrostów i strat w randze.\\n\\nPrzejście na nowy system wyszukiwania gier będzie niemal jak rozpoczęcie nowego sezonu: [list][*]Wszyscy gracze zostaną umieszczeni z powrotem w krótkim trybie kalibracyjnym, wstępnie posortowanym według ich poprzedniej rangi.\\n[*]Proces kalibracji nie trwa już przez określoną liczbę meczy. Zamiast tego ranga gracza zostaje uznana za skalibrowaną po osiągnięciu danego progu pewności rangi.\\n[*]Po kalibracji może się okazać, że otrzymacie inny medal niż wcześniej. Jednak nawet jeśli znacznie się on zmieni, możecie spodziewać się dołączenia do meczów z graczami o podobnym poziomie umiejętności.\\n[*]Mecze nie będą już miały określonej wartości dodawanych/odejmowanych punktów MMR. Będzie to zmienna opierająca się na wielu czynnikach, w tym randze i pewności rangi uczestników. Mimo tego te wartości będą miały swój limit, by zapobiec poszczególnym negatywnym wynikom.\\n[*]Pewność rangi gracza będzie powoli maleć z czasem, jeśli gracz nie rozgrywa meczów.[/list]Zakulisowo używaliśmy obydwu systemów wyszukiwania gier już od jakiegoś czasu, by zwiększyć naszą pewność dotyczącą tych zmian. Rozumiemy, że trafne odzwierciedlenie MMR jest tylko jednym z wielu czynników wpływających na jakość meczu i, tak jak w przypadku wszelkich zmian w tej kwestii, jesteśmy otwarci na wasze opinie.",
  "new_frontiers_matchmaking_immortals_title": "Wyszukiwanie gier tylko dla nieśmiertelnych",
  "new_frontiers_matchmaking_immortals_desc": "W spotkaniach w randze nieśmiertelnych znajomość innych graczy, zgranie się z nimi i wybór odpowiedniego zrównoważenia ról ma większe znaczenie niż tylko sam MMR. Dlatego zmieniliśmy projekt systemu wyszukiwania gier dla tej rangi, by uwzględnić te czynniki.<br><br>Mecze w randze nieśmiertelnych nie będą już korzystały z odgórnie ustalonych drużyn. Teraz to kapitanowie będą wybierać sposród pozostałej ósemki graczy, co przełoży się na większy wpływ drużyny w porównaniu do tego, jak przydzieliłby was system na podstawie MMR. Tak że jeśli od teraz wasze mecze będą do bani, nie będziecie już mieli na kogo zwalać winy, nieśmiertelni.",
  "new_frontiers_ui_desc": "Niewyraźny wzrok i przeszywający ból przez całą rękę? Radzimy to zignorować, to po prostu sposób, w jaki wasze ciało mówi wam, że jest głodne. Złapaliscie gumę? Jedźcie na feldze, w końcu też jest okrągła. Pointa jest taka, że w sumie to wszystko w życiu można bezpiecznie zignorować bez żadnych konsekwencji.<br><br>Oprócz pasków zdrowia w Dota. Te akurat są ważne. Dlatego parę elementów interfejsu związanych ze zdrowiem otrzymało ogrom ulepszeń w tej aktualizacji.",
  "new_frontiers_ui_shields_title": "Bariery paska zdrowia",
  "new_frontiers_ui_shields_desc": "Wiedzieliście, że Dota 2 ma tarcze? Tarcze magiczne, fizyczne, afotyczne. Tarcze wszelkiego rodzaju! Może umknęły waszej uwadze. Albo w większości celowo je zignorowaliście, bo nie było sposobu na określenie, z jak wielką tarczą rozpoczęliście i ile wam jej jeszcze zostało.<br><br>Jednak ciemne wieki niepewności dobiegły końca dzisiaj. Od teraz widzicie wszystko, nawet to, jakiego rodzaju jest dana tarcza. Aby uczcić wielkość kopa, jakiego dostały te wszystkie stare tarcze dzięki temu graficznemu ulepszeniu, dodaliśmy sporo nowych umiejętności z udziałem tarcz.<br><br>Zmieniliśmy także ich nazwę z tarcz na bariery, tak byście się nie zdziwili, że nagle na waszym pasku zdrowia odpalił się efekt Vanguarda. Nie ma za co.",
  "new_frontiers_ui_health_pips_title": "Wskaźniki paska zdrowia",
  "new_frontiers_ui_health_pips_desc": "Niektóre jednostki nie mają tradycyjnych wartości punktów zdrowia i w związku z tym wymagają określonej liczby ataków, by je zniszczyć. Od teraz zamiast tradycyjnej zgadywanki lub dokonywania obliczeń w myślach niczym szalony geniusz możecie po prostu spojrzeć na jednostkę, którą chcecie zamordować. Ujrzycie wtedy poręczny wskaźnik ilustrujący liczbę ciosów, jakie jednostka przyjmie, zanim każe waściom skończyć i wstydu oszczędzić (cytat z paska zdrowia Kmicica).",
  "new_frontiers_ui_health_cost_title": "Koszt zdrowia",
  "new_frontiers_ui_health_cost_desc": "Mimo że większość umiejętności w Dota wykorzystuje manę, niektóre z nich wykorzystują zdrowie. Od teraz te umiejętności wyświetlają faktyczny koszt w zdrowiu, jaki trzeba ponieść, by ich użyć. Niezłe, co? Do pewnego stopnia zdumiewające, że nikt na to nie wpadł wcześniej. Na szczęście już nie musi.",
  "new_frontiers_gameplay_update_desc": "Całkiem spora ta lista powyżej. Jedyne, co mogłoby ją ulepszyć, to sporządzenie [i]drugiej[/i] takowej, ale gdzie byśmy znaleźli na to miejsce... No nie wiem, może zaraz poniżej. [i]Cóż za przypadek![/i] Czytajcie dalej, by poznać inne zmiany w balansie rozgrywki, jakie przygotowaliśmy w ramach tej aktualizacji. Albo wskoczcie prosto do gry i przekonajcie się sami. Wierzcie nam, nie musicie nam mówić, ile frajdy sprawia czytanie poradników technicznych do gier komputerowych. Za to wszyscy dobrze wiemy, że granie w nie zajmuje pewne, drugie miejsce. Ta lista będzie na was czekała.",
  "new_frontiers_misc_title": "RÓŻNE",
  "new_frontiers_misc_role_tokens": "Zmniejszyliśmy liczbę żetonów roli przyznawanych po tym, jak przegracie mecz, przed którym wybraliście wszystkie role. Od teraz będziecie zdobywać dwa żetony za przegraną (za wygraną wciąż będą przyznawane cztery żetony). Ta zmiana powinna pomóc w poprawie zachowania graczy w meczach rankingowych z wybieranymi rolami, w których to farmienie żetonów niekiedy stanowi priorytet względem efektywnej gry w przypisanej roli.",
  "new_frontiers_misc_removed_roles": "Usunęliśmy tryb Captains Mode z gier rankingowych oraz All Random i All Random Deathmatch z nierankingowych. Prawie nikt nie grał w te tryby, a czas oczekiwania na mecze spokojnie przekraczał godzinę.",
  "new_frontiers_misc_model_editor": "W tej aktualizacji usunięty został starszy edytor modeli. Wszystkie pliki w formacie .vmdl będą od teraz wczytywane w nowym narzędziu, a stare modele zostaną przekonwertowane po pierwszym przesłaniu ich do niego. W aktualizacji, którą wydamy później, całkowicie usuniemy obsługę wczytywania starego formatu kompilacji, zatem zachęcamy wszystkich twórców warsztatu do wczytywania i konwertowania swoich modeli do nowego formatu i dokonywania ich ponownej kompilacji tak szybko jak to tylko możliwe.",
  "new_frontiers_misc_hold_animation": "Usunęliśmy obsługę starszego klucza „HoldAnimation” z dynamicznych rekwizytów. Twórcy gier niestandardowych powinni albo ręcznie przełączyć je na nowy klucz „trybu zapętlenia” lub ponownie skompilować mapy dla nich, by te właściwości zostały ulepszone automatycznie.",
  "neutral_item_tier": "Przedmiot neutralny [b]%1$s. stopnia[/b]",
  "dota_ability_variable_health": "pkt. zdrowia",
  "dota_ability_variable_mana": "pkt. many",
  "dota_ability_variable_armor": "pkt. pancerza",
  "dota_ability_variable_damage": "pkt. obrażeń",
  "dota_ability_variable_str": "Siły",
  "dota_ability_variable_int": "Inteligencji",
  "dota_ability_variable_agi": "Zręczności",
  "dota_ability_variable_all": "pkt. do wszystkich atrybutów",
  "dota_ability_variable_primary_attribute": "pkt. głównego atrybutu",
  "dota_ability_variable_attack": "jedn. szybkości ataku",
  "dota_ability_variable_hp_regen": "pkt. regeneracji zdrowia",
  "dota_ability_variable_lifesteal": "kradzieży zdrowia",
  "dota_ability_variable_mana_regen": "pkt. regeneracji many",
  "dota_ability_variable_mana_regen_aura": "jedn. aury regeneracji many",
  "dota_ability_variable_spell_amp": "obrażeń od czarów",
  "dota_ability_variable_debuff_amp": "czasu trwanie negatywnych efektów",
  "dota_ability_variable_move_speed": "jedn. szybkości ruchu",
  "dota_ability_variable_evasion": "szansy na unik",
  "dota_ability_variable_spell_resist": "odporności na magię",
  "dota_ability_variable_spell_lifesteal": "kradzieży zdrowia z czarów",
  "dota_ability_variable_spell_lifesteal_creep": "kradzieży zdrowia z czarów (stwory)",
  "dota_ability_variable_spell_lifesteal_hero": "kradzieży zdrowia z czarów (bohaterowie)",
  "dota_ability_variable_selected_attrib": "pkt. wybranego atrybutu",
  "dota_ability_variable_attack_range": "jedn. zasięgu ataku <font color='#7d7d7d'>(tylko dla dystansowych)</font>",
  "dota_ability_variable_attack_range_melee": "jedn. zasięgu ataku <font color='#7d7d7d'>(tylko walczący wręcz)</font>",
  "dota_ability_variable_cast_range": "jedn. zasięgu rzutu",
  "dota_ability_variable_status_resist": "odporności na statusy",
  "dota_ability_variable_projectile_speed": "jedn. szybkości pocisku",
  "dota_ability_variable_manacost_reduction": "redukcji kosztu many",
  "dota_ability_variable_cooldown_reduction": "skrócenia czasów oczekiwania",
  "dota_ability_variable_max_mana_percentage": "pkt. premii do maks. many",
  "dota_ability_variable_aoe_bonus": "jedn. premii do obszaru działania"
}