// 7589.js

{
  "language": "korean",
  "new_frontiers_gameplay_number": "7.33 게임플레이 업데이트",
  "new_frontiers_title": "신개척자 업데이트",
  "new_frontiers_title_short": "신개척자",
  "new_frontiers_subtitle": "새로운 지도, 주요 게임플레이 변경, 그 외 아주 많은 사항으로 완전히 달라진 세계가 새롭게 펼쳐집니다.",
  "new_frontiers_play_trailer": "소개 영상 보기",
  "new_frontiers_dota_team_intro": "신개척자 업데이트에서는 새로운 지도, 주요 게임플레이 변경, 매치메이킹 변경, 사용자 인터페이스 변경, 그리고 농담이 아니라 정말로 훨씬 더 많은 내용이 담겨 있습니다.<br><br>얼마나 더 있느냐고요? 솔직히 너무 많아 다 기억하기가 어려울 정도여서, 며칠 동안 당황하고 있는데 누군가 그냥 다 적어 놓으면 되는 일 아니냐고 하더군요. 그래서 그렇게 했습니다. 이제 다 적어 놓았으니 언제든 읽고 싶을 때 읽어볼 수 있습니다. 여러분도 그러면 되고요! 이제 스크롤을 시작해 보세요.",
  "new_frontiers_eldor_name": "마법사 엘도르",
  "new_frontiers_dota_team_name": "도타 팀",
  "new_frontiers_section_title_map": "새로운 지도",
  "new_frontiers_section_title_major_gameplay": "주요 게임플레이 변경 사항",
  "new_frontiers_section_title_matchmaking": "매치메이킹",
  "new_frontiers_section_title_ui": "사용자 인터페이스",
  "new_frontiers_section_title_gameplay_update": "밸런스 변경 사항",
  "new_frontiers_map_introduction": "도타 지도가 엄청나게 확장되었습니다. 게임의 핵심 목표 지점은 그대로 유지됩니다. 전선이 상대방과 더 멀어지지 않고, 승리에 필요한 모든 사항은 여전히 지도의 중심부에 있습니다.<br><br>하지만 지형이 40% 더 커지면서, 새로운 자원을 획득하고, 새로운 전략을 개발할 여지가 아주 많아졌습니다. 주 정글도 완전히 재구성되어, 시야 위치, 빠져나가기 경로, 파밍 등이 대대적으로 달라졌습니다.",
  "new_frontiers_map_subtitle": "새로운 세상을 탐험하라",
  "new_frontiers_map_roshan_title": "로샨의 새 거처",
  "new_frontiers_map_roshan_desc": "로샨은 강의 오래된 굴을 팔고 새로운 부지의 모든 것을 이용하고 있습니다. 이제 지도의 북서쪽과 남동쪽 구석에 환상적인 새 굴 [i]2곳[/i]을 마련했습니다. 분수가 살짝 보이는 전망에, 비밀 상점 상권에 포함되기에, 굴 애호가들에게는 최고의 입지가 아닐 수 없습니다.<br><br>로샨이 그 어느 때보다 체력을 단련했기에, 이 굴은 반드시 체육관 근처여야 합니다. 이제는 로샨에게서 아가님의 파편이 나오지 않으며, 3번째가 아닌 2번째로 죽었을 때 치즈가 나옵니다. 3번째 죽었을 때는 북쪽 굴에 있었는지 남쪽 굴에 있었는지에 따라 재생의 파편이나 아가님의 홀이 나옵니다.",
  "new_frontiers_map_twin_gates_title": "쌍둥이 관문",
  "new_frontiers_map_twin_gates_desc": "안전 전선 포탑 근처의 쌍둥이 관문이 지도 모서리를 연결함으로써, 플레이어는 한쪽 구석에서 다른 쪽 구석으로 즉시 순간이동할 수 있습니다.<br><br>게임플레이 변경이긴 하지만, 배경 설정에도 분명한 영향을 미칩니다. 맞습니다. 도타 2는 이제 비공식적으로 PMEU(팩맨 확장 유니버스)의 일부가 되었습니다.",
  "new_frontiers_map_lotus_pools_title": "연꽃 연못",
  "new_frontiers_map_lotus_pools_desc": "이제 지도의 좌우 측(크립이 처음으로 만나는 지점 근처)에 연꽃 연못이 생겼습니다. 연못에서는 주기적으로 열매가 생성되고, 해당 열매를 먹으면 마나와 체력이 회복됩니다.<br><br>플레이어는 이 열매를 비축해 놓을 수도 있고, 게임 후반에 더 큰 상급 열매로 합칠 수도 있습니다. 더 큰 열매는 다시 [i]엄청나게[/i] 큰 열매로 합칠 수도 있습니다. [i]엄청나게[/i]큰 열매를 합치면 어떻게 될까요? 아마 별것 없겠죠. (분명 뭔가가 있겠죠.)",
  "new_frontiers_map_tormentors_title": "압제자",
  "new_frontiers_map_tormentors_desc": "이 강력한 중립 크립은 20분 후 양쪽 기지 근처에 두 개체가 생성되는데, 아가님의 파편을 잔뜩 지니고 있습니다. 하지만, 애로사항이 하나 있습니다. 그 애로사항이란 2가지 애로사항이 있다는 것입니다. 1) 압제자는 상급 보호막으로 둘러싸여 있어 가하는 피해 대부분을 반사합니다. 2) 처치할 때마다 점점 더 강해집니다. 따라서, 한 번 처치할 때 팀 전체가 힘을 모아야 할 겁니다.<br><br>안심이 되는 부분이 있다면, 나는 무시하고 등산객을 공격하려는 곰처럼, 건드리지 않으면 압제자도 나를 건드리지 않는다는 점입니다.",
  "new_frontiers_map_watchers_title": "감시자",
  "new_frontiers_map_watchers_desc": "감시자는 터미네이터와 비슷하지만, 감시가 주 역할입니다. 집요합니다. 고통도 모릅니다. 두려움도 모릅니다. 하지만 게으릅니다. 클릭할 때까지는 감시를 시작하지 않습니다.<br><br>감시자는 게임 시작 시 비활성화된 채로 중립 상태를 유지하지만, 활성화되고 나면 7분 동안, 아니면 적이 방해해서 일시적으로 비활성화할 때까지 감시자가 있는 구역의 시야를 제공합니다. 한 팀에서 로샨을 처치하면, 모든 감시자가 해당 팀의 편이 됩니다.",
  "new_frontiers_map_barriers_title": "수호자의 관문",
  "new_frontiers_map_barriers_desc": "수호자의 관문은 고대의 요새를 무너뜨릴 수 있도록 반짝이는 도타의 초현실 환상 세계와 장 보러 갈 때 잠가 놓는 현관문의 현실성을 결합한 것입니다. 기지로 가는 뒷문으로서, 편리한 역장이 있어 아군은 통과시키고 적군은 막습니다. 적이 정면에서 공격해 들어올 때, 뒤로 몰래 들어왔다 나갔다를 할 수 있습니다.",
  "new_frontiers_map_wisdom_runes_title": "지혜 룬",
  "new_frontiers_map_wisdom_runes_desc": "지도의 가장자리를 탐험하며 지혜 룬을 캐내 보세요. 지혜 룬을 훔칠 만큼 지혜가 있는 영웅이라면 경험치를 얻습니다. 지혜 룬은 기지 근처에 생성되며 지키기가 쉬워, 전세가 불리했던 게임이 걷잡을 수 없는 상태까지 되지 않도록 막아주는 역할을 합니다.",
  "new_frontiers_map_shield_runes_title": "보호 룬",
  "new_frontiers_map_shield_runes_desc": "강에 있는 강화 룬에도 새롭게 강력한 '보호 룬'이 추가되어 최대 체력의 50%를 방어막으로 제공합니다. 게임 초반에 처치를 노리며 포탑 위치로 뛰어들거나, 자신과 적 모두 깜짝 놀라는 상황에 놓일 것을 두려워하지 않고 시야가 없는 언덕으로 거침없이 올라가 볼 수도 있습니다.",
  "new_frontiers_map_named_regions_title": "구역별 명칭 부여",
  "new_frontiers_map_named_regions_desc": "확장된 지도에서는 광산, 우물, 묘지, 조각상과 같이 구역이 뚜렷이 구별되도록 하여, 자신이 적군에게 당하는 위치를 팀원에게 정확히 알려주기가 아주 쉬워졌습니다. 해당 구역 안의 모든 유닛의 능력치에는 해당 구역별로 고유한 변경 요인이 적용됩니다.",
  "new_frontiers_map_creep_camps_title": "새로운 크립 야영지 12곳",
  "new_frontiers_map_creep_camps_desc": "일부 크립이 정글에서 내내 죽어 나가는 일이 지겨워진 나머지 넓어진 지도 여기저기에 새로운 야영지 12곳을 세웠습니다. 이제 새로운 야영지에서 계속 죽어 나가면 됩니다.",
  "new_frontiers_map_outpost_title": "새로운 전초기지",
  "new_frontiers_map_outpost_desc": "새롭게 확장된 지도에는 새로운 전초기지 2곳이 생겼습니다. 기존 전초기지는 새로운 위치로 옮겨졌기에 과연 원래 있었던 진짜 전초기지인지 하는 의문이 들 수밖에 없는 상황입니다. 소크라테스가 따로 없네요. 진짜 전초기지 맞습니다.",
  "new_frontiers_major_gameplay_features_desc": "신개척자 업데이트로 여러분이 좋아하는 영웅과 시스템에는 커다란 변화가 생겨납니다. 사실, 저희 법무팀에서는 본 게임플레이 부문이 메타를 규정하는 신규 기능 설명으로 [i]아주 빽빽하게 채워져 있으므로[/i], 앞으로 몇 주에 걸쳐 천천히 읽어 내려가야 과도한 자극으로 119를 부르는 일이 없을 것임을 미리 고지하도록 조언했습니다.",
  "new_frontiers_major_gameplay_hero_reworks_title": "영웅 집중 분석",
  "new_frontiers_major_gameplay_hero_reworks_desc": "모든 영웅의 밸런스가 조정되었는데, 더 많이 조정된 영웅이 일부 있습니다. 그중 몇몇을 여기에서 소개합니다.",
  "new_frontiers_major_gameplay_new_items_title": "새로운 아이템",
  "new_frontiers_major_gameplay_new_items_desc": "어떤 구매 욕구든 만족시킬 수 있도록.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "새로운 중립 아이템",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "새로운 중립 아이템 7가지가 추가되고, 이전에 인기 있었던 아이템 몇 가지가 되돌아왔습니다.",
  "new_frontiers_major_gameplay_bkb_title": "칠흑왕의 지팡이 개편",
  "new_frontiers_major_gameplay_bkb_desc": "칠흑왕의 지팡이를 활성화하면 기본 해제가 적용되며 마법 저항력 50%와 약화 효과 면역을 부여합니다. 활성화 상태에서는 약화 효과의 해로운 효과가 적용되지 않습니다. 아울러, 순수 및 반사 피해에도 면역이 됩니다.<br><br>하지만, 주의해야 할 점이 있습니다. 칠흑왕의 지팡이 효과가 다른 약화 효과의 지속시간보다 먼저 만료되면, 남은 시간만큼 약화 효과가 적용됩니다. 마법 면역을 관통하는 효과는 약화 효과 면역도 관통합니다.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "새로운 영웅 속성 유형",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "네 번째 령으로 출시된 공허령은 힘이나 민첩이나 지능 영웅이 될 수 없습니다. 다른 령과 확실히 구별되도록, 새로운 유형의 영웅이 되어야 했습니다. 바로 [i]4번째[/i] 유형 말입니다.<br><br>'복합' 영웅을 소개합니다. 기존 여러 속성의 영웅으로 구성된 신규 주 능력치 그룹으로, 각 능력치에서 공격력 0.6을 얻습니다. 엔지니어들은 이 수치가 완벽하게 균형 잡혀 있다고 장담합니다. 그렇지 않을 수도 있지만요. 어쨌거나 좋은 소식은, 우리 모두 신개척자 업데이트라는 대모험에서 다 함께 그 진위를 확인해볼 수 있다는 사실입니다.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "중립 아이템 획득 개편",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "숲의 생물체를 처치하는 일은 보통 멋진 중립 아이템을 새로 획득한다는 것을 의미했습니다... 그러나 보통 그 아이템은 캐리에게 가지 나한테 오지 않았습니다. 이제 중립 크립을 처치하면 무작위로 주화가 나오는데, 그 주화로 가능한 중립 아이템 [i]5개[/i] 중에서 선택할 수 있습니다. 주화마다 5가지 선택권이 모두 주어지므로, 마지막으로 주화를 교환하는 플레이어도 괜찮은 선택을 할 수 있습니다.<br><br>같은 팀끼리는 누구에게나 주화를 사용하도록 줄 수 있지만, 아이템을 선택한 다음에는 공유할 수 없으니 신중하게 나눠주시기 바랍니다.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "중립 크립의 지속적 향상",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "중립 크립과 능력은 지속하여 향상됩니다. 그렇습니다. 시간이 지날수록 야영지를 소탕하기가 점점 더 어려워지겠지만, 크립을 조종하는 능력이 있는 영웅에게는 든든한 지원군이 될 겁니다.",
  "new_frontiers_major_gameplay_kill_formula_title": "처치 공식 개편",
  "new_frontiers_major_gameplay_kill_formula_desc": "게임 초반이 좀 더 중요한 의미를 띠고, 플레이어들이 다른 전선으로 갱킹을 갈 동기 부여가 되도록 처치 공식을 개편했습니다. 또한, 전선 크립의 골드 향상 비율을 축소하여, 게임이 진행될수록 크립 파밍의 수익성이 줄어들면서 플레이어들이 상대방 처치로 골드를 획득하는 쪽을 선택하게끔 했습니다.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "기절초풍하지 않을 새 기능",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "영웅을 플레이하는 일은 언제나 플레이하지 않고 가만히 있는 것보다 더 재밌습니다. 자, 무언가를 플레이하기 좋아하는 분들과 플레이하지 않는 것을 못 견뎌 하는 분들 모두의 꿈이 이루어졌습니다. 이제 그 어느 때보다 더 많이 영웅을 움직여야 할 준비를 하시기 바랍니다.<br><br>어떻게 하냐고요? 쉽습니다. 게임에서 거의 모든 무력화의 지속시간을 단축했거든요. 이렇게 미친 생각은 어떻게 했냐고요? 그건 더 쉬웠습니다. 야수지배자 궁극기인 '태고의 포효'를 정면에서 맞으니 갑자기 생각할 시간이 잔뜩 생기더군요.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "두 달 동안 전선에 출몰한 후에야, 무에르타는 드디어 아가님의 홀과 파편 효과를 얻었습니다. 아직 무에르타를 모른다면, [url=https://www.dota2.com/deadreckoning]죽음의 심판 업데이트[/url] 페이지에서 알아보시기 바랍니다.",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "오거 마법사는 지능 영웅이라기엔 너무 멍청합니다. 그래서 이제는 다른 영웅이 되었습니다.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "메두사는 이제 시작할 땐 아기처럼 약한 존재이지만, 그야말로 아기가 자라듯 시간이 지나면서 점점 더 강해집니다.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "클링츠의 능력 대부분이 이제 해골을 생성합니다. 인생 최고의 능력 같군요.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "번개 감시자는 자신을 완벽하게 복제한 존재를 만들어 냈었습니다. 하지만 이제는 자기보다 [i]더 나은[/i] 존재를 만듭니다! 더 못한 존재든가요! 어느 쪽이든, 자신과 다르게 만듭니다. 논란의 여지는 없을 겁니다. 저희 생각에는 아무튼 그렇습니다.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "영웅 연금술사는 모든 연금술사 플레이어와 마찬가지로, 본질이 탐욕스럽습니다.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "번개 감시자 기간 한정 보너스",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "기간 한정으로만, 다이어로 번개 감시자를 플레이할 때 이중 폭풍이 주 영웅이 되고, 궁극기를 시전하면 '보통의' 번개 감시자가 소환됩니다.",
  "new_frontiers_matchmaking_desc": "솔직히 말해 봅시다. 지구에는 80억 명의 사람이 있고, 그중 99.99%는 도타를 끔찍하게 못합니다. 다시 말해, 매치메이킹은 어려운 일이며 특히 도타를 잘하면서 자신만큼 잘할 리 없는 사람들과 플레이하는 것을 좋아하는 분들한테는 더더욱 그렇다는 뜻입니다. 저희는 여러 가지 작업과 여러 가지 계산을 시행해 모든 실력 수준에서 전반적인 매치메이킹 품질이 향상되도록 했습니다.",
  "new_frontiers_matchmaking_intro_title": "신뢰할 수 있는 매치메이킹",
  "new_frontiers_matchmaking_intro_desc": "매치메이킹 등급(MMR)은 단 두 가지 숫자로 이루어져 있습니다. 바로 랭크와 랭크 신뢰도입니다. 랭크는 실력을 추산한 것이고, 랭크 신뢰도는 그 추산에 대한 저희의 신뢰도입니다. 여러분이 매치를 플레이하면 승패에 따라 랭크가 조정됩니다. 랭크 신뢰도 또한 상승하는데, 그 이유는 저희에게 데이터가 더 확보되었기 때문입니다.",
  "new_frontiers_matchmaking_details_old_title": "달갑지 않은 군집: 최악의 군집",
  "new_frontiers_matchmaking_details_old_desc": "도타는 전통적으로 수정된 Elo 알고리즘을 사용하여 랭크 및 랭크 신뢰도 변경을 적용합니다. 하지만 시간이 지나면서, 저희의 접근 방식에 몇 가지 문제점이 발견되었습니다. 예를 들어, MMR 분포가 점차 낮아져서 0~1000 MMR 범위에 달갑지 않은 군집이 형성되었다는 문제가 있었습니다. 또 다른 문제로는 잠시 게임을 쉬었다가 복귀하는 플레이어는 이전의 실력 수준이 진짜 실력을 나타내지 않기에 정확한 MMR을 달성하는 데 어려움을 겪는 일이 있었습니다.",
  "new_frontiers_matchmaking_details_new_title": "신규 및 향상된 군집",
  "new_frontiers_matchmaking_details_new_desc": "이 문제를 해결하고자, 글리코(Glicko)라는 다른 알고리즘으로 전환하여 빠르고 정확하게 비슷한 실력 수준의 다른 플레이어들과 매치가 잡힐 수 있도록 하고자 합니다. 수학적인 면에서 보면, 글리코 계산법 덕분에 저희가 하는 계산에 플레이어의 등급 신뢰도를 더 적절하게 고려하고 그에 따라 랭크를 얻고 잃는 사항에 더욱 정확한 결정을 내릴 수 있는 것입니다.\\n\\n새로운 매치메이킹 시스템으로 전환함에 따라 약간은 새로운 매치메이킹 시즌이 시작된 것처럼 느껴질 수도 있습니다. [list][*]모든 플레이어는 짧게 산정 모드를 거치며, 처음에는 이전 랭크에 따라 배정됩니다.\\n[*]산정은 일정한 매치 수에 따라 이뤄지지 않습니다. 대신, 플레이어는 랭크 신뢰도가 일정 한계치 이상이 될 때마다 산정됩니다.\\n[*]산정 시, 이전과 다른 메달을 받을 공산이 큽니다. 하지만, 메달이 현격히 달라졌더라도, 비슷한 실력 수준의 플레이어와 매치가 잡힌다고 기대해야 합니다.\\n[*]매치는 이제 MMR을 고정된 값으로 얻거나 잃지 않습니다. 참가자의 랭크와 랭크 신뢰도를 포함하여 여러 요인을 바탕으로 다양해질 것입니다. 그러나 매치당 얻고 잃는 수치에 한도를 두어 특별히 부정적인 결과가 나오지 않도록 할 예정입니다.[*]플레이어의 등급 신뢰도는 플레이어가 매치를 플레이하지 않으면 시간이 흐르면서 서서히 낮아집니다.[/list]한동안 비공개로 두 가지 매치메이킹 시스템을 동시에 운영해 본 덕분에, 이제 이러한 변경을 하는 것이 좋겠다는 확신이 들 수 있었습니다. 정확한 MMR은 매치 품질에 영향을 주는 여러 요인 중 하나일 뿐임을 이해하고 있습니다. 여기서 언급된 모든 변경 사항에 관해서도 마찬가지지만, 이에 관한 여러분의 생각은 어떤지 알고 싶습니다.",
  "new_frontiers_matchmaking_immortals_title": "불멸자 매치메이킹",
  "new_frontiers_matchmaking_immortals_desc": "불멸자 랭크에서는, 서로 잘 알고 지내며 잘 어울리면서, 역할을 균형 있게 선택하는 것이 MMR 자체보다 더 의미 있습니다. 그래서, 불멸자 수준의 매치메이킹이 그것에 맞게 이뤄지도록 다시 설계했습니다.<br><br>이제 불멸자 랭크의 매치에서는 사전에 만들어진 팀을 사용하지 않습니다. 대신, 캡틴 두 명이 다른 플레이어 여덟 명을 각 팀으로 선발하여 단순히 MMR에만 의존했을 때보다 더 강력한 팀을 구성할 수 있습니다. 그러니 불멸자, 여러분 이제는 매치가 잘 안 풀리면 자기 외에는 아무도 탓할 사람이 없을 겁니다.",
  "new_frontiers_ui_desc": "눈이 침침하고 팔이 쑤신다고요? 저희는 그냥 무시하라고 조언합니다. 배가 고프다고 몸에서 보내는 신호일 뿐이니까요. 타이어에 펑크가 났다고요? 휠만으로 다니면 됩니다. 어차피 둥근 건 마찬가지니까요. 요점은 바로 이겁니다. 삶의 거의 대부분은 그냥 무시해도 별 탈이 없다는 사실이죠.<br><br>도타 체력 표시줄은 아닙니다. 그건 중요합니다. 그게 바로 여러 가지 체력 관련 UI 정보가 이번 업데이트에서 엄청나게 향상된 이유입니다.",
  "new_frontiers_ui_shields_title": "체력 표시줄 방어막",
  "new_frontiers_ui_shields_desc": "도타에 보호막이 있다는 사실을 알고 계셨나요? 마법 보호막이며, 물리 보호막이며, 어둠의 보호막까지 온갖 보호막이 있습니다! 아마 모르고 있었거나 알아도 대부분은 그냥 무시했을 겁니다. 왜냐하면, 시작할 때 얼마만큼의 보호막이 있으며, 남은 보호막은 얼마인지 알 방법이 없었기 때문입니다.<br><br>하지만 그런 불확실한 암흑기는 오늘 끝이 났습니다. 이제 모든 사항이 파악됩니다. 다가 안 되더라도 적어도 위에서 언급한 두 가지는 확실히 알 수 있습니다. 심지어 보호막이 어떤 유형인지도 알 수 있습니다. 이번 시각적 업그레이드로 기존의 보호막이 엄청나게 좋아진 것을 기념하고자, 해당 기능이 있는 신규 능력을 다수 추가했습니다.<br><br>또한, 보호막을 방어막으로 이름을 변경하였으니, 체력 표시줄에 무슨 보호인지 헷갈릴 일은 없을 겁니다. 그렇게 고마워하지는 않아도 됩니다.",
  "new_frontiers_ui_health_pips_title": "체력 표시줄 눈금",
  "new_frontiers_ui_health_pips_desc": "일부 유닛에는 전형적인 체력 보유량이 없으며, 특정한 횟수로 공격해야 파괴할 수 있습니다. 이제, 흔히 하듯 짐작에 의존하거나 머릿속에서 천재적인 계산을 하는 대신, 처치하고 싶은 유닛을 그냥 보기만 하면 됩니다. 편리하게도 작은 눈금이 있어, 해당 유닛이 속세의 번뇌를 떨쳐버리게(햄릿의 체력 표시줄에서 인용) 하려면 몇 회 타격해야 하는지 바로 알 수 있습니다.",
  "new_frontiers_ui_health_cost_title": "체력 비용",
  "new_frontiers_ui_health_cost_desc": "도타에서 능력 대부분은 마나를 소모하지만, 대신 체력을 소모하는 능력도 몇 가지 있습니다. 이제 해당 능력은 실제로 시전에 필요한 체력 비용이 표시됩니다. 괜찮지 않나요? 이전에 그렇게 할 생각을 한 사람이 아무도 없었다니 사실 말이 좀 안 되긴 합니다. 어쨌거나, 이제는 있습니다.",
  "new_frontiers_gameplay_update_desc": "지금까지 소개한 것만으로도 엄청나게 긴 목록이 되었습니다. 더 엄청난 것이 되려면 엄청나게 긴 목록을 [i]하나 더[/i] 만드는 것만이 유일한 방법이지만, [i]저기요, 이것 좀 보세요![/i]하는 부분이 그 안에 있을 겁니다. 그 외 이번 업데이트에서 준비된 밸런스 변경 사항을 모두 읽어봐 주세요. 아니면 그냥 곧장 게임에 뛰어들어 플레이하셔도 좋습니다. 확실히 말씀드리는데, 비디오 게임의 기술적 설명서를 읽는 일이 얼마나 재밌는지 굳이 얘기해주지 않으셔도 됩니다. 다만, 플레이하는 것도 그에 못지않게 재밌는 일임을 아셨으면 합니다. 플레이를 하고 와도 이 목록은 여기 그대로 있을 테니까요.",
  "new_frontiers_misc_title": "기타",
  "new_frontiers_misc_role_tokens": "'모든 역할 선택' 매치에서 패배했을 때 지급되는 역할 대기 주화의 수를 줄였습니다. 이제 패배 시 주화 2개(승리 시 이전과 동일하게 4개 지급) 가 지급됩니다. 랭크 역할과 관련하여 가끔 할당된 역할을 효과적으로 플레이하기보다 주화를 모으는 일만 중요시하는 플레이어가 보이는데, 이번 변경이 그러한 행동을 개선하는 데 도움이 되리라 생각합니다.",
  "new_frontiers_misc_removed_roles": "랭크 매치에서 캡틴 모드가 삭제되었으며 일반 매치에서 전체 무작위 및 전체 무작위 섬멸전이 삭제되었습니다. 해당 모드를 즐기는 플레이어가 거의 없어 대기 시간은 보통 한 시간이 훌쩍 넘기 마련입니다.",
  "new_frontiers_misc_model_editor": "이번 업데이트에서 도타 1 모델 편집기가 삭제되었습니다. 모든 vmdl 파일은 새로운 도구로 불러올 수 있으며, 이전 모델은 도구에서 처음으로 불러올 때 전환됩니다. 후속 업데이트에서 예전 컴파일 형식 불러오기 지원을 완전히 중단할 예정입니다. 따라서, 모든 창작마당 제작자 여러분들은 가능한 한 빨리 해당 모델을 새로운 형식으로 전환하고 다시 컴파일하시기를 권장합니다.",
  "new_frontiers_misc_hold_animation": "기존의 'HoldAnimation' 키 지원이 역동적 소품에서 삭제되었습니다. 맞춤 게임은 수동으로 새로운 'loop mode' 키로 전환하거나 해당 속성이 자동으로 업그레이드되도록 맵을 다시 컴파일해야 합니다.",
  "neutral_item_tier": "[b]%1$s급[/b] 중립 아이템",
  "dota_ability_variable_health": "체력",
  "dota_ability_variable_mana": "마나",
  "dota_ability_variable_armor": "방어력",
  "dota_ability_variable_damage": "공격력",
  "dota_ability_variable_str": "힘",
  "dota_ability_variable_int": "지능",
  "dota_ability_variable_agi": "민첩",
  "dota_ability_variable_all": "모든 능력치",
  "dota_ability_variable_primary_attribute": "주 능력치",
  "dota_ability_variable_attack": "공격 속도",
  "dota_ability_variable_hp_regen": "체력 재생",
  "dota_ability_variable_lifesteal": "흡혈",
  "dota_ability_variable_mana_regen": "마나 재생",
  "dota_ability_variable_mana_regen_aura": "마나 재생의 오라",
  "dota_ability_variable_spell_amp": "주문 피해",
  "dota_ability_variable_debuff_amp": "약화 효과 지속시간",
  "dota_ability_variable_move_speed": "이동 속도",
  "dota_ability_variable_evasion": "회피",
  "dota_ability_variable_spell_resist": "마법 저항력",
  "dota_ability_variable_spell_lifesteal": "주문 흡혈",
  "dota_ability_variable_spell_lifesteal_creep": "주문 흡혈(크립)",
  "dota_ability_variable_spell_lifesteal_hero": "주문 흡혈(영웅)",
  "dota_ability_variable_selected_attrib": "선택 능력치",
  "dota_ability_variable_attack_range": "공격 범위<font color='#7d7d7d'>(원거리만)</font>",
  "dota_ability_variable_attack_range_melee": "공격 범위 <font color='#7d7d7d'>(근접만)</font>",
  "dota_ability_variable_cast_range": "시전 범위",
  "dota_ability_variable_status_resist": "상태 저항력",
  "dota_ability_variable_projectile_speed": "투사체 속도",
  "dota_ability_variable_manacost_reduction": "마나 소모 감소",
  "dota_ability_variable_cooldown_reduction": "쿨다운 감소",
  "dota_ability_variable_max_mana_percentage": "최대 마나 보너스"
}