// 1302.js

{
  "language": "romanian",
  "new_frontiers_gameplay_number": "Actualizarea de joc 7.33",
  "new_frontiers_title": "Actualizarea „Noile frontiere”",
  "new_frontiers_title_short": "Noile frontiere",
  "new_frontiers_subtitle": "O hartă nouă, modificări importante aduse mecanicilor de joc și multe altele. O lume cu totul nouă care te așteaptă să o explorezi.",
  "new_frontiers_play_trailer": "Urmărește trailerul",
  "new_frontiers_dota_team_intro": "Actualizarea „Noile frontiere” vine cu o hartă nouă, modificări importante aduse mecanicilor de joc, modificări pentru sistemul de matchmaking și interfața de utilizator, dar și... nu glumim... multe altele.<br><br>Cât de multe altele? Atât de multe încât abia reușim să ni le amintim pe toate, iar în ultimele câteva zile am început să ne panicăm până un membru al echipei ne-a reamintit că ne putem nota modificările. Zis și făcut. Acum le putem consulta oricând avem nevoie. Acest lucru îl poți face și tu! Începe să derulezi în jos pentru a continua să lecturezi modificările.",
  "new_frontiers_eldor_name": "Vrăjitorul Eldor",
  "new_frontiers_dota_team_name": "Echipa de Dota",
  "new_frontiers_section_title_map": "Hartă nouă",
  "new_frontiers_section_title_major_gameplay": "Modificări importante de joc",
  "new_frontiers_section_title_matchmaking": "Matchmaking",
  "new_frontiers_section_title_ui": "Interfața de utilizator",
  "new_frontiers_section_title_gameplay_update": "Modificări pentru echilibrarea jocului",
  "new_frontiers_map_introduction": "Harta din Dota s-a extins substanțial. Obiectivul principal al jocului rămâne același, iar culoarele nu sunt mai depărtate unul de altul și toate cele necesare pentru a obține victoria se află în continuare în centrul hărții.<br><br>Cu o hartă mai mare cu 40%, ai mai mult spațiu pentru a obține resurse noi și a descoperi noi strategii. Ambele jungle principale au fost și ele complet reamenajate, modificând astfel locurile în care pot fi amplasate wardurile, căile de scăpare, taberele de unități neutre și multe altele.",
  "new_frontiers_map_subtitle": "Explorează noua lume",
  "new_frontiers_map_roshan_title": "Noile bârloguri ale lui Roshan",
  "new_frontiers_map_roshan_desc": "Roshan și-a vândut vechiul bârlog din râu și se bucură acum de noile sale investiții în imobiliare. Acum are [i]două[/i] noi bârloguri fantastice situate în colțul de NV și cel de SE al hărții. Aceste bârloguri îi oferă tot ce și-ar putea dori, de la priveliștile cu fântâni, până la magazinele secrete care sunt situate la doar câteva minute de mers.<br><br>Aceste bârloguri probabil că au în apropiere și o sală de fitness, pentru că Roshan arată acum și mai robust. Roshan nu mai oferă obiecte Aghanim's Shard, ci oferă Cheese atunci când moare a doua oară, în loc să ofere acest obiect atunci când moare pentru a treia oară. Când moare pentru a treia oară, Roshan oferă acum un Refresher Shard sau un Aghanim's Scepter, în funcție de bârlogul în care se află.",
  "new_frontiers_map_twin_gates_title": "Portaluri gemene",
  "new_frontiers_map_twin_gates_desc": "Două portaluri care conectează colțurile hărții se află în vecinătatea turnurilor de pe culoarul sigur, permițându-le jucătorilor să se teleporteze instantaneu în celălalt colț al hărții.<br><br>Aceasta este o modificare adusă mecanicilor de joc, dar există în mod evident și câteva detalii cu privire la povestea jocului. Ai ghicit: Dota 2 face parte acum în mod neoficial din PMEU (universul extins al jocului Pac-Man).",
  "new_frontiers_map_lotus_pools_title": "Iazuri cu lotuși",
  "new_frontiers_map_lotus_pools_desc": "Jucători pot găsi acum iazuri cu lotuși în partea din stânga și cea din dreapta a hărții (aproape de locurile în care valurile de creepi se întâlnesc). Acestea oferă periodic un fruct care, atunci când este mâncat, oferă mana și puncte de viață.<br><br>Jucătorii pot stoca aceste fructe și le pot combina ulterior pentru a obține unul și mai mare care se poate dovedi destul de util în fazele târzii ale meciului. Aceste fructe mai mari pot fi combinate pentru a obține un fruct [i]incredibil[/i] de mare. Ce se va întâmpla atunci când combini fructe [i]incredibil[/i] de mari? Probabil nimic. (Cu siguranță trebuie să se întâmple ceva.)",
  "new_frontiers_map_tormentors_title": "Oprimatoare",
  "new_frontiers_map_tormentors_desc": "Aceste două clădiri neutre și puternice apar în vecinătatea fiecărei baze după 20 de minute, iar ambele sunt gata să ofere o mulțime de obiecte Aghanim's Shard. Dar există un șpil... de fapt două: 1) Oprimatoarele sunt echipate cu megascuturi care reflectă majoritatea daunelor pe care le provoci acestora. 2) Acestea devin din ce în ce mai puternice după ce le distrugi, așa că cel mai probabil vei avea nevoie de întreaga echipă pentru a distruge unul.<br><br>Partea bună este că, asemenea urșilor care te ignoră pentru a ataca un drumeț, nu te vor deranja atâta timp cât nu le deranjezi nici tu.",
  "new_frontiers_map_watchers_title": "Observatoare",
  "new_frontiers_map_watchers_desc": "Observatoarele sunt asemănătoare opritoarelor, doar că scopul lor e acela de a monitoriza ceea ce se întâmplă. Acestea sunt necruțătoare. Nu cunosc durerea sau frica. Cu toate acestea, sunt leneșe. Acestea nu vor începe să monitorizeze ce se întâmplă în jurul lor până nu apeși clic pe ele.<br><br>Observatoarele sunt inactive și neutre la începutul meciului, însă, de îndată ce acestea sunt activate, ele vor oferi vedere asupra zonei în care se află timp de 7 minute sau până când inamicii le sabotează pentru a le dezactiva temporar. Atunci când o echipă îl va ucide pe Roshan, toate observatoarele vor trece de partea echipei respective.",
  "new_frontiers_map_barriers_title": "Bariere de protecție",
  "new_frontiers_map_barriers_desc": "Barierele de protecție combină elementele de fantezie din Dota cu aspectul practic al ușii tale de la casă, pe care o poți închide atunci când mergi la magazin pentru a-i distruge Ancientul. Această barieră reprezintă „ușa din spate” a bazei tale și este formată dintr-un câmp de forță care oferă acces doar echipei tale. Cât timp echipa inamică îți atacă din față baza, te poți strecura pe această ușă pentru a-i surprinde din spate.",
  "new_frontiers_map_wisdom_runes_title": "Runele înțelepciunii",
  "new_frontiers_map_wisdom_runes_desc": "Explorează marginile hărții pentru a descoperi runele înțelepciunii, care oferă puncte de experiență oricărui erou care este suficient de înțelept pentru a fura una. Runele înțelepciunii vor apărea în apropierea bazei tale și oferă o modalitate simplă de a evita ca un meci dificil să-ți scape cu totul de sub control.",
  "new_frontiers_map_shield_runes_title": "Rune de protecție",
  "new_frontiers_map_shield_runes_desc": "O nouă rună face parte din runele râului, fiind vorba de runa de protecție, care îți oferă 50% din maximul tău de viață sub forma unei bariere. Acum nu vei mai avea grija turnului inamic atunci când vei dori să obții o ucidere în faza timpurie a meciului... sau te vei putea aventura pe orbește pe un deal pentru a-ți surprinde echipa adversară.",
  "new_frontiers_map_named_regions_title": "Regiuni cu nume specifice",
  "new_frontiers_map_named_regions_desc": "Harta extinsă oferă acum regiuni distincte, precum: minele, puțul, cimitirul și statuia. Cu ajutorul acestor denumiri, le vei putea spune cu ușurință coechipierilor locația în care te afli atunci când cineva încearcă să te ucidă. Toate unitățile din regiunile acestea primesc un bonus specific regiunii pentru propriile atribute.",
  "new_frontiers_map_creep_camps_title": "12 tabere noi de creepi",
  "new_frontiers_map_creep_camps_desc": "Câțiva dintre creepi s-au săturat să fie măcelăriți constant în junglă, așa că și-au stabilit 12 noi tabere care sunt răspândite pe noua hartă extinsă. Acum ai ocazia să îi măcelărești și în aceste noi locații.",
  "new_frontiers_map_outpost_title": "Avanposturi noi",
  "new_frontiers_map_outpost_desc": "Noua hartă extinsă conține două noi avanposturi. Avanposturile inițiale au fost mutate în noi locații. Această mutare poate ridica următoarea întrebare: oare aceste avanposturi sunt într-adevăr avanposturile inițiale? Bună încercare, Socrate! Da, chiar sunt avanposturile inițiale.",
  "new_frontiers_major_gameplay_features_desc": "Actualizarea „Noile frontiere” vine cu modificări importante pentru eroii și sistemele tale preferate. De fapt, departamentul nostru juridic ne-a sfătuit să-ți comunicăm faptul că această secțiune destinată elementelor de joc este [i]atât de plină[/i] de caracteristici noi, care definesc o serie de combinații posibile, încât ar trebui să le parcurgi încetul cu încetul de-a lungul următoarelor câtorva săptămâni, pentru a nu-ți supraîncălzi mintea și a fi nevoit să apelezi la pompieri.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Schimbări importante aduse eroilor",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Deși toți eroii au primit modificări de echilibrare, câțiva dintre aceștia au primit mai multe modificări decât restul. Vom prezenta mai jos câțiva dintre eroii aceștia.",
  "new_frontiers_major_gameplay_new_items_title": "Obiecte noi",
  "new_frontiers_major_gameplay_new_items_desc": "Tot ceea ce ai visat vreodată să cumperi.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Obiecte neutre noi",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "Adăugăm șapte noi obiecte neutre și readucem în scenă câteva dintre vechile obiecte neutre preferate.",
  "new_frontiers_major_gameplay_bkb_title": "Modificări importante pentru Black King Bar",
  "new_frontiers_major_gameplay_bkb_desc": "Când Black King Bar este activat, acesta aplică acum un descântec și oferă 50% rezistență la magie și imunitate la efectele negative. De asemenea, acesta îți oferă și imunitate la daunele pure și cele reflectate.<br><br>Ai grijă totuși: atunci când efectul lui Black King Bar expiră înainte ca oricare dintre aceste efecte negative să expire, efectele negative vor continua să fie aplicate de îndată ce Black King Bar nu mai este activ. Efectele care ignoră imunitatea la magie ignoră acum și imunitatea la efectele negative.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Un nou tip de atribut pentru eroi",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Fiind cel de-al patrulea frate spiritual pe care l-am lansat, Void Spirit nu ar trebui să fie un erou de forță, agilitate sau inteligență. Pentru a se deosebi de ceilalți, el ar fi trebuit să fie un nou tip de erou. Un [i]al patrulea[/i] tip de erou.<br><br>Vă prezentăm eroii universali: un nou grup principal de eroi care este compus din eroi existenți care primesc câte 0,6 daune per fiecare punct al fiecărui atribut. Inginerii noștri ne-au asigurat că acesta este numărul ideal pentru un echilibru perfect, dar rămâne de văzut dacă acest lucru se adeverește. Vestea bună este că vom afla împreună dacă acest lucru se adeverește după ce vom lua parte la marea aventură a actualizării „Noile frontiere”.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Modificări pentru acordarea de obiecte neutre",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Înainte, uciderea creaturilor din pădure te răsplătea cu un obiect neutru superb... care ajungea cel mai adesea la carry. Cu alte cuvinte, nu te puteai bucura de el. Acum, uciderea unui creep neutru te poate recompensa cu un jeton care îți va permite să alegi unul dintre [i]cinci[/i] obiecte neutre disponibile. Fiecare jeton oferă o gamă completă de cinci obiecte, astfel încât și ultimul jucător care-și folosește jetonul se poate răsfăța cu orice obiect dorește.<br><br>Jetoanele pot fi oferite coechipierilor, dar obiectele obținute în schimbul jetoanelor nu pot fi partajate cu restul, așa că folosește-ți jetoanele cu înțelepciune.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Creepi neutri din ce în ce mai puternici",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Creepii neutri și abilitățile lor devin acum din ce în ce mai puternice de-a lungul timpului. Da, decimarea taberelor de creepi va deveni din ce în ce mai dificilă, dar eroii care pot prelua controlul asupra creepilor vor avea o armată puternică la îndemână.",
  "new_frontiers_major_gameplay_kill_formula_title": "Formulă nouă pentru recompensarea uciderilor",
  "new_frontiers_major_gameplay_kill_formula_desc": "Am refăcut formula de calcul pentru recompensa oferită pentru ucideri, astfel încât uciderile din faza timpurie a meciului să aibă un impact mai mare asupra meciului și să-i motiveze pe jucători să ambuscheze alte culoare. De asemenea, am redus scalarea aurului acordat pentru creepii specifici culoarelor, făcând astfel mai puțin profitabilă uciderea creepilor de culoar pe parcurs ce meciul avansează, încurajându-i în schimb pe jucători să se lupte între ei pentru a obține cât mai mult aur.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Uite năucirea, nu e năucirea",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Jocul e mult mai distractiv atunci când controlul asupra eroului nu îți este restricționat. Ei bine, avem vești bune pentru cei cărora le place să controleze lucrurile și cei cărora nu le face plăcere: acum îți vei putea controla eroul pentru mai mult timp ca niciodată.<br><br>Cum? E simplu. Am redus durata aproape a tuturor efectelor de incapacitate din joc. Cum ne-a venit această idee genială? Și mai simplu. Am fost năuciți de abilitatea Primal Roar a lui Beastmaster și am avut destul de mult timp la dispoziție să ne gândim la asta.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "După două luni de bântuit culoarele, Muerta și-a găsit în final obiectele Aghanim's Scepter și Aghanim's Shard. Dacă nu ai făcut cunoștință cu eroina încă, poți afla mai multe despre aceasta de pe [url=https://www.dota2.com/deadreckoning]pagina actualizării Dead Reckoning[/url].",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi este prea naiv să fie un erou de inteligență, așa că nu mai este acum.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa este acum fragilă precum un bebeluș la începutul meciului, dar, asemenea unui copil, aceasta devine din ce în ce mai puternică.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Majoritatea abilităților lui Clinkz creează acum schelete.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Arc Warden obișnuia să se cloneze perfect. Dar acum acesta creează o versiune [i]mai bună[/i] a sa! Sau mai rea! În orice caz, e o versiune diferită și necontroversată, sperăm.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "Alchemist, asemenea jucătorilor care îl întruchipează, este acum lacom din fire.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "EFECT LIMITAT PENTRU ARC WARDEN",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Pentru o perioadă limitată, atunci când ești de partea echipei Dire și alegi să joci cu Arc Warden, clona Tempest Double va fi eroul principal, iar invocarea abilității va invoca versiunea „normală” a sa.",
  "new_frontiers_matchmaking_desc": "Să fim sinceri: există opt miliarde de oameni pe planetă, iar 99,99% dintre ei nu se pricep deloc să joace Dota. Asta înseamnă că găsirea unor jucători pe măsura ta poate fi o provocare, în special dacă te pricepi la joc și vrei să joci cu alți oameni care sunt aproape, dar nu chiar la fel de buni ca tine la Dota. Am făcut o serie de modificări și calcule matematice pentru a îmbunătăți calitatea sistemului de matchmaking pentru toate tipurile de jucători.",
  "new_frontiers_matchmaking_intro_title": "Matchmaking mai precis",
  "new_frontiers_matchmaking_intro_desc": "Clasificarea pentru matchmaking (denumită și MMR) este compusă din două numere: rang și indicele de încredere. Rangul tău este o estimare a gradului tău de aptitudini, în timp ce indicele de încredere măsoară cât de corectă aste acea estimare. Când joci un meci, îți modificăm rangul în funcție de rezultatul obținut (victorie sau înfrângere), iar indicele de încredere crește și el, deoarece acum avem mai multe date.",
  "new_frontiers_matchmaking_details_old_title": "Aglomerare nedorită: cel mai rău tip de aglomerare",
  "new_frontiers_matchmaking_details_old_desc": "Dota a folosit întotdeauna o versiune modificată a algoritmului Elo pentru a implementa modificările de rang și pe cele ale indicelui de încredere. Cu toate acestea, de-a lungul timpului am observat câteva probleme în această abordare. De exemplu, distribuția MMR-urilor a început să scadă treptat, iar foarte mulți jucători au început să se regăsească în intervalul de MMR 0-1.000. O altă problema a fost reprezentată de faptul că jucătorii care reveneau după o perioadă lungă de pauză întâmpinau dificultăți în ceea ce privește obținerea unui MMR precis, deoarece nivelul lor de aptitudini anterior nu mai era de actualitate.",
  "new_frontiers_matchmaking_details_new_title": "Un algoritm nou și îmbunătățit",
  "new_frontiers_matchmaking_details_new_desc": "Pentru a remediat problema menționată anterior, am implementat un algoritm diferit, numit Glicko, care ar trebui să-ți găsească rapid și cu precizie alți jucători cu aptitudini similare. Din punct de vedere matematic, algoritmul Glicko ne permite să ținem cont mai bine de indicele de încredere al unui jucător în calculele noastre, ceea ce înseamnă că vom lua decizii mai bune în ceea ce privește modificările de rang.\\n\\nTrecerea la noul nostru sistem de matchmaking se va asemăna cu un nou sezon de matchmaking: [list][*]Toți jucătorii vor fi plasați pentru o scurtă perioadă într-un mod de calibrare. Această calibrare se va baza pe rangul anterior al jucătorilor.\\n[*]Calibrarea nu mai este compusă dintr-un număr fix de meciuri. În schimb, calibrarea se va încheia abia atunci când indicele de încredere al jucătorului se află peste un anumit prag.\\n[*]După calibrare, probabil vei obține o altă medalie decât cea pe care ai avut-o anterior. Cu toate acestea, chiar dacă medalia ta se va schimba semnificativ, ar trebui să te aștepți să joci cu jucători cu un nivel de aptitudini similar cu al tău.\\n[*]Meciurile nu vor mai oferi un număr fix de puncte câștigate/pierdute pentru MMR. Acest număr de puncte va varia în funcție de mai mulți factori, printre care rangurile și indicii de încredere ai participanților. Cu toate acestea, vom limita numărul de puncte câștigate/pierdute per meci pentru a evita cazurile extreme.\\n[*]Indicele de încredere al unui jucător se va diminua cu timpul dacă un jucător nu joacă meciuri.[/list]Am folosit simultan ambele sisteme de matchmaking în ultimele luni pentru a testa eficacitatea acestor modificări. Înțelegem că MMR-ul este doar unul dintr-o mulțime de factori care au impact asupra calității meciurilor și, asemenea tuturor modificărilor de până acum, ne-am dori să ne trimiți feedbackul.",
  "new_frontiers_matchmaking_immortals_title": "Matchmaking pentru jucătorii cu rangul de nemuritor",
  "new_frontiers_matchmaking_immortals_desc": "Știm că pentru jucătorii cu rangul de nemuritor nu contează forte mult MMR-ul, ci să-i cunoască pe ceilalți jucători pentru a se înțelege cu ei și a forma o echipă bine echilibrată. Astfel, am reconceput sistemul de matchmaking pentru jucătorii cu rangul de nemuritor.<br><br>De acum înainte, meciurile dintre jucătorii cu rangul de nemuritor nu vor mai avea echipe predeterminate. În schimb, doi căpitani se vor ocupa de alcătuirea echipelor. În acest mod, echipa ta va avea un plus de valoare decât dacă ar fi fost alcătuită doar în baza MMR-ului. Cu alte cuvinte, nemuritorilor, dacă meciurile voastre nu se termină cu bine, vina vă aparține.",
  "new_frontiers_ui_desc": "Te confrunți cu o vedere încețoșată și junghiuri la nivelul brațului? Sfatul nostru este să ignori aceste simptome, deoarece corpul doar îți comunică faptul că trebuie hrănit. Ai făcut pană? Nu uita că te poți folosi în continuare de jantă pentru a te deplasa. Ceea ce încercăm să spunem este aproape tot ce ți se întâmplă poate fi ignorat fără consecințe grave.<br><br>Excepție fac barele de viață din Dota. Acestea sunt extrem de importante. Tocmai de aceea, o mulțime de informații din cadrul interfeței de utilizator care fac referire la viață primesc o îmbunătățire semnificativă odată cu această actualizare.",
  "new_frontiers_ui_shields_title": "Bariere pentru bara de viață",
  "new_frontiers_ui_shields_desc": "Știai că există scuturi în Dota? Scuturi magice, fizice, afotice. Scuturi de toate felurile! Probabil că ți-au scăpat sau doar le-ai ignorat, deoarece nu exista nicio modalitate de a ști cât de multe daune poate încasa un scut.<br><br>Dar acele vremuri de incertitudine se sfârșesc acum. Acum poți vedea totul. Sau cel puțin două dintre lucrurile menționate anterior. Poți vedea inclusiv tipul de scut. Pentru a sărbători această actualizare vizuală a vechilor scuturi, am adăugat o mulțime de abilități noi care oferă astfel de scuturi.<br><br>De asemenea, scuturile se numesc acum „bariere”, ca să nu fii indus în eroare și să crezi ca este afișat un Vanguard deasupra barei tale de viață. Plăcerea a fost de partea noastră!",
  "new_frontiers_ui_health_pips_title": "Bare de viață segmentate",
  "new_frontiers_ui_health_pips_desc": "Unele unități nu utilizează barele clasice de viață și necesită un anumit număr de atacuri pentru a fi distruse. Acum, în loc să fii nevoit să ghicești numărul de atacuri necesare sau să ții minte numărul de atacuri executate, te poți uita pur și simplu la bara de viață a unității pe care plănuiești să o nărui. Aceasta îți va afișa un anumit număr de segmente care reprezintă numărul de lovituri necesare înainte de a fi distruse (citat din bara de viață a lui Moromete).",
  "new_frontiers_ui_health_cost_title": "Costul de viață",
  "new_frontiers_ui_health_cost_desc": "Majoritatea abilităților din Dota consumă mana, însă mai sunt câteva care consumă puncte de viață. Aceste abilități afișează acum costul de viață aferent invocării. Nu-i rău, așa-i? Este uimitor cum nu s-a gândit nimeni să implementeze asta până acum. În orice caz, s-a rezolvat.",
  "new_frontiers_gameplay_update_desc": "Asta da listă mare de modificări. Singurul lucru mai bun decât o listă plină de modificări ar fi [i]două[/i] astfel de liste, dar oare chiar este posibil acest lucru? [i]Ei bine, uite ce-aveam noi aici![/i] Continuă să citești pentru a afla care sunt celelalte modificări de echilibrare aduse odată cu actualizarea aceasta. Sau pur și simplu joacă un meci. Crede-ne, nu trebuie să-ți spunem cât de distractivă este lecturarea manualelor tehnice despre jocurile video, dar, amice... să le joci e aproape la fel de distractiv. Poți reveni la această listă oricând dorești.",
  "new_frontiers_misc_title": "Diverse",
  "new_frontiers_misc_role_tokens": "Acum vei primi un număr de jetoane mai redus pentru căutările de meciuri în funcție de rol atunci când pierzi un meci pentru care ai „selectat toate rolurile”. Acum vei primi două jetoane în caz că piezi (victoria îți aduce în continuare patru jetoane). Această modificare ar trebui să ajute la îmbunătățirea comportamentului jucătorilor referitor meciurile contorizate care țin cont de rolul selectat, unde obținerea de jetoane era mai importantă decât asumarea unui rol desemnat.",
  "new_frontiers_misc_removed_roles": "Am eliminat modul Captains pentru meciurile contorizate, dar și modurile Toți aleator și Deathmatch aleator pentru meciurile necontorizate. Practic nimeni nu joacă aceste moduri și timpul de așteptare depășește de multe ori o oră.",
  "new_frontiers_misc_model_editor": "Această actualizare elimină vechiul editor de modele. Toate fișierele vmdl se vor încărca acum în instrumentul nou, iar modelele vechi vor fi convertite la prima încărcare în instrument. Vom lansa o actualizare ulterioară pentru a elimina complet compatibilitatea pentru încărcarea formatului vechi compilat și, din acest motiv, recomandăm tuturor creatorilor din atelier să-și încarce și să-și convertească modelele la noul format, iar apoi să le compileze cât mai repede posibil.",
  "new_frontiers_misc_hold_animation": "Am eliminat compatibilitatea cu vechea proprietate „HoldAnimation” pentru modelele dinamice. Modurile de joc personalizate trebuie fie să facă trecerea la „loop mode” (modul în buclă), fie să recompileze propriile hărți pentru a actualiza automat aceste proprietăți.",
  "neutral_item_tier": "Obiect neutru de [b]nivelul %1$s[/b]",
  "dota_ability_variable_health": "viață",
  "dota_ability_variable_mana": "mana",
  "dota_ability_variable_armor": "armură",
  "dota_ability_variable_damage": "daune",
  "dota_ability_variable_str": "putere",
  "dota_ability_variable_int": "inteligență",
  "dota_ability_variable_agi": "agilitate",
  "dota_ability_variable_all": "punct(e) pentru toate atributele",
  "dota_ability_variable_primary_attribute": "punct(e) pentru atributul principal",
  "dota_ability_variable_attack": "viteză de atac",
  "dota_ability_variable_hp_regen": "regenerare de viață",
  "dota_ability_variable_lifesteal": "furt de viață",
  "dota_ability_variable_mana_regen": "regenerare de mana",
  "dota_ability_variable_mana_regen_aura": "aură de regenerare de mana",
  "dota_ability_variable_spell_amp": "amplificare de daune pentru vrăji",
  "dota_ability_variable_debuff_amp": "durată pentru efectele negative",
  "dota_ability_variable_move_speed": "viteză de mișcare",
  "dota_ability_variable_evasion": "evitare",
  "dota_ability_variable_spell_resist": "rezistență la magie",
  "dota_ability_variable_spell_lifesteal": "furt de viață pentru vrăji",
  "dota_ability_variable_spell_lifesteal_creep": "furt de viață pentru vrăji (creepi)",
  "dota_ability_variable_spell_lifesteal_hero": "furt de viață pentru vrăji (eroi)",
  "dota_ability_variable_selected_attrib": "pentru atributul selectat",
  "dota_ability_variable_attack_range": "distanță de atac <font color='#7d7d7d'>(doar pentru atacuri la distanță)</font>",
  "dota_ability_variable_attack_range_melee": "distanță de atac <font color='#7d7d7d'>(doar pentru atacuri meleu)</font>",
  "dota_ability_variable_cast_range": "distanță de invocare",
  "dota_ability_variable_status_resist": "rezistență la efectele negative",
  "dota_ability_variable_projectile_speed": "viteză pentru proiectile",
  "dota_ability_variable_manacost_reduction": "reducere a costului de mana",
  "dota_ability_variable_cooldown_reduction": "reducere de repaus",
  "dota_ability_variable_max_mana_percentage": "bonus de maxim de mana"
}