// 8827.js

{
  "language": "dutch",
  "new_frontiers_gameplay_number": "Gameplayupdate 7.33",
  "new_frontiers_title": "De New Frontiers-update",
  "new_frontiers_title_short": "New Frontiers",
  "new_frontiers_subtitle": "Een nieuwe map, belangrijke wijzigingen in de gameplay en nog veel meer. Ontdek een geheel nieuwe wereld.",
  "new_frontiers_play_trailer": "Trailer kijken",
  "new_frontiers_dota_team_intro": "De New Frontiers-update bevat een nieuwe map, belangrijke wijzigingen in de gameplay, wijzigingen voor matchmaking, wijzigingen aan de gebruikersinterface en — echt waar — nog veel meer.<br><br>Hoeveel meer? Nou, zo veel dat we bijna niet kunnen bijhouden wat er allemaal nieuw is en we zelfs een beetje in paniek raakten totdat iemand op het briljante idee kwam om het gewoon op te schrijven. Dus dat hebben gedaan. Nu kunnen we de wijzigingen altijd nog eens nalezen. En jij ook! Scroll verder om ze te bekijken.",
  "new_frontiers_eldor_name": "Eldor de tovenaar",
  "new_frontiers_dota_team_name": "Het team van Dota",
  "new_frontiers_section_title_map": "Nieuwe map",
  "new_frontiers_section_title_major_gameplay": "Belangrijke gameplaywijzigingen",
  "new_frontiers_section_title_matchmaking": "Matchmaking",
  "new_frontiers_section_title_ui": "Gebruikersinterface",
  "new_frontiers_section_title_gameplay_update": "Balanswijzigingen",
  "new_frontiers_map_introduction": "De Dota-map is enorm uitgebreid. De kern van het spel is hetzelfde gebleven: de paden liggen niet verder van elkaar en alles wat je nodig hebt om te winnen is nog steeds in het midden van de map te vinden.<br><br>Maar met 40% meer terrein is er genoeg ruimte om nieuwe middelen te verkrijgen en nieuwe strategieën te ontdekken. De beide hoofdjungles zijn ook volledig opnieuw geconfigureerd, wat heeft geleid tot nieuwe plekken voor Wards, nieuwe geheime paden voor jukes, opties voor farmen en meer.",
  "new_frontiers_map_subtitle": "Verken de nieuwe wereld",
  "new_frontiers_map_roshan_title": "Nieuwe kuilen voor Roshan",
  "new_frontiers_map_roshan_desc": "Roshan heeft zijn oude kuil bij de rivier verkocht en maakt gretig gebruik van alle nieuwe ruimte. Hij heeft nu [i]twee[/i] fantastische nieuwe kuilen: een in het noordwesten en een in het zuidoosten van de map. Het is een waar paradijs voor kuilliefhebbers, met prachtig uitzicht op de fonteinen en op een steenworp afstand van de geheime winkels.<br><br>Er zit vast ook een sportschool in de buurt, want Roshan is nu nog robuuster dan eerst. Een andere wijziging is dat Roshan nu geen Aghanim's Shards meer laat vallen, en dat Cheese al wordt gedropt bij zijn tweede dood in plaats van bij de derde. Na zijn derde dood laat hij nu een Refresher Shard of een Scepter vallen, afhankelijk van of hij zich bij zijn kuil in het noorden of het zuiden van de map bevindt.",
  "new_frontiers_map_twin_gates_title": "Dubbele poorten",
  "new_frontiers_map_twin_gates_desc": "Twee poorten bij de torens van de Safe Lane verbinden nu de hoeken van de map, waardoor spelers onmiddelijk van de ene kant van de map naar de andere kunnen teleporteren.<br><br>Dit is een wijziging in de gameplay, maar wel een met duidelijke gevolgen voor de lore. Inderdaad, Dota 2 is hiermee inofficieel onderdeel van het PAC-MAN-universum.",
  "new_frontiers_map_lotus_pools_title": "Lotusvijvers",
  "new_frontiers_map_lotus_pools_desc": "Spelers zullen nu zowel aan de linker- als de rechterkant van de map lotusvijvers aantreffen (rond de plek waar de creepgolven elkaar voor het eerst tegenkomen). In deze vijvers worden af en toe vruchten gespawnd die de speler mana en HP geven wanneer ze worden gegeten.<br><br>Spelers kunnen deze vruchten verzamelen en later in het spel combineren tot grotere vruchten met een hogere waarde. Deze grotere vruchten kunnen op hun beurt weer worden gecombineerd tot [i]ongelofelijk[/i] grote vruchten. Wat er gebeurt als je deze [i]ongelofelijk[/i] grote vruchten combineert? Waarschijnlijk niets. (Gegarandeerd wel iets.)",
  "new_frontiers_map_tormentors_title": "Tormentors",
  "new_frontiers_map_tormentors_desc": "Deze twee krachtige neutrale creeps spawnen na 20 minuten in de buurt van de basissen en ze hebben allebei een buik vol met Aghanim's Shards. Maar er schuilt een addertje onder het gras, twee addertjes zelfs. Ten eerste zijn Tormentors uitgerust met megaschilden waarmee de meeste schade afgeweerd wordt. Ten tweede worden ze iedere keer als je ze doodmaakt sterker. Je hebt dus waarschijnlijk je hele team nodig om er een te overwinnen.<br><br>Het goede nieuws is dat ze je met rust laten als je hen met rust laat, net als beren in het bos.",
  "new_frontiers_map_watchers_title": "Watchers",
  "new_frontiers_map_watchers_desc": "Watchers zijn net als terminators, maar ze houden het bij toekijken. Ze zijn vasthoudend. Ze kennen geen pijn. Ze weten niet wat angst is. Maar ze zijn wel lui. Ze houden alles pas in de gaten als je op ze klikt.<br><br>Watchers beginnen het spel inactief en neutraal, maar zodra ze zijn geactiveerd laten ze zeven minuten lang zien wat er gebeurt in het gebied waar de Watcher staat. Tenzij ze door je vijand worden gesaboteerd en tijdelijk buiten gebruik worden gesteld. Als een team Roshan doodt, sluiten alle Watchers zich bij hen aan.",
  "new_frontiers_map_barriers_title": "Verdedigingspoorten",
  "new_frontiers_map_barriers_desc": "Verdedigingspoorten combineren de sprankelende, epische fantasie van Dota met de praktische voordelen van een huis dat je kunt afsluiten als je even de deur uit moet om de Ancient te vernietigen. Het is een achterdeur naar je basis met een handig krachtveld dat je eigen team doorlaat en de vijand tegenhoudt. Terwijl de vijand de voorkant aanvalt, wip je zo achterom je eigen basis in en uit.",
  "new_frontiers_map_wisdom_runes_title": "Wisdom-runes",
  "new_frontiers_map_wisdom_runes_desc": "Verken de uithoeken van de map om Wisdom-runes te vinden. Deze runes garanderen een XP-boost voor elke held die wijs genoeg is om er een te stelen. Ze spawnen in de buurt van je basis en zijn dus bij uitstek geschikt om je te helpen je hoofd boven water te houden als je aan het verliezen bent.",
  "new_frontiers_map_shield_runes_title": "Shield-runes",
  "new_frontiers_map_shield_runes_desc": "Power-runes bij de rivier krijgen ook een nieuwe impuls met de invoering van de krachtige nieuwe Shield-rune, die 50% van je max. HP als barrière biedt. Deze bescherming opent de deur voor een aantal strategieën: zo kun je je al vroeg in het spel ver achter de linies van vijandelijke torens wagen voor een kill, of blindelings een hoog terrein beklimmen om het vijandelijke team te verrassen.",
  "new_frontiers_map_named_regions_title": "Regionamen",
  "new_frontiers_map_named_regions_desc": "Op de uitgebreide map worden de verschillende regio's nu duidelijk aangegeven, zoals de mijnen, bron, begraafplaats en het standbeeld. Zo kun je je teamgenoten makkelijker laten weten waar je precies in de pan wordt gehakt. Alle eenheden in deze regio's krijgen in de statistieken een aanduiding die overeenkomt met de betreffende regio.",
  "new_frontiers_map_creep_camps_title": "12 nieuwe kampen met creeps",
  "new_frontiers_map_creep_camps_desc": "Sommige creeps waren het zat dat ze steeds in de jungle werden afgemaakt en hebben 12 nieuwe kampen opgezet op verschillende plekken op de uitgebreide map. Dus nu kun je ze daar ook afmaken.",
  "new_frontiers_map_outpost_title": "Nieuwe buitenposten",
  "new_frontiers_map_outpost_desc": "Op de nieuwe uitgebreide map kom je twee nieuwe buitenposten tegen. De oorspronkelijke buitenposten zijn naar nieuwe locaties verplaatst, wat tot de logische vraag leidt: zijn het dan nog wel de oorspronkelijke buitenposten? Leuk geprobeerd, Socrates. Het antwoord is ja.",
  "new_frontiers_major_gameplay_features_desc": "De New Frontiers-update introduceert veel belangrijke wijzigingen voor je favoriete helden en systemen. Onze juridische afdeling heeft ons zelfs geadviseerd om jullie te waarschuwen dat dit gedeelte van de gameplay [i]zo bomvol[/i] zit met zelfdefiniërende nieuwe functies, dat je alles de komende weken heel rustig moet doorlezen, om te voorkomen dat je overgestimuleerd raakt en iemand een ambulance voor je moet bellen.",
  "new_frontiers_major_gameplay_hero_reworks_title": "Hoogtepunten voor helden",
  "new_frontiers_major_gameplay_hero_reworks_desc": "Hoewel alle helden zijn gebalanceerd, zijn er voor sommige helden meer wijzigingen dan voor andere. We zullen er hier een paar bespreken.",
  "new_frontiers_major_gameplay_new_items_title": "Nieuwe voorwerpen",
  "new_frontiers_major_gameplay_new_items_desc": "Alles wat je altijd al wilde kopen.",
  "new_frontiers_major_gameplay_new_neutral_items_title": "Nieuwe neutrale items",
  "new_frontiers_major_gameplay_new_neutral_items_desc": "We voegen zeven gloednieuwe neutrale items toe en brengen ook een aantal oude favorieten terug.",
  "new_frontiers_major_gameplay_bkb_title": "Black King Bar vernieuwd",
  "new_frontiers_major_gameplay_bkb_desc": "Bij het activeren van Black King Bar wordt nu een standaardverdrijving toegepast en worden 50% magieweerstand en immuniteit voor debuffs toegekend. Zolang Black King Bar actief is, zijn negatieve effecten van debuffs niet op jou van toepassing. Bovendien ben je immuun voor pure en teruggekaatste schade.<br><br>Maar pas op: als Black King Bar verloopt voordat de debuffduur voorbij is, worden de debuffeffecten voor de resterende tijd toegepast. Effecten die door magische immuniteit heen gaan, werken nu ook door debuffimmuniteit heen.",
  "new_frontiers_major_gameplay_all_stat_heroes_title": "Nieuw type heldeigenschap",
  "new_frontiers_major_gameplay_all_stat_heroes_desc": "Als de vierde spirit die we hebben toegevoegd, had Void Spirit helemaal geen kracht-, behendigheid- of intelligentieheld moeten zijn. Om zich te onderscheiden had hij eigenlijk een nieuw type held moeten zijn. Een [i]vierde[/i] type held.<br><br>Daarom zijn er nu universele helden, een nieuwe hoofdgroep die is samengesteld uit bestaande helden waarvoor de schade vanaf nu voor elk attribuut of statistiek met 0,6 wordt verhoogd. Onze engineers hebben ons verzekerd dat dit een perfect uitgebalanceerde hoeveelheid is. Tenzij dat niet zo is. Maar dat mogen we nu samen gaan ontdekken in dit geweldige avontuur met de naam New Frontiers.",
  "new_frontiers_major_gameplay_neutral_item_token_title": "Neutrale item-vondsten aangepast",
  "new_frontiers_major_gameplay_neutral_item_token_desc": "Bij het afslachten van boswezens kon je vroeger rekenen op een cool nieuw neutraal item. En dat item ging meestal naar de carry en dat was meestal iemand anders dan jij. Als je nu een neutrale creep doodt, kun je een fiche vinden waarmee je uit [i]vijf[/i] verschillende neutrale items kunt kiezen. Ieder fiche biedt altijd alle vijf keuzemogelijkheden, dus zelfs als je de laatste speler bent die het fiche inwisselt, kun je nog echt kiezen.<br><br>Teams kunnen fiches onderling verdelen, maar de gekozen items kunnen niet worden gedeeld. Denk dus goed na over wie de fiches krijgt.",
  "new_frontiers_major_gameplay_neutral_creep_scaling_title": "Steeds sterkere neutrale creeps",
  "new_frontiers_major_gameplay_neutral_creep_scaling_desc": "Neutrale creeps en hun vaardigheden worden nu steeds beter naarmate het spel vordert. Dat betekent inderdaad dat het steeds moeilijker wordt om kampen uit te roeien, maar helden die controle hebben over creeps, beschikken door deze wijziging ook over een steeds krachtigere back-up.",
  "new_frontiers_major_gameplay_kill_formula_title": "Scoreformule voor kills bijgewerkt",
  "new_frontiers_major_gameplay_kill_formula_desc": "We hebben de scoreformule voor het doden van tegenstanders bijgewerkt, zodat het maken van slachtoffers aan het begin van een spel meer impact heeft en spelers worden gestimuleerd om andere paden in te nemen. We hebben ook de toename van goud verminderd voor padcreeps, waardoor het farmen van creeps minder lucratief is naarmate het spel vordert. We hopen dat dit spelers aanmoedigt om in plaats daarvan goud te verzamelen door vijanden in elkaar te timmeren.",
  "new_frontiers_major_gameplay_unstunning_stuns_title": "Een niet-verlammende nieuwe functie",
  "new_frontiers_major_gameplay_unstunning_stuns_desc": "Je held spelen is altijd leuker dan een beetje rondhangen en niet je held spelen. Daarom hebben we goed nieuws voor jullie, beste fans van het spelen van dingen en critici van het niet spelen van dingen. Maak je klaar om je held meer dan ooit te spelen.<br><br>Hoe? Heel eenvoudig. We hebben de duur van alle uitschakelingen in het spel verkort. Hoe we op dit krankzinnige idee zijn gekomen? Dat is nog eenvoudiger. We zijn keihard geraakt door een Roar van Beastmaster en toen hadden we opeens heel veel tijd over om eens goed na te denken.",
  "new_frontiers_major_gameplay_hero_rework_muerta": "Na twee maanden te hebben rondgespookt op de paden heeft Muerta eindelijk haar Aghanim's Scepter en Shard gevonden. Als je haar nog niet hebt leren kennen, lees dan de [url=https://www.dota2.com/deadreckoning]Dead Reckoning-update[/url] voor meer informatie.",
  "new_frontiers_major_gameplay_hero_rework_ogre_magi": "Ogre Magi is te dom om een intelligentieheld te zijn. Dus dat is hij vanaf nu niet meer.",
  "new_frontiers_major_gameplay_hero_rework_medusa": "Medusa begint het spel nu zo teer als een baby, maar net als baby's wordt ze na verloop van tijd steeds sterker.",
  "new_frontiers_major_gameplay_hero_rework_clinkz": "Bij de meeste vaardigheden van Clinkz verschijnen er nu skeletten, zoals dat gaat in het leven.",
  "new_frontiers_major_gameplay_hero_rework_arc_warden": "Ard Warden maakte altijd een perfecte kloon van zichzelf. Maar nu maakt hij een [i]betere[/i] versie van zichzelf. Of slechter. In ieder geval anders. En totaal niet controversieel.",
  "new_frontiers_major_gameplay_hero_rework_alchemist": "De held Alchemist is nu, net als alle Alchemist-spelers, van nature hebzuchtig.",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_title": "TIJDELIJKE BONUS VOOR ARC WARDEN",
  "new_frontiers_major_gameplay_hero_arc_warden_bonus_desc": "Als je Arc Warden kiest wanneer je voor de Dire speelt, is Tempest Double nu tijdelijk de hoofdheld en wordt zijn 'normale' versie opgeroepen wanneer je zijn ultimate gebruikt.",
  "new_frontiers_matchmaking_desc": "Laten we eerlijk zijn: er zijn acht miljard mensen op aarde en 99,99% van hen zijn waardeloos in Dota. Dat betekent dat matchmaking altijd een uitdaging is, vooral als je goed bent in Dota en graag met anderen speelt die bíjna net zo goed maar hopelijk niet zo goed in Dota zijn als jij. We hebben er hard aan gewerkt en hebben alle berekeningen losgelaten op onze matchmaking om de kwaliteit te verbeteren voor spelers van elk niveau.",
  "new_frontiers_matchmaking_intro_title": "Betrouwbare matchmaking",
  "new_frontiers_matchmaking_intro_desc": "De matchmakingbeoordeling (MMR) is eigenlijk maar gebaseerd op twee getallen: de rang en de rangbetrouwbaarheid. Je rang is een schatting van je speelniveau en de rangbetrouwbaarheid komt voort uit ons vertrouwen in die schatting. Wanneer je een spel speelt, passen we je rang aan op basis van winst en verlies. En tegelijkertijd neemt je rangbetrouwbaarheid na een wedstrijd toe, omdat we dan meer gegevens hebben.",
  "new_frontiers_matchmaking_details_old_title": "De problemen van het oude algoritme",
  "new_frontiers_matchmaking_details_old_desc": "Dota gebruikte traditioneel een aangepaste versie van het Elo-algoritme om wijzigingen in rangen en rangbetrouwbaarheid door te voeren. Na verloop van tijd hebben we echter gemerkt dat er enkele problemen zijn met onze aanpak. Zo verschoof de verdeling van MMR's geleidelijk naar beneden en veroorzaakte een ongewenste groepering in het MMR-bereik van 0 tot 1000. Een ander probleem was dat het voor spelers die een pauze hadden genomen en daarna terugkeerden, veel moeilijker was om een correcte MMR te krijgen, omdat hun vorige vaardigheidsniveau niet langer representatief was.",
  "new_frontiers_matchmaking_details_new_title": "Nieuw en verbeterd algoritme",
  "new_frontiers_matchmaking_details_new_desc": "Om dit aan te pakken, schakelen we over op een ander algoritme genaamd Glicko, waardoor je snel en nauwkeurig gematcht wordt met andere spelers van een vergelijkbaar niveau. Met Glicko kunnen we in onze berekeningen beter rekening houden met de rangbetrouwbaarheid van een speler, wat resulteert in nauwkeurigere beslissingen over rangwinst en -verlies.\\n\\nDe overgang naar ons nieuwe matchmakingsysteem zal een beetje aanvoelen als het begin van een nieuw matchmakingseizoen: [list][*]Alle spelers worden teruggeplaatst in een korte kalibratiemodus, aanvankelijk geplaatst op basis van hun vorige rang.\\n[*]Kalibratie is niet langer een vast aantal wedstrijden. In plaats daarvan wordt een speler als gekalibreerd beschouwd wanneer de rangbetrouwbaarheid boven een bepaalde drempel ligt.\\n[*]Bij kalibratie is het waarschijnlijk dat je een andere medaille krijgt dan die je daarvoor had. Zelfs als je medaille aanzienlijk verandert, kun je ervan uitgaan dat je gematcht wordt met spelers van een gelijkwaardig niveau.\\n[*]Wedstrijden zullen niet langer een vaste waarde voor MMR-winst of -verlies hebben. Deze waarde zal variëren op basis van een aantal factoren, waaronder de rangen en de rangbetrouwbaarheid van de deelnemers. We zullen echter de winst of het verlies per wedstrijd beperken om bijzonder negatieve uitkomsten te voorkomen. [*]De rangbetrouwbaarheid van een speler zal na verloop van tijd langzaam dalen als de speler geen wedstrijden speelt.[/list]We hebben beide matchmaking-systemen achter de schermen al een tijdje gelijktijdig gebruikt om ons vertrouwen in deze wijzigingen op te bouwen. We begrijpen dat een nauwkeurige MMR maar een van de vele factoren is die de wedstrijdkwaliteit beïnvloeden, en zoals bij alle veranderingen op dit gebied zijn we benieuwd naar jullie feedback.",
  "new_frontiers_matchmaking_immortals_title": "Matchmaking met de rang Immortal",
  "new_frontiers_matchmaking_immortals_desc": "Bij de rang Immortal is het kennen van de andere spelers, de samenwerking en een goede balans tussen de rollen belangrijker dan alleen MMR. Daarom hebben we matchmaking op het niveau van Immortal aangepast.<br><br>Wedstrijden in de Immortal-rangen zullen geen gebruik meer maken van vooraf samengestelde teams. In plaats daarvan mogen twee aanvoerders de andere acht spelers voor elk team kiezen, waardoor je team meer impact heeft dan wanneer je alleen op MMR zou vertrouwen om opstellingen te maken. Dus als je wedstrijd nu niet lekker loopt, kun je dat alleen jezelf verwijten.",
  "new_frontiers_ui_desc": "Heb je last van wazig zicht en een knorrende maag? We adviseren je om dit te negeren. Je lichaam probeert je alleen te vertellen dat het honger heeft. Heb je een lekke band? Rijd op de velg, die is nog steeds rond. Het punt is: bijna alles in het leven kan veilig worden genegeerd zonder gevolgen.<br><br>Behalve de gezondheidsbalken van Dota. Die zijn belangrijk. Daarom hebben we met deze update een hoop extra informatie over gezondheid toegevoegd aan de gebruikersinterface.",
  "new_frontiers_ui_shields_title": "Barrières voor gezondheidsbalken",
  "new_frontiers_ui_shields_desc": "Wist je dat er schilden zijn in Dota? Magische schilden, fysieke schilden, duistere schilden ... allerlei soorten! Misschien heb je ze over het hoofd gezien. Of simpelweg genegeerd. Omdat er geen manier was om te zien met hoeveel schilden je begon of hoeveel er nog over zijn.<br><br>Maar dit donkere tijdperk van onzekerheid is nu voorbij. Nu is alles zichtbaar. Of althans, hoeveel je er hebt is nu duidelijk. En ook het type schild wordt nu weergegeven! Om de visuele verbetering van al die oude schilden te vieren, hebben we een aantal nieuwe vaardigheden toegevoegd waarbij ze worden gebruikt.<br><br>We hebben ze ook hernoemd van Schilden naar Barrières, zodat je niet in de war raakt en denkt dat er een Vanguard op je gezondheidsbalk staat. Graag gedaan.",
  "new_frontiers_ui_health_pips_title": "Gesegmenteerde gezondheidsbalk",
  "new_frontiers_ui_health_pips_desc": "Sommige eenheden hebben geen traditionele levensbalk en er is een aantal aanvallen nodig om ze neer te halen. Je hoeft het aantal vereiste aanvallen niet langer te raden of te tellen, maar kijkt gewoon naar de eenheid die je wilt uitschakelen. De gezondsheidsinzet is nu gesegmenteerd om het aantal slagen weer te geven dat moet worden geïncasseerd voordat de aardse zorgen worden afgeworpen (citaat van de levensbalk van Hamlet).",
  "new_frontiers_ui_health_cost_title": "Gezondheidskosten",
  "new_frontiers_ui_health_cost_desc": "De meeste vaardigheden in Dota verbruiken mana, maar sommige verbruiken gezondheid. Nu worden voor het gebruik van die vaardigheden de HP-kosten weergeven. Niet slecht, toch? Eigenlijk best gek dat niemand eerder op dit idee is gekomen, maar beter laat dan nooit.",
  "new_frontiers_gameplay_update_desc": "Dat is een enorme lijst. Maar [i]twee[/i] lijsten zou nog beter zijn ... [i]aha, wat hebben we hier?[/i] Lees verder voor alle andere balanswijzigingen die deze update in petto heeft. Of spring gewoon in het spel en speel. Echt, je hoeft ons niet te vertellen hoe leuk het is om technische handleidingen over videospellen te lezen, maar spelen is bijna net zo leuk. Je kunt deze lijst na je spel nog altijd een keer lezen.",
  "new_frontiers_misc_title": "Overig",
  "new_frontiers_misc_role_tokens": "Je krijgt nu minder rollenwachtrij-tokens als je een wedstrijd verliest waarbij je 'Alle rollen' hebt geselecteerd. Nu verdien je twee tokens bij verlies (als je wint, krijg je nog steeds de volle vier tokens). Deze verandering zou moeten helpen om het gedrag van spelers rond ranked spellen met vastgelegde rollen te verbeteren. Hierbij was voor sommige spelers het farmen van tokens belangrijker dan het effectief spelen van een toegewezen rol.",
  "new_frontiers_misc_removed_roles": "We hebben de aanvoerdersmodus uit ranked gehaald en 'Alles willekeurig' en 'Willekeurige deathmatch' uit unranked verwijderd. Bijna niemand speelt deze modi en de wachttijden bedragen gemakkelijk meer dan een uur.",
  "new_frontiers_misc_model_editor": "Deze update verwijdert de oude modelbewerker. Alle vmdl-bestanden worden nu geladen in de nieuwe tool en oude modellen worden omgezet wanneer je ze voor het eerst in de tool laadt. We zullen bij een volgende update de ondersteuning voor het laden van de oude gecompileerde indeling volledig verwijderen, dus we raden alle Workshop-makers aan om hun modellen zo snel mogelijk te laden en te converteren naar de nieuwe indeling en ze opnieuw te compileren.",
  "new_frontiers_misc_hold_animation": "We hebben de ondersteuning voor de oude 'HoldAnimation'-sleutel voor dynamische eigenschappen verwijderd. Aangepaste spellen moeten handmatig overschakelen naar de nieuwe 'loop mode'-sleutel, of hun map hercompileren om deze eigenschappen automatisch bij te werken.",
  "neutral_item_tier": "[b]Rang %1$s[/b] Neutraal item",
  "dota_ability_variable_health": "gezondheid",
  "dota_ability_variable_mana": "mana",
  "dota_ability_variable_armor": "pantser",
  "dota_ability_variable_damage": "schade",
  "dota_ability_variable_str": "kracht",
  "dota_ability_variable_int": "intelligentie",
  "dota_ability_variable_agi": "behendigheid",
  "dota_ability_variable_all": "alle attributen",
  "dota_ability_variable_primary_attribute": "primair attribuut",
  "dota_ability_variable_attack": "aanvalssnelheid",
  "dota_ability_variable_hp_regen": "gezondheidsherstel",
  "dota_ability_variable_lifesteal": "levensdiefstal",
  "dota_ability_variable_mana_regen": "manaherstel",
  "dota_ability_variable_mana_regen_aura": "manaherstel (aura)",
  "dota_ability_variable_spell_amp": "spreukschade",
  "dota_ability_variable_debuff_amp": "debuffduur",
  "dota_ability_variable_move_speed": "bewegingssnelheid",
  "dota_ability_variable_evasion": "ontwijking",
  "dota_ability_variable_spell_resist": "magieweerstand",
  "dota_ability_variable_spell_lifesteal": "levensdiefstal spreuken",
  "dota_ability_variable_spell_lifesteal_creep": "levensdiefstal spreuken (creeps)",
  "dota_ability_variable_spell_lifesteal_hero": "levensdiefstal spreuken (helden)",
  "dota_ability_variable_selected_attrib": "geselecteerd attribuut",
  "dota_ability_variable_attack_range": "aanvalsbereik <font color='#7d7d7d'>(enkel afstand)</font>",
  "dota_ability_variable_attack_range_melee": "aanvalsbereik <font color='#7d7d7d'>(alleen melee)</font>",
  "dota_ability_variable_cast_range": "spreukbereik",
  "dota_ability_variable_status_resist": "statusweerstand",
  "dota_ability_variable_projectile_speed": "projectielsnelheid",
  "dota_ability_variable_manacost_reduction": "vermindering manakosten",
  "dota_ability_variable_cooldown_reduction": "vermindering afkoeltijd",
  "dota_ability_variable_max_mana_percentage": "max. manabonus"
}