// 3579.js

{
  "language": "german",
  "patch738_website_subheader": "Gameplay-Update 7.38",
  "patch738_website_title": "Wandernde Wasserläufe",
  "patch738_website_introduction": "Lassen Sie sich von der Strömung tragen, um schneller zur Safelane zu gelangen, schmieden Sie Ihr eigenes Schicksal mit herstellbaren neutralen Gegenständen und entdecken Sie eine Vielzahl an Änderungen und Verbesserungen.",
  "patch738_map_title": "Eine bessere, nassere Welt",
  "patch738_map_introduction": "Der Fluss, der seit ewigen Zeiten die Dota-Karte teilt, war bislang kaum mehr als eine natürliche Grenze, die die verfeindeten Fraktionen der Radiant und der Dire voneinander trennte. Doch mit der Überflutung weiter Teile des Schlachtfelds hat er nicht nur seinen eigenen Verlauf geändert, sondern wird den Verlauf jeder Partie beeinflussen.",
  "patch738_map_majorchanges_river_title": "Mit dem Strom schwimmen",
  "patch738_map_majorchanges_river_description": "All diese neuen Wasserläufe in den Dschungeln wurden nicht nur zur Zierde angelegt. Wenn Sie sich mit der Strömung bewegen, erhalten Sie einen Temposchub in Richtung der Safelane. Bewegen Sie sich stromaufwärts, werden Sie aber nicht verlangsamt.",
  "patch738_map_majorchanges_roshan_title": "Roshans Umzug",
  "patch738_map_majorchanges_roshan_description": "Die beiden Gruben von Roshan wurden in den Fluss verlegt und befinden sich jetzt in der Nähe der Kraftrunen. Roshan erscheint zu Beginn der Partie in der südlichen Grube, doch wenn die Sonne hoch am Himmel steht, macht er sich auf den Weg zu seiner nördlichen Residenz und wirft dabei alle Einheiten, die seinen Weg kreuzen, durch die Luft.",
  "patch738_map_majorchanges_wisdom_title": "Die Weisheit der Schreine",
  "patch738_map_majorchanges_wisdom_description": "Die Runen der Weisheit wurden durch Schreine der Weisheit ersetzt und an andere Orte verlegt. Sie können noch immer Erfahrung für Ihren Helden sowie einen Verbündeten sammeln, jedoch müssen Sie dafür im Schrein verweilen, anstatt eine Rune aufzusammeln. Die Krux ist, dass Schreine nicht aktiviert werden, wenn ein gegnerischer Held ihre Ruhe stört. Sie müssen sich also gegebenenfalls ihre andächtige Ruhe und somit ihre Belohnung erkämpfen.",
  "patch738_map_majorchanges_lotus_title": "Blut im Wasser",
  "patch738_map_majorchanges_lotus_description": "Wie bei den Schreinen der Weisheit müssen Sie sich allein im Lotosbrunnen befinden, um Lotosblumen zu erhalten. Wenn Gegner Sie im Brunnen überraschen, wird auch der Lotosbrunnen nicht aktiviert.",
  "patch738_map_majorchanges_creeps_title": "Ein evolutionärer Sprung",
  "patch738_map_majorchanges_creeps_description": "Wir haben die Lager der neutralen Einheiten für die Wandernden Wasserläufe ebenfalls überarbeitet und eine neue Einheit entwickelt. Diese entwickelt sich während einer Partie von einer Kaulquappe zu einer Sumpfschrecke und letztlich zu einem Unkenbiest.",
  "patch738_map_majorchanges_otherchanges": "Terrain im Wandel",
  "patch738_map_majorchanges_moreinfo": "Eine vollständige Liste der Änderungen an der Karte finden Sie in den Patchnotizen.",
  "patch738_map_majorchanges_tormentor_title": "Peiniger auf Achse",
  "patch738_map_majorchanges_tormentor_description": "Peiniger erscheinen nicht mehr in der Nähe der Basis der beiden Teams. Stattdessen erscheint nur noch ein einzelner Peiniger abhängig von der Tageszeit an einem von zwei Orten in den Ecken der Karte (Roshan erscheint dann immer auf der gegenüberliegenden Seite). Neben einiger anderer Änderungen hat der Peiniger auch eine neue Fähigkeit erhalten, wodurch Spieler nach dessen Zerstörung in seinem Umkreis geheilt werden.",
  "patch738_neutrals_title": "Nutzen Sie die Macht des Mondes",
  "patch738_neutrals_introduction": "Mit Mondsteinen gibt es eine neue Ressource, die zur Herstellung von neutralen Gegenständen verwendet werden kann, um den perfekten Spielstil zu finden oder sich den Gegebenheiten des Spiels anzupassen.",
  "patch738_neutrals_lumber_title": "Wie man Mondsteine erhält",
  "patch738_neutrals_lumber_description": "Der erste Schritt zur Herstellung von einzigartigen neutralen Gegenständen besteht darin, alle neutralen Einheiten eines Lagers zu besiegen. Dadurch können zwei Mondsteine für den eigenen Helden und ein weiterer für einen zufälligen Verbündeten verdient werden.",
  "patch738_neutrals_crafting_title": "Artefakte und Verzauberungen",
  "patch738_neutrals_crafting_description": "Der zweite Schritt zur Herstellung von einzigartigen neutralen Gegenständen besteht darin, genug Mondsteine anzusammeln. Jeder neutrale Gegenstand besteht jetzt aus zwei Teilen: Einem Artefakt, das dem Gegenstand aktive und passive Fähigkeiten verleiht, und einer Verzauberung, die passive Attributboni gewährt.",
  "patch738_neutrals_timings_title": "Überblick über den Herstellungsstatus",
  "patch738_neutrals_timings_description": "Es gibt fünf Stufen von Artefakten und Verzauberungen, die während eines bestimmten Zeitfensters einer Partie verfügbar sind. Sie können den Herstellungsstatus von Gegenständen Ihrer Teammitglieder überprüfen und mithelfen, genug Mondsteine für Ihr Team zu sammeln.",
  "patch738_neutrals_tab_title": "Neutrale Gegenstände auf einen Blick",
  "patch738_neutrals_tab_description": "Durchstöbern Sie jede Kombination aus Artefakt und Verzauberung im aktualisierten Tab für neutrale Gegenstände. Zuschauer können auch auf einen Blick sehen, welche Gegenstände ein Held bisher hergestellt hat.",
  "patch738_neutrals_changes_moreinfo": "Eine vollständige Liste der Änderungen an neutralen Gegenständen finden Sie in den Patchnotizen.",
  "patch738_heroes_title": "Aktualisierungen an Helden",
  "patch738_qol_title": "Verbessertes Spielerlebnis",
  "patch738_qol_introduction": "Tauchen Sie ein und entdecken Sie eine Vielzahl an Änderungen und Verbesserungen am Gameplay und der Spielmechanik.",
  "patch738_qol_feature_roshan_timer_title": "Roshan-Timer",
  "patch738_qol_feature_roshan_timer_description": "Bewegen Sie den Mauszeiger über den Roshan-Timer neben der Minikarte, um einen Hinweis zu erhalten, ob der bei allen beliebte neutrale Boss noch immer in der Teufelsgrotte verweilt und dem Orakelkraut beim Wachsen zusieht, oder vielleicht schon in eine seiner Gruben an der Oberfläche zurückgekehrt ist.",
  "patch738_qol_feature_hud_timers_title": "HUD-Timer",
  "patch738_qol_feature_hud_timers_description": "Früher mussten Sie die ganze Karte durchforsten, um die verschiedenen Timer von Dota Plus zu überprüfen. Jetzt können Sie dankenswerterweise einfach die ALT-Taste gedrückt halten, um diese Timer im oberen Bereich Ihres HUDs einzublenden. Nur für den Fall, dass Sie Ihren Verbündeten <i>wieder einmal Beine machen müssen</i>, um vor Ihren Gegnern an einem wichtigen Ort einzutreffen.",
  "patch738_qol_feature_item_effects_title": "Anvisierungseffekte für Gegenstände",
  "patch738_qol_feature_item_effects_description": "Wir haben einer Reihe von Gegenständen visuelle Effekte hinzugefügt (u. a. für Glimmer Cape und Lotus Orb), um besser zu veranschaulichen, welcher Held das Ziel einer Gegenstandsfähigkeit ist.",
  "patch738_qol_feature_attributes_pips_title": "Anzeige aller Attribute",
  "patch738_qol_feature_attributes_pips_description": "Sehen Sie auf einen Blick, welche Attribute des Talentbaums Sie bisher ausgewählt haben.",
  "patch738_qol_feature_markforsell_title": "Gegenstände zum Verkauf vormerken",
  "patch738_qol_feature_markforsell_description": "Ein vorgemerkter Gegenstand wird sofort verkauft, wenn Sie sich bei Ihrem Brunnen (Sie müssen dafür aber am Leben sein) oder in der Nähe des Geheimladens befinden. Es kommt noch besser: Kuriere haben von dieser Änderung bereits Wind bekommen und nehmen automatisch alle vorgemerkten Gegenstände mit zurück in die Basis, nachdem sie Ihnen eine Lieferung gebracht haben.",
  "patch738_qol_feature_backpack_grace_title": "Sofortiges Ausrüsten von Rucksackgegenständen",
  "patch738_qol_feature_backpack_grace_description": "Eine Lieferung von wichtigen Gegenständen während eines Teamkampfs sollte eine Partie zu den eigenen Gunsten wenden. Sie sollten nicht dazu verdammt sein, zuzusehen, wie das eigene Team eine Sekunde vor Ablauf der Abklingzeit eines aus dem Rucksack ausgerüsteten Gegenstands stirbt. Aus diesem Grund können Sie jetzt gelieferte Gegenstände ohne die Abklingzeit von sechs Sekunden aus Ihrem Rucksack in Ihr Inventar ziehen und sie sofort benutzen.",
  "patch738_gameplayupdate_title": "Patchnotizen für 7.38",
  "patch738_gameplayupdate_introduction": "Tauchen Sie ein und entdecken Sie im folgenden Abschnitt alle Änderungen des Gameplays!",
  "patch738_qol_feature_item_effects_list_label": "Liste anzeigen",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Heilender Lotos<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Aghanims Zepter von Alchemist<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}