// 9236.js

{
  "language": "portuguese",
  "patch738_website_subheader": "Atualização de jogabilidade 7.38",
  "patch738_website_title": "Wandering Waters",
  "patch738_website_introduction": "Corre na direção das correntes dos riachos para chegares à safe lane mais rápido, fabrica itens neutros para forjares o teu destino e mergulha num dilúvio de novas alterações e melhorias.",
  "patch738_map_title": "O mapa já não é uma seca",
  "patch738_map_introduction": "O rio que divide o mapa do Dota nunca foi muito mais do que uma mera linha de água na areia, separando as duas fações adversárias conhecidas como Radiant e Dire. Mas o rio finalmente transbordou, inundando os planaltos e mudando o campo (e o rumo) da batalha.",
  "patch738_map_majorchanges_river_title": "Correr na corrente corre bem",
  "patch738_map_majorchanges_river_description": "Todos estes riachos nas selvas não servem apenas para enfeitar o cenário. Caminhar no sentido da corrente irá conceder-te um bónus de rapidez de movimento na direção da lane de cima ou de baixo. Não é aplicado nenhum efeito negativo ao caminhar contra a corrente.",
  "patch738_map_majorchanges_roshan_title": "Realocação do Roshan",
  "patch738_map_majorchanges_roshan_description": "Os dois covis do Roshan foram movidos para o rio, perto das duas runas de poderes. O Roshan irá aparecer no covil mais a sul no início da partida, mas, eventualmente, quando o sol se decidir ir embora, o Roshan também. Com base no ciclo de dia e noite, o Roshan começará a percorrer o caminho total até ao outro covil, arremessando as unidades com que se cruzar.",
  "patch738_map_majorchanges_wisdom_title": "Alto, um altar",
  "patch738_map_majorchanges_wisdom_description": "As Runas de Sabedoria foram movidas e substituídas pelos Altares da Sabedoria. Ainda podes ganhar experiência para ti e para um aliado, mas agora, em vez de apanhares uma runa do chão, basta aproximares-te do altar para ganhares XP. O senão é que o altar não se ativa se houver um herói inimigo por perto. Vais ter de lutar por um pouco de privacidade se quiseres mesmo aproveitar-te do altar.",
  "patch738_map_majorchanges_lotus_title": "Luta pela Lótus",
  "patch738_map_majorchanges_lotus_description": "Tal como com os Altares da Sabedoria, agora tens de estar dentro de uma Fonte de Lótus para apanhares os seus frutos. Os inimigos na área irão impedir que a Fonte de Lótus se ative, então certifica-te de que estás a sós.",
  "patch738_map_majorchanges_creeps_title": "Escalões dos sapos",
  "patch738_map_majorchanges_creeps_description": "Esta atualização também traz novos creeps anfíbios, com os seus próprios acampamentos. Ao longo da partida, Pollywogs irão evoluir para Boglets e, por último, para Croakers.",
  "patch738_map_majorchanges_otherchanges": "Terreno: o antes e o depois",
  "patch738_map_majorchanges_moreinfo": "Uma lista completa das alterações ao mapa estão disponíveis nas notas da atualização.",
  "patch738_map_majorchanges_tormentor_title": "Tormentor transitório",
  "patch738_map_majorchanges_tormentor_description": "Os Tormentors já não aparecem perto da base de cada equipa. Em vez disso, um único Tormentor irá aparecer numa de duas localizações nos cantos do mapa, dependendo da altura do dia, o que significa que irá sempre aparecer no lado oposto do Roshan. Além de muitos outros ajustes, o Tormentor também tem uma nova habilidade que irá deixar para trás uma aura curativa numa área depois de ser destruído.",
  "patch738_neutrals_title": "Muda a maré da batalha",
  "patch738_neutrals_introduction": "Junta Madstones, um novo material que te permite fabricar itens neutros que podes personalizar à tua medida e de acordo com as circunstâncias da partida.",
  "patch738_neutrals_lumber_title": "Como obter Madstones",
  "patch738_neutrals_lumber_description": "O primeiro passo para obter itens neutros personalizados é exterminar acampamentos de creeps neutros. É assim que ganhas Madstones: duas para ti e uma para um aliado aleatório.",
  "patch738_neutrals_crafting_title": "Arfetactos e Encantamentos",
  "patch738_neutrals_crafting_description": "Segundo passo: junta Madstones para fabricares itens neutros personalizados. Cada item neutro tem dois componentes: um Artefacto, que decide a habilidade do item, e um Encantamento, que determina os bónus passivos de atributos.",
  "patch738_neutrals_timings_title": "Vê quem está a fabricar o quê",
  "patch738_neutrals_timings_description": "Há cinco classes de Artefactos e Encantamentos disponíveis em períodos diferentes durante uma partida. Verifica o progresso dos outros membros da tua equipa e ajuda a exterminar acampamentos para ajudares a distribuir a riqueza.",
  "patch738_neutrals_tab_title": "Todos os neutros de relance",
  "patch738_neutrals_tab_description": "Vê todas as combinações de Artefactos e Encantamentos no novo separador de itens neutros durante partidas. Os espectadores podem ver facilmente os itens neutros fabricados de todos os jogadores.",
  "patch738_neutrals_changes_moreinfo": "A lista completa de alterações a itens neutros está disponível nas notas da atualização.",
  "patch738_heroes_title": "Atualizações a heróis",
  "patch738_qol_title": "Melhorias gerais de qualidade",
  "patch738_qol_introduction": "Mergulha num oceano de ajustes e melhoramentos à jogabilidade e às mecânicas.",
  "patch738_qol_feature_roshan_timer_title": "Indicador do Roshan",
  "patch738_qol_feature_roshan_timer_description": "Passa o cursor sobre este novo indicador ao lado do minimapa para veres se o Roshan morreu ou se já reapareceu.",
  "patch738_qol_feature_hud_timers_title": "Temporizadores na interface",
  "patch738_qol_feature_hud_timers_description": "Antes, tinhas de procurar pelo mapa todo para veres os vários temporizadores do Dota Plus. Felizmente, agora basta manter ALT premido para veres o estado desses temporizadores na parte superior do teu ecrã. Só para o caso de precisares de alertar os teus aliados para lhes lembrares de fazer <i>algo importante</i> antes que o inimigo o faça.",
  "patch738_qol_feature_item_effects_title": "Novos efeitos visuais de itens",
  "patch738_qol_feature_item_effects_description": "Adicionámos diversos efeitos visuais de itens (desde Glimmer Cape até Lotus Orb e muitos mais) para que comuniquem melhor qual dos heróis é a fonte dos efeitos do item.",
  "patch738_qol_feature_attributes_pips_title": "Indicador de bónus de atributos",
  "patch738_qol_feature_attributes_pips_description": "Vê facilmente quais bónus de atributos da árvore de talentos já selecionaste.",
  "patch738_qol_feature_markforsell_title": "Marcar para venda",
  "patch738_qol_feature_markforsell_description": "Marca um item para ser imediatamente vendido quando o teu herói estiver (vivo) na base ou na Loja Secreta. Melhor ainda, o teu estafeta já está a par das últimas novidades e irá levar os teus itens marcados de volta para a Fonte quando fizer uma entrega.",
  "patch738_qol_feature_backpack_grace_title": "Mochila menos restritiva",
  "patch738_qol_feature_backpack_grace_description": "A entrega de um item crucial no meio de uma luta deveria ser um momento triunfal para mudares o rumo da batalha, não um momento para veres a tua equipa inteira a morrer porque o jogo obrigou-te a esperar alguns segundos antes de poderes usar o item que recebeste. Para ajudar nestes momentos, agora podes arrastar itens acabados de comprar para fora da tua mochila sem teres de esperar seis segundos, podendo assim usá-los imediatamente.",
  "patch738_gameplayupdate_title": "Notas da atualização 7.38",
  "patch738_gameplayupdate_introduction": "Deixa-te afundar no mar de alterações abaixo e absorve as novidades desta atualização!",
  "patch738_qol_feature_item_effects_list_label": "Ver lista",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist - Aghanim's Scepter<br>Moonshard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}