// 6147.js

{
  "language": "Italian",
  "patch738_website_subheader": "Aggiornamento di gioco 7.38",
  "patch738_website_title": "Acque erranti",
  "patch738_website_introduction": "Lasciati trasportare dalle correnti per raggiungere più rapidamente la tua Safe Lane e forgia il tuo destino creando i tuoi oggetti neutrali. Attenzione: ti aspetta un diluvio di modifiche e miglioramenti!",
  "patch738_map_title": "Un mondo migliore e meno secco",
  "patch738_map_introduction": "Il corso d'acqua che divide la mappa di Dota è sempre stato poco più di una linea d'acqua nella sabbia, che separa le fazioni in guerra dei Radiant e dei Dire. Ma il fiume ha finalmente rotto gli argini: ora scorre verso le alture e promette di ribaltare le sorti della battaglia.",
  "patch738_map_majorchanges_river_title": "Segui la corrente",
  "patch738_map_majorchanges_river_description": "Questi nuovi corsi d'acqua nella giungla non migliorano solo il paesaggio, puoi lasciarti trasportare dalla corrente per raggiungere più rapidamente la tua Safe Lane. Inoltre, risalire la corrente non ti rallenterà.",
  "patch738_map_majorchanges_roshan_title": "Il trasferimento di Roshan",
  "patch738_map_majorchanges_roshan_description": "Le due tane di Roshan sono state spostate sul fiume, vicino alle due Rune del Potere. Roshan apparirà nella tana più a sud all'inizio del gioco, ma quando il sole sarà alto nel cielo, percorrerà la distanza totale tra le due fosse, lanciando in aria tutte le Unità che incontrerà lungo la strada.",
  "patch738_map_majorchanges_wisdom_title": "Attenzione ai Santuari",
  "patch738_map_majorchanges_wisdom_description": "Le Rune della Saggezza sono state spostate e sostituite dai Santuari della Saggezza. La differenza? Ora dovrai stare vicino al Santuario per ottenere ESP sia per te che per la tua squadra, anziché dover raccogliere una Runa dal terreno. Inoltre, per attivare il Santuario non devono esserci Eroi nemici all'orizzonte. Non si condivide la propria saggezza con la squadra nemica!",
  "patch738_map_majorchanges_lotus_title": "Acqua insanguinata",
  "patch738_map_majorchanges_lotus_description": "Per recuperare i Loti da uno Stagno, ora è necessario immergersi in esso. Come per i Santuari della Saggezza, i nemici nelle vicinanze impediranno il recupero dei Loti. Assicurati di non nuotare in compagnia.",
  "patch738_map_majorchanges_creeps_title": "Un balzo evolutivo",
  "patch738_map_majorchanges_creeps_description": "Con questo aggiornamento anche i campi dei creep vengono rinnovati. È stato introdotto un nuovo tipo di creep anfibio che si evolve nel corso del gioco, assumendo la forma di Pollywog, Boglet o Croaker.",
  "patch738_map_majorchanges_otherchanges": "Cambiamenti sul campo",
  "patch738_map_majorchanges_moreinfo": "Un elenco completo delle modifiche alla mappa è disponibile nelle note della patch.",
  "patch738_map_majorchanges_tormentor_title": "Oppressore transitorio",
  "patch738_map_majorchanges_tormentor_description": "Gli Oppressori non riappaiono più vicino alla base di ogni squadra. D'ora in poi, un singolo Oppressore apparirà in una delle due estremità della mappa, a seconda che sia notte o giorno, il che significa che apparirà sempre sul lato opposto a quello di Roshan. Oltre a un mucchio di altre modifiche, l'Oppressore ha anche una nuova abilità che lascerà dietro di sé, un'area d'effetto curativa, una volta morto.",
  "patch738_neutrals_title": "Cambia le sorti della battaglia",
  "patch738_neutrals_introduction": "Ti presentiamo la Pietra della Pazzia, una nuova risorsa che ti consente di creare oggetti neutrali in base al tuo stile di gioco e alle circostanze della partita.",
  "patch738_neutrals_lumber_title": "Ottenere la Pietra della Pazzia",
  "patch738_neutrals_lumber_description": "Il primo passo per ottenere oggetti neutrali personalizzati è liberare completamente un campo di creep neutrali. In questo modo otterrai le Pietre della Pazzia, due per te e una per un alleato casuale.",
  "patch738_neutrals_crafting_title": "Manufatti e incantesimi",
  "patch738_neutrals_crafting_description": "Fase due: risparmia le Pietre della Pazzia per creare oggetti neutrali personalizzati. Ogni oggetto neutrale è ora composto da due parti: un manufatto che conferisce nuove abilità all'oggetto e un incantesimo che gli conferisce bonus di statistiche passive/attributi.",
  "patch738_neutrals_timings_title": "Scopri chi sta creando cosa",
  "patch738_neutrals_timings_description": "Durante una partita sono disponibili cinque livelli di manufatti e incantesimi in finestre specifiche. Controlla i progressi nella creazione della tua squadra e aiuta a liberare i campi per condividere la ricchezza.",
  "patch738_neutrals_tab_title": "Un'occhiata agli oggetti neutrali",
  "patch738_neutrals_tab_description": "Sfoglia tutte le combinazioni di manufatti e incantesimi nella scheda Oggetti neutrali aggiornata mentre sei in gioco. Gli spettatori possono vedere facilmente la cronologia di creazione di ogni Eroe.",
  "patch738_neutrals_changes_moreinfo": "Un elenco completo delle modifiche agli oggetti neutrali è disponibile nelle note della patch.",
  "patch738_heroes_title": "Modifiche agli Eroi",
  "patch738_qol_title": "Miglioramenti alla qualità generale",
  "patch738_qol_introduction": "Tuffati in un oceano di modifiche e miglioramenti al gameplay e alle meccaniche.",
  "patch738_qol_feature_roshan_timer_title": "Timer di Roshan",
  "patch738_qol_feature_roshan_timer_description": "Passa con il mouse sul timer di Roshan accanto alla minimappa per sapere se il boss dei creep neutrali preferito da tutti sta ancora guardando l'erba che cresce da sotto in Underhollow o è già tornato in superficie.",
  "patch738_qol_feature_hud_timers_title": "Timer dell'interfaccia",
  "patch738_qol_feature_hud_timers_description": "Prima dovevi cercare su tutta la mappa per vedere tutti i vari timer di gioco di Dota Plus. Per fortuna, ora puoi semplicemente tenere premuto ALT per vedere lo stato dei timer nella parte superiore dello schermo, nel caso avessi bisogno di inviare un messaggio ai tuoi alleati per ricordare loro di fare <i>qualcosa di importante</i> prima che lo faccia il nemico.",
  "patch738_qol_feature_item_effects_title": "Aggiunti gli effetti di selezione degli oggetti",
  "patch738_qol_feature_item_effects_description": "Abbiamo aggiunto una serie di effetti visivi agli oggetti, da Cappa Luccicante a Loto Gemmato e molti altri, per comunicare meglio quale Eroe è la fonte degli effetti dell'oggetto.",
  "patch738_qol_feature_attributes_pips_title": "Visualizzazione di tutti gli attributi",
  "patch738_qol_feature_attributes_pips_description": "Scopri a prima vista quali attributi dell'albero dei talenti hai acquisito finora.",
  "patch738_qol_feature_markforsell_title": "Seleziona per vendere",
  "patch738_qol_feature_markforsell_description": "Imposta un oggetto da vendere immediatamente quando sei (da vivo) nella tua base o nel negozio segreto. Meglio ancora, il tuo corriere è già aggiornato sulle modifiche e riporterà gli oggetti selezionati alla fontana quando consegna un carico.",
  "patch738_qol_feature_backpack_grace_title": "Periodo di grazia dello zaino",
  "patch738_qol_feature_backpack_grace_description": "La consegna di un oggetto fondamentale nel bel mezzo di un combattimento a squadre dovrebbe essere un momento di trionfo decisivo, non un momento in cui la squadra muore un secondo prima che si azzeri il tempo di ricarica dello zaino. A questo fine ambizioso, ora puoi trascinare fuori dallo zaino gli oggetti appena acquisiti senza il periodo di ricarica di sei secondi e utilizzarli immediatamente.",
  "patch738_gameplayupdate_title": "Aggiornamento 7.38",
  "patch738_gameplayupdate_introduction": "Lasciati trasportare e goditi tutte le novità dell'aggiornamento qui sotto!",
  "patch738_qol_feature_item_effects_list_label": "Vedi la lista",
  "patch738_qol_feature_item_effects_list_col1": "Bastone della Forza<br>Cappa Luccicante<br>Loto Gemmato<br>Malignità dell'Orchidea<br>Lama della Diffusione<br>Spina Insanguinata<br>Scettro della Divinità di Eul<br>Dispersore<br> Falce di Vyse<br>Burrasca<br>Bottiglia<br>Loto Curativo<br>Alabarda del Cielo<br>Stemma Solare<br>Pavese<br>Picca Vorticosa",
  "patch738_qol_feature_item_effects_list_col2": "Balsamo Curativo<br>Tango<br>Chiarezza<br>Mango<br>Guardiano Osservatore<br>Guardiano Sentinella<br>Alchemist - Scettro di Aghanim<br>Frammento Lunare<br>Sfera di Linken<br>Elmo del Dominatore<br>Elmo del Sovrano<br>Amuleto dell'Ombra<br>Mjollnir"
}