// 2225.js

{
  "language": "vietnamese",
  "patch738_website_subheader": "Cập nhật phiên bản 7.38",
  "patch738_website_title": "Dòng nước lạc trôi",
  "patch738_website_introduction": "Chạy theo dòng nước để đến làn dễ nhanh hơn, kiến tạo vận mệnh bản thân với tính năng chế tác trang bị rừng và hòa mình vào hàng loạt thay đổi cũng như cải thiện mới.",
  "patch738_map_title": "Cải thiện thế giới với chút ẩm ướt",
  "patch738_map_introduction": "Con sông ngăn cách hai bờ chiến tuyến Dota từ lâu đâu chỉ là dòng nước trên bờ cát, nó đóng vai trò phân định làn ranh giữa phe Radiant và Dire. Nhưng sông mãi chả cam phận làm ranh giới, tức nước vỡ bờ mà tràn lên cao nguyên, định hình lại trận địa (và dòng chảy) của trận đấu.",
  "patch738_map_majorchanges_river_title": "Hạ lưu thượng đẳng",
  "patch738_map_majorchanges_river_description": "Những rạch nước trong rừng này không chỉ để nâng cấp cảnh quan. Chạy theo dòng nước sẽ cho bạn thêm tốc độ để đi tới làn dễ của mình, mà không làm chậm nếu bạn đi ngược dòng.",
  "patch738_map_majorchanges_roshan_title": "Tái định cư Roshan",
  "patch738_map_majorchanges_roshan_description": "Hai hang ổ Roshan được di dời lại về sông, với hộ khẩu mới gần hai rune tăng lực. Roshan sẽ xuất hiện ở hang phía nam khi bắt đầu trận, nhưng khi ánh sáng ban ngày quyết định thời điểm dời nhà, gã sẽ rảo bước trên quãng đường giữa hai hang, hất tung bất kỳ đơn vị nào dám ngáng đường.",
  "patch738_map_majorchanges_wisdom_title": "Để ý mấy điện thờ",
  "patch738_map_majorchanges_wisdom_description": "Rune tri thức đã khôn ra và biến thành Điện Tri Thức. Bạn vẫn có thể tự mình cuỗm kinh nghiệm cho bản thân và đồng minh, nhưng giờ đây thay vì phải cúi nhặt trên mặt đất như dân cày, bạn sẽ cần đứng ở điện để nhận XP. Cái khó? Là điện không hoạt động nếu có tướng địch trong đó với bạn. Cần phải riêng tư một chút thì bạn mới tiếp thu tri thức được.",
  "patch738_map_majorchanges_lotus_title": "Nước đục màu máu",
  "patch738_map_majorchanges_lotus_description": "Tương tự Điện Tri Thức, bạn giờ sẽ cần đứng bên trong Hồ Sen để nhặt sen của nó. Kẻ địch trong cùng khu vực sẽ khiến hồ không hoạt động, vậy nên nếu tắm hồ thì tắm một mình nhé.",
  "patch738_map_majorchanges_creeps_title": "Bước nhảy tiến hóa",
  "patch738_map_majorchanges_creeps_description": "Bãi quái cũng được làm mới trong bản cập nhật này, với những loài lưỡng cư tiến hóa từ Pollywog đến Boglet đến Croaker xuyên suốt trận đấu.",
  "patch738_map_majorchanges_otherchanges": "Địa hình đổi thay",
  "patch738_map_majorchanges_moreinfo": "Toàn bộ thay đổi bản đồ sẽ có trong ghi chú cập nhật.",
  "patch738_map_majorchanges_tormentor_title": "Khổ Hình mờ ảo",
  "patch738_map_majorchanges_tormentor_description": "Khổ Hình không còn hiển thị tại căn cứ của mỗi đội. Thay vào đó một Khổ Hình duy nhất sẽ xuất hiện tại một trong hai nơi nằm tại góc bản đồ, tùy vào thời điểm trong ngày—cũng có nghĩa Khổ Hình sẽ luôn hiện đối nghịch với phía Roshan. Cùng với nhiều điều chỉnh khác, Khổ Hình giờ cũng có kỹ năng mới sẽ để lại khu vực hồi phục hữu dụng sau khi chết.",
  "patch738_neutrals_title": "Sóng cả vững tay chèo",
  "patch738_neutrals_introduction": "Giới thiệu Madstone, một tài nguyên mới cho phép bạn chế tác trang bị độc đáo theo phong cách chơi và hoàn cảnh của trận đấu.",
  "patch738_neutrals_lumber_title": "Cày Madstone",
  "patch738_neutrals_lumber_description": "Bước đầu tiên để tùy biến trang bị rừng là dọn sạch hoàn toàn bãi quái rừng. Làm thế sẽ cho bạn Madstone—hai cho bản thân và một cho một đồng minh ngẫu nhiên.",
  "patch738_neutrals_crafting_title": "Báu vật và bùa chú",
  "patch738_neutrals_crafting_description": "Bước hai: Để dành Madstone và chế tác trang bị rừng theo sở thích cá nhân. Mỗi trang bị rừng giờ bao gồm hai phần—một báu vật mang đến kỹ năng mới cho trang bị, và bùa chú để nhận thêm chỉ số nội tại/thuộc tính.",
  "patch738_neutrals_timings_title": "Xem ai chế món gì",
  "patch738_neutrals_timings_description": "Có năm bậc báu vật và bùa chú xuất hiện tại những khung thời gian riêng biệt xuyên suốt trận đấu. Xem tiến độ chế tác của đội và giúp dọn dẹp bãi quái để chia sẻ phú quý.",
  "patch738_neutrals_tab_title": "Trang bị rừng chỉ qua một cái nhìn",
  "patch738_neutrals_tab_description": "Duyệt xem tất cả kết hợp giữa báu vật và bùa chú tại thẻ Quái rừng mới trong trận đấu. Khán giả có thể dễ dàng xem lịch sử chế tác của mỗi tướng.",
  "patch738_neutrals_changes_moreinfo": "Toàn bộ thay đổi cho trang bị rừng sẽ có trong ghi chú cập nhật.",
  "patch738_heroes_title": "Cập nhật tướng",
  "patch738_qol_title": "Cải tiến chất lượng",
  "patch738_qol_introduction": "Lặn vào đại dương của những thay đổi và cải thiện cho lối chơi và cơ chế.",
  "patch738_qol_feature_roshan_timer_title": "Đồng hồ Roshan",
  "patch738_qol_feature_roshan_timer_description": "Di chuột qua đồng hồ Roshan bên cạnh bản đồ nhỏ sẽ có thêm gợi ý xem đại ca này đang bận bán hoa quả tại bàn thờ Underhollow hay đã trở về cõi trên làm phô mai.",
  "patch738_qol_feature_hud_timers_title": "Giao diện đồng hồ",
  "patch738_qol_feature_hud_timers_description": "Bạn trước đây phải tìm toàn bản đồ để xem nhiều đồng hồ Dota Plus khác nhau. May thay, bạn giờ chỉ cần giữ ALT để xem trạng thái các đồng hồ đó trên đầu màn hình—trong trường hợp cần ping thời điểm cho đồng đội để nhắc họ <i>làm gì đó quan trọng</i> trước kẻ địch.",
  "patch738_qol_feature_item_effects_title": "Thêm hiệu ứng chọn mục tiêu cho vật phẩm",
  "patch738_qol_feature_item_effects_description": "Chúng tôi đã thêm một loạt các hiệu ứng hình ảnh cho vật phẩm—từ Glimmer Cape đến Lotus Orb và nhiều hơn thế nữa—nhằm giúp truyền đạt tốt hơn việc hiệu ứng vật phẩm đến từ tướng nào.",
  "patch738_qol_feature_attributes_pips_title": "Hiện tất cả thuộc tính",
  "patch738_qol_feature_attributes_pips_description": "Dễ dàng nhận biết ngay bạn đã nâng thuộc tính nào trên cây tiềm năng.",
  "patch738_qol_feature_markforsell_title": "Đánh dấu bán",
  "patch738_qol_feature_markforsell_description": "Đặt một vật phẩm vào trạng thái bán ngay khi bạn (còn sống) ở trong căn cứ hoặc tại cửa hàng ẩn. Hơn thế nữa, thú vận chuyển của bạn đã được đào tạo cho thay đổi này để lấy đồ được đánh dấu về hồ máu khi giao hàng.",
  "patch738_qol_feature_backpack_grace_title": "Thời gian ân hạn cho ba lô",
  "patch738_qol_feature_backpack_grace_description": "Giao đồ quan trọng khi đang giao tranh nên là khoảnh khắc vinh quang lật ngược thế cờ, chứ không phải lúng túng nhìn cả đội bị làm gỏi một giây trước khi hết thời gian hồi vật phẩm từ ba lô. Để đạt được cảm giác vinh quang tiềm tàng đó, giờ bạn có thể kéo ngay đồ vừa mới nhận khỏi ba lô mà không phải chờ sáu giây mới dùng được chúng.",
  "patch738_gameplayupdate_title": "Ghi chú cập nhật 7.38",
  "patch738_gameplayupdate_introduction": "Thả mình và vẫy vùng trong dòng nước của những đổi thay và cập nhật bên dưới!",
  "patch738_qol_feature_item_effects_list_label": "Xem danh sách",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Heaven's Halberd<br>Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Agh's Scepter<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}