// 795.js

{
  "language": "norwegian",
  "patch738_website_subheader": "Spilloppdatering 7.38",
  "patch738_website_title": "Vandrende vann",
  "patch738_website_introduction": "Løp med strømmen for å komme raskere ut i stien, lag dine egne nøytrale gjenstander og dykk ned i en flom av nye endringer og forbedringer.",
  "patch738_map_title": "En bedre, våtere verden",
  "patch738_map_introduction": "Dotas elveløp har alltid vært noe mer enn bare en vassen strek i sanden, som skiller de stridende fraksjonene Radiant og Dire. Men elven har endelig gått over breddene sine, flommet opp i høyden og omformet slagmarken.",
  "patch738_map_majorchanges_river_title": "Oppsiden med nedstrøms",
  "patch738_map_majorchanges_river_description": "Alle disse nye elveløpene i jungelen er ikke bare en oppgradering til landskapet. Å løpe med strømmen gir deg fart mot den trygge stien, uten å sakke deg hvis du løper mot strømmen.",
  "patch738_map_majorchanges_roshan_title": "Roshans nye hjem",
  "patch738_map_majorchanges_roshan_description": "Roshans to groper er blitt flyttet til elven, med to nye hi nær de to kraftrunene. Roshan dukker opp i den sørlige gropen i begynnelsen av kampen, men når dagslyset tar kvelden, tar han turen til den andre gropen, og kaster unna alle og enhver som står i veien.",
  "patch738_map_majorchanges_wisdom_title": "Gå til alters",
  "patch738_map_majorchanges_wisdom_description": "Visdomsruner er blitt flyttet og erstattet med visdomsaltere. Du kan fremdeles sikre deg og en alliert erfaring, men i stedet for å plukke opp en rune på bakken, må du nå stå ved alteret for å få erfaring. Haken? Alteret aktiveres ikke hvis det er en fiendtlig helt der inne med deg. Du må være i enerom for å få velsignelsen.",
  "patch738_map_majorchanges_lotus_title": "Blod i vannet",
  "patch738_map_majorchanges_lotus_description": "Som med visdomsalter må du nå stå inne i et lotusvann for å plukke opp lotuser. Fiender i området hindrer vannet fra å aktiveres, så sørg for at du svømmer alene.",
  "patch738_map_majorchanges_creeps_title": "Et evolusjonsmessig sprang",
  "patch738_map_majorchanges_creeps_description": "Krypleirene blir også frisket opp i vandrende vann, i form av en ny amfibisk kryptype som utvikles fra Pollywog til Boglet til Croaker i løpet av kampen.",
  "patch738_map_majorchanges_otherchanges": "Det skiftende terrenget",
  "patch738_map_majorchanges_moreinfo": "Du finner en fullstendig liste over kartendringer i endringsloggen.",
  "patch738_map_majorchanges_tormentor_title": "Forgjengelig plageånd",
  "patch738_map_majorchanges_tormentor_description": "Plageånder dukker ikke lenger opp nær hvert lags base. I stedet dukker én enkelt plageånd opp på én av to steder i hjørnene på kartet, avhengig av tiden på dagen – som også betyr at den dukker opp på motsatt side av Roshan. Blant en haug med andre endringer, har plageånden også fått en ny evne som etterlater seg et nyttig helbredende område etter at den dør.",
  "patch738_neutrals_title": "Styr kraftens strømmer",
  "patch738_neutrals_introduction": "Vi presenterer morskestein – en ny ressurs som lar deg lage nøytrale gjenstander som er unike for spillestilen din og kampens omstendigheter.",
  "patch738_neutrals_lumber_title": "Høste morskestein",
  "patch738_neutrals_lumber_description": "Det første trinnet mot å få nøytrale gjenstander er å fullstendig tømme en krypleir. Dette gir deg nå morskestein – to til deg selv og én til en tilfeldig alliert.",
  "patch738_neutrals_crafting_title": "Artefakter og fortryllelser",
  "patch738_neutrals_crafting_description": "Trinn to: Spar opp nok morskesteiner til å lage egne nøytrale gjenstander. Hver gjenstand består nå av to deler – en artefakt som gir gjenstanden nye evner, og en fortryllelse som gir den passive egenskaper/attributter.",
  "patch738_neutrals_timings_title": "Se hvem som lager hva",
  "patch738_neutrals_timings_description": "Det er fem kategorier med mulige artefakter og fortryllelser i bestemte tidsvinduer gjennom kampen. Sjekk lagets fremdrift og hjelp med å tømme leirer for å spre rikdommen.",
  "patch738_neutrals_tab_title": "Nøytral ved første øyekast",
  "patch738_neutrals_tab_description": "Bla gjennom alle kombinasjoner av artefakter og fortryllelser i den oppdaterte fanen i spillet. Tilskuere kan enkelt se hver helts håndverkshistorikk.",
  "patch738_neutrals_changes_moreinfo": "Du finner en fullstendig liste over endringene til nøytrale gjenstander i endringsloggen.",
  "patch738_heroes_title": "Helter",
  "patch738_qol_title": "Kvalitetsforbedringer",
  "patch738_qol_introduction": "Dykk ned i et hav av justeringer og forbedringer til spillopplegget og spillmekanismer.",
  "patch738_qol_feature_roshan_timer_title": "Roshans tidtaker",
  "patch738_qol_feature_roshan_timer_description": "Hold over Roshans tidtaker ved siden av minikartet for et ekstra hint om hvorvidt alles favorittboss fortsatt ligger under torva i Underhulen eller kanskje allerede er tilbake på oversiden.",
  "patch738_qol_feature_hud_timers_title": "Tidtakere i grensesnittet",
  "patch738_qol_feature_hud_timers_description": "Du måtte lete over hele kartet for å se alle de ulike tidtakerne for Dota Plus i spillet. Heldigvis kan du nå bare holde ALT for å se statusen på disse tidtakerne øverst på skjermen – bare sånn i tilfelle du må plinge tiden for allierte for å minne dem på å gjøre <i>noe viktig</i> før fienden gjør det.",
  "patch738_qol_feature_item_effects_title": "Effekter ved bruk av gjenstander",
  "patch738_qol_feature_item_effects_description": "Vi har lagt til en rekke visuelle effekter for gjenstander – fra Glimmer Cape til Lotus Orb og mye mer – for å bedre kommunisere hvilken helt som er kilden til gjenstandens effekter.",
  "patch738_qol_feature_attributes_pips_title": "Visning for alle attributter",
  "patch738_qol_feature_attributes_pips_description": "Få en rask oversikt over hvilke attributter du har lært i talenttreet så langt.",
  "patch738_qol_feature_markforsell_title": "Marker for salg",
  "patch738_qol_feature_markforsell_description": "Angi at en gjenstand skal selges umiddelbart når du er (i live) i basen eller i den hemmelige butikken. Eller enda bedre, kurerer har allerede fått det med seg, og tar eventuelle markerte gjenstander tilbake til fontenen når den har levert en nyttelast. ",
  "patch738_qol_feature_backpack_grace_title": "I pose og sekk",
  "patch738_qol_feature_backpack_grace_description": "En livsviktig gjenstandslevering midt i en lagkamp bør være en seirende snuoperasjon, ikke et øyeblikk der du ser laget dø i løpet av et sekund før nedkjølingen til ryggsekken tilbakestilles. I den ambisiøse hensikt kan du nå dra nyervervede gjenstander ut av ryggsekken uten å vente seks sekunder, og dermed ta dem i bruk med det samme.",
  "patch738_gameplayupdate_title": "Endringslogg 7.38",
  "patch738_gameplayupdate_introduction": "La alle endringene i oppdateringen skylle over deg nedenfor!",
  "patch738_qol_feature_item_effects_list_label": "Se listen",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Agh's Scepter<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}