// 6187.js

{
  "language": "greek",
  "patch738_website_subheader": "ΕΝΗΜΕΡΩΣΗ ΠΑΙΧΝΙΔΙΟΥ 7.38",
  "patch738_website_title": "ΚΙΝΟΥΜΕΝΑ ΥΔΑΤΑ",
  "patch738_website_introduction": "Αφήστε το ρεύμα να σας παρασύρει για να φτάσετε στο ασφαλές μέτωπό σας ταχύτερα, σφυρηλατήστε το δικό σας πεπρωμένο με ουδέτερα αντικείμενα που κατασκευάζετε εσείς και βουτήξτε σε έναν χείμαρρο αλλαγών και βελτιώσεων.",
  "patch738_map_title": "ΕΝΑΣ ΚΑΛΥΤΕΡΟΣ, ΠΙΟ ΥΔΑΤΙΝΟΣ ΚΟΣΜΟΣ",
  "patch738_map_introduction": "Η υδάτινη οδός που χωρίζει τον χάρτη του Dota ήταν πάντοτε κάτι παραπάνω από ένα σύνορο νερού που διαχώριζε τις αντιμαχόμενες ομάδες των Radiant και των Dire. Αλλά το ποτάμι τελικά φούσκωσε και ξεχείλισε, πλημμυρίζοντας τα πάντα έως τα υψώματα και αναδιαμορφώνοντας το πεδίο (και τον ρου) της μάχης.",
  "patch738_map_majorchanges_river_title": "ΝΑ ΣΑΣ ΠΑΡΕΙ ΤΟ ΠΟΤΑΜΙ;",
  "patch738_map_majorchanges_river_description": "Όλες αυτές οι νέες υδάτινες οδοί στις ζούγκλες δεν αποτελούν απλώς αναβάθμιση του τοπίου. Όταν αφήνετε το ρεύμα να σας παρασύρει, θα έχετε ώθηση ταχύτητας προς το ασφαλές μέτωπό της δικής σας πλευράς, χωρίς επιβράδυνση της κίνησής σας αν πηγαίνετε αντίθετα στη ροή.",
  "patch738_map_majorchanges_roshan_title": "ΜΕΤΕΓΚΑΤΑΣΤΑΣΗ ΤΟΥ ROSHAN",
  "patch738_map_majorchanges_roshan_description": "Οι δύο λάκκοι του Roshan μεταφέρθηκαν στον ποταμό, με νέες φωλιές κοντά στους δύο ρούνους ισχύος. Ο Roshan θα αναβιώνει στον νότιο λάκκο στην αρχή του παιχνιδιού, αλλά όταν ξημερώνει και έρχεται η στιγμή να μετακινηθεί, θα διανύει τη συνολική απόσταση μεταξύ των δύο λάκκων, απωθώντας μονάδες που θα βρίσκονται στο διάβα του.",
  "patch738_map_majorchanges_wisdom_title": "ΤΟΝ ΝΟΥ ΣΑΣ ΣΤΟΥΣ ΒΩΜΟΥΣ",
  "patch738_map_majorchanges_wisdom_description": "Οι ρούνοι Wisdom μεταφέρθηκαν και αντικαταστάθηκαν από τους βωμούς Wisdom. Μπορείτε ακόμα να αποκτήσετε εμπειρία για εσάς και για έναν σύμμαχό σας, αλλά, τώρα, αντί να παίρνετε έναν ρούνο από το έδαφος, θα πρέπει να στέκεστε στον βωμό για να κερδίζετε την εμπειρία. Η παγίδα; Ο βωμός δεν θα ενεργοποιείται αν υπάρχει κάποιος εχθρικός ήρωας μαζί σας εκεί μέσα. Θα χρειαστεί λίγη μοναξιά για να τσεπώσετε την επαύξηση.",
  "patch738_map_majorchanges_lotus_title": "ΑΙΜΑ ΣΤΟ ΝΕΡΟ",
  "patch738_map_majorchanges_lotus_description": "Όπως και με τους βωμούς Wisdom, πλέον θα χρειάζεται να στέκεστε μέσα σε ένα σιντριβάνι λωτών για να συλλέξετε τους λωτούς του. Οι εχθροί εντός της περιοχής θα εμποδίσουν την ενεργοποίηση του σιντριβανιού, οπότε βεβαιωθείτε ότι κολυμπάτε μόνοι.",
  "patch738_map_majorchanges_creeps_title": "ΕΝΑ ΕΞΕΛΙΚΤΙΚΟ ΑΛΜΑ",
  "patch738_map_majorchanges_creeps_description": "Οι καταυλισμοί κριπακίων ανανεώνονται επίσης στα Κινούμενα Ύδατα, με τη μορφή ενός νέου τύπου αμφίβιου κριπακίου, που εξελίσσεται από γυρίνο σε τεράστιο βατράχι κατά τη διάρκεια του αγώνα.",
  "patch738_map_majorchanges_otherchanges": "ΤΟ ΜΕΤΑΒΑΛΛΟΜΕΝΟ ΠΕΔΙΟ ΜΑΧΗΣ",
  "patch738_map_majorchanges_moreinfo": "Ολόκληρη η λίστα με τις αλλαγές στον χάρτη είναι διαθέσιμη στις σημειώσεις ενημέρωσης.",
  "patch738_map_majorchanges_tormentor_title": "ΜΕΤΑΒΑΤΙΚΑ TORMENTOR",
  "patch738_map_majorchanges_tormentor_description": "Τα Tormentor δεν αναβιώνουν πια κοντά στη βάση κάθε ομάδας. Αντ' αυτού, θα αναβιώνει ένα Tormentor σε μία από τις δύο τοποθεσίες στις άκρες του χάρτη, ανάλογα με τη στιγμή της ημέρας και πάντα αντίθετα από την πλευρά του Roshan. Σε συνδυασμό με πολλές άλλες προσαρμογές, τα Tormentor έχουν επίσης μια νέα ικανότητα, που αφήνει πίσω μια χρήσιμη θεραπευτική περιοχή επίδρασης αφού καταστραφούν.",
  "patch738_neutrals_title": "ΚΑΤΕΥΘΥΝΕΤΕ ΤΑ ΡΕΥΜΑΤΑ ΙΣΧΥΟΣ",
  "patch738_neutrals_introduction": "Παρουσιάζουμε το Madstone, έναν νέο πόρο που σας επιτρέπει να κατασκευάζετε ουδέτερα αντικείμενα, προσαρμοσμένα στον τρόπο παιχνιδιού σας και τις συνθήκες του αγώνα.",
  "patch738_neutrals_lumber_title": "ΑΠΟΚΤΗΣΗ MADSTONE",
  "patch738_neutrals_lumber_description": "Το πρώτο βήμα για την απόκτηση προσαρμοσμένων ουδέτερων αντικειμένων είναι να εξολοθρεύσετε πλήρως έναν καταυλισμό ουδέτερων κριπακίων. Έτσι, θα κερδίσετε Madstone. Δύο για εσάς και ένα για έναν τυχαίο σύμμαχο.",
  "patch738_neutrals_crafting_title": "ΤΕΧΝΟΥΡΓΗΜΑΤΑ ΚΑΙ ΜΑΓΕΥΣΕΙΣ",
  "patch738_neutrals_crafting_description": "Βήμα δεύτερο: Συλλέξτε Madstone για να κατασκευάσετε εξατομικευμένα ουδέτερα αντικείμενα. Κάθε ουδέτερο αντικείμενο αποτελείται πλέον από δύο μέρη: ένα τεχνούργημα που δίνει στο αντικείμενό σας νέες ικανότητες και μία μάγευση που του δίνει παθητική επαύξηση στα στατιστικά και τα χαρακτηριστικά.",
  "patch738_neutrals_timings_title": "ΔΕΙΤΕ ΠΟΙΟΣ ΚΑΤΑΣΚΕΥΑΖΕΙ ΤΙ",
  "patch738_neutrals_timings_description": "Υπάρχουν πέντε βαθμίδες τεχνουργημάτων και μαγεύσεων που είναι διαθέσιμες σε διαφορετικές χρονικές περιόδους κατά τη διάρκεια του παιχνιδιού. Ρίξτε μια ματιά στην πρόοδο των κατασκευών της ομάδας σας και βοηθήστε στην εξολόθρευση των καταυλισμών για εξάπλωση του πλούτου.",
  "patch738_neutrals_tab_title": "ΟΥΔΕΤΕΡΑ ΑΝΤΙΚΕΙΜΕΝΑ ΜΕ ΜΙΑ ΜΑΤΙΑ",
  "patch738_neutrals_tab_description": "Ρίξτε μια ματιά σε όλους τους συνδυασμούς τεχνουργήματων και μαγεύσεων στην ενημερωμένη καρτέλα ουδέτερων αντικειμένων εντός παιχνιδιού. Οι θεατές μπορούν να δουν εύκολα το ιστορικό κατασκευών κάθε ήρωα.",
  "patch738_neutrals_changes_moreinfo": "Ολόκληρη η λίστα με τις αλλαγές στα ουδέτερα αντικείμενα είναι διαθέσιμη στις σημειώσεις ενημέρωσης.",
  "patch738_heroes_title": "ΕΝΗΜΕΡΩΣΕΙΣ ΗΡΩΩΝ",
  "patch738_qol_title": "ΒΕΛΤΙΩΣΕΙΣ ΠΟΙΟΤΗΤΑΣ ΖΩΗΣ",
  "patch738_qol_introduction": "Βουτήξτε σε έναν ωκεανό προσαρμογών και βελτιώσεων στον τρόπο παιχνιδιού και στις μηχανικές.",
  "patch738_qol_feature_roshan_timer_title": "ΤΟ ΧΡΟΝΟΜΕΤΡΟ ΤΟΥ ROSHAN",
  "patch738_qol_feature_roshan_timer_description": "Τοποθετήστε τον δείκτη του ποντικιού πάνω από το χρονόμετρο του Roshan, δίπλα από τον μίνι χάρτη, για να δείτε αν το αγαπημένο ουδέτερο αφεντικό εξακολουθεί να βλέπει τα μαντιοραδίκια ανάποδα στο Underhollow ή αν έχει γυρίσει στον πάνω κόσμο.",
  "patch738_qol_feature_hud_timers_title": "ΧΡΟΝΟΜΕΤΡΑ ΔΙΕΠΑΦΗΣ ΠΑΙΧΝΙΔΙΟΥ",
  "patch738_qol_feature_hud_timers_description": "Παλαιότερα, έπρεπε να κάνετε αναζήτηση σε ολόκληρο τον χάρτη για να δείτε τα διάφορα χρονόμετρα Dota Plus του παιχνιδιού. Ευτυχώς, πλέον μπορείτε απλώς να κρατάτε πατημένο το ALT για να δείτε την κατάσταση αυτών των χρονομέτρων στο πάνω μέρος της οθόνης σας. Ξέρετε εσείς... Απλώς σε περίπτωση που χρειαστεί να ειδοποιήσετε τους συμμάχους σας για την ώρα και να τους υπενθυμίσετε να κάνουν <i>κάτι σημαντικό</i>, πριν το κάνει ο εχθρός σας.",
  "patch738_qol_feature_item_effects_title": "ΠΡΟΣΤΕΘΗΚΑΝ ΕΦΕ ΣΤΟΧΕΥΣΗΣ ΑΝΤΙΚΕΙΜΕΝΩΝ",
  "patch738_qol_feature_item_effects_description": "Προσθέσαμε πληθώρα οπτικών εφέ αντικειμένων, από το Glimmer Cape μέχρι το Lotus Orb και πολλά ακόμα, για να βοηθήσουμε να γίνει πιο ξεκάθαρο ποιος ήρωας είναι η πηγή των επιδράσεων των αντικειμένων.",
  "patch738_qol_feature_attributes_pips_title": "ΠΡΟΒΟΛΗ ΟΛΩΝ ΤΩΝ ΧΑΡΑΚΤΗΡΙΣΤΙΚΩΝ",
  "patch738_qol_feature_attributes_pips_description": "Δείτε με μια ματιά ποια χαρακτηριστικά έχετε αναβαθμίσει μέχρι τώρα στο δέντρο ταλέντων.",
  "patch738_qol_feature_markforsell_title": "ΕΠΙΣΗΜΑΝΣΗ ΓΙΑ ΠΩΛΗΣΗ",
  "patch738_qol_feature_markforsell_description": "Μπορείτε να ορίσετε ένα αντικείμενο για άμεση πώληση όταν βρίσκεστε (ζωντανοί) στη βάση σας ή στο Μυστικό Μαγαζί. Το ακόμη καλύτερο είναι ότι ο μεταφορέας σας είναι ήδη ενημερωμένος για τις αλλαγές και θα επιστρέψει τυχόν επισημασμένα αντικείμενα πίσω στο σιντριβάνι όταν κάνει μια παράδοση.",
  "patch738_qol_feature_backpack_grace_title": "ΠΕΡΙΟΔΟΣ ΧΑΡΙΤΟΣ ΣΑΚΙΔΙΟΥ",
  "patch738_qol_feature_backpack_grace_description": "Μια κρίσιμη παράδοση αντικειμένου κατά τη διάρκεια μιας ομαδικής μάχης θα πρέπει να αποτελεί ανατρεπτική στιγμή θριάμβου, όχι στιγμή θανάτου της ομάδας σας ένα δευτερόλεπτο πριν λήξει η επαναφόρτιση σακιδίου. Για αυτόν τον φιλόδοξο σκοπό, μπορείτε πλέον να βγάλετε από το σακίδιό σας τα αντικείμενα που αποκτήσατε πρόσφατα, χωρίς την περίοδο επαναφόρτισης έξι δευτερολέπτων, και να τα χρησιμοποιήσετε αμέσως.",
  "patch738_gameplayupdate_title": "ΣΗΜΕΙΩΣΕΙΣ ΕΝΗΜΕΡΩΣΗΣ 7.38",
  "patch738_gameplayupdate_introduction": "Βουτήξτε και αφομοιώστε παρακάτω όλες τις αλλαγές στην ενημέρωση!",
  "patch738_qol_feature_item_effects_list_label": "Προβολή λίστας",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Sythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Agh's Scepter<br>Moonshard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}