// 7794.js

{
  "language": "swedish",
  "patch738_website_subheader": "Speluppdatering 7.38",
  "patch738_website_title": "Wandering Waters",
  "patch738_website_introduction": "Spring med strömmen för att komma till den säkra vägen snabbare, skapa ditt eget öde med tillverkningsbara neutrala föremål och dyk ner i en störtflod av nya ändringar och förbättringar.",
  "patch738_map_title": "En bättre, våtare värld",
  "patch738_map_introduction": "Dotas flod som delar kartan har alltid varit lite mer än bara ett vattnigt streck i sanden, som skiljer de stridande lagen Radient och Dire. Men floden har äntligen brutit sina vallar, svämmat över upp till de höga markerna och omformat stridsfältet (och stridsflödet).",
  "patch738_map_majorchanges_river_title": "Följ strömmen",
  "patch738_map_majorchanges_river_description": "Alla nya floder i djungeln är inte bara en uppgradering till landskapet. Om du springer med strömmen får du en hastighetsökning mot den säkra vägen, och du saktas inte ner om du springer mot strömmen.",
  "patch738_map_majorchanges_roshan_title": "Roshans nya hem",
  "patch738_map_majorchanges_roshan_description": "Roshans två gropar har flyttats till floden, med nya hålor i närheten av de två kraftrunorna. Roshan spawnar i den södra gropen när matchen startar, men när dagen gryr är det dags att börja förflytta sig, och han promenerar då mellan de två groparna och kastar runt alla enheter han möter längs vägen.",
  "patch738_map_majorchanges_wisdom_title": "Gå till altaret",
  "patch738_map_majorchanges_wisdom_description": "Visdomsrunor har flyttats och ersatts med Shrine of Wisdom. Det går fortfarande att få XP till dig själv och en allierad, men nu måste man stå i ett Shrine of Wisdom för att tjäna XP, istället för att som tidigare behöva plocka upp en visdomsruna från marken. Haken? Ett Shrine of Wisdom aktiveras inte om det finns en fiendehjälte där med dig. Du behöver lite avskildhet för att få välsignelsen.",
  "patch738_map_majorchanges_lotus_title": "Blod i vattnet",
  "patch738_map_majorchanges_lotus_description": "Som med Shrine of Wisdom måste du stå inuti en lotusdamm för att plocka en lotus. Fiender i området stoppar dammen från att aktiveras, så se till att du badar ensam.",
  "patch738_map_majorchanges_creeps_title": "Ett evolutionärt språng",
  "patch738_map_majorchanges_creeps_description": "Creepläger uppdateras också i Wandering Waters, i form av ett nytt amfibiskt sorts creep som under matchens lopp utvecklas från Pollywog till Boglet och slutligen till Croaker.",
  "patch738_map_majorchanges_otherchanges": "Den föränderliga terrängen",
  "patch738_map_majorchanges_moreinfo": "En fullständig lista över alla kartändringar finns i uppdateringsanteckningarna.",
  "patch738_map_majorchanges_tormentor_title": "Flyktig Tormentor",
  "patch738_map_majorchanges_tormentor_description": "Tormentors spawnar inte längre i närheten av varje lags bas. Istället spawnar en enda Tormentor på en av två platser i hörnen på kartan, beroende på tiden på dygnet, vilket också innebär att den alltid dyker upp på motsatt sida som Roshan. Bland en mängd andra justeringar har Tormentors också fått en ny förmåga som gör att de lämnar ett hjälpsamt helande effektområde efter sig när de dör.",
  "patch738_neutrals_title": "Styr maktens strömmar",
  "patch738_neutrals_introduction": "Vi presenterar Madstone, en ny resurs med vilken du kan tillverka neutrala föremål som är unika för din spelstil och matchens omständigheter.",
  "patch738_neutrals_lumber_title": "Farma Madstone",
  "patch738_neutrals_lumber_description": "Första steget till att få anpassade neutrala föremål är att helt rensa ett läger med neutrala creeps. Det ger dig Madstone: två till dig själv och en till en slumpmässig allierad.",
  "patch738_neutrals_crafting_title": "Artefakter och förtrollningar",
  "patch738_neutrals_crafting_description": "Steg två: Spara Madstone för att skapa personanpassade neutrala föremål. Varje neutralt föremål består nu av två delar: en artefakt som ger ditt föremål nya förmågor och en förtrollning som ger föremålet passiva egenskaper och attribut.",
  "patch738_neutrals_timings_title": "Se vem som tillverkar vad",
  "patch738_neutrals_timings_description": "Det finns fem nivåer av artefakter och förtrollningar tillgängliga vid specifika tidpunkter under matchen. Kolla in lagets tillverkningsframsteg och hjälp till med att rensa läger för att sprida rikedomen.",
  "patch738_neutrals_tab_title": "Neutrala föremål i korthet",
  "patch738_neutrals_tab_description": "Bläddra bland alla kombinationer av artefakter och förtrollningar på den uppdaterade fliken med neutrala föremål i spelet. Åskådare kan enkelt se varje hjältes tillverkningshistorik.",
  "patch738_neutrals_changes_moreinfo": "En fullständig lista över ändringar av neutrala föremål finns i uppdateringsanteckningarna.",
  "patch738_heroes_title": "Hjälteuppdateringar",
  "patch738_qol_title": "Kvalitetsförbättringar",
  "patch738_qol_introduction": "Dyk ner i ett hav av justeringar och förbättringar av gameplay och mekanik.",
  "patch738_qol_feature_roshan_timer_title": "Roshan-timer",
  "patch738_qol_feature_roshan_timer_description": "Hovra över Roshans timer bredvid minikartan för att få en extra ledtråd om huruvida allas favoritboss hos de neutrala creepen fortfarande är upptagen med spågräs i Underhollow eller om han kanske redan har återvänt till toppen.",
  "patch738_qol_feature_hud_timers_title": "HUD-timer",
  "patch738_qol_feature_hud_timers_description": "Man brukade tvingas leta över hela kartan för att hitta alla de olika Dota Plus-speltimerna. Lyckligtvis går det nu att helt enkelt bara hålla ner ALT för att se statusen för alla timer högst upp på skärmen – ifall du skulle behöva pinga tiden till dina allierade för att påminna dem om att göra <i>någonting viktigt</i> innan fienden gör det.",
  "patch738_qol_feature_item_effects_title": "Effekter vid användning av föremål",
  "patch738_qol_feature_item_effects_description": "Vi har lagt till en mängd visuella effekter – från Glimmer Cape till Lotus Orb och mycket mer – för att bättre förklara vilken hjälte som är källan till föremålets effekter.",
  "patch738_qol_feature_attributes_pips_title": "Visa alla attribut",
  "patch738_qol_feature_attributes_pips_description": "Se en överblick över vilka talangträdsattribut som du har lärt dig hittills.",
  "patch738_qol_feature_markforsell_title": "Markera för försäljning",
  "patch738_qol_feature_markforsell_description": "Ange att ett föremål omedelbart ska säljas när du är (vid liv) i basen eller den hemliga butiken. Det är ännu bättre om kuriren redan är uppdaterad om ändringarna och tar tillbaka alla markerade föremål till fontänen där den levererar en last.",
  "patch738_qol_feature_backpack_grace_title": "Tidsfrist för föremål i ryggsäcken",
  "patch738_qol_feature_backpack_grace_description": "En mycket viktig leverans av föremål mitt i en lagkamp bör vara ett ögonblick av spelavgörande triumf, inte ett ögonblick av att se laget dö en sekund innan ryggsäckens cooldown återställs. I det ambitiösa syftet går det nu att ta ut nyförvärvade föremål ur ryggsäcken utan en cooldownperiod på 6 sekunder och börja använda föremålen på en gång.",
  "patch738_gameplayupdate_title": "Speluppdatering 7.38",
  "patch738_gameplayupdate_introduction": "Låt alla ändringarna i uppdateringen nedan skölja in över dig!",
  "patch738_qol_feature_item_effects_list_label": "Se listan",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Agh's Scepter<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}