// 5926.js

{
  "language": "romanian",
  "patch738_website_subheader": "Actualizarea de joc 7.38",
  "patch738_website_title": "Apele rătăcitoare",
  "patch738_website_introduction": "Lasă-te purtat de curenți pentru a ajunge mai repede la culoarul tău sigur. Făurește-ți propriul destin creând obiecte neutre și descoperă un val de modificări și îmbunătățiri.",
  "patch738_map_title": "O lume mai bună și mai umedă",
  "patch738_map_introduction": "Timp de multă vreme, albia râului care străbate harta din Dota a fost doar o graniță care separa facțiunile războinice Radiant și Dire. Acest lucru s-a schimbat însă, deoarece râul și-a ieșit în sfârșit din matcă și a inundat dealurile, schimbând câmpul de luptă și cursul bătăliilor.",
  "patch738_map_majorchanges_river_title": "Avantajele curenților",
  "patch738_map_majorchanges_river_description": "Toate aceste râuri secundare noi din junglă nu doar că înfrumusețează peisajul: curenții râurilor îți vor mări viteza de mișcare pentru a ajunge mai repede la culoarul tău sigur, fără a fi încetinit dacă mergi împotriva curentului.",
  "patch738_map_majorchanges_roshan_title": "Relocarea lui Roshan",
  "patch738_map_majorchanges_roshan_description": "Cele două bârloguri ale lui Roshan au fost mutate pe râu, lângă cele două rune de putere. Roshan va apărea în bârlogul din sud la începutul meciului, iar, la finalul zilei, va parcurge la pas distanța totală dintre cele două bârloguri, azvârlind toate unitățile care-i stau în cale.",
  "patch738_map_majorchanges_wisdom_title": "Atenție la altare",
  "patch738_map_majorchanges_wisdom_description": "Runele de înțelepciune au fost mutate și înlocuite cu altare de înțelepciune. Poți obține în continuare puncte de experiență pentru tine și un aliat, dar acum, în loc să iei o rună de pe jos, va trebui să stai în altar pentru a obține punctele de experiență. Care este diferența? Altarul nu se va activa dacă un erou inamic se află acolo. Înțelepciunea nu se împarte cu inamicii.",
  "patch738_map_majorchanges_lotus_title": "Ape tulburi",
  "patch738_map_majorchanges_lotus_description": "Asemenea altarelor de înțelepciune, acum va trebui să intri într-un iaz cu lotuși pentru a putea lua lotușii. Dacă există inamici în apropiere, iazul nu se va activa, așa că asigura-te că nu ai companie.",
  "patch738_map_majorchanges_creeps_title": "Un salt evolutiv",
  "patch738_map_majorchanges_creeps_description": "„Apele rătăcitoare” aduc modificări și pentru taberele de creepi, în care vei găsi de acum și creepi amfibii, care evoluează pe parcursul meciului, luând diferite forme: Pollywog, Boglet și, în final, Croaker.",
  "patch738_map_majorchanges_otherchanges": "Terenul schimbător",
  "patch738_map_majorchanges_moreinfo": "O listă completă cu modificările aduse hărții este disponibilă în jurnalul actualizării.",
  "patch738_map_majorchanges_tormentor_title": "Oprimator tranzitoriu",
  "patch738_map_majorchanges_tormentor_description": "Oprimatoarele nu mai reapar lângă baza fiecărei echipe. În schimb, un singur oprimator va reapărea într-una din cele două locații din colțurile hărții, în funcție de momentul zilei. Asta înseamnă, totodată, că oprimatorul va apărea întotdeauna pe partea opusă lui Roshan. Printre numeroasele modificări, se numără și faptul că oprimatorul dispune acum de o nouă abilitate, care va oferi o zonă de efect de vindecare după ce este distrus.",
  "patch738_neutrals_title": "Dirijează curenții puterii",
  "patch738_neutrals_introduction": "Îți prezentăm pietrele nebuniei, o nouă resursă care îți permite să creezi obiecte neutre unice stilului tău de joc și circumstanțelor meciului.",
  "patch738_neutrals_lumber_title": "Obținerea pietrelor nebuniei",
  "patch738_neutrals_lumber_description": "Primul pas pentru a obține obiecte neutre personalizate este să anihilezi o tabără de creepi neutri, care îți oferă acum două pietre ale nebuniei pentru tine și una pentru un aliat aleatoriu.",
  "patch738_neutrals_crafting_title": "Artefacte și farmece",
  "patch738_neutrals_crafting_description": "Pasul doi: strânge pietre ale nebuniei pentru a crea obiecte neutre personalizate. Fiecare obiect neutru este acum format din două părți: un artefact care-i oferă obiectului tău abilități noi și un farmec care îi conferă bonusuri pasive de atribute.",
  "patch738_neutrals_timings_title": "Descoperă cine creează ce",
  "patch738_neutrals_timings_description": "Există cinci niveluri de artefacte și farmece disponibile în anumite perioade pe parcursul unui meci. Aruncă o privire la obiectele create de echipa ta și ajută la anihilarea taberelor de creepi pentru a împărți bogăția.",
  "patch738_neutrals_tab_title": "Toate obiectele neutre la un loc",
  "patch738_neutrals_tab_description": "Descoperă toate combinațiile de artefacte și farmece în fila actualizată „Obiecte neutre” din joc. Spectatorii pot vedea cu ușurință istoricul cu obiectele create al fiecărui erou.",
  "patch738_neutrals_changes_moreinfo": "O listă completă cu modificările aduse obiectelor neutre este disponibilă în jurnalul actualizării.",
  "patch738_heroes_title": "Modificări aduse eroilor",
  "patch738_qol_title": "Îmbunătățiri privind experiența de joc",
  "patch738_qol_introduction": "Descoperă un ocean de modificări și îmbunătățiri aduse jocului și mecanicilor de joc.",
  "patch738_qol_feature_roshan_timer_title": "Temporizator pentru Roshan",
  "patch738_qol_feature_roshan_timer_description": "Treci cu mouse-ul peste temporizatorul lui Roshan din dreptul minihărții pentru a afla dacă bossul neutru preferat al tuturor culege în continuare iarba divinației în Ascunzișurile Umbrite sau dacă s-a întors deja în bârlogul său.",
  "patch738_qol_feature_hud_timers_title": "Temporizatoare în interfață",
  "patch738_qol_feature_hud_timers_description": "Înainte erai nevoit să te uiți pe toată harta pentru a vedea toate temporizatoarele diferite oferite de Dota Plus. Din fericire, acum poți ține apăsată tasta ALT pentru a vedea starea acelor temporizatoare în partea de sus a ecranului tău. Dacă dorești, poți să-ți notifici aliații pentru a le reaminti să facă <i>ceva important</i> înaintea inamicilor.",
  "patch738_qol_feature_item_effects_title": "Efecte vizuale noi pentru obiectele cu țintire",
  "patch738_qol_feature_item_effects_description": "Am adăugat o serie de efecte vizuale pentru obiecte — de la Glimmer Cape la Lotus Orb și multe altele — pentru a comunica mai bine care erou este sursa efectelor obiectului.",
  "patch738_qol_feature_attributes_pips_title": "Afișarea tuturor talentelor",
  "patch738_qol_feature_attributes_pips_description": "Acum poți vedea imediat ce talente ai selectat din arborele de talente.",
  "patch738_qol_feature_markforsell_title": "Marchează pentru vânzare",
  "patch738_qol_feature_markforsell_description": "Marchează un obiect pentru a fi vândut imediat când ești (viu) în baza ta sau la magazinul secret. În plus, curierul tău este deja la curent cu modificările și va duce toate obiectele marcate pentru vânzare înapoi la fântână după ce a efectuat o livrare.",
  "patch738_qol_feature_backpack_grace_title": "Un rucsac mai puțin restrictiv",
  "patch738_qol_feature_backpack_grace_description": "O livrare crucială de obiecte în mijlocul unei lupte între echipe ar trebui să fie un moment de triumf în joc, și nu un moment în care îți vezi echipa murind pentru că trebuie să aștepți câteva secunde până poți utiliza obiectele pe care tocmai le-ai primit. Ca urmare, acum poți scoate din rucsac noile obiecte achiziționate și le poți utiliza imediat, fără a fi nevoit să aștepți șase secunde.",
  "patch738_gameplayupdate_title": "Jurnalul actualizării 7.38",
  "patch738_gameplayupdate_introduction": "Lasă-te purtat de curent și descoperă toate modificările din această actualizare mai jos!",
  "patch738_qol_feature_item_effects_list_label": "Vezi lista",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Agh's Scepter<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}