// 4353.js

{
  "language": "ukrainian",
  "patch738_website_subheader": "Ігроладне оновлення 7.38",
  "patch738_website_title": "В’юнкі води",
  "patch738_website_introduction": "Біжіть за течією струмків, щоби швидше дістатися своєї легкої лінії, викуйте власну долю завдяки новим нейтральним предметам, які виготовляються, а також зануртеся в повінь нових змін і покращень.",
  "patch738_map_title": "Який чудесний світ вологий",
  "patch738_map_introduction": "Водний шлях, що розділяє мапу Dota, завжди був не просто смугою води в піску — він розділяв дві ворогуючі сторони Сяйва та Пітьми. Та річка, зрештою, вийшла з берегів, затопивши височини та змінивши поле (і потік) бою.",
  "patch738_map_majorchanges_river_title": "Переваги руху за течією",
  "patch738_map_majorchanges_river_description": "Усі ці нові струмки в лісах є не просто оновленнями ландшафту; біг за течією дасть вам пришвидшення руху до своєї легкої лінії й до того ж не сповільнюватиме вас, коли ви побіжите проти течії.",
  "patch738_map_majorchanges_roshan_title": "Переїзд Рошана",
  "patch738_map_majorchanges_roshan_description": "Два лігва Рошана переміщено до річки, і тепер він мешкає поблизу двох рун підсилення. На початку матчу Рошан з’явиться в південному лігві, але зі зміною пори доби вирішить, що час прогулятися, і пройде всю відстань між двома лігвами, розкидуючи всіх, хто трапиться на його шляху.",
  "patch738_map_majorchanges_wisdom_title": "Пам’ятайте про святилища",
  "patch738_map_majorchanges_wisdom_description": "Руни мудрості було переміщено й замінено на святилища мудрості. Ви так само можете здобувати досвід для себе й союзника, але тепер замість підйому руни для отримання досвіду вам треба стати у святилище. Супитеся? Святилище не активується, якщо поруч із вами ворожий герой. Вам доведеться добитися приватності, щоби забрати нагороду.",
  "patch738_map_majorchanges_lotus_title": "Кров у воді",
  "patch738_map_majorchanges_lotus_description": "Як і у випадку святилищ мудрості, тепер вам потрібно стати всередину ставка лотоса, щоби забрати лотос. Вороги поруч не дадуть активуватися ставку, тож переконайтеся, що плаваєте наодинці.",
  "patch738_map_majorchanges_creeps_title": "Еволюційний стрибок",
  "patch738_map_majorchanges_creeps_description": "Табори кріпів також оновилися у В’юнких водах: з’явився новий тип кріпів-амфібій, що впродовж матчу розвивається від Пуголовка до Жабуна, а потім до Квакача.",
  "patch738_map_majorchanges_otherchanges": "Зміна ландшафту",
  "patch738_map_majorchanges_moreinfo": "Повний перелік змін на мапі міститься в нотатках про зміни.",
  "patch738_map_majorchanges_tormentor_title": "Перехідний мучитель",
  "patch738_map_majorchanges_tormentor_description": "Мучителі більше не з’являються біля бази кожної команди. Натомість є лише один мучитель, який з’явиться в одному з двох місць у кутках мапи залежно від часу доби. Він завжди перебуватиме на протилежному боці від Рошана. Окрім інших змін, мучитель також отримав нову здібність, яка після його смерті створює корисну лікувальну область.",
  "patch738_neutrals_title": "Керуйте потоками сили",
  "patch738_neutrals_introduction": "Представляємо лютит — новий ресурс, що дозволить вам виготовляти унікальні нейтральні предмети, що підходитимуть до вашого стилю гри та ситуації в матчі.",
  "patch738_neutrals_lumber_title": "Добування лютиту",
  "patch738_neutrals_lumber_description": "Перший крок до створення нестандартних нейтральних предметів полягає в повній зачистці табору нейтральних кріпів. Це дасть вам лютит — два шматочки для вас і один для випадкового союзника.",
  "patch738_neutrals_crafting_title": "Артефакти та зачарування",
  "patch738_neutrals_crafting_description": "Другий крок: зберігайте лютит для виготовлення персоналізованих нейтральних предметів. Кожен такий предмет тепер робиться із двох складових — артефакту, який дає предмету ефекти, та зачарування, яке дає пасивні показники чи характеристики.",
  "patch738_neutrals_timings_title": "Дивіться, хто що виготовляє",
  "patch738_neutrals_timings_description": "Існує п’ять ступенів артефактів і зачарувань, що доступні в певні часові вікна впродовж матчу. Перевіряйте перебіг виготовлення своєї команди й допомагайте зачищати табори, щоби збільшувати її багатство.",
  "patch738_neutrals_tab_title": "Огляд нейтральних предметів",
  "patch738_neutrals_tab_description": "Переглядайте всі комбінації артефактів і зачарувань в оновленій вкладці нейтральних предметів у грі. Глядачі можуть легко подивитися на історію виготовлень у кожного героя.",
  "patch738_neutrals_changes_moreinfo": "Повний перелік змін нейтральних предметів міститься в нотатках про зміни.",
  "patch738_heroes_title": "Зміни до героїв",
  "patch738_qol_title": "Приємні покращення",
  "patch738_qol_introduction": "Зануртеся в океан коригувань та покращень ігроладу та механік.",
  "patch738_qol_feature_roshan_timer_title": "Таймер Рошана",
  "patch738_qol_feature_roshan_timer_description": "Наведіть указівник на таймер Рошана біля міні-мапи, щоб отримати додаткову підказку про те, чи улюблений бос нейтральних кріпів досі милується квітами в попідзем’ї чи вже повернувся на поле бою.",
  "patch738_qol_feature_hud_timers_title": "Таймери в інтерфейсі",
  "patch738_qol_feature_hud_timers_description": "Раніше вам доводилося по всій мапі шукати різноманітні ігрові таймери, що доступні з Dota Plus. На щастя, тепер ви можете просто утримувати клавішу Alt, щоби побачити їхній стан у верхній частині екрана. Знаєте, це корисно на випадок, коли вам треба повідомити час союзникам, аби нагадати їм зробити <i>дещо важливе</i> до того, як це зроблять ваші вороги.",
  "patch738_qol_feature_item_effects_title": "Додано цільові ефекти від предметів",
  "patch738_qol_feature_item_effects_description": "Ми додали багато візуальних ефектів для предметів — від Мерехтливого плаща до Сфери лотоса. Вони допоможуть краще зрозуміти, який герой є джерелом ефектів від предмета.",
  "patch738_qol_feature_attributes_pips_title": "Показники характеристик",
  "patch738_qol_feature_attributes_pips_description": "Тепер ви одразу бачитимете, які характеристики з дерева талантів ви підвищили.",
  "patch738_qol_feature_markforsell_title": "Позначка для продажу",
  "patch738_qol_feature_markforsell_description": "Позначте предмет для миттєвого продажу, щойно ви будете (живими) на своїй базі чи біля таємної крамниці. Більш того, ваш кур’єр вже в курсі змін, тож поверне всі позначені предмети назад на фонтан, якщо вони в нього.",
  "patch738_qol_feature_backpack_grace_title": "Пільговий період рюкзака",
  "patch738_qol_feature_backpack_grace_description": "Доставка важливих предметів посеред бою має бути тріумфальним переворотом, а не спогляданням того, як ваша команда гине за секунду до завершення періоду неактивності предмета в рюкзаку. Тепер ви можете одразу перетягувати й використовувати щойно отримані предмети без шестисекундної затримки.",
  "patch738_gameplayupdate_title": "Нотатки про оновлення 7.38",
  "patch738_gameplayupdate_introduction": "Зануртеся й насолоджуйтеся всіма змінами цього оновлення нижче!",
  "patch738_qol_feature_item_effects_list_label": "Повний перелік",
  "patch738_qol_feature_item_effects_list_col1": "Посох примусу<br>Мерехтливий плащ<br>Сфера лотоса<br>Зловтіха орхідеї<br>Дифузійний клинок<br>Кривавий шип<br>Божественний скіпетр Еула<br>Розсіювач<br>Коса Вайза<br>Будитель вітрів<br>Пляшка<br>Цілющий лотос<br>Небесна алебарда<br>Сонячний герб<br>Павеза<br>Ураганна піка",
  "patch738_qol_feature_item_effects_list_col2": "Цілющий бальзам<br>Танґо<br>Прозоре зілля<br>Манго<br>Оглядовий вард<br>Вартовий вард<br>Скіпетр Аґаніма від Алхіміка<br>Місячний уламок<br>Сфера Лінкена<br>Шолом домінування<br>Шолом повелителя<br>Тіньовий амулет<br>Мйольнір"
}