// 1707.js

{
  "language": "thai",
  "patch738_website_subheader": "อัปเดตเกมเพลย์ 7.38",
  "patch738_website_title": "วารีไหลหลาก",
  "patch738_website_introduction": "วิ่งไปตามกระแสน้ำเพื่อไปถึงเซฟเลนของคุณ​ได้เร็วขึ้น กำหนดชะตากรรม​ของคุณเอง​ด้วยไอเท็มครีปป่า​ที่สามารถประดิษฐ์เองได้ และดำดิ่งสู่การเปลี่ยนแปลง​และการปรับปรุงใหม่ ๆ มากมาย",
  "patch738_map_title": "โลกที่ดีขึ้นและชุ่มฉ่ำขึ้น",
  "patch738_map_introduction": "สายน้ำที่คั่นกลางแผนที่ของ Dota นั้นเดิมทีเป็นเพียงแค่ผืนน้ำบนดินทราย ที่แบ่งแยกฝ่ายสงครามระหว่าง Radiant และ Dire แต่บัดนี้แม่น้ำได้เอ่อล้นตลิ่งแล้ว ท่วมขึ้นไปถึงพื้นที่สูง และส่งผลต่อการเปลี่ยนแปลงพื้นที่ (และกระแส) การรบ",
  "patch738_map_majorchanges_river_title": "ร่วมโหนกระแสน้ำ",
  "patch738_map_majorchanges_river_description": "สายน้ำใหม่ในป่าทั้งหมดไม่ได้เป็นเพียงแค่การอัปเกรดทัศนียภาพเท่านั้น การวิ่งไปตามกระแสน้ำ​จะช่วยเพิ่ม​ความเร็วในการเคลื่อนที่​ไปยังเซฟเลนของคุณ โดยจะไม่ทำให้คุณช้าลงเมื่อวิ่งทวนกระแส",
  "patch738_map_majorchanges_roshan_title": "Roshan ย้ายถิ่นฐาน",
  "patch738_map_majorchanges_roshan_description": "หลุมทั้งสองแห่งของ Roshan ถูกย้ายไปที่แม่น้ำ โดยมีที่อยู่ใหม่อยู่ใกล้กับรูนเสริมพลังทั้งสองจุด เมื่อเริ่มเกม Roshan จะเกิดในหลุมฝั่งทิศใต้ แต่เมื่อรอบเวลากลางวันมาถึง Roshan จะเริ่มการอพยพย้ายหลุม เขาจะเดินทางสลับไปมาระหว่างหลุมทั้งสองแห่ง ยูนิตทุกตัวที่ขวางหน้าเขาจะถูกจับโยนทิ้ง",
  "patch738_map_majorchanges_wisdom_title": "Shrine ใหม่ให้พร",
  "patch738_map_majorchanges_wisdom_description": "รูน Wisdom ถูกย้ายตำแหน่งและถูกแทนที่ด้วย Shrine of Wisdom คุณยังคงสามารถรับค่าประสบการณ์สำหรับตัวคุณเองและเพื่อนร่วมทีมได้เช่นเคย แต่ต่อจากนี้แทนที่จะเก็บรูนจากพื้น คุณจะต้องยืนอยู่ใน Shrine of Wisdom เพื่อรับ XP จุดที่น่าสนใจคือ Shrine of Wisdom จะไม่เปิดใช้งานหากมีฮีโร่ฝ่ายศัตรูอยู่ในนั้นด้วย คุณจะต้องแสวงหาความเป็นส่วนตัวเพื่อรับพรนี้",
  "patch738_map_majorchanges_lotus_title": "หลั่งโลหิต​ในลำน้ำ",
  "patch738_map_majorchanges_lotus_description": "เช่นเดียวกับ Shrine of Wisdom ต่อจากนี้คุณจะต้องยืนอยู่ใน Lotus Pool เพื่อเก็บ Healing Lotus หากมีศัตรูอยู่ในบริเวณนั้น​จะเป็นการขัดขวางไม่ให้ Lotus Pool ถูกเปิดใช้งาน ดังนั้นต้องแน่ใจก่อน​ว่าคุณอยู่ในน้ำ​ตามลำพัง",
  "patch738_map_majorchanges_creeps_title": "​​วิวัฒนาการก้าวกระโดด",
  "patch738_map_majorchanges_creeps_description": "แคมป์ครีปป่าก็ได้รับการเปลี่ยนแปลงจากวารีไหลหลากด้วยเช่นกัน โดยมาในรูปแบบของ​ครีปป่าชนิดใหม่​แบบสะเทินน้ำสะเทินบก ที่จะวิวัฒนาการจาก Pollywog เป็น Boglet และกลายเป็น Croaker ตามช่วงระยะเวลาในเกม",
  "patch738_map_majorchanges_otherchanges": "การเปลี่ยนแปลงสภาพภูมิประเทศ",
  "patch738_map_majorchanges_moreinfo": "ดูรายการเปลี่ยนแปลงแผนที่ทั้งหมดได้ในรายละเอียดแพตช์",
  "patch738_map_majorchanges_tormentor_title": "Tormentor ทีละตัว",
  "patch738_map_majorchanges_tormentor_description": "Tormentor จะไม่เกิดใกล้กับฐานของแต่ละทีมอีกต่อไป แต่ Tormentor จะย้ายไปเกิดที่ตำแหน่งตรงมุมของแผนที่ทั้งสองฝั่งเพียงครั้งละหนึ่งตัว ตามวัฏจักรของวัน — ซึ่งหมายความว่า Tormentor จะปรากฏตัวที่ฝั่งตรงกันข้ามกับ Roshan เสมอ ในบรรดาการปรับเปลี่ยนมากมาย Tormentor ยังได้รับสกิลใหม่ซึ่งจะช่วยสร้างพื้นที่การรักษาหลังจากที่มันถูกสังหาร",
  "patch738_neutrals_title": "กำหนดกระแสพลัง",
  "patch738_neutrals_introduction": "ขอแนะนำ \"แมดสโตน\" ทรัพยากรใหม่ที่ช่วยให้คุณสามารถประดิษฐ์ไอเท็มครีปป่า​ที่เหมาะกับ​สไตล์การเล่นของคุณ ตามสถานการณ์ของเกม",
  "patch738_neutrals_lumber_title": "ตามล่าหา​แมดสโตน",
  "patch738_neutrals_lumber_description": "ขั้นตอนแรกในการได้รับไอเท็มครีปป่าแบบกำหนดเองคือการฆ่าครีปป่าทั้งแคมป์ ซึ่งต่อจากนี้จะทำให้คุณได้รับแมดสโตน — สองชิ้นให้ตัวคุณเอง และหนึ่งชิ้นให้เพื่อนร่วมทีมสุ่มหนึ่งคน",
  "patch738_neutrals_crafting_title": "อาร์ติแฟกต์​และ​เวทผสาน",
  "patch738_neutrals_crafting_description": "ขั้นตอนที่สอง: รวบรวมแมดสโตน​เพื่อสร้าง​ไอเท็มครีปป่า​ที่ปรับแต่งได้ตามต้องการ ต่อจากนี้ไอเท็มครีปป่าแต่ละชิ้นจะประกอบด้วยสองส่วน — \"เวทผสาน\" ที่มอบสถานะติดตัว/เพิ่มค่าสถานะ และ \"อาร์ติแฟกต์\" ที่มอบสกิลใหม่ให้กับไอเท็มของคุณ",
  "patch738_neutrals_timings_title": "ดูซิใครกำลังประดิษฐ์อะไร",
  "patch738_neutrals_timings_description": "อาร์ติแฟกต์และเวทผสานมีทั้งหมด 5 ระดับ ซึ่งจะปลดล็อกให้เลือกได้ตามช่วงระยะเวลาในเกม ตรวจสอบความคืบหน้าในการประดิษฐ์ไอเท็มครีปป่าของทีมคุณ และช่วยกวาดล้างแคมป์ครีปป่าเพื่อแบ่งปันทรัพยากร",
  "patch738_neutrals_tab_title": "ดูไอเท็มครีปป่าได้ง่ายแค่ชายตามอง",
  "patch738_neutrals_tab_description": "เปิดดูรูปแบบการผสมผสานระหว่าง \"อาร์ติแฟกต์\" และ \"เวทผสาน\" ทั้งหมดได้ในแท็บไอเท็ม \"ครีปป่า\" ที่อัปเดตใหม่ในเกม ผู้ชมสามารถดูประวัติการประดิษฐ์ของทุกฮีโร่ได้อย่างง่ายดาย",
  "patch738_neutrals_changes_moreinfo": "ดูรายการเปลี่ยนแปลงไอเท็มครีปป่าทั้งหมดได้ในรายละเอียดแพตช์",
  "patch738_heroes_title": "อัปเดตฮีโร่",
  "patch738_qol_title": "การปรับปรุงเสริมความสะดวก",
  "patch738_qol_introduction": "ดำดิ่งลงสู่ห้วงแห่งการปรับเปลี่ยนและการพัฒนาเกมเพลย์และกลไกต่าง ๆ",
  "patch738_qol_feature_roshan_timer_title": "ตัวบอกเวลา Roshan",
  "patch738_qol_feature_roshan_timer_description": "ชี้เหนือตัวบอกเวลา Roshan ที่อยู่ข้างแผนที่ย่อเพื่อดูคำบอกใบ้เพิ่มเติมว่าบอสครีปป่าที่ทุกคนชื่นชอบ ยังคงแหวกพงหญ้าสกรายวีดในอันเดอร์ฮอลโลว์อยู่ หรือว่าอาจจะกลับขึ้นมาข้างบนแล้ว",
  "patch738_qol_feature_hud_timers_title": "HUD บอกเวลา",
  "patch738_qol_feature_hud_timers_description": "ก่อนหน้านี้คุณต้องมองหาตัวบอกเวลาของ Dota Plus ทั่วทั้งแผนที่ โชคดีที่ตอนนี้เพียงแค่คุณกดปุ่ม ALT ค้างไว้ก็จะเห็นสถานะของตัวบอกเวลาเหล่านั้นที่ด้านบนของหน้าจอ — ในกรณีที่คุณต้องการจะชี้เตือนเวลาให้เพื่อนร่วมทีมเพื่อบอกให้พวกเขาลงมือทำ<i>บางสิ่งที่สำคัญ</i> ก่อนที่ศัตรูจะทำ",
  "patch738_qol_feature_item_effects_title": "เพิ่มเอฟเฟกต์ไอเท็มกำหนดเป้าหมาย",
  "patch738_qol_feature_item_effects_description": "เราได้เพิ่มเอฟเฟกต์ของไอเท็มมากมาย — ตั้งแต่ Glimmer Cape ไปจนถึง Lotus Orb และอื่น ๆ อีกมากมาย — เพื่อช่วยสื่อสารให้ชัดเจนขึ้นว่าฮีโร่ตัวใดเป็นแหล่งที่มาของเอฟเฟกต์ไอเท็มนั้น",
  "patch738_qol_feature_attributes_pips_title": "แถบแสดงค่าสถานะทั้งหมด",
  "patch738_qol_feature_attributes_pips_description": "เห็นได้ในทันทีว่าคุณได้เพิ่มค่าสถานะทั้งหมดในผังต้นไม้ทักษะพิเศษไปมากแค่ไหนแล้ว",
  "patch738_qol_feature_markforsell_title": "ทำเครื่องหมายเพื่อขาย",
  "patch738_qol_feature_markforsell_description": "กำหนดการขายไอเท็มในทันทีเมื่อคุณ (มีชีวิต) อยู่ที่ฐานหรือร้านค้าลับ ยิ่งไปกว่านั้น Courier ของคุณก็ทราบถึงการเปลี่ยนแปลงเหล่านี้แล้ว และจะนำไอเท็มที่ถูกทำเครื่องหมายกลับไปที่บ่อน้ำพุเมื่อส่งของ",
  "patch738_qol_feature_backpack_grace_title": "เวลาผ่อนผันไอเท็มในกระเป๋า",
  "patch738_qol_feature_backpack_grace_description": "การส่งไอเท็มสำคัญระหว่างการต่อสู้เป็นทีมควรเป็นช่วงเวลาแห่งชัยชนะที่พลิกเกมได้ ไม่ใช่ช่วงเวลาที่ต้องทนมองดูทีมของคุณ​ตายไปต่อหน้าต่อตา​ก่อนที่​คูลดาวน์​ของไอเท็ม​จากกระเป๋า​จะนับเสร็จในอีก​หนึ่งวินาที เพื่อให้บรรลุเป้าหมายนี้ ต่อจากนี้​คุณจะสามารถ​ลากไอเท็ม​ที่เพิ่งได้มา​ออกจากกระเป๋า​โดยไม่ต้องรอ​คูลดาวน์​ 6 วินาที และนำไปใช้ได้ในทันที",
  "patch738_gameplayupdate_title": "รายละเอียดแพตช์ 7.38",
  "patch738_gameplayupdate_introduction": "ดำดิ่งและซึมซับการเปลี่ยนแปลงทั้งหมดในการอัปเดตด้านล่างนี้!",
  "patch738_qol_feature_item_effects_list_label": "ดูรายการ",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Aghanim's Scepter ของ Alchemist<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}