// 5995.js

{
  "language": "turkish",
  "patch738_website_subheader": "7.38 OYNANIŞ GÜNCELLEMESİ",
  "patch738_website_title": "GEZGİN SULAR",
  "patch738_website_introduction": "Güvenli kulvarınıza daha hızlı ulaşmak için akıntı yönünde koşun, işlenebilir tarafsız eşyalarla kendi kaderinizi çizin ve yeni değişiklikler ve iyileştirmelerle dolu sele kapılın.",
  "patch738_map_title": "DAHA İYİ, DAHA SULU BİR DÜNYA",
  "patch738_map_introduction": "Dota'nın haritayı bölen nehri, her zaman savaş hâlindeki Radiant ve Dire gruplarını ayıran bir su çizgisi olmaktan biraz daha fazlasıydı. Ancak nehir sonunda taşarak yüksek arazilere kadar ulaştı ve savaş alanını (ve akışını) yeniden şekillendirdi.",
  "patch738_map_majorchanges_river_title": "AKINTIYA KAPILMANIN AVANTAJI",
  "patch738_map_majorchanges_river_description": "Ormandaki tüm bu yeni su yolları sadece manzarayı güzelleştirmek için değil. Akıntı yönünde koşmak, güvenli kulvarınıza doğru giderken hızınızı artıracak. Ayrıca akıntıya karşı koşmak sizi yavaşlatmayacak.",
  "patch738_map_majorchanges_roshan_title": "ROSHAN'IN ÇUKURLARI TAŞINDI",
  "patch738_map_majorchanges_roshan_description": "Roshan'ın iki çukuru nehre, iki güç rününün yakınına taşındı. Roshan maçın başında güney çukurunda canlanacak ancak gün ışığıyla birlikte, iki çukur arasındaki mesafenin tamamını yürüyerek kat edecek ve yol boyunca karşılaştığı tüm birimleri havaya savuracak.",
  "patch738_map_majorchanges_wisdom_title": "MABETLERE DİKKAT",
  "patch738_map_majorchanges_wisdom_description": "Bilgelik rünleri bilgelik mabetleri ile değiştirildi haritadaki yerleri değiştirildi. Kendiniz ve bir dostunuz için hâlâ tecrübe kazanabilirsiniz ancak artık TP kazanmak için yerden bir rün koparmak yerine bir mabette durmanız gerekecek. İçinde sizinle birlikte bir düşman kahraman varsa mabedin etkinleşmeyeceğini unutmayın. Bu lütuftan faydalanabilmek için biraz yalnız kalmanız gerekecek.",
  "patch738_map_majorchanges_lotus_title": "KANLI SULAR",
  "patch738_map_majorchanges_lotus_description": "Bilgelik mabetlerinde olduğu gibi, artık nilüfer toplamak için bir nilüfer havuzunun içinde durmanız gerekecek. Alandaki düşmanlar havuzun etkinleşmesini engeller, bu yüzden tek başınıza yüzdüğünüzden emin olun.",
  "patch738_map_majorchanges_creeps_title": "Evrimsel Bir Gelişme",
  "patch738_map_majorchanges_creeps_description": "Gezgin Sular'da yaratık kampları da yenilendi; maç boyunca Pollywog'dan Boglet'e ve ardından Croaker'a dönüşen yeni bir amfibik yaratık türü eklendi.",
  "patch738_map_majorchanges_otherchanges": "ARAZİDEKİ DEĞİŞİM",
  "patch738_map_majorchanges_moreinfo": "Haritada yapılan değişikliklerin tam listesini yama notlarında bulabilirsiniz.",
  "patch738_map_majorchanges_tormentor_title": "Gezici İşkenceci",
  "patch738_map_majorchanges_tormentor_description": "İşkenceciler artık her takımın üssünün yakınında ortaya çıkmayacak. Bunun yerine, günün saatine bağlı olarak haritanın köşelerindeki iki konumdan birinde tek bir İşkenceci ortaya çıkacak. Bu aynı zamanda, İşkececi'nin her zaman Roshan'ın karşı tarafında ortaya çıkacağı anlamına geliyor. Diğer değişikliklerin yanı sıra, İşkenceci ayrıca öldükten sonra geride yararlı bir iyileştirme alanı bırakacak.",
  "patch738_neutrals_title": "GÜCÜN AKIŞINA YÖN VERİN",
  "patch738_neutrals_introduction": "Oyun tarzınıza ve maçın gidişatına özel tarafsız eşyalar üretmenizi sağlayan yeni bir kaynak olan Delitaş ile tanışın.",
  "patch738_neutrals_lumber_title": "DELİTAŞ TOPLAMAK",
  "patch738_neutrals_lumber_description": "Özel tarafsız eşyalar edinmenin ilk adımı, bir tarafsız yaratık kampını tamamen temizlemektir. Bu size Delitaş kazandırır; kendiniz için iki ve rastgele bir dost için bir adet.",
  "patch738_neutrals_crafting_title": "ESERLER VE BÜYÜLER",
  "patch738_neutrals_crafting_description": "Özel tarafsız eşyalar edinmenin ikinci adımı Delitaş biriktirmektir. Her tarafsız eşya artık iki parçadan oluşuyor; eşyanıza yeni yetenekler kazandıran bir eser ve ona pasif özellik bonusları veren bir büyü.",
  "patch738_neutrals_timings_title": "KİMİN NE ÜRETTİĞİNİ GÖRÜN",
  "patch738_neutrals_timings_description": "Beş farklı seviyede eser ve büyü vardır her seviye maç boyunca belirli zaman aralıklarıyla mevcut olur. Takımınızın eşya işleme ilerlemesini kontrol edin ve buna katkıda bulunmak için kampları temizleyin.",
  "patch738_neutrals_tab_title": "BİR BAKIŞTA TARAFSIZ EŞYALAR",
  "patch738_neutrals_tab_description": "Tüm eser ve büyü kombinasyonlarına oyun içindeki güncellenen Tarafsız Eşyalar sekmesinden göz atın. İzleyiciler her kahramanın işleme geçmişini kolayca görebilir.",
  "patch738_neutrals_changes_moreinfo": "Tarafsız eşyalarda yapılan değişikliklerin tam listesini yama notlarında bulabilirsiniz.",
  "patch738_heroes_title": "KAHRAMAN GÜNCELLEMELERİ",
  "patch738_qol_title": "OYNANIŞ İYİLEŞTİRMELERİ",
  "patch738_qol_introduction": "Oynanış ve mekaniklerde yapılan ayarlamalar ve iyileştirmeler deryasına dalın.",
  "patch738_qol_feature_roshan_timer_title": "Roshan Zamanlayıcısı",
  "patch738_qol_feature_roshan_timer_description": "Herkesin favori tarafsız yaratığı Roshan'ın hâlâ Derin Çukur'a kehanet otu taşıdığını veya çoktan yukarıya çıkmış olabileceğini gösteren ekstra bir ipucu için mini haritanın yanındaki Roshan zamanlayıcısının üzerine gelin.",
  "patch738_qol_feature_hud_timers_title": "GÖSTERGE ZAMANLAYICILARI",
  "patch738_qol_feature_hud_timers_description": "Önceden çeşitli Dota Plus oyun zamanlayıcılarını görmek için haritanın her yerini aramanız gerekiyordu. Neyse ki artık ekranınızın en üstündeki zamanlayıcıları görmek için ALT tuşuna basmanız yeterli. Buna ihtiyacınız olabilir çünkü dostlarınıza düşmanlardan önce davranmaları gerektiğini hatırlatmanız gerekebilir.",
  "patch738_qol_feature_item_effects_title": "Eşya Hedefleme Efektleri Eklendi",
  "patch738_qol_feature_item_effects_description": "Eşyaların etkilerinin hangi kahramandan kaynaklandığını daha iyi göstermek için Glimmer Cape'ten Lotus Orb'a kadar birçok eşyaya görsel efektler ekledik.",
  "patch738_qol_feature_attributes_pips_title": "TÜM ÖZELLİKLER GÖSTERİMİ",
  "patch738_qol_feature_attributes_pips_description": "Hangi hüner ağacı özelliklerini geliştirdiğinizi bir bakışta görün.",
  "patch738_qol_feature_markforsell_title": "SATIŞ İÇİN İŞARETLE",
  "patch738_qol_feature_markforsell_description": "Bir eşyayı üssünüzdeyken veya Gizli Dükkân'dayken (canlı olarak) hemen satılacak şekilde ayarlayın. Daha da iyisi, kuryeniz bu değişikliklerden zaten haberdar ve bir teslimat yaptığında işaretlediğiniz tüm eşyaları kaynağa geri götürecek.",
  "patch738_qol_feature_backpack_grace_title": "DAHA ANLAYIŞLI BİR SIRT ÇANTASI",
  "patch738_qol_feature_backpack_grace_description": "Bir takım savaşının ortasında yapılan kritik bir eşya teslimatı, sırt çantanızın dolum süresi tamamlanmadan bir saniye önce takımınızın ölmesini izlediğiniz bir ana dönüşmemelidir. Aksine, oyunun gidişatını değiştiren bir zafer anı olmalıdır. Bu amaçla, artık altı saniyelik dolum süresi olmadan yeni edindiğiniz eşyaları sırt çantanızdan çıkarabilir ve hemen kullanabilirsiniz.",
  "patch738_gameplayupdate_title": "7.38 Yama Notları",
  "patch738_gameplayupdate_introduction": "Güncellemedeki tüm değişiklikleri aşağıda bulabilirsiniz!",
  "patch738_qol_feature_item_effects_list_label": "LİSTEYİ GÖR",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Sythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Agh's Scepter<br>Moonshard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}