// 2419.js

{
  "language": "spanish",
  "patch738_website_subheader": "Actualización 7.38",
  "patch738_website_title": "Aguas Errantes",
  "patch738_website_introduction": "Desplázate por la corriente para llegar más rápido a tu senda segura, forja tu propio destino fabricando objetos neutrales y sumérgete en un diluvio de nuevos cambios y mejoras.",
  "patch738_map_title": "Un mapa mejor y con más agua",
  "patch738_map_introduction": "El río que dividía el mapa de Dota era poco más que un trazo mojado sobre la arena para separar las facciones en guerra de Radiant y Dire. Ahora el río se ha desbordado, inundando las zonas altas y cambiando la forma del campo de batalla y de su flujo.",
  "patch738_map_majorchanges_river_title": "Sigue la corriente",
  "patch738_map_majorchanges_river_description": "Todas las zonas con agua de la jungla son más que una mejora del paisaje. Al caminar en el sentido la corriente vas más rápido y llegas antes a tu senda segura, sin que ir a contracorriente te ralentice.",
  "patch738_map_majorchanges_roshan_title": "Reubicación de Roshan",
  "patch738_map_majorchanges_roshan_description": "Los dos fosos de Roshan ahora están en el río, cerca de las Runas de Poder. Roshan aparece en el foso inferior al inicio de la partida; pero con el cambio de luz del día, se pone en marcha y recorre el trecho entre los dos fosos mientras arroja por los aires a las unidades que se encuentre por el camino.",
  "patch738_map_majorchanges_wisdom_title": "Cuidado con los Santuarios",
  "patch738_map_majorchanges_wisdom_description": "Las Runas de Sabiduría se han cambiado de lugar y se han sustituido por Santuarios de Sabiduría. Todavía puedes obtener experiencia para ti y para un aliado, pero ahora en lugar de recoger una runa del suelo tendrás que pararte en el santuario para conseguir la EXP. El único problema es que el Santuario de Sabiduría no se activa si te acompaña un héroe enemigo. Vas a tener que hacer la operación en privado si quieres sacar tajada.",
  "patch738_map_majorchanges_lotus_title": "Sangre en el agua",
  "patch738_map_majorchanges_lotus_description": "Igual que en el caso de los Santuarios de Sabiduría, ahora tienes que quedarte dentro de la Fuente de Loto para recoger los lotos. Si hay enemigos cerca la fuente no entrega lotos, así que trata de evitar las malas compañías.",
  "patch738_map_majorchanges_creeps_title": "Un salto evolutivo",
  "patch738_map_majorchanges_creeps_description": "Los campamentos de creeps se han renovado en las Aguas Errantes, pues hay un nuevo tipo de creep anfibio que evoluciona a lo largo de la partida desde Renacuajo pasando por Ranita hasta llegar a Croador.",
  "patch738_map_majorchanges_otherchanges": "Cambios en el terreno",
  "patch738_map_majorchanges_moreinfo": "La notas del parche incluyen una lista completa de los cambios en el mapa.",
  "patch738_map_majorchanges_tormentor_title": "Torturador en tránsito",
  "patch738_map_majorchanges_tormentor_description": "Los Torturadores ya no reaparecen junto a la base del equipo. En su lugar, solo aparece uno en una de las dos esquinas del mapa dependiendo de la hora del día. Lo cual también significa que aparece en el lado contrario de Roshan. Entre otros cambios, el Torturador ahora tiene la nueva habilidad de dejar tras su muerte una útil curación de área de efecto.",
  "patch738_neutrals_title": "Domina las corrientes del poder",
  "patch738_neutrals_introduction": "Presentamos la neutralita, un nuevo recurso que te permite fabricar objetos neutrales únicos, adaptados a tu estilo de juego y a las circunstancias de la partida.",
  "patch738_neutrals_lumber_title": "Obtención de neutralita",
  "patch738_neutrals_lumber_description": "El primer paso para conseguir objetos neutrales personalizados es despejar un campamento de creeps neutrales. Al hacerlo consigues neutralita, dos para ti y una para un aliado al azar.",
  "patch738_neutrals_crafting_title": "Artefactos y encantamientos",
  "patch738_neutrals_crafting_description": "El segundo paso es ahorrar la neutralita para fabricar objetos neutrales personalizados. Ahora cada objeto neutral tiene dos componentes: un artefacto que otorga nuevas habilidades a tu objeto y un encantamiento que otorga bonificaciones pasivas de atributos o estadísticas.",
  "patch738_neutrals_timings_title": "Mira qué fabrican tus aliados",
  "patch738_neutrals_timings_description": "Hay cinco categorías de artefactos y encantamientos disponibles en distintas fases temporales durante la partida. Echa un vistazo al progreso de fabricación de tu equipo y ayuda a despejar los campamentos para distribuir riqueza.",
  "patch738_neutrals_tab_title": "Un vistazo a los neutrales",
  "patch738_neutrals_tab_description": "Explora todas las combinaciones de artefactos y encantamientos en la pestaña «Neutrales» actualizada dentro de la partida. Los espectadores pueden ver fácilmente el historial de fabricación de cada héroe.",
  "patch738_neutrals_changes_moreinfo": "La notas del parche incluyen una lista completa de los cambios en objetos neutrales.",
  "patch738_heroes_title": "Actualizaciones de héroes",
  "patch738_qol_title": "Calidad de vida",
  "patch738_qol_introduction": "Sumérgete en un océano de ajustes y mejoras de jugabilidad y mecánicas.",
  "patch738_qol_feature_roshan_timer_title": "Temporizador de Roshan",
  "patch738_qol_feature_roshan_timer_description": "Pasa el cursor sobre el temporizador de Roshan al lado del minimapa para obtener una pista adicional sobre nuestro jefe favorito de los creeps neutrales y ver si está fertilizando hierba vidente en la Subcaverna o si ya regresó a la parte superior.",
  "patch738_qol_feature_hud_timers_title": "Temporizadores del HUD",
  "patch738_qol_feature_hud_timers_description": "Solías tener que buscar por todo el mapa los distintos temporizadores de Dota Plus de la partida. Afortunadamente, ahora basta con pulsar ALT para ver el estado de esos temporizadores en la parte superior de la pantalla. Ya sabes, por si se te ocurre llamar la atención de tus aliados para recordarles que hay que hacer <i>algo importante</i>, antes de que lo haga tu enemigo.",
  "patch738_qol_feature_item_effects_title": "Añadidos efectos de los objetos",
  "patch738_qol_feature_item_effects_description": "Hemos añadido una serie de efectos visuales para objetos —desde la Capa Fulgurante al Orbe de Loto y muchos otros— para ayudar a comunicar de qué héroe surgen los efectos del objeto.",
  "patch738_qol_feature_attributes_pips_title": "Presentación de todos los atributos",
  "patch738_qol_feature_attributes_pips_description": "Ve con facilidad los atributos del Árbol de talentos que ya has incorporado.",
  "patch738_qol_feature_markforsell_title": "Marcar para vender",
  "patch738_qol_feature_markforsell_description": "Selecciona un objeto para que se venda inmediatamente cuando estés con vida en la base o en la Tienda Secreta. O mejor aún, como tu mensajero ya está al tanto de los cambios, llevará también los objetos marcados de vuelta a la fuente cuando te haga una entrega.",
  "patch738_qol_feature_backpack_grace_title": "Período de gracia de la mochila",
  "patch738_qol_feature_backpack_grace_description": "La entrega de un objeto crucial en medio de una pelea de equipo debería convertirse en el punto de inflexión hacia la victoria, no en el momento en el que tu equipo cae un segundo antes de que se restablezca el tiempo de recarga de tu mochila. Con ese objetivo, ahora puedes arrastrar los objetos recién adquiridos desde la mochila al inventario para usarlos inmediatamente sin tener que esperar los seis segundos de tiempo de recarga.",
  "patch738_gameplayupdate_title": "Notas del parche 7.38",
  "patch738_gameplayupdate_introduction": "¡Sumérgete y empápate con todos los cambios de la actualización que siguen!",
  "patch738_qol_feature_item_effects_list_label": "Ver lista",
  "patch738_qol_feature_item_effects_list_col1": "Bastón de la Fuerza<br>Capa Fulgurante<br>Orbe de Loto<br>Orquídea de Malevolencia<br>Hoja Difusora<br>Espina Sangrienta<br>Cetro de la Divinidad de Eul<br>Dispersora<br>Guadaña de Vyse<br>Despiertavientos<br>Botella<br>Loto Curativo<br>Alabarda Celestial<br>Blasón Solar<br>Pavés<br>Pica Huracán",
  "patch738_qol_feature_item_effects_list_col2": "Bálsamo Curativo<br>Tango<br>Claridad<br>Mango<br>Guardián Observador<br>Guardián Centinela<br>Cetro de Aghanim de Alchemist<br>Esquirla Lunar<br>Esfera de Linken<br>Yelmo del Dominador<br>Yelmo del Supremo<br>Amuleto de las Sombras<br>Mjollnir"
}