// 8539.js

{
  "language": "english",
  "patch738_website_subheader": "Gameplay Update 7.38",
  "patch738_website_title": "Wandering Waters",
  "patch738_website_introduction": "Run with the currents to get to your safe lane faster, forge your own destiny with craftable Neutral Items and dive into a deluge of new changes and improvements.",
  "patch738_map_title": "A Better, Wetter World",
  "patch738_map_introduction": "Dota's map-dividing waterway has always been little more than a watery line in the sand, separating the warring factions of Radiant and Dire. But the river has finally broken its banks, flooding up to the high grounds and reshaping the field (and flow) of battle.",
  "patch738_map_majorchanges_river_title": "The Upside of the Downstream",
  "patch738_map_majorchanges_river_description": "All these new waterways in the jungles aren't just an upgrade to the scenery. Running with the current will give you a speed boost towards your safe lane, without slowing you down if you're running against the flow.",
  "patch738_map_majorchanges_roshan_title": "Roshan's Relocation",
  "patch738_map_majorchanges_roshan_description": "Roshan’s two pits have been relocated to the river, with new lairs near the two Power Runes. Roshan will spawn into the southern pit at the start of the match, but when daylight decides it’s time to make a move, he’ll walk the total distance between the two pits, tossing around any units he meets along the way.",
  "patch738_map_majorchanges_wisdom_title": "Mind the Shrines",
  "patch738_map_majorchanges_wisdom_description": "Wisdom Runes have been relocated and replaced with Shrines of Wisdom. You can still snag experience for yourself and an ally, but now instead of plucking a rune off the ground, you'll need to stand in the shrine to earn the XP. The wrinkle? The shrine won't activate if there's an enemy hero in there with you. You'll have to earn a little privacy to bag the boon.",
  "patch738_map_majorchanges_lotus_title": "Blood in the Water",
  "patch738_map_majorchanges_lotus_description": "As with Wisdom Shrines, you'll now need to stand inside a Lotus Pool to collect its Lotus. Enemies in the area will stop the pool from activating, so make sure you're swimming alone.",
  "patch738_map_majorchanges_creeps_title": "An Evolutionary Leap",
  "patch738_map_majorchanges_creeps_description": "The creep camps are also getting refreshed in Wandering Waters, in the form of a new amphibious creep type that evolves from Pollywog to Boglet to Croaker throughout the match.",
  "patch738_map_majorchanges_otherchanges": "The Changing Terrain",
  "patch738_map_majorchanges_moreinfo": "A full list of map changes are available in the patch notes.",
  "patch738_map_majorchanges_tormentor_title": "Transient Tormentor",
  "patch738_map_majorchanges_tormentor_description": "Tormentors no longer spawn near each team's base. Instead, a single Tormentor will spawn at one of two locations in the corners of the map, depending on the time of day—which also means it'll always appear on the opposite side as Roshan. Amongst a bunch of other adjustments, the Tormentor's also got a new ability that will leave behind a helpful healing AoE after it dies.",
  "patch738_neutrals_title": "Steer the Currents of Power",
  "patch738_neutrals_introduction": "Introducing Madstone, a new resource that lets you craft Neutral Items unique to your playstyle and the circumstances of the match.",
  "patch738_neutrals_lumber_title": "Farming Madstone",
  "patch738_neutrals_lumber_description": "The first step to getting custom Neutral Items is fully clearing a Neutral Creep camp. This will now earn you Madstone—two for yourself and one for a random ally.",
  "patch738_neutrals_crafting_title": "Artifacts and Enchantments",
  "patch738_neutrals_crafting_description": "Step two: Save up Madstone to craft personalized Neutral Items. Each neutral is now made up of two parts—an Artifact that gives your item new abilities, and an Enchantment that gives it passive stat/attribute bonuses.",
  "patch738_neutrals_timings_title": "See Who's Crafting What",
  "patch738_neutrals_timings_description": "There are five tiers of Artifacts and Enchantments available at specific windows throughout a match. Check out your team's crafting progress and help clear out camps to spread the wealth.",
  "patch738_neutrals_tab_title": "Neutrals at a Glance",
  "patch738_neutrals_tab_description": "Browse every combination of Artifact and Enchantment in the updated Neutrals tab while in-game. Spectators can easily see every hero's crafting history.",
  "patch738_neutrals_changes_moreinfo": "A full list of Neutral Item changes are available in the patch notes.",
  "patch738_heroes_title": "Hero Updates",
  "patch738_qol_title": "Quality of Life",
  "patch738_qol_introduction": "Dive into an ocean of adjustments and improvements to gameplay and mechanics.",
  "patch738_qol_feature_roshan_timer_title": "Roshan Timer",
  "patch738_qol_feature_roshan_timer_description": "Hover over the Roshan timer next to the minimap for an extra hint on whether everyone's favorite Neutral Creep boss is still pushing up scryweed in the Underhollow or might have already returned topside.",
  "patch738_qol_feature_hud_timers_title": "HUD Timers",
  "patch738_qol_feature_hud_timers_description": "You used to have to search all over the map to see all the various Dota Plus game timers. Thankfully, you can now just hold ALT to see the status of those timers at the top of your screen—you know, just in case you need to ping the time to your allies to remind them to do <i>something important</i> before your enemy does.",
  "patch738_qol_feature_item_effects_title": "Added Item Targeting Effects",
  "patch738_qol_feature_item_effects_description": "We've added a host of item visual effects—from Glimmer Cape to Lotus Orb and much more—to help better communicate which hero is the source of the item's effects.",
  "patch738_qol_feature_attributes_pips_title": "All Attributes Display",
  "patch738_qol_feature_attributes_pips_description": "See at a glance which talent tree attributes you've skilled up so far.",
  "patch738_qol_feature_markforsell_title": "Mark For Sell",
  "patch738_qol_feature_markforsell_description": "Set an item to immediately be sold when you're (alive) in your base or at the Secret Shop. Better yet, your courier's already up to speed on the changes and will take any marked items back to the fountain when it delivers a payload.",
  "patch738_qol_feature_backpack_grace_title": "Backpack Grace Period",
  "patch738_qol_feature_backpack_grace_description": "A crucial item delivery in the midst of a teamfight should be a moment of game-turning triumph, not a moment of watching your team die one second before your backpack cooldown resets. To that aspirational end, you can now drag newly acquired items out of your backpack without the six-second cooldown period and put them to use immediately.",
  "patch738_gameplayupdate_title": "7.38 Patch notes",
  "patch738_gameplayupdate_introduction": "Sink in and soak up all of the changes in the update below!",
  "patch738_qol_feature_item_effects_list_label": "See list",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid <br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Sythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Agh's Scepter<br>Moonshard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir",
  "NoCommaStub": ""
}