// 8786.js

{
  "language": "bulgarian",
  "patch738_website_subheader": "Игрално обновление 7.38",
  "patch738_website_title": "Блуждаещи води",
  "patch738_website_introduction": "Носете се по теченията, за да стигнете по-бързо до безопасната Ви алея. Изковавайте Вашата собствена съдба с неутрални предмети, позволяващи изработване, и се потопете в пороя от нови промени и подобрения.",
  "patch738_map_title": "По-добър… по-мокър свят",
  "patch738_map_introduction": "Водният канал на Dota 2, разделящ картата, винаги е бил нещо повечко от водниста черта в пясъка, разделяща воюващите фракции на Radiant и Dire. Но реката най-сетне излезе от коритото си, наводнявайки до високата площ и преправяйки бойното поле (и потока) на битката.",
  "patch738_map_majorchanges_river_title": "Преимуществото на насрещното течение",
  "patch738_map_majorchanges_river_description": "Всички тези нови водни канали в джунглата не са просто подобрение на декора. Движението по течението ще Ви даде подсилване на скоростта към Вашата безопасна алея. Няма да Ви забавя, ако се движите срещу течението.",
  "patch738_map_majorchanges_roshan_title": "Преселването на Roshan",
  "patch738_map_majorchanges_roshan_description": "Двете ями на Roshan са преместени към реката, с нови леговища близо до двете подсилващи руни. Roshan ще се появява в южната яма при старта на мача, но когато дневната светлина реши, че е време да се предприеме ход, той ще измине цялото разстояние между двете ями, като подхвърля насам-натам всички единици, които срещне по пътя си.",
  "patch738_map_majorchanges_wisdom_title": "Обърнете внимание на олтарите",
  "patch738_map_majorchanges_wisdom_description": "Руните на мъдростта са преместени и подменени с олтари на мъдростта.Все още можете да се докопате до опит за себе си и даден съюзник. Но сега вместо да отскубнете руна от земята, ще е нужно да стоите в олтара, за да спечелите опит. Каква е уловката? Светилището няма да се активира, ако покрай Вас има вражески герой. Ще е нужно да си осигурите малко уединение, за да спипате благодатта.",
  "patch738_map_majorchanges_lotus_title": "Кръв във водата",
  "patch738_map_majorchanges_lotus_description": "Както и при олтарите на мъдростта, вече ще в нужно да стоите в лотосовия вир, за да вземете неговия лотос. Враговете в площта ще спрат активирането на вира, така че се уверете, че плувате сами.",
  "patch738_map_majorchanges_creeps_title": "Еволюционен скок",
  "patch738_map_majorchanges_creeps_description": "Лагерите на крийповете също биват опреснени в „Блуждаещи води“, под формата на нов тип амфибийни крийпове, който еволюира от Pollywog през Boglet до Croaker през целия мач.",
  "patch738_map_majorchanges_otherchanges": "Промяна на терена",
  "patch738_map_majorchanges_moreinfo": "Пълен списък с промените по картата е достъпен в съответната секция.",
  "patch738_map_majorchanges_tormentor_title": "Мимолетен мъчител",
  "patch738_map_majorchanges_tormentor_description": "Мъчителите вече не се появяват близо до базата на всеки отбор. Вместо това, един мъчител ще се появи на едно от двете места в ъглите на картата, в зависимост от времето на деня. Това също означава, че винаги ще се появява от противоположната страна като Roshan. Измежду куп други корекции, мъчителят има и нов умение, което ще оставя след себе си полезна лечебна площ на ефекта, след като умре.",
  "patch738_neutrals_title": "Напътствайте потока на мощта",
  "patch738_neutrals_introduction": "Представяме Ви Madstone! Нов ресурс, който Ви позволява да създавате неутрални предмети, уникални за Вашия игрален стил и обстоятелствата на мача.",
  "patch738_neutrals_lumber_title": "Фермене на Madstone",
  "patch738_neutrals_lumber_description": "Първата стъпка към сдобиване с персонализирани неутрални предмети е пълното разчистване на лагер на неутрални крийпове. Това вече ще Ви носи Madstone — два за Вас и един за произволен съюзник.",
  "patch738_neutrals_crafting_title": "Артефакти и очарования",
  "patch738_neutrals_crafting_description": "Втората стъпка е да съберете Madstone, за да изработите персонализирани неутрални предмети. Всеки такъв вече се състои от две части. Артефакт, който дава нови умения на Вашия предмет. И очарование, което му дава пасивни бонуси за статистика/атрибут.",
  "patch738_neutrals_timings_title": "Вижте кой какво изработва",
  "patch738_neutrals_timings_description": "Има пет поредици на артефакти и очарования, достъпни в специфични времеви прозорци по време на даден мач. Проверявайте напредъка на отбора си относно изработването и помагайте при разчистването на лагерите, за да разпределите благосъстоянието.",
  "patch738_neutrals_tab_title": "Неутралните предмети накратко",
  "patch738_neutrals_tab_description": "Разгледайте всяка комбинация от артефакт и очарования в обновения раздел „Неутрални“, докато сте в играта. Наблюдателите лесно могат да видят историята на изработванията за всеки герой.",
  "patch738_neutrals_changes_moreinfo": "Пълен списък с промените по неутралните артикули е достъпен в съответната секция.",
  "patch738_heroes_title": "Обновления на герои",
  "patch738_qol_title": "Подобрения на жизнения стандарт",
  "patch738_qol_introduction": "Гмурнете се в океан от корекции и подобрения на игралното преживяване и механиките.",
  "patch738_qol_feature_roshan_timer_title": "Брояч на Roshan",
  "patch738_qol_feature_roshan_timer_description": "Задръжте курсора на мишката върху брояча на Roshan до мини картата за допълнителна подсказка относно това дали любимият на всички бос на неутралните крийпове все още гушка букета от кристален плевел в Underhollow или е възможно вече да се е върнал на повърхността.",
  "patch738_qol_feature_hud_timers_title": "Броячи в проекционния дисплей",
  "patch738_qol_feature_hud_timers_description": "Преди трябваше да търсите из цялата карта, за да видите всички разнообразни Dota Plus игрални броячи. За щастие, вече можете просто да задържите ALT, за да видите статуса на тези таймери в горната част на екрана Ви. Нали се сещате само в случай, че е нужно да пингнете съюзниците си, за да им напомните да направят <i>нещо важно</i>, преди Вашият враг да го стори.",
  "patch738_qol_feature_item_effects_title": "Добавени ефекти за прицелване на предмети",
  "patch738_qol_feature_item_effects_description": "Добавихме множество визуални ефекти на предметите — от Glimmer Cape до Lotus Orb и още много други — така че да помогнем за по-доброто комуникиране на това кой герой е източникът на ефектите за предмета.",
  "patch738_qol_feature_attributes_pips_title": "Изобразяване на всички атрибути",
  "patch738_qol_feature_attributes_pips_description": "Виждайте, дори с бегъл поглед, на кои атрибути от дървото с талантите сте повишили способностите.",
  "patch738_qol_feature_markforsell_title": "Белязане за продан",
  "patch738_qol_feature_markforsell_description": "Задайте артикул, така че той да бъде незабавно продаден, когато сте (живи) в базата или в таен магазин. А дори още по-добре, Вашият куриер вече е в час що се отнася до промените и ще отнесе всички белязани предмети обратно във фонтана, когато достави полезен товар.",
  "patch738_qol_feature_backpack_grace_title": "Гратисен период за раницата",
  "patch738_qol_feature_backpack_grace_description": "Доставянето на решителен предмет в разгара на отборно сражение трябва да бъде момент на триумф, който ще преобърне играта. Не би трябвало да миг, в който да гледате как отборът Ви умира една секунда, преди да се нулира времето за изчакване на Вашата раница. С тази амбициозна цел наум вече можете да провлечете новопридобитите предмети от раницата си без шестсекундния времеви период за изчакване и да ги използвате незабавно.",
  "patch738_gameplayupdate_title": "Списък с промени 7.38",
  "patch738_gameplayupdate_introduction": "Потопете се и попийте всички промени в обновлението по-долу!",
  "patch738_qol_feature_item_effects_list_label": "Вижте списъка",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid <br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Sythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Agh's Scepter<br>Moonshard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}