// 6841.js

{
  "language": "brazilian",
  "patch738_website_subheader": "Atualização de jogabilidade 7.38",
  "patch738_website_title": "Águas Errantes",
  "patch738_website_introduction": "Aproveite a correnteza para chegar à sua trilha segura mais rapidamente, forje o seu próprio destino com a fabricação de itens neutros e mergulhe em uma enxurrada de novidades e aprimoramentos.",
  "patch738_map_title": "Um mundo melhor e molhado",
  "patch738_map_introduction": "O rio que divide o mapa do Dota nunca foi mais do que uma simples linha molhada no terreno, separando as facções rivais dos Iluminados e Temidos. Mas ele enfim transbordou, alagando os terrenos elevados e reformando o terreno (e fluxo) da batalha.",
  "patch738_map_majorchanges_river_title": "Seguindo o fluxo",
  "patch738_map_majorchanges_river_description": "Esses novos caminhos aquáticos nas florestas não são um mero aprimoramento cosmético. Andar no sentido da correnteza concederá velocidade de movimento adicional em direção à trilha segura, sem reduzir a velocidade na contracorrente.",
  "patch738_map_majorchanges_roshan_title": "Realocando Roshan",
  "patch738_map_majorchanges_roshan_description": "Os dois covis de Roshan foram reposicionados no rio, ambos próximos às Runas de Poder. Roshan renascerá no covil ao sul no início da partida, mas quando a luz do dia começar a minguar, ele caminhará pelo rio até o outro covil, empurrando para longe as unidades que atropelar no caminho.",
  "patch738_map_majorchanges_wisdom_title": "Santuários sencientes",
  "patch738_map_majorchanges_wisdom_description": "As Runas de Sabedoria foram reposicionadas e substituídas por Santuários da Sabedoria. Você ainda pode pegar experiência para si e para um aliado, mas agora, em vez de pegar uma runa no chão, você precisará ficar perto do santuário para obter a experiência. O pulo do gato? O santuário não será ativado caso haja um herói inimigo junto. Você precisará de um pouco de privacidade para se beneficiar.",
  "patch738_map_majorchanges_lotus_title": "Sangue na água",
  "patch738_map_majorchanges_lotus_description": "Assim como os Santuários da Sabedoria, você agora precisará ficar dentro das Fontes de Lótus para colher os lótus. Inimigos na área interromperão a ativação da fonte, então lembre-se de nadar sozinho.",
  "patch738_map_majorchanges_creeps_title": "Um salto evolucionário",
  "patch738_map_majorchanges_creeps_description": "Os acampamentos de criaturas também estão sendo repaginados nas Águas Errantes, na forma de um novo tipo de criatura anfíbia que começa como Girino e, ao longo da partida, evolui para Sapinho e, enfim, Sapão.",
  "patch738_map_majorchanges_otherchanges": "Alterações no terreno",
  "patch738_map_majorchanges_moreinfo": "A lista completa de alterações no mapa está disponível nos detalhes da atualização.",
  "patch738_map_majorchanges_tormentor_title": "Tormenta transiente",
  "patch738_map_majorchanges_tormentor_description": "As Tormentas não nascem mais perto da base de cada equipe. Em vez disso, uma única Tormenta nascerá em um dos dois locais nos cantos do mapa, dependendo do horário do dia — o que significa que ela sempre estará no lado oposto a Roshan. Em meio a vários outros ajustes, a Tormenta também recebeu uma nova habilidade que deixará para trás uma área curativa bem útil após morrer.",
  "patch738_neutrals_title": "Domine as correntes do poder",
  "patch738_neutrals_introduction": "Apresentando a insanite, um novo recurso que permite fabricar itens neutros específicos para o seu estilo de jogo e circunstâncias da partida.",
  "patch738_neutrals_lumber_title": "Obtendo insanite",
  "patch738_neutrals_lumber_description": "O primeiro passo para obter itens neutros personalizados é matar todas as criaturas de um acampamento neutro. Agora, isso concederá lascas de insanite — duas para você e uma para um aliado aleatório.",
  "patch738_neutrals_crafting_title": "Artefatos e encantamentos",
  "patch738_neutrals_crafting_description": "Segundo passo: junte insanite suficiente para fabricar itens neutros personalizados. Agora, cada item neutro é composto de duas partes — um artefato que concede habilidades e um encantamento que concede efeitos e atributos passivos.",
  "patch738_neutrals_timings_title": "Acompanhe as fabricações",
  "patch738_neutrals_timings_description": "Há cinco categorias de artefatos e encantamentos, liberados em momentos específicos ao longo da partida. Confira o progresso das fabricações da sua equipe e ajude a eliminar acampamentos para distribuir os recursos.",
  "patch738_neutrals_tab_title": "Neutros num piscar de olhos",
  "patch738_neutrals_tab_description": "Confira todas as combinações de artefatos e neutros na nova aba de neutros durante uma partida. Espectadores podem acompanhar facilmente o histórico de fabricações de cada herói.",
  "patch738_neutrals_changes_moreinfo": "A lista completa de alterações em itens neutros está disponível nos detalhes da atualização.",
  "patch738_heroes_title": "Atualizações de heróis",
  "patch738_qol_title": "Qualidade de vida",
  "patch738_qol_introduction": "Mergulhe em um oceano de ajustes e aprimoramentos para a jogabilidade e mecânicas.",
  "patch738_qol_feature_roshan_timer_title": "Cronômetro de Roshan",
  "patch738_qol_feature_roshan_timer_description": "Passe o mouse sobre o cronômetro de Roshan junto ao minimapa para saber se o chefão favorito de todos ainda está fertilizando ervidente no Coviterrâneo ou se já retornou para o seu próprio covil.",
  "patch738_qol_feature_hud_timers_title": "Interface de temporizadores",
  "patch738_qol_feature_hud_timers_description": "Você precisava procurar por todo o mapa para ver os diversos temporizadores do Dota+. Felizmente, agora basta segurar Alt para ver todos esses temporizadores na parte superior da sua tela — assim, você pode sinalizar o tempo para lembrar os seus aliados de fazerem <i>algo importante</i> antes dos seus inimigos.",
  "patch738_qol_feature_item_effects_title": "Efeitos de alvejamento de item",
  "patch738_qol_feature_item_effects_description": "Nós adicionamos vários efeitos visuais de itens — incluindo a Capa Cintilante, o Orbe de Lótus e muito mais — para melhor comunicar qual herói é a fonte dos efeitos do item.",
  "patch738_qol_feature_attributes_pips_title": "Exibição de todos os atributos",
  "patch738_qol_feature_attributes_pips_description": "Confira em um relance quantos atributos da árvore de talentos você já aprimorou.",
  "patch738_qol_feature_markforsell_title": "Vende-se!",
  "patch738_qol_feature_markforsell_description": "Marque um item para ser vendido imediatamente quando você chegar (com vida) na base ou na loja secreta. Melhor ainda, o seu entregador já está sabendo de tudo e levará os seus itens marcados de volta para a fonte ao fazer uma entrega.",
  "patch738_qol_feature_backpack_grace_title": "Mochila a jato",
  "patch738_qol_feature_backpack_grace_description": "Uma entrega de item crucial no meio de uma batalha deveria ser um triunfo para virar o jogo, e não um momento para assistir à sua equipe morrer um segundo antes de zerar o intervalo entre usos da sua mochila. Para ajudar nesses momentos, agora é possível arrastar itens recém-comprados para fora da sua mochila sem o intervalo de seis segundos e colocá-los em uso imediatamente.",
  "patch738_gameplayupdate_title": "Detalhes da atualização 7.38",
  "patch738_gameplayupdate_introduction": "Mergulhe nos detalhes de todas as alterações da atualização logo abaixo!",
  "patch738_qol_feature_item_effects_list_label": "Conferir lista",
  "patch738_qol_feature_item_effects_list_col1": "Cajado de Força<br>Capa Cintilante<br>Orbe de Lótus<br>Orquídea Malevolente<br>Lâmina Difusora<br>Espinho Sangrento<br>Cetro Divino de Eul<br>Dispersora<br>Foice de Vyse<br>Domador Eólico<br>Garrafa<br>Lótus Restaurador<br>Alabarda Celestial<br>Brasão Solar<br>Blindagem<br>Lança Furacão",
  "patch738_qol_feature_item_effects_list_col2": "Bálsamo de Cura<br>Tango<br>Poção de Clareza<br>Manga Encantada<br>Sentinela Reveladora<br>Sentinela Reveladora<br>Cetro de Aghanim do Alchemist<br>Fragmento Lunar<br>Esfera de Linken<br>Elmo do Dominador<br>Elmo do Soberano<br>Amuleto das Sombras<br>Mjollnir"
}