// 4606.js

{
  "language": "hungarian",
  "patch738_website_subheader": "7.38-as játékmenet-frissítés",
  "patch738_website_title": "Vándorló Vizek",
  "patch738_website_introduction": "Haladj az áramlatokkal, hogy gyorsabban elérd a biztonságos vonaladat, kovácsold saját sorsodat semleges tárgyak készítésével, és merülj el az új változtatások és fejlesztések áradatában.",
  "patch738_map_title": "Egy jobb, vizesebb világ",
  "patch738_map_introduction": "A Dota térképet elválasztó vízi útja alig volt több, mint egy vizes vonal a homokban, amely elválasztja az egymással hadakozó Radiant és Dire frakciót. De a folyó végre kilépett a medréből, elárasztotta a magaslatokat, és átformálta a csata terét (és folyását).",
  "patch738_map_majorchanges_river_title": "A sodrás előnye",
  "patch738_map_majorchanges_river_description": "Mindezek az új vízi utak a dzsungelekben nem csak a tájat szépítik. Az áramlattal haladás sebességbónuszt ad a biztonságos vonalad felé anélkül, hogy lelassítana, ha az áramlattal szemben haladsz.",
  "patch738_map_majorchanges_roshan_title": "Roshan átköltöztetése",
  "patch738_map_majorchanges_roshan_description": "Roshan két barlangja át lett helyezve a folyóhoz, a két Erőnövelő rúna közelében levő új búvóhelyekre. A meccs kezdetén Roshan a déli barlangban fog megjelenni, de amikor a nappal úgy dönt, hogy ideje menni, Roshan gyalog teszi meg a két barlang közötti teljes távolságot, elhajítva az útjába kerülő egységeket.",
  "patch738_map_majorchanges_wisdom_title": "Ügyelj az oltárokra",
  "patch738_map_majorchanges_wisdom_description": "A Bölcsesség rúnák át lettek helyezve, és Bölcsesség Oltáraira lettek cserélve. Továbbra is szerezhetsz tapasztalatot magadnak és egy szövetségesednek, de mostantól ahelyett, hogy egy rúnát vennél fel a földről, az Oltárban kell állnod a TP megszerzéséhez. A probléma? Az Oltár nem aktiválódik, ha ellenséges hős van veled odabent. Az áldás bezsebeléséhez szert kell tenned némi egyedüllétre.",
  "patch738_map_majorchanges_lotus_title": "Vér a vízben",
  "patch738_map_majorchanges_lotus_description": "A Bölcsesség Oltáraihoz hasonlóan mostantól a Lótuszmedencében kell állnod a lótusza begyűjtéséhez. A közelben lévő ellenségek megakadályozzák a medence aktiválódását, ezért ügyelj rá, hogy egyedül úszkálj.",
  "patch738_map_majorchanges_creeps_title": "Evolúciós ugrás",
  "patch738_map_majorchanges_creeps_description": "A creeptáborok is frissítve lettek a Vándorló Vizekben, egy új kétéltű creepfajta formájában, amely Pollywogból Bogleten át Croakerré fejlődik a meccs során.",
  "patch738_map_majorchanges_otherchanges": "Változó terep",
  "patch738_map_majorchanges_moreinfo": "A pályaváltozások teljes listája a frissítésjegyzékben található.",
  "patch738_map_majorchanges_tormentor_title": "Tünékeny Gyötrő",
  "patch738_map_majorchanges_tormentor_description": "A Gyötrők többé nem az egyes csapatok bázisa közelében jönnek létre. Ehelyett egyetlen Gyötrő fog megjelenni a térkép sarkaiban található két hely egyikén, napszaktól függően – ami azt is jelenti, hogy mindig a Roshannal ellenkező oldalon fog megjelenni. Egy csomó egyéb igazítás mellett a Gyötrő egy új képességet is kapott, amely hasznos gyógyító hatóterületet hagy maga után, miután meghal.",
  "patch738_neutrals_title": "Irányítsd az erő áramlatait",
  "patch738_neutrals_introduction": "Bemutatjuk az őrült követ, egy új nyersanyagot, amely lehetővé teszi a játékstílusodnak és a meccs körülményeinek megfelelő semleges tárgyak készítését.",
  "patch738_neutrals_lumber_title": "Őrült kő farmolás",
  "patch738_neutrals_lumber_description": "Az egyedi semleges tárgyak szerzésének első lépése egy semleges creeptábor teljes megtisztítása. Ezért mostantól őrült követ kapsz – kettőt magadnak és egyet egy véletlenszerű szövetségesednek.",
  "patch738_neutrals_crafting_title": "Ereklyék és igézések",
  "patch738_neutrals_crafting_description": "Második lépés: Személyre szabott semleges tárgyak készítéséhez gyűjts őrült követ. Mostantól mindegyik semleges tárgy két részből áll – egy ereklyéből, amely új képességeket ad a tárgyadnak, és egy igézésből, amely passzív tulajdonságbónuszokat ad neki.",
  "patch738_neutrals_timings_title": "Lásd, ki mit készít",
  "patch738_neutrals_timings_description": "Az ereklyéknek és igézéseknek a meccs során meghatározott időszakokban elérhető öt szintje van. Nézd meg a csapatod készítési előrehaladását, és segíts táborokat megtisztítani a javak szétosztásához.",
  "patch738_neutrals_tab_title": "Semlegesek egy pillantással",
  "patch738_neutrals_tab_description": "Böngéssz játék közben az ereklyék és igézések összes kombinációja között a frissített Semlegesek fülön. A nézők könnyedén láthatják minden hős készítési előzményeit.",
  "patch738_neutrals_changes_moreinfo": "A semleges tárgyak módosításainak teljes listája elérhető a frissítésjegyzékben.",
  "patch738_heroes_title": "Hősfrissítések",
  "patch738_qol_title": "Kényelmi funkciók",
  "patch738_qol_introduction": "Merülj el a játékmenet és -mechanika módosításainak és fejlesztéseinek óceánjában.",
  "patch738_qol_feature_roshan_timer_title": "Roshan időmérő",
  "patch738_qol_feature_roshan_timer_description": "Vidd az egérmutatót a minitérkép melletti Roshan időmérő fölé, hogy megtudd, mindenki kedvenc semleges creep-főellensége még mindig Üregmély aljáról szagolja-e a jósfüvet, vagy esetleg már visszatért a felszínre.",
  "patch738_qol_feature_hud_timers_title": "HUD időmérők",
  "patch738_qol_feature_hud_timers_description": "Korábban az egész térképet át kellett kutatnod, hogy lásd az összes különböző Dota Plusz játékidő-mérőt. Szerencsére most már csak lenyomva kell tartanod az ALT billentyűt, hogy láthasd az időmérők állapotát a képernyő tetején – tudod, arra az esetre, ha pingelned kéne az időt a szövetségeseidnek, emlékeztetve őket, hogy tegyenek meg <i>valami fontosat</i>, mielőtt az ellenség tenné meg.",
  "patch738_qol_feature_item_effects_title": "További tárgycélzási effektek",
  "patch738_qol_feature_item_effects_description": "Hozzáadtunk egy sor tárgy-látványeffektet, a Glimmer Cape-től a Lotus Orbig és még sok másig, hogy segítsünk jobban ismertetni, melyik hős a tárgy hatásainak forrása.",
  "patch738_qol_feature_attributes_pips_title": "Minden tulajdonság kijelző",
  "patch738_qol_feature_attributes_pips_description": "Lásd egy pillantással, hogy az Adottság Fa mely tulajdonságait fejlesztetted eddig. ",
  "patch738_qol_feature_markforsell_title": "Eladásra jelölés",
  "patch738_qol_feature_markforsell_description": "Állíts be egy tárgyat azonnali eladásra, amikor (életben) a bázisodon vagy a Titkos boltban vagy. Sőt, mi több, a futárod már naprakész a változtatásokkal, és visszaviszi a megjelölt tárgyakat a Forráshoz, amikor szállítmányt kézbesít.",
  "patch738_qol_feature_backpack_grace_title": "Hátizsák várakozási idő",
  "patch738_qol_feature_backpack_grace_description": "Egy csapatharc közepette a döntő fontosságú tárgyak kézbesítésének a játékot eldöntő diadal pillanatának kéne lennie, nem pedig annak a pillanatnak, amikor nézed, ahogy a csapatod meghal egy másodperccel azelőtt, hogy a hátizsák várakozási ideje lejárna. E nemes cél érdekében mostantól a hat másodperces várakozási idő nélkül előránthatod az újonnan szerzett tárgyakat a hátizsákodból, és azonnal használatba veheted azokat.",
  "patch738_gameplayupdate_title": "7.38-as frissítésjegyzék",
  "patch738_gameplayupdate_introduction": "Merülj el benne alább, és szívd magadba a frissítés összes változását!",
  "patch738_qol_feature_item_effects_list_label": "Lista megnézése",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Aghanim's Sceptere<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}