// 5844.js

{
  "patch738_website_subheader": "Pelipäivitys 7.38",
  "patch738_website_title": "Vaeltavat vedet",
  "patch738_website_introduction": "Anna virran viedä nopeammin sisälinjalle turvaan, määritä kohtalosi luotavilla neutraaliesineillä ja tutustu muutosten ja parannusten tulvaan.",
  "patch738_map_title": "Vettä on metsä tulvillaan",
  "patch738_map_introduction": "Dotan kartan kahtia jakava joki on aina ollut lähinnä vain hiekkaan piirretty viiva, joka erottaa Radiantin ja Diren toisistaan. Nyt virta on vapautunut ja joki tulvinut yli äyräiden, vesi nousee maastoon ja panee taistelukentän ja pelin kulun uusiksi.",
  "patch738_map_majorchanges_river_title": "Niin myötä- kuin vastavirrassa",
  "patch738_map_majorchanges_river_description": "Uudet vesiväylät eivät pelkästään muuta maisemaa. Heittäytymällä virran vietäväksi pääsee vauhdilla turvaan sisälinjalle, eikä vastavirtaan käyminen hidasta lain.",
  "patch738_map_majorchanges_roshan_title": "Roshanin muutto",
  "patch738_map_majorchanges_wisdom_title": "Viisauden alttarit",
  "patch738_map_majorchanges_wisdom_description": "Viisausriimut vaihtoivat paikkaa ja korvattiin Viisausalttareilla. Voit yhä napata kokemusta itsellesi ja liittolaisellesi, mutta sitä ei enää saa poimimalla riimun maasta, vaan on oltava alttarilla. Mikä on jutun juoni? Alttari ei toimi, jos vihollisia on läsnä. Kokemuksen nappaaminen vaatii vähän yksityisyyttä.",
  "patch738_map_majorchanges_lotus_title": "Veri on vettä sakeampaa",
  "patch738_map_majorchanges_lotus_description": "Viisausalttareiden tavoin myös lootuslähteet vaativat paikallaoloa lootusten poimimiseen. Lähellä olevat viholliset estävät lähdettä antamasta lootuksia, joten varmista, ettei vesileikeissä ole vihollisia.",
  "patch738_map_majorchanges_creeps_title": "Muodonmuutos",
  "patch738_map_majorchanges_creeps_description": "Myös neutraalileirejä odottaa päivityksen myötä muutos. Kuvioihin astuu nimittäin uudenlainen amfibiokätyri, joka kehittyy pelin edetessä nuijapäästä kurnuttajaksi.",
  "patch738_map_majorchanges_otherchanges": "Muuttuvat maastot",
  "patch738_map_majorchanges_moreinfo": "Karttamuutokset löytyvät päivitystiedoista.",
  "patch738_map_majorchanges_tormentor_title": "Painuva piinaaja",
  "patch738_map_majorchanges_tormentor_description": "Piinaajat eivät enää ilmesty tukikohtien lähelle. Sen sijaan yksittäinen Piinaaja ilmestyy kellonajan mukaan jompaankumpaan pelikentän kulmaan eli aina Roshania vastapäätä. Muiden muutosten lisäksi Piinaaja jättää nyt tuhoutuessaan jälkeensä parantavan auran.",
  "patch738_neutrals_title": "Ohjaa voiman virtauksia",
  "patch738_neutrals_introduction": "Esittelyssä Muinaiskuukivi, uusi valuutta, jolla voit luoda pelityyliisi ja tilanteeseen sopivia neutraaliesineitä pelin aikana.",
  "patch738_neutrals_lumber_title": "Muinaiskuukiven ansaitseminen",
  "patch738_neutrals_lumber_description": "Ensimmäinen askel ainutlaatuisiin neutraaliesineisiin on neutraalileirin tyhjentäminen. Näin ansaitset Muinaiskuukiviä – kaksi itsellesi ja yhden satunnaiselle liittolaiselle.",
  "patch738_neutrals_crafting_title": "Muinaisesineet ja lumoukset",
  "patch738_neutrals_crafting_description": "Toinen askel: säästä tarpeeksi Muinaiskuukiviä luodaksesi ainutlaatuisia neutraaliesineitä. Jokainen esine koostuu nyt kahdesta osasta: kykyjä antavasta muinaisesineestä ja passiivisia piirteitä antavasta lumouksesta.",
  "patch738_neutrals_timings_title": "Kuka luo mitäkin?",
  "patch738_neutrals_timings_description": "Muinaisesineitä ja lumouksia on saatavilla viidellä eri tasolla pelin eri vaiheissa. Seuraa joukkueesi esineiden luomisen edistymistä ja auta liittolaisia raivaamalla leirejä.",
  "patch738_neutrals_tab_title": "Yhdistelmämahdollisuudet",
  "patch738_neutrals_tab_description": "Selaa kaikkien muinaisesineiden ja lumousten yhdistelmiä kaupan päivitetyssä neutraaliesineosiossa pelin aikana. Katsojat näkevät helposti jokaisen sankarin luomishistorian.",
  "patch738_neutrals_changes_moreinfo": "Kaikki neutraaliesinemuutokset löytyvät päivitystiedoista.",
  "patch738_heroes_title": "Sankaripäivitykset",
  "patch738_qol_title": "Parempi pelikokemus",
  "patch738_qol_introduction": "Sukella pelattavuuden ja mekaniikkojen parannusten mereen.",
  "patch738_qol_feature_roshan_timer_title": "Roshan-ajastin",
  "patch738_qol_feature_roshan_timer_description": "Vilkaise kartan vieressä olevasta ajastimesta, josko kaikkien lempineutraali, kätyripomo, piileskelee yhä luolassaan maan alla vai onko hän jo noussut maan pinnalle.",
  "patch738_qol_feature_hud_timers_title": "Käyttöliittymäajastimet",
  "patch738_qol_feature_hud_timers_description": "Aiemmin Dota Plussan peliajastimet olivat vähän ympäri pelikenttää. Nyt voit pitää Alt-näppäintä pohjassa, niin ne ilmestyvät ruudun ylälaitaan, ja voit näppärästi muistuttaa liittolaisia tekemään <i>jotain tärkeää</i> ennen kuin vihollinen ehtii.",
  "patch738_qol_feature_item_effects_title": "Uudistetut esinetehosteet",
  "patch738_qol_feature_item_effects_description": "Lisäsimme liudan uusia esinetehosteita Glimmer Capesta Lotus Orbiin kertomaan, mikä sankari esineitä käytti.",
  "patch738_qol_feature_attributes_pips_title": "Taitopuun piirrelisät",
  "patch738_qol_feature_attributes_pips_description": "Näe yhdellä silmäyksellä, montako piirrelisää olet jo aktivoinut.",
  "patch738_qol_feature_markforsell_title": "Merkitse myytäväksi",
  "patch738_qol_feature_markforsell_description": "Merkitse haluamasi esine myytäväksi välittömästi, kun saavut (elävänä) lähteelle tai salakauppaan. Vielä parempaa: kuriiri tietää jo muutoksista ja vie merkityt esineet takaisin lähteelle tuodessaan esineesi.",
  "patch738_qol_feature_backpack_grace_title": "Repun armonaika",
  "patch738_qol_feature_backpack_grace_description": "Taistelun tuoksinassa voi olla vaikeaa järjestellä esineitä, ja elintärkeä esine saattaa pilata pelin päätymällä reppuusi. Nyt voit raahata juuri saamasi esineet repusta tavaraluetteloon ilman kuuden sekunnin jäähyä ja käyttää niitä välittömästi.",
  "patch738_gameplayupdate_title": "Päivitystiedot 7.38",
  "patch738_gameplayupdate_introduction": "Anna tietovirran viedä mukanaan, ja sukella syvälle päivitystietoihin!",
  "patch738_qol_feature_item_effects_list_label": "Katso lista",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Sythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemistin Aghanim's Scepter<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjöllnir"
}