// 2876.js

{
  "language": "czech",
  "patch738_website_subheader": "Herní aktualizace 7.38",
  "patch738_website_title": "Wandering Waters",
  "patch738_website_introduction": "Nechte se do bitev unášet proudy říček, podle potřeb si vytvářejte vlastní neutrální předměty a neutopte se v hlubinách dalších nových změn a vylepšení.",
  "patch738_map_title": "Stoletá potopa",
  "patch738_map_introduction": "Řeka dělící herní mapu na území Radianta a Direa nikdy nebyla skutečně klidná, ale teprve nyní se vylila z odvěkého koryta a zaplavením džunglí doslova přetvořila tok bitev.",
  "patch738_map_majorchanges_river_title": "Proud změn",
  "patch738_map_majorchanges_river_description": "Nově vzniklé říčky navíc nejsou jenom estetickým doplňkem, a kdo se vydá po směru proudu, získá bonus k rychlosti pohybu. Opačně to však neplatí, takže se klidně postavte proudu čelem a nebudete penalizováni.",
  "patch738_map_majorchanges_roshan_title": "Roshanovo další stěhování",
  "patch738_map_majorchanges_roshan_description": "Roshan se přestěhoval zpět do řeky, kde má teď dvě doupata poblíž run vylepšení. Na začátku zápasu se Roshan vždy objeví ve spodním doupěti, ale každá změna denní doby ho donutí pěšky přejít do protilehlého působiště a cestou naštvaně odhodit každého, kdo se mu připlete pod nohy.",
  "patch738_map_majorchanges_wisdom_title": "Posvátné vědomosti",
  "patch738_map_majorchanges_wisdom_description": "Runy vědomostí byly nahrazeny svatyněmi vědomostí, takže ačkoli dělení zkušeností zůstalo stejné, nově musíte místo sebrání runy stát v dosahu svatyně. Zní to snadněji? Ano i ne, protože pokud se poblíž nachází nepřátelský hrdina, svatyně Vám odmítne vydat své dary. Snad Vám nemusíme ani říkat, jak to vyřešit...",
  "patch738_map_majorchanges_lotus_title": "Krev ve vodě",
  "patch738_map_majorchanges_lotus_description": "Stejně jako nové svatyně vědomostí, tak i stará dobrá lotosová jezírka vyžadují, abyste pro sebrání léčivého květu chvilku stáli poblíž. A ano, i tady platí, že soukromí je důležité a nepřátelé sbírání přeruší. O lotosy se nikdy nedělte!",
  "patch738_map_majorchanges_creeps_title": "Evoluční skok",
  "patch738_map_majorchanges_creeps_description": "Zdivočelá voda se dostala až do několika kempů neutrálů, v důsledku čehož se objevili noví obojživelní creepové, kteří se v průběhu zápasu vyvíjí z Pollywogů přes Boglety až finálně v Croakery.",
  "patch738_map_majorchanges_otherchanges": "Mapa k nepoznání",
  "patch738_map_majorchanges_moreinfo": "Kompletní seznam změn mapy najdete níže.",
  "patch738_map_majorchanges_tormentor_title": "Tormentor s velkým T",
  "patch738_map_majorchanges_tormentor_description": "Tormentoři se už neobjevují poblíž základen týmů, ale nově se na jednom ze dvou míst v rozích mapy objeví pouze jediný. Toto místo závisí na denní době, a Tormentor se vždy nachází na opačné straně mapy než Roshan. Kromě několika dalších úprav Tormentor také dostal novou schopnost, díky níž se po jeho smrti uzdraví všichni kolem.",
  "patch738_neutrals_title": "Alchymie šílenství",
  "patch738_neutrals_introduction": "Slyšeli jste už o střípcích Šíleného měsíce? Nedivíme se, pokud ne – to je totiž nový zdroj, který umožňuje vytváření unikátních neutrálních předmětů.",
  "patch738_neutrals_lumber_title": "Střípek po střípku",
  "patch738_neutrals_lumber_description": "Prvním krokem, jak si vytvořit vlastní neutrální předmět, je kompletní vybití libovolného kempu neutrálních creepů. Jenom tak získáte střípky Šíleného měsíce, konkrétně dva pro sebe a jeden pro náhodného spojence.",
  "patch738_neutrals_crafting_title": "Artefakty a očarování",
  "patch738_neutrals_crafting_description": "Druhý krok: nasbírejte dostatek střípků. Až se tak stane, dostanete možnost vytvořit neutrální předmět skládající se ze dvou částí, artefaktu poskytujícího schopnost a očarování poskytujícího pasivní bonusy.",
  "patch738_neutrals_timings_title": "Kdo vyrábí co",
  "patch738_neutrals_timings_description": "V určitých časech zápasu je postupně k dispozici celkem pět hodností artefaktů a očarování. Kdykoli však můžete zjistit, jak jsou na tom se střípky spojenci, a případně jim s farmením pomoci.",
  "patch738_neutrals_tab_title": "Kompletní katalog",
  "patch738_neutrals_tab_description": "Záložka „Neutrální“ v obchodu byla přepracována, aby informovala o všech kombinacích artefaktů a očarování. Diváci mohou navíc snadno vidět historii neutrálních předmětů všech hrdinů.",
  "patch738_neutrals_changes_moreinfo": "Kompletní seznam změn neutrálních předmětů najdete níže.",
  "patch738_heroes_title": "Změny hrdinů",
  "patch738_qol_title": "Užitečné novinky",
  "patch738_qol_introduction": "Oceán úprav a vylepšení hratelnosti či mechanik čeká na objevení.",
  "patch738_qol_feature_roshan_timer_title": "Ukazatel Roshana",
  "patch738_qol_feature_roshan_timer_description": "Najetím myší na ikonu Roshana vedle minimapy je nově vyvolána informace o tom, zdali oblíbený boss pořád ještě čuchá ke kytkám zespoda, nebo už je možné, že se vrátil na další kolo.",
  "patch738_qol_feature_hud_timers_title": "Přehled odpočtů",
  "patch738_qol_feature_hud_timers_description": "Pryč jsou doby, kdy člověk musel šmejdit po mapě a hledat odpočty, za které si zaplatil v programu Dota Plus! Nově stačí podržet klávesu Alt a všechny odpočty se vyřádkují navrchu obrazovky, kde na ně můžete kliknout a připomenout spojencům, že se <i>něco stane</i>.",
  "patch738_qol_feature_item_effects_title": "Efekty používání předmětů",
  "patch738_qol_feature_item_effects_description": "Pro tuto aktualizaci jsme také přidali celou řadu vizuálních efektů předmětů, od Glimmer Cape až po Lotus Orb a mnohé další, takže teď jde snáze poznat, kdo je odkud používá.",
  "patch738_qol_feature_attributes_pips_title": "Bonusy k atributům",
  "patch738_qol_feature_attributes_pips_description": "Ode dneška na první pohled (a bez brýlí) zjistíte, kolikrát jste skrze talentový strom vylepšili všechny atributy svého hrdiny.",
  "patch738_qol_feature_markforsell_title": "Označení k prodeji",
  "patch738_qol_feature_markforsell_description": "Určete na dvě kliknutí, že jakmile to bude možné – až oživnete, vrátíte se do základny, nebo navštívíte tajný obchod – má být prodán daný předmět. Co víc, když k Vám přiběhne kurýr s donáškou, automaticky vezme a odnese prodat všechny označené předměty.",
  "patch738_qol_feature_backpack_grace_title": "Tolerantnější batoh",
  "patch738_qol_feature_backpack_grace_description": "Donáška klíčového předmětu uprostřed týmového střetu by měla být okamžikem triumfálního naklonění vah osudu Vaším směrem, a ne okamžikem, kdy sledujete, jak Váš tým pomře, jelikož předmět nešlo šest sekund přesunout z batohu. Proto je čerstvě zakoupené předměty nově možné přetáhnout okamžitě!",
  "patch738_gameplayupdate_title": "Seznam změn",
  "patch738_gameplayupdate_introduction": "Zadržte dech a ponořte se do hlubin všech změn této aktualizace!",
  "patch738_qol_feature_item_effects_list_label": "Seznam aktualizovaných předmětů",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Aghanim's Scepter (Alchemist)<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}