// 1564.js

{
  "language": "polish",
  "patch738_website_subheader": "Aktualizacja rozgrywki 7.38",
  "patch738_website_title": "Wędrujące Wody",
  "patch738_website_introduction": "Biegnijcie wraz z prądami, by dotrzeć do waszej bezpiecznej ścieżki szybciej, wykujcie swoje przeznaczenie, wytwarzając neutralne przedmioty i dajcie nura w morze nowych zmian i usprawnień.",
  "patch738_map_title": "Lepszy, wilgotniejszy świat",
  "patch738_map_introduction": "Szlak wodny przegradzający mapę Dota 2 zawsze był czymś więcej niż tylko wytyczoną przez wodę linią w piasku dzielącą wojujące ze sobą frakcje Świetlistych i Mrocznych. Jednak rzeka wreszcie wezbrała ponad swe brzegi, zalewając położony wyżej grunt i przekształcając pole (i bieg) walki.",
  "patch738_map_majorchanges_river_title": "W górę serca w dole rzeki",
  "patch738_map_majorchanges_river_description": "Te wszystkie nowe wodniste przejścia w dżunglach nie są tylko okoliczną atrakcją. Biegnąc z prądem, otrzymacie premię do szybkości ruchu w kierunku waszej bezpiecznej ścieżki. Poruszając się w drugą stronę, nie zostajecie spowolnieni.",
  "patch738_map_majorchanges_roshan_title": "Przeniesienie Roshana",
  "patch738_map_majorchanges_roshan_description": "Dwie jamy Roshana zostały przeniesione do rzeki i znajdują się od teraz obok run mocy. Roshan pojawi się w południowej jamie na początku meczu, jednak gdy światło dzienne uzna, że czas w drogę, Roshan przejdzie całkowity dystans między swoimi jamami, odrzucając na bok wszelkie napotkane na swojej drodze jednostki.",
  "patch738_map_majorchanges_wisdom_title": "Uwaga na ołtarze",
  "patch738_map_majorchanges_wisdom_description": "Runy mądrości zostały przeniesione i zastąpione ołtarzami mądrości. Wciąż możesz zebrać nieco doświadczenia dla siebie i sojusznika, ale teraz zamiast wyrywać runę z ziemi, będziesz musiał stać przy ołtarzu, by zdobywać PD. Gdzie haczyk? Ołtarz nie zostanie aktywowany, jeśli jest z z tobą przy nim wrogi bohater. Będziesz musiał wywalczyć sobie odrobinę prywatności, by zgarnąć dar.",
  "patch738_map_majorchanges_lotus_title": "Krew w wodzie",
  "patch738_map_majorchanges_lotus_description": "Tak jak z ołtarzami mądrości, będziecie od teraz musieli stać wewnątrz basenu lotosu, by zebrać lotos. Wrogowie na obszarze powstrzymają aktywację basenu, więc upewnijcie się, że pływacie sami.",
  "patch738_map_majorchanges_creeps_title": "Ewolucyjny skok",
  "patch738_map_majorchanges_creeps_description": "Obozy stworów również doczekały się odświeżenia w aktualizacji Wędrujące Wody, a to w formie wodno-lądowego rodzaju stworów, które ewoluują w miarę upływu czasu gry – od kijanki, przez bagniątko, do kumkacza.",
  "patch738_map_majorchanges_otherchanges": "Zmieniający się teren",
  "patch738_map_majorchanges_moreinfo": "Wszystkie informacje o zmianach mapy znajdują się na liście zmian aktualizacji.",
  "patch738_map_majorchanges_tormentor_title": "Daleko idący dręczyciel",
  "patch738_map_majorchanges_tormentor_description": "Dręczyciele nie pojawiają się już blisko bazy obu drużyn. Zamiast tego pojedynczy dręczyciel pojawi się w jednej z dwóch lokacji w rogu mapy w zależności od pory dnia. Oznacza to również, że zawsze pojawi się po przeciwnej stronie Roshana. Pośród paru innych poprawek dręczyciele otrzymali też nową umiejętność, która obszarowo uleczy jego zabójców.",
  "patch738_neutrals_title": "Kontrola prądów siły",
  "patch738_neutrals_introduction": "Przedstawiamy Madstone, nowy zasób, który pozwala wam wytwarzać neutralne przedmioty, które są unikalne dla waszej rozgrywki i okoliczności meczu",
  "patch738_neutrals_lumber_title": "Farmienie Madstone",
  "patch738_neutrals_lumber_description": "Pierwszym krokiem do zdobycia niestandardowych neutralnych przedmiotów jest pełne oczyszczenie obozu neutralnych stworów. Od teraz za to otrzymacie Madstone – dwa dla siebie i jeden dla losowego sojusznika.",
  "patch738_neutrals_crafting_title": "Artefakty i wzmocnienia",
  "patch738_neutrals_crafting_description": "Krok drugi: zachowajcie Madstone, by wytworzyć spersonalizowane neutralne przedmioty. Od teraz każdy neutralny składa się z dwóch części – artefaktu dającego waszemu przedmiotowi nowe umiejętności, a także wzmocnienia, które nadaje pasywne premie do statystyk lub atrybutów.",
  "patch738_neutrals_timings_title": "Co kto składa?",
  "patch738_neutrals_timings_description": "Istnieje pięć stopni artefaktów i wzmocnień dostępnych w konkretnych okienkach czasowych podczas meczu. Sprawdzajcie postęp wytwarzania waszej drużyny i pomagajcie oczyszczać obozy, by dokładać się do puli.",
  "patch738_neutrals_tab_title": "Neutralne na widoku",
  "patch738_neutrals_tab_description": "Przeglądajcie każdą kombinację artefaktu i wzmocnienia w zaktualizowanej zakładce neutralnych przedmiotów w grze. Widzowie mogą łatwo zobaczyć historię wytwarzania każdego bohatera.",
  "patch738_neutrals_changes_moreinfo": "Wszystkie informacje o zmianach w neutralnych przedmiotach znajdują się na liście zmian aktualizacji.",
  "patch738_heroes_title": "Aktualizacje bohaterów",
  "patch738_qol_title": "Usprawnienie elementów gry",
  "patch738_qol_introduction": "Dajcie nura do oceanu poprawek i ulepszeń w rozgrywce i mechanikach.",
  "patch738_qol_feature_roshan_timer_title": "Zegar Roshana",
  "patch738_qol_feature_roshan_timer_description": "Najedźcie kursorem na zegar Roshana obok minimapy po dodatkową podpowiedź, czy uwielbiany przez wszystkich boss neutralnych stworów wciąż wącha wieszcze ziele od spodu w Głuchej Pieczarze, czy też zdążył już wrócić do świata żywych.",
  "patch738_qol_feature_hud_timers_title": "Zegary interfejsu",
  "patch738_qol_feature_hud_timers_description": "Kiedyś musieliście latać po mapie, by zobaczyć wszystkie przeróżne zegary gry w ramach Dota Plus. Na szczęście teraz możecie po prostu przytrzymać ALT, by zobaczyć stany tych zegarów na górze ekranu. Wiecie, gdybyście tak musieli spingować czas waszym sojusznikom, by przypomnieć im o zrobieniu <i>czegoś ważnego</i>, zanim zabierze się za to wasz wróg.",
  "patch738_qol_feature_item_effects_title": "Efekty obierania za cel dla przedmiotów",
  "patch738_qol_feature_item_effects_description": "Dodaliśmy mrowie efektów wizualnych dla przedmiotów, od Glimmer Cape do Lotus Orb i wielu innych, by lepiej przekazać, który bohater jest źródłem efektu danego przedmiotu.",
  "patch738_qol_feature_attributes_pips_title": "Wyświetlanie wszystkich atrybutów",
  "patch738_qol_feature_attributes_pips_description": "W łatwy sposób zobaczcie, jakie atrybuty drzewka talentów wybraliście do tej pory.",
  "patch738_qol_feature_markforsell_title": "Oznaczanie na sprzedaż",
  "patch738_qol_feature_markforsell_description": "Oznaczcie przedmiot, by natychmiastowo go sprzedać, gdy jesteście (żywi) w swojej bazie lub w ukrytym sklepie. Nawet lepiej, wasi kurierzy już podłapali te zmiany i zabiorą wszelkie oznaczone przedmioty z powrotem do fontanny.",
  "patch738_qol_feature_backpack_grace_title": "Bez czekania na plecak",
  "patch738_qol_feature_backpack_grace_description": "Kluczowa dostawa przedmiotu podczas walki drużynowej powinna być chwilą zmieniającego rezultat gry triumfu, a nie chwilą patrzenia, jak wasza drużyna ginie na sekundę przed zresetowaniem czekania na wasz plecak. Aby sprostać tym aspiracjom, możecie od teraz przeciągać nowo zdobyte przedmioty ze swojego plecaka bez czekania sześciu sekund i użyć ich natychmiastowo.",
  "patch738_gameplayupdate_title": "Lista zmian aktualizacji 7.38",
  "patch738_gameplayupdate_introduction": "Zanurzcie się i wchłońcie wszystkie zmiany w tej aktualizacji poniżej!",
  "patch738_qol_feature_item_effects_list_label": "Zobacz listę",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Agh's Scepter<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}