// 4769.js

{
  "language": "french",
  "patch738_website_subheader": "Mise à jour du gameplay 7.38",
  "patch738_website_title": "Eaux vagabondes",
  "patch738_website_introduction": "Laissez-vous porter par les courants pour atteindre plus rapidement votre Safe Lane et forgez votre propre destin en fabriquant vous-même vos objets neutres. Attention : déluge de modifications et d'améliorations droit devant !",
  "patch738_map_title": "Un monde moins sec",
  "patch738_map_introduction": "La rivière séparant le Radiant du Dire n'a toujours été que cela… une rivière. Mais celle-ci est enfin sortie de son lit : elle se déverse maintenant dans les hauteurs et promet de renverser le cours des combats.",
  "patch738_map_majorchanges_river_title": "Courants express",
  "patch738_map_majorchanges_river_description": "Ces nouvelles voies d'eau dans les jungles ne font pas qu'améliorer le paysage : vous pouvez vous laisser porter par le courant pour accéder plus rapidement à votre Safe Lane. En plus, remonter à contrecourant ne vous ralentit pas.",
  "patch738_map_majorchanges_roshan_title": "Roshan déménage",
  "patch738_map_majorchanges_roshan_description": "Les deux fosses de Roshan se sont vues déplacées vers la rivière, près des deux Power Runes. Roshan apparait dans la fosse du bas au début de la partie, mais au lever du jour, il marchera tranquillement en direction de l'autre fosse, tout en lançant en l'air quiconque pourrait se trouver sur son chemin.",
  "patch738_map_majorchanges_wisdom_title": "Songez aux sanctuaires",
  "patch738_map_majorchanges_wisdom_description": "Les runes de Wisdom ont été déplacées et remplacées par des sanctuaires de Wisdom. La différence ? Il vous faut maintenant rester à proximité du sanctuaire pour obtenir de l'expérience pour vous et votre équipe. Oh, et pour l'activer, il ne faut pas qu'il y ait d'unité héroïque adverse dans les horizons : on ne partage pas sa sagesse avec l'équipe ennemie.",
  "patch738_map_majorchanges_lotus_title": "En eaux troubles",
  "patch738_map_majorchanges_lotus_description": "Pour récupérer les lotus d'un bassin, il vous faut maintenant plonger dedans. Comme pour les Shrines de Wisdom, toute unité ennemie à proximité empêchera de récupérer les lotus.",
  "patch738_map_majorchanges_creeps_title": "Un bond évolutif",
  "patch738_map_majorchanges_creeps_description": "Les camps de creeps font également peau neuve à l'occasion de cette mise à jour. Un nouveau type de creep amphibie entre en scène : il évolue tout au long de la partie, et se présente tantôt sous la forme de Pollywog, de Boglet ou encore de Croaker.",
  "patch738_map_majorchanges_otherchanges": "Un terrain changeant",
  "patch738_map_majorchanges_moreinfo": "Une liste complète des modifications apportées à la carte est disponible dans les notes de mise à jour.",
  "patch738_map_majorchanges_tormentor_title": "Un fossoyeur fugace",
  "patch738_map_majorchanges_tormentor_description": "Les fossoyeurs n'apparaissent plus près de la base de chaque équipe. Désormais, un seul fossoyeur apparaitra à l'une des deux extrémités de la carte selon qu'il fasse nuit ou jour. Ainsi, le fossoyeur sera toujours à l'opposé de Roshan. En plus d'une série d'ajustements divers, le fossoyeur dispose également d'une nouvelle capacité qui laisse derrière lui une zone de soins après sa destruction.",
  "patch738_neutrals_title": "Changez le cours de la bataille",
  "patch738_neutrals_introduction": "Découvrez les pierres de démence, une nouvelle ressource qui vous permet de fabriquer des objets neutres propres à votre style de jeu et aux circonstances de la partie.",
  "patch738_neutrals_lumber_title": "Obtenir des pierres de démence",
  "patch738_neutrals_lumber_description": "La première étape pour obtenir les objets neutres de votre choix est de venir à bout d'un camp de creeps neutres. Vous obtiendrez alors des pierres de démence : deux pour vous et une pour une personne au hasard dans votre équipe.",
  "patch738_neutrals_crafting_title": "Artéfacts et enchantements",
  "patch738_neutrals_crafting_description": "Ensuite, gardez vos pierres de démence au chaud pour fabriquer des objets neutres personnalisés. Chaque objet neutre est maintenant composé de deux parties : un artéfact, qui confère à votre objet de nouvelles capacités, et un enchantement, qui accorde un bonus d'attributs passif.",
  "patch738_neutrals_timings_title": "Qui fabrique quoi ?",
  "patch738_neutrals_timings_description": "Il existe cinq niveaux d'artéfacts et d'enchantements qui deviennent disponibles à certains moments de la partie. Gardez un œil sur les objets fabriqués par votre équipe, et venez à bout des camps de creeps pour distribuer les ressources.",
  "patch738_neutrals_tab_title": "Les objets neutres en un coup d'œil",
  "patch738_neutrals_tab_description": "Parcourez toutes les combinaisons d'artéfacts et d'enchantements dans l'onglet « Neutres » en jeu. En mode spectateur, il est également possible de voir l'historique de fabrication de chaque unité héroïque.",
  "patch738_neutrals_changes_moreinfo": "Une liste complète des modifications apportées aux objets neutres est disponible dans les notes de mise à jour.",
  "patch738_heroes_title": "Modifications apportées aux unités héroïques",
  "patch738_qol_title": "Améliorations de confort",
  "patch738_qol_introduction": "Plongez dans un océan d'ajustements et d'améliorations au niveau du gameplay et des mécaniques de jeu.",
  "patch738_qol_feature_roshan_timer_title": "Chrono de réapparition de Roshan",
  "patch738_qol_feature_roshan_timer_description": "Survolez le chrono de Roshan près de la minicarte pour savoir si le plus terrifiant des creeps neutres est toujours dans le fin fond des enfers ou est de retour dans son antre.",
  "patch738_qol_feature_hud_timers_title": "Tous les chronomètres au même endroit",
  "patch738_qol_feature_hud_timers_description": "Avant, il fallait parcourir la carte entière pour voir les différents chronomètres de Dota Plus. Désormais, il vous suffit de maintenir ALT pour voir, en haut de l'écran, l'état de tous les chronomètres. Et vous pouvez même alerter votre équipe de ces chronomètres… juste pour leur rappeler de faire <i>quelque chose d'important</i> avant l'équipe ennemie.",
  "patch738_qol_feature_item_effects_title": "Nouveaux effets de ciblage pour les objets",
  "patch738_qol_feature_item_effects_description": "Une ribambelle d'effets visuels pour les objets (Glimmer Cape, Lotus Orb…) ont été ajoutées afin de permettre de mieux distinguer l'unité héroïque à l'origine de ces effets.",
  "patch738_qol_feature_attributes_pips_title": "Affichage des bonus d'attributs",
  "patch738_qol_feature_attributes_pips_description": "Vous pouvez maintenant voir d'un coup d'œil quels bonus d'attributs vous avez sélectionnés depuis l'arbre des talents.",
  "patch738_qol_feature_markforsell_title": "Vente automatique",
  "patch738_qol_feature_markforsell_description": "Il est maintenant possible de vendre automatiquement un objet dès que vous arrivez (en vie) à la base ou à une échoppe secrète. Encore mieux : votre coursier est déjà alerté et rapportera tout objet indiqué comme à vendre à la fontaine lors de sa livraison.",
  "patch738_qol_feature_backpack_grace_title": "Un sac à dos moins restrictif",
  "patch738_qol_feature_backpack_grace_description": "La livraison d'un objet crucial au beau milieu d'un combat devrait être un moment de jeu spectaculaire, non pas un moment où vous voyez votre équipe se faire décimer une seconde avant la fin du temps de recharge appliqué lorsqu'un objet est sorti du sac à dos. Les objets que vous venez d'obtenir et qui sont automatiquement ajoutés à votre sac à dos peuvent maintenant être transférés vers votre inventaire principal sans temps de recharge.",
  "patch738_gameplayupdate_title": "Mise à jour du gameplay 7.38",
  "patch738_gameplayupdate_introduction": "Faites défiler pour plonger dans ce torrent de changements !",
  "patch738_qol_feature_item_effects_list_label": "Voir la liste",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Aghanim's Scepter d'Alchemist<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}