// 280.js

{
  "language": "latam",
  "patch738_website_subheader": "Actualización 7.38",
  "patch738_website_title": "Aguas Errantes",
  "patch738_website_introduction": "Corre con las corrientes para llegar a tu senda segura más rápido, forja tu propio destino fabricando Objetos Neutrales y sumérgete en un diluvio de nuevos cambios y mejoras.",
  "patch738_map_title": "Un mundo mejor y más mojado",
  "patch738_map_introduction": "El mapa que divide la vía fluvial de Dota siempre ha sido más como una línea de agua en la arena, la cual separa las facciones de guerra de los Radiant y Dire, pero el río finalmente rompió sus riberas e inundó los terrenos en las partes altas hasta reconfigurar el campo (y la corriente) de batalla.",
  "patch738_map_majorchanges_river_title": "El lado positivo de la corriente",
  "patch738_map_majorchanges_river_description": "Todas estas nuevas vías fluviales en las junglas no son solo una mejora al escenario. Correr con la corriente te dará un aumento de velocidad de movimiento hacia tu senda segura, sin ralentizarte si estás corriendo contra corriente.",
  "patch738_map_majorchanges_roshan_title": "Nueva ubicación de Roshan",
  "patch738_map_majorchanges_roshan_description": "Las dos fosas de Roshan fueron reubicadas en el río, con nuevas guaridas cerca a las dos runas de poder. Roshan ahora aparecerá en la fosa sur al inicio de la partida, pero cuando la luz del día decida que es momento de cambiar, él caminará la distancia total entre las dos fosas, aventando a las unidades con las que se tope en su camino.",
  "patch738_map_majorchanges_wisdom_title": "Ten en cuenta los santuarios",
  "patch738_map_majorchanges_wisdom_description": "Las Runas de Sabiduría fueron reubicadas y reemplazadas con los Santuarios de la Sabiduría. Aún podrás ganar experiencia para ti y un aliado, pero ahora en vez de recoger una runa del suelo, tendrás que colocarte al lado del santuario para obtener experiencia. ¿Cuál es el cambio? El santuario no se activará si hay un héroe enemigo cercano a ti. Tendrás que tener un poquito de privacidad para llevarte el motín.",
  "patch738_map_majorchanges_lotus_title": "Sangre en el agua",
  "patch738_map_majorchanges_lotus_description": "En cuanto a los Santuarios de la Sabiduría, ahora tendrás que colocarte dentro de la Fuente de Loto para recoger los lotos. Los enemigos en el área impedirán que se active la fuente, así que asegúrate de nadar tú solo.",
  "patch738_map_majorchanges_creeps_title": "Un salto evolutivo",
  "patch738_map_majorchanges_creeps_description": "Los campamentos de creeps también se rediseñaron en Aguas Errantes, con un nuevo tipo de creeps anfibios, los cuales evolucionan de Pollywog a Boglet a Croaker a lo largo de la partida.",
  "patch738_map_majorchanges_otherchanges": "Cambios en el terreno",
  "patch738_map_majorchanges_moreinfo": "Está disponible una lista completa sobre los cambios al mapa en las notas del parche.",
  "patch738_map_majorchanges_tormentor_title": "Torturador transitorio",
  "patch738_map_majorchanges_tormentor_description": "Los Torturadores ya no reaparecen cerca de la base de cada equipo. Ahora, aparece un solo Torturador en una de las dos ubicaciones en las esquinas del mapa, dependiendo de la hora del día, lo cual también significa que siempre aparecerá del lado opuesto a Roshan. Entre el montón de ajustes, el Torturador también tiene una nueva habilidad que dejará atrás una beneficiosa área de efecto curativa una vez que sea derrotado.",
  "patch738_neutrals_title": "Navega las Corrientes de Poder",
  "patch738_neutrals_introduction": "Presentamos la Piedra de la Locura, un recurso nuevo que te permite fabricar objetos neutrales únicos para tu estilo de juego y las circunstancias de la partida.",
  "patch738_neutrals_lumber_title": "Recolecta la Piedra de la Locura",
  "patch738_neutrals_lumber_description": "El primer paso para obtener un objeto neutral personalizado es despejar por completo un campo de creeps neutrales. Esto ahora te otorgará la Piedra de la Locura: dos para ti y una para un héroe aliado.",
  "patch738_neutrals_crafting_title": "Artefactos y Encantamientos",
  "patch738_neutrals_crafting_description": "Paso dos: guarda la Piedra de la Locura para fabricar tus objetos neutrales personalizados. Cada objeto neutral ahora está hecho de dos partes: un Artefacto que le otorga a tu objeto habilidades nuevas y un Encantamiento, el cual le otorga sus estadísticas pasivas y atributos adicionales.",
  "patch738_neutrals_timings_title": "Ve quién fabrica qué",
  "patch738_neutrals_timings_description": "Existen cinco niveles de Artefactos y Encantamientos disponibles en momentos específicos a lo largo de la partida. Revisa el progreso de fabricación de tu equipo y ayuda a despejar los campos para repartir la riqueza.",
  "patch738_neutrals_tab_title": "Hecha un vistazo a los objetos neutrales",
  "patch738_neutrals_tab_description": "Explora todas las combinaciones de Artefactos y Encantamientos en la pestaña actualizada de Objetos Neutrales dentro de la partida. Los espectadores pueden ver fácilmente el historial de fabricación de cada uno de los héroes.",
  "patch738_neutrals_changes_moreinfo": "Está disponible una lista completa sobre los objetos neutrales en las notas del parche.",
  "patch738_heroes_title": "Actualizaciones de héroes",
  "patch738_qol_title": "Calidad de vida",
  "patch738_qol_introduction": "Sumérgete en un océano de ajustes y mejoras a la jugabilidad y mecánica.",
  "patch738_qol_feature_roshan_timer_title": "Temporizador de Roshan",
  "patch738_qol_feature_roshan_timer_description": "Pasa el cursor sobre el temporizador de Roshan al lado del minimapa para obtener una pista adicional sobre el jefe favorito de los creeps neutrales de todos y ver si sigue batallando en la Subcaverna o si ya regresó a la parte superior.",
  "patch738_qol_feature_hud_timers_title": "Temporizadores del HUD",
  "patch738_qol_feature_hud_timers_description": "Solías tener que buscar en todo el mapa para ver todos los diferentes temporizadores del juego con Dota Plus. Afortunadamente, ahora puedes mantener presionada la tecla \"ALT\" para ver el estado de esos temporizadores en la parte superior de tu pantalla; ya sabes, por si acaso necesitas hacer indicaciones a tus aliados con respecto al tiempo para recordarles que hagan <i>algo importante</i> antes de que tu enemigo lo haga.",
  "patch738_qol_feature_item_effects_title": "Efectos de selección de objetos agregados",
  "patch738_qol_feature_item_effects_description": "Agregamos una gran cantidad de efectos visuales a los objetos, desde la Capa Fulgurante hasta el Orbe de Loto y mucho más, para ayudar a comunicar mejor qué héroe es la fuente de los efectos del objeto.",
  "patch738_qol_feature_attributes_pips_title": "Visualización de todos los atributos",
  "patch738_qol_feature_attributes_pips_description": "Echa un vistazo a qué atributos del árbol de talentos ya calificas hasta el momento.",
  "patch738_qol_feature_markforsell_title": "Marcar para su venta",
  "patch738_qol_feature_markforsell_description": "Selecciona un objeto para ser vendido de inmediato cuando estés (vivo) en tu base o en la Tienda Secreta. Mejor aún, tu mensajero ya está al tanto con los cambios y llevará cualquier objeto marcado de regreso a la fuente cuando entregue una carga útil.",
  "patch738_qol_feature_backpack_grace_title": "Periodo de gracia de la mochila",
  "patch738_qol_feature_backpack_grace_description": "Una entrega de objetos cruciales en medio de una pelea en equipo debe ser un momento de triunfo decisivo, no un momento de ver morir a tu equipo un segundo antes de que se reinicie el tiempo de recarga de tu mochila. Con ese fin aspiracional, ahora puedes arrastrar los objetos recién adquiridos fuera de tu mochila sin el tiempo de recarga de seis segundos y ponerlos en uso de inmediato.",
  "patch738_gameplayupdate_title": "Notas del parche 7.38",
  "patch738_gameplayupdate_introduction": "¡Sumérgete y empápate con todos los cambios sobre la actualización a continuación!",
  "patch738_qol_feature_item_effects_list_label": "Ver lista",
  "patch738_qol_feature_item_effects_list_col1": "Bastón de la Fuerza<br>Capa Fulgurante<br>Orbe de Loto<br>Orquídea<br>Hoja Difusora<br>Espina Sangrienta<br>Cetro de la Divinidad de Eul<br>Dispersora<br>Guadaña de Vyse<br>Despiertavientos<br>Botella<br>Loto Curativo<br>Alabarda<br>Blasón Solar<br>Pavés<br>Pica Huracán",
  "patch738_qol_feature_item_effects_list_col2": "Bálsamo Curativo<br>Tango<br>Claridad<br>Mango<br>Guardián Observador<br>Guardián Centinela<br>Cetro de Aghanim para Alchemist<br>Esquirla Lunar<br>Esfera de Linken<br>Yelmo del Dominador<br>Yelmo del Supremo<br>Amuleto de las Sombras<br>Mjollnir"
}