// 9520.js

{
  "language": "danish",
  "patch738_website_subheader": "Spilopdatering 7.38",
  "patch738_website_title": "Vandrende vand",
  "patch738_website_introduction": "Løb med strømmen for hurtigere at nå til din Safe Lane, tag skæbnen i egen hånd ved at smede neutrale genstande, og udforsk en kaskade af nye ændringer og forbedringer.",
  "patch738_map_title": "En bedre, vådere verden",
  "patch738_map_introduction": "Floden, som har opdelt Dota-banen, har altid været mere end en vandet streg i sandet, som adskiller de stridende fraktioner Radiant og Dire. Men nu er floden endelig gået over sine bredder og er strømmet op til det højereliggende terræn, hvor den har omformet slagmarken og kampforløbet.",
  "patch738_map_majorchanges_river_title": "Følg med strømmen",
  "patch738_map_majorchanges_river_description": "Alle disse nye floder i junglerne er ikke blot en opgradering til landskabet. Når du løber med strømmen, får du øget hastighed til din Safe Lane, og din hastighed sænkes ikke, hvis du løber mod strømmen.",
  "patch738_map_majorchanges_roshan_title": "Roshans nye hjem",
  "patch738_map_majorchanges_roshan_description": "Roshans to grave er blevet flyttet til floden, med to nye huler nær de to styrkeruner. Roshan dukker op i den sydlige grav i starten af kampen, men når dagslyset begynder at forsvinde, går han hele afstanden mellem de to grave og kaster rundt med alle, han møder undervejs.",
  "patch738_map_majorchanges_wisdom_title": "Gå til alters",
  "patch738_map_majorchanges_wisdom_description": "Visdomsruner er blevet flyttet og erstattet med visdomsaltre. Du kan stadig få erfaring til dig selv og en allieret, men i stedet for at samle en rune op fra jorden skal du nu stå i altret for at tjene XP. Hagen ved det? Altret aktiveres ikke, hvis der er en fjendtlig helt derinde sammen med dig. Du skal være alene for at få velsignelsen.",
  "patch738_map_majorchanges_lotus_title": "Blod i vandet",
  "patch738_map_majorchanges_lotus_description": "Ligesom med visdomsaltre skal du nu stå nede i en lotusdam for at plukke lotusblomster. Fjender i området forhindrer, at dammen aktiveres, så sørg for, at du svømmer alene.",
  "patch738_map_majorchanges_creeps_title": "Et evolutionært spring",
  "patch738_map_majorchanges_creeps_description": "Kryblejrene opdateres også i \"Vandrende vand\", i form af en ny amfibisk krybtype, som udvikler sig fra Pollywog til Boglet til Croaker undervejs i kampen.",
  "patch738_map_majorchanges_otherchanges": "Det foranderlige terræn",
  "patch738_map_majorchanges_moreinfo": "Komplet list over baneændringer kan findes i opdateringsnoterne.",
  "patch738_map_majorchanges_tormentor_title": "Flygtig plageånd",
  "patch738_map_majorchanges_tormentor_description": "Plageånder dukker ikke længere op nær hvert holds base. I stedet dukker der en enkelt plageånd op på ét af to steder i hjørnerne af kortet alt efter tidspunktet på dagen – hvilket også betyder, at den altid dukker op i modsatte side af Roshan. Blandt et hav af andre justeringer har plageånden også fået en ny evne, som gør, at den efterlader sig et dejligt helende område, når den dør.",
  "patch738_neutrals_title": "Vend slagets gang",
  "patch738_neutrals_introduction": "Vi introducerer vredessten – en ny resurse, som lader dig smede neutrale genstande, som er unikke for din spillestil og omstændighederne i kampen.",
  "patch738_neutrals_lumber_title": "Farming af vredessten",
  "patch738_neutrals_lumber_description": "Det første skridt til at få neutrale genstande er at rydde en lejr med neutrale kryb fuldstændigt. Det giver nu vredessten – to til dig selv og én til en tilfældig allieret.",
  "patch738_neutrals_crafting_title": "Artefakter og fortryllelser",
  "patch738_neutrals_crafting_description": "Andet trin: Spar nok vredessten sammen til at smede personlige neutrale genstande. Hver neutrale genstand består nu af to dele – en artefakt, som giver genstanden nye evner, og en fortryllelse, som giver den passive egenskaber/attributbonusser.",
  "patch738_neutrals_timings_title": "Se, hvem der smeder hvad",
  "patch738_neutrals_timings_description": "Der er fem niveauer af artefakter og fortryllelser, som er tilgængelige på bestemte tidspunkter under en kamp. Tjek dit holds smedefremskridt, og hjælp med at rydde lejre for at fordele rigdommene.",
  "patch738_neutrals_tab_title": "Overblik over neutrale elementer",
  "patch738_neutrals_tab_description": "Gennemse alle kombinationer af artefakter og fortryllelser i den opdaterede fane \"Neutrale\", mens du er i spillet. Tilskuere kan nemt se hver helts smedehistorik.",
  "patch738_neutrals_changes_moreinfo": "Komplet list over ændringer i neutrale genstande kan findes i opdateringsnoterne.",
  "patch738_heroes_title": "Helteopdateringer",
  "patch738_qol_title": "Kvalitetsforbedringer",
  "patch738_qol_introduction": "Dyk ned i et hav af justeringer og forbedringer til gameplayet og spilmekanismerne.",
  "patch738_qol_feature_roshan_timer_title": "Roshan-timer",
  "patch738_qol_feature_roshan_timer_description": "Hold musen over Roshan-timeren ved siden af minikortet for at få et ekstra hint om, hvorvidt alles yndlingsboss over de neutrale kryb stadig er optaget af krystalskunk i Djævlegrotten, eller om han allerede er vendt tilbage til toppen.",
  "patch738_qol_feature_hud_timers_title": "HUD-timere",
  "patch738_qol_feature_hud_timers_description": "Før skulle du lede i hele banen for at se de forskellige Dota Plus-timere. Heldigvis kan du nu bare holde ALT nede for at se statussen på disse timere øverst på skærmen – du ved, hvis nu du får brug for at pinge tiden til dine allierede for at minde dem om at gøre <i>noget vigtigt</i>, før fjenden gør det.",
  "patch738_qol_feature_item_effects_title": "Målretningseffekter for genstande",
  "patch738_qol_feature_item_effects_description": "Vi har tilføjet en række visuelle effekter for genstande – fra Glimmer Cape til Lotus Orb og meget mere – for bedre at kommunikere, hvilken helt der er kilden til en genstands effekter.",
  "patch738_qol_feature_attributes_pips_title": "Visning af alle attributter",
  "patch738_qol_feature_attributes_pips_description": "Se hurtigt, hvilke attributter du har i talenttræet indtil videre.",
  "patch738_qol_feature_markforsell_title": "Sælg, når det er muligt",
  "patch738_qol_feature_markforsell_description": "Sæt en genstand til at blive solgt med det samme, når du er (i live) i din base eller i den hemmelige butik. Eller endnu bedre: Din kurér kender allerede ændringerne og tager markerede genstande tilbage til springvandet, når den foretager en levering.",
  "patch738_qol_feature_backpack_grace_title": "Tidsfrist for rygsækken",
  "patch738_qol_feature_backpack_grace_description": "En meget vigtig leverance af genstande midt i en holdkamp bør være et triumfens øjeblik, ikke et øjeblik, hvor man oplever, at ens hold dør ét sekund før, at rygsæknedkølingen nulstilles. I denne ambitiøse hensigt kan du nu trække nyerhvervede genstande ud af rygsækken uden de seks sekunders nedkøling og bruge dem med det samme.",
  "patch738_gameplayupdate_title": "Spilopdatering 7.38",
  "patch738_gameplayupdate_introduction": "Lad alle ændringerne i opdateringen nedenfor skylle ind over dig!",
  "patch738_qol_feature_item_effects_list_label": "Se liste",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence <br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Agh's Scepter<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}