// 7522.js

{
  "language": "russian",
  "patch738_website_subheader": "Обновление 7.38",
  "patch738_website_title": "Вольные воды",
  "patch738_website_introduction": "Отдайтесь воле течений, чтобы поскорее добраться до лёгкой линии. Возьмите судьбу в свои руки, создавая нейтральные предметы. С головой окунитесь в поток изменений и нововведений.",
  "patch738_map_title": "Дивный мокрый мир",
  "patch738_map_introduction": "Долгие годы речное русло посреди карты было всего лишь водянистым рубежом, разделявшим враждующие фракции Света и Тьмы. Но река наконец вышла из берегов, затопила холмы и навсегда изменила ход (и течение) битвы.",
  "patch738_map_majorchanges_river_title": "К новым высотам вниз по течению",
  "patch738_map_majorchanges_river_description": "Разлившаяся река не просто сделала леса более живописными. Стремительные ручьи ускорят вас на пути к лёгкой линии, однако не станут замедлять тех, кто пойдёт против течения.",
  "patch738_map_majorchanges_roshan_title": "Релокация Рошана",
  "patch738_map_majorchanges_roshan_description": "Логова Рошана переместились на реку и теперь располагаются неподалёку от рун усиления. В начале игры Рошан находится в своём нижнем пристанище, но, когда того потребует время суток, он прошествует из логова в логово, раскидывая в стороны всех, кто угодит ему под ноги.",
  "patch738_map_majorchanges_wisdom_title": "Просим к алтарю",
  "patch738_map_majorchanges_wisdom_description": "Руны мудрости изменили своё местоположение и стали алтарями мудрости. Вы всё ещё можете получить опыт для себя и союзника, но теперь надо будет не подобрать руну, а встать рядом с алтарём. «В чём подвох?» — спросите вы. А в том, что алтарь не сработает, если помимо вас на его территории окажется вражеский герой. Чтобы заработать опыт, сначала придётся заработать уединение.",
  "patch738_map_majorchanges_lotus_title": "Крови пруд пруди",
  "patch738_map_majorchanges_lotus_description": "Лотосы из прудов, как и опыт от новых алтарей, теперь даются стоящему рядом герою. Подошедшие враги прервут процесс, так что убедитесь, что в этот заплыв вы отправились в одиночку.",
  "patch738_map_majorchanges_creeps_title": "Скачок эволюции",
  "patch738_map_majorchanges_creeps_description": "Новыми течениями в лес занесло и новых крипов: в течение матча эти земноводные эволюционируют из головастиков в трясинников и даже в квакунов.",
  "patch738_map_majorchanges_otherchanges": "Изменения ландшафта",
  "patch738_map_majorchanges_moreinfo": "Ознакомиться со всеми правками карты вы сможете в полном списке изменений.",
  "patch738_map_majorchanges_tormentor_title": "Территориальные терзания",
  "patch738_map_majorchanges_tormentor_description": "Терзатели больше не появляются неподалёку от баз команд. Теперь Терзатель всего один, и в зависимости от времени суток он располагается в одном из двух незанятых углов карты — всегда на стороне, противоположной текущему логову Рошана. Вдобавок к этим и многим другим изменениям Терзатель получил способность, которая создаёт полезную исцеляющую поляну на месте его смерти.",
  "patch738_neutrals_title": "Направляйте потоки силы",
  "patch738_neutrals_introduction": "Представляем безумруды — новый ресурс, который позволяет создавать нейтральные предметы, соответствующие вашему стилю игры и обстоятельствам.",
  "patch738_neutrals_lumber_title": "Безумрудные прииски",
  "patch738_neutrals_lumber_description": "Первый шаг к получению уникальных нейтральных предметов — полностью зачистить лагерь нейтральных крипов. За это вы получите безумруды: два для себя и один для случайного союзника.",
  "patch738_neutrals_crafting_title": "Артефакты и чары",
  "patch738_neutrals_crafting_description": "Второй шаг — накопить достаточно безумрудов, чтобы создать нейтральный предмет. Каждый из них состоит из двух частей: артефакта, дающего предмету способности, и чар, наделяющих его пассивными бонусами к атрибутам и прочим характеристикам.",
  "patch738_neutrals_timings_title": "Кто что создал",
  "patch738_neutrals_timings_description": "Артефакты и чары делятся на пять разрядов, каждый из которых доступен в определённое время игры. Следите за прогрессом своих союзников и помогайте зачищать лагеря, чтобы никто не ушёл обиженным.",
  "patch738_neutrals_tab_title": "Не отходя от лавки",
  "patch738_neutrals_tab_description": "Преобразилась и вкладка нейтральных предметов в лавке: игроки увидят там все комбинации артефактов и чар, а зрители — перечень предметов, созданных каждым героем.",
  "patch738_neutrals_changes_moreinfo": "Ознакомиться со всеми правками, касающимися нейтральных предметов, можно в полном списке изменений.",
  "patch738_heroes_title": "Изменения героев",
  "patch738_qol_title": "Игровые удобства",
  "patch738_qol_introduction": "Погрузитесь в море изменений и улучшений игрового процесса и механик.",
  "patch738_qol_feature_roshan_timer_title": "Таймер Рошана",
  "patch738_qol_feature_roshan_timer_description": "Наведя курсор на таймер Рошана рядом с мини-картой, вы получите подсказку о том, чем сейчас занят всеми обожаемый босс нейтральных крипов: питает поросль птичьего листа своим бездыханным телом или уже ждёт вас на поверхности.",
  "patch738_qol_feature_hud_timers_title": "Таймеры в интерфейсе",
  "patch738_qol_feature_hud_timers_description": "Раньше, чтобы увидеть различные таймеры от Dota Plus, вам приходилось обшаривать взглядом всю карту. К счастью, теперь вы можете просто зажать Alt и увидеть все таймеры вверху экрана, что поможет вам напомнить команде об <i>очень важных событиях</i> и опередить оппонентов.",
  "patch738_qol_feature_item_effects_title": "Эффекты применения направленных предметов",
  "patch738_qol_feature_item_effects_description": "Мы добавили в игру различные визуальные эффекты, которые помогут вам уследить за тем, кто именно применил Glimmer Cape, Lotus Orb и многие другие предметы.",
  "patch738_qol_feature_attributes_pips_title": "Бонусы ко всем атрибутам",
  "patch738_qol_feature_attributes_pips_description": "Теперь вы с первого взгляда на древо талантов поймёте, сколько очков умений потрачено на бонусы к атрибутам.",
  "patch738_qol_feature_markforsell_title": "Запрос на продажу",
  "patch738_qol_feature_markforsell_description": "Отмечайте предметы, которые вы хотите автоматически продать при попадании на базу (живыми!) или в потайную лавку. Курьер тоже в курсе последних изменений, так что он не только доставит вам новые предметы, но и отнесёт на базу те, что вы выставили на продажу.",
  "patch738_qol_feature_backpack_grace_title": "Поблажка для ранца",
  "patch738_qol_feature_backpack_grace_description": "Доставка ключевого предмета в разгар схватки должна стать моментом триумфа, а не моментом, когда ваша команда умирает за секунду до того, как перезарядится переложенная из ранца покупка. Чтобы избавить вас от таких досадных ситуаций, мы решили убрать шестисекундный период, который не позволял применять новоприобретённые предметы, сперва попавшие в ранец.",
  "patch738_gameplayupdate_title": "Список изменений в версии 7.38",
  "patch738_gameplayupdate_introduction": "Впитайте в себя обновление во всех его подробностях!",
  "patch738_qol_feature_item_effects_list_label": "Полный список",
  "patch738_qol_feature_item_effects_list_col1": "Force Staff<br>Glimmer Cape<br>Lotus Orb<br>Orchid Malevolence<br>Diffusal Blade<br>Bloodthorn<br>Eul's Scepter of Divinity<br>Disperser<br>Scythe of Vyse<br>Wind Waker<br>Bottle<br>Healing Lotus<br>Heaven's Halberd<br>Solar Crest<br>Pavise<br>Hurricane Pike",
  "patch738_qol_feature_item_effects_list_col2": "Healing Salve<br>Tango<br>Clarity<br>Mango<br>Observer Ward<br>Sentry Ward<br>Alchemist Agh's Scepter<br>Moon Shard<br>Linken's Sphere<br>Helm of the Dominator<br>Helm of the Overlord<br>Shadow Amulet<br>Mjollnir"
}