// 1336.js

{
  "language": "romanian",
  "springcleaning22_desc": "Actualizarea curățeniei de primăvară 2022 a sosit și vine cu o mulțime de remedieri de erori și o serie de îmbunătățiri generale. Consultă câteva dintre cele mai ample modificări, precum îmbunătățirile pentru ferestrele cu informații despre Aghanim, comenzile de amuțire, funcția de căutare aferentă magazinului și modul demo pentru eroi, iar ulterior parcurge lista completă cu remedierile și modificările aduse mecanicilor de joc de mai jos.",
  "springcleaning22_aghs_tooltips": "Ferestrele cu informații despre Aghanim's Scepter și Shard",
  "springcleaning22_aghs_tooltips_desc": "Atât mecanismele interioare ale gândirii lui Aghanim, cât și monologurile sale sunt, fără îndoială, dincolo de înțelegerea muritorilor, însă, cu actualizarea de astăzi, impactul de pe câmpul de luptă al magnificelor sale Scepters și Shards a fost dezvăluit într-un mod fără precedent. Ferestrele cu informații pentru îmbunătățirile oferite de obiectele lui Aghanim conțin acum mai multe informații despre valorile care se schimbă atunci când un erou echipează unul dintre aceste obiecte, iar abilitățile modificate conțin, de asemenea, aceste informații într-o secțiune dedicată. O mare parte dintre descrierile aferente îmbunătățirilor au fost reelaborate pentru ca acestea să poată fi înțelese mai ușor de către mințile muritorilor.",
  "springcleaning22_muting_ui": "Îmbunătățiri pentru funcția de amuțire",
  "springcleaning22_muting_ui_desc": "Jucătorii de Dota sunt extrem de expresivi și, uneori, aceștia dau frâu liber sentimentelor care apar în timpul momentelor tensionate din cadrul meciurilor. În cazul în care comportamentul acestora devine perturbator, este important să ai la dispoziție modalități simple și rapide de amuțire a jucătorilor în cauză și raportare a acestora, astfel încât situația să poată fi investigată, iar experiența ta să nu mai fie perturbată. În acest scop, acum vei putea printr-un simplu clic să amuțești comunicarea vocală și cea de tip text pentru un anumit jucător, dar și să îl raportezi. De asemenea, cu ajutorul clicului drept vei putea amuți individual comunicarea vocală sau cea de tip text, în mod individual, pentru situațiile în care comportamentul unui jucător nu este perturbator, dar nu consideri utilă comunicarea cu acesta. Pentru un control mai facil, acum există și butoane care îți permit să amuțești o întreagă echipă cu un simplu clic.\\n\\nDe asemenea, profităm de această oportunitate pentru a reevalua modul în care gestionăm raportările de comunicare. Obiectivul nostru este acela de a facilita modul în care poți amuți jucătorii cu un comportament perturbator, dar și să obținem o indicație clară despre jucătorii asupra cărora trebuie să luăm măsuri.",
  "springcleaning22_demo_hero": "Îmbunătățiri pentru modul demo aferent eroilor",
  "springcleaning22_demo_hero_desc": "Dorești să încerci cele mai noi strategii sau chiar să concepi unele proprii? Sau poate simți nevoia de a afla câte încarnări ale lui Axe pot fi ucise de o singură lovitură a abilității Tidebringer? În orice caz, ai noroc! Modul demo pentru eroi a fost actualizat și a primit noi funcții:",
  "springcleaning22_demo_hero_map": "Secțiunea de nord a hărții demo a fost extinsă și oferă acum mai mult teren plat pe care-l poți folosi în timpul testării.",
  "springcleaning22_demo_hero_hero_spawn": "Au fost adăugate comenzi care permit crearea rapidă a unor eroi aliați, pe lângă cei inamici.",
  "springcleaning22_demo_hero_hero_reset": "A fost adăugată o comandă care permite resetarea la nivelul 1 a unui erou.",
  "springcleaning22_demo_hero_hero_remove": "A fost adăugată o comandă care permite eliminarea unui erou de care nu mai ai nevoie.",
  "springcleaning22_demo_hero_hero_select": "Atunci când vei crea un erou, acesta va fi adăugat în selecția ta curentă.",
  "springcleaning22_demo_hero_levelling": "Butoanele pentru creșterea în nivel, adăugarea obiectelor de tip Scepter și Shard, dar și pentru comutarea invulnerabilității aplică acum modificările tuturor eroilor selectați.",
  "springcleaning22_demo_creep_toggle": "Dezactivarea creepilor va determina distrugerea tuturor creepilor de lane existenți.",
  "springcleaning22_demo_creep_spawn": "A fost adăugat un buton care permite crearea unui singur val de creepi pe fiecare parte.",
  "springcleaning22_demo_hero_runes": "Au fost adăugate butoane care permit crearea celor 6 rune principale.",
  "springcleaning22_shop_search": "Funcția de căutare a magazinului a fost actualizată",
  "springcleaning22_shop_search_desc": "Cheltuirea de aur ar trebui să fie facilă, distractivă și, cel mai important, eficientă. Așadar, pentru a îmbunătății rezultatele returnate de o căutare, am extins funcționalitatea de căutare a magazinului, astfel încât aceasta să interpreteze mai bine cuvintele cheie introduse. De asemenea, rezultate evidențiază acum atributele căutate. De exemplu, poți căuta termeni precum „Armură”, „Strength”, „De distanță” etc. pentru a evidenția atributele care te interesează. Acum este mai ușor ca niciodată să alegi obiectul ideal pentru un plan perfect. Tot de ce ai nevoie acum este niște aur.",
  "springcleaning22_item_tooltips": "Ferestre cu informații mai detaliate",
  "springcleaning22_item_tooltips_desc": "Întâmpini dificultăți în a memora câtă mana îți oferă atributul de tip intelligence? Sau câtă armură îți oferă agility? Nu-ți mai bate capul, acum poți menține apăsată tasta ALT cât timp analizezi ferestrele cu informații aferente obiectelor pentru a afișa aceste proprietăți cu toate componentele lor.",
  "springcleaning22_colored_ability_damage": "Culori pentru daunele abilităților",
  "springcleaning22_colored_ability_damage_desc": "Pentru a putea face alegeri bune în lupte, trebuie să cunoști provocările cu care te vei confrunta. Pentru a-ți facilita identificarea pericolelor potențiale, daunele cauzate de vrăji și obiecte sunt acum colorate în funcție de tipul de daune: fizice, magice sau pure.",
  "springcleaning22_pluralized_strings": "O mai bună implementare a stringurilor cu forme de plural",
  "springcleaning22_pluralized_strings_desc": "Întrucât fiecare limbă are propriile reguli atunci când vine vorba de formele de plural, am adăugat câteva caracteristici care să permită implementarea acestor reguli pentru mai multe limbi și am actualizat peste 400 de linii de text în concordanță cu aceste modificări.",
  "springcleaning22_permanent_debuffs": "Efecte pozitive permanente",
  "springcleaning22_permanent_debuffs_desc": "Realizarea unei strategii poate fi destul de dificilă dacă nu ai o imagine de ansamblu asupra eficacității acțiunilor tale. Pentru a-ți pune la dispoziție mai multe informații după finalul unui meci, uciderile realizate de abilitatea Reaper's Scythe a lui Necrophos sau abilitatea Culling Blade a lui Axe vor fi afișate acum în ecranul de la finalul meciului.",
  "springcleaning22_post_game_sortable": "Sortarea informațiilor aferente rezumatului meciului",
  "springcleaning22_post_game_sortable_desc": "Vrei să afli mai multe despre elementele care stau la baza victoriilor tale? Tabela de scor de la finalul meciului poate fi acum sortată pentru a facilita analizele.",
  "springcleaning22_gameplay_tp_boots": "Boots of Travel vor selecta un creep mai rar atunci când sunt folosite în raza de acțiune a unui turn.",
  "springcleaning22_gameplay_sellback": "Jucătorii pot vinde acum un obiect la prețul întreg în primele 30 de secunde de la începerea meciului. Anterior, jucătorii aveau la dispoziție un interval de 10 secunde de la achiziție pentru a vinde obiectul la prețul întreg.",
  "springcleaning22_gameplay_lifestealer_consume": "Abilitatea Consume a lui Lifestealer utilizează acum aceeași tastă rapidă ca Infest, indiferent de tipul unității infestate.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Ogre Bruiser are acum efecte sonore pentru animația de la începutul atacului și năucire.",
  "springcleaning22_gameplay_neutral_aura_radius": "Raza de acțiune a tuturor aurelor aferente creepilor neutri este acum afișată dacă plasezi cursorul deasupra acestora.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Wraith Band, Null Talisman și Bracer au acum bonusurile de atribute din fereastra cu informații actualizate atunci când acestea se dublează după atingerea minutului 25.",
  "springcleaning22_gameplay_heal_overhead": "Au fost remediate situațiile în care valorile de vindecare afișate nu țineau cont de amplificarea efectelor de vindecare.",
  "springcleaning22_gameplay_fountain_invuln": "Jucătorii care se află sub efectul de invulnerabilitate al fântânii nu vor mai ataca automat inamicii din raza acestora de acțiune, astfel încât efectul pozitiv va rămâne activ.",
  "springcleaning22_gameplay_blink_range": "Indicatorul de distanță al abilității aferente obiectului Blink Dagger ține acum cont de efectele care măresc distanța de invocare.",
  "springcleaning22_gameplay_desolator_tooltip": "A fost clarificată descrierea abilității pasive Soul Stealer a obiectului Desolator. Daunele de atac ale obiectului Desolator cresc de fiecare dată când un inamic care este afectat de efectul abilității Corruption moare.",
  "springcleaning22_gameplay_ardm_stash": "A fost remediată o eroare din modul „Deathmatch aleator” din cauza căreia atunci când un curier returna un obiect în depozitul unui jucător mort, obiectul dispărea.",
  "springcleaning22_gameplay_neutral_items_lock": "Jucătorii nu mai au disponibilă opțiunea care prevenea combinarea obiectelor neutre. Această modificare remediază o eroare din cauza căreia curierii nu puteau livra obiectele care erau marcate pentru a nu fi combinate.",
  "springcleaning22_gameplay_illusion_modifiers": "A fost remediată o eroare din cauza căreia iluziile cu modificatori duplicați ar avea durate incorecte și care permitea astfel identificarea cu ușurință a eroului real.",
  "springcleaning22_gameplay_turbo_gold_scaling": "A fost remediată o eroare din modul Turbo și cel pentru jucătorii noi din cauza căreia anumite surse de aur nu utilizau valorile corespunzătoare.",
  "springcleaning22_gameplay_turbo_courier": "A fost remediată o eroare din modul Turbo din cauza căreia curierul unui jucător nu mai putea fi folosit dacă jucătorul se deconecta în timpul perioadei de selectare a eroului sau perioadei de planificare.",
  "springcleaning22_gameplay_zero_tooltips": "A fost remediată o eroare din cauza căreia ferestrele cu informații din joc ale căror valori erau modificate de talente afișau 0 în locul valorii corecte.",
  "springcleaning22_gameplay_euls_invulnerable": "Abilitatea obiectului Eul's Scepter of Divinity va aplica în mod corect efectul său clonelor atunci când este utilizată asupra clonelor imune la magie, în loc să treacă doar în repaus.",
  "springcleaning22_gameplay_kobold_aura": "Abilitatea Prospecting Aura a Koboldului nu mai funcționează pe creepi eroici (de exemplu, ursul lui Lone Druid), remediind astfel o eroare din cauza căreia efectul era dublat.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Clonele, inclusiv cele ale abilității Tempest Double, primesc acum în mod corect bonusurile de atribute ale obiectului Aghanim's Scepter acordat de Alchimist.",
  "springcleaning22_gameplay_chen_hand_of_god": "Abilitatea Hand of God a lui Chen aplică acum corect vindecarea pe secundă creepilor controlați de acesta, în loc să aplice doar vindecarea inițială.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Penalizarea pentru daunele de atac ale clonei lui Arc Warden creată de abilitatea Tempest Double ține acum cont de reîncarnarea lui Arc Warden.",
  "springcleaning22_gameplay_arc_warden_basher": "A fost adăugată o descriere care specifică faptul că atât clonele normale, cât și cele create de Tempest Double, nu pot activa abilitatea Bash a obiectelor Skull Basher și Abyssal Blade.",
  "springcleaning22_gameplay_arc_warden_blink": "Obiectul Blink Dagger nu mai este supus repausului atunci când abilitatea Tempest Double a lui Arc Warden este utilizată.",
  "springcleaning22_gameplay_arc_warden_wards": "Tempest Double-ul lui Arc Warden nu mai poate primi warduri împărtășite.",
  "springcleaning22_gameplay_pa_scepter_double": "Îmbunătățirea oferită de Aghanim's Scepter lui Phantom Assassin nu mai reîmprospătează abilitatea Blur atunci când Phantom Assassin ucide un Tempest Double.",
  "springcleaning22_gameplay_naga_siren_riptide": "Talentul lui Naga Siren care trebuia să reducă numărul de lovituri necesare cu 1 pentru activarea abilității Rip Tide reduce acum corect numărul de lovituri necesare cu 1, ci nu cu 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Bonusul de daune aferent abilității Duel a lui Legion Commander este acordat acum chiar dacă câștigătorul este invulnerabil.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Abilitatea Walrus Kick a lui Tusk are acum repausul corect, cel de 12 secunde.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Abilitatea Metamorphosis a lui Terrorblade are acum durata corectă de 35/40/45/50 de secunde.",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey King nu mai poate scăpa din Arena of Blood cu ajutorul abilității Tree Dance.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "În modul Ability Draft, efectele abilității Rip Tide a lui Naga Siren vor fi reproduse pe eroul corect în loc să fie reproduse de fiecare dată pe Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki poate invoca acum Smoke Screen cât timp utilizează Tricks of the Trade, fără ca abilitatea Tricks of the Trade să fie întreruptă, chiar dacă opțiunea „Abilitățile concentrate necesită menținere/stop” este activată.",
  "springcleaning22_gameplay_marci_dispose_lotus": "A fost remediată interacțiunea abilității Dispose a lui Marci cu obiectele Black King Bar și Lotus Orb.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Abilitatea Concussive Grenade a lui Sniper adaugă acum o pictogramă de dezarmare deasupra victimei.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling nu mai păstrează permanent abilitatea pasivă Spirit Link atunci când acesta se transformă în Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "A fost adăugată o pictogramă de concentrare care lipsea pentru abilitatea Fiend's Gate a lui Underlord.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "A fost adăugată o descriere care lipsea pentru efectul negativ al abilității Icefire Bomb.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Efectele de particule aferente abilității Cursed Crown a lui Dark Willow sunt acum sincronizate corect în cazul în care Dark Willow are echipat obiectul Aghanim's Shard.",
  "springcleaning22_gameplay_lone_druid_midas": "Utilizarea obiectului Hand of Midas pe Spirit Bearul lui Lone Druid oferă acum experiență eroului care controlează unitatea.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear și Tempest Double-urile pot obține acum încărcături pentru Magic Stick, Magic Wand și Holy Locket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Descrierea aferentă abilității Astral Step a lui Void Spirit afișează acum corect valorile amplificării pentru vrăji atunci când este apăsată tasta ALT.",
  "springcleaning22_gameplay_heavenly_jump_range": "Abilitatea Heavenly Jump a lui Zeus afișează acum raza de acțiune atunci când amplasezi cursorul pe aceasta.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Au fost remediate descrierile abilității Arcane Aura a lui Crystal Maiden.",
  "springcleaning22_gameplay_hex_tooltip": "A fost remediat faptul că descrierea abilității Hex a lui Shadow Shaman adăuga în mod eronat o secundă la durata abilității în cazul în care talentul „Hex Breaks” era selectat.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "A fost remediat faptul că talentul de la nivelul 20 al lui Abaddon nu actualiza repausul abilității Borrowed Time menționat în descrierea acesteia.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "A fost remediat faptul că abilitatea Presence of the Dark Lord a lui Shadow Fiend nu era aplicată corect asupra creepilor neutri.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "A fost remediat faptul că abilitatea Warp Flare a lui Tinker funcționa pe Roshan.",
  "springcleaning22_gameplay_ability_draft_wukong": "În modul Ability Draft, clonele lui Wukong's Command au acum abilitățile corecte.",
  "springcleaning22_rubick_illusions": "A fost remediată o eroare din cauza căreia iluziile lui Rubick nu redau animațiile corecte ale vrăjilor furate (de exemplu, abilitatea Fiend's Grip a lui Bane îmbunătățită de Aghanim's Scepter).",
  "springcleaning22_rubick_hunter_in_the_night": "Abilitatea Hunter in the Night poate fi furată acum dacă este îmbunătățită de Aghanim's Shard.",
  "springcleaning22_rubick_juxtapose": "Abilitatea Juxtapose poate fi acum furată dacă este îmbunătățită de Aghanim's Scepter.",
  "springcleaning22_rubick_fireball": "Abilitatea Fireball a lui Dragon Knight poate fi furată acum indiferent de Dragon Form, iar aceasta nu este acordată automat.",
  "springcleaning22_rubick_wolf_bite": "Abilitatea Wolf Bite funcționează acum dacă este furată.",
  "springcleaning22_rubick_depth_shroud": "Abilitatea Depth Shroud funcționează acum dacă este furată.",
  "springcleaning22_rubick_astral_spirit": "A fost eliminată posibilitatea de a mișca separat Astral Spiritul dacă abilitatea a fost furată. Rubick poate păstra acum ambele sloturi de vrăji atunci când fură abilitatea aceasta.",
  "springcleaning22_rubick_reverse_time_walk": "Abilitatea Reverse Time Walk ocupă acum același slot de abilitate ca Time Walk dacă Rubick are Aghanim's Shard. Rubick poate păstra acum ambele sloturi de vrăji atunci când fură abilitatea aceasta.",
  "springcleaning22_rubick_jaunt": "Abilitatea Ethereal Jaunt ocupă acum același slot de abilitate ca Illusory Orb. Rubick poate păstra acum ambele sloturi de vrăji atunci când fură abilitatea aceasta.",
  "springcleaning22_rubick_eject": "Abilitatea Eject ocupă acum același slot de abilitate ca Dismember dacă Rubick are Aghanim's Shard. Rubick poate păstra acum ambele sloturi de vrăji atunci când fură abilitatea aceasta.",
  "springcleaning22_rubick_dismember": "Abilitatea Dismember scoate acum din corp eroul aliat dacă o altă vrajă este furată în locul acesteia.",
  "springcleaning22_rubick_spit_out": "Abilitatea Spit Out ocupă acum același slot de abilitate ca Gobble Up. Rubick poate păstra acum ambele sloturi de vrăji atunci când fură abilitatea aceasta.",
  "springcleaning22_rubick_decoy": "Atunci când Rubick fură abilitatea Decoy, acesta nu mai fură și abilitatea Bushwhack. Când este invocată abilitatea Decoy, aceasta aplică în continuare efectul abilității Bushwhack.",
  "springcleaning22_rubick_spirits": "Furtul abilității Spirits a lui Io funcționează acum corect după obținerea unui Aghanim's Scepter.",
  "springcleaning22_rubick_gravekeepers_cloak": "Abilitatea Gravekeeper's Cloak poate fi acum furată dacă este îmbunătățită de Aghanim's Shard.",
  "springcleaning22_rubick_shard_cursed_crown": "Dacă Rubick are Aghanim's Shard, Cursed Crown va crea acum și Brambles.",
  "springcleaning22_rubick_shard_venomous_gale": "Dacă Rubick are Aghanim's Shard, Venomous Gale va crea acum și Plague Wards.",
  "springcleaning22_rubick_shard_sprout": "Dacă Rubick are Aghanim's Shard, Sprout va crea acum și Treants.",
  "springcleaning22_rubick_shard_shackles": "Dacă Rubick are Aghanim's Shard, Shackles va crea acum și Serpent Wards.",
  "springcleaning22_rubick_shard_cold_embrace": "Dacă Rubick are Aghanim's Shard, Cold Embrace va emana acum și un Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "Dacă Rubick are Aghanim's Shard, Earthshock va aplica și efectul abilității Enrage.",
  "springcleaning22_rubick_shard_shadow_step": "Dacă Rubick are Aghanim's Scepter, Shadow Step va aplica și efectul abilității Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "Dacă Rubick are Aghanim's Scepter, Terror Wave va aplica și efectul abilității Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "Dacă Rubick are Aghanim's Shard, Homing Missile va include și abilitatea Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Dacă Rubick are Aghanim's Shard, Slithereen Crush va aplica și Corrosive Haze.",
  "springcleaning22_rubick_scepter_flak_cannon": "Dacă Rubick are Aghanim's Scepter, Flak Cannon va include și efectele pasive Side Gunner.",
  "springcleaning22_rubick_scepter_time_walk": "Dacă Rubick are Aghanim's Scepter, Time Walk va aplica și Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Dacă Rubick are Aghanim's Scepter, Shuriken Toss va aplica și Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Dacă Rubick are Aghanim's Scepter, Sacred Arrow va aplica și Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "Modul în care funcționează invocarea rapidă pentru abilitățile cu țintire vectorială la apăsarea tastei specifice abilității a fost modificat. Astfel, acum trebuie să menții apăsată tasta asociată abilității pentru a începe trasarea vectorului și să o eliberezi când termini. Acesta este același comportament utilizat și de invocarea rapidă la eliberarea tastei specifice abilității.",
  "springcleaning22_ui_ward_bounty": "Când un Observer Ward este distrus, în partea din stânga va fi afișată acum unitatea care primește recompensa dacă aceasta este diferită de cea care a distrus Observer Wardul.",
  "springcleaning22_ui_spectator_hud_player_view": "Interfața pentru spectatori afișează acum corect informațiile jucătorului pe care-l urmărești.",
  "springcleaning22_ui_post_game_scepter_shard": "Descrierile pentru Aghanim's Scepter și Shard afișează acum efectele acestora în tabela de scor de la finalul meciului.",
  "springcleaning22_ui_post_game_backpack_neutral": "Rucsacul și obiectele neutre sunt afișate acum în secțiunea cu detaliile eroului de la finalul meciului.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Valorile furtului de viață aferent vrăjilor pentru eroi și creepi sunt afișate acum separat dacă menții apăsată tasta ALT.",
  "springcleaning22_ui_skeleton_warrior_rally": "Aura abilității Rally a Skeleton Warriorului este înregistrată acum de un singur contor de efect pozitiv în locul mai multor pictograme individuale de efect pozitiv.",
  "springcleaning22_ui_neutral_item_teleport": "A fost remediat faptul că dacă schimbai obiectele neutre și teleportai unul prea rapid, era posibil să fie teleportat un alt obiect.",
  "springcleaning22_ui_spectator_arcana": "Interfețele aferente obiectelor Arcana nu vor mai fi afișate în meciurile de ligă în modul spectator.",
  "springcleaning22_ui_ready_check_enter": "Acum poți apăsa tasta ENTER pentru a confirma că ești gata.",
  "springcleaning22_ui_alt_item_combine": "Obiectele din meniul de cumpărare rapidă vor indica obiectul care se poate obține prin combinarea acestora, dacă menții apăsată tasta ALT.",
  "springcleaning22_ui_alt_items_ready": "Dacă menții apăsate tastele CTRL + ALT cât timp faci clic pe unul dintre următoarele obiecte, îți vei informa echipa cu privire la faptul că obiectele sunt gata de folosire, în loc să soliciți membrilor echipei să se adune: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight și Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Numărul afișat de Sentry Warduri ce pot fi deținute în timpul perioadei de planificare a fost mărit de la 2 la 3. Un număr de maximum 3 Sentry Warduri pot fi achiziționate la începutul meciului.",
  "springcleaning22_ui_guide_pregame": "După ce selectezi un erou, secțiunea cu obiecte recomandate va afișa acum prima secțiune a unui ghid dacă acesta nu are secțiuni denumite „Obiecte de început”.",
  "springcleaning22_ui_ward_planter": "Wardurile pot fi acum selectate de către jucătorii aliați, spectatori și antrenorii aliați pentru a vedea cine le-a amplasat.",
  "springcleaning22_ui_courier_home_button": "Butonul „Magazinul principal” al curierului va returna acum în depozit orice obiect pe care acesta îl are atunci când ajunge în bază.",
  "springcleaning22_ui_combat_log_key": "Jurnalul de luptă poate fi asociat acum unei taste prin intermediul opțiunilor.",
  "springcleaning22_ui_combat_log_right_align": "Jurnalul de luptă este acum aliniat la dreapta, astfel încât nu se mai suprapune peste comenzile aferente modului demo pentru eroi.",
  "springcleaning22_ui_combat_log_hud_flip": "Jurnalul de luptă are acum în vedere inversarea elementelor interfeței (miniharta în partea dreaptă) și va fi afișat în partea stângă în cazul în care opțiunea de inversare este activată.",
  "springcleaning22_ui_guide_apos": "A fost remediat faptul că atunci când comentariile unui ghid despre obiecte/abilități conțineau apostrofuri, acestea erau înlocuite cu „&apos;” și alte simboluri HTML atunci când erau salvate. Ghidurile care au fost deja salvate și prezintă această problemă vor trebui actualizate manual.",
  "springcleaning22_ui_vs_screen_widescreen": "A fost ajustată prezentarea eroilor din ecranul versus pentru raportul de aspect 21:9 și monitoarele mai late.",
  "springcleaning22_ui_charms": "A fost remediată o eroare din cauza căreia textul din cadrul interfeței talismanelor era suprapus dacă dețineai mai mult de 2 talismane.",
  "springcleaning22_ui_last_hit_trainer_spawn": "S-a remediat o eroare din modul „Antrenament pentru lovitura finală” din cauza căreia, dacă făceai clic pe Start înainte ca eroul tău să apară în joc, creepii nu mai apăreau.",
  "springcleaning22_ui_intro_scenes": "Secvențele introductive (precum cele de prezentare ale eroilor, obiectelor Arcana/Persona) nu vor mai fi afișate jucătorilor care nu au parcurs încă „Ghidul pentru jucătorii noi”.",
  "springcleaning22_cosmetics_illusion_skins": "A fost remediată o eroare din cauza căreia era posibil ca iluziile să nu moștenească în mod corect aspectele anumitor modele de accesorii.",
  "springcleaning22_cosmetics_cloth_stretch": "A fost remediată o eroare din cauza căreia țesătura anumitor modele începea să se întindă pe tot ecranul.",
  "springcleaning22_cosmetics_underlord_immortal": "Obiectul Immortal al lui Underlord, Emerald Subjugation, are acum efecte vizuale personalizate care le înlocuiesc pe cele ale ultimatei.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Obiectul Immortal al lui Shadow Demon, Mantle of Grim Facade, are acum efectele de proiectil orientate corect pentru abilitatea Shadow Poison.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Obiectul Immortal al lui Wraith King, Blistering Shade, are prioritate față de obiectul Arcana atunci când este invocată abilitatea Wraithfire Blast.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Obiectul Immortal al lui Earthshaker, Bracers of the Cavern Luminar, are acum efectele ambientale remediate.",
  "springcleaning22_cosmetics_warlock_immortal": "Obiectul Immortal al lui Warlock, Umbral Glyph, are acum efectele abilității Shadow Word remediate (efectul pozitiv și cel negativ).",
  "springcleaning22_cosmetics_viper_immortal": "Obiectul Immortal al lui Viper, Malefic Drake's Strike, are acum particulele pentru zona de efect remediate pentru abilitatea Nethertoxin.",
  "springcleaning22_cosmetics_abaddon_vessel": "Efectele vizuale ale obiectului Blade of the Demonic Vessel al lui Abaddon aferente abilității Aphotic Shield au fost restabilite.",
  "springcleaning22_cosmetics_tidehunder_belt": "Au fost eliminate particulele incorecte care erau asociate centurii și care în mod normal trebuiau să fie pe braț pentru obiectul Horror From the Deep Belt al lui Tidehunter.",
  "springcleaning22_cosmetics_faceless_incursion": "Arma lui Faceless Void, Claszureme Incursion, are acum efectele ambientale remediate.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Obiectul Arcana al lui Drow Ranger are acum pentru aura abilității Marksmanship efecte vizuale personalizate pentru ambele stiluri.",
  "springcleaning22_cosmetics_rubick_dilemma": "Efectele ambientale ale obiectului Torch of Fantoccini's Dilemma al lui Rubick au fost restabilite.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Techies redau acum la viteza corectă animația alergării aferentă stării de rănire pentru obiectul Arcana.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Culoarea nestematelor prismatice va fi reflectată acum de abilitățile Sticky Bomb și Reactive Tazer în cazul în care Techies au echipat un obiect Arcana cu astfel de nestemate.",
  "springcleaning22_cosmetics_techies_icons": "Au fost adăugate pictogramele care lipseau pentru următoarele seturi de obiecte pentru Techies: Powdersled Rookery, Sapper's Guile, Bombtrails and Boomsticks și March of the Powderkeg Patrol.",
  "springcleaning22_cosmetics_techies_wagon_spoon": "A fost remediată animația lui Spoon (Techies) pentru previzualizarea teleportării în cazul setului de obiecte Pachyderm Powderwagon.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Obiectul Arcana al lui Rubick are acum efectele vizuale personalizate ale abilității Sticky Bomb (Techies) în locul abilității Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Animația de incapacitate a Snapfire a fost remediată, astfel încât aceasta nu mai rămâne blocată într-o secvență de animația incorectă.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Pachetul de obiecte Radiant Conqueror și obiectele acestuia pot fi acum comercializate și oferite la schimb.",
  "springcleaning22_cosmetics_legion_commander_wind": "Au fost adăugate efecte de vânt pentru stindardele aferente seturilor de obiecte Legacy of the Fallen Legion și Radiant Conqueror ale eroinei Legion Commander care sunt redate indiferent dacă armele Arcana sunt echipate sau nu.",
  "springcleaning22_perf_panorama_atlas": "Motorul interfeței Panorama a fost actualizat pentru a utiliza funcția de „atlassing”, astfel încât să poată interacționa mai eficient cu procesorul grafic. În urma testelor pe care le-am realizat, am observat atât o creștere a performanței procesorului grafic de 25-30% pentru elementele interfeței, cât și o creștere mult mai semnificativă a performanței pentru anumite pagini mai complexe ale panoului principal. De asemenea, această schimbare sporește și performanța unităților centrale de procesare pentru Vulkan, iar aceasta își demonstrează beneficiile în special în cazul calculatoarelor Apple echipate cu procesoare M1.",
  "springcleaning22_perf_sand_king_particles": "Efectele de particule pentru abilitatea Sand Storm au fost optimizate pentru a spori performanța.",
  "springcleaning22_perf_panorama_clears": "Motorul interfeței Panorama a fost actualizat pentru a evita eliminarea inutilă a unor ținte de randare, reducând astfel sarcina de lucru a procesorului grafic.",
  "springcleaning22_perf_scenesystem_threading": "A fost remediată o eroare din cauza căreia uneori foloseam mai puține fire de execuție decât numărul necesar pentru efectuarea sarcinilor care necesită mai multe fire de execuție. Această remediere este utilă în mod special pentru sistemele cu 4 sau mai puține nuclee.",
  "springcleaning22_perf_thread_affinity": "A fost remediată o eroare din cauza căreia, dacă afinitățile firelor de execuție erau setate incorect, acestea puteau bloca anumite sisteme.",
  "springcleaning22_perf_power_savings": "A fost adăugat un avertisment în fereastra de dialog a setărilor video pentru a indica faptul dacă sistemul rulează în modul de economisire a energie, caz în care modul poate determina o performanță scăzută.",
  "springcleaning22_perf_shop_tooltips": "A fost îmbunătățită performanța ferestrelor cu informații din cadrul magazinului cu obiecte.",
  "springcleaning22_custom_games_overview_sort": "În cadrul listei disponibile în vederea de ansamblu a filei Arcade poți realiza acum o sortare în funcție de numărul de jucători activi, nu doar în funcție de numărul de lobby-uri deschise.",
  "springcleaning22_custom_games_update": "A fost remediată o problemă din cauza căreia modurile de joc personalizate din cadrul Dota Arcade nu indicau uneori faptul că acestea necesită actualizarea, cu excepția cazului în care acestea erau reinstalate sau Steam era repornit.",
  "springcleaning22_custom_games_lobby_version": "Lista cu lobby-uri aferentă Dota Arcade nu va mai conține lobby-uri care nu corespund cu versiunea modului de joc personalizat pe care o ai în prezent instalată și lobby-uri la care nu te poți alătura.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold poate filtra acum aurul primit de la runele de Bounty.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "A fost realizată următoarea înlocuire de relicvă pentru Dazzle: „Patru inamici afectați de efectele negative Juju” –> „Daune și vindecări realizate cu Bad Juju”.",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "A fost realizată următoarea înlocuire de relicvă pentru Techies: „Ucideri cu Remote Mine” –> „Sticky Bomburi atașate eroilor”.",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "A fost realizată următoarea înlocuire de relicvă pentru Techies: „Năuciri cu Stasis Trap” –> „Dezarmarea mai multor eroi cu Reactive Tazer”.",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "A fost realizată următoarea înlocuire de relicvă pentru Tinker: „Daune cauzate cu March Of The Machines” –> „Daune absorbite cu Defense Matrix”.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "A fost realizată următoarea înlocuire de relicvă pentru Underlord: „Ucideri după utilizarea abilității Dark Rift” –> „Asistări realizate cu Fiend's Gate”.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "A fost realizată următoarea înlocuire de relicvă pentru Underlord: „Eroi salvați cu Dark Rift” –> „Daune bonus cauzate cu Atrophy Aura”.",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "A fost remediată următoarea relicvă pentru Omniknight: „Daune cauzate de aliați sub efectul Heavenly Grace”.",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "A fost remediată următoarea relicvă pentru Primal Beast: „Atacuri cu Onslaught asupra mai multor eroi”.",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "A fost realizată următoarea modificare a provocării de erou pentru Meepo: „Daune magice cauzate eroilor” –> „Daune pure cauzate eroilor”.",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "A fost realizată următoarea modificare a provocării de erou pentru Naga Siren: „Eroi vindecați cu Song of the Siren” –> „Daune cauzate eroilor cu ardere de mana”.",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "A fost realizată următoarea modificare a provocării de erou pentru Tinker: „Daune cauzate cu March Of The Machines” –> „Daune absorbite cu Defense Matrix”.",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "A fost realizată următoarea modificare a provocării de erou pentru Techies: „Ucideri cu Remote Mine” –> „Sticky Bomburi atașate”.",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "A fost realizată următoarea modificare a provocării de erou pentru Underlord: „Teleportări cu mai mulți eroi folosind Dark Rift” –> „Asistări realizate cu Fiend's Gate”.",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "A fost actualizată provocarea de erou pentru Grimstroke: „Daune cauzate inamicilor afectați de Soulbind” include acum și daunele aliaților.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "A fost actualizată provocarea de erou pentru Mirana: „Daune cauzate cu abilitatea Leap activă” include acum toate tipurile de daune, nu doar daunele fizice.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "A fost remediată următoarea provocare de erou pentru Bane: „Utilizări simultane de Blink / Force Staff și Fiend's Grip”.",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "A fost remediată următoarea provocare de erou pentru Dragon Knight: „Ucideri cu Dragon Form”.",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "A fost remediată următoarea provocare de erou pentru Drow Ranger: „Amuțește cel puțin 2 inamici cu Gust”.",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "A fost remediată următoarea provocare de erou pentru Crystal Maiden: „Creepi uciși cu Frostbite”.",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "A fost remediată următoarea provocare de erou pentru Dark Seer: „Daune cauzate cu abilitatea Surge activă”.",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "A fost remediată următoarea provocare de erou pentru Lifestealer: „Daune cauzate cu abilitatea Rage activă”.",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "A fost remediată următoarea provocare de erou pentru Lone Druid: „Daune cauzate cu abilitatea True Form activă”.",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "A fost remediată următoarea provocare de erou pentru Mars: „Daune cauzate eroilor inamici”.",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "A fost remediată următoarea provocare de erou pentru Mars: „Ucide unități inamice cu cleave”.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "A fost remediată următoarea provocare de erou pentru Omniknight: „Daune cauzate cu abilitatea Heavenly Grace activă”.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "A fost remediată următoarea provocare de erou pentru Omniknight: „Aplică efectul abilității Heavenly Grace pe aliați timp de X secunde”.",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "A fost remediată următoarea provocare de erou pentru Rubick: „Năuciri a mai multor eroi cu Telekinesis”.",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "A fost remediată următoarea provocare de erou pentru Tinker: „Daune cauzate eroilor cu abilitatea Laser îmbunătățită de Aghanim's Scepter”.",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "A fost remediată următoarea provocare de erou pentru Tusk: „Combinații de Walrus Punch! și Walrus Kick”.",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "A fost eliminată următoarea provocare de erou pentru Venomancer: „Daune cauzate eroilor afectați de obiectul Silver Edge”.",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "A fost eliminată următoarea provocare de erou pentru Tinker: „Creepi uciși cu March of the Machines”.",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "A fost adăugată următoarea provocare de erou pentru Underlord: „Daune cauzate eroilor cu abilitatea Firestorm”.",
  "springcleaning22_workshop_modeldoc": "Instrumentele atelierului Dota pentru obiecte și moduri de joc personalizate au fost îmbunătățite pentru a utiliza noul editor de modele „ModelDoc”. Creatorii de conținut din cadrul atelierului ar trebui să-și migreze orice model existent din vechiul instrument în noul instrument, întrucât vechiul instrument va fi eliminat în cadrul unei actualizări ulterioare."
}