// 346.js

{
  "language": "italian",
  "springcleaning22_desc": "L'aggiornamento delle pulizie di primavera 2022 è arrivato per correggere una montagna di bug e implementare una serie di miglioramenti alla qualità generale del gioco. Di seguito abbiamo raccolto alcune delle modifiche più importanti, tra cui i miglioramenti alle descrizioni dello Scettro e del Frammento di Aghanim, i comandi per disattivare le comunicazioni di un giocatore, la funzione di ricerca nel negozio e la modalità di prova degli Eroi. Inoltre, in fondo alla pagina abbiamo riportato una lista dettagliata di tutte le correzioni e le modifiche al gameplay.",
  "springcleaning22_aghs_tooltips": "Descrizioni dello Scettro e del Frammento di Aghanim",
  "springcleaning22_aghs_tooltips_desc": "È indubbio che le macchinazioni interiori della mente di Aghanim vadano ben oltre la comprensione dei mortali, ma l'aggiornamento di oggi ha rivelato come mai prima d'ora l'impatto del suo Scettro e del suo Frammento sul campo di battaglia. Ora le descrizioni dei miglioramenti di Aghanim includono maggiori dettagli su tutte le statistiche modificate. Queste stesse informazioni sono anche disponibili in una sezione dedicata nel pannello delle abilità interessate. Diversi miglioramenti hanno ricevuto un'attenzione speciale nel tentativo di renderli più semplici e immediati per le nostre menti inferiori.",
  "springcleaning22_muting_ui": "Nuove opzioni di silenziamento",
  "springcleaning22_muting_ui_desc": "I giocatori di Dota sanno essere persone molto vivaci che talvolta si fanno prendere dalle emozioni sbagliate quando entrano nel vivo della competizione. Nei casi in cui tali comportamenti risultino deleteri, è importante avere uno strumento facile e veloce per silenziare e segnalare i giocatori, cosicché la situazione possa essere sottoposta ad ulteriori controlli senza rovinare la tua partita. A questo proposito, ora è sufficiente un clic per segnalare un giocatore, disattivandone sia la chat testuale che la chat vocale. È anche possibile fare clic destro per disattivare in modo indipendente la chat testuale e vocale, laddove volessi interrompere le comunicazioni di un giocatore anche se il suo comportamento non è stato offensivo. Se cerchi una soluzione ancora più immediata, ora sono anche disponibili dei pulsanti per bloccare le comunicazioni di un'intera squadra con un clic.\\n\\nVogliamo approfittare di questa occasione per rivalutare il modo in cui gestiamo le segnalazioni di abuso delle comunicazioni. Il nostro obiettivo è facilitare e velocizzare la procedura di silenziamento dei giocatori, ma anche di avere un'indicazione chiara dei giocatori per cui è necessario intervenire in modo più incisivo.",
  "springcleaning22_demo_hero": "Modalità di prova migliorata",
  "springcleaning22_demo_hero_desc": "Ti serve un posto in cui provare le ultime strategie o crearne di nuove? O magari senti l'irrefrenabile bisogno di scoprire quante incarnazioni di Axe è possibile eliminare con un solo attacco di Portatrice della marea? In ogni caso, oggi è il tuo giorno fortunato! La modalità di prova degli Eroi è stata aggiornata con una serie di nuove funzionalità:",
  "springcleaning22_demo_hero_map": "La zona settentrionale della mappa è stata estesa per aumentare lo spazio di prova disponibile.",
  "springcleaning22_demo_hero_hero_spawn": "Sono stati aggiunti dei pulsanti per collocare gli Eroi alleati, oltre a quelli dedicati ai nemici.",
  "springcleaning22_demo_hero_hero_reset": "È stato aggiunto un pulsante per riportare un Eroe al livello 1.",
  "springcleaning22_demo_hero_hero_remove": "È stato aggiunto un pulsante per rimuovere un Eroe di cui non hai più bisogno.",
  "springcleaning22_demo_hero_hero_select": "Creare un nuovo Eroe lo aggiungerà alla tua selezione attuale.",
  "springcleaning22_demo_hero_levelling": "Ora i pulsanti per salire di livello, aggiungere lo Scettro o il Frammento di Aghanim e controllare l'invisibilità si applicano a tutti gli Eroi attualmente selezionati.",
  "springcleaning22_demo_creep_toggle": "Ora l'opzione per disattivare i creep rimuoverà tutti i creep già presenti nelle corsie.",
  "springcleaning22_demo_creep_spawn": "È stato aggiunto un pulsante per collocare una singola ondata di creep per ciascun lato.",
  "springcleaning22_demo_hero_runes": "Sono stati aggiunti dei pulsanti per far comparire le 6 Rune principali.",
  "springcleaning22_shop_search": "Aggiornamento della barra di ricerca",
  "springcleaning22_shop_search_desc": "Spendere il proprio oro dovrebbe essere un'attività facile, divertente e soprattutto efficace. Per aiutarti a far valere ogni tuo acquisto, la barra di ricerca del negozio è stata migliorata per rendere più utile l'utilizzo delle parole chiave, con anche la possibilità di evidenziare gli attributi cercati. Sarà sufficiente cercare \"Armatura\", \"Forza\", \"Gittata\" e così via per evidenziare le statistiche a cui sei interessato. Scegliere l'oggetto perfetto per la strategia perfetta non è mai stato così facile: l'oro è il tuo unico limite.",
  "springcleaning22_item_tooltips": "Descrizioni estese degli oggetti",
  "springcleaning22_item_tooltips_desc": "Continui a dimenticarti quanto mana è possibile ottenere dai punti Intelligenza o quanta armatura dai punti Agilità? Ecco la soluzione ai tuoi problemi: tieni premuto ALT mentre visualizzi la descrizione degli oggetti per espandere le varie proprietà nelle singole parti che le compongono.",
  "springcleaning22_colored_ability_damage": "Colori per il danno delle abilità",
  "springcleaning22_colored_ability_damage_desc": "Prendere la decisione giusta in battaglia richiede la conoscenza delle sfide che dovrai affrontare. Per aiutarti a valutare i potenziali pericoli, ora il danno inflitto con le abilità e gli oggetti ha un colore diverso in base alla tipologia del danno stesso (fisico, magico o puro).",
  "springcleaning22_pluralized_strings": "Integrazione migliore delle regole di pluralizzazione",
  "springcleaning22_pluralized_strings_desc": "Per migliorare l'accessibilità in tutto il mondo, abbiamo aggiunto delle funzionalità per aumentare l'integrazione delle regole di pluralizzazione delle varie lingue, aggiornando oltre 400 righe di testo a seguito di queste modifiche.",
  "springcleaning22_permanent_debuffs": "Effetti permanenti",
  "springcleaning22_permanent_debuffs_desc": "Pensare a una strategia è difficile senza comprendere l'efficacia delle proprie azioni. Per aumentare le informazioni a disposizione dei giocatori, ora la schermata di post-partita mostra anche le uccisioni di Falce del mietitore (Necrophos) e Lama massacrante (Axe).",
  "springcleaning22_post_game_sortable": "Ordinamento dei dettagli di post-partita",
  "springcleaning22_post_game_sortable_desc": "Sei interessato ad approfondire i dettagli alla base delle tue vittorie? Ora la tabella di post-partita può essere ordinata per un'analisi più efficace.",
  "springcleaning22_gameplay_tp_boots": "Gli Stivali del Viaggiatore sono meno propensi a bersagliare un creep quando vengono utilizzati nel raggio d'azione di una torre.",
  "springcleaning22_gameplay_sellback": "Il periodo durante cui i giocatori possono vendere un oggetto a prezzo pieno dopo l'inizio della partita è stato esteso da 10 a 30 secondi.",
  "springcleaning22_gameplay_lifestealer_consume": "Ora l'abilità Consumo di Lifestealer è associata a un singolo tasto, indipendentemente dal tipo di Unità infestata.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Aggiunti degli effetti sonori per l'attacco e lo stordimento dell'Orco Picchiatore.",
  "springcleaning22_gameplay_neutral_aura_radius": "Ora è possibile passare il cursore sulle aure dei creep neutrali per visualizzarne il raggio d'azione.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Ora i bonus agli attributi nel pannello informativo della Benda Spettrale, del Talismano Etereo e del Bracciale si aggiornano correttamente quando vengono raddoppiati al minuto 25.",
  "springcleaning22_gameplay_heal_overhead": "Risolti vari casi in cui i valori della salute curata mostrati al di sopra di un'Unità non tenevano in conto l'amplificazione degli effetti di guarigione.",
  "springcleaning22_gameplay_fountain_invuln": "I giocatori sotto l'effetto di Invulnerabilità della Fontana non attaccheranno più in modo automatico i nemici a portata, evitando così di interrompere l'effetto.",
  "springcleaning22_gameplay_blink_range": "Ora l'indicatore della gittata del Pugnale del Baleno e delle sue varianti tiene conto dei bonus alla gittata di lancio.",
  "springcleaning22_gameplay_desolator_tooltip": "Chiarita la descrizione dell'abilità Furto dell'anima del Desolatore. Il danno d'attacco del Desolatore aumenta per ogni Eroe che viene ucciso sotto l'effetto di Corruzione.",
  "springcleaning22_gameplay_ardm_stash": "Risolto un bug nella modalità \"All Random Deathmatch\" per cui gli oggetti riportati dal Corriere nella scorta di un giocatore morto finivano per scomparire.",
  "springcleaning22_gameplay_neutral_items_lock": "Non è più possibile impedire la combinazione degli oggetti neutrali. Questa modifica risolve un bug per cui i Corrieri non riuscivano a consegnare gli oggetti la cui combinazione era stata impedita.",
  "springcleaning22_gameplay_illusion_modifiers": "Risolto un bug per cui le illusioni con modificatori duplicati avevano una durata sbagliata, il che consentiva di identificare facilmente l'Eroe vero.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Risolto un bug nelle modalità Turbo e Nuovi giocatori per cui alcune fonti di oro non aumentavano nel modo corretto.",
  "springcleaning22_gameplay_turbo_courier": "Risolto un bug nella modalità Turbo per cui il Corriere non rispondeva più ai comandi se il rispettivo giocatore si era disconnesso durante la scelta degli Eroi o la fase strategica.",
  "springcleaning22_gameplay_zero_tooltips": "Risolto un bug per cui alcune descrizioni modificate dai talenti mostravano uno 0 invece del valore corretto.",
  "springcleaning22_gameplay_euls_invulnerable": "Ora l'utilizzo dello Scettro della Divinità di Eul sui cloni immuni alla magia applica correttamente i suoi effetti invece di andare semplicemente in ricarica.",
  "springcleaning22_gameplay_kobold_aura": "L'abilità Aura della ricerca dei Coboldi non si applica più ai creep eroici (come l'orso di Lone Druid), risolvendo un bug per cui l'effetto veniva raddoppiato.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Ora tutti i cloni, compreso quello di Tempesta doppia, ricevono correttamente i bonus agli attributi dalle benedizioni dello Scettro di Aghanim di Alchemist.",
  "springcleaning22_gameplay_chen_hand_of_god": "Risolto un bug per cui l'abilità Mano divina di Chen non applicava l'effetto di guarigione periodica sui creep controllati dall'Eroe stesso, ma soltanto la guarigione iniziale.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Ora la riduzione del danno d'attacco del clone di Tempesta doppia tiene conto della reincarnazione di Arc Warden.",
  "springcleaning22_gameplay_arc_warden_basher": "Aggiunta una descrizione per chiarire il fatto che tutti i cloni, compreso quello di Tempesta doppia, non possono attivare gli effetti di Colpo violento con lo Spacca-Crani o la Lama Abissale.",
  "springcleaning22_gameplay_arc_warden_blink": "Il Pugnale del Baleno non entra più in ricarica dopo l'utilizzo dell'abilità Tempesta doppia di Arc Warden.",
  "springcleaning22_gameplay_arc_warden_wards": "Il clone dell'abilità Tempesta doppia di Arc Warden non può più ricevere i Guardiani condivisi.",
  "springcleaning22_gameplay_pa_scepter_double": "Il miglioramento dello Scettro di Aghanim per Phantom Assassin non annulla più il tempo di ricarica dell'abilità Sfocatura dopo aver ucciso un clone di Tempesta doppia.",
  "springcleaning22_gameplay_naga_siren_riptide": "Risolto un bug per cui il talento di Naga Siren \"-1 agli attacchi necessari per Risacca\" riduceva gli attacchi di 2 invece che di 1.",
  "springcleaning22_gameplay_legion_commander_duel": "Ora il danno aggiuntivo dell'abilità Duello di Legion Commander viene attribuito anche se il vincitore è invulnerabile.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Corretto il tempo di ricarica dell'abilità Calcio del TRICHECO! di Tusk (12 secondi).",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Corretta la durata dell'abilità Metamorfosi di Terrorblade (35/40/45/50).",
  "springcleaning22_gameplay_monkey_king_arena": "L'abilità Danza dell'albero di Monkey King non consente più di fuggire dall'Arena di sangue.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "In modalità Ability Draft, gli effetti dell'abilità Risacca di Naga Siren verranno riprodotti sull'Eroe corretto invece che su Naga Siren in tutti i casi.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Ora Riki può usare l'abilità Cortina di fumo senza interrompere la canalizzazione di Trucchi del mestiere anche se l'opzione \"Annulla l'azione per fermare le abilità canalizzate\" è attiva.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Corretta l'interazione dell'abilità Rimozione di Marci con il Bastone del Re Nero e il Loto Gemmato.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Ora l'abilità Granata a concussione di Sniper aggiunge un'icona di disarmo sopra la vittima.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling non ottiene più in modo permanente l'abilità passiva Collegamento spirituale quando si trasforma in Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Aggiunta un'icona di canalizzazione mancante per l'abilità Passaggio demoniaco di Underlord.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Aggiunta una descrizione mancante per l'effetto negativo dell'abilità Fiamma gelata.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Ora gli effetti particellari dell'abilità Corona maledetta di Dark Willow con il Frammento di Aghanim seguono i tempi corretti.",
  "springcleaning22_gameplay_lone_druid_midas": "Ora l'utilizzo della Mano di Mida sullo Spirito Orso di Lone Druid fa ottenere esperienza all'Eroe che lo controlla.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Ora lo Spirito Orso e il clone di Tempesta doppia possono accumulare delle cariche per il Bastoncino Magico, la Bacchetta Magica e il Ciondolo Sacro.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Ora la descrizione dell'abilità Passo astrale di Void Spirit mostra i valori corretti di amplificazione degli incantesimi quando viene premuto ALT.",
  "springcleaning22_gameplay_heavenly_jump_range": "Ora è possibile passare il cursore sull'abilità Salto divino di Zeus per visualizzarne la gittata.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Correzione delle descrizioni relative all'abilità Aura arcana di Crystal Maiden.",
  "springcleaning22_gameplay_hex_tooltip": "Risolto un bug per cui la descrizione dell'abilità Maledizione di Shadow Shaman aumentava la durata di 1 secondo dopo aver selezionato il talento \"Maledizione disabilita gli effetti passivi\".",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Risolto un bug per cui il talento di livello 20 di Abaddon non aggiornava il tempo di ricarica dell'abilità Tempo rubato nella rispettiva descrizione.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Risolto un bug per cui l'abilità Presenza del signore oscuro di Shadow Fiend non veniva applicata correttamente sui creep neutrali.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Corretta l'interazione dell'abilità Raggio distorto di Tinker con Roshan.",
  "springcleaning22_gameplay_ability_draft_wukong": "Risolto un bug in modalità Ability Draft per cui i cloni di Ordine di Wukong non avevano le abilità corrette.",
  "springcleaning22_rubick_illusions": "Risolto un bug che impediva alle illusioni di Rubick di riprodurre le animazioni corrette in base agli incantesimi rubati (ad esempio Stretta maligna di Bane con lo Scettro di Aghanim).",
  "springcleaning22_rubick_hunter_in_the_night": "Ora l'abilità Cacciatore notturno può essere rubata dopo aver ricevuto il miglioramento dello Scettro di Aghanim.",
  "springcleaning22_rubick_juxtapose": "Ora l'abilità Giustapposti può essere rubata dopo aver ricevuto il miglioramento dello Scettro di Aghanim.",
  "springcleaning22_rubick_fireball": "Ora l'abilità Palla di fuoco può essere rubata indipendentemente da Forma di drago antico e non si sblocca in automatico.",
  "springcleaning22_rubick_wolf_bite": "Ora l'abilità Morso del lupo funziona quando viene rubata.",
  "springcleaning22_rubick_depth_shroud": "Ora l'abilità Velo delle profondità funziona quando viene rubata.",
  "springcleaning22_rubick_astral_spirit": "L'abilità di movimento di Spirito astrale è rimossa quando l'incantesimo viene rubato. Ora Rubick può mantenere entrambi gli slot degli incantesimi quando ruba questa abilità.",
  "springcleaning22_rubick_reverse_time_walk": "Ora Passo temporale inverso occupa lo stesso slot di Passo temporale quando Rubick ottiene un Frammento di Aghanim. Ora Rubick può mantenere entrambi gli slot degli incantesimi quando ruba questa abilità.",
  "springcleaning22_rubick_jaunt": "Ora Salto etereo occupa lo stesso slot di Sfera illusoria quando Rubick ottiene un Frammento di Aghanim. Ora Rubick può mantenere entrambi gli slot degli incantesimi quando ruba questa abilità.",
  "springcleaning22_rubick_eject": "Ora Rigetto occupa lo stesso slot di Smembramento quando Rubick ottiene un Frammento di Aghanim. Ora Rubick può mantenere entrambi gli slot degli incantesimi quando ruba questa abilità.",
  "springcleaning22_rubick_dismember": "Ora Smembramento rigetta l'Eroe alleato se al suo posto viene rubata un'altra abilità.",
  "springcleaning22_rubick_spit_out": "Ora Sputa occupa lo stesso slot di Abbuffata quando Rubick ottiene un Frammento di Aghanim. Ora Rubick può mantenere entrambi gli slot degli incantesimi quando ruba questa abilità.",
  "springcleaning22_rubick_decoy": "Non è più possibile sbloccare Imboscata rubando l'abilità Diversivo. Gli effetti di Diversivo vengono comunque applicati all'utilizzo di Imboscata.",
  "springcleaning22_rubick_spirits": "Ora il furto dell'abilità Spiriti di Io funziona correttamente dopo aver ottenuto uno Scettro di Aghanim.",
  "springcleaning22_rubick_gravekeepers_cloak": "Ora l'abilità Mantello del becchino può essere rubata dopo aver ricevuto il miglioramento dello Scettro di Aghanim.",
  "springcleaning22_rubick_shard_cursed_crown": "Se Rubick ottiene un Frammento di Aghanim, l'abilità Corona maledetta creerà anche dei rovi.",
  "springcleaning22_rubick_shard_venomous_gale": "Se Rubick ottiene un Frammento di Aghanim, l'abilità Brezza velenosa evocherà anche dei Guardiani pestilenziali.",
  "springcleaning22_rubick_shard_sprout": "Se Rubick ottiene un Frammento di Aghanim, l'abilità Germoglio evocherà anche degli Alberi Animati.",
  "springcleaning22_rubick_shard_shackles": "Se Rubick ottiene un Frammento di Aghanim, l'abilità Catene evocherà anche dei Guardiani serpenti.",
  "springcleaning22_rubick_shard_cold_embrace": "Se Rubick ottiene un Frammento di Aghanim, l'abilità Abbraccio gelido emetterà anche un Colpo a frammenti.",
  "springcleaning22_rubick_shard_earthshock": "Se Rubick ottiene un Frammento di Aghanim, l'abilità Shock sismico applicherà anche gli effetti di Rabbia.",
  "springcleaning22_rubick_shard_shadow_step": "Se Rubick ottiene un Frammento di Aghanim, l'abilità Passo oscuro applicherà anche gli effetti di Pugnale spettrale.",
  "springcleaning22_rubick_shard_terror_wave": "Se Rubick ottiene un Frammento di Aghanim, l'abilità Onda del terrore applicherà anche gli effetti di Metamorfosi.",
  "springcleaning22_rubick_shard_homing_missile": "Se Rubick ottiene un Frammento di Aghanim, l'abilità Missile autoguidato sparerà anche una Raffica di razzi.",
  "springcleaning22_rubick_shard_slithereen_crush": "Se Rubick ottiene un Frammento di Aghanim, l'abilità Schianto viscido applicherà anche gli effetti di Fumi corrosivi.",
  "springcleaning22_rubick_scepter_flak_cannon": "Se Rubick ottiene uno Scettro di Aghanim, l'abilità Cannone contraereo aggiungerà anche il Cannone laterale.",
  "springcleaning22_rubick_scepter_time_walk": "Se Rubick ottiene uno Scettro di Aghanim, l'abilità Passo temporale applicherà anche gli effetti di Blocco temporale.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Se Rubick ottiene uno Scettro di Aghanim, l'abilità Lancio di shuriken applicherà anche gli effetti di Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Se Rubick ottiene uno Scettro di Aghanim, l'abilità Freccia sacra applicherà anche gli effetti di Tempesta di stelle.",
  "springcleaning22_ui_quickcast_vector_targeting": "Aggiunta una modalità di lancio rapido per le abilità a \"vettore\", ossia le abilità la cui attivazione richiede di cliccare e trascinare sullo schermo. Tieni premuto il tasto associato all'abilità per iniziare a disegnare il vettore e lascialo quando hai finito.",
  "springcleaning22_ui_ward_bounty": "Ora l'evento di distruzione di un Guardiano Osservatore mostra anche chi ha ricevuto la ricompensa qualora si trattasse di un Eroe diverso da quello che lo ha distrutto.",
  "springcleaning22_ui_spectator_hud_player_view": "Ora l'interfaccia da spettatore mostra correttamente il giocatore che stai osservando.",
  "springcleaning22_ui_post_game_scepter_shard": "Ora le descrizioni relative allo Scettro e al Frammento di Aghanim mostrano i rispettivi effetti nella tabella di post-partita.",
  "springcleaning22_ui_post_game_backpack_neutral": "Ora gli oggetti neutrali e gli oggetti nello zaino vengono mostrati nel post-partita all'interno del menu di dettaglio degli Eroi.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Ora i valori relativi al prosciugamento della salute dagli incantesimi per Eroi e creep vengono mostrati separatamente tenendo premuto ALT.",
  "springcleaning22_ui_skeleton_warrior_rally": "Ora l'aura dell'abilità Adunata dello Scheletro Guerriero corrisponde ad un unico effetto invece che a vari effetti associati a icone diverse.",
  "springcleaning22_ui_neutral_item_teleport": "Risolto un bug per cui cambiare un oggetto neutrale e teletrasportarne un altro in rapida successione provocava il teletrasporto dell'oggetto sbagliato.",
  "springcleaning22_ui_spectator_arcana": "Le interfacce relative agli oggetti Arcani non compaiono più nelle partite di lega in modalità spettatore.",
  "springcleaning22_ui_ready_check_enter": "Ora è possibile premere INVIO per confermare di essere pronti.",
  "springcleaning22_ui_alt_item_combine": "Ora è possibile tenere premuto ALT nel menu di acquisto rapido per mostrare l'oggetto completo ottenibile combinando gli oggetti presenti.",
  "springcleaning22_ui_alt_items_ready": "Ora è possibile tenere premuto CTRL e fare ALT + clic sui seguenti oggetti per comunicare alla squadra che sono pronti all'utilizzo, piuttosto che richiedere un'adunata: Stivali Arcani, Protezione Cremisi, Stivali del Protettore, Mekansm, Pipa dell'Intuizione e Fumo del Raggiro.",
  "springcleaning22_ui_sentry_pregame": "Il numero di Guardiani Sentinella mostrati durante la fase strategica è stato aumentato da 2 a 3. All'inizio della partita è possibile acquistare un massimo di 3 Guardiani Sentinella per squadra.",
  "springcleaning22_ui_guide_pregame": "Dopo aver scelto un Eroe, la sezione degli oggetti consigliati mostrerà la prima parte di una guida nel caso in cui tale guida non abbia un capitolo dedicato agli \"Oggetti iniziali\".",
  "springcleaning22_ui_ward_planter": "Ora è possibile selezionare i Guardiani per mostrare chi li ha posizionati ai giocatori alleati, agli spettatori e ai mentori alleati.",
  "springcleaning22_ui_courier_home_button": "Ora il pulsante \"Negozio principale\" del Corriere gli consente anche di rimettere nella scorta tutti gli oggetti in suo possesso quando raggiunge la base.",
  "springcleaning22_ui_combat_log_key": "Ora è possibile assegnare un tasto al registro dei combattimenti tramite le opzioni.",
  "springcleaning22_ui_combat_log_right_align": "Il registro dei combattimenti è stato allineato a destra e non si sovrappone più al pannello della modalità di prova degli Eroi.",
  "springcleaning22_ui_combat_log_hud_flip": "Ora il registro dei combattimenti segue l'inversione dell'interfaccia (minimappa sulla destra) e si sposterà sul lato sinistro dopo aver attivato questa opzione.",
  "springcleaning22_ui_guide_apos": "Risolto un bug per cui i commenti sugli oggetti e sulle abilità nelle guide mostravano \"&apos;\" e altri simboli HTML invece degli apostrofi quando venivano salvati. Le guide già salvate che presentano questo problema dovranno essere aggiornate manualmente.",
  "springcleaning22_ui_vs_screen_widescreen": "Corretta la visualizzazione degli Eroi nella schermata Versus sugli schermi 21:9 o più larghi.",
  "springcleaning22_ui_charms": "Risolto un bug per cui l'interfaccia degli amuleti mostrava delle scritte sovrapposte in presenza di almeno 2 amuleti.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Risolto un bug nella modalità di addestramento dei colpi di grazia per cui avviare il gioco prima della nascita del tuo Eroe impediva la generazione dei creep.",
  "springcleaning22_ui_intro_scenes": "Le scene introduttive, come quelle per il debutto degli Eroi, dei set Arcani o dei personaggi alternativi, non verranno più mostrate ai giocatori che non hanno concluso la fase di introduzione dedicata ai nuovi giocatori.",
  "springcleaning22_cosmetics_illusion_skins": "Risolto un bug per cui le illusioni potevano non ereditare correttamente le skin di determinati modelli decorativi.",
  "springcleaning22_cosmetics_cloth_stretch": "Risolto un bug per cui i tessuti di determinati modelli si allungavano erroneamente sullo schermo.",
  "springcleaning22_cosmetics_underlord_immortal": "Ora l'oggetto Immortale di Underlord \"Repressione Smeraldina\" sostituisce gli effetti visivi della Ultimate con degli effetti esclusivi.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Ora gli effetti visivi dell'oggetto Immortale di Shadow Demon \"Mantello dell'Apparenza Macabra\" per il proiettile di Veleno oscuro sono orientati in modo corretto.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Gli effetti visivi dell'oggetto Immortale di Wraith King \"Ombra Rovente\" hanno una priorità maggiore rispetto a quelli del set Arcano per l'utilizzo dell'abilità Palla di fuoco spettrale.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Corretti gli effetti ambientali dell'oggetto Immortale di Earthshaker \"Bracciali della Caverna Luminosa\".",
  "springcleaning22_cosmetics_warlock_immortal": "Corretti gli effetti visivi dell'oggetto Immortale di Warlock \"Glifo Ombroso\" per l'abilità Parola d'ombra (effetto positivo ed effetto negativo).",
  "springcleaning22_cosmetics_viper_immortal": "Corretti gli effetti particellari dell'oggetto Immortale di Viper \"Colpo del Drago Malefico\" per l'abilità Subdotossina.",
  "springcleaning22_cosmetics_abaddon_vessel": "Ripristinati gli effetti visivi dell'oggetto di Abaddon \"Lama del Vassallo Demoniaco\" per Scudo afotico.",
  "springcleaning22_cosmetics_tidehunder_belt": "Corretto l'oggetto di Tidehunter \"Orrori delle Profondità - Cintura\" per rimuovere gli effetti particellari che venivano mostrati in corrispondenza della cintura invece che del braccio.",
  "springcleaning22_cosmetics_faceless_incursion": "Corretti gli effetti ambientali dell'arma del set di oggetti \"L'Incursione di Claszureme\" per Faceless Void.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Aggiunti degli effetti esclusivi ad entrambi gli stili del set Arcano di Drow Ranger per l'abilità Precisione.",
  "springcleaning22_cosmetics_rubick_dilemma": "Ripristinati gli effetti visivi dell'oggetto di Rubick \"Torcia del Dilemma di Fantoccini\".",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Ora l'animazione di corsa da ferito associata al set Arcano di Techies viene riprodotta alla velocità corretta.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Ora la scelta delle gemme prismatiche per il set Arcano di Techies si riflette sulle abilità Bomba adesiva e Taser reattivo.",
  "springcleaning22_cosmetics_techies_icons": "Aggiunte le icone mancanti associate agli oggetti dei set \"La Banda dei Pinguini\", \"Gli Strumenti del Geniere Astuto\", \"I Gufi Cannonieri\" e \"La Marcia della Pattuglia Esplosiva\" per Techies.",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Corretta l'animazione di Spoon (Techies) durante l'anteprima del teletrasporto con il set \"Il Carrello Pachiderma\".",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Ora l'oggetto Arcano di Rubick aggiunge degli effetti esclusivi all'abilità Bomba adesiva di Techies invece che all'abilità Mine remote.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Risolto un bug per cui l'animazione di disabilitazione di Snapfire rimaneva bloccata in una sequenza di animazione errata.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Ora il set di Legion Commander \"La Conquistatrice Splendente\" e i rispettivi oggetti possono essere scambiati e venduti sul Mercato.",
  "springcleaning22_cosmetics_legion_commander_wind": "Aggiunti gli effetti del vento agli stendardi dei set di Legion Commander \"L'Eredità della Legione Caduta\" e \"La Conquistatrice Splendente\", indipendentemente dall'utilizzo delle armi del set Arcano.",
  "springcleaning22_perf_panorama_atlas": "L'engine dell'interfaccia Panorama è stato migliorato per interagire più efficacemente con la GPU. Secondo i nostri calcoli, queste modifiche hanno aumentato del 25-30% le prestazioni della GPU relativamente alla resa dell'interfaccia, con aumenti ancora più sostanziali in alcune pagine complicate della dashboard. Queste modifiche aumentano anche le prestazioni della CPU per Vulkan e dovrebbero dimostrarsi particolarmente efficaci per i computer Apple con processori M1.",
  "springcleaning22_perf_sand_king_particles": "Ottimizzati gli effetti particellari dell'abilità Tempesta di sabbia per aumentare le prestazioni.",
  "springcleaning22_perf_panorama_clears": "Aggiornato l'engine dell'interfaccia Panorama per evitare l'eliminazione superflua di alcuni target di rendering, riducendo il carico sulla GPU.",
  "springcleaning22_perf_scenesystem_threading": "Risolto un bug per cui talvolta venivano utilizzati meno thread del dovuto per eseguire processi multithread. Questa correzione è particolarmente utile per i computer con meno di 4 core.",
  "springcleaning22_perf_thread_affinity": "Risolto un bug per cui l'errata definizione delle affinità dei thread poteva comportare dei ritardi su alcuni computer.",
  "springcleaning22_perf_power_savings": "Aggiunto un avviso nella finestra delle impostazioni video per notificare l'attivazione della modalità risparmio energetico, possibile causa di una riduzione delle prestazioni.",
  "springcleaning22_perf_shop_tooltips": "Migliorate le prestazioni dei pannelli informativi durante la navigazione del negozio di oggetti.",
  "springcleaning22_custom_games_overview_sort": "Ora la sezione \"Panoramica\" di Arcade consente di ordinare i risultati in base ai giocatori attualmente attivi, oltre che al numero delle lobby aperte.",
  "springcleaning22_custom_games_update": "Risolto un problema con le modalità personalizzate di Arcade per cui talvolta non veniva notificata la necessità di un aggiornamento fino al riavvio di Steam o alla reinstallazione delle modalità stesse.",
  "springcleaning22_custom_games_lobby_version": "La lista delle lobby in Arcade non includerà più le lobby inaccessibili o non compatibili con la versione della modalità personalizzata attualmente installata.",
  "springcleaning22_custom_games_bounty_filter": "Ora è possibile usare SetFilterMoreGold per filtrare l'oro ricevuto dalle Rune della Generosità.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "La Reliquia di Dazzle \"Juju malvagio su 4 nemici\" è stata sostituita con \"Danno e cura di Juju malvagio\".",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "La Reliquia di Techies \"Uccisioni con le Mine remote\" è stata sostituita con \"Bombe adesive sugli Eroi\".",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "La Reliquia di Techies \"Stordimenti con Trappola statica\" è stata sostituita con \"Disarmi di Taser reattivo su più Eroi\".",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "La Reliquia di Tinker \"Danni con Marcia delle macchine\" è stata sostituita con \"Danno assorbito con Matrice difensiva\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "La Reliquia di Underlord \"Uccisioni dopo Squarcio oscuro\" è stata sostituita con \"Uccisioni alleate dopo Passaggio demoniaco\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "La Reliquia di Underlord \"Eroi salvati con Squarcio oscuro\" è stata sostituita con \"Danno aggiuntivo inflitto con Aura dell'atrofia\".",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Corretta la Reliquia di Omniknight \"Danni degli alleati durante Grazia divina\".",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Corretta la Reliquia di Primal Beast \"Assalto su più Eroi\".",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "La sfida degli Eroi per Meepo \"Infliggi danni magici agli Eroi nemici\" è stata sostituita con \"Infliggi danni puri agli Eroi nemici\".",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "La sfida degli Eroi per Naga Siren \"Cura gli Eroi alleati con Canto della sirena\" è stata sostituita con \"Brucia i punti mana agli Eroi nemici\".",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "La sfida degli Eroi per Tinker \"Infliggi danni con Marcia delle macchine\" è stata sostituita con \"Assorbi danni con Matrice difensiva\".",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "La sfida degli Eroi per Techies \"Uccidi gli Eroi nemici con Mine remote\" è stata sostituita con \"Colpisci i nemici con le Bombe adesive\".",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "La sfida degli Eroi per Underlord \"Teletrasportati con più Eroi usando Squarcio oscuro\" è stata sostituita con \"Aiuta gli alleati a uccidere i nemici con l'utilizzo di Passaggio demoniaco\".",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Ora la sfida degli Eroi per Grimstroke \"Infliggi danni ai nemici sotto l'effetto di Legame spirituale\" tiene conto del danno inflitto dagli alleati.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Ora la sfida degli Eroi per Mirana \"Infliggi danni mentre ti trovi sotto l'effetto di Balzo\" considera tutti i tipi di danno e non soltanto quello fisico.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Corretta la sfida degli Eroi per Bane \"Afferra un Eroe nemico con Stretta maligna dopo aver usato il Pugnale del Baleno o il Bastone della Forza\".",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Corretta la sfida degli Eroi per Dragon Knight \"Uccidi gli Eroi nemici dopo aver assunto la Forma di drago antico\".",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Corretta la sfida degli Eroi per Drow Ranger \"Usa Folata per silenziare 2 o più Eroi nemici\".",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Corretta la sfida degli Eroi per Crystal Maiden \"Uccidi i creep con Morsa di ghiaccio\".",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Corretta la sfida degli Eroi per Dark Seer \"Infliggi danni mentre ti trovi sotto l'effetto di Guizzo\".",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Corretta la sfida degli Eroi per Lifestealer \"Infliggi danni mentre ti trovi sotto l'effetto di Furia\".",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Corretta la sfida degli Eroi per Lone Druid \"Infliggi danni dopo aver usato Vera forma\".",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Corretta la sfida degli Eroi per Mars \"Infliggi danni agli Eroi nemici\".",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Corretta la sfida degli Eroi per Mars \"Uccidi le Unità nemiche con Squarcio\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Corretta la sfida degli Eroi per Omniknight \"Infliggi danni mentre ti trovi sotto l'effetto di Grazia divina\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Corretta la sfida degli Eroi per Omniknight \"Usa Grazia divina sugli Eroi alleati per una certa durata\".",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Corretta la sfida degli Eroi per Rubick \"Stordisci più Eroi nemici con un solo utilizzo di Telecinesi\".",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Corretta la sfida degli Eroi per Tinker \"Infliggi danni agli Eroi nemici usando Laser migliorato con lo Scettro di Aghanim\".",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Corretta la sfida degli Eroi per Tusk \"Colpisci un Eroe nemico con Calcio del TRICHECO! e Pugno del TRICHECO! in rapida successione\".",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Rimossa la sfida degli Eroi per Venomancer \"Infliggi danni agli Eroi nemici dopo aver disabilitato le loro abilità passive con la Lama Argentea\".",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Rimossa la sfida degli Eroi per Tinker \"Uccidi i creep con Marcia delle macchine\".",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Aggiunta la sfida degli Eroi per Underlord \"Infliggi danni agli Eroi nemici usando Tempesta di fuoco\".",
  "springcleaning22_workshop_modeldoc": "Gli strumenti del Workshop di Dota per gli oggetti e le modalità personalizzate sono stati migliorati con l'aggiunta del nuovo editor di modelli \"ModelDoc\". Invitiamo gli autori del Workshop a trasferire i propri modelli dallo strumento precedente, che verrà rimosso in un aggiornamento futuro."
}