// 1918.js

{
  "language": "greek",
  "springcleaning22_desc": "Η ενημέρωση Ανοιξιάτικου Καθαρίσματος 2022 είναι εδώ για να διορθώσει μια πληθώρα σφαλμάτων και να ενσωματώσει ένα σύνολο νέων βελτιώσεων. Ρίξτε μια ματιά σε μερικές από τις μεγαλύτερες αλλαγές —όπως τις βελτιώσεις στις επεξηγήσεις του Aghanim, τους ελέγχους σίγασης, τις αναζητήσεις μαγαζιού και τη λειτουργία δοκιμής ηρώων— και, έπειτα, μελετήστε την πλήρη λίστα διορθώσεων και προσαρμογών παιχνιδιού σε μια λεπτομερή ανάλυση παρακάτω.",
  "springcleaning22_aghs_tooltips": "ΕΠΕΞΗΓΗΣΕΙΣ Aghanim's Scepter και Aghanim's Shard",
  "springcleaning22_aghs_tooltips_desc": "Οι εσωτερικές διεργασίες του μυαλού του Aghanim (και ο μονόλογος) είναι αδιαμφισβήτητα πέρα από την αντίληψη των θνητών, αλλά με τη σημερινή ενημέρωση, αποκαλύπτεται όπως ποτέ ξανά ο αντίκτυπος των μεγαλοπρεπών Σκήπτρων και Πετραδιών του. Οι επεξηγήσεις για τις αναβαθμίσεις του Aghanim περιλαμβάνουν, τώρα, περισσότερες λεπτομέρειες για τον ακριβή αριθμό πραγμάτων που αλλάζουν όταν εξοπλίζονται και οι τροποποιημένες ικανότητες περιλαμβάνουν, επίσης, αυτές τις πληροφορίες σε μια αποκλειστική ενότητα. Πολλές αναβαθμίσεις έχουν λάβει ιδιαίτερη προσοχή, επίσης, για να γίνουν πιο απλές και ευνόητες για τα μη-μαγικά μυαλά μας.",
  "springcleaning22_muting_ui": "ΒΕΛΤΙΩΣΕΙΣ ΣΙΓΑΣΗΣ",
  "springcleaning22_muting_ui_desc": "Οι παίκτες του Dota είναι θορυβώδεις και, μερικές φορές, κυριαρχούν τα λάθος συναισθήματα πάνω στην έξαψη του ανταγωνισμού. Σε περιπτώσεις που αυτή η συμπεριφορά γίνεται ενοχλητική, είναι σημαντικό να έχουμε έναν εύκολο και γρήγορο τρόπο για σίγαση και αναφορά παικτών για πρόσθετο έλεγχο, χωρίς να αποδιοργανώνεται περαιτέρω το παιχνίδι σας. Για αυτόν τον σκοπό, με ένα κλικ τώρα θα γίνεται σίγαση σε ήχο, σίγαση σε φωνή και αναφορά στον παίκτη. Μπορείτε, επίσης, να κάνετε δεξί κλικ για σίγαση σε κείμενο και φωνή ανεξάρτητα, σε περιπτώσεις που η συμπεριφορά ενός παίκτη μπορεί να μην είναι ενοχλητική, αλλά η επικοινωνία μαζί του εξακολουθεί να είναι ανεπιθύμητη. Για εύκολο έλεγχο υψηλού επιπέδου, μπορείτε επίσης να χρησιμοποιήσετε τα νέα κουμπιά σίγασης ομάδας, για να μπλοκάρετε τις επικοινωνίες μιας ολόκληρης ομάδας με ένα κλικ.\\n\\nΕκμεταλλευόμαστε, επίσης, αυτήν την ευκαιρία για να επανεκτιμήσουμε τον τρόπο χειρισμού των αναφορών επικοινωνίας. Οι στόχοι μας είναι να καταστήσουμε εύκολη και γρήγορη την αναφορά ενοχλητικών παικτών, καθώς, ταυτόχρονα, λαμβάνουμε σαφείς ενδείξεις σχετικά με τους παίκτες για τους οποίους ίσως χρειαστεί να λάβουμε ισχυρότερα μέτρα.",
  "springcleaning22_demo_hero": "ΒΕΛΤΙΩΣΕΙΣ ΔΟΚΙΜΗΣ ΗΡΩΩΝ",
  "springcleaning22_demo_hero_desc": "Θέλετε να δοκιμάσετε τις νεότερες στρατηγικές ή να δημιουργήσετε μερικές δικές σας; Ή απλά νιώθετε μία ανυπέρβλητη ανάγκη να δείτε πόσες ενσαρκώσεις του Axe μπορούν να σκοτωθούν με ένα χτύπημα Tidebringer; Όπως και να 'χει, η τύχη σάς χαμογελά! Η λειτουργία δοκιμής ηρώων έχει ενημερωθεί, με έναν επανασχεδιασμό που περιλαμβάνει πολλές νέες λειτουργικότητες:",
  "springcleaning22_demo_hero_map": "Η βόρεια ενότητα του χάρτη δοκιμής έχει επεκταθεί, για να παρέχει περισσότερο επίπεδο έδαφος για δοκιμές.",
  "springcleaning22_demo_hero_hero_spawn": "Προστέθηκαν έλεγχοι για εύκολη αναβίωση συμμαχικών ηρώων, πέρα από τους εχθρικούς.",
  "springcleaning22_demo_hero_hero_reset": "Προστέθηκε ένας έλεγχος για επαναφορά ενός ήρωα πίσω στο επίπεδο 1.",
  "springcleaning22_demo_hero_hero_remove": "Προστέθηκε ένας έλεγχος για αφαίρεση ενός ήρωα, αφού ολοκληρώσετε τη δοκιμή.",
  "springcleaning22_demo_hero_hero_select": "Η δημιουργία ενός νέου ήρωα θα τον προσθέσει στην τρέχουσα επιλογή σας.",
  "springcleaning22_demo_hero_levelling": "Τα κουμπιά για αναβάθμιση επιπέδου, προσθήκη Aghanim's Scepter, προσθήκη Aghanim's Shard και εναλλαγής ατρωσίας τώρα εφαρμόζονται σε όλους τους επιλεγμένους ήρωες.",
  "springcleaning22_demo_creep_toggle": "Όταν γίνεται εναλλαγή της επιλογής «Κύμα κριπακίων» σε ανενεργό, θα καταστρέφονται όλα τα υπάρχοντα κριπάκια μετώπου.",
  "springcleaning22_demo_creep_spawn": "Προστέθηκε ένα κουμπί για αναβίωση ενός κύματος κριπακίων σε κάθε πλευρά.",
  "springcleaning22_demo_hero_runes": "Προστέθηκαν κουμπιά για αναβίωση των 6 κύριων ρούνων.",
  "springcleaning22_shop_search": "ΕΝΗΜΕΡΩΘΗΚΕ Η ΑΝΑΖΗΤΗΣΗ ΤΟΥ ΜΑΓΑΖΙΟΥ",
  "springcleaning22_shop_search_desc": "Το ξόδεμα χρυσού θα πρέπει να είναι εύκολο, διασκεδαστικό και, κυρίως, αποτελεσματικό. Οπότε, για να σας βοηθήσουμε να νιώθετε περισσότερο σαν να «κόβετε φέτες» και λιγότερο σαν να «βαράτε μύγες» στα σερί σκοτωμών σας, η αναζήτηση αντικειμένων μαγαζιού έχει επεκταθεί, με βελτιωμένη υποστήριξη για λέξεις-κλειδιά, συμπεριλαμβανομένης μιας προβολής που αναδεικνύει τα αναζητούμενα χαρακτηριστικά. Απλά αναζητήστε «άμυνα», «δύναμη», «βεληνεκές» κτλ., για να αναδείξετε τα χαρακτηριστικά για τα οποία ενδιαφέρεστε. Η επιλογή του τέλειου σχεδίου δεν ήταν ποτέ ευκολότερη. Το μόνο που χρειάζεστε τώρα είναι ο χρυσός.",
  "springcleaning22_item_tooltips": "ΕΠΕΚΤΑΘΗΚΑΝ ΤΑ ΠΑΡΑΘΥΡΑ ΕΠΕΞΗΓΗΣΗΣ ΑΝΤΙΚΕΙΜΕΝΩΝ",
  "springcleaning22_item_tooltips_desc": "Ξεχνάτε συνέχεια πόση ενέργεια παρέχει η Ευφυΐα; Ή πόση άμυνα λαμβάνετε από τη Σβελτάδα; Μην αναρωτιέστε άλλο, καθώς το παρατεταμένο πάτημα του ALT, ενώ κοιτάτε τις επεξηγήσεις για τα αντικείμενα, θα επεκτείνει τώρα αυτές τις ιδιότητες σε όλα τα δομικά στοιχεία τους.",
  "springcleaning22_colored_ability_damage": "ΧΡΩΜΑΤΑ ΖΗΜΙΑΣ ΙΚΑΝΟΤΗΤΑΣ",
  "springcleaning22_colored_ability_damage_desc": "Η λήψη καλών αποφάσεων στη μάχη βασίζεται στη γνώση των προκλήσεων που αντιμετωπίζετε. Για να σας βοηθήσουμε να αναλύσετε τους πιθανούς κινδύνους, η ζημιά που προκαλείται από ξόρκια φέρει τώρα συγκεκριμένο χρώμα, αναλόγως του αν πρόκειται για φυσική, μαγική ή καθαρή.",
  "springcleaning22_pluralized_strings": "ΕΝΙΣΧΥΘΗΚΕ Η ΥΠΟΣΤΗΡΙΞΗ ΓΛΩΣΣΑΣ ΓΙΑ ΚΕΙΜΕΝΑ ΜΕ ΠΛΗΘΥΝΤΙΚΟ",
  "springcleaning22_pluralized_strings_desc": "Για να βελτιώσουμε την προσβασιμότητα σε όλον τον κόσμο, προσθέσαμε χαρακτηριστικά για καλύτερη υποστήριξη των κανόνων πληθυντικού για πολλαπλές γλώσσες και ενημερώσαμε πάνω από 400 γραμμές κειμένου για να περάσουμε αυτές τις αλλαγές.",
  "springcleaning22_permanent_debuffs": "ΜΟΝΙΜΕΣ ΕΠΑΥΞΗΣΕΙΣ",
  "springcleaning22_permanent_debuffs_desc": "Η στρατηγική είναι δύσκολη χωρίς να αντιλαμβάνεστε την αποτελεσματικότητα των πράξεών σας. Για να γίνουν περισσότερες πληροφορίες διαθέσιμες μετά από έναν αγώνα, σκοτωμοί από το Reaper's Scythe του Necrophos και από το Culling Blade του Axe τώρα εμφανίζονται στην οθόνη λήξης παιχνιδιού.",
  "springcleaning22_post_game_sortable": "ΛΕΠΤΟΜΕΡΕΙΕΣ ΛΗΞΗΣ ΠΑΙΧΝΙΔΙΟΥ ΜΕ ΔΥΝΑΤΟΤΗΤΑ ΤΑΞΙΝΟΜΗΣΗΣ",
  "springcleaning22_post_game_sortable_desc": "Θέλετε να μελετήσετε ενδελεχώς τις λεπτομέρειες πίσω από τις νίκες σας; Ο πίνακας βαθμολογίας λήξης παιχνιδιού μπορεί πλέον να ταξινομηθεί για ευκολότερη ανάλυση.",
  "springcleaning22_gameplay_tp_boots": "Τα Boots of Travel είναι λιγότερο πιθανό να στοχεύσουν ένα κριπάκι, όταν εκτελούνται εντός του βεληνεκούς ενός πύργου.",
  "springcleaning22_gameplay_sellback": "Οι παίκτες μπορούν τώρα να πουλήσουν ένα αντικείμενο στην πλήρη τιμή του, στα πρώτα 30 δευτερόλεπτα μετά την έναρξη του παιχνιδιού, αντί για την κανονική περίοδο πώλησης των 10 δευτερολέπτων.",
  "springcleaning22_gameplay_lifestealer_consume": "Το Consume του Lifestealer τώρα χρησιμοποιεί το ίδιο πλήκτρο, ανεξάρτητα από τον τύπο μονάδες υπό Infest.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Το Ogre Bruiser τώρα έχει ηχητικό εφέ για τη φόρα χτυπήματος και το σάστισμα.",
  "springcleaning22_gameplay_neutral_aura_radius": "Όλες οι αύρες ουδέτερων κριπακίων τώρα δείχνουν την εμβέλειά τους με κατάδειξη.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Τα Wraith Band / Null Talisman / Bracer τώρα ενημερώνουν τις επαυξήσεις στατιστικών όταν διπλασιάζονται στο 25ο λεπτό.",
  "springcleaning22_gameplay_heal_overhead": "Διορθώθηκε ένας αριθμός περιπτώσεων, όπου οι αναδυόμενοι αριθμοί θεραπείας δεν υπολόγιζαν την ενίσχυση θεραπείας.",
  "springcleaning22_gameplay_fountain_invuln": "Παίκτες με την επαύξηση ατρωσίας του σιντριβανιού δεν θα επιτίθενται πλέον αυτόματα και θα σπάνε την επαύξηση, όταν ένας εχθρός είναι εντός βεληνεκούς.",
  "springcleaning22_gameplay_blink_range": "Η ένδειξη βεληνεκούς ξορκιών για το Blink και τις παραλλαγές του τώρα λαμβάνει υπόψιν επαυξήσεις αύξησης βεληνεκούς εκτέλεσης.",
  "springcleaning22_gameplay_desolator_tooltip": "Διευκρινίστηκε το παράθυρο επεξήγησης για το παθητικό Κλέψιμο Ψυχής του Desolator. Το Desolator αποκτάει ζημιά επίθεσης, όποτε ένας εχθρός πεθαίνει ενώ είναι επηρεασμένος από την απομείωση Διαφθοράς.",
  "springcleaning22_gameplay_ardm_stash": "Διορθώθηκε ένα σφάλμα στο ARDM, όπου η επιστροφή ενός αντικειμένου στη φύλαξη από τον μεταφορέα, ενώ ήταν νεκρός, οδηγούσε στην εξαφάνιση του αντικειμένου.",
  "springcleaning22_gameplay_neutral_items_lock": "Δεν μπορεί να γίνει πλέον κλείδωμα συνδυασμού στα ουδέτερα αντικείμενα. Αυτό διορθώνει ένα σφάλμα, όπου οι μεταφορείς δεν παρέδιδαν κλειδωμένα ουδέτερα αντικείμενα.",
  "springcleaning22_gameplay_illusion_modifiers": "Διορθώθηκε ένα σφάλμα, όπου ψευδαισθήσεις με διπλασιασμένους τροποποιητές είχαν εσφαλμένες διάρκειες, επιτρέποντας την αναγνώριση του πραγματικού ήρωα.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Διορθώθηκε ένα σφάλμα σε Turbo και στον Τύπο Νέων Παικτών, όπου μερικές πηγές χρυσού δεν κλιμακώνονταν σωστά.",
  "springcleaning22_gameplay_turbo_courier": "Διορθώθηκε ένα σφάλμα σε Turbo, όπου ο μεταφορέας ενός παίκτη δεν λειτουργούσε, πλέον, αν αποσυνδεόταν κατά την επιλογή ήρωα ή τον χρόνο στρατηγικής.",
  "springcleaning22_gameplay_zero_tooltips": "Διορθώθηκε ένα σφάλμα, όπου κάποιες επεξηγήσεις εντός παιχνιδιού που τροποποιούνται από ταλέντα, έδειχναν 0 αντί για τη σωστή τιμή.",
  "springcleaning22_gameplay_euls_invulnerable": "Η εκτέλεση του Eul's Scepter of Divinity σε μαγικά απρόσβλητους κλώνους θα εφαρμόσει τώρα σωστά την επίδρασή του στον κλώνο αντί να μπει απλά σε επαναφόρτιση.",
  "springcleaning22_gameplay_kobold_aura": "Το Prospecting Aura του Kobold δεν εφαρμόζεται πλέον σε ήρωες-κριπάκια (π.χ. στην αρκούδα του Lone Druid), διορθώνοντας ένα σφάλμα που παρείχε λανθασμένα τη διπλάσια επίδραση.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Οι κλώνοι και τα Tempest Double τώρα λαμβάνουν σωστά την επαύξηση στατιστικών από τις ευλογίες Aghanim's Scepter, που παρέχονται από τον Alchemist.",
  "springcleaning22_gameplay_chen_hand_of_god": "Το Hand of God του Chen τώρα εφαρμόζει τη θεραπεία διαρκείας σε κριπάκια που ελέγχονται από τον Chen, όχι μόνο την αρχική θεραπεία.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Η ποινή επίθεσης λόγω απόστασης του Tempest Double του Arc Warden τώρα σέβεται την αναβίωση του Arc Warden.",
  "springcleaning22_gameplay_arc_warden_basher": "Προστέθηκε επεξήγηση που διευκρινίζει ότι οι κλώνοι και τα Tempest Double δεν μπορούν να προκαλέσουν σάστισμα επίθεσης με Basher ή Abyssal Blade.",
  "springcleaning22_gameplay_arc_warden_blink": "Το Blink Dagger στο Tempest Double του Arc Warden δεν μπαίνει πλέον σε επαναφόρτιση με την κλήτευση.",
  "springcleaning22_gameplay_arc_warden_wards": "Το Tempest Double του Arc Warden δεν μπορεί πλέον να λάβει μοιρασμένα Ward.",
  "springcleaning22_gameplay_pa_scepter_double": "Η αναβάθμιση Aghanim's Scepter της Phantom Assassin δεν ανανεώνει πλέον το Blur όταν σκοτώνει ένα Tempest Double.",
  "springcleaning22_gameplay_naga_siren_riptide": "Το ταλέντο -1 απαιτούμενα χτυπήματα για Rip Tide της Naga Siren τώρα μειώνει σωστά κατά 1, όχι κατά 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Η επιπλέον ζημιά μονομαχίας της Legion Commander ανταμείβεται τώρα ακόμα και αν ο νικητής είναι απρόσβλητος.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Το Walrus Kick του Tusk έχει τώρα τη σωστή επαναφόρτιση των 12 δευτερολέπτων.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Η Metamorphosis του Terrorblade έχει τώρα σωστά τη διάρκεια 35/40/45/50 δευτερολέπτων.",
  "springcleaning22_gameplay_monkey_king_arena": "Ο Monkey King δεν μπορεί πλέον να ξεφύγει από το Arena of Blood με Tree Dance.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "Σε Ability Draft, τα εφέ του Riptide της Naga Siren θα αναπαράγονται τώρα στον σωστό ήρωα αντί να αναπαράγονται πάντα στη Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Ο Riki μπορεί τώρα να εκτελέσει Smoke Screen ενώ διοχετεύει το Tricks of the Trade, χωρίς να σπάσει τη διοχέτευση, ακόμα και αν είναι ενεργοποιημένη η επιλογή «Ικανότητες διοχέτευσης απαιτούν στάση/διακοπή».",
  "springcleaning22_gameplay_marci_dispose_lotus": "Διορθώθηκε η αλληλεπίδραση του Dispose της Marci με Black King Bar και Lotus Orb.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Το Concussive Grenade του Sniper τώρα προσθέτει ένα εικονίδιο αφόπλισης πάνω από την μπάρα ζωής.",
  "springcleaning22_gameplay_morphling_spirit_link": "Ο Morphling δεν κρατάει πλέον μόνιμα την παθητική ικανότητα του Spirit Link όταν μεταμορφώνεται σε Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Προστέθηκε εικονίδιο διοχέτευσης για το Fiend's Gate του Underlord, που έλειπε.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Προστέθηκε μία επεξήγηση για την απομείωση του Icefire Bomb, που έλειπε.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Τα εφέ σωματιδίων του Cursed Crown της Dark Willow με Aghanim's Shard τώρα έχουν τον σωστό χρονισμό.",
  "springcleaning22_gameplay_lone_druid_midas": "Η χρήση του Hand of Midas στην αρκούδα του Lone Druid τώρα παρέχει την εμπειρία στον ελεγχόμενο ήρωα.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Η αρκούδα και τα Tempest Double μπορούν πλέον να αποκτήσουν φορτίσεις Magic Stick, Magic Wand και Holy Locket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Η επεξήγηση του Astral Step του Void Spirit τώρα δείχνει σωστά τις τιμές ενίσχυσης ξορκιών, όταν πατιέται το ALT.",
  "springcleaning22_gameplay_heavenly_jump_range": "Το Heavenly Jump του Zeus τώρα δείχνει το βεληνεκές του με κατάδειξη.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Διορθώθηκαν οι επεξηγήσεις του Arcane Aura της Crystal Maiden.",
  "springcleaning22_gameplay_hex_tooltip": "Διορθώθηκε η επεξήγηση του Hex του Shadow Shaman, που προσέθετε εσφαλμένα 1 δευτερόλεπτο στη διάρκεια, όταν επιλεγόταν το ταλέντο «Το Hex προκαλεί Θραύση».",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Διορθώθηκε το ταλέντο επιπέδου 20 του Abaddon, που δεν ενημέρωνε την επαναφόρτιση του Borrowed Time στο παράθυρο επεξήγησης.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Διορθώθηκε το Presence of the Dark Lord του Shadow Fiend, για να εφαρμόζεται σωστά σε ουδέτερα κριπάκια.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Διορθώθηκε το Warp Flare του Tinker, που λειτουργούσε στον Roshan.",
  "springcleaning22_gameplay_ability_draft_wukong": "Σε Ability Draft, διορθώθηκαν οι κλώνοι του Wukong's Command που δεν είχαν τις σωστές ικανότητες.",
  "springcleaning22_rubick_illusions": "Διορθώθηκε ένα σφάλμα που δεν επέτρεπε στις ψευδαισθήσεις του Rubick να έχουν τις σωστές κινήσεις, βάσει των κλεμμένων ξορκιών (π.χ. το Fiend's Grip του Bane με Aghanim's Scepter).",
  "springcleaning22_rubick_hunter_in_the_night": "Το Hunter in the Night μπορεί τώρα να κλαπεί, όταν αναβαθμίζεται από το Aghanim's Shard.",
  "springcleaning22_rubick_juxtapose": "Το Juxtapose μπορεί τώρα να κλαπεί, όταν αναβαθμίζεται από το Aghanim's Scepter.",
  "springcleaning22_rubick_fireball": "Το Fireball του Dragon Knight μπορεί τώρα να κλαπεί, ανεξάρτητα από το Dragon Form, και δεν παρέχεται αυτόματα.",
  "springcleaning22_rubick_wolf_bite": "Το Wolf Bite τώρα λειτουργεί όταν κλαπεί.",
  "springcleaning22_rubick_depth_shroud": "Το Depth Shroud τώρα λειτουργεί όταν κλαπεί.",
  "springcleaning22_rubick_astral_spirit": "Αφαιρέθηκε η ξεχωριστή ικανότητα κίνησης του Astral Spirit όταν κλαπεί. Ο Rubick μπορεί τώρα να κρατήσει και τις δύο θέσεις ξορκιών, όταν κλέβει αυτήν την ικανότητα.",
  "springcleaning22_rubick_reverse_time_walk": "Το Reverse Time Walk τώρα εναλλάσσεται στην ίδια θέση ικανότητας με το Time Walk, αν ο Rubick έχει Aghanim's Shard. Ο Rubick μπορεί τώρα να κρατήσει και τις δύο θέσεις ξορκιών, όταν κλέβει αυτήν την ικανότητα.",
  "springcleaning22_rubick_jaunt": "Το Ethereal Jaunt τώρα εναλλάσσεται στην ίδια θέση ικανότητας με το Illusory Orb. Ο Rubick μπορεί τώρα να κρατήσει και τις δύο θέσεις ξορκιών όταν κλέβει αυτήν την ικανότητα.",
  "springcleaning22_rubick_eject": "Το Eject τώρα εναλλάσσεται στην ίδια θέση ικανότητας με το Dismember, αν ο Rubick έχει το Aghanim's Shard. Ο Rubick μπορεί τώρα να κρατήσει και τις δύο θέσεις ξορκιών, όταν κλέβει αυτήν την ικανότητα.",
  "springcleaning22_rubick_dismember": "Το Dismember τώρα αποβάλλει τον συμμαχικό ήρωα, αν κλαπεί ένα άλλο ξόρκι στη θέση του.",
  "springcleaning22_rubick_spit_out": "Το Spit Out τώρα εναλλάσσεται στην ίδια θέση ικανότητας με το Gobble Up. Ο Rubick μπορεί τώρα να κρατήσει και τις δύο θέσεις ξορκιών, όταν κλέβει αυτήν την ικανότητα.",
  "springcleaning22_rubick_decoy": "Το κλέψιμο του Decoy δεν κλέβει πλέον επίσης το Bushwhack. Το Decoy εξακολουθεί να εφαρμόζει Bushwhack, όταν εκτελείται.",
  "springcleaning22_rubick_spirits": "Η κλοπή του Spirits του Io τώρα λειτουργεί σωστά, όταν έχει ένα Aghanim's Scepter.",
  "springcleaning22_rubick_gravekeepers_cloak": "Το Gravekeeper's Cloak μπορεί τώρα να κλαπεί, όταν αναβαθμίζεται από το Aghanim's Scepter.",
  "springcleaning22_rubick_shard_cursed_crown": "Αν ο Rubick έχει Aghanim's Shard, το Cursed Crown τώρα επίσης θα δημιουργεί θάμνους.",
  "springcleaning22_rubick_shard_venomous_gale": "Αν ο Rubick έχει Aghanim's Shard, το Venomous Gale τώρα επίσης θα δημιουργεί Plague Ward.",
  "springcleaning22_rubick_shard_sprout": "Αν ο Rubick έχει Aghanim's Shard, το Sprout τώρα επίσης θα δημιουργεί Treant.",
  "springcleaning22_rubick_shard_shackles": "Αν ο Rubick έχει Aghanim's Shard, το Shackles τώρα επίσης θα δημιουργεί Serpent Ward.",
  "springcleaning22_rubick_shard_cold_embrace": "Αν ο Rubick έχει Aghanim's Shard, το Cold Embrace τώρα επίσης θα εκτοξεύει ένα Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "Αν ο Rubick έχει Aghanim's Shard, το Earthshock θα εφαρμόζει επίσης Enrage.",
  "springcleaning22_rubick_shard_shadow_step": "Αν ο Rubick έχει Aghanim's Shard, το Shadow Step θα εφαρμόζει επίσης Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "Αν ο Rubick έχει Aghanim's Shard, το Terror Wave θα εφαρμόζει επίσης Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "Αν ο Rubick έχει Aghanim's Shard, το Homing Missile θα έχει επίσης Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Αν ο Rubick έχει Aghanim's Shard, το Slithereen Crush θα εφαρμόζει επίσης Corrosive Haze.",
  "springcleaning22_rubick_scepter_flak_cannon": "Αν ο Rubick έχει Aghanim's Scepter, το Flak Cannon θα έχει επίσης την παθητική ικανότητα Side Gunner.",
  "springcleaning22_rubick_scepter_time_walk": "Αν ο Rubick έχει Aghanim's Scepter, το Time Walk θα εφαρμόζει επίσης Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Αν ο Rubick έχει Aghanim's Scepter, το Shuriken Toss θα εφαρμόζει επίσης Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Αν ο Rubick έχει Aghanim's Scepter, το Sacred Arrow θα εφαρμόσει επίσης Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "Η στόχευση με διάνυσμα για γρήγορη εκτέλεση κατά το πάτημα κουμπιού άλλαξε, ώστε το διάνυσμα να αρχίσει να σχεδιάζεται με το πάτημα κουμπιού και να ολοκληρώνεται με την απελευθέρωση κουμπιού. Είναι ίδιο με την συμπεριφορά για γρήγορη εκτέλεση με την απελευθέρωση κουμπιού.",
  "springcleaning22_ui_ward_bounty": "Το συμβάν αρχείου μάχης για καταστροφή ενός Observer Ward τώρα δείχνει ποιος έλαβε την αμοιβή, αν διαφέρει από τον καταστροφέα.",
  "springcleaning22_ui_spectator_hud_player_view": "Η διεπαφή θεατή τώρα δείχνει σωστά τον παίκτη που παρακολουθείτε.",
  "springcleaning22_ui_post_game_scepter_shard": "Οι επεξηγήσεις για το Aghanim's Scepter και Aghanim's Shard τώρα εμφανίζουν τις επιδράσεις τους στον πίνακα βαθμολογίας λήξης παιχνιδιού.",
  "springcleaning22_ui_post_game_backpack_neutral": "Τα αντικείμενα στο σακίδιο και τα ουδέτερα αντικείμενα τώρα εμφανίζονται στις λεπτομέρειες ήρωα λήξης παιχνιδιού.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Οι τιμές κλοπής ζωής ξορκιών για ήρωες και κριπάκια τώρα εμφανίζονται ξεχωριστά, όσο κρατάτε πατημένο το ALT.",
  "springcleaning22_ui_skeleton_warrior_rally": "Η αύρα Rally του Skeleton Warrior τώρα ανιχνεύεται από έναν μετρητή επαύξησης, αντί για πολλαπλά ξεχωριστά εικονίδια επαύξησης.",
  "springcleaning22_ui_neutral_item_teleport": "Διορθώθηκε ένα πρόβλημα, όπου η γρήγορη εναλλαγή ουδέτερων αντικειμένων και η διαδοχική τηλεμεταφορά ενός εξ αυτών είχε ως αποτέλεσμα να τηλεμεταφέρεται το λάθος αντικείμενο.",
  "springcleaning22_ui_spectator_arcana": "Τα παράθυρα Arcana στη διεπαφή δεν εμφανίζονται πλέον, στους θεατές, σε αγώνες Πρωταθλήματος.",
  "springcleaning22_ui_ready_check_enter": "Μπορείτε τώρα να πατήσετε ENTER για να αποδεχθείτε έναν έλεγχο ετοιμότητας.",
  "springcleaning22_ui_alt_item_combine": "Τα αντικείμενα στο μενού γρήγορης αγοράς τώρα εμφανίζουν το πλήρες αντικείμενο στο οποίο συνδυάζονται, όταν κρατάτε πατημένο το ALT.",
  "springcleaning22_ui_alt_items_ready": "Κρατώντας πατημένο το Control ενώ κάνετε alt+κλικ στα ακόλουθα αντικείμενα, θα ειδοποιηθεί η ομάδα σας ότι είναι έτοιμα, αντί να μαζευτούν: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pip of Insight και Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Αυξήθηκε ο αριθμός κατοχής Sentry Wards που εμφανίζονται κατά την ώρα στρατηγικής από 2 σε 3. Υπάρχουν το πολύ 3 Sentry Ward που μπορούν να αγοραστούν στην αρχή του παιχνιδιού.",
  "springcleaning22_ui_guide_pregame": "Μετά την επιλογή ενός ήρωα, η ενότητα προτεινόμενων αντικειμένων θα εμφανίζει τώρα την πρώτη ενότητα ενός οδηγού, αν ο οδηγός δεν έχει καμία ενότητα με το όνομα «Αρχικά αντικείμενα».",
  "springcleaning22_ui_ward_planter": "Η επιλογή των Ward τώρα δείχνει σε συμμαχικούς παίκτες, θεατές και συμμαχικούς καθοδηγητές ποιος το τοποθέτησε.",
  "springcleaning22_ui_courier_home_button": "Το κουμπί μαγαζιού βάσης του μεταφορέα τώρα επίσης επιστρέφει τυχόν αντικείμενα που έχει στη φύλαξη, όταν φτάσει στη βάση.",
  "springcleaning22_ui_combat_log_key": "Το αρχείο μάχης μπορεί τώρα να δεσμευτεί σε ένα πλήκτρο, στις επιλογές.",
  "springcleaning22_ui_combat_log_right_align": "Το αρχείο μάχης τώρα έχει στοίχιση στα δεξιά και δεν επικαλύπτεται πλέον με τους ελέγχους της λειτουργίας δοκιμής ήρωα.",
  "springcleaning22_ui_combat_log_hud_flip": "Το αρχείο μάχης τώρα σέβεται την αναστροφή διεπαφής (μικρός χάρτης στα δεξιά) και θα μετακινείται στη δεξιά πλευρά, όταν αυτή η επιλογή είναι ενεργή.",
  "springcleaning22_ui_guide_apos": "Διορθώθηκαν σχόλια οδηγών αντικειμένων/ικανοτήτων που αντικαθιστούσαν την απόστροφο με «&apos;» και άλλα σύμβολα HTML, κατά την αποθήκευση. Οι οδηγοί που έχουν ήδη αποθηκευτεί με αυτό το πρόβλημα εξακολουθούν να χρειάζονται ενημέρωση με μη αυτόματο τρόπο.",
  "springcleaning22_ui_vs_screen_widescreen": "Προσαρμόστηκε η προβολή των ηρώων στην οθόνη Εναντίον, για οθόνες 21:9 ή μεγαλύτερες.",
  "springcleaning22_ui_charms": "Διορθώθηκε ένα σφάλμα στη διεπαφή Φυλακτών, που εμφάνιζε επικαλυπτόμενο κείμενο αν είχατε 2+ Φυλακτά.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Διορθώθηκε ένα σφάλμα στην Προπόνηση Τελικών Επιθέσεων, όπου το κλικ στην εκκίνηση, πριν την αναβίωση του ήρωά σας, θα απέτρεπε την αναβίωση κριπακίων.",
  "springcleaning22_ui_intro_scenes": "Οι σκηνές εισαγωγής (όπως τα ντεμπούτα για ήρωες και Arcana/Περσόνα) δεν θα εμφανίζονται πλέον για ήρωες που δεν έχουν περάσει την αρχική ροή εμπειρίας νέου παίκτη.",
  "springcleaning22_cosmetics_illusion_skins": "Διορθώθηκε ένα σφάλμα όπου οι ψευδαισθήσεις μπορεί να μην κληρονομούσαν σωστά συγκεκριμένα κοσμητικά μοντέλα.",
  "springcleaning22_cosmetics_cloth_stretch": "Διορθώθηκε ένα σφάλμα, όπου το ύφασμα σε μερικά μοντέλα τεντωνόταν εσφαλμένα σε ολόκληρη την οθόνη.",
  "springcleaning22_cosmetics_underlord_immortal": "Το αντικείμενο Immortal «Emerald Subjugation» του Underlord τώρα έχει προσαρμοσμένα εφέ ικανότητας που αντικαθιστούν την απόλυτη ικανότητα.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Τα εφέ βλήματος του Shadow Poison του Shadow Demon με το αντικείμενο Immortal «Mantle of Grim Facade» τώρα έχουν σωστό προσανατολισμό.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Το αντικείμενο Immortal «Blistering Shade» του Wraith King έχει υψηλότερη προτεραιότητα από το Arcana, όταν εκτελεί «Wraithfire Blast».",
  "springcleaning22_cosmetics_earthshaker_immortal": "Διορθώθηκαν τα εφέ περιβάλλοντος του αντικειμένου Immortal «Bracers of the Cavern Luminar» του Earthshaker.",
  "springcleaning22_cosmetics_warlock_immortal": "Διορθώθηκαν τα χαλασμένα εφέ του Shadow Word του Warlock με το αντικείμενο Immortal «Umbral Glyph» (επαύξηση και απομείωση).",
  "springcleaning22_cosmetics_viper_immortal": "Διορθώθηκαν τα σωματίδια περιοχής επίδρασης του Nethertoxin του Viper με το αντικείμενο Immortal «Malefic Drake's Strike».",
  "springcleaning22_cosmetics_abaddon_vessel": "Επανήλθαν τα εφέ του Aphotic Shield του Abaddon με το αντικείμενο «Blade of the Demonic Vessel».",
  "springcleaning22_cosmetics_tidehunder_belt": "Αφαιρέθηκαν τα εσφαλμένα σωματίδια από την υποδοχή ζώνης του αντικειμένου «Horror From the Deep Belt» του Tidehunter, που προορίζονταν να είναι στους βραχίονες.",
  "springcleaning22_cosmetics_faceless_incursion": "Διορθώθηκαν τα εφέ περιβάλλοντος του όπλου του αντικειμένου «Claszureme Incursion» του Faceless Void.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Η αύρα Marskmanship του Arcana της Drow Ranger τώρα έχει προσαρμοσμένα εφέ και για τα δύο στιλ.",
  "springcleaning22_cosmetics_rubick_dilemma": "Επανήλθαν τα εφέ περιβάλλοντος του αντικειμένου «Torch of Fantoccini's Dilemma» του Rubick.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Η κίνηση τραυματισμού του Arcana των Techies τώρα παίζει στη σωστή ταχύτητα.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Προστέθηκε υποστήριξη για χρώματα πετραδιών σε Sticky Bomb και Reactive Tazer, για το Arcana των Techies.",
  "springcleaning22_cosmetics_techies_icons": "Προστέθηκαν εικονίδια αντικειμένων οικονομίας που έλειπαν για τα σετ των Techies «Powdersled Rookery», «Sapper's Guile», «Bombtrails and Boomsticks» και «March of the Powderkeg Patrol».",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Διορθώθηκε η κίνηση για τον Spoon των Techie στην προεπισκόπηση τηλεμεταφοράς στο σετ «Pachyderm Powderwagon».",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Το Arcana του Rubick τώρα έχει προσαρμοσμένα εφέ για το Sticky Bomb των Techies, αντί για το Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Διορθώθηκε η κίνηση καταστολής της Snapfire, ώστε να μην κολλάει πλέον σε εσφαλμένη αλληλουχία κίνησης.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Η δέσμη και τα αντικείμενα «Radiant Conqueror» της Legion Commander είναι τώρα εμπορεύσιμα και ανταλλάξιμα.",
  "springcleaning22_cosmetics_legion_commander_wind": "Προστέθηκαν εφέ ανέμου στα λάβαρα «Legacy of the Fallen» και «Radiant Conqueror» της Legion Commander, με ή χωρίς τα όπλα του Arcana εξοπλισμένα.",
  "springcleaning22_perf_panorama_atlas": "Ενημερώθηκε η μηχανή της διεπαφής Panorama, για να χρησιμοποιεί «atlassing» και να αλληλεπιδρά πιο αποτελεσματικά με τη GPU. Στις μετρήσεις μας, αυτό είχε ως αποτέλεσμα 25-30% καλύτερες επιδόσεις στην απαιτούμενη διεργασία της GPU, για τη διεπαφή, και πολύ καλύτερες σε ορισμένες πολύπλοκες σελίδες μπάρας. Αυτή η αλλαγή αυξάνει, επίσης, τις επιδόσεις CPU για Vulkan και θα πρέπει να είναι ιδιαίτερα αποτελεσματική για υπολογιστές Apple με επεξεργαστές M1.",
  "springcleaning22_perf_sand_king_particles": "Βελτιστοποιήθηκαν τα εφέ σωματιδίων του «Sand Storm» για βελτίωση των επιδόσεων.",
  "springcleaning22_perf_panorama_clears": "Ενημερώθηκε η μηχανή διεπαφής Panorama, για αποφυγή μη απαραίτητων εκκαθαρίσεων των στόχων απόδοσης, αποφεύγοντας εργασία GPU.",
  "springcleaning22_perf_scenesystem_threading": "Διορθώθηκε ένα σφάλμα, όπου, μερικές φορές, χρησιμοποιούνταν λιγότερα νήματα από όσα προορίζονταν για πολυνηματικές διεργασίες. Αυτή η διόρθωση είναι ιδιαίτερα χρήσιμη για υπολογιστές με 4 ή λιγότερους πυρήνες.",
  "springcleaning22_perf_thread_affinity": "Διορθώθηκε ένα σφάλμα όπου εσφαλμένα ορισμένες σχέσεις νημάτων μπορούσαν να προκαλέσουν καθυστερήσεις σε μερικούς υπολογιστές.",
  "springcleaning22_perf_power_savings": "Προστέθηκε προειδοποίηση στο παράθυρο διαλόγου των ρυθμίσεων γραφικών, για να υποδεικνύει εάν ο υπολογιστής χρησιμοποιεί λειτουργία εξοικονόμησης ενέργειας, που μπορεί να οδηγήσει σε αργές επιδόσεις.",
  "springcleaning22_perf_shop_tooltips": "Βελτιώθηκαν οι επιδόσεις των επεξηγήσεων, όσο περιηγείστε στο μαγαζί αντικειμένων.",
  "springcleaning22_custom_games_overview_sort": "Η καρτέλα Επισκόπηση στο Arcade τώρα επιτρέπει ταξινόμηση ανά τρέχοντες ενεργούς παίκτες, πέρα από τον αριθμό των ανοιχτών λόμπι.",
  "springcleaning22_custom_games_update": "Διορθώθηκε πρόβλημα με τα προσαρμοσμένα παιχνίδια του Dota Arcade, που μερικές φορές δεν εμφάνιζαν ότι χρειάζονταν ενημέρωση, αν δεν γινόταν επανεγκατάσταση τους ή επανεκκίνηση του Steam.",
  "springcleaning22_custom_games_lobby_version": "Η λίστα λόμπι του Dota Arcade δεν θα εμφανίζει πλέον λόμπι που δεν ταιριάζουν με την έκδοση του προσαρμοσμένου παιχνιδιού, το οποίο είναι εγκατεστημένο εκείνη τη στιγμή ή που δεν είναι γενικά δυνατή η σύνδεση.",
  "springcleaning22_custom_games_bounty_filter": "Το SetFilterMoreGold μπορεί τώρα να φιλτράρει τον χρυσό που λαμβάνεται από ρούνους Bounty.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Αντικαταστάθηκε το κειμήλιο για Dazzle – «Απομειώσεις τεσσάρων εχθρών Bad Juju» σε «Ζημιά και θεραπεία από Bad Juju».",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Αντικαταστάθηκε το κειμήλιο για Techies – «Σκοτωμοί Remote Mines» σε «Προσκολλήσεις Sticky Bomb σε ήρωες».",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Αντικαταστάθηκε το κειμήλιο για Techies – «Σαστίσματα Stasis Trap» σε «Αφοπλισμοί πολλαπλών ηρώων με Reactive Tazer».",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Αντικαταστάθηκε το κειμήλιο για Tinker – «Ζημιά March of the Machines» σε «Απορρόφηση ζημιάς Defense Matrix».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Αντικαταστάθηκε το κειμήλιο για Underlord – «Σκοτωμοί μετά από Dark Rift» σε «Σκοτωμοί συμμάχων μετά από χρήση Fiend's Gate».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Αντικαταστάθηκε το κειμήλιο για Underlord – «Διασώσεις ηρώων με Dark Rift» σε «Πρόκληση επιπλέον ζημιάς Atrophy Aura».",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Διορθώθηκε το κειμήλιο για Omniknight – «Ζημιά συμμάχων κατά Heavenly Grace».",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Διορθώθηκε το κειμήλιο για Primal Beast – «Χτυπήματα Onslaught σε πολλαπλούς ήρωες».",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Αντικαταστάθηκε η πρόκληση ήρωα για Meepo – «Μαγική ζημιά σε ήρωες» σε «Καθαρή ζημιά σε ήρωες».",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Αντικαταστάθηκε η πρόκληση ήρωα για Naga Siren – «Θεραπεία ηρώων κατά Song of the Siren» σε «Πρόκληση καθαρής ζημιάς σε ήρωες».",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Αντικαταστάθηκε η πρόκληση ήρωα για Tinker – «Ζημιά March of the Machines» σε «Απορρόφηση ζημιάς Defense Matrix».",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Αντικαταστάθηκε η πρόκληση ήρωα για Techies – «Σκοτωμοί Remote Mines» σε «Προσκολλήσεις Sticky Bomb σε ήρωες».",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Αντικαταστάθηκε η πρόκληση ήρωα για Underlord – «Τηλεμεταφορές πολλαπλών ηρώων Dark Rift» σε «Σκοτωμοί συμμάχων μετά από χρήση Fiend's Gate».",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Ενημερώθηκε η πρόκληση ήρωα για Grimstroke – H «Ζημιά σε εχθρούς υπό Soulbind» τώρα περιλαμβάνει ζημιά από συμμάχους.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Ενημερώθηκε η πρόκληση ήρωα για Mirana – Η «Ζημιά μετά από Leap» τώρα περιλαμβάνει όλους τους τύπους ζημιάς αντί μόνο φυσικής.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Διορθώθηκε η πρόκληση ήρωα για Bane – «Συνδυασμοί Blink / Force Staff και Fiend's Grip».",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Διορθώθηκε η πρόκληση ήρωα για Dragon Knight – «Σκοτωμοί κατά Dragon Form».",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Διορθώθηκε η πρόκληση ήρωα για Drow Ranger – «Πρόκληση σιγής σε 2+ εχθρούς με Gust».",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Διορθώθηκε η πρόκληση ήρωα για Crystal Maiden – «Σκοτωμοί κριπακίων με Frostbite».",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Διορθώθηκε η πρόκληση ήρωα για Dark Seer – «Ζημιά κατά Surge».",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Διορθώθηκε η πρόκληση ήρωα για Lifestealer – «Ζημιά κατά Rage».",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Διορθώθηκε η πρόκληση ήρωα για Lone Druid – «Ζημιά κατά True Form».",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Διορθώθηκε η πρόκληση ήρωα για Mars – «Ζημιά σε εχθρικούς ήρωες».",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Διορθώθηκε η πρόκληση ήρωα για Mars – «Σκοτωμοί εχθρικών μονάδων με παράπλευρη ζημιά».",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Διορθώθηκε η πρόκληση ήρωα για Omniknight – «Ζημιά κατά Heavenly Grace».",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Διορθώθηκε η πρόκληση ήρωα για Omniknight – «Διάρκεια Heavenly Grace σε συμμάχους».",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Διορθώθηκε η πρόκληση ήρωα για Rubick – «Σαστίσματα πολλαπλών ηρώων με Telekinisis».",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Διορθώθηκε η πρόκληση ήρωα για Tinker – «Ζημιά σε ήρωες με αναβαθμισμένο Laser από Aghanim's Scepter».",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Διορθώθηκε η πρόκληση ήρωα για Tusk – «Συνδυασμοί Walrus PUNCH! και Walrus Kick».",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Αφαιρέθηκε η πρόκληση ήρωα για Venomancer – «Ζημιά σε εχθρικούς ήρωες που είναι επηρεασμένοι με θραύση από Silver Edge».",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Αφαιρέθηκε η πρόκληση ήρωα για Tinker – «Σκοτωμοί κριπακίων με March of the Machines».",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Προστέθηκε πρόκληση ήρωα για Underlord – «Ζημιά σε ήρωες με Firestorm».",
  "springcleaning22_workshop_modeldoc": "Τα εργαλεία Εργαστηρίου Dota για αντικείμενα και προσαρμοσμένα παιχνίδια ενημερώθηκαν, για να χρησιμοποιούν τον νέο επεξεργαστή μοντέλων «ModelDoc». Οι συνεισφορείς Εργαστηρίου θα πρέπει να μεταφέρουν τυχόν μοντέλα από το παλιό εργαλείο, το οποίο θα αφαιρεθεί σε μελλοντική ενημέρωση."
}