// 6553.js

{
  "language": "norwegian",
  "springcleaning22_desc": "Vårrengjøringen 2022 er her for å bøte på en mengde feil og innføre en håndfull generelle kvalitetsforbedringer. Ta en titt på noen av de større endringene – som forbedringer av Aghanims verktøytips, dempeinnstillinger, butikksøk og heltedemoen – før du kaster deg over den større listen av rettinger og spilltilpasninger i et omfattende sammendrag nedenfor.",
  "springcleaning22_aghs_tooltips": "Verktøytips for Aghanim's Scepter og Shard",
  "springcleaning22_aghs_tooltips_desc": "Det som rører seg i Aghanims sinn (og monolog) er utvilsomt utenfor fatteevnen til vanlige dødelige, men med dagens oppdatering er følgene av hans storslåtte Scepter og Shard tydeligere enn noensinne. Verktøytipsene for Aghanims oppgraderinger inneholder nå flere detaljer om de nøyaktige verdiene som endrer seg, og endrede evner inneholder også denne informasjonen i en egen seksjon. Mange oppgraderinger har også fått særskilt oppmerksomhet for å gjøre dem enklere å forstå for ikke-magikere som oss.",
  "springcleaning22_muting_ui": "Forbedringer av demping",
  "springcleaning22_muting_ui_desc": "Dota-spillere er en høylytt gjeng, og noen ganger kan feil type følelser ta helt over i kampens hete. I tilfeller der denne oppførselen blir forstyrrende, er det viktig å kunne raskt og enkelt dempe spillere og rapportere dem for nærmere ettersyn uten å forstyrre kampen ytterligere. Derfor kan du nå dempe stemme, dempe tekst og rapportere en spiller med et enkelt trykk. Du kan også høyreklikke for å dempe tekst og stemme hver for seg i tilfeller der en spilllers oppførsel ikke er forstyrrende, men det fremdeles ikke er ønskelig med kommunikasjon. For å ha en generell kontroll kan du nå også bruke en ny knapp for å dempe hele laget, så du enkelt kan stenge ute kommunikasjon fra hele laget med et enkelt trykk.\\n\\nVi benytter også anledningen til å revurdere hvordan vi håndterer kommunikasjonsrapporter. Målet vårt er å gjøre det raskt og enkelt å dempe forstyrrende spillere, samtidig som vi også får et tydelig tegn på hvilke spillere vi må ta sterkere grep mot.",
  "springcleaning22_demo_hero": "Forbedringer av heltedemoen",
  "springcleaning22_demo_hero_desc": "Vil du teste ut de nyeste strategiene eller lage noen egne? Eller kanskje du bare kjenner et overveldende behov for å se hvor mange inkarnasjoner av Axe som kan slaktes ned med et enkelt sving fra Tidebringer? Det skal nok ordne seg uansett! Heltedemoen er blitt oppdatert og omarbeidet med en rekke nye funksjoner:",
  "springcleaning22_demo_hero_map": "Den nordre delen av demokartet er blitt utvidet for å stille et større flatt område til rådighet.",
  "springcleaning22_demo_hero_hero_spawn": "La til knapper for å enkelt skape allierte helter, i tillegg til fiender.",
  "springcleaning22_demo_hero_hero_reset": "La til en knapp for å tilbakestille en helt tilbake til nivå 1.",
  "springcleaning22_demo_hero_hero_remove": "La til en knapp for å fjerne en helt når du er ferdig med testingen.",
  "springcleaning22_demo_hero_hero_select": "Når du skaper en ny helt, legges den til i gjeldende utvalg.",
  "springcleaning22_demo_hero_levelling": "Knapper for å øke nivå, gi Scepter og Shard og slå av/på udødelighet gjelder nå for alle de valgte heltene.",
  "springcleaning22_demo_creep_toggle": "Når du slår av kryp, ødelegges alle eksisterende stikryp.",
  "springcleaning22_demo_creep_spawn": "La til en knapp for å skape en enkelt krypbølge fra hver side.",
  "springcleaning22_demo_hero_runes": "La til knapper for å skape de 6 hovedrunene.",
  "springcleaning22_shop_search": "Oppdatert butikksøk",
  "springcleaning22_shop_search_desc": "Det bør være enkelt, morsomt og først og fremst effektivt å bruke gull. Så for å hjelpe deg med å gi handleturen litt mindre «meep merp» og mer lyd av klirrende mynt, er butikksøk blitt utvidet med forbedret støtte for nøkkelord – i tillegg til en visning som markerer egenskapene du søker etter. Bare søk etter «rustning», «styrke», «rekkevidde» osv. for å markere ønskelige egenskaper. Det har aldri vært enklere å plukke ut den perfekte gjenstanden og den perfekte planen. Alt du trenger nå er gullet.",
  "springcleaning22_item_tooltips": "Utvidede verktøytips for gjenstander",
  "springcleaning22_item_tooltips_desc": "Glemmer du stadig hvor mye mana den intelligensen gir? Eller hvor mye rustning du får fra smidighet? Ikke noe å lure på, bare hold nede ALT mens du ser på gjenstanders verktøytips for å folde egenskapene ut til alle bestanddelene.",
  "springcleaning22_colored_ability_damage": "Farger for evneskade",
  "springcleaning22_colored_ability_damage_desc": "Hvis du skal ta gode valg i kamp, må du vite hvilke utfordringer du står overfor. Så for å hjelpe deg med å analysere potensielle farer er nå skaden fra formler og gjenstander fargekodet i henhold til om den er fysisk, magisk eller ren.",
  "springcleaning22_pluralized_strings": "Forbedret språkstøtte for strenger med entall/flertall",
  "springcleaning22_pluralized_strings_desc": "Vi har lagt til funksjoner for å forbedre støtten av tallbøyning for mange språk og for å øke tilgjengeligheten rundt om i verden, og vi har oppdatert over 400 tekstlinjer for å ta høyde for disse endringene.",
  "springcleaning22_permanent_debuffs": "Permanente styrkelser",
  "springcleaning22_permanent_debuffs_desc": "Det er vanskelig å legge opp en strategi uten å forstå effekten av handlingene. For å gi mer informasjon vises nå drap fra Necrophos' Reaper's Scythe og Axes Culling Blade på resultatskjermen etter kampen.",
  "springcleaning22_post_game_sortable": "Sorterbare detaljer etter kampen",
  "springcleaning22_post_game_sortable_desc": "Vil du gjøre et dypdykk i detaljene bak en seier? Resultatskjermen etter kampen kan nå sorteres for gjøre den enklere å analysere.",
  "springcleaning22_gameplay_tp_boots": "Boots of Travel har mindre sannsynlighet for å velge et kryp når den brukes innenfor rekkevidden til et tårn.",
  "springcleaning22_gameplay_sellback": "Spillere kan nå selge en gjenstand til full pris i de 30 første sekundene av en kamp i stedet for den vanlige perioden på 10 sekunder.",
  "springcleaning22_gameplay_lifestealer_consume": "Lifestealers Consume bruker nå samme hurtigtast, uavhengig av infisert enhetstype.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Ogre Bruiser har nå lydeffekter for opplading og lammelse.",
  "springcleaning22_gameplay_neutral_aura_radius": "Alle auraene til nøytrale kryp viser nå radiusen når man holder over.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Wraith Band, Null Talisman og Bracer oppdaterer nå de ekstra attributtene sine i verktøytipsene når de dobles etter 25 spilte minutter.",
  "springcleaning22_gameplay_heal_overhead": "Fikset noen tilfeller der helbredelsestallene som dukket opp, ikke tok helbredelsesstyrkelse med i beregningen.",
  "springcleaning22_gameplay_fountain_invuln": "Spillere med styrkelsen Fountain Invulnerability, angriper ikke lenger fiender innenfor rekkevidde automatisk (så de dermed mister styrkelsen).",
  "springcleaning22_gameplay_blink_range": "Rekkeviddeindikatorer for Blink (og lignende varianter) tar nå styrkelser med økt bruksrekkevidde i betraktning.",
  "springcleaning22_gameplay_desolator_tooltip": "Klargjorde Desolators verktøytips for passiven Soul Stealer. Desolator får angrepsskade når en fiende dør mens den er påvirket av svekkelsen Corruption.",
  "springcleaning22_gameplay_ardm_stash": "Fikset en feil i ARDM der en gjenstand som ble levert tilbake til forrådet av en kurer mens man var død, førte til at gjenstanden forsvant.",
  "springcleaning22_gameplay_neutral_items_lock": "Kan ikke lenger låse kombinering av nøytrale gjenstander. Dette fikser en feil der kurerer ikke leverte nøytrale gjenstander som hadde låst kombinering.",
  "springcleaning22_gameplay_illusion_modifiers": "Fikset en feil der illusjoner med dobbelt opp av modifikasjoner hadde feil varigheter, som gjorde det mulig å identifisere den ekte helten.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Fikset en feil i Turbo og nybegynnermodus der noen gullkilder ikke ble skalert ordentlig.",
  "springcleaning22_gameplay_turbo_courier": "Fikset en feil i Turbo der en spillers kurer ikke lenger fungerte hvis de var koblet fra under heltevalget eller strategitiden.",
  "springcleaning22_gameplay_zero_tooltips": "Fikset en feil der enkelte verktøytips i spillet som var endret av talenter, ble vist som 0 i stedet for riktig verdi.",
  "springcleaning22_gameplay_euls_invulnerable": "Bruk av Eul's Scepter på formelimmune kloner påfører nå effekten på klonen ordentlig i stedet for å bare få nedkjøling.",
  "springcleaning22_gameplay_kobold_aura": "Kobolds Prospecting Aura gjelder ikke lenger på kryphelter (f.eks. Lone Druids bjørn). Dette fikser en feil der det feilaktig ga dobbel effekt.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Kloner og Tempest Double får nå riktige attributtbonuser fra Aghanim's Scepter utdelt av Alchemist.",
  "springcleaning22_gameplay_chen_hand_of_god": "Chens Hand of God påfører nå helbredelsen over tid ordentlig på kryp kontrollert av Chen, og ikke bare den innledende helbredelsen.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Angrepsstraffen til Arc Wardens Tempest Double tar nå høyde for Reincarnation av Arc Warden.",
  "springcleaning22_gameplay_arc_warden_basher": "La til et verktøytips som klargjør at kloner og Tempest Double ikke kan gi en trøkk med Skull Basher eller Abyssal Blade.",
  "springcleaning22_gameplay_arc_warden_blink": "Blink Dagger på Arc Wardens Tempest Double er ikke lenger på nedkjøling når den tilkalles.",
  "springcleaning22_gameplay_arc_warden_wards": "Arc Wardens Tempest Double kan ikke lenger motta delte wards.",
  "springcleaning22_gameplay_pa_scepter_double": "Phantom Assassins oppgradering med Aghanim's Scepter nullstiller ikke lenger Blur når hun dreper en Tempest Double.",
  "springcleaning22_gameplay_naga_siren_riptide": "Naga Sirens «Rip Tide: -1 angrep» reduserer den nå faktisk med 1, og ikke 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Legion Commanders bonusskade fra Duel tildeles nå selv om vinneren er usårbar.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Tusks Walrus Kick har nå riktig nedkjøling på 12 sekunder.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Terrorblades Metamorphosis har nå riktig nedkjøling på 35/40/45/50.",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey Kings Tree Dance kan ikke lenger brukes til å rømme fra Arena of Blood.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "I Ability Draft spilles nå effektene fra Naga Sirens Rip Tide av på den riktige helten i stedet for alltid på Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki kan nå bruke Smoke Screen mens han kanaliserer Tricks of the Trade uten å avbryte kanaliseringen selv hvis «Kanaliserte evner krever hold/avbryt» er slått på.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Fikset samspillet mellom Marcis Dispose og BKB og Lotus Orb.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Snipers Concussive Grenade viser nå et avvæpningsikon over hodet.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling beholder ikke lenger Spirit Link-passiven permanent ved forvandling til Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "La til et manglende kanaliseringsikon for Underlords Fiend's Gate.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "La til et manglende verktøytips for svekkelsen til Icefire Bomb.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Partikkeleffektene til Cursed Crown for Dark Willow med Aghanim's Shard har nå riktig timing.",
  "springcleaning22_gameplay_lone_druid_midas": "Bruk av Hand of Midas på Lone Druids Spirit Bear gir nå erfaring til den kontrollerende helten.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear og Tempest Double kan nå få ladninger av Magic Stick, Magic Wand og Holy Locket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Verktøytipset til Void Spirits Astral Step viser nå formelstyrkelsesverdier riktig når ALT trykkes.",
  "springcleaning22_gameplay_heavenly_jump_range": "Zeus' Heavenly Jump viser nå rekkevidde når man holder musen over.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Fikset verktøytipsene til Crystal Maidens Arcane Aura.",
  "springcleaning22_gameplay_hex_tooltip": "Fikset at verktøytipset til Shadow Shamans Hex feilaktig la til 1 sekund til varigheten når talentet «Hex påfører brudd» velges.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Fikset at talentet til Abaddon på nivå 20 ikke oppdaterte nedkjølingen til Borrowed Time i verktøytipset.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Fikset Shadow Fiends Persence of the Dark Lord slik at den påføres nøytrale kryp riktig.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Fikset at Tinkers Warp Flare fungerte på Roshan.",
  "springcleaning22_gameplay_ability_draft_wukong": "Fikset at kloner fra Wukong's Command ikke hadde riktige evner i Ability Draft.",
  "springcleaning22_rubick_illusions": "Fikset en feil som hindret illusjoner av Rubick fra å ha riktige animasjoner basert på stjålne formler (f.eks. Fiend's Grip med Aghanim's Scepter).",
  "springcleaning22_rubick_hunter_in_the_night": "Hunter in the Night kan nå stjeles når oppgradert med Aghanim's Scepter.",
  "springcleaning22_rubick_juxtapose": "Juxtapose kan nå stjeles når oppgradert med Aghanim's Scepter.",
  "springcleaning22_rubick_fireball": "Dragon Knights Fireball kan nå stjeles uavhengig av Dragon Form, og gis ikke automatisk.",
  "springcleaning22_rubick_wolf_bite": "Wolf Bite fungerer nå når stjålet.",
  "springcleaning22_rubick_depth_shroud": "Depth Shroud fungerer nå når stjålet.",
  "springcleaning22_rubick_astral_spirit": "Fjernet den separate bevegelsesevnen til Astral Spirit når stjålet. Rubick kan nå beholde begge formelplasser når han stjeler denne evnen.",
  "springcleaning22_rubick_reverse_time_walk": "Reverse Time Walk byttes nå til samme evneplass som Time Walk hvis Rubick har Aghanim's Shard. Rubick kan nå beholde begge formelplassene når denne evnen stjeles.",
  "springcleaning22_rubick_jaunt": "Jaunt byttes nå til samme evneplass som Illusory Orb. Rubick kan nå beholde begge formelplassene når denne evnen stjeles.",
  "springcleaning22_rubick_eject": "Eject byttes nå til samme evneplass som Dismember hvis Rubick har Aghanim's Shard. Rubick kan nå beholde begge formelplassene når denne evnen stjeles.",
  "springcleaning22_rubick_dismember": "Dismember kaster nå ut den allierte helten hvis en annen formel tar over plassen dens.",
  "springcleaning22_rubick_spit_out": "Spit Out byttes nå til samme evneplass som Gobble Up. Rubick kan nå beholde begge formelplassene når denne evnen stjeles.",
  "springcleaning22_rubick_decoy": "Bushwack stjeles ikke lenger samtidig når Decoy stjeles. Decoy påfører fremdeles Bushwack når den brukes.",
  "springcleaning22_rubick_spirits": "Å stjele Ios Spirits fungerer nå riktig når man får Aghanim's Scepter.",
  "springcleaning22_rubick_gravekeepers_cloak": "Gravekeeper's Cloak kan nå stjeles når oppgradert med Aghanim's Scepter.",
  "springcleaning22_rubick_shard_cursed_crown": "Hvis Rubick har Aganim's Shard, så skaper Cursed Crown nå også tornebusker.",
  "springcleaning22_rubick_shard_venomous_gale": "Hvis Rubick har Aganim's Shard, så skaper nå Venomous Gale også Plague Wards.",
  "springcleaning22_rubick_shard_sprout": "Hvis Rubick har Aganim's Shard, så skaper nå Sprout også Treants.",
  "springcleaning22_rubick_shard_shackles": "Hvis Rubick har Aganim's Shard, så skaper nå Shackles også Serpent Wards.",
  "springcleaning22_rubick_shard_cold_embrace": "Hvis Rubick har Aganim's Shard, så avgir nå Cold Embrace også en Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "Hvis Rubick har Aghanim's Shard, så påfører nå Earthshock også Enrage.",
  "springcleaning22_rubick_shard_shadow_step": "Hvis Rubick har Aghanim's Shard, så påfører nå Shadow Step en Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "Hvis Rubick har Aghanim's Shard, så påfører nå Terror Wave også Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "Hvis Rubick har Aghanim's Shard, så får Homing Missile også Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Hvis Rubick har Aghanim's Shard, så påfører Slithereen Crush også Corrosive Haze.",
  "springcleaning22_rubick_scepter_flak_cannon": "Hvis Rubick har Aghanim's Scepter, så får Flak Cannon også den passive evnen Side Gunner.",
  "springcleaning22_rubick_scepter_time_walk": "Hvis Rubick har Aghanim's Scepter, så påfører Time Walk også Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Hvis Rubick har Aghanim's Scepter, så påfører Shuriken Toss også Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Hvis Rubick har Aghanim's Scepter, så påfører Sacred Arrow også Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "Endret vektorsikting for hurtigkast ved tast ned slik at vektoren begynner ved tast ned og avsluttes ved tast opp. Dette er samme som virkemåten for hurtigkast ved tast opp.",
  "springcleaning22_ui_ward_bounty": "Kamphendelsen for når en Observer Ward ødelegges viser nå hvem som mottok dusøren hvis dette ikke var den som ødela den.",
  "springcleaning22_ui_spectator_hud_player_view": "Tilskuergrensesnittet viser nå hvilken spiller du ser på ordentlig.",
  "springcleaning22_ui_post_game_scepter_shard": "Verktøytipsene til Aghanim's Scepter og Shard har nå effektene sine synlige på resultatskjermen etter kampen.",
  "springcleaning22_ui_post_game_backpack_neutral": "Ryggsekk og nøytrale gjenstander vises nå i helteopplysninger etter kampen.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Verdier for formelhelseran for helter og kryp vises nå adskilt når man holder ALT.",
  "springcleaning22_ui_skeleton_warrior_rally": "Skeleton Warriors Rally spores nå som en styrkelse med teller istedenfor flere individuelle styrkelsesikoner.",
  "springcleaning22_ui_neutral_item_teleport": "Fikset at å bytte nøytrale gjenstander og teleportere en raskt nok etter hverandre førte til at feil gjenstand ble teleportert.",
  "springcleaning22_ui_spectator_arcana": "Arkanagrensesnitt vises ikke lenger i ligakamper som tilskuer.",
  "springcleaning22_ui_ready_check_enter": "Kan nå trykke på ENTER for å svare ja på «Alle klare?».",
  "springcleaning22_ui_alt_item_combine": "Gjenstander i hurtigkjøpsmenyen viser nå hele gjenstanden de kombineres til når man holder ALT.",
  "springcleaning22_ui_alt_items_ready": "Hvis du holder nede Ctrl + Alt og trykker på følgende gjenstander, forteller det laget at de er klare, i stedet for at dere skal samles: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pip of Insight og Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Økte antall Sentry Wards eid under strategitid fra 2 til 3. Maks 3 Sentry Wards kan kjøpes i begynnelsen av kampen.",
  "springcleaning22_ui_guide_pregame": "Etter å ha valgt en helt, så viser anbefalte gjenstander nå den første delen av en veiledning hvis veiledningen ikke har noen del med navn «Startgjenstander».",
  "springcleaning22_ui_ward_planter": "Å velge wards viser nå allierte spillere, tilskuere og allierte mentorer hvem som plasserte den.",
  "springcleaning22_ui_courier_home_button": "Hjemmebutikk-knappen til kureren returnerer nå også eventuelle gjenstander den har til forrådet når den når basen.",
  "springcleaning22_ui_combat_log_key": "Kamploggen kan nå bindes til en tast i innstillinger.",
  "springcleaning22_ui_combat_log_right_align": "Kamploggen er nå høyrejustert og overlapper ikke lenger med kontrollene i heltedemoen.",
  "springcleaning22_ui_combat_log_hud_flip": "Kamploggen tar nå høyde for omvendt grensesnitt (minikart til høyre) og flytter seg til venstre side når denne innstillingen er slått på.",
  "springcleaning22_ui_guide_apos": "Fikset at kommentarer på gjenstander/evner i veiledninger erstattet apostrofer med «&apos;» og andre HTML-symboler ved lagring. Veiledninger som allerede er lagret med dette problemet, må oppdateres manuelt.",
  "springcleaning22_ui_vs_screen_widescreen": "Justerte visning av helter på introskjermen for skjermer i 21:9 eller bredere.",
  "springcleaning22_ui_charms": "Fikset en feil der grensesnittet for amuletter overlappet tekst hvis man hadde 2 eller flere amuletter.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Fikset en feil i treningen for siste stikk der hvis man trykte for å starte før helten skapes, så hindret dette kryp fra å skapes.",
  "springcleaning22_ui_intro_scenes": "Introscener (som debuter av helt og arkana/persona) vises ikke lenger for spillere som ikke har gått gjennom nybegynneropplevelsen.",
  "springcleaning22_cosmetics_illusion_skins": "Fikset en feil der illusjoner ikke arvet utseende til enkelte pyntemodeller ordentlig.",
  "springcleaning22_cosmetics_cloth_stretch": "Fikset en feil der bekledning på enkelte modeller kunne strekke seg over skjermen.",
  "springcleaning22_cosmetics_underlord_immortal": "Underlords udødelige gjenstand «Emerald Subjugation» har nå tilpassede evneeffekter som erstatter ultimaten.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Shadow Demons udødelige gjenstand «Mantle of Grim Facade» har nå riktig retning på prosjektileffektene til Shadow Poison.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Wraith Kings udødelige gjenstand «Blistering Shade» har høyere prioritet over arkanaen når han bruker «Wraithfire Blast».",
  "springcleaning22_cosmetics_earthshaker_immortal": "Fikset omgivelseseffektene til Earthshakers udødelige gjenstand «Bracers of the Cavern Luminar».",
  "springcleaning22_cosmetics_warlock_immortal": "Fikset ødelagte evneeffekter for Shadow Word (styrkelse og svekkelse) med Warlocks udødelige gjenstand «Umbral Glyph».",
  "springcleaning22_cosmetics_viper_immortal": "Fikset ødelagte områdepartikler for Nethertoxin med Vipers udødelige gjenstand «Malefic Drake's Strike».",
  "springcleaning22_cosmetics_abaddon_vessel": "Gjenopprettet Aphotic Shield-effektene for Abaddons «Blade of the Demonic Vessel».",
  "springcleaning22_cosmetics_tidehunder_belt": "Fjernet feilaktige partikler fra beltestedet som egentlig skulle være på armen for Tidehunters «Horror From the Deep Belt».",
  "springcleaning22_cosmetics_faceless_incursion": "Fikset omgivelseseffekter for våpenet i Faceless Voids «Claszureme Incursion».",
  "springcleaning22_cosmetics_drow_arcana_aura": "Drow Rangers arkanaaura for «Marksmanship» har nå tilpassede effekter for begge stilene.",
  "springcleaning22_cosmetics_rubick_dilemma": "Gjenopprettet omgivelseseffekter for Rubicks «Torch of Fantoccini's Dilemma».",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Skadet løpeanimasjon for Techies' arkana spilles nå av med riktig hastighet.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "La til støtte for edelsteinfarger på Sticky Bomb og Reactive Tazer for arkanaen til Techies.",
  "springcleaning22_cosmetics_techies_icons": "La til manglende gjenstandsikoner for Techies-settene «Powdersled Rookery», «Sapper's Guile», «Bombtrails and Boomsticks» og «March of the Powderkeg Patrol».",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Fikset animasjonen for Techies' Spoon i teleporteringsforhåndsvisningen med settet «Pachyderm Powderwagon».",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Rubick-arkanaen har nå tilpassede effekter for Techies' Sticky Bomb istedenfor Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Fikset Snapfires uskadeliggjorte animasjon, så hun ikke lenger setter seg fast i feil animasjonssekvens.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Legion Commanders pakke og gjenstander i «Radiant Conqueror» kan nå selges og byttes.",
  "springcleaning22_cosmetics_legion_commander_wind": "La til vindeffekter for Legion Commanders faner i «Legacy of the Fallen» og «Radiant Conqueror», med eller uten arkanavåpnene utstyrt.",
  "springcleaning22_perf_panorama_atlas": "Oppdaterte grensesnittmotoren Panorama så den bruker teksturatlas for en mer effektiv samhandling med skjermkortet. Ifølge målingene våre har dette ført til 25–30 % bedre ytelse i GPU-arbeid for grensesnittet, og mye mer på noen spesielt kompliserte dashbord. Denne endringen øker også CPU-ytelse for Vulkan, og skal også være spesielt effektivt for Apple-datamaskiner med M1-prosessorer.",
  "springcleaning22_perf_sand_king_particles": "Optimaliserte partikkeleffektene til «Sand Storm» for å forbedre ytelse.",
  "springcleaning22_perf_panorama_clears": "Oppdaterte grensesnittmotoren Panorama så den unngår unødvendig tømming av gjengivelsesmål, og dermed unngår GPU-arbeid.",
  "springcleaning22_perf_scenesystem_threading": "Fikset en feil der vi noen ganger brukte færre tråder enn tiltenkt til flertrådet arbeid. Denne rettingen er spesielt nyttig for maskiner med 4 eller færre kjerner.",
  "springcleaning22_perf_thread_affinity": "Fikset en feil der feilaktig angitt trådaffinitet kunne føre til at noen maskiner satte seg fast.",
  "springcleaning22_perf_power_savings": "La til en advarsel i dialogboksen for videoinnstillinger for å indikere om datamaskinen kjører i strømsparingsmodus – noe som kan føre til dårlig ytelse.",
  "springcleaning22_perf_shop_tooltips": "Forbedret ytelsen til verktøytips når man blar gjennom gjenstandsbutikken.",
  "springcleaning22_custom_games_overview_sort": "Arkadeoversikten lar deg nå sortere etter gjeldende aktive spillere i tillegg til antall åpne lobbyer.",
  "springcleaning22_custom_games_update": "Fikset et problem med at tilpassede spill i arkaden noen ganger ikke viste at de trengte en oppdatering inntil de ble installert på nytt, eller inntil Steam ble startet på nytt.",
  "springcleaning22_custom_games_lobby_version": "Lobbylisten i arkaden viser ikke lenger lobbyer som ikke har samme installerte versjon av det tilpassede spillet eller som på annen måte ikke er gyldig.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold kan nå filtrere gull mottatt fra dusørruner.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Erstattet relikvie for Dazzle – «Svekkelser på fire fiender fra Juju» med «Skade og helbredelse fra Bad Juju».",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Erstattet relikvie for Techies – «Drap med Remote Mine» med «Sticky Bomb festet til helter».",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Erstattet relikvie for Techies – «Lammelser med Stasis Trap» med «Reactive Tazer avvæpnet flere helter».",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Erstattet relikvie for Tinker – «Skade med March of the Machines» med «Skade absorbert med Defense Matrix».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Erstattet relikvie for Underlord – «Drap etter Dark Rift» med «Drap fra allierte ved bruk av Fiend's Gate».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Erstattet relikvie for Underlord – «Helter reddet av Dark Rift» med «Ekstra skade utført med Atrophy Aura».",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Fikset relikvie for Omniknight – «Alliert skade under Heavenly Grace».",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Fikset relikvie for Primal Beast – «Onslaught på flere helter».",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Erstattet helteutfordring for Meepo – «Magisk skade på helter» med «Ren skade på helter».",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Erstattet helteutfordring for Naga Siren – «Helter helbredet under Song» med «Gjør skade fra brent mana på helter».",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Erstattet helteutfordring for Tinker – «Skade med March of the Machines» med «Skade absorbert med Defense Matrix».",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Erstattet helteutfordring for Techies – «Drap med Remote Mine» med «Sticky Bomb festet seg».",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Erstattet helteutfordring for Underlord – «Teleportering av flere helter med Dark Rift» med «Drap fra allierte etter bruk av Fiend's Gate».",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Oppdaterte helteutfordring for Grimstroke – «Skade gjort mot fiender påvirket av Soulbind» inkluderer nå skade fra allierte.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Oppdaterte helteutfordring for Mirana – «Skade gjort under Leap» inkluderer nå alle typer skade istedenfor kun fysisk.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Fikset helteutfordring for Bane – «Kombo: Blink / Force Staff og Fiend's Grip».",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Fikset helteutfordring for Dragon Knight – «Drap under Dragon Form».",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Fikset helteutfordring for Drow Ranger – «Stilne 2+ fiender med Gust».",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Fikset helteutfordring for Crystal Maiden – «Kryp drept med Frostbite».",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Fikset helteutfordring for Dark Seer – «Skade gjort under Surge».",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Fikset helteutfordring for Lifestealer – «Skade gjort under Rage».",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Fikset helteutfordring for Lone Druid – «Skade gjort under True Form».",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Fikset helteutfordring for Mars – «Skade gjort mot fiendtlige helter».",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Fikset helteutfordring for Mars – «Drep fiendtlige enheter med kløyveskade».",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Fikset helteutfordring for Omniknight – «Skade gjort under Heavenly Grace». ",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Fikset helteutfordring for Omniknight – «Varighet for Heavenly Grace på allierte».",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Fikset helteutfordring for Rubick – «Lammelser fra Telekinesis på flere helter».",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Fikset helteutfordring for Tinker – «Skade på helter med Laser oppgradert av Aghanim's Scepter».",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Fikset helteutfordring for Tusk – «Kombo: Punch + Kick».",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Fjernet helteutfordring for Venomancer – «Skade på helter avbrutt av Silver Edge».",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Fjernet helteutfordring for Tinker – «Kryp drept med March of the Machines».",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "La til helteutfordring for Underlord – «Skade gjort mot helter med Firestorm».",
  "springcleaning22_workshop_modeldoc": "Workshopverktøyene til Dota for gjenstander og tilpassede spill er oppgradert til å bruke det nye modellredigeringsverktøyet «ModelDoc». Bidragsytere i workshopen bør overføre modeller fra det gamle verktøyet, ettersom dette kommer til å fjernes i en fremtidig oppdatering."
}