// 5868.js

{
  "language": "spanish",
  "springcleaning22_desc": "Ya está aquí la Actualización de Limpieza General de 2022 para parchear gran cantidad de errores e implementar unas cuantas mejoras de calidad de vida. Echa un vistazo a algunos de los cambios más importantes —como las mejoras de las descripciones emergentes de Aghanim, los controles de silenciamiento, las búsquedas en la tienda y el modo de prueba de héroe— y luego dale un repaso a la lista más larga de correcciones y ajustes de jugabilidad en el análisis completo de abajo.",
  "springcleaning22_aghs_tooltips": "Descripciones emergentes de cetros y fragmentos de Aghanim",
  "springcleaning22_aghs_tooltips_desc": "Los procesos internos de la mente de Aghanim (y sus monólogos) sin duda se escapan al entendimiento de los mortales, pero la actualización de hoy desvela como nunca el impacto que tienen sus cetros y fragmentos magníficos en el campo de batalla. Las descripciones emergentes de las mejoras de Aghanim incluyen ahora más detalles sobre las cantidades exactas que cambian al equiparse y las habilidades modificadas también incluyen esos datos en una sección especial. También hemos prestado atención especial a muchas de las mejoras para simplificarlas y que resulten más fáciles de entender a nuestras mentes menos grandiosas.",
  "springcleaning22_muting_ui": "Mejoras del silenciamiento",
  "springcleaning22_muting_ui_desc": "Los jugadores de Dota son bastante bulliciosos y a veces se caldea el ambiente con la emoción de la competición. Cuando ese tipo de comportamiento se vuelve molesto, es importante poder silenciar rápida y fácilmente a los jugadores, y denunciarlos para que se investigue la situación a fondo sin interrumpir más la partida. Por eso, ya es posible silenciar la voz y el texto de un jugador, así como denunciarlo, con un solo clic. También puedes hacer clic con el botón derecho del ratón para silenciar el texto o la voz por separado cuando el comportamiento de un jugador no sea molesto, pero sus mensajes sí. Para un control sencillo más general, también puedes usar los nuevos botones Silenciar equipo, que permiten bloquear la comunicación de un equipo entero con un solo clic.\\n\\nAdemás, estamos aprovechando esta oportunidad para volver a analizar cómo gestionamos las denuncias. Nuestro objetivo es que sea fácil y rápido silenciar a los jugadores problemáticos, pero también tener una idea clara sobre con qué jugadores deberíamos tomar medidas más duras.",
  "springcleaning22_demo_hero": "Mejoras del modo de prueba de héroes",
  "springcleaning22_demo_hero_desc": "¿Quieres probar las últimas estrategias o crear algunas tú mismo? O igual no te puedes resistir a ver cuántas encarnaciones de Axe se pueden aniquilar con un solo golpe de Clamamareas. En todo caso, ¡estás de suerte! El modo de prueba de héroes se ha actualizado con una revisión que incluye un montón de funcionalidades nuevas:",
  "springcleaning22_demo_hero_map": "La sección norte del mapa de prueba se ha ampliado para proporcionar más espacio llano en el que hacer pruebas.",
  "springcleaning22_demo_hero_hero_spawn": "Se añadieron controles para generar fácilmente héroes aliados, así como enemigos.",
  "springcleaning22_demo_hero_hero_reset": "Se añadió un control para devolver los héroes al nivel 1.",
  "springcleaning22_demo_hero_hero_remove": "Se añadió un control para eliminar los héroes que ya hayas terminado de probar.",
  "springcleaning22_demo_hero_hero_select": "Los nuevos héroes creados se añaden a la selección actual.",
  "springcleaning22_demo_hero_levelling": "Los botones para subir de nivel, añadir cetros y fragmentos, y activar o desactivar la invulnerabilidad afectan ahora a todos los héroes seleccionados.",
  "springcleaning22_demo_creep_toggle": "Al desactivar creeps, se destruyen todos los creeps de senda existentes.",
  "springcleaning22_demo_creep_spawn": "Se añadió un botón para generar una sola oleada de creeps de cada lado.",
  "springcleaning22_demo_hero_runes": "Se añadieron botones para generar las 6 runas principales.",
  "springcleaning22_shop_search": "Actualización de búsquedas en la tienda",
  "springcleaning22_shop_search_desc": "Gastar oro debería ser fácil, divertido y, sobre todo, efectivo. Por eso, para que puedas derrochar con todo el poderío, se ha ampliado la búsqueda de objetos en la tienda mejorando la compatibilidad con palabras clave —incluyendo una vista que destaca atributos buscados anteriormente—. Simplemente busca «Armadura», «Fuerza», «Alcance», etc., para destacar las estadísticas que te interesen. Elegir el objeto perfecto para el plan perfecto es más sencillo que nunca. Lo único que necesitas ahora es oro.",
  "springcleaning22_item_tooltips": "Ampliación de las descripciones emergentes de objetos",
  "springcleaning22_item_tooltips_desc": "Si se te olvida continuamente cuánto maná proporciona esa inteligencia o cuánta armadura recibes por la agilidad, no te preocupes: ahora, al mantener pulsado ALT mientras ves las descripciones emergentes de los objetos, las propiedades se amplían para mostrar todos los componentes.",
  "springcleaning22_colored_ability_damage": "Colores de daño de habilidades",
  "springcleaning22_colored_ability_damage_desc": "Para decidir bien durante las batallas, es necesario saber a qué desafíos te enfrentas. Para ayudarte a analizar los posibles peligros, el daño infligido por hechizos y objetos aparece ahora con un color diferente si se trata de un daño físico, mágico o puro.",
  "springcleaning22_pluralized_strings": "Mejora de la pluralización en diferentes idiomas",
  "springcleaning22_pluralized_strings_desc": "Para mejorar la accesibilidad global, hemos añadido características que nos permiten dar mayor soporte a las reglas de pluralización en multitud de idiomas y hemos actualizado más de 400 líneas de texto para cubrir estos cambios.",
  "springcleaning22_permanent_debuffs": "Efectos positivos permanentes",
  "springcleaning22_permanent_debuffs_desc": "Es difícil crear estrategias sin comprender la eficacia de tus acciones. Para que tengas más información después de una partida, las víctimas de la Guadaña de la Muerte de Necrophos y la Hoja Selectiva de Axe aparecen ahora en la pantalla posterior a la partida.",
  "springcleaning22_post_game_sortable": "Detalles pospartida ordenables",
  "springcleaning22_post_game_sortable_desc": "Si quieres profundizar en los detalles que se esconden detrás de tus victorias, ya puedes ordenar el marcador al final de la partida para analizarlo más fácilmente.",
  "springcleaning22_gameplay_tp_boots": "Es menos probable que un creep sea el objetivo de Botas de Viaje cuando se lanza dentro del alcance de una torre.",
  "springcleaning22_gameplay_sellback": "Los jugadores pueden vender ahora un objeto por su precio original durante los 30 primeros segundos de la partida, en lugar del periodo de reventa normal de 10 segundos.",
  "springcleaning22_gameplay_lifestealer_consume": "La habilidad Consumir de Lifestealer utiliza ahora la misma tecla rápida, independientemente del tipo de unidad infestada.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "El preataque y el aturdimiento del Luchador Ogro tienen ahora efectos de sonido.",
  "springcleaning22_gameplay_neutral_aura_radius": "Todas las auras de los creeps neutrales muestran ahora el radio al pasar el ratón por encima.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Las bonificaciones de atributos de Antifaz Espectral, Talismán Anulador y Brazalete se actualizan ahora en las descripciones emergentes de las habilidades cuando se duplican en el minuto 25.",
  "springcleaning22_gameplay_heal_overhead": "Se corrigieron una serie de casos en los que las cantidades de curación emergentes no tenían en cuenta la amplificación de la curación.",
  "springcleaning22_gameplay_fountain_invuln": "Los jugadores con el efecto positivo de Invulnerabilidad de la Fuente ya no autoatacan ni rompen el efecto cuando tienen enemigos a su alcance.",
  "springcleaning22_gameplay_blink_range": "El indicador de alcance del hechizo Traslación y sus diferentes variantes ya tiene en cuenta los efectos positivos de aumento del alcance de lanzamiento.",
  "springcleaning22_gameplay_desolator_tooltip": "Se aclaró la descripción emergente de la habilidad pasiva Ladrón de Almas de Desoladora. Desoladora gana daño de ataque cada vez que muere un enemigo afligido por el efecto negativo de Corrupción.",
  "springcleaning22_gameplay_ardm_stash": "Se corrigió un fallo en el modo TAAM por el cual, cuando un mensajero devolvía un objeto a la reserva estando muerto, el objeto desaparecía.",
  "springcleaning22_gameplay_neutral_items_lock": "Las combinaciones de objetos neutrales ya no se pueden bloquear. De esta forma, se soluciona un fallo que hacía que los mensajeros no entregaran objetos neutrales en combinaciones bloqueadas.",
  "springcleaning22_gameplay_illusion_modifiers": "Se corrigió un fallo que hacía que las ilusiones con modificadores duplicados tuviesen duraciones incorrectas, lo que permitía la identificación del héroe real.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Se corrigió un fallo en los modos turbo y para novatos que hacía que algunos orígenes de oro no aumentasen correctamente.",
  "springcleaning22_gameplay_turbo_courier": "Se corrigió un fallo en el modo turbo por el cual el mensajero de un jugador dejaba de funcionar si se perdía la conexión al seleccionar un héroe o planificar.",
  "springcleaning22_gameplay_zero_tooltips": "Se corrigió un error por el cual algunas descripciones emergentes en el juego modificadas por talentos mostraban el valor 0 en lugar del valor correcto.",
  "springcleaning22_gameplay_euls_invulnerable": "El lanzamiento del Cetro de Eul a clones inmunes a la magia aplica ahora correctamente su efecto a los clones, en lugar de simplemente entrar en recarga.",
  "springcleaning22_gameplay_kobold_aura": "El Aura de Prospección de Kóbold ya no se aplica a los creeps de héroes (por ejemplo, al Espíritu Oso de Lone Druid), lo cual corrige un fallo que hacía que otorgase el doble del efecto por error.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Los clones y los Duplicados de la Tempestad ya reciben correctamente la bonificación de atributos de las bendiciones del Cetro de Aghanim otorgadas por Alchemist.",
  "springcleaning22_gameplay_chen_hand_of_god": "La Mano de Dios de Chen ya aplica correctamente la curación completa a los creeps controlados por Chen, en lugar de aplicar solo la curación inicial.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "La penalización de ataque a distancia de Duplicado de la Tempestad de Arc Warden ya respeta la reencarnación de Arc Warden.",
  "springcleaning22_gameplay_arc_warden_basher": "Se añadió una descripción emergente para aclarar que los clones y los Duplicados de la Tempestad no pueden golpear con Aplastacráneos ni Hoja Abisal.",
  "springcleaning22_gameplay_arc_warden_blink": "La Daga de Traslación no entra en recarga al invocar el Duplicado de la Tempestad de Arc Warden.",
  "springcleaning22_gameplay_arc_warden_wards": "El Duplicado de la Tempestad de Arc Warden ya no puede recibir guardianes compartidos.",
  "springcleaning22_gameplay_pa_scepter_double": "La mejora del Cetro de Aghanim de Phantom Assassin ya no actualiza Desvanecer al matar a un Duplicado de la Tempestad.",
  "springcleaning22_gameplay_naga_siren_riptide": "El -1 ataque necesario para Aguas Revueltas de Naga Siren ya disminuye correctamente 1 solo ataque, en lugar de 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Ahora se otorga el daño adicional de Duelo de Legion Commander aunque el ganador sea invulnerable.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "La Patada de Morsa de Tusk tiene ahora el tiempo de recarga correcto de 12 segundos.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "La Metamorfosis de Terrorblade tiene ahora el tiempo de recarga correcto de 35/40/45/50.",
  "springcleaning22_gameplay_monkey_king_arena": "La Danza Arbórea de Monkey King ya no puede escapar de la Arena de Sangre.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "En Selección de habilidades, los efectos de Aguas Revueltas de Naga Siren se muestran en el héroe correcto, en lugar de siempre en Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki ya puede lanzar Cortina de Humo mientras canaliza Secretos del Oficio sin romper el canal aunque la opción «Habilidades canalizadas requieren parar/cancelar» esté activada.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Se corrigió la interacción de la habilidad Apartar de Marci con Vara del Rey Negro (VRN) y Orbe de Loto.",
  "springcleaning22_gameplay_sniper_grenade_icon": "La Granada Aturdidora de Sniper añade ahora un icono de desarme sobre la cabeza.",
  "springcleaning22_gameplay_morphling_spirit_link": "El Vínculo Espiritual no se vuelve pasivo de forma permanente cuando Morphling se transforma en Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Se añadió un icono de canalización que faltaba en el Portal Demoníaco de Underlord.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Se añadió una descripción emergente que faltaba para el efecto negativo de Bomba de Fuego de Hielo.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Los efectos de las partículas de la Corona Maldita de Dark Willow con el fragmento de Aghanim ya tienen la duración correcta.",
  "springcleaning22_gameplay_lone_druid_midas": "El uso de la Mano de Midas en el Espíritu Oso de Lone Druid otorga ahora experiencia al héroe que tiene el control.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "El Espíritu Oso y los Duplicados de la Tempestad pueden conseguir ahora cargas de Palo Mágico, Varita Mágica y Medallón Sagrado.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "La descripción emergente de Paso Astral de Void Spirit ya muestra correctamente los valores de amplificación del hechizo al pulsar ALT.",
  "springcleaning22_gameplay_heavenly_jump_range": "El Salto Celestial de Zeus muestra ahora el alcance al pasar el ratón por encima.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Se corrigieron las descripciones emergentes del Aura Arcana de Crystal Maiden.",
  "springcleaning22_gameplay_hex_tooltip": "Se corrigió la descripción emergente de la Maldición de Shadow Shaman que añadía por error 1 segundo a su duración cuando el talento «Maldición aplica Ruptura» estaba seleccionado.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Se corrigió el talento de nivel 20 de Abaddon que no actualizaba el tiempo de recarga de Tiempo Prestado en la descripción emergente.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Se corrigió la Presencia del Señor Oscuro de Shadow Fiend para que se aplique correctamente a los creeps neutrales.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Se corrigió el funcionamiento de la Bengala Errática de Tinker en Roshan.",
  "springcleaning22_gameplay_ability_draft_wukong": "En Selección de habilidades, se corrigieron los clones de Comando de Wukong que no tenían las habilidades correctas.",
  "springcleaning22_rubick_illusions": "Se corrigió un fallo que impedía que las ilusiones de Rubick tuvieran las animaciones correctas en función a los hechizos robados (por ejemplo, la Garra del Diablo de Bane con el Cetro de Aghanim).",
  "springcleaning22_rubick_hunter_in_the_night": "Ya se puede robar Cazador Nocturno cuando se mejora con el Cetro de Aghanim.",
  "springcleaning22_rubick_juxtapose": "Ya se puede robar Yuxtaponer cuando se mejora con el Cetro de Aghanim.",
  "springcleaning22_rubick_fireball": "La Bola de Fuego de Dragon Knight ya se puede robar independientemente de la Forma de Dragón y no se otorga de forma automática.",
  "springcleaning22_rubick_wolf_bite": "Mordisco de Lobo ya funciona cuando se roba.",
  "springcleaning22_rubick_depth_shroud": "Manto de las Profundidades ya funciona cuando se roba.",
  "springcleaning22_rubick_astral_spirit": "Se eliminó la habilidad de movimiento independiente de Espíritu Astral cuando se roba. Rubick puede conservar ahora los espacios de los dos hechizos cuando roba esta habilidad.",
  "springcleaning22_rubick_reverse_time_walk": "Salto Temporal Inverso ahora cambia al mismo espacio de habilidad que Salto Temporal si Rubick tiene el fragmento de Aghanim. Rubick puede conservar ahora los espacios de los dos hechizos cuando roba esta habilidad.",
  "springcleaning22_rubick_jaunt": "Viaje Etéreo ahora cambia al mismo espacio de habilidad que Orbe Ilusorio. Rubick puede conservar ahora los espacios de los dos hechizos cuando roba esta habilidad.",
  "springcleaning22_rubick_eject": "Expulsar ahora cambia al mismo espacio de habilidad que Descuartizar si Rubick tiene el fragmento de Aghanim. Rubick puede conservar ahora los espacios de los dos hechizos cuando roba esta habilidad.",
  "springcleaning22_rubick_dismember": "Descuartizar expulsa ahora al héroe aliado si se roba otro hechizo en su lugar.",
  "springcleaning22_rubick_spit_out": "Escupir ahora cambia al mismo espacio de habilidad que Engullir. Rubick puede conservar ahora los espacios de los dos hechizos cuando roba esta habilidad.",
  "springcleaning22_rubick_decoy": "Al robar Señuelo ya no se roba también Emboscada. Al lanzar Señuelo, se sigue aplicando Emboscada.",
  "springcleaning22_rubick_spirits": "El robo de los Espíritus de Io ya funciona correctamente al obtener un Cetro de Aghanim.",
  "springcleaning22_rubick_gravekeepers_cloak": "Ya se puede robar Manto del Guardián cuando se mejora con el Cetro de Aghanim.",
  "springcleaning22_rubick_shard_cursed_crown": "Si Rubick tiene el Fragmento de Aghanim, Corona Maldita también crea ahora Zarzas.",
  "springcleaning22_rubick_shard_venomous_gale": "Si Rubick tiene el Fragmento de Aghanim, Vendaval Venenoso ahora también crea Guardianes de la Plaga.",
  "springcleaning22_rubick_shard_sprout": "Si Rubick tiene el Fragmento de Aghanim, Brotar ahora también crea Ents.",
  "springcleaning22_rubick_shard_shackles": "Si Rubick tiene el Fragmento de Aghanim, Ataduras ahora también crea Guardianes Serpiente.",
  "springcleaning22_rubick_shard_cold_embrace": "Si Rubick tiene el Fragmento de Aghanim, Abrazo Helado ahora también hará surgir una Explosión de Esquirlas.",
  "springcleaning22_rubick_shard_earthshock": "Si Rubick tiene el Fragmento de Aghanim, Sacudida también aplica Enfurecer.",
  "springcleaning22_rubick_shard_shadow_step": "Si Rubick tiene el Fragmento de Aghanim, Pisasombra también aplica Daga Espectral.",
  "springcleaning22_rubick_shard_terror_wave": "Si Rubick tiene el Fragmento de Aghanim, Oleada de Terror también aplica Metamorfosis.",
  "springcleaning22_rubick_shard_homing_missile": "Si Rubick tiene el Fragmento de Aghanim, Misil Buscador también tiene Andanada de Cohetes.",
  "springcleaning22_rubick_shard_slithereen_crush": "Si Rubick tiene el Fragmento de Aghanim, Aplastamiento Deslizante también aplica Neblina Corrosiva.",
  "springcleaning22_rubick_scepter_flak_cannon": "Si Rubick tiene el Cetro de Aghanim, Cañón Antiaéreo también tiene Artillero Lateral.",
  "springcleaning22_rubick_scepter_time_walk": "Si Rubick tiene el Cetro de Aghanim, Salto Temporal también aplica Bloqueo Temporal.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Si Rubick tiene el Cetro de Aghanim, Lanzamiento de Shuriken también aplica Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Si Rubick tiene el Cetro de Aghanim, Flecha Sagrada también aplica Tormenta Estelar.",
  "springcleaning22_ui_quickcast_vector_targeting": "El apuntado vectorial para lanzamiento rápido al presionar la tecla ha cambiado para que se empiece a dibujar el vector al presionar la tecla y se acabe al soltarla. Este es el mismo comportamiento que el lanzamiento rápido al soltar la tecla.",
  "springcleaning22_ui_ward_bounty": "El evento de combate para asesinar a un Guardián Observador ahora muestra quién recibe la recompensa si es distinto del asesino.",
  "springcleaning22_ui_spectator_hud_player_view": "El HUD de espectador ahora muestra correctamente al jugador que estás viendo.",
  "springcleaning22_ui_post_game_scepter_shard": "Las descripciones emergentes del Cetro y de los Fragmentos de Aghanim ahora muestran sus efectos en el marcador al final de la partida.",
  "springcleaning22_ui_post_game_backpack_neutral": "Los objetos neutrales y en la mochila ahora se muestran en los detalles del héroe tras la partida.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Los valores de robo de vida por hechizo para héroes y creeps ahora se muestran de forma separada al mantener presionada la tecla ALT.",
  "springcleaning22_ui_skeleton_warrior_rally": "El seguimiento del aura para Mejorar de Guerrero Esqueleto ahora se hace usando un contador de efectos positivos en lugar de múltiples iconos individuales de efectos positivos.",
  "springcleaning22_ui_neutral_item_teleport": "Se corrigió un fallo que hacía que intercambiar los objetos neutrales y teletransportar uno de ellos muy rápido ocasionara el teletransporte del objeto equivocado.",
  "springcleaning22_ui_spectator_arcana": "Las interfaces relacionadas con objetos arcanos en el HUD ya no aparecen en partidas de liga en el modo espectador.",
  "springcleaning22_ui_ready_check_enter": "Ahora es posible presionar ENTRAR para aceptar que estás listo.",
  "springcleaning22_ui_alt_item_combine": "Los objetos en el menú de compra rápida ahora muestran el objeto completo del que forman parte cuando mantienes presionada la tecla ALT.",
  "springcleaning22_ui_alt_items_ready": "Manteniendo presionada la tecla CTRL al hacer clic derecho en los siguientes objetos le indicará a tu equipo que están listos, en lugar de recogerlos: Botas Arcanas, Protector Carmesí, Grebas del Guardián, Mekansm, Pipa de la Perspicacia y Humo del Engaño.",
  "springcleaning22_ui_sentry_pregame": "Se aumentó de 2 a 3 la cantidad de guardianes centinelas que se poseen mostrados durante la Planificación. Hay un máximo de 3 centinelas que se pueden comprar al comienzo de la partida.",
  "springcleaning22_ui_guide_pregame": "Después de seleccionar un héroe, ahora la selección de objetos recomendados mostrará la primera sección de una guía, si la guía no tiene secciones llamadas «Objetos iniciales».",
  "springcleaning22_ui_ward_planter": "Al seleccionar guardianes ahora se muestra a los jugadores aliados, los espectadores y los entrenadores aliados que los colocaron.",
  "springcleaning22_ui_courier_home_button": "Ahora el botón «Tienda local» del mensajero también devuelve a la reserva cualquier objeto que tenga cuando llega a la base.",
  "springcleaning22_ui_combat_log_key": "Ahora el registro de combate se puede asociar a una tecla en las opciones.",
  "springcleaning22_ui_combat_log_right_align": "Ahora el registro de combate se alinea a la derecha y no se superpone con los controles del modo de prueba de héroes.",
  "springcleaning22_ui_combat_log_hud_flip": "Ahora el registro de combate respeta la posición del HUD (minimapa a la derecha) y se moverá a la izquierda cuando esta opción esté activada.",
  "springcleaning22_ui_guide_apos": "Se corrigió un fallo que sustituía los apóstrofes por «&apos;», así como otros símbolos de HTML, en los comentarios sobre objetos y habilidades de las guías al guardarlas. Las guías que ya se hayan guardado con este problema todavía tendrán que actualizarse manualmente.",
  "springcleaning22_ui_vs_screen_widescreen": "Se corrigió la presentación de los héroes en la pantalla de enfrentamiento para monitores con un ancho de 21:9 o más.",
  "springcleaning22_ui_charms": "Se corrigió un fallo por el que la interfaz de usuario de Amuletos mostraba texto que se solapaba cuando tenías 2 o más Amuletos.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Se corrigió un fallo en el Entrenamiento de último golpe por el que hacer clic en «Iniciar» antes de que reapareciera tu héroe impedía que reaparecieran tus creeps.",
  "springcleaning22_ui_intro_scenes": "Las escenas introductorias (como los debuts de personajes y arcanos de héroes) ya no se mostrarán a los jugadores que no hayan pasado por el flujo de la experiencia para jugadores nuevos.",
  "springcleaning22_cosmetics_illusion_skins": "Se corrigió un fallo por el que las ilusiones podían no heredar de forma correcta las apariencias de determinados modelos cosméticos.",
  "springcleaning22_cosmetics_cloth_stretch": "Se corrigió un fallo por el que el tejido de determinados modelos podía extenderse de forma incorrecta a través de la pantalla.",
  "springcleaning22_cosmetics_underlord_immortal": "El inmortal de Underlord «Sometimiento Esmeralda» ahora tiene efectos de habilidad personalizada que sustituyen a los de la habilidad definitiva.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Los efectos de proyectiles de Veneno Sombrío del objeto inmortal «Manto de Apariencia Sombría» de Shadow Demon ahora se orientan correctamente.",
  "springcleaning22_cosmetics_wraith_king_immortal": "El inmortal de Wraith King «Sombra Abrasadora» tiene una prioridad más alta que el arcano cuando se lanza Explosión de Fuego Espectral.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Se corrigieron los efectos ambientales del inmortal de Earthshaker «Brazaletes de la Caverna Luminaria».",
  "springcleaning22_cosmetics_warlock_immortal": "El inmortal de Warlock «Glifo Sombrío» corrigió los efectos positivos y negativos de habilidad que no funcionaban con Palabra de las Sombras.",
  "springcleaning22_cosmetics_viper_immortal": "Se corrigieron los errores en las partículas de área de efecto para Infratoxina con el inmortal de Viper «Ataque del Draco Maléfico».",
  "springcleaning22_cosmetics_abaddon_vessel": "Restablecidos los efectos de Escudo Afótico con «Hoja del Receptáculo Demoníaco» de Abaddon.",
  "springcleaning22_cosmetics_tidehunder_belt": "En «Horror del Cinturón Profundo» de Tidehunter se quitaron partículas incorrectas del espacio del cinturón que tendrían que estar en el brazo.",
  "springcleaning22_cosmetics_faceless_incursion": "Se corrigieron los efectos ambientales de arma para «Incursión de Claszureme» de Faceless Void.",
  "springcleaning22_cosmetics_drow_arcana_aura": "El aura del arcano de «Puntería» de Drow Ranger ahora tiene efectos personalizados para ambos estilos.",
  "springcleaning22_cosmetics_rubick_dilemma": "Restaurados los efectos de ambiente de «Antorcha del Dilema de Fantoccini» de Rubick.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "La animación del arcano de Techies «Correr herido» ahora se reproduce a la velocidad correcta.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Se añadió soporte para colores de gemas en Mina Pegajosa y Táser Reactivo para el arcano de los Techies.",
  "springcleaning22_cosmetics_techies_icons": "Se añadieron los iconos que faltaban para objetos del mercado en los sets de Techies: Nido de Pólvora, Astucia del Zapador, Bombazos y Cañonazos, y Marcha de la Patrulla Polvorín.",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Se corrigió la animación para Spoon de los Techies en la vista preliminar de teletransporte con el set Paquidermo Polvorín.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "El arcano de Rubick ahora tiene efectos personalizados para Bomba Pegajosa de los Techies en lugar de Mina Remota.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Se corrigió la animación de desactivación de Snapfire, para que no se quede atascada en una secuencia incorrecta de animación.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Los objetos y el lote «Conquistadora Radiante» de Legion Commander ahora se pueden comercializar e intercambiar.",
  "springcleaning22_cosmetics_legion_commander_wind": "Se añadieron efectos de viento a los estandartes de «Legado de la Legión Caída» y «Conquistadora Radiante» de Legion Commander, con las armas arcanas equipadas o sin equipar.",
  "springcleaning22_perf_panorama_atlas": "Se actualizó el motor de la interfaz de usuario Panorama para que utilice atlas de texturas e interactúe de manera más eficiente con la GPU. En nuestras mediciones, esto dio lugar a una mejora del rendimiento (entre el 25 y el 30 %) del trabajo de la GPU necesario para el HUD y aún mayor en otras páginas del menú principal particularmente complicadas. Este cambio también aumenta el rendimiento de la CPU para Vulcan y debería ser especialmente efectivo para los ordenadores de Apple con procesadores M1.",
  "springcleaning22_perf_sand_king_particles": "Se optimizaron los efectos de partículas de Tormenta de Arena para mejorar el rendimiento.",
  "springcleaning22_perf_panorama_clears": "Actualizado el motor de la interfaz de usuario Panorama para evitar determinados borrados innecesarios del objetivo de renderizado, lo cual reduce la carga de la GPU.",
  "springcleaning22_perf_scenesystem_threading": "Se corrigió un fallo por el que a veces se usaban menos subprocesos de los deseados para tareas de subprocesamiento. Este arreglo es especialmente útil para máquinas con 4 núcleos o menos.",
  "springcleaning22_perf_thread_affinity": "Se corrigió un fallo por el que afinidades de subprocesamiento establecidas erróneamente causaban parones en algunas máquinas.",
  "springcleaning22_perf_power_savings": "Se añadió una advertencia en el cuadro de diálogo de configuración de vídeo para indicar que el ordenador se está ejecutando en modo de ahorro de energía, lo cual puede resultar en un rendimiento lento.",
  "springcleaning22_perf_shop_tooltips": "Se mejoró el rendimiento de la información sobre características al explorar la tienda de objetos.",
  "springcleaning22_custom_games_overview_sort": "La pestaña Vista general de arcade ahora permite ordenar a los jugadores activos actuales, además del número de salas de espera abiertas.",
  "springcleaning22_custom_games_update": "Se corrigió un problema con los juegos arcade personalizados de Dota que a veces no mostraban la necesidad de una actualización hasta que se instalaban de nuevo o hasta que se reiniciaba Steam.",
  "springcleaning22_custom_games_lobby_version": "La lista de salas arcade de Dota ya no mostrará las salas que no coinciden con la versión del juego personalizado que está actualmente instalado o a las que no se pueda entrar por otras razones.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold ahora puede filtrar el oro recibido de Runas de recompensa.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Se reemplazó la reliquia de Dazzle «Mal Yuyu Cuádruple» con «Daño y Curación de Mal Yuyu».",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Se reemplazó la reliquia de Techies «Víctimas por Minas Remotas» con «Bombas Lapa adheridas a héroes».",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Se reemplazó la reliquia de Techies «Aturdimientos por Trampa Estática» con «Desarmes multihéroe por Táser Reactivo».",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Se reemplazó la reliquia de Tinker «Daño de Rebelión de las Máquinas» con «Daño absorbido por Matriz de Defensa».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Se reemplazó la reliquia de Underlord «Víctimas después de Grieta Oscura» con «Víctimas de aliados mediante Portal Demoníaco».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Se reemplazó la reliquia de Underlord «Héroes Salvados por Grieta Oscura» con «Daño adicional infligido con Aura Atrofiante».",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Se corrigió la reliquia de Omniknight «Daño a aliados durante Gracia Celestial».",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Se corrigió la reliquia de Primal Beast «Impactos de Embestida multihéroe».",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Sustituido el desafío de héroe para Meepo «Daño mágico infligido a héroes» con «Daño puro infligido a héroes».",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Sustituido el desafío de héroe para Naga Siren «Héroes curados durante Canto de la Sirena» con «Infligir daño a héroes por maná quemado».",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Sustituido el desafío de héroe para Tinker «Daño de Rebelión de las Máquinas» con «Daño absorbido por Matriz de Defensa».",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Sustituido el desafío de héroe para Techies «Víctimas de Minas Remotas» con «Bombas Lapa adheridas».",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Sustituido el desafío de héroe para Underlord «Teletransporte multihéroe de Grieta Oscura» con «Víctimas de aliados mediante Portal Demoníaco».",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Actualizado el desafío de héroe para Grimstroke «Daño infligido a enemigos afectados por Vínculo de Almas», que ahora incluye daño de los aliados.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Actualizado el desafío de héroe para Mirana «Daño causado durante Brinco», que ahora incluye todos los tipos de daño en vez de solo físico.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Arreglado el desafío de héroe para Bane «Combos de Traslación/Bastón de la Fuerza y Garra del Diablo».",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Arreglado el desafío de héroe para Dragon Knight «Víctimas durante Forma de Dragón».",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Arreglado el desafío de héroe para Drow Ranger «Silenciar a 2 o más enemigos con Ráfaga».",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Corregido el desafío de héroe para Crystal Maiden «Matar creeps con Congelación».",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Corregido el desafío de héroe para Dark Seer «Daño infligido durante Subidón».",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Corregido el desafío de héroe para Lifestealer «Daño infligido durante Furia».",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Corregido el desafío de héroe para Lone Druid «Daño infligido durante Forma Verdadera».",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Corregido el desafío de héroe para Mars «Daño infligido a los héroes enemigos».",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Corregido el desafío de héroe para Mars «Asesina unidades enemigas con Hendidura».",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Corregido el desafío de héroe para Omniknight «Daño infligido durante Gracia Celestial».",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Corregido el desafío de héroe para Omniknight «Duración de Gracia Celestial en aliados».",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Corregido el desafío de héroe para Rubick «Aturdimientos multihéroe con Telequinesis».",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Corregido el desafío de héroe para Tinker «Daño infligido a héroes con Láser mejorado por el Cetro de Aghanim».",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Corregido el desafío de héroe para Tusk «Combos de Puñetazos y Patadas».",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Eliminado el desafío de héroe de Venomancer «Daño infligido a héroes afectados por Hoja Plateada».",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Eliminado el desafío de héroe para Tinker: Asesinar a creeps con Rebelión de las Máquinas.",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Añadido el desafío de héroe para Underlord: Daño por Tormenta de Fuego.",
  "springcleaning22_workshop_modeldoc": "Se han mejorado las herramientas del Workshop de Dota para artículos y juegos personalizados, de modo que usen el nuevo editor de modelos «ModelDoc». Los colaboradores del Workshop deberían convertir a la nueva herramienta los modelos hechos con la anterior, que se eliminará en una actualización futura."
}