// 8286.js

{
  "language": "turkish",
  "springcleaning22_desc": "2022 Bahar Temizliği güncellemesi çokça hata düzeltmeleri ve bir sürü oynanış kalitesini artıran eklentilerle geldi. Aghanim'in açıklamaları, susturma kontrolleri, dükkânda arama yapma, ve kahraman deneme modunda yapılan bazı büyük değişikliklere ve daha sonra aşağıdaki kapsamlı bir dökümde daha uzun düzeltme listesine ve oynanış değişikliklerine göz atın.",
  "springcleaning22_aghs_tooltips": "Aghanim's Scepter ve Shard Açıklamaları",
  "springcleaning22_aghs_tooltips_desc": "Aghanim'in zihninin (ve monologunun) iç işleyişi kuşkusuz ölümlülerin kavrayışının ötesindedir; ancak bugünkü güncellemeyle muhteşem Scepter'larının ve Shard'larnın savaş alanındaki etkisi daha önce hiç olmadığı kadar ortaya çıktı. Aghanim'in güçlendirmelerinin açıklamaları artık kuşanıldığında değiştirdiği sayıları daha net gösterecek ve değiştirilmiş yeteneklerin bilgisi de özel bir alanda gösterilecek. Çoğu güçlendirme, büyücü olmayan zihinlerin de anlaması için teker teker basitleştirildi.",
  "springcleaning22_muting_ui": "Sohbet Susturma İyileştirmeleri",
  "springcleaning22_muting_ui_desc": "Dota oyuncuları haşarı bir gruptur ve bazen rekabetin hararetinin ortasında yanlış türde duygular hissedilir. Bu tür duygular rahatsız edici hâle büründüğünde oyununuz daha fazla bozulmadan oyuncuyu hızlı ve kolay bir şekilde susturmak ve ek inceleme için hızlı ve kolay bir şekilde bildirmek önem arz etmektedir. Bu amaçla, artık tek bir tıklama oyuncunun sesini kapatacak, metni engelleyecek ve bildirecektir. Ayrıca, bir oyuncunun davranışının rahatsız edici olmayabileceği ancak iletişimlerinin hala istenmeyen olduğu durumlarda metni ve sesi bağımsız olarak sessize almak için sağ tıklayabilirsiniz.\\n\\nBu fırsatı, iletişim raporlarını nasıl ele aldığımızı yeniden değerlendirmek için de kullanıyoruz. Hedeflerimiz, rahatsız edici oyuncuları sessize almayı hızlı ve kolay hale getirirken, hangi oyunculara karşı daha güçlü önlem almamız gerekebileceğinin net bir göstergesini elde etmektir.",
  "springcleaning22_demo_hero": "Kahraman Deneme İyileştirmeleri",
  "springcleaning22_demo_hero_desc": "Yeni stratejileri test etmek veya kendinizinkinleri mi oluşturmak istiyorsunuz? Ya da kaç tane Axe kopyasının tek bir Tidebringer vuruşuyla katledileceğini görmek için can atıyorsunuzdur. Her hâlükârda şanslısınız! Kahramanı dene modu yeni özellikler eklenerek değiştirildi.",
  "springcleaning22_demo_hero_map": "Demo haritasının kuzey bölümü test için daha fazla alan sağlamak için genişletildi.",
  "springcleaning22_demo_hero_hero_spawn": "Düşman kahramanlarının yanında dost kahramanlarını da daha kolay canlandırmayı sağlayacak kontroller eklendi.",
  "springcleaning22_demo_hero_hero_reset": "Bir kahramanı seviye 1'e düşürmek için bir kontrol eklendi.",
  "springcleaning22_demo_hero_hero_remove": "Bir kahramını test ettikten sonra kaldırmak için bir kontrol eklendi.",
  "springcleaning22_demo_hero_hero_select": "Bir kahraman oluşturmak onu mevcut oluşturma seçimine ekleyecek.",
  "springcleaning22_demo_hero_levelling": "Seviye atlama, Scepter verme, Shard verme ve dokunulmazlığı açıp kapama butonları artık seçilen tüm kahramanlara uygulanır.",
  "springcleaning22_demo_creep_toggle": "Kulvar yaratıklarının canlanmasını kapatmak kulvardaki tüm yaratıkları yok eder.",
  "springcleaning22_demo_creep_spawn": "Her bir taraftan tek bir yaratık dalgası oluşturmak için bir tuş eklendi.",
  "springcleaning22_demo_hero_runes": "6 büyük rünü oluşturmak için butonlar eklendi.",
  "springcleaning22_shop_search": "Dükkân Aramaları Geliştirmesi",
  "springcleaning22_shop_search_desc": "Altın harcamak kolay, eğlenceli ve en önemlisi etkili olmalıdır. Bu yüzden eğlencelerinizi daha az \"meep merp\" ve daha fazla \"son vuruş\" olarak hissettirmesi için Eşya Dükkânı Araması özellik araması da dâhil olmak üzere yeni anahtar kelime desteğiyle genişletildi. \"Zırh\", \"Kuvvet\", \"Menzil\" gibi kelimeleri aratarak istediğiniz özelliklerdeki eşyaları ön plana çıkarabilirsiniz. Mükemmel plan için mükemmel eşyayı seçmek hiç bu kadar kolay olmamıştı. Tek ihtiyacınız olan şeyse altın.",
  "springcleaning22_item_tooltips": "Genişletilmiş Eşya İpuçları",
  "springcleaning22_item_tooltips_desc": "Zekânın ne kadar mana verdiğini unutup duruyor musunuz? Veya çeviklikten ne kadar zırh kazandığınızı? Eşyalara bakarken ALT tuşuna basıtı tutarak açıklamaları ve tüm bileşen parçalarının özelliklerini görerek artık düşünmeyin.",
  "springcleaning22_colored_ability_damage": "Yetenek Hasarı Renkleri",
  "springcleaning22_colored_ability_damage_desc": "Savaşta iyi seçimleri yapmak için neyle mücadele edeceğinizi bilmeniz gerekir. Olası tehlikeleri görmenize yardımcı olması için büyülerden ve eşyalardan alınan hasar artık fiziksel, büyüsel veya saf hasar olmasına bağlı olarak renklerle ifade edilmektedir.",
  "springcleaning22_pluralized_strings": "Çoğul Dizeler için Dil Desteği Geliştirmesi",
  "springcleaning22_pluralized_strings_desc": "Dünyanın her yerinde erişilebilirliği iyileştirmek için, birden çok dil için çoğullaştırma kurallarını daha iyi destekleyen özellikler ekledik ve bu değişiklikleri hesaba katmak için 400 satırdan fazla metni güncelledik.",
  "springcleaning22_permanent_debuffs": "Kalıcı Güçlendirmeler",
  "springcleaning22_permanent_debuffs_desc": "Eylemlerinizin etkililiğini anlamadan strateji oluşturmak zordur. Necrophos'un Reaper's Scythe ve Axe'ın Culling Blade ile öldürmeleri artık oyun sonu ekranında daha ayrıntılı bilgi edinebilmeniz için gösterilecektir.",
  "springcleaning22_post_game_sortable": "Sıralanabilir Oyun Sonu Detayları",
  "springcleaning22_post_game_sortable_desc": "Zaferinizin ardında yatanları derinlemesine incelemek mi istiyorsunuz? Oyun sonu ekranı artık analiz edebilmeniz için sıralanabilir.",
  "springcleaning22_gameplay_tp_boots": "Boots of Travel'ın artık bir kulenin menzili içinde kullanıldığında yaratığı hedef alması daha az olasıdır.",
  "springcleaning22_gameplay_sellback": "Oyuncular artık oyun başladıktan sonra 10 saniye olan tam bedeline satım süresi yerine 30 saniyelik bir tam bedeline satım süresine sahip olacaktır.",
  "springcleaning22_gameplay_lifestealer_consume": "Lifestealer'ın Consume yeteneği artık içine girdiği birimin türüne bağlı olmaksızın aynı tuşu kullanacaktır.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Ogre Bruiser artık hareket ve sersemletmesi için doğru ses efektlerine sahiptir.",
  "springcleaning22_gameplay_neutral_aura_radius": "Artık tüm tarafsız yaratık auraları imleç üstüne geldiğinde alanını gösterecektir.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Wraith Band / Null Talisman / Bracer artık 25. dakikadan sonra bonus özelliklerini ikiye katladıklarını gösteren açıklamaya sahiptir.",
  "springcleaning22_gameplay_heal_overhead": "Görüntülenen iyileştirme değerlerinin iyileştirme artırımından etkilenmediği bazı durumlar düzeltildi.",
  "springcleaning22_gameplay_fountain_invuln": "Kaynak Dokunulmazlığı güçlendirmesine sahip oyuncular artık düşmanlar menziline girdiğine otomatik saldırı yapıp güçlendirmeyi kaldırmayacaktır.",
  "springcleaning22_gameplay_blink_range": "Blink ve türevleri için büyü menzili göstergesi artık kullanma menzili güçlendirmelerini de dikkate alacaktır.",
  "springcleaning22_gameplay_desolator_tooltip": "Desolator'ın Ruh Çalma pasifinin açıklaması netleştirildi. Desolator, bozulma zayıflatması etkisi altında öldürülen bir düşman kahramandan saldırı hasar kazanır.",
  "springcleaning22_gameplay_ardm_stash": "Tümü Rastgele Ölüm Maçı oyun modunda kuryenin ölüyken zuladan eşya alması sonucu eşyanın kaybolmasına neden olan bir hata düzeltildi.",
  "springcleaning22_gameplay_neutral_items_lock": "Tarafsız yaratık eşyalarının artık birleştirilmesi kilitlenmeyecek. Bu, kuryelerin birleştirilmesi kilitli tarafsız yaratık eşyalarını teslim etmemesine neden olan bir hatayı düzeltmektedir.",
  "springcleaning22_gameplay_illusion_modifiers": "Aynı değiştiricilere sahip illüzyonların farklı sürelere sahip olması ve böylece gerçek kahramanın belirlenebilmesine sebep olan bir hata düzeltildi.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Turbo ve Yeni Oyuncu Modu'nda bazı altın kaynaklarının düzgün bir şekilde ölçeklenmemesi düzeltildi.",
  "springcleaning22_gameplay_turbo_courier": "Turbo modunda bir oyuncunun kuryesinin oyuncunun kahraman seçimi veya strateji süresinde bağlantısı kesildiğinde çalışmaması düzeltildi.",
  "springcleaning22_gameplay_zero_tooltips": "Hünerlerle değiştirilen bazı oyun içi açıklamaların doğru değerini göstermesi yerine 0 gösterilmesi düzeltildi.",
  "springcleaning22_gameplay_euls_invulnerable": "Eul's Scepter'ın büyü bağışıklı klon üzerinde kullanılması artık doğrudan dolum süresine sokmak yerine düzgün bir şekilde etkisini gösterecektir.",
  "springcleaning22_gameplay_kobold_aura": "Kobold'un Prospecting Aurası artık Yaratık Kahramanlar'a etki etmeyecektir (ör. Lone Druid bear). İki katı etki etmesine sebep olan bir hata düzeltildi.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Klonlar ve Tempest Double'lar artık Alchemist tarafından verilen Aghanim's Scepter kutsamasından doğru biçimde özellik kazanacaktır.",
  "springcleaning22_gameplay_chen_hand_of_god": "Chen'in Hand of God yeteneği artık Chen tarafından kontrol edilen birimlere sadece ilk iyileştirmeyi yapmak yerine zamanla yaptığı iyileştirmesini de düzgün bir şekilde uygulayacaktır.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Arc Warden'ın Tempest Double klonunun saldırı hasarı cezasının mesafesi artık Arc Warden'ın yeniden canlanmasını da dikkate alacaktır.",
  "springcleaning22_gameplay_arc_warden_basher": "Klonların ve Tempest Double'ların Basher veya Abyssal ile sersemletme darbesi vuramayacaklarına ilişkin açıklayıcı not eklendi.",
  "springcleaning22_gameplay_arc_warden_blink": "Arc Warden'ın Tempest Double klonu artık canlandığında Blink Dagger dolum süresinde olmayacaktır.",
  "springcleaning22_gameplay_arc_warden_wards": "Arc Warden'ın Tempest Double'ı artık paylaşılmış gözleri alamaz.",
  "springcleaning22_gameplay_pa_scepter_double": "Phantom Assassin'in Aghanim's Scepter güçlendirmesi artık bir Tempest Double klonu öldürdüğünde Blur yeteneğinin dolum süresini yenilemeyecektir.",
  "springcleaning22_gameplay_naga_siren_riptide": "Naga Siren'ın hüneri olan \"-1 Rip Tide Vuruşu\" doğru bir şekilde 2 yerine 1 vuruşu azaltacaktır.",
  "springcleaning22_gameplay_legion_commander_duel": "Legion Commander'ın Duel bonus hasarı artık kazanan hasar verilemez olsa bile verilir.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Tusk'ın Walrus Kick yeteneği artık 12 saniyelik dolum süresini düzgün bir şekilde göstermektedir.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Terrorblade'in Metamorphosis yeteneği artık 35/40/45/50 olarak doğru dolum süresine sahiptir.",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey King'in Tree Dance yeteneği artık Arena of Blood'dan kaçmasına izin vermeyecek.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "Yetenek Çekilişi modunda Naga Siren'ın Rip Tide efektleri artık sürekli Naga Siren yerine yeteneği seçen kahramanda gösterilir.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki artık Tricks of the Trade süresince \"Yönlendirmeli Büyüleri Durdurmayla/Bekletmeyle İptal Et\" seçeneği seçilse bile Smoke Screen yeteneğini bozmadan kullanabilir.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Marci'nin Dispose yeteneğinin BKB ve Lotus Orb ile olan etkileşimleri düzeltildi.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Sniper'ın Concussive Grenade yeteneği artık kafa üstü etkisizleştirme ikonu ekliyor.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling artık Lone Druid'e dönüştüğünde kalıcı olarak Spirit Link pasifine sahip olmayacaktır.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Underlord'un Fiend's Gate yeteneğinin eksik yönlendirme ikonu eklendi.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Icefire Bomb güçsüzleştirmesinin eksik araç ipucu eklendi.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Dark Willow'un Aghanims Shard ile Cursed Crown parçacık efektleri artık doğru zaman uyumuna sahiptir.",
  "springcleaning22_gameplay_lone_druid_midas": "Lone Druid'in Spirit Bear'ında Hand of Midas kullanmak artık kontrol edilen kahramana da tecrübe verecektir.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear ve Tempest Double'lar artık Magic Stick, Magic Wand ve Holy Locket şarjı kazanabilir.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Void Spirit'in Astral Step açıklaması artık ALT tuşuna basıldığında doğru büyü artırımı değerlerini göstermektedir.",
  "springcleaning22_gameplay_heavenly_jump_range": "Zeus'un Heavenly Jump yeteneği artık fare imleci üstüne geldiğinde menzilini göstermektedir.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Crystal Maiden Arcane Aura araç ipuçları düzeltildi.",
  "springcleaning22_gameplay_hex_tooltip": "Shadow Shaman'ın Hex açıklamasının \"Hex Break Uygular\" hüneri seçildiğinde süresine yanlışlıkla 1 saniye eklenmesi düzeltildi.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Abaddon'ın seviye 20 hünerinin Borrowed Time dolum süresini güncellememesi düzeltildi.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Shadow Fiend'ın Presence of the Dark Lord yeteneğinin tarafsız yaratıklara düzgün uygulanmaması düzeltildi.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Tinker'ın Warp Flare yeteneği artık Roshan üzerinde çalışıyor.",
  "springcleaning22_gameplay_ability_draft_wukong": "Yetenek Çekilişi modunda Wukong's Command klonlarının doğru yeteneklere sahip olmaması düzeltildi.",
  "springcleaning22_rubick_illusions": "Rubick illüzyonlarının çalınan büyülerde doğru animasyonlara sahip olmamasına neden olan bir hata düzeltildi (ör. Bane'in Aghanim's Scepter'lı Fiend's Grip yeteneği).",
  "springcleaning22_rubick_hunter_in_the_night": "Hunter in the Night artık Aghanim's Shard ile güçlendiğinde çalınabilir.",
  "springcleaning22_rubick_juxtapose": "Juxtapose artık Aghanim's Scepter ile güçlendiğinde çalınabilir.",
  "springcleaning22_rubick_fireball": "Dragon Knight'ın Fireball yeteneği artık Dragon Form'dan bağımsız olarak çalınabilir ve otomatik olarak verilmez.",
  "springcleaning22_rubick_wolf_bite": "Wolf Bite artık çalındığında çalışmaktadır.",
  "springcleaning22_rubick_depth_shroud": "Depth Shroud artık çalındığında çalışmaktadır.",
  "springcleaning22_rubick_astral_spirit": "Astral Spirit çalındığında ek hareket yeteneği kaldırıldı. Rubick artık bu yeteneği çaldığında her iki büyü yuvasına sahip olabilir.",
  "springcleaning22_rubick_reverse_time_walk": "Reverse Time Walk artık Rubick'te Aghanim's Shard varsa Time Walk ile aynı yetenek yuvasını kullanır. Rubick artık bu yeteneği çaldığında her iki büyü yuvasına sahip olabilir.",
  "springcleaning22_rubick_jaunt": "Ethereal Jaunt artık Illusory Orb ile aynı yetenek yuvasını kullanır. Rubick artık bu yeteneği çaldığında her iki büyü yuvasına sahip olabilir.",
  "springcleaning22_rubick_eject": "Rubick'te Aghanim's Shard varsa Eject artık Dismember ile aynı yetenek yuvasını kullanır. Rubick artık bu yeteneği çaldığında her iki büyü yuvasına sahip olabilir.",
  "springcleaning22_rubick_dismember": "Dismember artık yerine başka bir büyü çalınırsa içindeki kahramanı dışarı atar.",
  "springcleaning22_rubick_spit_out": "Spit Out artık Gobble Up ile aynı yetenek yuvasını kullanır. Rubick artık bu yeteneği çaldığında her iki büyü yuvasına sahip olabilir.",
  "springcleaning22_rubick_decoy": "Decoy yeteneğini çalmak artık Bushwhack yeteneğini de çalmaz. Decoy, kullanıldığında hâlâ Bushwhack uygular.",
  "springcleaning22_rubick_spirits": "Io'nun Spirits yeteneği çalındığında artık Aghanim's Scepter'a sahip olunduğunda düzgün bir şekilde çalışır.",
  "springcleaning22_rubick_gravekeepers_cloak": "Gravekeeper's Cloak artık Aghanim's Scepter ile güçlendirildiğinde çalınabilir.",
  "springcleaning22_rubick_shard_cursed_crown": "Eğer Rubick'te Aghanim's Shard varsa Cursed Crown artık Brambles da oluşturur.",
  "springcleaning22_rubick_shard_venomous_gale": "Eğer Rubick'te Aghanim's Shard varsa Venomous Gale artık Plague Wards da oluşturur.",
  "springcleaning22_rubick_shard_sprout": "Eğer Rubick'te Aghanim's Shard varsa Sprout artık Treants da oluşturur.",
  "springcleaning22_rubick_shard_shackles": "Eğer Rubick'te Aghanim's Shard varsa Shackles artık Serpent Wards da oluşturur.",
  "springcleaning22_rubick_shard_cold_embrace": "Eğer Rubick'te Aghanim's Shard varsa Cold Embrace artık Splinter Blast da oluşturur.",
  "springcleaning22_rubick_shard_earthshock": "Eğer Rubick'te Aghanim's Shard varsa Earthshock artık Enrage de uygular.",
  "springcleaning22_rubick_shard_shadow_step": "Eğer Rubick'te Aghanim's Scepter varsa Shadow Step artık Spectral Dagger da oluşturur.",
  "springcleaning22_rubick_shard_terror_wave": "Eğer Rubick'te Aghanim's Scepter varsa Terror Wave artık Metamorphosis de uygular.",
  "springcleaning22_rubick_shard_homing_missile": "Eğer Rubick'te Aghanim's Shard varsa Homing Missile artık Rocket Barrage da oluşturur.",
  "springcleaning22_rubick_shard_slithereen_crush": "Eğer Rubick'te Aghanim's Shard varsa Slithereen Crush artık Corrosive Haze de uygular.",
  "springcleaning22_rubick_scepter_flak_cannon": "Eğer Rubick'te Aghanim's Scepter varsa Flak Cannon artık Side Gunner da oluşturur.",
  "springcleaning22_rubick_scepter_time_walk": "Eğer Rubick'te Aghanim's Scepter varsa Time Walk artık Time Lock da uygular.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Eğer Rubick'te Aghanim's Scepter varsa Shuriken Toss artık Jinada da uygular.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Eğer Rubick'te Aghanim's Scepter varsa Sacred Arrow artık Starstorm da uygular.",
  "springcleaning22_ui_quickcast_vector_targeting": "Hızlı kullan için, tuşa basıldığında vektör hedefleme tuş basılıyken çizime başlayarak ve tuşu bıraktığında bitecek şekilde değiştirildi. Bu eylem hızlı kullan tuşu bırakıldığındakiyle aynıdır.",
  "springcleaning22_ui_ward_bounty": "Bir izleyici göz kırıldığında ödülü alan kişi kıran kişiden farklıysa ödülü kimin aldığı savaş etkinliği bölümünde gösterilmektedir.",
  "springcleaning22_ui_spectator_hud_player_view": "İzleyici arayüzü izlenilen oyuncuyu artık doğru gösteriyor.",
  "springcleaning22_ui_post_game_scepter_shard": "Aghanim's Scepter ve Shard için açıklamalar artık oyun sonu ekranında da görüntülenmektedir.",
  "springcleaning22_ui_post_game_backpack_neutral": "Çantadakiler ve tarafsız yaratık eşyaları artık oyun sonu kahraman detayları bölümünde gösterilir.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Kahramanlar ve yaratıklar için büyü can çlaması artık ALT tuşuna basıldığında ayrı ayrı gösterilir.",
  "springcleaning22_ui_skeleton_warrior_rally": "Skeleton Warriors aurası efekt başına bir simge göstermek yerine tek bir efekt simgesiyle gösteriliyor. ",
  "springcleaning22_ui_neutral_item_teleport": "Işınlanırken hızlı bir şekilde tarafsız yaratık eşyaları değiştirildiğinde yanlış olanın ışınlanmasına sebep olan bir hata düzeltildi.",
  "springcleaning22_ui_spectator_arcana": "Göstergedeki gizemli eşya arayüzleri artık Lig maçlarında seyirci olarak görünmüyor.",
  "springcleaning22_ui_ready_check_enter": "Hazırlık kontrolü artık ENTER tuşuna basılarak kabul edilebilir.",
  "springcleaning22_ui_alt_item_combine": "Hızlı satın alma menüsündeki eşyalar artık ALT tuşuna basılı tutulduğunda birleşecekleri eşyaları göstermektedir.",
  "springcleaning22_ui_alt_items_ready": "Şu eşyalara ALT tıklarken CTRL'ye basılı tutmak eşya için toplanılması yerine hazır olup olmadığı belirtir: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight ve Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Strateji süresi boyunca nöbetçi göz sahipliğini gösterir sayı 2'den 3'e yükseltildi. Oyunun başında satın alınabilir 3 nöbetçi göz bulunur.",
  "springcleaning22_ui_guide_pregame": "Bir kahramanı seçtikten sonra \"Rehber Tarafından Önerilen\" bölümünde artık rehberde \"Başlangıç Eşyaları\" adlı bölüm yoksa rehberdeki ilk bölüm gösterilir.",
  "springcleaning22_ui_ward_planter": "Gözleri seçmek artık dost oyunculara, izleyicilere ve dost koçlara kimin diktiğini gösterir.",
  "springcleaning22_ui_courier_home_button": "Kuryenin \"Üs Dükkânı\" butonu artık ayrıca üsse ulaştığında sahip olduğu tüm öğeleri zulaya bırakır.",
  "springcleaning22_ui_combat_log_key": "Muhabere Kaydı artık ayarlardan bir tuşa atanabilir.",
  "springcleaning22_ui_combat_log_right_align": "Muhabere Kaydı artık sağa hizalıdır ve Kahramanı Dene kontrolleriyle çakışmamaktadır.",
  "springcleaning22_ui_combat_log_hud_flip": "Muhabere Kaydı artık gösterge değişikliklerini (mini haritanın sağda olması) dikkate alır ve sol tarafta gösterilir.",
  "springcleaning22_ui_guide_apos": "Rehberlerin kaydedildiğinde eşya/yetenek yorumlarının kesme işaretlerini \"&apos;\" diğer HTML sembolleri ile değiştirmesi düzeltildi. Bu hata ile kaydedilen rehberler elle düzeltilmelidir.",
  "springcleaning22_ui_vs_screen_widescreen": "21:9 veya daha geniş monitörler için Karşılaşma Ekranı'ndaki kahramanların gösterimi ayarlandı. ",
  "springcleaning22_ui_charms": "Nazarlık arayüzünde ikiden fazla nazarlık olduğunda metinlerinin üst üste gelmesi düzeltildi.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Son Vuruş Alıştırması modunda kahramanınız canlanmadan başlama butonuna bastığınızda yaratıkların canlanmasına engel olmasına neden olan bir hata düzeltildi.",
  "springcleaning22_ui_intro_scenes": "Giriş ekranları (kahraman/kişilik tanıtımları gibi) artık ilk yeni oyuncu tecrübesi sürecini geçmemiş oyuncular için gösterilmeyecektir.",
  "springcleaning22_cosmetics_illusion_skins": "İllüzyonların bazı kozmetik eşya modellerini düzgün taşımamasına neden olan bir hata düzeltildi.",
  "springcleaning22_cosmetics_cloth_stretch": "Bazı model kıyafetlerinin ekranda düzgün bir şekilde gerinmemesine neden olan bir hata düzeltildi.",
  "springcleaning22_cosmetics_underlord_immortal": "Underlord'un ölümsüz \"Zümrüt Zaptı\" öğesi artık son yeteneğinin yetenek efektlerini değiştirmektedir.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Shadow Demon'ın ölümsüz \"Zalim Yüzün Altın Pelerini\" öğesi artık Shadow Poison atış efektlerini düzgün bir şekilde yöneltmektedir.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Wraith King'in ölümsüz \"Öfkeli Koruma\" öğesi \"Wraithfire Blast\" yeteneği kullanılırken gizemli eşyadan daha fazla önceliğe sahiptir.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Earthshaker'ın ölümsüz \"Mağaranın Işığının Bileklikleri\" ortam efekti düzeltildi.",
  "springcleaning22_cosmetics_warlock_immortal": "Warlock'un ölümsüz \"Umbral Mühür\" öğesinin Shadow Word için bozuk yetenek efektleri düzeltildi (güçlendirme ve zayıflatma).",
  "springcleaning22_cosmetics_viper_immortal": "Viper'ın ölümsüz \"Muzır Ejderin Saldırısı\" öğesinin Nethertoxin için bozuk etki alanı parçacıkları düzeltildi.",
  "springcleaning22_cosmetics_abaddon_vessel": "Abaddon'un \"Şeytani Damarın Kılıcı\" öğesinin Aphotic Shield efektleri düzeltildi.",
  "springcleaning22_cosmetics_tidehunder_belt": "Tidehunter'ın \"Derin Kemerdeki Korku\" öğesindeki kolda olması gereken partiküllerin kemerde görünmesi düzeltildi.",
  "springcleaning22_cosmetics_faceless_incursion": "Faceless Void'in \"Claszureme Incursion\" öğesinin silah ortam efekti düzeltildi.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Drow Ranger'ın gizemli eşyasının \"Marksmanship\" aurası artık her iki tarzı için de özel efektlere sahiptir.",
  "springcleaning22_cosmetics_rubick_dilemma": "Rubick'in \"Kuklacının İkileminin Feneri\" öğesinin ortam efektleri yenilendi.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Techies'in gizemli eşyasında sakat yürüyüş animasyonu artık doğru hızda oynatılacaktır.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Techies'in gizemli eşyasında Sticky Bomb ve Reactive Tazer için cevher renkleri desteği eklendi.",
  "springcleaning22_cosmetics_techies_icons": "Techies'in \"Powdersled Rookery\", \"Sapper's Guile\", \"Bombtrails and Boomsticks\" ve \"March of the Powderkeg Patrol\" setleri için eksik pazar ikonları eklendi.",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Techie'in Spoon karakterinin \"Pachyderm Powderwagon\" setiyle yaptığı ışınlanma görünümü düzeltildi.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Rubick gizemli eşyası artık Remote Mine yerine Techies'in Sticky Bomb yeteneğinin özel efektine sahiptir.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Snapfire'ın etkisizleşme animasyonu yanlış animasyon sekansından kalmaması için düzeltildi.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Legion Commander'ın \"Radiant Conqueror\" paketindeki öğeler artık pazarlanabilir ve takas edilebilir.",
  "springcleaning22_cosmetics_legion_commander_wind": "Legion Commander'ın \"Düşmüş Lejyonun Mirası\" ve \"Radiant Conqueror\" sancaklarına gizemli silahı takılı olsun veya olmasın rüzgâr efekti eklendi.",
  "springcleaning22_perf_panorama_atlas": "Panorama arayüz motoru, ekran kartları ile daha verimli etkileşimde bulunması adına atlaslamayı (atlassing) kullanacak şekilde güncellendi. Ölçümlerimizde, izleyici arayüzü için gerekli ekran kartı çalışmasında %25-30 daha iyi performans ve bazı özellikle karmaşık gösterge tablosu sayfalarında çok daha fazla performans sağladı. Bu değişiklik aynı zamanda Vulkan için işlemci performansını da artırıyor ve özellikle M1 işlemcili Apple bilgisayarlar için de etkili olacaktır.",
  "springcleaning22_perf_sand_king_particles": "\"Sand Storm\" parçacık efektleri performası iyileştirmesi açısından optimize edildi.",
  "springcleaning22_perf_panorama_clears": "Panorama arayüzü motorunun ekran kartı işyükünden kaçınmak için bazı oluşturma hedefi temizlemelerini önlemek için güncelleştirildi.",
  "springcleaning22_perf_scenesystem_threading": "Bazen çok iş parçacıklı işler yapmak için tasarlanandan daha az iş parçacığı kullandığımız bir hata düzeltildi. Bu düzeltme, özellikle 4 veya daha az çekirdeğe sahip cihazlar için faydalıdır. ",
  "springcleaning22_perf_thread_affinity": "Yanlış ayarlanmış iş parçacığı benzeşmelerinin bazı makinelerde durmalara neden olabileceği bir hata düzeltildi.",
  "springcleaning22_perf_power_savings": "Performansın yavaşlamasına neden olabilecek olan bilgisayarın güç tasarrufu modunda çalışıp çalışmadığını göstermek için video ayarları bölümüne bir uyarı eklendi.",
  "springcleaning22_perf_shop_tooltips": "Eşya Dükkânı'na göz atarken açıklamaların performansı düzeltildi.",
  "springcleaning22_custom_games_overview_sort": "Özel Oyun kategorsinin Genel Bakış sekmesi artık açık lobi sayısı yerine mevcut aktif oyuncu sayısına göre sıralama yapacaktır.",
  "springcleaning22_custom_games_update": "Dota özel oyunlarının bazen yeniden yüklenene veya Steam yeniden başlatılana kadar güncelleme gerekip gerekmediğini göstermemesine neden olan bir sorun düzeltildi.",
  "springcleaning22_custom_games_lobby_version": "Dota özel oyun lobi listesi artık şu anda yüklü olan veya başka bir şekilde katılınamayan özel oyunun sürümüyle eşleşmeyen lobileri artık göstermeyecek.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold komutu artık ödül rünlerinden alınan altını filtreler.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Dazzle yâdigarı değiştirildi - \"Dört Düşmana JuJu Zayıflatması\" yerine \"Bad Juju'dan Hasar ve İyileştirme\" olarak değiştirildi.",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Techies yâdigarı değiştirildi - \"Remote Mine Leşleri\" yerine \"Kahramanlara Yapışan Sticky\" olarak değiştirildi.",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Techies yâdigarı değiştirildi - \"Stasis Trap Sersemletmeleri\" yerine \"Reactive Tazer Çoklu Kahraman Etkisizleştirmesi\" olarak değiştirildi.",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Tinker yâdigarı değiştirildi - \"March of the Machines Hasarı\" yerine \"Defense Matrix Hasar Emmesi\" olarak değiştirildi.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Underlord yâdigarı değiştirildi- \"Dark Rift Sonrası Leşler\" yerine \"Fiend's Gate Kullanan Dost Leşleri\" olarak değiştirildi.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Underlord yâdigarı değiştirildi - \"Dark Rift Tarafından Kurtarılan Kahramanlar\" yerine \"Verilen Atrophy Aura Bonus Hasarı\" olarak değiştirildi.",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Omniknight yâdigarı düzeltildi- \"Heavenly Grace Boyunca Dost Hasarı\".",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Primal Beast yâdigarı düzeltildi - \"Çoklu Kahraman Onslaught Vuruşları\".",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Meepo yâdigarı değiştirildi - \"Kahramanlara Verilen Büyü Hasarı\" yerine \"Kahramanlara Verilen Saf Hasar\" olarak değiştirildi.",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Naga Siren'ın kahraman mücadelesi değiştirildi - \"Song Süresince İyileşen Kahramanlar\" yerine \"Kahramanlardan Mana Yakma Hasarı\" olarak değiştirildi.",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Tinker'ın kahraman mücadelesi değiştirildi - \"March of the Machines Hasarı\" yerine \"Defense Matrix ile Emilen Hasar\" olarak değiştirildi.",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Techies'in kahraman mücadelesi değiştirildi - \"Remote Mine Leşleri\" yerine \"Bağlanan Sticky Bomb'lar\" olarak değiştirildi.",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Underlord'un kahraman mücadelesi değiştirildi - \"Çoklu Kahraman Dark Rift Işınlaması\" yerine \"Fiend's Gate Kullandıktan Sonra Dost Leşleri\" olarak değiştirildi.",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Grimstroke'un kahraman mücadelesi güncellendi- \"Soul Bind ile etkilenen düşmanlara verilen hasar\" artık dostlar tarafından verilen hasarı da kapsamaktadır.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Mirana'nın kahraman mücadelesi güncellendi- \"Leap Süresince Verilen Hasar\" artık fiziksel yerine tüm hasar türlerini kapsamaktadır.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Bane'in kahraman mücadelesi düzeltildi- \"Blink/Force Staff ve Fiend's Grip Komboları\".",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Dragon Knight'ın kahraman mücadelesi düzeltildi - \"Dragon Form Süresince Leşler\".",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Drow Ranger'ın kahraman mücadelesi düzeltildi  - \"Gust ile 2+ Düşman Susturma\".",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Crystal Maiden'ın kahraman mücadelesi düzeltildi - \"Frostbite ile Öldürülen Yaratıklar\".",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Dark Seer'ın kahraman mücadelesi düzeltildi - \"Surge Süresince Verilen Hasar\".",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Lifesteale'ın kahraman mücadelesi düzeltildir - \"Rage Süresince Verilen Hasar\".",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Lone Druid'in kahraman mücadelesi düzeltildi - \"True Form Süresince Verilen Hasar\".",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Mars'ın kahraman mücadelesi düzeltildi - \"Düşman Kahramanlarına Verilen Hasar\".",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Mars'ın kahraman mücadelesi düzeltildi - \"Saçma Hasarı ile Öldürülen Düşman Birimleri\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Omniknight'ın kahraman mücadelesi düzeltildi - \"Heavenly Grace Süresince Verilen Hasar\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Omniknight'ın kahraman mücadelesi düzeltildi - \"Dostlardaki Heavenly Süresi\".",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Rubick'in kahraman mücadelesi düzeltildi - \"Çoklu Kahraman Telekinesis Sersemletmesi\".",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Tinker'ın kahraman mücadelesi düzeltildi - \"Aghanim's Scepter ile Güçlendirilen Laser ile Kahramanlara Verilen Hasar\".",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Tusk'ın kahraman mücadelesi düzeltildi - \"Punch Kick Komboları\".",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Venomancer'ın kahraman mücadelesi kaldırıldı- \"Silver Edge ile Bozulan Düşmanlara Verilen Hasar\".",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Tinker'ın kahraman mücadelesi kaldırıldı - \"March of the Machines ile Öldürülen Yaratıklar\".",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Underlord'a kahraman mücadelesi eklendi- \"Firestorm ile Kahramanlara Verilen Hasar\".",
  "springcleaning22_workshop_modeldoc": "Dota atölye araçları eşyalar ve özel oyunlar için yeni \"ModelDoc\" model editörünün kullanılabilmesi için yükseltildi. Atölye katılımcılar gelecekteki bir güncellemede kaldırılacak olan eski araçtaki tüm modelleri taşımalıdır."
}