// 618.js

{
  "language": "danish",
  "springcleaning22_desc": "Forårsrengøringsopdateringen 2022 er klar med en masse fejlrettelser og adskillige kvalitetsforbedringer. Læs om nogle af de større ændringer – f.eks. forbedrede værktøjstips til Aghanim's Scepter, dæmpningsindstillinger, butikssøgninger og helteafprøvningstilstanden – og gå derefter i dybden med den lange liste af rettelser og spiljusteringer nedenfor.",
  "springcleaning22_aghs_tooltips": "Beskrivelser til Aghanim's Scepter og Shard",
  "springcleaning22_aghs_tooltips_desc": "Aghanims inderste tanker (såvel som hans monologer) er uden tvivl umulige for de dødelige at forstå, men med dagens opdatering er virkningen af Aghanims storslåede Scepter og Shard blevet belyst som aldrig før. Beskrivelser af Aghanims opgraderinger indeholder nu flere oplysninger om præcis, hvilke værdier de ændrer, og ændrede evner indeholder også disse oplysninger i et separat afsnit. Mange opgraderinger er også blevet gennemgået, så de er simplere og nemmere at forstå for os ikke-magikere.",
  "springcleaning22_muting_ui": "Forbedringer til dæmpning",
  "springcleaning22_muting_ui_desc": "Dota-spillere er en højrøstet flok, og nogle gange kommer de forkerte slags følelser for meget til udtryk i kampens hede. I tilfælde hvor den slags adfærd er forstyrrende, er det vigtigt, at man hurtigt og nemt kan dæmpe spillere og rapportere dem til videre investigering, uden at det skal forstyrre dit spil yderligere. Derfor kan man nu med ét klik dæmpe for stemme- og tekstchat og rapportere spilleren. Man kan også højreklikke for at dæmpe for tekst og stemme separat i tilfælde, hvor en spillers adfærd måske ikke er forstyrrende, men spillerens kommunikation stadig er uønsket. For nem kontrol kan man også bruge den nye knap til holddæmpning, som dæmper for hele et holds kommunikation med ét klik.\\n\\nVi benytter os også af denne mulighed for at evaluere, hvordan vi håndterer kommunikationsrapporteringer. Vores mål er at gøre det hurtigt og nemt at dæmpe for forstyrrende spillere, samtidig med at vi får et klart billede af, hvilke spillere vi muligvis skal gribe ind overfor med yderligere tiltag.",
  "springcleaning22_demo_hero": "Forbedringer til helteafprøvning",
  "springcleaning22_demo_hero_desc": "Vil du teste de nyeste strategier eller lave dine egne? Eller har du måske bare et overvældende behov for at se, hvor mange inkarnationer af Axe, som kan slagtes med ét sving med Tidebringer-sværdet? Uanset hvad sidder du i held! Helteafprøvningstilstanden er blevet opdateret og omarbejdet med flere nye funktioner:",
  "springcleaning22_demo_hero_map": "Den nordlige del af demokortet er blevet udvidet, så der er et større fladt område til at teste helte.",
  "springcleaning22_demo_hero_hero_spawn": "Tilføjede knapper til nemt at skabe allierede helte, foruden fjender.",
  "springcleaning22_demo_hero_hero_reset": "Tilføjede en knap til at nulstille en helt tilbage til level 1.",
  "springcleaning22_demo_hero_hero_remove": "Tilføjede en knap til at fjerne en helt, når man er færdig med at teste.",
  "springcleaning22_demo_hero_hero_select": "Når du skaber en ny helt, tilføjes den til dine nuværende valg.",
  "springcleaning22_demo_hero_levelling": "Knapper til at stige i level, tilføje Scepter og Shard og slå udødelighed til/fra gælder nu for alle valgte helte.",
  "springcleaning22_demo_creep_toggle": "Når kryb slås fra, fjernes alle kryb fra banen.",
  "springcleaning22_demo_creep_spawn": "Tilføjede en knap til at skabe en krybbølge fra hver side.",
  "springcleaning22_demo_hero_runes": "Tilføjede knapper til at skabe de seks forskellige styrkeruner.",
  "springcleaning22_shop_search": "Opdateret butikssøgning",
  "springcleaning22_shop_search_desc": "Brug af guld skal være nemt, sjovt og vigtigst af alt, effektivt. For at få din tid til at føles en smule mindre \"meep merp\" og meget mere \"dødsstød\", er genstandsbutikkens søgefelt blevet udvidet med bedre understøttelse af nøgleord – herunder markering af de søgte attributter. Søg blot efter \"Rustning\", \"Styrke\", \"Afstand\" osv. for at få markeret de attributter, du leder efter. Det har aldrig været nemmere at vælge den perfekte genstand til den perfekte plan. Nu er guldet det eneste, du skal bruge.",
  "springcleaning22_item_tooltips": "Udvidede genstandsbeskrivelser",
  "springcleaning22_item_tooltips_desc": "Bliver du ved med at glemme, hvor meget mana du får for intelligens? Eller hvor meget rustning du får for agilitet? Tænk ikke mere på det, da det eneste, du skal gøre nu, er at holde ALT nede for at se udvidede genstandsbeskrivelser med egenskaber under alle deres komponenter.",
  "springcleaning22_colored_ability_damage": "Evneskade i farver",
  "springcleaning22_colored_ability_damage_desc": "Man kan kun foretage gode valg i kampens hede, hvis man kender til udfordringerne forude. For at hjælpe dig med at forstå de mulige farer er skade gjort af besværgelser og genstande nu farvet i forhold til, om skaden er fysisk, magisk eller ren.",
  "springcleaning22_pluralized_strings": "Forbedret sprogunderstøttelse af strenge med flertalsformer",
  "springcleaning22_pluralized_strings_desc": "For at forbedre spillets tilgængelighed i hele verden har vi tilføjet funktioner, som bedre understøtter flertalsgrammatik på adskillige sprog, og vi har opdateret over 400 linjer tekst som følge af disse ændringer.",
  "springcleaning22_permanent_debuffs": "Permanente buffs",
  "springcleaning22_permanent_debuffs_desc": "Det er svært at lægge en strategi, hvis ikke man forstår virkningen af sine handlinger. For at gøre flere oplysninger tilgængelige efter kampen kan man nu se drab med Necrophos' Reaper's Scythe og Axes Culling Blade i kampopsummeringen.",
  "springcleaning22_post_game_sortable": "Sorterbare oplysninger efter spillet",
  "springcleaning22_post_game_sortable_desc": "Vil du nærstudere detaljerne bag din sejr? Kampopsummeringen efter spillet kan nu sorteres for at gøre oplysningerne nemmere at analysere.",
  "springcleaning22_gameplay_tp_boots": "Boots of Travel har nu mindre sandsynlighed for at teleportere til et kryb, når de bruges indenfor rækkevidden af et tårn.",
  "springcleaning22_gameplay_sellback": "Spillere kan nu sælge en genstand for fuld pris de første 30 sekunder efter spillet starter, i stedet for den almindelige periode på 10 sekunder.",
  "springcleaning22_gameplay_lifestealer_consume": "Lifestealers evne Consume anvender nu den samme genvejstast uanset hvilken type enhed, evnen bruges på.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Ogre Bruiser har nu lydeffekter til sin optrapning og lammelse.",
  "springcleaning22_gameplay_neutral_aura_radius": "Man kan nu se radiussen på alle neutrale krybs auraer ved at holde markøren over dem.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Når attributbonusserne for Wraith Band, Null Talisman og Bracer fordobles, når spiltiden runder 25 minutter, så opdateres deres beskrivelser også for at afspejle værdierne.",
  "springcleaning22_gameplay_heal_overhead": "Rettede flere tilfælde, hvor viste helingsværdier ikke inkluderede helingsamplifikation.",
  "springcleaning22_gameplay_fountain_invuln": "Spillere med springvandets udødelighedseffekt autoangriber ikke længere fjender inden for rækkevidde, så effekten mistes.",
  "springcleaning22_gameplay_blink_range": "Rækkeviddeindikatorer for blink og dens varianter tager nu hensyn til effekter, der øger kasterækkevidden.",
  "springcleaning22_gameplay_desolator_tooltip": "Præciserede beskrivelsen af Desolators passive evne Soul Stealer. Desolator får angrebsskade, når en fjende dør, mens fjenden er påvirket af Corruption-effekten.",
  "springcleaning22_gameplay_ardm_stash": "Rettede en fejl i ARDM, hvor en kurér, der returnerede genstande til lageret, mens den var død, fik genstanden til at forsvinde.",
  "springcleaning22_gameplay_neutral_items_lock": "Neutrale genstande kan ikke længere låses for kombinering. Dette retter en fejl, hvor kurérer ikke ville levere kombinationslåste neutrale genstande.",
  "springcleaning22_gameplay_illusion_modifiers": "Rettede en fejl, hvor illusioner med flere af den samme modifikator havde forkerte varigheder, så den rigtige helt dermed kunne identificeres.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Rettede en fejl i Turbo og nybegyndertilstand, hvor nogle guldkilder ikke blev korrekt skaleret.",
  "springcleaning22_gameplay_turbo_courier": "Rettede en fejl i Turbo, hvor en spillers kurér ikke længere fungerede, hvis spilleren afbrød forbindelsen under heltevalg eller strategitid.",
  "springcleaning22_gameplay_zero_tooltips": "Rettede en fejl, hvor visse beskrivelser i spillet, som ændres af talenter, viste værdier som 0 i stedet for de korrekte værdier.",
  "springcleaning22_gameplay_euls_invulnerable": "Når Eul's Scepter anvendes på besværgelsesimmune kloner, påføres dens effekt nu korrekt på klonen i stedet for blot at gå på nedkøling.",
  "springcleaning22_gameplay_kobold_aura": "Kobolds evne Prospecting Aura virker ikke længere på krybhelte (f.eks. Lone Druids bjørn), hvilket retter en fejl, hvor den fejlagtigt gav det dobbelte af sin effekt.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Kloner, inklusive kloner fra Tempest Double, modtager nu attributbonusserne korrekt fra Aghanim's Scepter, som Alchemist har givet.",
  "springcleaning22_gameplay_chen_hand_of_god": "Chens evne Hand of God påfører nu heling over tid til hans kontrollerede kryb, i stedet for kun at hele dem.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Arc Wardens klon fra Tempest Double får nu sin skadestraf fra afstand beregnet korrekt, når Arc Warden er ved at genoplive.",
  "springcleaning22_gameplay_arc_warden_basher": "Tilføjede en beskrivelse, der præciserer, at kloner og Tempest Double ikke kan lamme med Skull Basher eller Abyssal Blade.",
  "springcleaning22_gameplay_arc_warden_blink": "Blink Dagger på Arc Wardens Tempest Double er ikke længere på nedkøling, når klonen skabes.",
  "springcleaning22_gameplay_arc_warden_wards": "Arc Wardens Tempest Double kan ikke længere modtage delte wards.",
  "springcleaning22_gameplay_pa_scepter_double": "Phantom Assassins opgradering med Aghanim's Scepter nulstiller ikke længere Blur, når hun dræber en Tempest Double.",
  "springcleaning22_gameplay_naga_siren_riptide": "Naga Sirens \"Rip Tide: -1 angreb før aktivering\" reducerer nu evnen korrekt med 1 angreb, ikke 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Legion Commanders bonusskade fra Duel tildeles nu, selvom vinderen er usårlig.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Tusks Walrus Kick har nu den rigtige nedkøling på 12 sekunder.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Terrorblades Metamorphosis har nu den rigtige varighed på 35/40/45/50.",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey Kings Tree Dance kan ikke længere bruges til at flygte fra Arena of Blood.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "I Ability Draft afspilles effekterne fra Naga Sirens Rip Tide nu på den rigtige helt i stedet for altid på Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki kan nu bruge Smoke Screen, mens han kanaliserer Tricks of the Trade uden at afbryde kanaliseringen, selvom \"Kanaliserede evner kræver hold/stop\" er slået til.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Rettede interaktionen mellem Marcis Dispose og BKB og Lotus Orb.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Snipers Concussive Grenade viser nu et afvæbningsikon over hovedet.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling beholder ikke længere den passive evne Spirit Link ved forvandling til Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Tilføjede manglende kanaliseringsikon for Underlords Fiend's Gate",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Tilføjede manglende beskrivelse til Icefire Bombs svækkelse.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Dark Wallows partikeleffekter fra Cursed Crown med Aghanim's Shard har nu korrekt timing.",
  "springcleaning22_gameplay_lone_druid_midas": "Når Lone Druids Spirit Bear bruger Hand of Midas, gives XP nu til helten, der styrer Spirit Bear.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear og Tempest Double kan nu få ladninger til Magic Stick, Magic Wand og Holy Locket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Void Spirits beskrivelse til Astral Step viser nu de korrekte værdier for evneamplifikation, når ALT holdes nede.",
  "springcleaning22_gameplay_heavenly_jump_range": "Rækkevidden for Zeus' Heavenly Jump vises nu, når man holder musen over.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Rettede beskrivelserne til Crystal Maidens Arcane Aura.",
  "springcleaning22_gameplay_hex_tooltip": "Rettede, at beskrivelsen til Shadow Shamans Hex ved en fejl tilføjede 1 sekund til varigheden, når talentet \"Hex deaktiver passive evner\" blev valgt.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Rettede, at Abaddons level 20-talent ikke opdaterede nedkølingen for Borrowed Time i beskrivelsen.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Rettede Shadow Fiends Presence of the Dark Lord, så den påføres korrekt på neutrale kryb.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Rettede, at Tinkers Warp Flare virkede på Roshan",
  "springcleaning22_gameplay_ability_draft_wukong": "Rettede i Ability Draft, at kloner fra Wuking's Command ikke havde de korrekte evner.",
  "springcleaning22_rubick_illusions": "Rettede en fejl, der forhindrede illusioner af Rubick i at have korrekte animationer baseret på hans stjålne besværgelser (f.eks. Banes Fiend's Grip med Aghanim's Scepter).",
  "springcleaning22_rubick_hunter_in_the_night": "Hunter in the Night kan nu stjæles, når evnen opgraderes med Aghanim's Shard.",
  "springcleaning22_rubick_juxtapose": "Juxtapose kan nu stjæles, når evnen opgraderes med Aghanim's Scepter.",
  "springcleaning22_rubick_fireball": "Dragon Knights Fireball kan nu stjæles uafhængigt af Dragon Form, og evnen tildeles ikke længere automatisk.",
  "springcleaning22_rubick_wolf_bite": "Wolf Bite virker nu, når evnen stjæles.",
  "springcleaning22_rubick_depth_shroud": "Depth Shroud virker nu, når evnen stjæles.",
  "springcleaning22_rubick_astral_spirit": "Fjernede den separate bevægelsesevne, der blev tildelt, når man stjal Astral Spirit. Rubick kan nu beholde begge evnepladser, når han stjæler denne evne.",
  "springcleaning22_rubick_reverse_time_walk": "Reverse Time Walk anvender nu den samme evneplads, som Time Walk gør, hvis Rubick har Aghanim's Shard. Rubick kan nu beholde begge evnepladser, når han stjæler denne evne.",
  "springcleaning22_rubick_jaunt": "Ethereal Jaunt anvender nu den samme evneplads, som Illusory Orb gør. Rubick kan nu beholde begge evnepladser, når han stjæler denne evne.",
  "springcleaning22_rubick_eject": "Eject anvender nu den samme evneplads, som Dismember gør, hvis Rubick har Aghanim's Shard. Rubick kan nu beholde begge evnepladser, når han stjæler denne evne.",
  "springcleaning22_rubick_dismember": "Dismember løslader nu den allierede helt, hvis en anden stjålet besværgelse overtager dens plads.",
  "springcleaning22_rubick_spit_out": "Spit Out anvender nu den samme evneplads, som Gobble Up gør. Rubick kan nu beholde begge evnepladser, når han stjæler denne evne.",
  "springcleaning22_rubick_decoy": "Når Rubick stjæler Decoy, stjæles der ikke længere også Bushwhack. Decoy påfører stadig effekten fra Bushwhack, når evnen anvendes.",
  "springcleaning22_rubick_spirits": "Hvis Ios evne Spirits stjæles, virker den nu korrekt, når man anskaffer sig Aghanim's Scepter.",
  "springcleaning22_rubick_gravekeepers_cloak": "Gravekeeper's Cloak kan nu stjæles, når evnen opgraderes med Aghanim's Shard.",
  "springcleaning22_rubick_shard_cursed_crown": "Hvis Rubick har Aghanim's Shard, skaber Cursed Crown nu også instanser af Bramble Maze omkring målet.",
  "springcleaning22_rubick_shard_venomous_gale": "Hvis Rubick har Aghanim's Shard, skaber Venomous Gale nu også Plague Wards.",
  "springcleaning22_rubick_shard_sprout": "Hvis Rubick har Aghanim's Shard, skaber Sprout nu også Treants.",
  "springcleaning22_rubick_shard_shackles": "Hvis Rubick har Aghanim's Shard, skaber Shackles nu også Serpent Wards.",
  "springcleaning22_rubick_shard_cold_embrace": "Hvis Rubick har Aghanim's Shard, udsender Cold Embrace nu også en Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "Hvis Rubick har Aghanim's Shard, påfører Earthshock også Enrage.",
  "springcleaning22_rubick_shard_shadow_step": "Hvis Rubick har Aghanim's Scepter, påfører Shadow Step også Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "Hvis Rubick har Aghanim's Scepter, påfører Terror Wave også Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "Hvis Rubick har Aghanim's Shard, har Homing Missile også Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Hvis Rubick har Aghanim's Shard, påfører Slithereen Crush også Corrosive Haze.",
  "springcleaning22_rubick_scepter_flak_cannon": "Hvis Rubick har Aghanim's Scepter, har Flak Cannon også den passive evne Side Gunner.",
  "springcleaning22_rubick_scepter_time_walk": "Hvis Rubick har Aghanim's Scepter, påfører Time Walk også Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Hvis Rubick har Aghanim's Scepter, påfører Shuriken Toss også Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Hvis Rubick har Aghanim's Scepter, påfører Sacred Arrow også Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "Vektormål på hurtigkast ved tastenedtryk er blevet ændret, så vektorens trækning begynder ved nedtryk på tasten og slutter ved slip af tasten. Dette er det samme som adfærden for hurtigkast ved slip af tast.",
  "springcleaning22_ui_ward_bounty": "Kampbegivenheden af at ødelægge en Observer Ward viser nu, hvem der modtog dusøren, hvis det ikke var den angribende helt.",
  "springcleaning22_ui_spectator_hud_player_view": "Tilskuergrænsefladen viser nu korrekt den spiller, du ser på.",
  "springcleaning22_ui_post_game_scepter_shard": "Beskrivelserne til Aghanim's Scepter og Shard viser nu effekterne på pointtavlen efter spillet.",
  "springcleaning22_ui_post_game_backpack_neutral": "Rygsæk og neutrale genstande vises nu i heltens detaljeoversigt efter spillet.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Værdier for evnelivsstjæl hos helte og kryb vises nu separat, når man holder ALT nede.",
  "springcleaning22_ui_skeleton_warrior_rally": "Skeleton Warriors auraevne Rally optælles nu i ét effektikon i stedet for at vise ét ikon per effekt.",
  "springcleaning22_ui_neutral_item_teleport": "Rettede, at man kunne teleportere den forkerte neutrale genstand, hvis man byttede den ud med en anden hurtigt nok.",
  "springcleaning22_ui_spectator_arcana": "Arcanagrænseflader vises ikke længere i ligakampe for tilskuere.",
  "springcleaning22_ui_ready_check_enter": "Man kan nu trykke ENTER for at acceptere et klartjek.",
  "springcleaning22_ui_alt_item_combine": "Genstande i hurtigkøbsmenuen viser nu den genstand, de kombineres til, når man holder ALT nede.",
  "springcleaning22_ui_alt_items_ready": "Når man holder CTRL nede, mens man ALT-klikker på følgende genstande, fortæller man nu holdet, at genstandene er klar, fremfor at holdet skal samle sig: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight og Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Øgede antallet af ejede Sentry Wards i strategiperioden fra 2 til 3. I starten af spillet kan der maks. købes 3 Sentry Wards.",
  "springcleaning22_ui_guide_pregame": "Efter heltevalg vil sektionen med anbefalede genstande nu vise den første sektion af en guide, hvis guiden ikke har noget afsnit kaldet \"Startgenstande\".",
  "springcleaning22_ui_ward_planter": "Når man vælger wards, kan allierede spillere, tilskuere og coaches nu se, hvem der anbragte dem.",
  "springcleaning22_ui_courier_home_button": "Knappen \"Hjemmebutik\" for kuréren returnerer nu også eventuelle genstande, kuréren har, til lageret, når den kommer til basen.",
  "springcleaning22_ui_combat_log_key": "Man kan nu tilknytte kamploggen til en tast i indstillingerne.",
  "springcleaning22_ui_combat_log_right_align": "Kamploggen er nu justeret til højre og overlapper ikke længere knapperne til helteafprøvning.",
  "springcleaning22_ui_combat_log_hud_flip": "Kamploggen følger nu med, når man bruger omvendt grænseflade (minikort i højre side), og den flytter sig til venstre side, når denne indstiling er slået til.",
  "springcleaning22_ui_guide_apos": "Rettede, at guiders kommentarer til genstande og evner erstattede apostroffer med \"&apos;\" og andre HTML-symboler, når de blev gemt. Guider, der allerede er blevet gemt med dette problem, skal stadig opdateres manuelt.",
  "springcleaning22_ui_vs_screen_widescreen": "Justerede visning af heltene på VS-skærmen i skærmbredder på 21:9 eller bredere.",
  "springcleaning22_ui_charms": "Rettede en fejl, hvor grænsefladen for amuletter overlappede tekst, hvis man havde 2 eller flere amuletter.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Rettede en fejl i dødsstødtræneren, hvor kryb ikke blev skabt, hvis man klikkede start, før helten blev indlæst.",
  "springcleaning22_ui_intro_scenes": "Introscener (såsom nye helte og udgivelse af Arcana- og Persona-genstande) vises ikke længere for spillere, der ikke har været gennem introforløbet for nye spillere.",
  "springcleaning22_cosmetics_illusion_skins": "Rettede en fejl, hvor illusioner ikke altid havde det korrekte udseende fra kosmetiske genstande.",
  "springcleaning22_cosmetics_cloth_stretch": "Rettede en fejl, hvor stoffet på visse modeller kunne strække sig på tværs af skærmen.",
  "springcleaning22_cosmetics_underlord_immortal": "Underlords udødelige genstand \"Emerald Subjugation\" har nu tilpassede evneeffekter, der erstatter effekterne fra hans ultimateevne.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Shadow Demons udødelige genstand \"Mantle of Grim Facade\" har nu sine projektileffekter for Shadow Poison vendt korrekt.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Wraith Kings udødelige genstand \"Blistering Shade\" har højere prioritet over Arcana-genstanden, når han bruger \"Wraithfire Blast\".",
  "springcleaning22_cosmetics_earthshaker_immortal": "Rettede de omgivende effekter på Earthshakers udødelige genstand \"Bracers of the Cavern Luminar\".",
  "springcleaning22_cosmetics_warlock_immortal": "Warlocks udødelige genstand \"Umbral Glyph\" har fået rettet sine evneeffekter på Shadow Word (både på allierede og fjender).",
  "springcleaning22_cosmetics_viper_immortal": "Vipers udødelige genstand \"Malefic Drake's Strike\" har fået rettet sine områdepartikler til Nethertoxin.",
  "springcleaning22_cosmetics_abaddon_vessel": "Abaddons genstand \"Blade of the Demonic Vessel\" har fået gendannet sine effekter til Aphotic Shield.",
  "springcleaning22_cosmetics_tidehunder_belt": "Tidehunters genstand \"Horror From the Deep Belt\" har fået fjernet forkerte partikler fra bæltepladsen, der hørte til på armen.",
  "springcleaning22_cosmetics_faceless_incursion": "Faceless Voids våbengenstand \"Claszureme Incursion\" har fået rettet sine omgivende effekter.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Drow Rangers Arcana-genstand giver nu tilpassede effekter i begge stile til Marksmanship.",
  "springcleaning22_cosmetics_rubick_dilemma": "Rubicks genstand \"Torch of Fantoccini's Dilemma\" har fået gendannet sine omgivende effekter.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Techies' sårede løbeanimation fra deres Arcana-genstand afspilles nu med den korrekte hastighed.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Tilføjede understøttelse af ædelstensfarver på Sticky Bomb og Reactive Tazer til Techies' Arcana-genstand.",
  "springcleaning22_cosmetics_techies_icons": "Tilføjede manglende økonomiikon for Techies-sættene \"Powdersled Rookery\", \"Sapper's Guile\", \"Bombtrails and Boomsticks\" og \"March of the Powderkeg Patrol\".",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Rettede animation for Techies' karakter \"Spoon\" i teleportforhåndsvisningen med Pachyderm Powderwagon-sættet.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Rubicks Arcana-genstand har nu tilpassede effekter til Techies' Sticky Bomb i stedet for Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Rettede Snapfires animation, når hun er uskadeliggjort, så hun ikke længere sidder fast i den forkerte animationssekvens.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Legion Commanders \"Radiant Conqueror\"-bundt og -genstande kan nu sælges og byttes.",
  "springcleaning22_cosmetics_legion_commander_wind": "Tilføjede vindeffekter til Legion Commanders bannere \"Legacy of the Fallen Legion\" og \"Radiant Conqueror\" med eller uden Arcana-våbene udstyret.",
  "springcleaning22_perf_panorama_atlas": "Opdaterede Panorama-grænseflademotoren, så den anvender opdeling til mere effektivt at interagere med GPU'en. I vores målinger resulterede dette i 25-30% bedre ydelse i grænsefladens påkrævede GPU-ydelse, og med meget mere på visse særligt komplicerede dashboardsider. Denne ændring øger også CPU-ydelsen for Vulkan og skulle også gerne være særligt effektiv på Apple-computere med M1-processorer.",
  "springcleaning22_perf_sand_king_particles": "Optimerede partikeleffekterne i \"Sand Storm\" for at forbedre ydeevnen.",
  "springcleaning22_perf_panorama_clears": "Opdaterede Panorama-grænseflademotoren for at undgå nogle unødvendige gengivelser af ryddede mål og dermed undgå ekstra GPU-belastning.",
  "springcleaning22_perf_scenesystem_threading": "Rettede en fejl, hvor vi nogle gange brugte færre tråde end planlagt til multitrådede processer. Denne rettelse er særligt effektiv på maskiner, der har 4 eller færre kerner.",
  "springcleaning22_perf_thread_affinity": "Rettede en fejl, hvor trådtilhørsforhold, der var forkert sat, kunne forårsage stop på visse maskiner.",
  "springcleaning22_perf_power_savings": "Tilføjede en advarsel i dialogboksen for videoindstillinger for at indikere, hvis computeren kører i strømsparetilstand, hvilket kan medføre langsom ydeevne.",
  "springcleaning22_perf_shop_tooltips": "Forbedrede ydeevnen af beskrivelser, når man kigger i genstandsbutikken.",
  "springcleaning22_custom_games_overview_sort": "I fanen \"Arkade\" kan man nu sortere i oversigten efter antal aktive spillere udover antallet af åbne lobbyer.",
  "springcleaning22_custom_games_update": "Rettede et problem, hvor tilpassede Dota-arkadespil nogle gange ikke viste, at de skulle opdateres, før de blev geninstalleret, eller Steam blev genstartet.",
  "springcleaning22_custom_games_lobby_version": "Dota-arkadens lobbyliste viser ikke længere lobbyer, der ikke matcher versionen af det tilpassede spil, som i øjeblikket er installeret, eller som på anden vis ikke kan sluttes til.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold kan nu filtrere guld modtaget fra dusørruner.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Erstattede relikvie for Dazzle: \"Bad Juju-debuffs på fire helte\" erstattet med \"Skade og heling fra Bad Juju\"",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Erstattede relikvie for Techies: \"Drab med Remote Mine\" erstattet med \"Sticky Bombs fæstnet på helte\".",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Erstattede relikvie for Techies: \"Lammelser med Stasis Trap\" erstattet med \"Afvæbning af flere helte med Reactive Tazer\".",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Erstattede relikvie for Tinker: \"March of the Machines-skade\" erstattet med \"Skade absorberet med Defense Matrix\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Erstattede relikvie for Underlord: \"Dark Rift, der fører til drab\" erstattet med \"Drab fra allierede ved brug af Fiend's Gate\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Erstattede relikvie for Underlord: \"Helte reddet med Rift\" erstattet med \"Bonusskade udført med Atrophy Aura\".",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Rettede relikvie for Omniknight: \"Allieret skade under Heavenly Grace\".",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Rettede relikvie for Primal Beast: \"Onslaught på flere helte\".",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Erstattede helteudfordringen for Meepo: \"Magisk skade på helte\" erstattet med \"Ren skade på helte\".",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Erstattede helteudfordringen for Naga Siren: \"Helte helbredt under Song of the Siren\" erstattet med \"Gør skade med afbrændt mana på helte\"",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Erstattede helteudfordringen for Tinker: \"March of the Machines-skade\" erstattet med \"Skade absorberet med Defense Matrix\"",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Erstattede helteudfordringen for Techies: \"Drab med Remote Mine\" erstattet med \"Fæstnede Sticky Bombs\"",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Erstattede helteudfordringen for Underlord: \"Teleportering af flere helte med Dark Rift\" erstattet med \"Drab fra allierede ved brug af Fiend's Gate\"",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Opdaterede helteudfordringen for Grimstroke: \"Skade gjort mod fjender påvirket af Soul Bind\" inkluderer nu skade fra allierede.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Opdaterede helteudfordringen for Mirana: \"Skade gjort i løbet af Leap\" inkluderer nu alle typer af skade i stedet for kun at inkludere fysisk skade.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Rettede helteudfordringen for Bane: \"Kombination: Blink/Force Staff og Fiend's Grip\".",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Rettede helteudfordring for Dragon Knight: \"Drab under Dragon Form\".",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Rettede helteudfordringen for Drow Ranger: \"Undertryk 2+ fjender med Gust\".",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Rettede helteudfordringen for Crystal Maiden: \"Krybdrab med Frostbite\".",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Rettede helteudfordringen for Dark Seer: \"Skade gjort under Surge\".",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Rettede helteudfordringen for Lifestealer: \"Skade gjort under Rage\".",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Rettede helteudfordringen for Lone Druid: \"Skade gjort under True Form\".",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Rettede helteudfordringen for Mars: \"Skade gjort mod fjendtlige helte\".",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Rettede helteudfordringen for Mars: \"Dræb fjendtlige enheder med kløvning\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Rettede helteudfordringen for Omniknight: \"Skade gjort under Heavenly Grace\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Rettede helteudfordringen for Omniknight: \"Varighed med Heavenly Grace på allierede\".",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Rettede helteudfordringen for Rubick: \"Lammelser med Telekinesis på flere helte\".",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Rettede helteudfordringen for Tinker: \"Skade gjort mod helte med Laser opgraderet af Aghanim's Scepter\".",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Rettede helteudfordringen for Tusk: \"Kombination: Walrus Punch og Walrus Kick\".",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Fjernede helteudfordringen for Venomancer: \"Skade gjort mod helte, som er påvirket af Silver Edge\".",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Fjernede helteudfordringen for Tinker: \"Kryb dræbt med March of the Machines\".",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Tilføjede helteudfordring for Underlord: \"Skade på helte med Firestorm\".",
  "springcleaning22_workshop_modeldoc": "Dota-værkstedsværktøjer til genstande og tilpassede spil er blevet opgraderet til at bruge den nye \"ModelDoc\"-modeleditor. Værkstedsbidragere bør migrere alle modeller fra det gamle værktøj, da det bliver fjernet i en fremtidig opdatering."
}