// 3130.js

{
  "language": "thai",
  "springcleaning22_desc": "อัปเดตเทศกาลเก็บกวาดฤดูใบไม้ผลิ 2022 มาแล้ว ซึ่งจะปัดเป่าเหล่าบั๊กทั้งหลายให้หายสิ้น และปรับปรุงเพิ่มเสริมคุณภาพชีวิตใหม่มากมาย ลองอ่านการเปลี่ยนแปลงหลักบางส่วน เช่น การปรับปรุงคำอธิบายสำหรับ Aghanim ส่วนควบคุมสำหรับปิดการสื่อสาร การค้นหาในร้านค้า และโหมดลองฮีโร่ จากนั้นก็ดำดิ่งเข้าไปดูรายการเปลี่ยนแปลงแก้ไขเกมเพลย์ฉบับเต็มได้ในรายละเอียดทั้งหมดด้านล่างนี้",
  "springcleaning22_aghs_tooltips": "คำอธิบายการอัปเกรดโดย Aghanim's Scepter และ Aghanim's Shard",
  "springcleaning22_aghs_tooltips_desc": "เป็นที่ทราบกันดีว่ามันสมองความนึกคิด (และบทพูด) ของ Aghanim นั้นซับซ้อนเกินกว่าที่เหล่ามนุษย์ดาษดื่นจะเข้าใจได้ แต่อัปเดตในวันนี้จะมาช่วยเฉิดฉายอธิบายคุณประโยชน์ของ Scepter และ Shard ให้ชัดเจนอย่างไม่เคยมีมาก่อน คำอธิบายสำหรับการอัปเกรดของ Aghanim ในตอนนี้จะระบุรายละเอียดเพิ่มเติมเกี่ยวกับการเปลี่ยนแปลงให้เห็นเป็นจำนวนตัวเลขแน่ชัด และสกิลที่ปรับเปลี่ยนก็จะแสดงข้อมูลดังกล่าวเป็นสัดส่วนเฉพาะ นอกจากนี้การอัปเกรดหลายอย่างได้รับการพิจารณาเป็นรายสกิลและปรับการอธิบายให้พวกที่ไม่ได้เป็นยอดจอมเวทเข้าใจได้ง่ายขึ้น",
  "springcleaning22_muting_ui": "ปรับปรุงส่วนควบคุมการปิดการสื่อสาร",
  "springcleaning22_muting_ui_desc": "ชาว Dota ต่างก็เป็นผู้เล่นเปี่ยมไฟกันทั้งสิ้นและในบางครั้งอารมณ์ที่ไม่เหมาะเหม็งอาจปะทุรุนแรงในระหว่างการแข่งขันอันดุเดือด ในกรณีที่พฤติกรรมดังกล่าวเริ่มส่งผลเสีย ช่องทางที่สะดวกและรวดเร็วสำหรับปิดการสื่อสารและรายงานผู้เล่น จึงเป็นสิ่งสำคัญเพื่อหยุดยั้งผลเสียต่อเกมของคุณและช่วยตรวจวัดความประพฤติผู้เล่นนั้นต่อไป ด้วยเหตุดังกล่าว ตอนนี้คุณจะสามารถปิดการสื่อสารทางเสียง ทางข้อความ และรายงานผู้เล่นได้โดยการคลิกเพียงครั้งเดียว นอกจากนี้คุณยังสามารถคลิกขวาเพื่อปิดเฉพาะข้อความหรือเสียงในกรณีที่ผู้เล่นอาจไม่ได้ก่อกวนแต่แค่ไม่ต้องการรับการสื่อสารจากผู้เล่นนั้น อีกทั้งคุณยังสามารถควบคุมเชิงรวมได้อย่างง่ายโดยการใช้ปุ่มใหม่ \"ปิดการสื่อสารทีม\" ซึ่งจะบล็อกการสื่อสารทั้งหมดจากทีมด้วยการคลิกครั้งเดียว\\n\\nนอกจากนั้น เรายังใช้โอกาสนี้เพื่อประเมินอีกครั้งว่าเราควรจัดการกับรายงานการสื่อสารอย่างไรดี เป้าหมายของเราคือ เพื่อช่วยให้สามารถปิดการสื่อสารที่ทำให้อารมณ์เสียได้อย่างรวดเร็วและง่ายดาย ขณะเดียวกันก็สามารถชี้ชัดได้ว่าผู้เล่นคนไหนที่เราอาจต้องใช้มาตรการที่เข้มงวดมากขึ้น",
  "springcleaning22_demo_hero": "ปรับปรุงโหมดลองฮีโร่",
  "springcleaning22_demo_hero_desc": "อยากทดลองแผนใหม่หรือคิดค้นแผนของตนเองงั้นหรือ? หรือว่าแค่รู้สึกกระเหี้ยนกระหือรืออยากลองฟาด Tidebringer สักครั้งแล้วดูว่าเหล่า Axe จะตายพร้อมกันได้เยอะขนาดไหน ไม่ว่าความต้องการคุณจะเป็นเช่นใดก็ถือเป็นโชคดีของคุณ! โหมดลองฮีโร่ได้รับการอัปเดตพร้อมกับปรับให้มีคุณสมบัติใหม่มากมาย:",
  "springcleaning22_demo_hero_map": "ส่วนเหนือของแผนที่ทดลองฮีโร่ได้รับการขยายเพื่อให้มีพื้นราบสำหรับทดสอบมากขึ้น",
  "springcleaning22_demo_hero_hero_spawn": "เพิ่มการควบคุมให้สามารถเสกฮีโร่ฝ่ายเดียวกันได้ง่ายขึ้น จากเดิมที่มีแค่ปุ่มเสกศัตรู",
  "springcleaning22_demo_hero_hero_reset": "เพิ่มการควบคุมสำหรับรีเซ็ตฮีโร่กลับไปเลเวล 1",
  "springcleaning22_demo_hero_hero_remove": "เพิ่มการควบคุมสำหรับลบฮีโร่ออกหากคุณทดสอบเสร็จแล้ว",
  "springcleaning22_demo_hero_hero_select": "การสร้างฮีโร่ใหม่จะเพิ่มฮีโร่ดังกล่าวเข้าสู่ยูนิตที่คุณกำลังเลือกควบคุม",
  "springcleaning22_demo_hero_levelling": "ปุ่มสำหรับเพิ่มเลเวล, เพิ่ม Scepter, เพิ่ม Shard และเปิด/ปิดสถานะอมตะต่อจากนี้จะมีผลต่อฮีโร่ที่กำลังเลือกทุกตัว",
  "springcleaning22_demo_creep_toggle": "ต่อจากนี้เมื่อปิดครีปจะทำลายครีปเลนที่มีอยู่ทุกตัว",
  "springcleaning22_demo_creep_spawn": "เพิ่มปุ่มสำหรับเสกครีปชุดเดียวจากแต่ละฝั่ง",
  "springcleaning22_demo_hero_runes": "เพิ่มปุ่มสำหรับเสกรูนหลักทั้ง 6 ขึ้นมา",
  "springcleaning22_shop_search": "อัปเดตการค้นหาในร้านค้า",
  "springcleaning22_shop_search_desc": "การใช้จ่ายโกลด์ควรเป็นเรื่องง่าย สนุก และที่สำคัญที่สุดคือต้องมีประสิทธิภาพ ดังนั้นเพื่อช่วยให้การสังหารเก็บโกลด์ของคุณรู้สึก \"มิ้ปเหมิป\" น้อยลงและให้อารมณ์เหมือนเสียง \"Last Hit\" มากขึ้น ระบบการค้นหาในร้านค้าจึงได้รับการปรับขยายและพัฒนาให้รองรับคำค้นหาต่าง ๆ พร้อมกับไฮไลต์แสดงค่าสถานะที่ค้นหา เพียงแค่ค้นหาคำว่า \"เกราะ\", \"Strength\", \"ระยะ\" ฯลฯ ร้านค้าก็จะไฮไลต์ค่าที่คุณสนใจ การเลือกไอเท็มให้เหมาะเจาะกับแผนที่สมบูรณ์แบบในตอนนี้จะง่ายกว่าเดิมขึ้นหลายขุม คราวนี้ก็เหลือแค่ต้องหาโกลด์มาเท่านั้น",
  "springcleaning22_item_tooltips": "คำอธิบายไอเท็มอย่างละเอียด",
  "springcleaning22_item_tooltips_desc": "คุณชอบลืมหรือไม่ว่าค่า Intelligence มอบมานาให้เท่าไหร่? หรือค่า Agility จะได้เกราะป้องกันสักเท่าไหร่กันนะ? ไม่ต้องนั่งหวนรำลึกอีกต่อไป ต่อจากนี้เพียงแค่กดปุ่ม ALT ขณะดูคำอธิบายไอเท็มก็จะขยายรายละเอียดและแสดงส่วนย่อยของคุณสมบัติต่าง ๆ ให้เห็น",
  "springcleaning22_colored_ability_damage": "สีแสดงความเสียหายสกิล",
  "springcleaning22_colored_ability_damage_desc": "การเดินหมากที่เหมาะสมจำเป็นต้องอาศัยความรอบรู้ในบททดสอบที่ต้องเผชิญ ดังนั้นเพื่อช่วยให้คุณเข้าใจถึงภัยอันตรายต่าง ๆ ได้ดีขึ้น ความเสียหายที่เกิดจากสกิลหรือไอเท็มต่อจากนี้จะแยกออกเป็นสีต่าง ๆ ขึ้นอยู่กับว่าความเสียหายเป็นประเภทกายภาพ เวทมนตร์ หรือโดยตรง",
  "springcleaning22_pluralized_strings": "ยกระดับการรองรับภาษาที่มีคำพหูพจน์",
  "springcleaning22_pluralized_strings_desc": "เพื่อให้ผู้เล่นทั่วทุกมุมโลกสามารถเข้าถึงเกมได้ง่ายขึ้น เราได้เพิ่มคุณสมบัติเพื่อรองรับหลักไวยากรณ์ของคำพหูพจน์สำหรับหลายภาษาให้ดีกว่าเก่า รวมทั้งอัปเดตข้อความมากกว่า 400 ประโยคให้สอดคล้องกับการเปลี่ยนแปลงนี้",
  "springcleaning22_permanent_debuffs": "บัฟถาวร",
  "springcleaning22_permanent_debuffs_desc": "การวางกลยุทธ์ย่อมเป็นเรื่องยากหากขาดความเข้าใจถึงผลลัพธ์การกระทำของคุณ เพื่อให้ข้อมูลหลังจบแมตช์สมบูรณ์มากขึ้น การสังหารจาก Reaper's Scythe ของ Necrophos และ Culling Blade ของ Axe ต่อจากนี้จะแสดงในหน้าจอหลังจบเกม",
  "springcleaning22_post_game_sortable": "ข้อมูลรายละเอียดหลังจบเกมจัดเรียงได้",
  "springcleaning22_post_game_sortable_desc": "อยากเจาะเบื้องลึกเบื้องหลังชัยชนะของคุณงั้นหรือ? ต่อจากนี้ข้อมูลในกระดานคะแนนหลังจบเกมจะสามารถจัดเรียงได้เพื่อให้วิเคราะห์สะดวกยิ่งขึ้น",
  "springcleaning22_gameplay_tp_boots": "Boots of Travel หากร่ายในระยะป้อมจะมีโอกาสเลือกเป้าหมายเป็นครีปน้อยลง",
  "springcleaning22_gameplay_sellback": "ต่อจากนี้ผู้เล่นสามารถขายไอเท็มเต็มราคาได้เมื่อขายภายใน 30 วินาทีแรกหลังจากเกมเริ่ม แทนช่วงเวลาขายคืนปกติที่ 10 วินาที",
  "springcleaning22_gameplay_lifestealer_consume": "Consume ของ Lifestealer ต่อจากนี้ใช้ปุ่มลัดเหมือนกันหมด ไม่ว่าจะสิงยูนิตประเภทใด",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Ogre Bruiser ต่อจากนี้มีเสียงเอฟเฟกต์ในการยกมือและสตัน",
  "springcleaning22_gameplay_neutral_aura_radius": "ต่อจากนี้ออราของครีปป่าทั้งหมดจะแสดงรัศมีเมื่อถูกชี้",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Wraith Band / Null Talisman / Bracer ต่อจากนี้อัปเดตจำนวนค่าสถานะในคำอธิบายไอเท็มเมื่อค่าเพิ่มขึ้น 2 เท่าในนาทีที่ 25",
  "springcleaning22_gameplay_heal_overhead": "แก้ไขบางกรณีที่จำนวนการรักษาที่แสดงขึ้นในเกมไม่ได้คำนวณอัตราเพิ่มการรักษาพลังชีวิต",
  "springcleaning22_gameplay_fountain_invuln": "ผู้เล่นที่มีบัฟอมตะจากบ่อน้ำพุจะไม่โจมตีอัตโนมัติและทำให้บัฟหลุดหากมีศัตรูในระยะอีกต่อไป",
  "springcleaning22_gameplay_blink_range": "ตัวแสดงระยะสกิลสำหรับ Blink ประเภทต่าง ๆ ต่อจากนี้จะคำนวณถึงบัฟเพิ่มระยะร่าย",
  "springcleaning22_gameplay_desolator_tooltip": "แก้ไขคำอธิบายสำหรับความสามารถติดตัว Soul Stealer ของ Desolator ให้ถูกต้องมากขึ้น Desolator จะได้รับพลังโจมตีหากศัตรูตายขณะได้รับผลจากดีบัฟ Corruption",
  "springcleaning22_gameplay_ardm_stash": "แก้ไขข้อบกพร่องใน ARDM กรณีเมื่อ Courier คืนไอเท็มกลับเข้าคลังเก็บของขณะตายแล้วจะทำให้ไอเท็มหายไป",
  "springcleaning22_gameplay_neutral_items_lock": "ไอเท็มครีปป่าไม่สามารถถูกล็อกการผสมไอเท็มได้อีกต่อไป ซึ่งจะแก้ไขข้อบกพร่องในกรณี Courier ไม่ยอมส่งไอเท็มครีปป่าที่ถูกล็อกการผสมไว้",
  "springcleaning22_gameplay_illusion_modifiers": "แก้ไขข้อบกพร่องที่ร่างเงาที่มีตัวปรับเปลี่ยนซ้ำกันจะมีระยะเวลาไม่ถูกต้อง ทำให้สามารถแยกฮีโร่ตัวจริงออก",
  "springcleaning22_gameplay_turbo_gold_scaling": "แก้ไขข้อบกพร่องใน Turbo และโหมดผู้เล่นใหม่ที่แหล่งมอบโกลด์บางส่วนไม่ได้ปรับเพิ่มขึ้นอย่างถูกต้อง",
  "springcleaning22_gameplay_turbo_courier": "แก้ไขข้อบกพร่องใน Turbo ที่ Courier ของผู้เล่นจะไม่สามารถใช้งานได้หากผู้เล่นตัดการเชื่อมต่อในระหว่างช่วงเลือกฮีโร่หรือช่วงวางกลยุทธ์",
  "springcleaning22_gameplay_zero_tooltips": "แก้ไขข้อบกพร่องที่คำอธิบายในเกมบางอย่างหากถูกเปลี่ยนค่าโดยทักษะพิเศษแล้วจะแสดงค่าเป็น 0 แทนค่าที่ถูกต้อง",
  "springcleaning22_gameplay_euls_invulnerable": "การร่าย Eul's Scepter ใส่ร่างโคลนที่ป้องกันเวทโดยสมบูรณ์ต่อจากนี้จะส่งผลต่อร่างโคลนอย่างถูกต้อง จากเดิมที่ทำให้ติดคูลดาวน์อย่างเดียว",
  "springcleaning22_gameplay_kobold_aura": "Prospecting Aura ของ Kobold ต่อจากนี้ไม่มีผลกับครีปของฮีโร่อีกต่อไป (เช่น หมีของ Lone Druid) ซึ่งจะแก้ไขข้อบกพร่องที่ก่อนหน้านี้มอบเอฟเฟกต์ให้ 2 เท่าโดยไม่ได้ตั้งใจ",
  "springcleaning22_gameplay_aghs_scepter_clones": "ร่างโคลนและ Tempest Double ต่อจากนี้ได้รับค่าสถานะจากพร Aghanim's Scepter ที่มอบโดย Alchemist ได้อย่างถูกต้อง",
  "springcleaning22_gameplay_chen_hand_of_god": "Hand of God ของ Chen ต่อจากนี้รักษาพลังชีวิตต่อเนื่องแก่ครีปที่ควบคุมโดย Chen อย่างถูกต้อง ไม่ใช่แค่เพียงรักษาตอนแรก",
  "springcleaning22_gameplay_arc_warden_reincarnate": "การลดพลังโจมตี Tempest Double ของ Arc Warden จากระยะห่างจากกันต่อจากนี้จะคำนึงถีงกรณี Arc Warden กำลังเกิดใหม่",
  "springcleaning22_gameplay_arc_warden_basher": "เพิ่มคำอธิบายระบุว่าร่างโคลนและ Tempest Double ไม่สามารถใช้ Bash จาก Basher หรือ Abyssal",
  "springcleaning22_gameplay_arc_warden_blink": "Blink Dagger ที่ถือโดย Tempest Double ของ Arc Warden จะไม่ติดคูลดาวน์เมื่อทำการอัญเชิญอีกต่อไป",
  "springcleaning22_gameplay_arc_warden_wards": "Tempest Double ของ Arc Warden ไม่สามารถรับ Ward ที่แบ่งปันได้อีกต่อไป",
  "springcleaning22_gameplay_pa_scepter_double": "การอัปเกรดโดย Aghanim's Scepter ของ Phantom Assassin ไม่ล้างคูลดาวน์ Blur เมื่อสังหาร Tempest Double อีกต่อไป",
  "springcleaning22_gameplay_naga_siren_riptide": "Rip Tide จำนวนการโจมตีที่ต้องการ -1 ครั้งของ Naga Siren ต่อจากนี้ลดจำนวนอย่างถูกต้อง นั่นคือลด 1 ครั้ง ไม่ใช่ 2 ครั้ง",
  "springcleaning22_gameplay_legion_commander_duel": "Duel ของ Legion Commander ต่อจากนี้มอบโบนัสพลังโจมตีให้ผู้ชนะแม้อยู่ในสถานะอมตะ",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Walrus Kick ของ Tusk ต่อจากนี้มีคูลดาวน์ถูกต้องที่ 12 วินาที",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Metamorphosis ของ Terrorblade ต่อจากนี้มีคูลดาวน์ถูกต้องที่ 35/40/45/50 วินาที",
  "springcleaning22_gameplay_monkey_king_arena": "Tree Dance ของ Monkey King ไม่สามารถหลบหนี Arena of Blood ได้อีกต่อไป",
  "springcleaning22_gameplay_naga_siren_ability_draft": "ใน Ability Draft เอฟเฟกต์ Riptide ของ Naga Siren จะแสดงบนฮีโร่ที่ถูกต้องแทนที่จะแสดงบน Naga Siren เสมอ",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki ต่อจากนี้สามารถใช้ Smoke Screen ขณะกำลังยืนร่าย Tricks of the Trade โดยไม่หลุดออกจากการยืนร่ายแม้ว่าจะเปิดตัวเลือก \"สกิลยืนร่ายจำเป็นต้องหยุดด้วยปุ่มหยุด/ประจำตำแหน่ง\"",
  "springcleaning22_gameplay_marci_dispose_lotus": "แก้ไขการทำงานสกิล Dispose ของ Marci เมื่อใช้กับ BKB และ Lotus Orb",
  "springcleaning22_gameplay_sniper_grenade_icon": "Concussive Grenade ของ Sniper ต่อจากนี้เพิ่มไอคอนปลดอาวุธด้านบนฮีโร่",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling ไม่สามารถเก็บสกิลติดตัว Spirit Link อย่างถาวรเมื่อใช้ Morph ใส่ Lone Druid ได้อีกต่อไป",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "แก้ไขไอคอนยืนร่ายที่หายไปสำหรับ Fiend's Gate ของ Underlord",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "เพิ่มคำอธิบายที่หายไปสำหรับดีบัฟ Icefire Bomb",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "เอฟเฟกต์อนุภาค Cursed Crown ของ Dark Willow ที่มี Aghanim's Shard ต่อจากนี้แสดงระยะเวลาอย่างถูกต้อง",
  "springcleaning22_gameplay_lone_druid_midas": "การใช้ Hand of Midas ด้วย Spirit Bear ของ Lone Druid ต่อจากนี้มอบค่าประสบการณ์แก่ฮีโร่ที่ควบคุม",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear และ Tempest Double ต่อจากนี้สามารถได้รับชาร์จ Magic Stick, Magic Wand และ Holy Locket",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "คำอธิบาย Astral Step ของ Void Spirit ต่อจากนี้แสดงค่าการเพิ่มความเสียหายสกิลอย่างถูกต้องเมื่อกด ALT",
  "springcleaning22_gameplay_heavenly_jump_range": "Heavenly Jump ของ Zeus ต่อจากนี้แสดงระยะของสกิลเมื่อชี้เมาส์บนไอคอน",
  "springcleaning22_gameplay_arcane_aura_tooltip": "แก้ไขคำอธิบาย Arcane Aura ของ Crystal Maiden",
  "springcleaning22_gameplay_hex_tooltip": "แก้ไขคำอธิบาย Hex ของ Shadow Shaman ที่มีระยะเวลาเพิ่ม 1 วินาทีอย่างไม่ถูกต้องในกรณีเลือกทักษะพิเศษ \"Hex ปิดสกิลติดตัว\"",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "แก้ไขทักษะพิเศษเลเวล 20 ของ Abaddon ที่ไม่อัปเดตคูลดาวน์ Borrowed Time ในคำอธิบาย",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "แก้ไข Presence of the Dark Lord ของ Shadow Fiend ให้ส่งผลต่อครีปป่าอย่างถูกต้อง",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "แก้ไข Warp Flare ของ Tinker ไม่ให้ส่งผลกับ Roshan อีกต่อไป",
  "springcleaning22_gameplay_ability_draft_wukong": "ใน Ability Draft แก้ไขร่างโคลน Wukong's Command ที่มีสกิลไม่ถูกต้อง",
  "springcleaning22_rubick_illusions": "แก้ไขข้อบกพร่องที่ทำให้ร่างเงา Rubick มีแอนิเมชันตามสกิลที่ขโมยไม่ถูกต้อง (เช่น Fiend's Grip ของ Bane ที่มี Aghanim's Scepter)",
  "springcleaning22_rubick_hunter_in_the_night": "Hunter in the Night ต่อจากนี้สามารถขโมยได้เมื่ออัปเกรดโดย Aghanim's Scepter",
  "springcleaning22_rubick_juxtapose": "Juxtapose ต่อจากนี้สามารถขโมยได้เมื่ออัปเกรดโดย Aghanim's Scepter",
  "springcleaning22_rubick_fireball": "Fireball ของ Dragon Knight ต่อจากนี้สามารถขโมยได้โดยแยกจาก Dragon Form และจะไม่มอบให้โดยอัตโนมัติ",
  "springcleaning22_rubick_wolf_bite": "Wolf Bite ต่อจากนี้ใช้งานได้เมื่อขโมย",
  "springcleaning22_rubick_depth_shroud": "Depth Shroud ต่อจากนี้ใช้งานได้เมื่อขโมย",
  "springcleaning22_rubick_astral_spirit": "นำสกิลเคลื่อนที่แยกของ Astral Spirit ออกเมื่อขโมย Rubick สามารถใช้ช่องสกิลได้ทั้ง 2 ช่องเมื่อขโมยสกิลนี้",
  "springcleaning22_rubick_reverse_time_walk": "Reverse Time Walk ต่อจากนี้สลับกับ Time Walk ในช่องเดิมหาก Rubick มี Aghanim's Shard โดย Rubick สามารถใช้ช่องสกิลได้ทั้ง 2 ช่องเมื่อขโมยสกิลนี้",
  "springcleaning22_rubick_jaunt": "Ethereal Jaunt ต่อจากนี้สลับกับ Illusory Orb ในช่องเดิม Rubick สามารถใช้ช่องสกิลได้ทั้ง 2 ช่องเมื่อขโมยสกิลนี้",
  "springcleaning22_rubick_eject": "Eject ต่อจากนี้สลับกับ Dismember ในช่องเดิมหาก Rubick มี Aghanim's Shard โดย Rubick สามารถใช้ช่องสกิลได้ทั้ง 2 ช่องเมื่อขโมยสกิลนี้",
  "springcleaning22_rubick_dismember": "Dismember ต่อจากนี้ปล่อยฮีโร่เพื่อนร่วมทีมออกหากขโมยสกิลอื่นมาแทนช่องดังกล่าว",
  "springcleaning22_rubick_spit_out": "Spit Out ต่อจากนี้สลับกับ Gobble Up ในช่องเดิม Rubick สามารถใช้ช่องสกิลได้ทั้ง 2 ช่องเมื่อขโมยสกิลนี้",
  "springcleaning22_rubick_decoy": "หากขโมย Decoy จะไม่ขโมย Bushwhack มาด้วยอีกต่อไป Decoy ยังคงส่งผล Bushwhack เมื่อร่าย",
  "springcleaning22_rubick_spirits": "การขโมย Spirits ของ Io ต่อจากนี้จะทำงานอย่างถูกต้องเมื่อมี Aghanim's Scepter",
  "springcleaning22_rubick_gravekeepers_cloak": "Gravekeeper's Cloak ต่อจากนี้สามารถขโมยได้เมื่ออัปเกรดโดย Aghanim's Scepter",
  "springcleaning22_rubick_shard_cursed_crown": "หาก Rubick มี Aghanim's Shard อยู่ Cursed Crown ก็จะสร้าง Bramble Maze ด้วย",
  "springcleaning22_rubick_shard_venomous_gale": "หาก Rubick มี Aghanim's Shard อยู่ Venomous Gale ก็จะสร้าง Plague Ward ด้วย",
  "springcleaning22_rubick_shard_sprout": "หาก Rubick มี Aghanim's Shard อยู่ Sprout ก็จะสร้าง Treant ด้วย",
  "springcleaning22_rubick_shard_shackles": "หาก Rubick มี Aghanim's Shard อยู่ Shackles ก็จะสร้าง Serpent Ward ด้วย",
  "springcleaning22_rubick_shard_cold_embrace": "หาก Rubick มี Aghanim's Shard อยู่ Cold Embrace ก็จะปล่อย Splinter Blast ด้วย",
  "springcleaning22_rubick_shard_earthshock": "หาก Rubick มี Aghanim's Scepter อยู่ Earthshock ก็จะใช้ Enrage ด้วย",
  "springcleaning22_rubick_shard_shadow_step": "หาก Rubick มี Aghanim's Scepter อยู่ Shadow Step ก็จะใช้ Spectral Dagger ด้วย",
  "springcleaning22_rubick_shard_terror_wave": "หาก Rubick มี Aghanim's Scepter อยู่ Terror Wave ก็จะใช้ Metamorphosis ด้วย",
  "springcleaning22_rubick_shard_homing_missile": "หาก Rubick มี Aghanim's Shard อยู่ Homing Missile ก็จะมี Rocket Barrage ด้วย",
  "springcleaning22_rubick_shard_slithereen_crush": "หาก Rubick มี Aghanim's Shard อยู่ Slithereen Crush ก็จะใช้ Corrosive Haze ด้วย",
  "springcleaning22_rubick_scepter_flak_cannon": "หาก Rubick มี Aghanim's Scepter อยู่ Flak Cannon ก็จะมี Side Gunner ติดตัวด้วย",
  "springcleaning22_rubick_scepter_time_walk": "หาก Rubick มี Aghanim's Scepter อยู่ Time Walk ก็จะใช้ Time Lock ด้วย",
  "springcleaning22_rubick_scepter_shiruken_toss": "หาก Rubick มี Aghanim's Scepter อยู่ Shuriken Toss ก็จะใช้ Jinada ด้วย",
  "springcleaning22_rubick_scepter_sacred_arrow": "หาก Rubick มี Aghanim's Scepter อยู่ Sacred Arrow ก็จะใช้ Starstorm ด้วย",
  "springcleaning22_ui_quickcast_vector_targeting": "การคลิกและลากกำหนดทิศทางสำหรับการร่ายทันทีเมื่อกดปุ่มลงถูกปรับเปลี่ยนเพื่อให้เริ่มลากทิศทางเมื่อกดปุ่มลงและยืนยันเมื่อยกปุ่มขึ้น ซึ่งจะทำงานเหมือนกับการร่ายทันทีเมื่อยกปุ่มขึ้น",
  "springcleaning22_ui_ward_bounty": "เหตุการณ์การต่อสู้สำหรับการทำลาย Observer Ward ต่อจากนี้แสดงชื่อผู้ได้รับค่าหัวหากคนได้แตกต่างจากคนทำลาย",
  "springcleaning22_ui_spectator_hud_player_view": "HUD สำหรับผู้ชมต่อจากนี้แสดงผู้เล่นที่กำลังรับชมอยู่อย่างถูกต้อง",
  "springcleaning22_ui_post_game_scepter_shard": "ต่อจากนี้ข้อมูลของ Aghanims Scepter และ Shard จะแสดงเอฟเฟกต์การอัปเกรดบนกระดานคะแนนหลังจบเกม",
  "springcleaning22_ui_post_game_backpack_neutral": "ต่อจากนี้ไอเท็มในกระเป๋าและไอเท็มครีปป่าจะแสดงในรายละเอียดฮีโร่หลังจบเกม",
  "springcleaning22_ui_spell_lifesteal_tooltip": "ค่าสกิลดูดพลังชีวิตสำหรับฮีโร่และครีปต่อจากนี้แสดงแยกกันหากกดปุ่ม ALT ค้างไว้",
  "springcleaning22_ui_skeleton_warrior_rally": "ออรา Rally ของ Skeleton Warrior ต่อจากนี้นับค่าโดยใช้จำนวนตัวนับสำหรับบัฟแทนไอคอนบัฟแยกกันหลายอัน",
  "springcleaning22_ui_neutral_item_teleport": "แก้ไขกรณีสลับไอเท็มครีปป่าและเทเลพอร์ตไอเท็มติดต่อกันรวดเร็วเกินไปจะทำให้เทเลพอร์ตผิดชิ้น",
  "springcleaning22_ui_spectator_arcana": "UI Arcana ใน HUD ไม่แสดงในแมตช์ลีกเมื่อเข้าชมอีกต่อไป",
  "springcleaning22_ui_ready_check_enter": "ต่อจากนี้คุณสามารถกดปุ่ม ENTER เพื่อยืนยันการตรวจสอบความพร้อม",
  "springcleaning22_ui_alt_item_combine": "ต่อจากนี้ไอเท็มในเมนูซื้อเร่งด่วนสามารถแสดงไอเท็มเต็มหลังผสมได้เมื่อกด ALT ค้างไว้",
  "springcleaning22_ui_alt_items_ready": "เมื่อกด Control ค้างไว้ขณะ ALT และคลิกบนไอเท็มต่อไปนี้จะแจ้งทีมของคุณว่าไอเท็มพร้อมใช้งาน โดยจะไม่เสนอให้รวมตัวกัน: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight และ Smoke of Deceit",
  "springcleaning22_ui_sentry_pregame": "เพิ่มจำนวนการครอบครอง Sentry Ward ที่แสดงในช่วงวางกลยุทธ์จาก 2 เป็น 3 ชิ้น โดยปกติแล้วเมื่อเริ่มเกมจะสามารถซื้อ Sentry Ward ได้สูงสุด 3 ชิ้น",
  "springcleaning22_ui_guide_pregame": "หลังจากเลือกฮีโร่ ส่วนแนะนำไอเท็มต่อจากนี้แสดงส่วนแรกของคู่มือหากคู่มือไม่มีส่วนที่ชื่อว่า \"ไอเท็มเริ่มต้น\"",
  "springcleaning22_ui_ward_planter": "การเลือก Ward ต่อจากนี้แสดงให้ผู้เล่นฝ่ายเดียวกัน ผู้ชม และโค้ชฝ่ายเดียวกันเห็นชื่อผู้ปัก",
  "springcleaning22_ui_courier_home_button": "ปุ่ม \"ร้านค้าที่ฐาน\" ของ Courier ต่อจากนี้ยังส่งคืนไอเท็มใดก็ตามที่ Courier ถืออยู่กลับเข้าคลังเก็บของเมื่อถึงฐาน",
  "springcleaning22_ui_combat_log_key": "ต่อจากนี้สามารถตั้งปุ่มเพื่อเปิดหน้าต่างข้อมูลจากการต่อสู้ได้ในการตั้งค่า",
  "springcleaning22_ui_combat_log_right_align": "ข้อมูลจากการต่อสู้ต่อจากนี้จะอยู่ฝั่งขวาและไม่ทับกับส่วนควบคุมทดลองฮีโร่อีกต่อไป",
  "springcleaning22_ui_combat_log_hud_flip": "ข้อมูลจากการต่อสู้ต่อจากนี้คำนึงถึงการสลับฝั่ง HUD (แผนที่ย่ออยู่ฝั่งขวา) และจะย้ายไปฝั่งซ้ายหากเปิดใช้งานตัวเลือกดังกล่าว",
  "springcleaning22_ui_guide_apos": "แก้ไขความเห็นสำหรับไอเท็ม/สกิลในคู่มือที่เปลี่ยนเครื่องหมายอะพอสทรอฟีเป็น \"&apos;\" และสัญลักษณ์ HTML อื่น ๆ เมื่อบันทึก คู่มือที่เคยบันทึกไว้ขณะมีปัญหานี้ยังคงต้องอัปเดตใหม่โดยเจ้าของเอง",
  "springcleaning22_ui_vs_screen_widescreen": "ปรับการแสดงฮีโร่บนหน้าจอปะทะขนาด 21:9 หรือจอภาพที่มีขนาดกว้างกว่า",
  "springcleaning22_ui_charms": "แก้ไขข้อบกพร่องที่ UI เครื่องรางจะแสดงข้อความซ้อนกันหากมีเครื่องราง 2 ชิ้นขึ้นไป",
  "springcleaning22_ui_last_hit_trainer_spawn": "แก้ไขข้อบกพร่องในตัวช่วยฝึก Last Hit กรณีหากคลิกเริ่มก่อนฮีโร่ของคุณเกิดจะทำให้ครีปไม่เกิด",
  "springcleaning22_ui_intro_scenes": "ฉากเปิดตัว (เช่น การเปิดตัวฮีโร่หรือ Arcana/รูปลักษณ์) ต่อจากนี้จะไม่แสดงสำหรับผู้เล่นที่ยังไม่ได้ผ่านขั้นตอนประสบการณ์ผู้เล่นใหม่ในตอนแรก",
  "springcleaning22_cosmetics_illusion_skins": "แก้ไขข้อบกพร่องที่ร่างเงามีโอกาสไม่แสดงพื้นผิวโมเดลเครื่องแต่งกายตามร่างหลักอย่างถูกต้อง",
  "springcleaning22_cosmetics_cloth_stretch": "แก้ไขข้อบกพร่องที่เสื้อผ้าบนโมเดลบางตัวอาจยืดข้ามหน้าจออย่างไม่ถูกต้อง",
  "springcleaning22_cosmetics_underlord_immortal": "Immortal ของ Underlord \"Emerald Subjugation\" ต่อจากนี้มีเอฟเฟกต์สกิลแบบใหม่ซึ่งจะเปลี่ยนสกิลอัลติเมท",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Immortal ของ Shadow Demon \"Mantle of Grim Facade\" เอฟเฟกต์คลื่น Shadow Poison ต่อจากนี้จะมีทิศทางถูกต้อง",
  "springcleaning22_cosmetics_wraith_king_immortal": "Immortal ของ Wraith King \"Blistering Shade\" ต่อจากนี้มีระดับความสำคัญสูงกว่า Arcana เมื่อร่าย \"Wraithfire Blast\"",
  "springcleaning22_cosmetics_earthshaker_immortal": "Immortal ของ Earthshaker \"Bracers of the Cavern Luminar\" ได้รับการแก้ไขเอฟเฟกต์แสง",
  "springcleaning22_cosmetics_warlock_immortal": "Immortal ของ Warlock \"Umbral Glyph\" ได้รับการแก้ไขเอฟเฟกต์สกิลที่ไม่ทำงานสำหรับ Shadow Word (บัฟและดีบัฟ)",
  "springcleaning22_cosmetics_viper_immortal": "Immortal ของ Viper \"Malefic Drake's Strike\" ได้รับการแก้ไขอนุภาคพื้นที่ที่ไม่ทำงานสำหรับ Nethertoxin",
  "springcleaning22_cosmetics_abaddon_vessel": "เอฟเฟกต์ Aphotic Shield \"Blade of the Demonic Vessel\" ของ Abaddon ถูกนำกลับคืนมาแล้ว",
  "springcleaning22_cosmetics_tidehunder_belt": "อนุภาคที่ไม่ถูกต้องสำหรับ \"Horror From the Deep Belt\" ของ Tidehunter ถูกนำออกจากช่องเข็มขัดเพื่อให้อยู่บนส่วนแขนอย่างถูกต้อง",
  "springcleaning22_cosmetics_faceless_incursion": "เอฟเฟกต์แสงอาวุธ \"Claszureme Incursion\" ของ Faceless Void ได้รับการแก้ไขแล้ว",
  "springcleaning22_cosmetics_drow_arcana_aura": "ออรา Arcana \"Marskmanship\" ของ Drow Ranger ต่อจากนี้มีเอฟเฟกต์แบบใหม่สำหรับทั้ง 2 รูปแบบ",
  "springcleaning22_cosmetics_rubick_dilemma": "เอฟเฟกต์แสง \"Torch of Fantoccini's Dilemma\" ของ Rubick ถูกนำกลับคืนมาแล้ว",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Arcana สำหรับ Techies แอนิเมชันวิ่งเจ็บปวดต่อจากนี้จะเล่นด้วยความเร็วที่ถูกต้อง",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Arcana สำหรับ Techies ได้เพิ่มการรองรับสีอัญมณีใน Sticky Bomb และ Reactive Tazer",
  "springcleaning22_cosmetics_techies_icons": "เพิ่มไอคอนไอเท็มที่หายไปสำหรับชุด Techies \"Powdersled Rookery\", \"Sapper's Guile\", \"Bombtrails and Boomsticks\" และ \"March of the Powderkeg Patrol\"",
  "springcleaning22_cosmetics_techies_wagon_spoon": "แก้ไขแอนิเมชันสำหรับ Spoon ในแก๊ง Techies บนหน้าแสดงตัวอย่างการเทเลพอร์ตของชุดเช็ต Pachyderm Powderwagon",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Arcana สำหรับ Rubick ต่อจากนี้จะมีเอฟเฟกต์พิเศษต่อ Sticky Bomb ของ Techies แทน Remote Mine",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "แก้ไขแอนิเมชันถูกหยุดของ Snapfire ทำให้ Snapfire ไม่ค้างอยู่ในลำดับแอนิเมชันที่ไม่ถูกต้องอีกต่อไป",
  "springcleaning22_cosmetics_legion_commander_conqueror": "ต่อจากนี้ชุดรวม \"Radiant Conqueror\" และไอเท็มของ Legion Commander สามารถซื้อขายบนตลาดและแลกเปลี่ยนได้แล้ว",
  "springcleaning22_cosmetics_legion_commander_wind": "เพิ่มเอฟเฟกต์ลมให้แก่แบนเนอร์ \"Legacy of the Fallen Legion\" และ \"Radiant Conqueror\" ของ Legion commander โดยมีหรือไม่มีการสวมใส่อาวุธให้ Arcana",
  "springcleaning22_perf_panorama_atlas": "อัปเดตให้เอนจินอินเตอร์เฟซผู้ใช้ Panorama เพื่อให้ใช้การทำแผนที่พื้นผิวในการโต้ตอบกับ GPU ได้อย่างมีประสิทธิภาพมากยิ่งขึ้น การวัดผลของเราแสดงว่า วิธีนี้ส่งผลให้การทำงานของ GPU ที่จำเป็นต่อ HUD มีประสิทธิภาพเพิ่มขึ้น 25-30% และสูงกว่านั้นมากในหน้ากระดานรวมบางส่วนที่มีความซับซ้อนเป็นพิเศษ นอกจากนั้น การเปลี่ยนแปลงนี้ยังช่วยเพิ่มประสิทธิภาพของ CPU ให้กับ Vulkan และควรใช้ได้ผลดีเป็นพิเศษกับคอมพิวเตอร์ Apple ที่มีหน่วยประมวลผล M1 อีกด้วย",
  "springcleaning22_perf_sand_king_particles": "เพิ่มประสิทธิภาพของเอฟเฟกต์อนุภาค \"Sand Storm\" เพื่อให้มีประสิทธิภาพสูงขึ้น",
  "springcleaning22_perf_panorama_clears": "อัปเดตให้เอนจินอินเตอร์เฟซผู้ใช้ Panorama เพื่อไม่ให้เกิดการลบเป้าหมายเรนเดอร์บางส่วนที่ไม่จำเป็น ซึ่งช่วยหลีกเลี่ยงการทำงานของ GPU",
  "springcleaning22_perf_scenesystem_threading": "แก้ไขข้อบกพร่องที่บางครั้งเราใช้เธรดน้อยกว่าที่ตั้งใจไว้สำหรับงานมัลติเธรด การแก้ไขนี้มีประโยชน์มากเป็นพิเศษกับเครื่องที่มีหน่วยประมวลผลหลักสูงสุด 4 คอร์",
  "springcleaning22_perf_thread_affinity": "แก้ไขข้อบกพร่องที่การกำหนดความสัมพันธ์ระหว่างเธรดกับ CPU ไม่ถูกต้องอาจทำให้บางเครื่องหยุดทำงาน",
  "springcleaning22_perf_power_savings": "เพิ่มคำเตือนในหน้าต่างการตั้งค่าวิดีโอ เพื่อระบุว่าคอมพิวเตอร์ทำงานในโหมดประหยัดพลังงานซึ่งอาจทำให้มีประสิทธิภาพต่ำลง",
  "springcleaning22_perf_shop_tooltips": "เพิ่มประสิทธิภาพให้คำอธิบายขณะเปิดหาร้านค้าไอเท็ม",
  "springcleaning22_custom_games_overview_sort": "แท็บภาพรวมอาร์เคดต่อจากนี้จะยอมให้จัดเรียงตามผู้เล่นที่เล่นอยู่ในขณะนี้ เพิ่มขึ้นจากจำนวนล็อบบี้เปิด",
  "springcleaning22_custom_games_update": "แก้ไขปัญหาที่เกมอาร์เคด Dota แบบกำหนดเองบางครั้งไม่แสดงว่าต้องการอัปเดต จนกว่าจะติดตั้งซ้ำอีกครั้ง หรือรีสตาร์ท Steam อีกครั้ง",
  "springcleaning22_custom_games_lobby_version": "รายชื่อล็อบบี้อาร์เคด Dota ต่อจากนี้จะไม่แสดงล็อบบี้ที่เวอร์ชันไม่ตรงกับเกมแบบกำหนดเองที่ติดตั้งอยู่หรือไม่สามารถเข้าร่วมได้",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold ต่อจากนี้สามารถกรองโกลด์ที่ได้รับจากรูน Bounty",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "แทนที่ตรามณีสำหรับ Dazzle - \"ดีบัฟ JuJu แก่ศัตรูสี่ตัว\" ด้วย \"ความเสียหายและการรักษาจาก Bad Juju\"",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "แทนที่ตรามณีสำหรับ Techies - \"สังหารด้วย Remote Mine\" ด้วย \"Sticky Bomb ติดไปกับฮีโร่\"",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "แทนที่ตรามณีสำหรับ Techies - \"สตันด้วย Stasis Trap\" ด้วย \"Reactive Tazer ปลดอาวุธฮีโร่หลายตัว\"",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "แทนที่ตรามณีสำหรับ Tinker - \"ความเสียหายที่สร้างด้วย March Of The Machines\" ด้วย \"ความเสียหายที่ดูดซับด้วย Defense Matrix\"",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "แทนที่ตรามณีสำหรับ Underlord - \"สังหารหลังใช้ Dark Rift\" ด้วย \"เพื่อนร่วมทีมสังหารหลังใช้ Fiend's Gate\"",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "แทนที่ตรามณีสำหรับ Underlord - \"ช่วยชีวิตฮีโร่ด้วย Dark Rift\" ด้วย \"ความเสียหายที่สร้างเพิ่มเติมจาก Atrophy Aura\"",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "แก้ไขตรามณีสำหรับ Omniknight - \"ความเสียหายที่เพื่อนร่วมทีมสร้างขณะใช้ Heavely Grace\"",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "แก้ไขตรามณีสำหรับ Primal Beast - \"Onslaught พุ่งชนฮีโร่หลายตัว\"",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "แทนที่การท้าทายฮีโร่สำหรับ Meepo - \"ความเสียหายเวทมนตร์ที่สร้างต่อฮีโร่\" ด้วย \"ความเสียหายโดยตรงที่สร้างต่อฮีโร่\"",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "แทนที่การท้าทายฮีโร่สำหรับ Naga Siren - \"ฮีโร่ได้รับการรักษาขณะใช้ Song\" ด้วย \"สร้างความเสียหาย Mana Burn ต่อฮีโร่\"",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "แทนที่การท้าทายฮีโร่สำหรับ Tinker - \"ความเสียหายที่สร้างด้วย March Of The Machines\" ด้วย \"ความเสียหายที่ถูกซับไว้ด้วยสกิล Defense Matrix\"",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "แทนที่การท้าทายฮีโร่สำหรับ Techies - \"สังหารด้วย Remote Mine\" ด้วย \"Sticky Bombs ที่เกาะติด\"",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "แทนที่การท้าทายฮีโร่สำหรับ Underlord - \"ฮีโร่หลายยูนิตเทเลพอร์ตด้วย Dark Rift\" ด้วย \"เพื่อนร่วมทีมสังหารหลังใช้ Fiend's Gate\"",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "อัปเดตการท้าทายฮีโร่สำหรับ Grimstroke - \"ความเสียหายที่สร้างต่อศัตรูที่ได้รับผลของ Soulbind\" ต่อจากนี้รวมความเสียหายจากเพื่อนร่วมทีมด้วย",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "อัปเดตการท้าทายฮีโร่สำหรับ Mirana - \"ความเสียหายที่สร้างขณะใช้ Leap\" ต่อจากนี้รวมความเสียหายทุกประเภท ไม่ใช่แค่ประเภทกายภาพ",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "แก้ไขการท้าทายฮีโร่สำหรับ Bane - \"คอมโบ Blink/Force Staff และ Fiend's Grip\"",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "แก้ไขการท้าทายฮีโร่สำหรับ Dragon Knight - \"สังหารขณะใช้ร่างมังกร\"",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "แก้ไขการท้าทายฮีโร่สำหรับ Drow Ranger - \"ใบ้ศัตรูตั้งแต่ 2 ยูนิตขึ้นไปด้วย Gust\"",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "แก้ไขการท้าทายฮีโร่สำหรับ Crystal Maiden - \"สังหารครีปด้วย Frostbite\"",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "แก้ไขการท้าทายฮีโร่สำหรับ Dark Seer - \"ความเสียหายที่สร้างขณะใช้ Surge\"",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "แก้ไขการท้าทายฮีโร่สำหรับ Lifestealer - \"ความเสียหายที่สร้างขณะใช้ Rage\"",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "แก้ไขการท้าทายฮีโร่สำหรับ Lone Druid - \"ความเสียหายที่สร้างขณะใช้ True Form\"",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "แก้ไขการท้าทายฮีโร่สำหรับ Mars - \"ความเสียหายที่สร้างต่อฮีโร่ศัตรู\"",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "แก้ไขการท้าทายฮีโร่สำหรับ Mars - \"สังหารยูนิตศัตรูด้วย Cleave\"",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "แก้ไขการท้าทายฮีโร่สำหรับ Omniknight - \"ความเสียหายที่สร้างขณะใช้ Heavely Grace\"",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "แก้ไขการท้าทายฮีโร่สำหรับ Omniknight - \"ระยะเวลาที่ใช้ Heavenly Grace กับเพื่อนร่วมทีม\"",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "แก้ไขการท้าทายฮีโร่สำหรับ Rubick - \"สตัน Telekenisis โดนฮีโร่หลายตัว\"",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "แก้ไขการท้าทายฮีโร่สำหรับ Tinker - \"ความเสียหายที่สร้างต่อฮีโร่จากเลเซอร์ที่อัปเกรดด้วย Aghanim's Scepter\"",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "แก้ไขการท้าทายฮีโร่สำหรับ Tusk - \"คอมโบ Walrus Punch + Kick\"",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "ลบการท้าทายฮีโร่สำหรับ Venomancer - \"ความเสียหายที่สร้างให้แก่ฮีโร่ที่โดน Silver Edge\"",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "ลบการท้าทายฮีโร่สำหรับ Tinker - \"สังหารครีปด้วย March of the Machines\"",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "เพิ่มการท้าทายฮีโร่สำหรับ Underlord - \"ความเสียหายที่สร้างต่อฮีโร่ด้วย Firestorm\"",
  "springcleaning22_workshop_modeldoc": "เครื่องมือเวิร์กชอปบน Dota สำหรับไอเท็มและเกมแบบกำหนดเองได้รับการอัปเกรดให้ใช้ \"ModelDoc\" ซึ่งเป็นตัวแก้ไขโมเดลตัวใหม่ ผู้มีส่วนร่วมในเวิร์กชอปควรโอนย้ายโมเดลต่าง ๆ จากเครื่องมือเก่า ซึ่งจะถูกลบออกไปในการอัปเดตในอนาคต"
}