// 3526.js

{
  "language": "czech",
  "springcleaning22_desc": "Aktualizace Spring Cleaning 2022 je tu a, jak už je zvykem, kromě záplat desítek chyb přináší také řádku vylepšení usnadňujících život všem válečníkům. Prohlédněte si některé z větších změn – například nové popisy pro vylepšení pomocí předmětů Aghanim's Scepter a Shard, zjednodušené ovládací prvky umlčování či propracovanější zkoušení hrdinů – a poté se začtěte do kompletního výčtu oprav a úprav.",
  "springcleaning22_aghs_tooltips": "Nové popisy pro Aghanim’s Scepter a Shard",
  "springcleaning22_aghs_tooltips_desc": "Myšlenkové pochody (a nekonečné monology) mocného Aghanima jsou sice stále mimo chápání běžných smrtelníků, nicméně díky této aktualizaci byly alespoň odhaleny konkrétní dopady vylepšení od jeho předmětů Scepter a Shard. Popisy tedy nově zahrnují veškeré známé podrobnosti včetně přesných změn hodnot a stejné informace mají také speciální sekci u samotných vylepšených schopností. Texty některých vylepšení byly navíc přepracovány, aby je snáze pochopily i naše, v očích Aghanima, podřadné mozky.",
  "springcleaning22_muting_ui": "Zjednodušené umlčování hráčů",
  "springcleaning22_muting_ui_desc": "Jistě to sami znáte – hráči Doty jsou do hry natolik zapálení, že v žáru bitvy mohou někdy převládnout ne zrovna přátelské emoce. A když se takové chování přelije až do kategorie rušivého, je důležité mít po ruce efektivní způsob, jak dané hráče umlčet a nahlásit, aby už dál nekazili probíhající zápas a jejich počínání bylo později podrobeno přezkoumání. Z toho důvodu lze ode dneška jedním kliknutím umlčet hlasovou i textovou komunikaci hráče a zároveň ho nahlásit. Nahlášení není třeba, ale bez komunikace vybraného hráče se rádi obejdete? Klikněte na něj pravým tlačítkem myši pro více možností. Nebo, chcete-li si ušetřit práci, využijte nového tlačítka pro umlčení celého týmu.\\n\\nSpolečně s touto změnou jsme se také pustili do přehodnocování systému pro nakládání s nahlášeními za zneužití komunikace, protože ač je naším cílem co nejvíce usnadnit umlčování neslušných hráčů, nechceme přijít o důkazy, z nichž pro některé obzvláště nevychované hráče vyvodíme závažnější důsledky.",
  "springcleaning22_demo_hero": "Propracovanější zkoušení hrdinů",
  "springcleaning22_demo_hero_desc": "Chcete si otestovat nové strategie zahlédnuté na internetu nebo přijít se svými vlastními? Nebo máte jenom sadistickou náladu a potřebujete zjistit, kolik klonů Axeho je možné zmasakrovat jedním švihnutím schopnosti Tidebringer? Ať už jsou Vaše motivy jakékoli, dnes máte šťastný den, jelikož jsme aktualizovali a rozšířili režim zkoušení hrdinů:",
  "springcleaning22_demo_hero_map": "Severní část mapy byla rozšířena a nově nabízí větší plac pro zkoušení všeho možného",
  "springcleaning22_demo_hero_hero_spawn": "Byly přidány ovládací prvky pro jednoduché přidávání spojeneckých hrdinů",
  "springcleaning22_demo_hero_hero_reset": "Byla přidána možnost resetovat hrdinu zpět na 1. úroveň",
  "springcleaning22_demo_hero_hero_remove": "Byla přidána možnost odstranit hrdinu, až s ním budete hotovi",
  "springcleaning22_demo_hero_hero_select": "Každý nově přidaný hrdina je přidán také do aktuálního výběru",
  "springcleaning22_demo_hero_levelling": "Tlačítka pro zvýšení úrovně, přidání Scepteru/Shardu a přepnutí nezranitelnosti se nově vztahují na všechny aktuálně vybrané hrdiny",
  "springcleaning22_demo_creep_toggle": "Vypnutím běžných creepů jsou nově odstraněni i ti už aktivní",
  "springcleaning22_demo_creep_spawn": "Byla přidána možnost vyvolat z každé strany pouze jednu vlnu creepů",
  "springcleaning22_demo_hero_runes": "Byla přidána tlačítka pro přidání šesti run vylepšení",
  "springcleaning22_shop_search": "Aktualizované vyhledávání v obchodu",
  "springcleaning22_shop_search_desc": "Utrácení zlaťáků by mělo být snadné a co nejvíc přínosné. V zájmu zlepšení nakupování a prohrabování se pomyslnými regály jsme proto rozšířili funkčnost vyhledávání v obchodě o podporu dalších klíčových slov, s jejichž pomocí lze vypíchnout pouze určité statistiky. Jednoduše vyhledejte „brnění“, „síla“ nebo třeba „dosah“ a vyberte si z odpovídajících předmětů. Příprava na bitvu je nově hračka... akorát ty zlaťáky se pořád shání stejně.",
  "springcleaning22_item_tooltips": "Rozšířené popisy předmětů",
  "springcleaning22_item_tooltips_desc": "Nevíte z hlavy, kolika bodům many se rovná změna inteligence zajištěná tím kterým předmětem? Případně kolik bodů brnění Vám připíše obratnost? Zahoďte kalkulačku a při otevřeném popisu předmětu podržte klávesu Alt, která nově rozepíše ovlivněné hodnoty.",
  "springcleaning22_colored_ability_damage": "Barvy poškození",
  "springcleaning22_colored_ability_damage_desc": "Abyste v bitvě učinili správné rozhodnutí, musíte vědět, proti čemu stojíte. Pro snazší pochopení potenciálních nebezpečí je tak ode dneška poškození od schopností a předmětů rozlišené barevně podle toho, zdali se jedná o fyzické, magické nebo neredukované poškození.",
  "springcleaning22_pluralized_strings": "Lepší podpora pro množná čísla",
  "springcleaning22_pluralized_strings_desc": "Protože každý jazyk má trochu jiná pravidla týkající se množného čísla, zapracovali jsme do hry nový podpůrný systém a v souvislosti s ním aktualizovali přes 400 řádek textu.",
  "springcleaning22_permanent_debuffs": "Permanentní buffy",
  "springcleaning22_permanent_debuffs_desc": "Plánování je o to těžší, když nemáte přehled o účinnosti svých akcí. I z toho důvodu jsme do souhrnu dohraného zápasu přidali informace o zabití pomocí Necrophovy schopnosti Reaper’s Scythe a Axeho schopnosti Culling Blade.",
  "springcleaning22_post_game_sortable": "Souhrn zápasu s možností třídění",
  "springcleaning22_post_game_sortable_desc": "Chcete si svá vítězství rozebrat až na dřeň? Využijte novou tabulku skóre, kterou lze v rámci pozápasové analýzy všemožně třídit.",
  "springcleaning22_gameplay_tp_boots": "Pokud je předmět Boots of Travel použit na místo poblíž věže, je nově méně pravděpodobné, že zaměří creepa",
  "springcleaning22_gameplay_sellback": "Hráči mohou nově prodat předmět za plnou cenu v rámci prvních 30 sekund zápasu (dříve platila po celý zápas klasická prodleva 10 sekund)",
  "springcleaning22_gameplay_lifestealer_consume": "Lifestealerova schopnost Consume nově používá stejnou klávesu, ať už byl jejím prostřednictvím infikován jakýkoli typ jednotky",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Neutrální creep Ogre Bruiser nově disponuje zvukovými efekty pro napřahování a následné omráčení",
  "springcleaning22_gameplay_neutral_aura_radius": "Všechny aury neutrálních creepů nově po najetí myší správně zobrazují svůj rozsah",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Předměty Wraith Band, Null Talisman a Bracer nově aktualizují své popisky, když ve 25. minutě dojde ke zdvojnásobení jejich bonusů",
  "springcleaning22_gameplay_heal_overhead": "Byla opravena řada případů, kdy čísla léčení nebrala v potaz navýšení léčení",
  "springcleaning22_gameplay_fountain_invuln": "Hráči s aktivním buffem Fountain Invulnerability (tedy nezranitelností ve fontáně) již automaticky nezaútočí na nepřítele, který se ocitne v dosahu, čímž mohlo dříve dojít k nechtěné ztrátě této nezranitelnosti",
  "springcleaning22_gameplay_blink_range": "Ukazatel dosahu schopností nově bere pro Blink (a různé varianty) v potaz buffy navyšující dosah",
  "springcleaning22_gameplay_desolator_tooltip": "Byl upřesněn popis pasivní schopnosti Soul Stealer předmětu Desolator. Pro připomenutí, bonus k poškození předmětu se navýší s každým nepřátelským hrdinou, který zemře pod vlivem druhé pasivní schopnosti Corruption",
  "springcleaning22_gameplay_ardm_stash": "Byla opravena chyba v módu Deathmatch – všichni náhodně, kvůli níž mohlo dojít k vypaření předmětu vraceného kurýrem do skrýše mrtvého hráče",
  "springcleaning22_gameplay_neutral_items_lock": "Již nelze zakázat kombinování neutrálních předmětů, v důsledku čehož je kurýři nemohli dříve doručit",
  "springcleaning22_gameplay_illusion_modifiers": "Byla opravena chyba, kvůli které měly duplikované modifikátory na iluzích jiná trvání, takže šlo odhalit skutečného hrdinu",
  "springcleaning22_gameplay_turbo_gold_scaling": "Byla opravena chyba v módech Turbo a Výběr pro nováčky, kvůli které nedocházelo ke správnému škálování některých zdrojů zlaťáků",
  "springcleaning22_gameplay_turbo_courier": "Byla opravena chyba v módu Turbo, kvůli níž přestal fungovat kurýr hráče, který se odpojil během výběru hrdinů nebo strategické porady",
  "springcleaning22_gameplay_zero_tooltips": "Byly opraveny některé popisy ovlivňované talenty, které vykazovaly nulové hodnoty",
  "springcleaning22_gameplay_euls_invulnerable": "Po použití předmětu Eul’s Scepter na klon imunní vůči magii je klon nově správně ovlivněn a předmět pouze nespadne do cooldownu",
  "springcleaning22_gameplay_kobold_aura": "Schopnost Prospecting Aura (neutrální creep Kobold) již nepůsobí na hrdinské creepy (např. Lone Druidova Spirit Beara), čímž byla opravena chyba se zdvojením efektu schopnosti",
  "springcleaning22_gameplay_aghs_scepter_clones": "Klony a kopie schopnosti Tempest Double jsou nově správně ovlivňovány bonusy od předmětu Aghanim’s Scepter získaného darem od Alchemisty",
  "springcleaning22_gameplay_chen_hand_of_god": "Chenova schopnost Hand of God nově správně aplikuje průběžné léčení i na jím ovládané creepy (dříve dostali pouze počáteční léčení)",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Penalizace poškození vlivem vzdálenosti kopie schopnosti Tempest Double (Arc Warden) nově bere v potaz Arc Wardenovo znovuzrození",
  "springcleaning22_gameplay_arc_warden_basher": "Byl přidán popis upřesňující, že klony a kopie schopnosti Tempest Double nemohou využít pasivní schopnosti Bash předmětů Skull Basher a Abyssal Blade",
  "springcleaning22_gameplay_arc_warden_blink": "Předmět Blink Dagger již nezačíná na kopii schopnosti Tempest Double (Arc Warden) s cooldownem",
  "springcleaning22_gameplay_arc_warden_wards": "Kopii schopnosti Tempest Double (Arc Warden) již nelze darovat sdílené Wardy",
  "springcleaning22_gameplay_pa_scepter_double": "Když Phantom Assassin vylepšená předmětem Aghanim’s Scepter zabije kopii schopnosti Tempest Double, už nejsou obnoveny její schopnosti",
  "springcleaning22_gameplay_naga_siren_riptide": "Talent „-1 zásah pro spuštění Rip Tide“ pro Naga Siren byl opraven, aby nesnižoval počet vyžadovaných zásahů o 2",
  "springcleaning22_gameplay_legion_commander_duel": "Bonus k poškození pro vítěze duelu stejnojmenné schopnosti (Legion Commander) je nově připsán i skrze nezranitelnost",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Tuskova schopnost Walrus Kick má nově správný cooldown dlouhý 12 sekund",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Terrorbladeova schopnost Metamorphosis má nově správné trvání (35/40/45/50 sekund)",
  "springcleaning22_gameplay_monkey_king_arena": "Z arény schopnosti Arena of Blood (Mars) už nelze uniknout pomocí schopnosti Tree Dance (Monkey King)",
  "springcleaning22_gameplay_naga_siren_ability_draft": "V módu Výběr schopností jsou nově efekty schopnosti Rip Tide přehrány na odpovídajícím hrdinovi, nikoli pokaždé na Naga Siren (která má schopnost běžně)",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "I pokud je povolena možnost „Vyvolávání přeruší pouze určité příkazy“, může Riki nově při vyvolávání schopnosti Tricks of the Trade použít schopnost Smoke Screen, aniž by vyvolávání přerušil",
  "springcleaning22_gameplay_marci_dispose_lotus": "Byla opravena interakce schopnosti Dispose (Marci) s předměty Black King Bar a Lotus Orb",
  "springcleaning22_gameplay_sniper_grenade_icon": "Sniperova schopnost Concussive Grenade nově přidá zasaženým nepřátelům nad hlavu ikonu odzbrojení",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphlingovy už permanentně nezůstane pasivní schopnost Spirit Link, když se promění v Lone Druida",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Byla přidána ikona vyvolávání pro Underlordovu schopnost Fiend’s Gate",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Byl přidán popis pro debuff schopnosti Icefire Bomb (Ancient creep Ice Shaman)",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Bylo opraveno načasování částicových efektů schopnosti Cursed Crown (Dark Willow), aby seděly i po vylepšení předmětem Aghanim’s Shard",
  "springcleaning22_gameplay_lone_druid_midas": "Pokud Spirit Bear (Lone Druid) použije předmět Hand of Midas, hrdina, který ho ovládá, získá zkušenosti",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear (Lone Druid) a kopie schopnosti Tempest Double (Arc Warden) mohou nově získávat nabití předmětů Magic Stick, Magic Wand a Holy Locket",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Popis schopnosti Astral Step (Void Spirit) nově při držení klávesy Alt ukazuje správné hodnoty zesílení kouzel",
  "springcleaning22_gameplay_heavenly_jump_range": "Schopnost Heavenly Jump (Zeus) nově po najetí myší ukazuje svůj rozsah",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Byly opraveny popisy spojené se schopností Arcane Aura (Crystal Maiden)",
  "springcleaning22_gameplay_hex_tooltip": "Byl opraven popis schopnosti Hex (Shadow Shaman), který s talentem „Hex lámající nepřátele“ nesprávně uváděl o 1 sekundu delší trvání",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Byl opraven Abaddonův talent na 20. úrovni „-8s z cooldownu Borrowed Time“, který neaktualizoval cooldown v popisu schopnosti",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Byla opravena schopnost Presence of the Dark Lord (Shadow Fiend), aby byla správně aplikována na neutrální creepy",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Byla opravena schopnost Warp Flare (Tinker se Shardem), která fungovala na Roshana",
  "springcleaning22_gameplay_ability_draft_wukong": "Byli opraveni válečníci schopnosti Wukong’s Command (Monkey King), kteří neměli v módu Výběr schopností odpovídající schopnosti",
  "springcleaning22_rubick_illusions": "Byla opravena chyba, kvůli které neměly Rubickovy iluze animace odpovídající ukradeným kouzlům (např. Baneova schopnost Fiend's Grip vylepšená Scepterem)",
  "springcleaning22_rubick_hunter_in_the_night": "Nově lze ukrást schopnost Hunter in the Night (Night Stalker) vylepšenou Shardem",
  "springcleaning22_rubick_juxtapose": "Nově lze ukrást schopnost Juxtapose (Phantom Lancer) vylepšenou Scepterem",
  "springcleaning22_rubick_fireball": "Schopnost Fireball (Dragon Knight se Shardem) lze nově ukrást nezávisle na schopnosti Elder Dragon Form a už není poskytována automaticky",
  "springcleaning22_rubick_wolf_bite": "Schopnost Wolf Bite (Lycan se Scepterem) nově po ukradení správně funguje",
  "springcleaning22_rubick_depth_shroud": "Schopnost Depth Shroud (Slark se Shardem) nově po ukradení správně funguje",
  "springcleaning22_rubick_astral_spirit": "Po ukradení už nemá schopnost Astral Spirit (Elder Titan) oddělenou podschopnost pro přesun, takže Rubickovi se Scepterem zůstane jeden volný slot",
  "springcleaning22_rubick_reverse_time_walk": "Jakmile je použita ukradená schopnost Time Walk (Faceless Void), nahradí ji ve slotu schopnost Reverse Time Walk, takže Rubickovi se Scepterem a Shardem zůstane jeden volný slot",
  "springcleaning22_rubick_jaunt": "Jakmile je použita ukradená schopnost Illusory Orb (Puck), nahradí ji ve slotu schopnost Ethereal Jaunt, takže Rubickovi se Scepterem zůstane jeden volný slot",
  "springcleaning22_rubick_eject": "Jakmile je použita ukradená schopnost Dismember (Pudge), nahradí ji ve slotu schopnost Eject, takže Rubickovi se Scepterem a Shardem zůstane jeden volný slot",
  "springcleaning22_rubick_dismember": "Pokud je krádeží nahrazena schopnost Dismember, je automaticky vyplivnut spojenecký hrdina",
  "springcleaning22_rubick_spit_out": "Jakmile je použita ukradená schopnost Gobble Up (Snapfire), nahradí ji ve slotu schopnost Spit Out, takže Rubickovi se Scepterem zůstane jeden volný slot",
  "springcleaning22_rubick_decoy": "Ukradením schopnosti Decoy (Hoodwink) již není ukradena i schopnost Bushwhack. Schopnost Decoy však po použití stále použije také Bushwhack",
  "springcleaning22_rubick_spirits": "Byla opravena krádež schopnosti Spirits (Io) a její interakce s předmětem Aghanim’s Scepter",
  "springcleaning22_rubick_gravekeepers_cloak": "Nově lze ukrást schopnost Gravekeeper's Cloak (Visage) vylepšenou Shardem",
  "springcleaning22_rubick_shard_cursed_crown": "Pokud má Rubick předmět Aghanim's Shard, ukradená schopnost Cursed Crown (Dark Willow) nově použije také schopnost Bramble Maze",
  "springcleaning22_rubick_shard_venomous_gale": "Pokud má Rubick předmět Aghanim's Shard, ukradená schopnost Venomous Gale (Venomancer) nově vytvoří také wardy schopnosti Plague Ward",
  "springcleaning22_rubick_shard_sprout": "Pokud má Rubick předmět Aghanim's Shard, ukradená schopnost Sprout (Nature's Prophet) nově vytvoří také Greater Treanty schopnosti Nature's Call",
  "springcleaning22_rubick_shard_shackles": "Pokud má Rubick předmět Aghanim's Shard, ukradená schopnost Shackles (Shadow Shaman) nově vytvoří také wardy schopnosti Mass Serpent Ward",
  "springcleaning22_rubick_shard_cold_embrace": "Pokud má Rubick předmět Aghanim's Shard, ukradená schopnost Cold Embrace (Winter Wyvern) nově vyvolá také schopnost Splinter Blast",
  "springcleaning22_rubick_shard_earthshock": "Pokud má Rubick předmět Aghanim's Shard, ukradená schopnost Earthshock (Ursa) nově použije také schopnost Enrage",
  "springcleaning22_rubick_shard_shadow_step": "Pokud má Rubick předmět Aghanim's Shard, ukradená schopnost Shadow Step (Spectre) nově použije také schopnost Spectral Dagger",
  "springcleaning22_rubick_shard_terror_wave": "Pokud má Rubick předmět Aghanim's Shard, ukradená schopnost Terror Wave (Terroblade) nově použije také schopnost Metamorphosis",
  "springcleaning22_rubick_shard_homing_missile": "Pokud má Rubick předmět Aghanim's Shard, ukradená schopnost Homing Missile (Gyrocopter) nově disponuje také schopností Rocket Barrage",
  "springcleaning22_rubick_shard_slithereen_crush": "Pokud má Rubick předmět Aghanim's Shard, ukradená schopnost Slithereen Crush (Slardar) nově použije také schopnost Corrosive Haze",
  "springcleaning22_rubick_scepter_flak_cannon": "Pokud má Rubick předmět Aghanim's Scepter, ukradená schopnost Flak Cannon (Gyrocopter) nově poskytuje také pasivního druhého střelce",
  "springcleaning22_rubick_scepter_time_walk": "Pokud má Rubick předmět Aghanim's Scepter, ukradená schopnost Time Walk (Faceless Void) nově použije také schopnost Time Lock",
  "springcleaning22_rubick_scepter_shiruken_toss": "Pokud má Rubick předmět Aghanim's Scepter, ukradená schopnost Shuriken Toss (Bounty Hunter) nově použije také schopnost Jinada",
  "springcleaning22_rubick_scepter_sacred_arrow": "Pokud má Rubick předmět Aghanim's Scepter, ukradená schopnost Sacred Arrow (Mirana) nově disponuje také schopností Starstorm",
  "springcleaning22_ui_quickcast_vector_targeting": "Vektorové zaměřování pro rychlé seslání po stisku klávesy bylo změněno, takže nyní se šipka vektoru začne objevovat při stisknutí dané klávesy a je dokončena s puštěním klávesy. Chování je tedy nově stejné jako pro rychlé seslání po puštění klávesy",
  "springcleaning22_ui_ward_bounty": "V upozornění na zničení Observer Wardy je nově uveden hráč, který za ni získal odměnu, pokud se tedy liší od toho, kdo ji zničil",
  "springcleaning22_ui_spectator_hud_player_view": "Divácké rozhraní nově správně ukazuje hráče, kterého sledujete",
  "springcleaning22_ui_post_game_scepter_shard": "Předměty Aghanim's Scepter a Shard nově informují o svých efektech i v pozápasové tabulce skóre",
  "springcleaning22_ui_post_game_backpack_neutral": "V pozápasových detailech hrdiny jsou nově uvedeny také neutrální předměty a předměty z batohu",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Hodnoty lifestealu kouzly jsou nyní při držení klávesy Alt rozděleny pro hrdiny a creepy",
  "springcleaning22_ui_skeleton_warrior_rally": "Aura schopnosti Rally (neutrální creep Skeleton Warrior) je nyní zaznamenávána jedním navyšovaným buffem namísto více oddělených ikon",
  "springcleaning22_ui_neutral_item_teleport": "Byla opravena chyba, kvůli které bylo při rychlé výměně neutrálního předmětu a teleportování předchozího možné teleportovat nový předmět",
  "springcleaning22_ui_spectator_arcana": "Při sledování turnajových zápasů se už nezobrazují rozhraní aktivních Arcana předmětů",
  "springcleaning22_ui_ready_check_enter": "Zkoušku připravenosti lze nyní potvrdit stiskem klávesy Enter",
  "springcleaning22_ui_alt_item_combine": "Předměty v rychlém nákupu nově při držení klávesy Alt ukáží předmět, ve který se zkombinují",
  "springcleaning22_ui_alt_items_ready": "Když podržíte klávesy Ctrl + Alt a kliknete na následující předměty, nově řeknete svému týmu, že jsou připraveny, ne že by se spoluhráči měli shromáždit pro jejich použití: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight a Smoke of Deceit",
  "springcleaning22_ui_sentry_pregame": "Byl navýšen počet Sentry Ward zobrazených při strategické poradě z 2 na 3 (což je také maximální počet Sentry Ward, které lze zakoupit před zahájením zápasu)",
  "springcleaning22_ui_guide_pregame": "Pokud build nezahrnuje sekci „Do začátku“, jsou v doporučených předmětech po výběru hrdiny ukázány předměty z první sekce buildu dle pořadí",
  "springcleaning22_ui_ward_planter": "Vybráním Wardy se nově mohou spojenečtí hráči, diváci a spojenečtí trenéři dozvědět, kdo ji umístil",
  "springcleaning22_ui_courier_home_button": "Tlačítko „Domácí obchod“ nově zajistí, že kurýr také vrátí všechny nesené předměty do skrýše",
  "springcleaning22_ui_combat_log_key": "V nastavení lze nyní přiřadit klávesu pro otevření záznamu boje",
  "springcleaning22_ui_combat_log_right_align": "Záznam boje je nově zarovnaný doprava a nepřekrývá ovládací prvky zkoušení hrdiny",
  "springcleaning22_ui_combat_log_hud_flip": "Záznam boje nově bere v potaz obrácené ukazatele (minimapa napravo) a je-li tato možnost povolena, je zarovnán doleva",
  "springcleaning22_ui_guide_apos": "Byly opraveny komentáře předmětů/schopností v buildech, které po uložení nahradily apostrofy „&apos;“ a jinými HTML symboly. Již uložené buildy s touto chybou bude však nutné ručně aktualizovat",
  "springcleaning22_ui_vs_screen_widescreen": "Bylo vylepšeno zobrazení hrdinů na úvodní obrazovce pro monitory s poměrem stran 21:9 nebo větším",
  "springcleaning22_ui_charms": "Bylo opraveno rozhraní talismanů, jehož text přesahoval, pokud jste měli více než dva talismany",
  "springcleaning22_ui_last_hit_trainer_spawn": "Byla opravena chyba v Tréninku Last Hitů, kde bylo možné zahájením před oživením hrdiny zabránit objevování creepů",
  "springcleaning22_ui_intro_scenes": "Úvodní filmečky (např. debuty hrdinů či Arcana předmětů) už nebudou přehrávány hráčům, kteří hru zapínají poprvé a neprošli si úvodem pro nové hráče",
  "springcleaning22_cosmetics_illusion_skins": "Byla opravena chyba, kvůli které nemusely iluze podědit skiny určitých kosmetických modelů",
  "springcleaning22_cosmetics_cloth_stretch": "Byla opravena chyba, kvůli které se látky na určitých modelech mohly roztáhnout přes celou obrazovku",
  "springcleaning22_cosmetics_underlord_immortal": "Immortal předmět Emerald Subjugation pro Underlorda nově poskytuje speciální efekty pro ultimátní schopnost",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Efekty projektilu schopnosti Shadow Poison získané od Immortal předmětu Mantle of Grim Facade pro Shadow Demona nově směřují správným směrem",
  "springcleaning22_cosmetics_wraith_king_immortal": "Immortal předmět Blistering Shade pro Wraith Kinga má nově při používání schopnosti Wraithfire Blast větší prioritu než Arcana předmět",
  "springcleaning22_cosmetics_earthshaker_immortal": "Byly opraveny speciální efekty Immortal předmětu Bracers of the Cavern Luminar pro Earthshakera",
  "springcleaning22_cosmetics_warlock_immortal": "Byly opraveny efekty schopnosti Shadow Word získané od Immortal předmětu Umbral Glyph pro Warlocka (platí pro buff i debuff)",
  "springcleaning22_cosmetics_viper_immortal": "Byly opraveny efekty schopnosti Nethertoxin získané od Immortal předmětu Malefic Drake's Strike pro Vipera",
  "springcleaning22_cosmetics_abaddon_vessel": "Byly obnoveny efekty schopnosti Aphotic Shield získané od předmětu Blade of the Demonic Vessel pro Abaddona",
  "springcleaning22_cosmetics_tidehunder_belt": "Od předmětu Horror From the Deep Belt pro Tidehuntera byly odstraněny částicové efekty, které neměly být ve slotu pro opasek, nýbrž ve slotu pro paže",
  "springcleaning22_cosmetics_faceless_incursion": "Byly opraveny speciální efekty předmětu Claszureme Incursion Weapon pro Faceless Voida",
  "springcleaning22_cosmetics_drow_arcana_aura": "Aura schopnosti Marksmanship (Drow Ranger) má nově odlišné efekty podle stylu Arcana předmětu",
  "springcleaning22_cosmetics_rubick_dilemma": "Byly obnoveny speciální efekty předmětu Torch of Fantoccini's Dilemma pro Rubicka",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Animace běhu se zraněním Arcana předmětu pro Techies je nově přehrávána správnou rychlostí",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Arcana předmět pro Techies může nově přes gem obarvit schopnosti Sticky Bomb a Reactive Tazer",
  "springcleaning22_cosmetics_techies_icons": "Byly přidány chybějící ikony pro sety Powdersled Rookery, Sapper's Guile, Bombtrails and Boomsticks a March of the Powderkeg Patrol (všechny pro Techies)",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Byla opravena animace Spoona (člen Techies) v náhledu teleportu s vybaveným setem Pachyderm Powderwagon",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Arcana předmět pro Rubicka má nově speciální efekty pro schopnost Sticky Bomb (Techies) namísto Remote Mines",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Byla opravena animace přerušení Snapfire, takže už se nemůže zaseknout v nesprávné sekvenci animací",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Balíček a jednotlivé předměty setu Radiant Conqueror pro Legion Commander lze nyní vyměnit a prodat na komunitním trhu",
  "springcleaning22_cosmetics_legion_commander_wind": "Byly přidány efekty větru pro předměty Radiant Conqueror Back a Legacy of the Fallen Legion, a to jak při nesení zbraní ze setu Arcana předmětů, tak i bez nich",
  "springcleaning22_perf_panorama_atlas": "Byl aktualizován engine pohánějící framework Panorama, aby prostřednictvím funkce „atlassing“ efektivněji pracoval s GPU. Podle našich testů jde o 25–30% zlepšení výkonu pro ukazatele a ještě značnější zlepšení pro obzvláště složité stránky hlavní nabídky. Tato změna ovlivnila také zátěž CPU při používání API Vulkan a měla by se kladně projevit především na zařízeních s procesory M1 od společnosti Apple",
  "springcleaning22_perf_sand_king_particles": "Byly optimalizovány částicové efekty schopnosti Sand Storm (Sand King)",
  "springcleaning22_perf_panorama_clears": "Byl aktualizován engine pohánějící framework Panorama, aby ignoroval vyřazování některých nedůležitých cílů renderování a tím ušetřil práci GPU",
  "springcleaning22_perf_scenesystem_threading": "Byla opravena chyba, kvůli které bylo občas pro vícevláknové výpočty používáno méně vláken. Obzvláště užitečná oprava pro procesory se 4 nebo méně jádry",
  "springcleaning22_perf_thread_affinity": "Byla opravena chyba, kvůli které mohlo nesprávné přiřazení vláken vyústit na některých zařízeních v zásek",
  "springcleaning22_perf_power_savings": "Do nastavení obrazu bylo přidáno varování na to, že počítač běží v režimu spořiče energie, což může mít za následek zhoršený výkon",
  "springcleaning22_perf_shop_tooltips": "Byl vylepšen výkon při procházení obchodu a popisů předmětů",
  "springcleaning22_custom_games_overview_sort": "V záložce „Přehled“ sekce „Herna“ lze nově módy kromě počtu otevřených lobby třídit také podle aktuálního počtu aktivních hráčů",
  "springcleaning22_custom_games_update": "Byl opraven problém s uživatelskými módy, které někdy nevyžadovaly aktualizaci, dokud nebyly přeinstalovány nebo nebyl restartován klient služby Steam",
  "springcleaning22_custom_games_lobby_version": "Seznam lobby už nezahrnuje lobby, která neodpovídají aktuálně nainstalované verzi uživatelského módu nebo se do nich nelze připojit z jiného důvodu",
  "springcleaning22_custom_games_bounty_filter": "Pomocí filtru „SetFilterMoreGold“ lze nově ovlivnit množství zlaťáků z run darů",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Byla nahrazena relikvie pro Dazzla: „Debuffnutí čtyř nepřátel pomocí Bad Juju“ –> „Poškození a léčení od Bad Juju“",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Byla nahrazena relikvie pro Techies: „Zabití pomocí Remote Mines“ –> „Sticky Bomby přichycené k hrdinům“",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Byla nahrazena relikvie pro Techies: „Omráčení pomocí Stasis Trap“ –> „Odzbrojení více hrdinů pomocí Reactive Tazer“",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Byla nahrazena relikvie pro Tinkera: „Poškození March of the Machines“ –> „Poškození vstřebané pomocí Defense Matrix“",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Byla nahrazena relikvie pro Underlorda: „Dark Rift vedoucí k zabití“ –> „Zabití spojenců po použití Fiend's Gate“",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Byla nahrazena relikvie pro Underlorda: „Hrdinové zachránění pomocí Rift“ –> „Udělené bonusové poškození od Atrophy Aura“",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Byla opravena relikvie pro Omniknighta: „Poškození spojenců během Heavenly Grace“",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Byla opravena relikvie pro Primal Beasta: „Zásahy více hrdinů pomocí Onslaught“",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Byl nahrazen úkol pro Meepa: „Udělení magického poškození hrdinům“ –> „Udělení neredukovaného poškození hrdinům“",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Byl nahrazen úkol pro Naga Siren: „Léčení hrdinů během schopnosti Song of the Siren“ –> „Poškození hrdinů vlivem spálení many“",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Byl nahrazen úkol pro Tinkera: „Udělení poškození pomocí schopnosti March of the Machines“ –> „Vstřebání poškození pomocí schopnosti Defense Matrix“",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Byl nahrazen úkol pro Techies: „Zabití pomocí schopnosti Remote Mines“ –> „Přichycení schopnosti Sticky Bomb“",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Byl nahrazen úkol pro Underlorda: „Teleportování více hrdinů pomocí schopnosti Dark Rift“ –> „Zabití spojenců po použití schopnosti Fiend's Gate“",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Byl aktualizován úkol pro Grimstroka: „Udělení poškození nepřátelům pod vlivem schopnosti Soulbind“ nově započítává i poškození od spojenců",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Byl aktualizován úkol pro Miranu: „Udělení poškození během schopnosti Leap“ nově započítává všechny typy poškození (dříve pouze fyzické)",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Byl opraven úkol pro Banea: „Komba předmětu Blink Dagger / Force Staff a schopnosti Fiend's Grip“",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Byl opraven úkol pro Dragon Knighta: „Zabití během schopnosti Elder Dragon Form“",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Byl opraven úkol pro Drow Ranger: „Umlčení 2+ nepřátel pomocí schopnosti Gust“",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Byl opraven úkol pro Crystal Maiden: „Zabití creepů pomocí schopnosti Frostbite“",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Byl opraven úkol pro Dark Seera: „Udělení poškození během schopnosti Surge“",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Byl opraven úkol pro Lifestealera: „Udělení poškození během schopnosti Rage“",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Byl opraven úkol pro Lone Druida: „Udělení poškození během schopnosti True Form“",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Byl opraven úkol pro Marse: „Udělení poškození nepřátelským hrdinům“",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Byl opraven úkol pro Marse: „Zabití nepřátelských jednotek rozštípnutím“",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Byl opraven úkol pro Omniknighta: „Udělení poškození během schopnosti Heavenly Grace“",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Byl opraven úkol pro Omniknighta: „Trvání schopnosti Heavenly Grace na spojencích“",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Byl opraven úkol pro Rubicka: „Omráčení více hrdinů pomocí schopnosti Telekinesis“",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Byl opraven úkol pro Tinkera: „Udělení poškození hrdinům pomocí schopnosti Laser vylepšené Scepterem“",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Byl opraven úkol pro Tuska: „Komba schopností Walrus Punch a Kick“",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Byl odstraněn úkol pro Venomancera: „Udělení poškození hrdinům zlomeným pomocí předmětu Silver Edge“",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Byl odstraněn úkol pro Tinkera: „Zabití creepů pomocí schopnosti March of the Machines“",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Byl přidán úkol pro Underlorda: „Udělení poškození hrdinům pomocí schopnosti Firestorm“",
  "springcleaning22_workshop_modeldoc": "Program Dota 2 Workshop Tools pro kosmetické předměty a uživatelské módy byl vylepšen o nový editor modelů „ModelDoc“. Komunitní tvůrci by měli co nejdříve převést své modely ze starého editoru, který bude v budoucnu odstraněn"
}