// 3791.js

{
  "language": "finnish",
  "springcleaning22_desc": "Kevätsiivous 2022 -päivitys on täällä! Se sisältää bugikorjauksia ja käyttömukavuuden parannuksia. Tsekkaa tästä joitain isoimpia muutoksia, kuten Aghanimin työkaluvihjeiden, ohjainten mykistyksen, kauppahaun ja demosankaritilan parannuksia, ja sukella sitten pidemmän korjauslistan ja muiden pelissä tehtyjen säätöjen tarkasteluun alla olevassa täydellisessä erittelyssä.",
  "springcleaning22_aghs_tooltips": "Aghanim's Scepterin ja Shardin työkaluvinkit",
  "springcleaning22_aghs_tooltips_desc": "Aghanimin mielen salat (ja monologit) ovat kiistattomasti kuolevaisen ymmärryksen ulottumattomissa, mutta tämänpäiväisen päivityksen myötä Scepterien ja Shardien mahtava vaikutus taistelukentällä paljastetaan ennenkuulumattomalla tavalla. Aghanimin päivitysten työkaluvihjeissä on nyt enemmän tietoa tarkoista, varustettaessa muuttuvista luvuista, ja muokatuissa kyvyissä on myös tämä tieto sille varatussa osiossaan. Monet päivitykset on nyt esitetty sellaisella tavalla, että myös tavallisten kuolevaisten mielet ymmärtävät ne helpommin.",
  "springcleaning22_muting_ui": "Mykistyksen parannukset",
  "springcleaning22_muting_ui_desc": "Dota-pelaajat ovat riehakasta porukkaa, ja joskus vääränlaiset tunteet nousevat pintaan kilpailun kuhinassa. Jos käytöksestä tulee häiritsevää, on tärkeää, että voit mykistää pelaajat helposti ja nopeasti ja ilmiantaa heidät tarkempaan tarkasteluun ilman, että se häiritsee enempää omaa peliäsi. Yksi klikkaus mykistää nyt äänen ja tekstin ja ilmiantaa pelaajan. Voit myös klikata hiiren oikealla painikkeella ja mykistää näin tekstin ja äänen sellaisissa tapauksissa, että pelaajan käytös ei ole häiriköivää, mutta haluat piilottaa hänen viestintänsä. Voit myös käyttää uutta tiimin mykistys -painiketta, jolla voit estää kokonaisen tiimin viestinnän yhdellä klikkauksella.\\n\\nTarkastelemme parhaillaan, miten käsittelemme viestintäilmiannot. Tavoitteenamme on, että häiriköivien pelaajien mykistäminen on helppoa ja nopeaa, mutta haluamme samalla saada paremman käsityksen siitä, keiden kohdalla meidän pitäisi ottaa jykevämmät keinot käyttöön.",
  "springcleaning22_demo_hero": "Demosankarin parannukset",
  "springcleaning22_demo_hero_desc": "Haluatko testata uusia strategioita tai luoda jotain omaa? Vai onko sinulla vain pakottava tarve nähdä, kuinka monta Axen ruumiillistumaa voidaan teurastaa yhden Tidebringerin iskulla? Oli syy kumpi tahansa, niin tämä on oikea ilon ja onnen päivä. Sankaridemo on päivitetty, ja siinä on liuta uusia toiminnallisuuksia:",
  "springcleaning22_demo_hero_map": "Demokartan pohjoisosiota on laajennettu, ja siinä on nyt enemmän tasaista aluetta testaamista varten.",
  "springcleaning22_demo_hero_hero_spawn": "Lisättiin asetukset, joilla voi synnyttää vihollissankarien lisäksi liittolaissankareita.",
  "springcleaning22_demo_hero_hero_reset": "Lisättiin asetus, jolla sankarin voi palauttaa tasolle 1.",
  "springcleaning22_demo_hero_hero_remove": "Lisättiin asetus, jolla sankarin voi poistaa testauksen jälkeen.",
  "springcleaning22_demo_hero_hero_select": "Kun luot uuden sankarin, se lisätään nykyiseen valintaasi.",
  "springcleaning22_demo_hero_levelling": "Tason nostamisen sekä Scepterin ja Shardin lisäämisen painikkeet ja haavoittuvuuden vaihtopainike vaikuttavat nyt kaikkiin tällä hetkellä valittuihin sankareihin.",
  "springcleaning22_demo_creep_toggle": "Kun kätyrit otetaan pois päältä, kaikki olemassa olevat linjakätyrit tuhotaan.",
  "springcleaning22_demo_creep_spawn": "Lisättiin painike, jolla voi synnyttää yhden kätyriaallon kummaltakin puolelta.",
  "springcleaning22_demo_hero_runes": "Lisättiin painikkeita, joilla voi synnyttää kuusi pääriimua.",
  "springcleaning22_shop_search": "Kauppahaun päivitys",
  "springcleaning22_shop_search_desc": "Kullan käyttämisen täytyisi olla helppoa ja hauskaa, mutta myös tehokasta. Jotta ostaminen ei tunnu mälsältä kuin \"meep merp\" vaan pikemminkin täysosumalta, esinekaupan hakua on laajennettu ja avainsanojen tukea on parannettu. Tarjolla on myös haettuja piirteitä korostava näkymä. Nyt voit hakea panssarilla, voimalla, kantamalla tai muulla ja korostaa kiinnostavia tilastoja. Suunnitelmaan sopivan esineen valitseminen on helpompaa kuin koskaan. Siihen vaaditaan vain kultaa.",
  "springcleaning22_item_tooltips": "Työkaluvihjeiden parannukset",
  "springcleaning22_item_tooltips_desc": "Unohtuuko välillä, miten paljon älykkyys tuottaa manaa? Tai paljonko ketteryydestä saa panssaria? Sitä ei tarvitse enää miettiä, sillä työkaluvihjettä katsellessa ALT-painike laajentaa nyt ominaisuudet ja avaa osatekijät.",
  "springcleaning22_colored_ability_damage": "Kykyvahinkojen värit",
  "springcleaning22_colored_ability_damage_desc": "Jotta voi tehdä pelissä hyviä päätöksiä, on tiedettävä, mitä on tulossa. Mahdollisten vaarojen tunnistamista helpottaa nyt se, että loitsujen ja esineiden tekemä vahinko on värikoodattu. Väri vaihtelee sen mukaan, onko vahinko fyysistä, puhdasta vai loitsuvahinkoa.",
  "springcleaning22_pluralized_strings": "Monikkomuotojen parempi kielituki",
  "springcleaning22_pluralized_strings_desc": "Jotta peli olisi entistä paremmin käytettävissä kautta maailman, lisäsimme usealle kielelle monikkomuotojen paremman tuen. Yli 400 riviä tekstiä päivitettiin muutoksilla.",
  "springcleaning22_permanent_debuffs": "Pysyvät vahvistukset",
  "springcleaning22_permanent_debuffs_desc": "Strategisointi on hankalaa, jos ei ymmärrä toimintojen tehokkuutta. Ottelunjälkeisiä tietoja on lisätty niin, että Necrophosin Reaper's Scythe -tapot ja Axen Culling Blade -tapot näytetään nyt pelinjälkeisellä näytöllä.",
  "springcleaning22_post_game_sortable": "Pelinjälkeisten tietojen lajittelu",
  "springcleaning22_post_game_sortable_desc": "Haluatko tutkailla tarkemmin voitokkaiden otteluiden yksityiskohtia? Pelinjälkeisen pistetaulukon lajittelu mahdollistaa nyt tarkan analyysin.",
  "springcleaning22_gameplay_tp_boots": "Kun Boots of Travel langetetaan tornin kantaman sisällä, se vaikuttaa nyt pienemmällä todennäköisyydellä kätyriin.",
  "springcleaning22_gameplay_sellback": "Esineitä voi nyt myydä täyteen hintaan 30 sekuntia pelin alkamisesta edellisen 10 sekunnin sijaan.",
  "springcleaning22_gameplay_lifestealer_consume": "Lifestealerin Consume käyttää nyt samaa pikanäppäintä vahingoitetun yksikön tyypistä riippumatta.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Ogre Bruiserilla on nyt lataus- ja tainnutusääniefekti.",
  "springcleaning22_gameplay_neutral_aura_radius": "Kaikki neutraalit kätyrit näyttävät nyt säteen, kun hiirtä pidetään niiden päällä.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Wraith Band, Null Talisman ja Bracer päivittävät nyt tilastobonukset kyvyn työkaluvihjeessä 25 minuutin tuplaantumisen kohdalla.",
  "springcleaning22_gameplay_heal_overhead": "Korjattiin useampi tapaus, joissa yksikön yläpuolella näkyvissä parannusluvuissa ei huomioitu parannuksen vahvistusta.",
  "springcleaning22_gameplay_fountain_invuln": "Lähteen ansiosta haavoittumattomat pelaajat eivät enää hyökkää automaattisesti eikä vaikutus lakkaa, kun vihollinen on lähietäisyydellä.",
  "springcleaning22_gameplay_blink_range": "Blinkin ja sen varianttien loitsukantaman ilmaisin ottaa nyt huomioon vahvistukset, jotka lisäävät käyttöetäisyyttä.",
  "springcleaning22_gameplay_desolator_tooltip": "Selvennettiin Desolatorin passiivisen Soul Stealerin työkaluvihjettä. Desolator saa hyökkäysvahinkoa joka kerta, kun vihollinen kuolee Corruptionin heikennyksen alaisena.",
  "springcleaning22_gameplay_ardm_stash": "Korjattiin RRDN-bugi, jossa esinettä säilöön palauttanut kuollut kuriiri sai esineen katoamaan.",
  "springcleaning22_gameplay_neutral_items_lock": "Neutraaliesineiden yhdistelyä ei voi enää estää. Tämä korjaa bugin, jossa kuriirit eivät toimittaneet neutraaliesineitä, joiden yhdistely oli estetty.",
  "springcleaning22_gameplay_illusion_modifiers": "Korjattiin bugi, jossa useamman muuttujan harhoilla oli väärä kesto, mikä johti sankarin paljastumiseen.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Korjattiin Turbo- ja Uusi pelaaja -tilan bugi, jossa kultalähteet eivät skaalautuneet oikein.",
  "springcleaning22_gameplay_turbo_courier": "Korjattiin Turbo-tilan bugi, jossa pelaajan kuriiri ei enää toiminut, jos yhteys katkesi sankarivalinnan tai strategiavaiheen aikana.",
  "springcleaning22_gameplay_arc_warden_basher": "Lisättiin työkaluvihje, joka selventää, etteivät kloonit ja Tempest Double -kloonit voi käyttää Bashia Skull Basherin ja Abyssal Bladen kanssa.",
  "springcleaning22_gameplay_arc_warden_blink": "Blink Daggeria voi nyt käyttää Arc Wardenin Tempest Double -kopioon kutsuttassa ilman latausaikaa.",
  "springcleaning22_gameplay_arc_warden_wards": "Arc Wardenin Tempest Double -klooni ei saa enää jaettuja wardeja.",
  "springcleaning22_gameplay_naga_siren_riptide": "Naga Sirenin kyky \"-1 osumaa Riptiden käyttöön\" vähentää osumia nyt yhdellä, ei kahdella.",
  "springcleaning22_gameplay_legion_commander_duel": "Legion Commanderin Duel antaa nyt lisävahingon vaikka voittaja olisi haavoittumaton.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Tuskin Walrus Kickilla on nyt oikea 12 sekunnin latausaika.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Terrorbladen Metamorphosisilla on nyt oikea kesto: 35/40/45/50 sekuntia.",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey Kingin Tree Dancella ei voi enää paeta Marsin Arena of Bloodia.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Korjattiin Marcin Disposen vuorovaikutus Black King Barin ja Lotus Orbin kanssa.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Sniperin Concussive Grenade lisää nyt \"riisuttu aseista\" -kuvakkeen kohteen pään päälle.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling ei enää pidä passiivista Spirit Linkiä muuttuessaan Lone Druidiksi.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Lisättiin puuttuva kanavointikuvake Underlordin Fiend's Gatelle.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Lisättiin puuttuva työkaluvihje Icefire Bombin heikennykselle.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Kun Dark Willow'lla on Aghanim's Shard, sen Cursed Crownin hiukkausefektin ajoitus on nyt oikein.",
  "springcleaning22_gameplay_heavenly_jump_range": "Zeusin Heavenly Jump näyttää nyt kantaman, kun hiirtä pidetään sen päällä.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Korjattiin Crystal Maidenin Arcane Auran työkaluvihjeet.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Korjattiin virhe, jossa Abaddonin tason 20 kyky ei päivittänyt Borrowed Timen latausaikaa työkaluvihjeessä.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Korjattiin Shadow Fiendin Presence of the Dark Lord, jotta se vaikuttaa neutraalikätyreihin.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Korjattiin Tinkerin Warp Grenaden vaikutus Roshaniin.",
  "springcleaning22_gameplay_ability_draft_wukong": "Korjattiin kykyvalinnassa virhe, jossa Wukong's Commandin klooneilla oli väärät kyvyt.",
  "springcleaning22_rubick_hunter_in_the_night": "Hunter in the Nightin voi nyt varastaa, kun se on päivitetty Aghanim's Scepterillä",
  "springcleaning22_rubick_juxtapose": "Juxtaposen voi nyt varastaa, kun se on päivitetty Aghanim's Scepterillä",
  "springcleaning22_rubick_wolf_bite": "Wolf Bite toimii nyt varastettuna.",
  "springcleaning22_rubick_depth_shroud": "Depth Shroud toimii nyt varastettuna.",
  "springcleaning22_rubick_dismember": "Dismember heittää nyt liittolaissankarin ulos, jos toinen loitsu varastetaan sen sijaan.",
  "springcleaning22_rubick_decoy": "Decoyn varastaminen ei enää tarkoita myös Bushwhackin varastamista. Decoyn langetus vaikuttaa yhä Bushwhackin.",
  "springcleaning22_rubick_spirits": "Ion Spiritsin varastaminen toimii nyt oikein Aghanim's Scepterin hankinnan yhteydessä.",
  "springcleaning22_rubick_gravekeepers_cloak": "Gravekeeper's Cloakin voi nyt varastaa, kun se on päivitetty Aghanim's Scepterillä.",
  "springcleaning22_rubick_shard_cursed_crown": "Jos Rubickilla on Aghanim's Shard, Cursed Crown luo nyt myös Bramblesin.",
  "springcleaning22_rubick_shard_venomous_gale": "Jos Rubickilla on Aghanim's Shard, Venomous Gale luo nyt myös Plague Wardeja.",
  "springcleaning22_rubick_shard_sprout": "Jos Rubickilla on Aghanim's Shard, Sprout luo nyt myös Treanteja.",
  "springcleaning22_rubick_shard_shackles": "Jos Rubickilla on Aghanim's Shard, Shackles luo nyt myös Serpent Wardeja.",
  "springcleaning22_rubick_shard_cold_embrace": "Jos Rubickilla on Aghanim's Shard, Cold Embrace heijastaa nyt myös Splinter Blastin.",
  "springcleaning22_rubick_shard_earthshock": "Jos Rubickilla on Aghanim's Shard, Earhtshock käyttää nyt myös Enragen.",
  "springcleaning22_rubick_shard_shadow_step": "Jos Rubickilla on Aghanim's Shard, Shadow Step käyttää nyt myös Spectral Daggerin.",
  "springcleaning22_rubick_shard_terror_wave": "Jos Rubickilla on Aghanim's Shard, Terror Wave käyttää nyt myös Metamorphosista.",
  "springcleaning22_rubick_shard_homing_missile": "Jos Rubickilla on Aghanim's Shard, Homing Missilellä on myös Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Jos Rubickilla on Aghanim's Shard, Slithereen Crush käyttää myös Corrosive Hazen.",
  "springcleaning22_rubick_scepter_flak_cannon": "Jos Rubickilla on Aghanim's Shard, Flak Cannonilla on myös passiivinen Side Gunner.",
  "springcleaning22_rubick_scepter_time_walk": "Jos Rubickilla on Aghanim's Shard, Time Walk käyttää myös Time Lockin.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Jos Rubickilla on Aghanim's Shard, Shuriken Toss käyttää myös Jinadan.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Jos Rubickilla on Aghanim's Shard, Sacred Arrow käyttää myös Starstormin.",
  "springcleaning22_ui_spectator_hud_player_view": "Katselu-HUD näyttää nyt seurattavan pelaajan oikein.",
  "springcleaning22_ui_post_game_backpack_neutral": "Reppu ja neutraaliesineet näkyvät nyt pelinjälkeisissä sankareiden lisätiedoissa.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Sankareiden ja kätyreiden loitsuvampirismiarvot näytetään nyt erikseen, kun ALT-painiketta pidetään painettuna.",
  "springcleaning22_ui_spectator_arcana": "Salatieteelliset esineet eivät enää näy katselijoina HUD:ssa liigaotteluiden aikana .",
  "springcleaning22_ui_ready_check_enter": "Enteriä painamalla voi nyt ilmoittaa olevansa valmis.",
  "springcleaning22_ui_alt_item_combine": "Kun ALT-painiketta pidetään painettuna, pikaostovalikon esineet näyttävät nyt kokonaisuuden, joka niistä syntyy.",
  "springcleaning22_ui_ward_planter": "Wardien valinta näyttää nyt liittolaispelaajille, -valmentajille ja katsojille, kuka wardit asetti.",
  "springcleaning22_ui_combat_log_key": "Taistelulokin voi nyt määrittää näppäimeen asetuksissa.",
  "springcleaning22_ui_combat_log_right_align": "Taisteluloki on tasattu oikealle eikä peitä sankaridemon ohjaimia.",
  "springcleaning22_ui_vs_screen_widescreen": "Korjattiin esittelyruudun sankarinäyttö kuvasuhteen 21:9 ja isommille näytöille.",
  "springcleaning22_ui_charms": "Korjattiin bugi, jossa helyjen käyttöliittymän tekstit olivat päällekkäin, jos helyjä oli kaksi tai enemmän.",
  "springcleaning22_cosmetics_cloth_stretch": "Korjattiin bugi, jossa tiettyjen mallien kangas saattoi venyä näytöllä.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Korjattiin Earshakerin kuolemattoman esineen, Bracers of the Cavern Luminar, tunnelmatehosteet.",
  "springcleaning22_cosmetics_viper_immortal": "Korjattiin Viperin kuolemattoman asusteen, Malefic Drake's Striken, hiukkastehoste Nethertoxinille.",
  "springcleaning22_cosmetics_abaddon_vessel": "Palautettiin Abaddonin Blade of the Demonic Vesselin Aphotic Shield -tehosteet.",
  "springcleaning22_cosmetics_faceless_incursion": "Korjattiin Faceless Voidin Claszureme Incursionin aseen tunnelmatehosteet.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Drow Rangerin salatieteellisellä Marksmanshipin auralla on nyt räätälöidyt tehosteet kummallekin tyylille.",
  "springcleaning22_cosmetics_rubick_dilemma": "Korjattiin Rubickin Torch of Fantoccini's Dilemman tunnelmatehosteet.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Techiesien salatieteellisen kokoelman vahingoittunut juoksuanimaatio näytetään nyt oikealla nopeudella.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Lisättiin Techiesin salatieteellisen kokoelman jalokiviväreille tuki Sticky Minea ja Reactive Tazeria varten.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Rubickin salatieteellisellä kokoelmalla on nyt räätälöidyt tehosteet Techiesien Sticky Bombille Remote Minen sijaan.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Legion Commanderin Radiant Conqueror -paketin ja -esineitä voi nyt myydä ja vaihtaa.",
  "springcleaning22_perf_sand_king_particles": "Optimoitiin Sand Stormin hiukkastehosteita suorituskyvyn parantamiseksi.",
  "springcleaning22_perf_thread_affinity": "Korjattiin bugi, jossa väärin asetetut säikeen affiniteetit saattoivat aiheuttaa jumiutumista joillain koneilla.",
  "springcleaning22_perf_shop_tooltips": "Parannettiin työkaluvihjeiden suorituskykyä esinekaupan selailussa.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold suodattaa nyt palkkioriimuista saadun kullan.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Korvattiin Dazzlen tilastoriimu: Bad Juju -heikennys neljään viholliseen > Bad Jujun aiheuttama vahinko ja parannus.",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Korvattiin Techiesien tilastoriimu: Remote Mine -tapot > sankareihin kiinnitetyt Sticky Bombit.",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Korvattiin Techiesien tilastoriimu: Stasis Trap -tainnutukset > usean sankarin aseistariisuva Reactive Tazer.",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Korjattiin Omniknightin tilastoriimu: liittolaisvahinko Heavenly Gracen aikana.",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Korjattiin Primal Beastin tilastoriimu: moneen sankariin osunut Onslaught.",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Korvattiin Techiesien sankarihaaste: Remote Mine -tapot > sankareihin kiinnitetyt Sticky Bombit.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Korjattiin Banen sankarihaaste: Blink / Force Staff ja Fiend's Grip -yhdistelmät.",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Korjattiin Dragon Knightin sankarihaaste: tapot Dragon Formin aikana.",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Korjattiin Drow Rangerin sankarihaaste: yli kahden vihollisen hiljennys Gustilla.",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Korjattiin Crystal Maidenin sankarihaaste: kätyritapot Frostbitella.",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Korjattiin Dark Seerin sankarihaaste: Surgen aikana tehty vahinko.",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Korjattiin Lifestealerin sankarihaaste: Ragen aikana tehty vahinko.",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Korjattiin Lone Druidin sankarihaaste: True Formin aikana tehty vahinko.",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Korjattiin Marsin sankarihaaste: vihollissankareille tehty vahinko.",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Korjattiin Marsin sankarihaaste: vihollissankarien tappaminen Cleavella.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Korjattiin Omniknightin sankarihaaste: Heavenly Gracen aikana tehty vahinko.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Korjattiin Omniknightin sankarihaaste: Heavenly Gracen kesto.",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Korjattiin Rubickin sankarihaaste: Telekinesis-tainnutus useaan sankariin.",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Korjattiin Tuskin sankarihaaste: Walrus Punch ja Walrus Kick -yhdistelmät.",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Poistettiin Venomancerin sankarihaaste: Silver Edgellä murretuille sankareille tehty vahinko.",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Poistettiin Tinkerin sankarihaaste: March of the Machinesilla tehdyt kätyritapot.",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Lisättiin Underlordille sankarihaaste: Firestormilla sankareille tehty vahinko."
}