// 3294.js

{
  "language": "polish",
  "springcleaning22_desc": "Aktualizacja wiosennych porządków 2022 zapewnia poprawki błędów i wdrożenie szeregu nowych usprawnień komfortu z gry. Sprawdźcie kilka większych zmian takich jak opisy ulepszeń Aghanima, sterowanie wyciszaniem, wyszukiwanie w sklepie czy tryb testu bohtera. Następnie zgłębcie dłuższą listę poprawek, w tym rozgrywki, przedstawionych w obszernym wykazie poniżej.",
  "springcleaning22_aghs_tooltips": "Dymki informacyjne przedmiotów Aghanim's Scepter i Aghanim's Shard",
  "springcleaning22_aghs_tooltips_desc": "Trybiki pracujące wewnątrz umysłu Aghanima (oraz jego monologi) są bez wątpienia nie do ogarnięcia przez ludzki umysł, ale dzięki dzisiejszej aktualizacji wpływ jego Scepterów i Shardów na pole bitwy jest bardziej przejrzysty niż kiedykolwiek wcześniej. Dymki informacyjne ulepszeń Aghanima od teraz zawierają więcej informacji na temat tego, jakie dokładnie wartości się zmieniają po umieszczeniu przedmiotu w ekwipunku, a zmodyfikowane umiejętności również zawierają te informacje w dedykowanej sekcji. Pochyliliśmy się również nad wieloma ulepszeniami, by były łatwiejsze do zrozumienia dla naszych nieczarodziejskich umysłów.",
  "springcleaning22_muting_ui": "Ulepszenia wyciszania",
  "springcleaning22_muting_ui_desc": "Gracze w Dota to żywiołowa zgraja i czasami w ferworze rywalizacji polem bitwy dominują nie te emocje, co trzeba. W przypadkach, gdy takie zachowanie zaczyna przeszkadzać, ważne jest, by istniał szybki i prosty sposób wyciszania graczy i zgłaszania ich bez dalszego przerywania twojej gry. Aby to było możliwe, od teraz wyciszanie czatu głosowego, tekstowego i zgłaszanie gracza odbywa się jednym kliknięciem. Możesz również kliknąć prawym, by wyciszyć tekst i głos niezależnie w przypadku, gdy zachowanie gracza nie przeszkadza w grze, ale komunikacja z nim mimo tego jest niepożądana. Od teraz możesz też użyć nowych przycisków wyciszenia drużyny, by zablokować komunikację z całą drużyną jednym kliknięciem.\\n\\nWykorzystujemy również tę okazję, by dokonać ponownej oceny tego, jak będziemy obchodzić się ze zgłoszeniami komunikacyjnymi. Naszym celem jest ułatwienie wyciszania przeszkadzających graczy, jak również otrzymanie jasnego sygnału, wobec których graczy należy podjąć zdecydowane działania.",
  "springcleaning22_demo_hero": "Ulepszenia testu bohatera",
  "springcleaning22_demo_hero_desc": "Chcecie przetestować najnowsze strategie lub stworzyć swoje własne? A może po prostu czujecie nieodpartą potrzebę sprawdzenia, ile inkarnacji Axe'a może zostać zgładzone pojedynczym atakiem Tidebringera? Tak czy siak, macie farta! Test bohatera został usprawniony szeregiem nowych funkcji:",
  "springcleaning22_demo_hero_map": "Północna sekcja mapy testu bohatera została powiększona, by zapewnić większy obszar o płaskiej powierzchni.",
  "springcleaning22_demo_hero_hero_spawn": "Dodano przyciski łatwego przyzywania sojuszniczych oraz wrogich bohaterów.",
  "springcleaning22_demo_hero_hero_reset": "Dodano przycisk zresetowania bohatera z powrotem do 1. poziomu.",
  "springcleaning22_demo_hero_hero_remove": "Dodano przycisk usunięcia bohatera po zakończeniu testowania.",
  "springcleaning22_demo_hero_hero_select": "Stworzenie nowego bohatera doda go do listy obecnie zaznaczonych jednostek.",
  "springcleaning22_demo_hero_levelling": "Przyciski zwiększenia poziomu, dodawania Aghanim's Scepter, Aghanim's Shard i włączania nietykalności od teraz działają na wszystkich obecnie zaznaczonych bohaterach.",
  "springcleaning22_demo_creep_toggle": "W chwili wyłączenia stworów wszystkie istniejące stwory ze ścieżek zostaną zniszczone.",
  "springcleaning22_demo_creep_spawn": "Dodano przycisk przyzywania pojedynczej fali stworów z każdej ze stron.",
  "springcleaning22_demo_hero_runes": "Dodano przyciski przyzywania 6 run mocy.",
  "springcleaning22_shop_search": "Zaktualizowane wyszukiwanie w sklepie",
  "springcleaning22_shop_search_desc": "Wydawanie złota powinno być łatwe, fajne, a przede wszystkim skuteczne. Aby wasze serie zabójstw były jeszcze bardziej zabójcze, wyszukiwarka sklepu z przedmiotami została rozszerzona i ulepszona, dodając obsługę słów kluczowych i podświetlając przedmioty z żądanymi atrybutami. Wystarczy wpisać czego szukacie – pancerza, Siły, zasięgu itp. by podświetlić statystyki, które was interesują. Wybranie idealnego przedmiot do idealnego planu jeszcze nigdy nie było tak łatwe. Teraz potrzebne wam będzie tylko złoto.",
  "springcleaning22_item_tooltips": "Rozszerzone dymki informacyjne przedmiotów",
  "springcleaning22_item_tooltips_desc": "Zapominacie, ile many zapewnia Inteligencja? Albo ile pancerza otrzymujecie ze Zręczności? Nie musicie się już zastanawiać, gdyż wystarczy przytrzymać klawisz Alt, patrząc na dymki informacyjne przedmiotów, by rozbić te informacje na czynniki pierwsze.",
  "springcleaning22_colored_ability_damage": "Kolory obrażeń od umiejętności",
  "springcleaning22_colored_ability_damage_desc": "Podejmowanie właściwych decyzji podczas walki zależy od znajomości tego, czemu musicie stawić czoła. Aby pomóc wam w rozpoznaniu potencjalnego zagrożenia, obrażenia zadawane przez czary i przedmioty są od teraz oznaczone kolorami w zależności od tego, czy obrażenia są fizyczne, magiczne czy pełne.",
  "springcleaning22_pluralized_strings": "Rozszerzone wsparcie językowe dla stringów z liczbą mnogą",
  "springcleaning22_pluralized_strings_desc": "Aby ułatwić korzystanie z gry na całym świecie, dodaliśmy funkcje zapewniające lepsze wsparcie zasad pisowni liczb mnogich w wielu językach oraz zaktualizowaliśmy w związku z tym ponad 400 linii tekstu.",
  "springcleaning22_permanent_debuffs": "Trwałe premie",
  "springcleaning22_permanent_debuffs_desc": "Tworzenie strategii jest trudne, jeżeli nie rozumie się skuteczności swoich działań. Aby przekazać więcej informacji po meczu, od teraz zabójstwa umiejętnością Reaper's Scythe Necrophosa oraz Culling Blade Axe'a są od teraz wyświetlane na ekranie podsumowania gry.",
  "springcleaning22_post_game_sortable": "Sortowanie szczegółów podsumowania gry",
  "springcleaning22_post_game_sortable_desc": "Chcecie bardziej zagłębić się w szczegóły waszych zwycięstw? Aby ułatwić analizę, od teraz możecie sortować tabelę wyników podsumowania gry.",
  "springcleaning22_gameplay_tp_boots": "Boots of Travel od teraz mają mniejsze prawdopodobieństwo obrania stwora za cel, gdy zostaną użyte w zasięgu wieży.",
  "springcleaning22_gameplay_sellback": "Gracze mogą od teraz sprzedać przedmiot za pełną cenę przez pierwsze 30 sekund po rozpoczęciu gry zamiast po normalnym 10-sekundowym okresie sprzedaży za pełną cenę.",
  "springcleaning22_gameplay_lifestealer_consume": "Consume Lifestealera od teraz korzysta z tego samego skrótu klawiszowego niezależnie od rodzaju jednostki, na której użyto Infest.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Ogre Bruiser od teraz posiada efekty dźwiękowe zamachu i ogłuszenia.",
  "springcleaning22_gameplay_neutral_aura_radius": "Od teraz promień aur neutralnych stworów jest wyświetlany po najechaniu na te jednostki.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Wraith Band / Null Talisman / Bracer od teraz aktualizują swoje premie do statystyk w dymku informacyjnym, gdy premia jest podwajania w chwili wybicia 25. minuty.",
  "springcleaning22_gameplay_heal_overhead": "Naprawiono szereg przypadków, w których pojawiające się wartości leczenia nie brały pod uwagę wzmocnienia leczenia.",
  "springcleaning22_gameplay_fountain_invuln": "Gracze z pozytywnym efektem nietykalności w fontannie już nie będą automatycznie atakować i przerywać działania efektu, gdy wróg jest w zasięgu.",
  "springcleaning22_gameplay_blink_range": "Wskaźnik zasięgu czaru dla Blinka i jego wariantów od teraz bierze pod uwagę premie zwiększające zasięg rzutu.",
  "springcleaning22_gameplay_desolator_tooltip": "Rozjaśniono informacje umiejętności pasywnej Soul Stealer Desolatora. Desolator uzyskuje obrażenia od ataku za każdym razem, gdy wróg pod wpłwem negatywnego efektu Corruption umrze.",
  "springcleaning22_gameplay_ardm_stash": "Naprawiono błąd w trybie ARDM powodujący, że kurier podczas zwracania przedmiotu do schowka w chwili śmierci prowadził do zniknięcia przedmiotu.",
  "springcleaning22_gameplay_neutral_items_lock": "Neutralnych przedmiotów nie można już zablokowywać w celu połączenia. Naprawia to błąd powodujący, że kurier nie był w stanie dostarczyć tego typu przedmiotów w takim stanie.",
  "springcleaning22_gameplay_illusion_modifiers": "Naprawiono błąd powodujący, że iluzje z powielonymi modyfikatorami miały niepoprawne czasy trwania, umożliwiając identyfikację prawdziwego bohatera.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Naprawiono błąd w trybie Turbo oraz dla nowych graczy powodujący, że niektóre źródła złota nie były odpowiednio skalowane.",
  "springcleaning22_gameplay_turbo_courier": "Naprawiono błąd w trybie Turbo powodujący, że kurier gracza przestawał działać, gdy gracz został rozłączony podczas wybierania bohatera lub w fazie strategicznej.",
  "springcleaning22_gameplay_zero_tooltips": "Naprawiono błąd powodujący, że niektóre dymki informacyjne w grze modyfikowane przez talenty wyświetlały wartość 0 zamiast tej poprawnej.",
  "springcleaning22_gameplay_euls_invulnerable": "Użycie Eul's Scepter na klonach niewrażliwych na magię od teraz będzie poprawnie nakładać swój efekt na klonach zamiast po prostu aktywować czas oczekiwania.",
  "springcleaning22_gameplay_kobold_aura": "Prospecting Aura Kobolda już nie wpływa na bohaterskie stwory (np. niedźwiedzia Lone Druida), co naprawia błąd powodujący, że efekt był niepoprawnie podwajany.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Klony i duplikaty z Tempest Double od teraz poprawnie otrzymują premie do statystyk z błogosławieństw z Aghanim's Scepter przyznawanych przez Alchemista.",
  "springcleaning22_gameplay_chen_hand_of_god": "Hand of God Chena od teraz poprawnie nakłada leczenie rozłożone w czasie na stwory pod kontrolą Chena, a nie tylko samo początkowe leczenie.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Kara na obrażenia od ataku z Tempest Double Arc Wardena z dystansu od teraz bierze pod uwagę reinkarnację Arc Wardena.",
  "springcleaning22_gameplay_arc_warden_basher": "Dodano opis wyjaśniający, że stłuczenia z Bashera i Abyssal Blade'a nie działają dla klonów ani duplikatów z Tempest Double.",
  "springcleaning22_gameplay_arc_warden_blink": "Na Blink Dagger u duplikatu z Tempest Double Arc Wardena nie jest już nakładany czas oczekiwania przy przywołaniu.",
  "springcleaning22_gameplay_arc_warden_wards": "Nie można już dzielić się znakami z duplikatem z Tempest Double Arc Wardena.",
  "springcleaning22_gameplay_pa_scepter_double": "Ulepszenie Aghanim's Scepter dla Phantom Assassin nie odświeża już umiejętności Blur, jeśli zabije ona duplikat z Temptest Double Arc Wardena.",
  "springcleaning22_gameplay_naga_siren_riptide": "Talent Naga Siren redukujący liczbę uderzeń potrzebną do Rip Tide od teraz poprawnie redukuje ją o 1, a nie o 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Dodatkowe obrażenia z Duel Legion Commaner są od teraz przyznawane, nawet jeśli zwycięzca jest nietykalny.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Walrus Kick Tuska od teraz ma prawidłowy czas oczekiwania wynoszący 12 sekund.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Metamorphosis Terrorblade'a od teraz ma prawidłowy czas oczekiwania wynoszący 35/40/45/50 sekund.",
  "springcleaning22_gameplay_monkey_king_arena": "Umiejętność Tree Dance Monkey Kinga nie może już być używana do uciekania z Arena of Blood.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "Efekty Riptide Naga Siren od teraz będą wyświetlane przy prawidłowym bohaterze w trybie Ability Draft zamiast zawsze przy Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki od teraz może rzucać Smoke Screen podczas inkantacji Tricks of the Trade bez przerywania tej inkantacji, nawet jeśli włączona jest opcja „Inkantacje wymagają utrz. pozycji lub zatrzymania”.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Naprawiono interakcję między umiejętnością Dispose Marci a przedmiotami BKB i Lotus Orb.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Umiejętność Concussive Grenade Snipera od teraz dodaje ikonę rozbrojenia nad głową.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling już nie otrzymuje na stałe umiejętności pasywnej Spirit Link, kiedy zmieni się w Lone Druida.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Dodano brakującą ikonę inkantacji dla Fiend's Gate Underlorda.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Dodano brakujący opis dla negatywnego efektu umiejętności Icefire Bomb.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Efekty cząsteczkowe umiejętności Cursed Crown Dark Willow z Aghanim's Shardem od teraz pojawiają się w prawidłowym czasie.",
  "springcleaning22_gameplay_lone_druid_midas": "Użycie Hand of Midas przez Spirit Beara Lone Druida od teraz zapewnia doświadczenie bohaterowi, który go kontroluje.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear oraz duplikaty z um. Tempest Double od teraz mogą uzyskiwać ładunki przedmiotów Magic Stick, Magic Wand i Holy Locket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Opis umiejętności Astral Step Void Spirita od teraz prawidłowo wyświetla wartości uwzględniające wzmocnienie czarów, kiedy wciśnięty jest klawisz Alt.",
  "springcleaning22_gameplay_heavenly_jump_range": "Umiejętność Heavenly Jump Zeusa od teraz wyświetla swój zasięg po najechaniu na nią kursorem myszy.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Naprawiono opisy umiejętności Arcane Aura Crystal Maiden.",
  "springcleaning22_gameplay_hex_tooltip": "Naprawiono opis umiejętności Hex Shadow Shamana, który błędnie dodawał 1 sekundę do swojego czasu trwania, kiedy wybrany był talent „Hex nakłada złamanie”.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Naprawiono talent 20 poziomu Abaddona, który nie poprawiał czasu oczekiwania w opisie umiejętności Borrowed Time.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Naprawiono błąd powodujący, że umiejętność Presence of the Dark Lord nie działała na neutralne stwory.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Naprawiono błąd powodujący, że umiejętność Warp Grenade Tinkera działała na Roshana.",
  "springcleaning22_gameplay_ability_draft_wukong": "Naprawiono błąd powodujący, że klony z Wukong's Command nie miały poprawnych umiejętności w trybie Ability Draft.",
  "springcleaning22_rubick_illusions": "Naprawiono błąd powodujący, że iluzje Rubicka miały niepoprawne animacje zależne od skradzionych czarów (np. Fiend's Grip Bane'a z Aghanim's Scepter).",
  "springcleaning22_rubick_hunter_in_the_night": "Umiejętność Hunter in the Night od teraz można ukraść, kiedy jest ulepszona przez Aghanim's Scepter.",
  "springcleaning22_rubick_juxtapose": "Umiejętność Juxtapose od teraz można ukraść, kiedy jest ulepszona przez Aghanim's Scepter.",
  "springcleaning22_rubick_fireball": "Umiejętność Fireball Dragon Knighta od teraz może zostać ukradziona niezależnie od Dragon Form i nie jest już zapewniana automatycznie.",
  "springcleaning22_rubick_wolf_bite": "Umiejętność Wolf Bite od teraz działa, kiedy zostanie ukradziona.",
  "springcleaning22_rubick_depth_shroud": "Umiejętność Depth Shroud od teraz działa, kiedy zostanie ukradziona.",
  "springcleaning22_rubick_astral_spirit": "Usunięto osobną umiejętność służącą do ruchu Astral Spirita, kiedy ta umiejętność zostanie skradziona. Rubick od teraz może zachować obydwa miejsca na czary, kiedy ukradnie tę umiejętność.",
  "springcleaning22_rubick_reverse_time_walk": "Reverse Time Walk od teraz zajmuje to samo miejsce co Time Walk, jeśli Rubick ma Aghanim's Shard. Rubick od teraz może zachować obydwa miejsca na czary, kiedy ukradnie tę umiejętność.",
  "springcleaning22_rubick_jaunt": "Ethereal Jaunt od teraz zajmuje to samo miejsce na umiejętność co Illusory Orb. Rubick od teraz może zachować obydwa miejsca na czary, kiedy ukradnie tę umiejętność.",
  "springcleaning22_rubick_eject": "Eject od teraz zajmuje to samo miejsce co Dismember, jeśli Rubick ma Aghanim's Shard. Rubick od teraz może zachować obydwa miejsca na czary, kiedy ukradnie tę umiejętność.",
  "springcleaning22_rubick_dismember": "Dismember od teraz wyrzuca sojuszniczego bohatera, jeśli inny czar zostanie ukradziony na jego miejsce.",
  "springcleaning22_rubick_spit_out": "Spit Out od teraz zajmuje to samo miejsce na umiejętność co Gobble Up. Rubick od teraz może zachować obydwa miejsca na czary, kiedy ukradnie tę umiejętność.",
  "springcleaning22_rubick_decoy": "Ukradnięcie umiejętności Decoy nie kradnie już razem z nią umiejętności Bushwhack. Decoy nadal nakłada efekt Bushwhack przy rzucie.",
  "springcleaning22_rubick_spirits": "Ukradnięcie umiejętności Spirits Io od teraz działa poprawnie przy kupnie Aghanim's Scpeter.",
  "springcleaning22_rubick_gravekeepers_cloak": "Umiejętność Gravekeeper's Cloak od teraz można ukraść, kiedy jest ulepszona przez Aghanim's Scpeter.",
  "springcleaning22_rubick_shard_cursed_crown": "Jeżeli Rubick posiada Aghanim's Shard, to um. Cursed Crown będzie również tworzyć ciernie.",
  "springcleaning22_rubick_shard_venomous_gale": "Jeżeli Rubick posiada Aghanim's Shard, to um. Venomous Gale będzie również tworzyć Plague Wardy.",
  "springcleaning22_rubick_shard_sprout": "Jeżeli Rubick posiada Aghanim's Shard, to um. Sprout będzie również tworzyć drzewce.",
  "springcleaning22_rubick_shard_shackles": "Jeżeli Rubick posiada Aghanim's Shard, to um. Shackles będzie również tworzyć Serpent Wardy.",
  "springcleaning22_rubick_shard_cold_embrace": "Jeżeli Rubick posiada Aghanim's Shard, to um. Cold Embrace będzie również tworzyć efekt Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "Jeżeli Rubick posiada Aghanim's Shard, to um. Earthshock będzie również nakładała efekt Enrage.",
  "springcleaning22_rubick_shard_shadow_step": "Jeżeli Rubick posiada Aghanim's Shard, to um. Shadow Step będzie również nakładała efekt Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "Jeżeli Rubick posiada Aghanim's Shard, to um. Terror Wave będzie również nakładała efekt Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "Jeżeli Rubick posiada Aghanim's Shard, to um. Homing Missile będzie również miała efekt Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Jeżeli Rubick posiada Aghanim's Shard, to um. Slithereen Crush nałoży również efekt um. Corrosive Haze.",
  "springcleaning22_rubick_scepter_flak_cannon": "Jeżeli Rubick posiada Aghanim's Shard, to um. Flak Cannon będzie miała również pasywny efekt ulepszenia bocznego strzelca.",
  "springcleaning22_rubick_scepter_time_walk": "Jeżeli Rubick posiada Aghanim's Shard, to um. Time Walk będzie również nakładała efekt Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Jeżeli Rubick posiada Aghanim's Shard, to um. Shuriken Toss będzie również nakładała efekt um. Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Jeżeli Rubick posiada Aghanim's Shard, to um. Sacred Arrow będzie również nakładała efekt um. Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "Celowanie wektorowe przy szybkim rzucaniu przy wciśnięciu klawisza zostało zmienione. Od teraz wektor zaczyna być rysowany przy wciśnięciu klawisza i kończy przy jego wypuszczeniu. Jest to takie samo zachowanie jak wcześniej przy szybkim rzucaniu przy wypuszczeniu klawisza.",
  "springcleaning22_ui_ward_bounty": "Wydarzenie zabicia znaku obserwacyjnego w rejestrze od teraz pokazuje, kto otrzymał nagrodę, jeśli nie jest to ta sama osoba, która dokonała zabójstwa.",
  "springcleaning22_ui_spectator_hud_player_view": "Interfejs widza od teraz poprawnie pokazuje oglądanego gracza.",
  "springcleaning22_ui_post_game_scepter_shard": "Opisy Aghanim's Scepter i Aghanim's Shard od teraz poprawnie wyświetlają swoje efekty na ekranie podsumowania gry.",
  "springcleaning22_ui_post_game_backpack_neutral": "Plecak i przedmioty neutralne są od teraz wyświetlane w szczegółach bohatera na ekranie podsumowania po grze.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Wartości kradzieży zdrowia z czarów z bohaterów i stworów są od teraz pokazywane odrębnie podczas przytrzymywania klawisza ALT.",
  "springcleaning22_ui_skeleton_warrior_rally": "Umiejętność Rally Aura Skeleton Warriora jest od teraz wyświetlana za pomocą efektu z licznikiem, a nie indywidualnych ikon efektów.",
  "springcleaning22_ui_neutral_item_teleport": "Naprawiono błąd powodujący teleportowanie niewłaściwego przedmiotu neutralnego, jeśli gracz zamieniał je podczas teleportacji wystarczająco szybko.",
  "springcleaning22_ui_spectator_arcana": "Elementy interfejsu arkanów nie są już wyświetlane podczas oglądania meczów ligowych.",
  "springcleaning22_ui_ready_check_enter": "Od teraz można nacisnąć klawisz ENTER, by potwierdzić gotowość do gry.",
  "springcleaning22_ui_alt_item_combine": "Przedmioty w menu szybkiego zakupu od teraz pokazują pełny przedmiot, do którego się łączą, podczas przytrzymywania klawisza ALT.",
  "springcleaning22_ui_alt_items_ready": "Przytrzymanie klawisza Control przy klikaniu z klawiszem Alt na następujące przedmioty da znać twojej drużynie, że są gotowe, zamiast mówić im, by zebrali się w grupę: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight i Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Zwiększono liczbę wyświetlanych posiadanych znaków strażniczych podczas czasu strategicznego z 2 do 3. Można kupić do 3 znaków strażniczych na początku gry.",
  "springcleaning22_ui_guide_pregame": "Po wyborze bohatera sekcja rekomendowanych przedmiotów będzie wyświetlać pierwszą sekcję poradnika, jeśli poradnik nie zawiera sekcji o nazwie „Przedmioty startowe”.",
  "springcleaning22_ui_ward_planter": "Zaznaczenie znaków pokazuje teraz sojuszniczym graczom, widzom oraz sojuszniczym trenerom, kto je postawił.",
  "springcleaning22_ui_courier_home_button": "Przycisk sklepu głównego dla kuriera od teraz zwraca do schowka wszelkie posiadane przez niego przedmioty, gdy dotrze do bazy.",
  "springcleaning22_ui_combat_log_key": "Od teraz w opcjach można przypisać klawisz wywołujący rejestr rozgrywki.",
  "springcleaning22_ui_combat_log_right_align": "Od teraz rejestr rozgrywki jest wyrównany do prawej i nie nakłada się on już na elementy sterowania demem bohatera.",
  "springcleaning22_ui_combat_log_hud_flip": "Od teraz rejestr rozgrywki stosuje się do odwrócenia interfejsu (gdy minimapa jest po prawej stronie) i zostanie przeniesiony do lewej, kiedy ta opcja jest włączona.",
  "springcleaning22_ui_guide_apos": "Naprawiono błąd powodujący zamianę apostrofów w komentarzach do przedmiotów i umiejętności w poradnikach na znak &apos; i inne symbole HTML podczas zapisywania. Istniejące poradniki borykające się z tym problemem muszą zostać zaktualizowane ręcznie.",
  "springcleaning22_ui_vs_screen_widescreen": "Dostosowano wyświetlanie bohaterów na ekranie wstępnym dla proporcji ekranu 21:9 i szerszych.",
  "springcleaning22_ui_charms": "Naprawiono błąd powodujący, że interfejs talizmanów pokazywał nakładający się na siebie tekst, jeśli gracz miał przynajmniej 2 talizmany.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Naprawiono błąd w treningu ostatnich trafień powodujący, że rozpoczęcie gry przed pojawieniem się bohatera uniemożliwiało pojawianie się stworów.",
  "springcleaning22_ui_intro_scenes": "Sceny intra (np. debiuty bohaterów, arkanów i person) nie będą od teraz pokazywane graczom, którzy nie przeszli przez wprowadzenie dla nowych graczy.",
  "springcleaning22_cosmetics_illusion_skins": "Naprawiono błąd powodujący, że iluzje mogły nie kopiować poprawnie pewnych elementów przedmiotów ozdobnych.",
  "springcleaning22_cosmetics_cloth_stretch": "Naprawiono błąd powodujący, że materiał na pewnych modelach mógł niepoprawnie rozciągać się przez cały ekran.",
  "springcleaning22_cosmetics_underlord_immortal": "Wiekopomny przedmiot „Szmaragdowe Zniewolenie” dla Underlorda od teraz posiada niestandardowe efekty umiejętności, które zamieniają jego umiejętność ostateczną.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Efekty pocisków um. Shadow Poison dla wiekopomnego przedmiotu „Narzuta Ponurej Fasady” dla Shadow Demona mają od teraz poprawną orientację.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Wiekopomny przedmiot „Palący Cień” dla Wraith Kinga ma od teraz większy priorytet niż arkana podczas rzucania um. Wraithfire Blast.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Naprawiono efekty otoczenia wiekopomnego przedmiotu „Karwasze Jaskiniowego Światła” dla Earthshakera.",
  "springcleaning22_cosmetics_warlock_immortal": "Naprawiono niedziałające wcześniej efekty um. Shadow Word (wzmocnienia i negatywnego efektu) dla wiekopomnego przedmiotu „Cienisty Glif” dla Warlocka.",
  "springcleaning22_cosmetics_viper_immortal": "Naprawiono niedziałające wcześniej efekty obszarowe dla um. Nethertoxin dla wiekopomnego przedmiotu „Kolec Jadowy Złowrogiego Jaszczura” dla Vipera.",
  "springcleaning22_cosmetics_abaddon_vessel": "Przywrócono efekty um. Aphotic Shield zestawu „Ostrze Demonicznego Nosiciela” dla Abaddona.",
  "springcleaning22_cosmetics_tidehunder_belt": "Usunięto nieprawidłowe efekty cząsteczkowe zestawu „Groza z Głębin” dla Tidehuntera z miejsca na pas – były one przeznaczone na ramię.",
  "springcleaning22_cosmetics_faceless_incursion": "Naprawiono efekty otoczenia broni zestawu „Claszuremskie Wtargnięcie” dla Faceless Voida.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Aura um. Marksmanship dla arkanów Drow Ranger od teraz posiada niestandardowe efekty dla obu stylów.",
  "springcleaning22_cosmetics_rubick_dilemma": "Przywrócono efekty otoczenia zestawu „Pochodnia Dylematu Marionetki” dla Rubicka.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Animacja biegu przy zranieniu arkanów Techies od teraz odtwarza się z poprawną szybkością.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Dodano obsługę kolorów z klejnotów dla obiektów um. Sticky Bomb i Reactive Tazer dla arkanów Techiesów.",
  "springcleaning22_cosmetics_techies_icons": "Dodano brakujące ikony dla Rynku Społeczności Steam dla zestawów „Siedlisko Prochowych Sań”, „Arsenał Saperskiej Przebiegłości”, „Petardy i Pukawki” i „Marsz Prochowego Patrolu” dla Techiesów.",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Naprawiono animację dla Spoona z Techiesów w podglądzie teleportacji z założonym zestawem „Gruboskórny Wózek Prochu”.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Arkana Rubicka mają teraz niestandardowe efekty dla Sticky Bomb Techies zamiast efektu Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Naprawiono animację unieruchomienia Snapfire, przez co nie będzie ona zacinać się już na niepoprawnej sekwencji animacji.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Zestaw „Świetlista Zdobywczyni” dla Legion Commander oraz jego indywidualne przedmioty są od teraz zbywalne i wymienialne.",
  "springcleaning22_cosmetics_legion_commander_wind": "Dodano efekty wiatru do sztandarów z przedmiotu „Dziedzictwo Upadłego Legionu” i zestawu „Świetlista Zdobywczyni” niezależnie od tego, czy bronie arkanów są obecnie w ekwipunku.",
  "springcleaning22_perf_panorama_atlas": "Zaktualizowano silnik interfejsu Panorama, by wykorzystywał tzw. atlasowanie celem skuteczniejszej interakcji z kartą graficzną. Według naszych pomiarów zwiększyło to wydajność o 25–30% w przypadku nakładu pracy wykonywanego przez GPU do renderowania HUD-u i znacznie więcej w przypadku niektórych szczególnie skomplikowanych stron panelu głównego. Ta zmiana zwiększa również wydajność procesora podczas korzystania z Vulkana i powinna być szczególnie skuteczna dla komputerów Apple z procesorami M1.",
  "springcleaning22_perf_sand_king_particles": "Zaktualizowano efekty cząsteczkowe umiejętności Sand Storm celem poprawy wydajności.",
  "springcleaning22_perf_panorama_clears": "Zaktualizowano silnik interfejsu Panorama, by uniknąć niepotrzebnego renderowania niektórych obiektów, zmniejszając nakład pracy dla karty graficznej.",
  "springcleaning22_perf_scenesystem_threading": "Naprawiono błąd powodujący, że czasami używaliśmy mniej wątków, niż chcieliśmy do obliczeń wielowątkowych. Ta poprawka jest szczególnie przydatna dla urządzeń z procesorem mającym 4 lub mniej rdzeni.",
  "springcleaning22_perf_thread_affinity": "Naprawiono błąd, przez który nieprawidłowo ustawiane koligacje wątków mogły powodować wstrzymanie na niektórych urządzeniach.",
  "springcleaning22_perf_power_savings": "Dodano ostrzeżenie w oknie dialogowym ustawień obrazu wskazujące, czy komputer korzysta z trybu oszczędzania energii, co może wpływać na zmniejszoną wydajność.",
  "springcleaning22_perf_shop_tooltips": "Zwiększono wydajność dymków informacyjnych podczas przeglądania sklepu przedmiotów.",
  "springcleaning22_custom_games_overview_sort": "Zakładka informacji ogólnych w salonie gier – oprócz sortowania według liczby otwartych poczekalni – od teraz umożliwia również sortowanie według liczby obecnie aktywnych graczy.",
  "springcleaning22_custom_games_update": "Naprawiono problem niestandardowych gier z salonu gier Dota powodujący, że czasami nie wyświetlała się informacja o konieczności aktualizacji tych gier do chwili ponownej instalacji tych gier lub restartu klienta Steam.",
  "springcleaning22_custom_games_lobby_version": "Lista poczekalni w salonie gier Dota nie będzie już wyświetlać poczekalni, które nie odpowiadają wersji niestandardowej gry, która jest obecnie zainstalowana lub w inny sposób nie da się do nich dołączyć.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold jest teraz w stanie odfiltrowywać złoto otrzymane z run nagrody.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Zastąpiono relikwię dla Dazzle'a „Nałożenia negatywnych efektów na 4 bohaterów um. Bad Juju” relikwią „Obrażenia i leczenie od Bad Juju”.",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Zastąpiono relikwię dla Techies „Zabójstwa um. Remote Mines” relikwią \"Bomby przyklejone do bohaterów um. Sticky Bomb\".",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Zastąpiono relikwię dla Techies „Ogłuszenia um. Stasis Trap” relikwią „Rozbrojenia wielu bohaterów um. Reactive Tazer”.",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Zastąpiono relikwię dla Tinkera „Obrażenia od March of the Machines” relikwią „Obrażenia pochłonięte um. Defense Matrix”.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Zastąpiono relikwię dla Underlorda „Zabójstwa po Dark Rift” relikwią „Zabójstwa zdobyte przez sojuszników po um. Fiend's Gate”.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Zastąpiono relikwię dla Underlorda „Bohaterowie uratowani um. Dark Rift” relikwią „Dodatkowe obrażenia zadane z Atrophy Aura”.",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Naprawiono relikwię dla Omniknighta „Obrażenia sojuszników podczas Heavenly Grace”.",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Naprawiono relikwię dla Primal Beast „Zabójstwa wielu bohaterów przy użyciu Onslaught”.",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Zastąpiono wyzwanie bohatera dla Meepo „Obrażenia magiczne zadane bohaterom” wyzwaniem „Obrażenia pełne zadane bohaterom”.",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Zastąpiono wyzwanie bohatera dla Naga Siren „Bohaterowie uleczeni podczas Song of the Siren”  wyzwaniem „Obrażenia zadane bohaterom przy użyciu Mana Burn”.",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Zastąpiono wyzwanie bohatera dla Tinkera „Obrażenia od March of the Machines” wyzwaniem „Obrażenia pochłonięte um. Defense Matrix”.",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Zastąpiono wyzwanie bohatera dla Techies „Zabójstwa um. Remote Mines” wyzwaniem \"Bomby przyklejone do bohaterów um. Sticky Bomb\".",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Zastąpiono wyzwanie bohatera dla Underlorda „Teleportacja wielu bohaterów przy użyciu Dark Rift” wyzwaniem „Zabójstwa dokonane przez sojuszników po użyciu Fiend's Gate”.",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Zaktualizowano wyzwanie bohatera dla Grimstroke'a „Obrażenia zadane wrogom pod wpływem Soul Bind”  – wliczają się w nie teraz obrażenia od sojuszników.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Zaktualizowano wyzwanie bohatera dla Mirany „Obrażenia zadane podczas Leap” – wliczają się w nie teraz wszystkie typy obrażeń zamiast wyłącznie fizycznych.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Naprawiono wyzwanie bohatera dla Bane'a „Kombinacje Blink/Force Staff i Fiend's Grip”.",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Naprawiono wyzwanie bohatera dla Dragon Knighta „Zabójstwa podczas Dragon Form”.",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Naprawiono wyzwanie bohatera dla Drow Ranger „Uciszenie więcej niż 2 wrogów przy użyciu Gust”.",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Naprawiono wyzwanie bohatera dla Crystal Maiden „Zabójstwa stworów przy użyciu Frostbite”.",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Naprawiono wyzwanie bohatera dla Dark Seera „Obrażenia zadane podczas Surge”.",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Naprawiono wyzwanie bohatera dla Lifestealera „Obrażenia zadane podczas Rage”.",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Naprawiono wyzwanie bohatera dla Lone Druida „Obrażenia zadane podczas True Form”.",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Naprawiono wyzwanie bohatera dla Marsa „Obrażenia zadane wrogim bohaterom”.",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Naprawiono wyzwanie bohatera dla Marsa „Zabójstwa wrogich jednostek przy użyciu rozpłatania”.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Naprawiono wyzwanie bohatera dla Omniknighta „Obrażenia zadane podczas Heavenly Grace”.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Naprawiono wyzwanie bohatera dla Omniknighta „Długość działania Heavenly Grace na sojuszników”.",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Naprawiono wyzwanie bohatera dla Rubicka „Ogłuszenia wielu bohaterów przy użyciu Telekinesis”.",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Naprawiono wyzwanie bohatera dla Tinkera „Obrażenia zadane bohaterom przy użyciu Lasera ulepszonego za pomocą Aghanim's Scepter”.",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Naprawiono wyzwanie bohatera dla Tuska „Kombinacje Walrus Kick i Walrus PUNCH!”.",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Usunięto wyzwanie bohatera dla Venomancera „Obrażenia zadane bohaterom złamanym przez Silver Edge”.",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Usunięto wyzwanie bohatera dla Tinkera „Zabójstwa stworów przy użyciu March of the Machines”.",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Dodano wyzwanie bohatera dla Underlorda „Obrażenia zadane bohaterom przy użyciu Firestorm”.",
  "springcleaning22_workshop_modeldoc": "Narzędzia warsztatu Dota dla przedmiotów i niestandardowych gier zostały ulepszone, aby wykorzystywać nowy edytor modeli „ModelDoc”. Współtwórcy w warsztacie powinni przenieść modele ze starego narzędzia, które zostanie usunięte w nadchodzącej aktualizacji."
}