// 4690.js

{
  "language": "portuguese",
  "springcleaning22_desc": "A atualização de Limpeza de Primavera de 2022 chegou para corrigir um monte de bugs e implementar uma mão-cheia de melhorias. Dá uma olhada a algumas das maiores alterações — como melhorias às descrições do Aghanim's Scepter e do Aghanim's Shard, aos controlos para silenciar jogadores, à pesquisa na loja e ao modo de teste de heróis — e depois lê abaixo a lista detalhada de correções e ajustes de jogabilidade.",
  "springcleaning22_aghs_tooltips": "Descrições de efeitos de Aghanim's Scepter e Shard",
  "springcleaning22_aghs_tooltips_desc": "As maquinações (e o monólogo) da mente de Aghanim estão indiscutivelmente para além da compreensão dos mortais. Contudo, com a atualização de hoje, o impacto no campo de batalha dos seus magníficos Scepters e Shards foi revelado de forma inédita. As descrições dos melhoramentos de Aghanim's Scepter/Shard agora incluem mais detalhes sobre os valores que mudam quando equipados. Habilidades modificadas também incluem estas informações numa secção dedicada. As descrições de muitos melhoramentos também receberam atenção especial e foram simplificadas para que as nossas mentes mortais as possam entender melhor.",
  "springcleaning22_muting_ui": "Melhores opções de silenciamento",
  "springcleaning22_muting_ui_desc": "Os jogadores de Dota podem ser extremamente expressivos e, às vezes, as emoções erradas tornam-se dominantes no calor da competição. Em casos em que o comportamento de certos jogadores se torna perturbador, é importante ter formas simples e rápidas de os silenciar e denunciar para que a situação possa ser investigada sem perturbar ainda mais a partida. Para esse fim, agora vai ser possível silenciar voz, silenciar texto e denunciar um jogador com um só clique. Também será possível clicar com o botão direito do rato para silenciar texto e voz em separado, para casos em que o comportamento de um jogador não é perturbador, mas as suas comunicações são indesejadas. Para um melhor controlo, agora também existem novos botões para silenciar toda uma equipa com um só clique.\\n\\nTambém estamos a aproveitar esta oportunidade para reavaliar a forma como lidamos com denúncias de comunicação. O nosso objetivo é tornar fácil e rápido o silenciamento de jogadores perturbadores enquanto ficamos com uma ideia clara do tipo de jogadores sobre os quais teremos de tomar medidas mais pesadas.",
  "springcleaning22_demo_hero": "Melhoramentos ao modo de teste de heróis",
  "springcleaning22_demo_hero_desc": "Queres testar as estratégias mais recentes ou criar as tuas próprias? Ou talvez tenhas só uma vontade enorme de ver quantos Axes consegues chacinar com um só golpe da Tidebringer? Seja como for, estás com sorte! O modo de teste de heróis foi atualizado e inclui todo um leque de novas funcionalidades:",
  "springcleaning22_demo_hero_map": "A zona norte do mapa foi expandida para ter mais espaço para testes.",
  "springcleaning22_demo_hero_hero_spawn": "Foram adicionados botões para colocar facilmente heróis aliados no mapa, para além de heróis inimigos.",
  "springcleaning22_demo_hero_hero_reset": "Foi adicionado um botão para repor o nível de um herói para nível 1.",
  "springcleaning22_demo_hero_hero_remove": "Foi adicionado um botão para remover um herói para quando quiseres parar de o testar.",
  "springcleaning22_demo_hero_hero_select": "Criar um herói novo irá adicioná-lo à tua seleção atual.",
  "springcleaning22_demo_hero_levelling": "Os botões para subir de nível, adicionar Aghanim's Scepter, adicionar Aghanim's Shard e controlar a invencibilidade agora aplicam-se a todos os heróis selecionados no momento.",
  "springcleaning22_demo_creep_toggle": "Agora, ao usar a opção para desativar creeps, todos os creeps básicos existentes serão destruídos.",
  "springcleaning22_demo_creep_spawn": "Foi adicionado um botão para colocar um único grupo de creeps em cada lado.",
  "springcleaning22_demo_hero_runes": "Foram adicionados botões para colocar as 6 runas principais no mapa.",
  "springcleaning22_shop_search": "Atualização da pesquisa na loja",
  "springcleaning22_shop_search_desc": "Gastar ouro devia ser fácil, divertido e, acima de tudo, eficiente. Então, para ajudarmos as tuas compras a resultarem menos em \"meep merp\" e mais em \"golpes finais\", a pesquisa de itens na loja foi melhorada com uma melhor interpretação de palavras-chave — incluindo um destaque para atributos pesquisados. Basta pesquisar por certos termos (por exemplo, \"armadura\", \"Força\", \"alcance\", etc.) para destacar os atributos nos quais estás interessado. Escolher o item perfeito para o plano perfeito nunca foi tão fácil. Só precisas é de ter ouro.",
  "springcleaning22_item_tooltips": "Descrições de itens detalhadas",
  "springcleaning22_item_tooltips_desc": "Estás sempre a esquecer-te de quanta mana aquela Inteligência concede? Ou quanta armadura recebes da Agilidade? Não te preocupes: agora, basta manter premida a tecla ALT enquanto tens a descrição do item aberta para veres em detalhe essas propriedades sobre todos os teus atributos.",
  "springcleaning22_colored_ability_damage": "Cores para o dano de habilidades",
  "springcleaning22_colored_ability_damage_desc": "Para fazeres boas escolhas no campo de batalha, tens de estar consciente dos desafios à tua frente. Para te ajudarmos a identificar os possíveis perigos, o dano causado por habilidades e itens tem agora uma cor específica de acordo com o tipo de dano: físico, mágico ou puro.",
  "springcleaning22_pluralized_strings": "Melhor integração de regras de pluralização",
  "springcleaning22_pluralized_strings_desc": "Para melhorar a acessibilidade um pouco por todo o mundo, adicionámos funcionalidades que permitem ter em conta as regras de pluralização de vários idiomas e atualizámos mais de 400 linhas de texto para acomodar estas mudanças.",
  "springcleaning22_permanent_debuffs": "Buffs permanentes",
  "springcleaning22_permanent_debuffs_desc": "É difícil ter uma estratégia sem compreender a eficácia das tuas ações. Para disponibilizar mais informações depois de uma partida, o menu pós-partida irá agora mostrar o número de vítimas de Reaper's Scythe (Necrophos) e de Culling Blade (Axe).",
  "springcleaning22_post_game_sortable": "Detalhes pós-partida organizáveis",
  "springcleaning22_post_game_sortable_desc": "Queres ir mais a fundo nos detalhes das tuas vitórias? Agora, as informações na tabela pós-partida podem ser organizadas para facilitar a tua análise.",
  "springcleaning22_gameplay_tp_boots": "O item Boots of Travel é agora menos propenso a selecionar um creep quando usado dentro do alcance de uma torre.",
  "springcleaning22_gameplay_sellback": "Os jogadores podem agora vender um item e receber o valor completo durante os primeiros 30 segundos após o início da partida, em vez do período normal de 10 segundos.",
  "springcleaning22_gameplay_lifestealer_consume": "A habilidade Consume do Lifestealer agora usa a mesma tecla de atalho que Infest, independentemente do tipo da unidade infestada.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "O creep Ogre Bruiser agora tem efeitos de som para a animação pré-ataque e para o atordoamento.",
  "springcleaning22_gameplay_neutral_aura_radius": "Todas as auras de creeps neutros agora mostram o raio ao passar o cursor por cima.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Os itens Wraith Band/Null Talisman/Bracer agora atualizam os seus bónus na descrição quando passam a ter o dobro do valor a partir do 25.º minuto.",
  "springcleaning22_gameplay_heal_overhead": "Foram corrigidos vários casos em que os valores de vida curada mostrados na unidade não tinham em conta o atributo de amplificação de cura.",
  "springcleaning22_gameplay_fountain_invuln": "Jogadores com o buff de invulnerabilidade da fonte já não vão atacar automaticamente e perder o efeito se um inimigo estiver ao seu alcance.",
  "springcleaning22_gameplay_blink_range": "O indicador de alcance do item Blink Dagger e das suas variantes irá agora ter em conta bónus de alcance de uso.",
  "springcleaning22_gameplay_desolator_tooltip": "Foi esclarecida a descrição do efeito passivo \"Soul Stealer\" do item Desolator. O item ganha um bónus de dano de ataque sempre que um inimigo morrer enquanto sob o efeito do debuff do efeito passivo \"Corruption\" do item.",
  "springcleaning22_gameplay_ardm_stash": "Foi corrigido um bug no modo Deathmatch Aleatório em que se um estafeta devolvesse um item à arca de um jogador morto, isso podia fazer com que o item desaparecesse.",
  "springcleaning22_gameplay_neutral_items_lock": "Já não é possível usar a opção para impedir a combinação de itens neutros. Isto corrige um bug que impedia estafetas de entregar itens neutros com combinação impedida.",
  "springcleaning22_gameplay_illusion_modifiers": "Foi corrigido um bug que fazia com que ilusões com modificadores duplicados tivessem durações incorretas, o que permitia identificar facilmente o herói verdadeiro.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Foi corrigido um bug no Modo Turbo e no Modo para Novatos que fazia com que algumas fontes de ouro usassem valores indevidos.",
  "springcleaning22_gameplay_turbo_courier": "Foi corrigido um bug no Modo Turbo em que o estafeta de um jogador deixava de funcionar se o jogador saísse da partida durante a seleção de heróis ou a fase de estratégia.",
  "springcleaning22_gameplay_zero_tooltips": "Foi corrigido um bug que fazia com que algumas descrições com valores modificados por talentos mostrassem o número 0 em vez do valor correto.",
  "springcleaning22_gameplay_euls_invulnerable": "Usar Eul's Scepter em clones imunes a magia irá agora aplicar o seu efeito corretamente no clone, em vez de simplesmente entrar em cooldown.",
  "springcleaning22_gameplay_kobold_aura": "A habilidade Prospecting Aura do creep Kobold já não se aplica a creeps heróis (como o Spirit Bear do Lone Druid, por exemplo). Isto corrige um bug que resultava no dobro do efeito.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Clones e Tempest Doubles agora recebem corretamente os bónus de atributos vindos de bênçãos de Aghanim's Scepter concedidos pelo Alchemist.",
  "springcleaning22_gameplay_chen_hand_of_god": "A habilidade Hand of God do Chen agora aplica corretamente a cura por segundo a creeps controlados por Chen, não apenas a cura inicial.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "A penalidade de dano de ataque do Tempest Double do Arc Warden agora tem em conta a reincarnação do Arc Warden.",
  "springcleaning22_gameplay_arc_warden_basher": "Foi adicionada uma descrição a esclarecer que clones e Tempest Doubles não beneficiam do efeito Bash dos itens Skull Basher e Abyssal Blade.",
  "springcleaning22_gameplay_arc_warden_blink": "O item Blink Dagger já não entra em cooldown quando um Tempest Double do Arc Warden é invocado.",
  "springcleaning22_gameplay_arc_warden_wards": "O Tempest Double do Arc Warden já não pode receber wards partilhadas.",
  "springcleaning22_gameplay_pa_scepter_double": "O melhoramento do Aghanim's Scepter da Phantom Assassin já não cancela o cooldown de Blur ao matar um Tempest Double.",
  "springcleaning22_gameplay_naga_siren_riptide": "O talento da Naga Siren \"Rip Tide: -1 ao n.º de ataques necessários\" agora remove corretamente 1, não 2.",
  "springcleaning22_gameplay_legion_commander_duel": "O bónus de dano da habilidade Duel da Legion Commander é agora concedido mesmo se o vencedor estiver invulnerável.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "A habilidade Walrus Kick do Tusk agora tem o cooldown correto (12 segundos).",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "A habilidade Metamorphosis do Terrorblade agora tem a duração correta (35/40/45/50 segundos).",
  "springcleaning22_gameplay_monkey_king_arena": "A habilidade Tree Dance do Monkey King já não permite escapar de Arena of Blood.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "No modo Seleção de Habilidades, os efeitos da habilidade Rip Tide da Naga Siren serão agora reproduzidos no herói correto, em vez de sempre na Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "O Riki pode agora usar Smoke Screen durante a concentração de Tricks of Trade sem a interromper mesmo se a opção \"Parar habilidades de concentração só com ordem\" estiver ativa.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Foi corrigida a interação da habilidade Dispose da Marci com os itens Black King Bar e Lotus Orb.",
  "springcleaning22_gameplay_sniper_grenade_icon": "A habilidade Concussive Grenade do Sniper agora adiciona um ícone de desarme por cima da vítima.",
  "springcleaning22_gameplay_morphling_spirit_link": "O Morphling já não fica permanentemente com a habilidade passiva Spirit Link quando se transforma no Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Foi adicionado um ícone de concentração à habilidade Fiend's Gate do Underlord.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Foi adicionada uma descrição ao debuff da habilidade Icefire Bomb (do creep Ancient Ice Shaman).",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Os efeitos de partículas da habilidade Cursed Crown (da Dark Willow) com Aghanim's Shard agora seguem os tempos corretos.",
  "springcleaning22_gameplay_lone_druid_midas": "Usar Hand of Midas no Spirit Bear do Lone Druid agora concede experiência ao herói que o estiver a controlar.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "O Spirit Bear e Tempest Doubles podem agora ganhar cargas de Magic Stick, Magic Wand e Holy Locket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "A descrição da habilidade Astral Step do Void Spirit agora mostra corretamente os valores de amplificação de feitiços enquanto a tecla Alt estiver premida.",
  "springcleaning22_gameplay_heavenly_jump_range": "A habilidade Heavenly Jump do Zeus agora mostra o seu alcance ao passar o cursor.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Foram corrigidas as descrições da habilidade Arcane Aura da Crystal Maiden.",
  "springcleaning22_gameplay_hex_tooltip": "Foi corrigido um erro na descrição da habilidade Hex do Shadow Shaman, que adicionava 1 segundo à duração se o talento \"Hex desativa efeitos passivos\" tivesse sido selecionado.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Foi corrigido um bug em que o cooldown na descrição da habilidade Borrowed Time (do Abaddon) não era atualizado depois de selecionar o talento de nível 20 \"Borrowed Time: -8s ao cooldown\".",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "A habilidade Presence of the Dark Lord do Shadow Fiend foi corrigida para funcionar corretamente contra creeps neutros.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Foi corrigida a interação da habilidade Warp Flare, do Tinker, com o Roshan.",
  "springcleaning22_gameplay_ability_draft_wukong": "No modo Seleção de Habilidades, foi corrigido um bug que impedia os clones da habilidade Wukong's Command de terem as habilidades corretas.",
  "springcleaning22_rubick_illusions": "Foi corrigido um bug que impedia ilusões do Rubick de ter as animações corretas com base nos feitiços roubados (como Fiend's Grip do Bane + Aghanim's Scepter, por exemplo).",
  "springcleaning22_rubick_hunter_in_the_night": "A habilidade Hunter in the Night pode agora ser roubada quando melhorada por Aghanim's Shard.",
  "springcleaning22_rubick_juxtapose": "A habilidade Juxtapose pode agora ser roubada quando melhorada por Aghanim's Scepter.",
  "springcleaning22_rubick_fireball": "A habilidade Fireball do Dragon Knight pode agora ser roubada independentemente da Dragon Form e não é concedida automaticamente.",
  "springcleaning22_rubick_wolf_bite": "A habilidade Wolf Bite agora funciona quando roubada.",
  "springcleaning22_rubick_depth_shroud": "A habilidade Depth Shroud agora funciona quando roubada.",
  "springcleaning22_rubick_astral_spirit": "Foi removida a habilidade de movimento separada do Astral Spirit quando roubada. O Rubick pode agora manter ambos os espaços de feitiços ao roubar esta habilidade.",
  "springcleaning22_rubick_reverse_time_walk": "A habilidade Reverse Time Walk agora é trocada para o mesmo espaço de Time Walk se o Rubick tiver Aghanim's Shard. O Rubick pode agora manter ambos os espaços de feitiços ao roubar esta habilidade.",
  "springcleaning22_rubick_jaunt": "A habilidade Jaunt agora é trocada para o mesmo espaço de Illusory Orb. O Rubick pode agora manter ambos os espaços de feitiços ao roubar esta habilidade.",
  "springcleaning22_rubick_eject": "A habilidade Eject agora é trocada para o mesmo espaço de Dismember se o Rubick tiver Aghanim's Shard. O Rubick pode agora manter ambos os espaços de feitiços ao roubar esta habilidade.",
  "springcleaning22_rubick_dismember": "A habilidade Dismember agora ejeta o herói aliado se outra habilidade for roubada no seu lugar.",
  "springcleaning22_rubick_spit_out": "A habilidade Spit Out agora é trocada para o mesmo espaço de Gobble Up. O Rubick pode agora manter ambos os espaços de feitiços ao roubar esta habilidade.",
  "springcleaning22_rubick_decoy": "Roubar a habilidade Decoy já não rouba também Bushwhack. Decoy aplica mesmo assim Bushwhack quando usada.",
  "springcleaning22_rubick_spirits": "Roubar a habilidade Spirits, do Io, agora funciona corretamente com Aghanim's Scepter.",
  "springcleaning22_rubick_gravekeepers_cloak": "A habilidade Gravekeeper's Cloak pode agora ser roubada quando melhorada por Aghanim's Scepter.",
  "springcleaning22_rubick_shard_cursed_crown": "Se o Rubick tiver Aghanim's Shard, a habilidade Cursed Crown irá agora também criar arbustos espinhosos.",
  "springcleaning22_rubick_shard_venomous_gale": "Se o Rubick tiver Aghanim's Shard, a habilidade Venomous Gale irá agora também criar Plague Wards.",
  "springcleaning22_rubick_shard_sprout": "Se o Rubick tiver Aghanim's Shard, a habilidade Sprout irá agora também criar Treants.",
  "springcleaning22_rubick_shard_shackles": "Se o Rubick tiver Aghanim's Shard, a habilidade Shackles irá agora também criar Serpent Wards.",
  "springcleaning22_rubick_shard_cold_embrace": "Se o Rubick tiver Aghanim's Shard, a habilidade Cold Embrace irá agora também criar uma instância de Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "Se o Rubick tiver Aghanim's Shard, a habilidade Earthshock irá agora também aplicar Enrage.",
  "springcleaning22_rubick_shard_shadow_step": "Se o Rubick tiver Aghanim's Shard, a habilidade Shadow Step irá agora também lançar um punhal de Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "Se o Rubick tiver Aghanim's Scepter, a habilidade Terror Wave irá agora também aplicar Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "Se o Rubick tiver Aghanim's Shard, a habilidade Homing Missile irá agora também disparar uma rajada de rockets como a de Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Se o Rubick tiver Aghanim's Shard, a habilidade Slithereen Crush irá agora também aplicar Corrosive Haze.",
  "springcleaning22_rubick_scepter_flak_cannon": "Se o Rubick tiver Aghanim's Scepter, a habilidade Flak Cannon irá agora também adicionar o canhão lateral.",
  "springcleaning22_rubick_scepter_time_walk": "Se o Rubick tiver Aghanim's Scepter, a habilidade Time Walk irá agora também aplicar Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Se o Rubick tiver Aghanim's Scepter, a habilidade Shuriken Toss irá agora também aplicar Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Se o Rubick tiver Aghanim's Scepter, a habilidade Sacred Arrow irá agora também aplicar Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "Agora, só existe um modo de uso rápido de habilidades por vetor (habilidades que de outra forma podem ser usadas ao clicar e arrastar): o vetor começa ao manter pressionada a tecla de atalho da habilidade e termina ao largar a tecla.",
  "springcleaning22_ui_ward_bounty": "O evento de combate ao matar uma Observer Ward agora mostra quem recebeu a recompensa se essa pessoa não tiver sido a responsável pela morte.",
  "springcleaning22_ui_spectator_hud_player_view": "A interface de espectador agora mostra corretamente o jogador que estás a ver.",
  "springcleaning22_ui_post_game_scepter_shard": "As descrições acerca de Aghanim's Scepter e Shard agora mostram os respetivos efeitos na tabela pós-partida.",
  "springcleaning22_ui_post_game_backpack_neutral": "Itens neutros e da mochila agora aparecem nos detalhes de heróis no menu pós-partida.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Os valores do atributo de roubo de vida por habilidades em heróis e creeps agora aparecem em separado enquanto manténs premida a tecla ALT.",
  "springcleaning22_ui_skeleton_warrior_rally": "A aura da habilidade Rally (do creep Skeleton Warrior) corresponde agora a um único buff com um número em vez de vários ícones de buffs individuais.",
  "springcleaning22_ui_neutral_item_teleport": "Foi corrigido um bug que fazia com que trocar de item neutro e teletransportar um deles demasiado rápido resultasse no teletransporte do item errado.",
  "springcleaning22_ui_spectator_arcana": "Interfaces relacionadas com itens Arcanos já não aparecem em partidas de ligas no modo de espectador.",
  "springcleaning22_ui_ready_check_enter": "É agora possível pressionar ENTER para confirmares que estás pronto.",
  "springcleaning22_ui_alt_item_combine": "Itens no menu de compra rápida agora mostram o item completo do qual são componentes se manteres premida a tecla ALT.",
  "springcleaning22_ui_alt_items_ready": "Manter a tecla Ctrl premida enquanto fazes Alt+clique nos seguintes itens irá dizer à tua equipa que estão prontos, em vez de pedir para se reunirem: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pip of Insight e Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "O número de Sentry Wards mostradas durante a fase de estratégia foi aumentado de 2 para 3. Há um máximo de 3 Sentry Wards que podem ser compradas no início da partida. ",
  "springcleaning22_ui_guide_pregame": "Depois de selecionar um herói, a secção de itens recomendados irá mostrar a primeira secção de um guia se o guia não tiver secções chamadas \"Itens iniciais\".",
  "springcleaning22_ui_ward_planter": "Selecionar wards agora mostra aos jogadores aliados, aos espectadores e aos treinadores aliados quem é que as colocou.",
  "springcleaning22_ui_courier_home_button": "O botão \"Loja Principal\" do estafeta agora também devolve qualquer item que tiver à arca assim que chegar à base.",
  "springcleaning22_ui_combat_log_key": "O histórico de combate agora pode ser associado a uma tecla nas opções.",
  "springcleaning22_ui_combat_log_right_align": "O histórico de combate está agora alinhado à direita e já não tapa o painel de controlo do modo de teste de heróis.",
  "springcleaning22_ui_combat_log_hud_flip": "O histórico de combate agora respeita a inversão da interface (minimapa à direita) e irá aparecer do lado esquerdo se esta opção for ativada.",
  "springcleaning22_ui_guide_apos": "Foi corrigido um bug que fazia com que comentários sobre itens/habilidades em guias aparecessem com \"&apos;\" em vez de apóstrofes depois de guardados. Qualquer guia com este problema que já tenha sido guardado terá de ser atualizado manualmente.",
  "springcleaning22_ui_vs_screen_widescreen": "Foi ajustada a apresentação de heróis no Ecrã Versus em monitores de formato 21:9 ou superior.",
  "springcleaning22_ui_charms": "Foi corrigido um problema de apresentação de texto em interface de amuletos se tivesses 2 ou mais amuletos.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Foi corrigido um bug no Treino de Golpes Finais em que clicar em \"Começar\" antes de o teu herói aparecer fazia com que os creeps não aparecessem.",
  "springcleaning22_ui_intro_scenes": "Introduções (como os de estreias de heróis, conjuntos Arcanos e Personas) já não vão aparecer para jogadores que ainda não concluíram a fase inicial de experiência para novos utilizadores.",
  "springcleaning22_cosmetics_illusion_skins": "Foi corrigido um bug que fazia com que ilusões não herdassem as skins de certos modelos cosméticos corretamente.",
  "springcleaning22_cosmetics_cloth_stretch": "Foi corrigido um bug que fazia com que tecidos de certos modelos fossem esticados incorretamente pelo ecrã.",
  "springcleaning22_cosmetics_underlord_immortal": "O item Imortal do Underlord \"Emerald Subjugation\" agora tem efeitos visuais exclusivos que substituem os do Ultimate.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Os efeitos visuais do projétil de Shadow Poison do item Imortal do Shadow Demon \"Mantle of Grim Facade\" têm agora a orientação correta.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Os efeitos visuais do item Imortal do Wraith King \"Blistering Shade\" têm agora uma maior prioridade sobre o conjunto Arcano ao usar \"Wraithfire Blast\".",
  "springcleaning22_cosmetics_earthshaker_immortal": "Foram corrigidos os efeitos ambiente do item Imortal do Earthshaker \"Bracers of the Cavern Luminar\".",
  "springcleaning22_cosmetics_warlock_immortal": "Foram corrigidos os efeitos visuais de Shadow Word (buff e debuff) concedidos pelo item Imortal do Warlock \"Umbral Glyph\".",
  "springcleaning22_cosmetics_viper_immortal": "Foram corrigidos os efeitos de partículas de Nethertoxin concedidos pelo item Imortal do Viper \"Malefic Drake's Strike\".",
  "springcleaning22_cosmetics_abaddon_vessel": "Foram restaurados os efeitos visuais de Aphotic Shield concedidos pelo item do Abaddon \"Blade of the Demonic Vessel\".",
  "springcleaning22_cosmetics_tidehunder_belt": "O item do Tidehunter \"Horror From the Deep Belt\" foi corrigido para remover partículas incorretas situadas na área do cinto que deveriam estar no braço.",
  "springcleaning22_cosmetics_faceless_incursion": "Foram corrigidos os efeitos de ambiente da arma do conjunto do Faceless Void \"Claszureme Incursion\".",
  "springcleaning22_cosmetics_drow_arcana_aura": "O conjunto Arcano da Drow Ranger agora tem efeitos visuais exclusivos da aura de Marksmanship para ambos os estilos.",
  "springcleaning22_cosmetics_rubick_dilemma": "Foram restaurados os efeitos ambiente concedidos pelo item do Rubick \"Torch of Fantoccini's Dilemma\".",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "A animação \"Correr, Ferido\" do conjunto Arcano dos Techies tem agora a velocidade correta.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "A escolha de joias prismáticas no conjunto Arcano dos Techies irá agora refletir-se nas habilidades Sticky Bomb e Reactive Tazer.",
  "springcleaning22_cosmetics_techies_icons": "Foram adicionados os ícones devidos dos itens dos conjuntos dos Techies \"Powdersled Rookery\", \"Sapper's Guile\", \"Bombtrails and Boomsticks\" e \"March of the Powderkeg Patrol\".",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Foi corrigida a animação do Spoon na pré-visualização de teletransporte dos Techies com o conjunto \"Pachyderm Powderwagon\".",
  "springcleaning22_cosmetics_rubick_arcana_techies": "O item Arcano do Rubick agora tem efeitos visuais exclusivos para a habilidade Sticky Bomb (dos Techies) em vez de Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Foi corrigida a animação \"Incapacitado\" da Snapfire para que ela não fique presa numa sequência de animação incorreta.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "O conjunto da Legion Commander \"Radiant Conqueror\" e os respetivos itens podem agora ser trocados e vendidos no Mercado da Comunidade Steam.",
  "springcleaning22_cosmetics_legion_commander_wind": "Foram adicionados efeitos de vento aos estandartes dos conjuntos da Legion Commander \"Legacy of the Fallen\" e \"Radiant Conqueror\", com ou sem as armas Arcanas.",
  "springcleaning22_perf_panorama_atlas": "Foi atualizado o engine da interface Panorama para usar \"atlassing\" e interagir assim de uma forma mais eficiente com a GPU. De acordo com os nossos testes, isto resultou num desempenho 25-30% melhor da GPU para a interface e num desempenho muito maior numas páginas particularmente complicadas do painel principal. Esta alteração também aumentou o desempenho da CPU em Vulkan e deve ser também particularmente eficaz em computadores da Apple com processadores M1.",
  "springcleaning22_perf_sand_king_particles": "Foram otimizados os efeitos de partículas de \"Sand Storm\" para melhorar o desempenho.",
  "springcleaning22_perf_panorama_clears": "Foi atualizado o engine da interface Panorama para evitar limpezas desnecessárias de \"render targets\", reduzindo a carga na GPU.",
  "springcleaning22_perf_scenesystem_threading": "Foi corrigido um bug ocasional que fazia com que o jogo usasse menos threads do que o pretendido para tarefas que exigem vários threads. Esta correção é especialmente útil para computadores com pelo menos 4 cores.",
  "springcleaning22_perf_thread_affinity": "Foi corrigido um bug em que afinidades de threads definidas incorretamente poderiam levar a atrasos em certos sistemas.",
  "springcleaning22_perf_power_savings": "Foi adicionado um aviso ao menu de definições de vídeo para indicar se o computador está no modo de poupança de energia, o qual pode levar a um desempenho mais fraco.",
  "springcleaning22_perf_shop_tooltips": "Foi melhorado o desempenho de janelas de descrições ao navegar pela loja de itens.",
  "springcleaning22_custom_games_overview_sort": "A secção \"Visão geral\" da Arcade agora permite ordenar por jogadores ativos no momento, para além do número de lobbies abertos.",
  "springcleaning22_custom_games_update": "Foi corrigido um problema com modos customizados da Arcade, que por vezes indicavam que era necessária uma atualização até que voltassem a ser instalados ou até que o Steam fosse reiniciado.",
  "springcleaning22_custom_games_lobby_version": "A lista de lobbies da Arcade já não vai mostrar lobbies inacessíveis ou que não correspondem à versão do modo customizado que está instalado no momento.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold pode agora filtrar o ouro recebido de Runas de Recompensa.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "A relíquia do Dazzle \"Bad Jujus em 4 inimigos\" foi substituída por \"Dano e cura de Bad Juju\".",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "A relíquia dos Techies \"Mortos por Remote Mines\" foi substituída por \"Sticky Bombs presas em heróis\".",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "A relíquia dos Techies \"Stuns de Stasis Trap\" foi substituída por \"Desarmamentos de Reactive Tazer em vários heróis\".",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "A relíquia do Tinker \"Dano de March of the Machines\" foi substituída por \"Dano absorvido por Defense Matrix\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "A relíquia do Underlord \"Mortos após usar Dark Rift\" foi substituída por \"Mortos por aliados após Fiend's Gate\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "A relíquia do Underlord \"Heróis salvos por Dark Rift\" foi substituída por \"Dano adicional causado com Atrophy Aura\".",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Foi corrigida a relíquia do Omniknight \"Dano de aliados durante Heavenly Grace\".",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Foi corrigida a relíquia do Primal Beast \"Onslaughts em vários heróis\".",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "O desafio de herói do Meepo \"Causa dano mágico a heróis\" foi substituído por \"Causa dano puro a heróis\".",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "O desafio de herói da Naga Siren \"Cura heróis com Song of the Siren\" foi substituído por \"Queima mana a heróis inimigos\".",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "O desafio de herói do Tinker \"Causa dano com March of the Machines\" foi substituído por \"Absorve dano com Defense Matrix\".",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "O desafio de herói dos Techies \"Mata heróis inimigos com Remote Mines\" foi substituído por \"Prende Sticky Bombs a inimigos\".",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "O desafio de herói do Underlord \"Teletransporta-te para o local de vários aliados com Dark Rift\" foi substituída por \"Ajuda aliados a matar inimigos depois de usar Fiend's Gate\".",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "O desafio de herói do Grimstroke \"Causa dano a inimigos sob o efeito de Soulbind\" agora inclui dano causado por aliados.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "O desafio de herói da Mirana \"Causa dano a inimigos enquanto sob o efeito de Leap\" agora inclui todos os tipos de danos em vez de apenas dano físico.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Foi corrigido o desafio de herói do Bane \"Usa Fiend's Grip depois de usares Blink Dagger ou Force Staff\".",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Foi corrigido o desafio de herói do Dragon Knight \"Mata heróis inimigos durante o uso de Dragon Form\".",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Foi corrigido o desafio de herói da Drow Ranger \"Silencia 2 heróis inimigos ou mais com Gust\".",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Foi corrigido o desafio de herói da Crystal Maiden \"Mata creeps com Frostbite\".",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Foi corrigido o desafio de herói do Dark Seer \"Causa dano enquanto afetado por Surge\".",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Foi corrigido o desafio de herói do Lifestealer \"Causa dano enquanto sob o efeito de Rage\".",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Foi corrigido o desafio de herói do Lone Druid \"Causa dano durante o uso de True Form\".",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Foi corrigido o desafio de herói do Mars \"Causa dano a heróis inimigos\".",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Foi corrigido o desafio de herói do Mars \"Mata unidades inimigas com Cleave\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Foi corrigido o desafio de herói do Omniknight \"Causa dano enquanto sob o efeito de Heavenly Grace\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Foi corrigido o desafio de herói do Omniknight \"Aplica o efeito de Heavenly Grace em heróis aliados durante x/y/z segundos\".",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Foi corrigido o desafio de herói do Rubick \"Atordoa pelo menos 2 heróis inimigos durante um só uso de Telekinesis\".",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Foi corrigido o desafio de herói do Tinker \"Causa dano a heróis inimigos com Laser melhorado por Aghanim's Scepter\".",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Foi corrigido o desafio de herói do Tusk \"Acerta num herói inimigo com Walrus Kick e Walrus Punch em sucessão\".",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Foi removido o desafio de herói do Venomancer \"Causa dano a heróis inimigos cujas habilidades passivas tenham sido desativadas por Silver Edge\".",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Foi removido o desafio de herói do Tinker \"Mata creeps com March of the Machines\".",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Foi adicionado o desafio de herói do Underlord \"Causa dano a heróis com Firestorm\".",
  "springcleaning22_workshop_modeldoc": "As ferramentas do Workshop do Dota para itens e modos customizados foram melhoradas para usar o novo editor de modelos \"ModelDoc\". Contribuidores do Workshop devem migrar quaisquer modelos da ferramenta antiga, que será removida numa atualização futura."
}