// 4795.js

{
  "springcleaning22_desc": "Весняне прибирання Dota 2 вже тут і зосереджене на виправленні помилок і додаванні купи якісних змін, серед яких зокрема поліпшення порад Аґаніма, керування заглушуванням, пошуку в крамниці чи режим випробовування героя. Ви також можете проглянути великий перелік виправлень та ігроладних покращень нижче.",
  "springcleaning22_aghs_tooltips": "Підказки щодо скіпетра й уламка Аґаніма",
  "springcleaning22_aghs_tooltips_desc": "Смертні, безсумнівно, ніколи не збагнуть того, як працює хід думок (і внутрішній монолог) Аґаніма. Але сьогоднішнє оновлення проявляє вплив його скіпетрів та уламків на бойовище як ніколи раніше. Підказки щодо поліпшень Аґаніма, а також здібності, які зазнають впливу, містять ще більше точних даних про зміни. Багато поліпшень отримали особистий підхід у показі, щоби наші не налаштовані на чари розуми змогли легше сприймати інформацію про них.",
  "springcleaning22_muting_ui": "Поліпшення заглушування",
  "springcleaning22_muting_ui_desc": "Гравці в Dota 2 доволі гучні, і іноді неправильні емоції можуть вирватися в самісінькому розпалі матчу. Коли ці неприйнятні емоції заважають іншим, то важливо мати швидкий і простий спосіб заглушити гравців і надіслати скаргу для подальшого розгляду їхньої поведінки, при цьому не відриваючись від гри. Для цього тепер одним клацанням ви можете заглушити голос і заблокувати чат гравця, а також надіслати скаргу. Якщо клацнути правою кнопкою миші, то можна вибрати блокування окремо голосу й чату, якщо поведінка гравця хоч і небажана, проте не настільки неприйнятна. А якщо ви бажаєте ще більших можливостей, то ми додали кнопку приглушення всієї команди.\\n\\nОкрім вищезгаданих змін, ми хочемо скористатися цією нагодою й по-новому поглянути на наші способи опрацювання скарг про зловживання спілкуванням. Наша ціль — полегшити заглушення й блокування гравців із неприйнятною поведінкою та водночас додати спосіб вказувати на тих, до кого потрібно вжити жорсткіших заходів.",
  "springcleaning22_demo_hero": "Поліпшення для демо-героя",
  "springcleaning22_demo_hero_desc": "Хочете випробувати найновіші стратегії чи створити власну? Чи просто маєте непоборне бажання перевірити, скільки Сокирників може одним ударом вбити Погонич хвиль? В обох випадках вам пощастило! Режим демо-героя оновлено, і ось що можна перелічити серед новинок:",
  "springcleaning22_demo_hero_map": "Північну частину мапи розширено, щоби надати для випробувань більше рівної поверхні.",
  "springcleaning22_demo_hero_hero_spawn": "Додано кнопки для швидкого прикликання союзних героїв — на додачу до ворогів.",
  "springcleaning22_demo_hero_hero_reset": "Додано кнопку для скидання рівня героя до першого.",
  "springcleaning22_demo_hero_hero_remove": "Додано кнопку для вилучення героя після завершення тестування.",
  "springcleaning22_demo_hero_hero_select": "Створення нового героя додасть його до поточного вибору.",
  "springcleaning22_demo_hero_levelling": "Кнопки для збільшення рівня, додавання скіпетра чи уламка й перемикання режиму невразливості відтепер застосовують ці дії на всіх вибраних героїв.",
  "springcleaning22_demo_creep_toggle": "Прибирання кріпів знищує всіх поточних кріпів на лініях.",
  "springcleaning22_demo_creep_spawn": "Додано кнопку прикликання однієї хвилі кріпів від кожної сторони.",
  "springcleaning22_demo_hero_runes": "Додано кнопку прикликання 6 великих рун.",
  "springcleaning22_shop_search": "Поліпшений пошук у крамниці",
  "springcleaning22_shop_search_desc": "Витрачання золота завжди має бути легким, веселим і, найголовніше, дієвим. Тож щоби зробити ваше тринькання грошей менше «міповим» і більше «хітовим», ми розширили пошук у крамниці підтримкою ключових слів. Ба більше, пошукові слова складатимуться в окремі категорії. Просто напишіть «броня», «сила», «дальність» тощо, і ви побачите виділені характеристики з цими словами. Виберіть потрібну й отримаєте перелік предметів, які найліпше підходять вам. Вибір бездоганного предмета для бездоганного плану ще ніколи не був таким простим. Лишилося лишень назбирати золото.",
  "springcleaning22_item_tooltips": "Розширені підказки для предметів",
  "springcleaning22_item_tooltips_desc": "Забуваєте, скільки тої мани дається від збільшення інтелекту? Чи скільки броні дає спритність? Забудьте про здогадки — просто натисніть й утримуйте клавішу Alt під час перегляду підказки для предмета. Тепер ви бачитимете всі показники.",
  "springcleaning22_colored_ability_damage": "Кольорове позначення шкоди від здібностей",
  "springcleaning22_colored_ability_damage_desc": "Правильне рішення в битві залежить від знання викликів, що стоять перед вами. Для розуміння потенційної небезпеки ми додали кольорове позначення шкоди від заклять і предметів, яке вказуватиме на фізичну, магічну та абсолютну шкоду.",
  "springcleaning22_pluralized_strings": "Розширена підтримка мов із багатьма формами множини",
  "springcleaning22_pluralized_strings_desc": "Щоби поліпшити читабельність текстів, ми додали функції для кращої підтримки форм множини в багатьох мовах й оновили понад 400 рядків тексту, яких ці зміни торкнулися.",
  "springcleaning22_permanent_debuffs": "Постійні посилення",
  "springcleaning22_permanent_debuffs_desc": "Розробка стратегії — складна річ, якщо ви не розумієте свою дієвість. Тепер у післяматчевій таблиці можна буде побачити вбивства від Коси женця Некрофоса й Відбракування Сокирника.",
  "springcleaning22_post_game_sortable": "Сортування післяматчевих даних",
  "springcleaning22_post_game_sortable_desc": "Бажаєте зануритися глибше в подробиці своїх перемог? Щоби легше аналізувати дані, тепер їх можна сортувати в післяматчевій таблиці результатів.",
  "springcleaning22_gameplay_tp_boots": "Мандрівні черевики (Boots of Travel) з меншою ймовірністю влучать у кріпа, якщо чаклуються в області дії вежі.",
  "springcleaning22_gameplay_sellback": "Гравці тепер можуть продавати предмети за повну ціну протягом перших 30 секунд після початку матчу, а не протягом 10 секунд після придбання, як раніше.",
  "springcleaning22_gameplay_lifestealer_consume": "Пожирання (Consume) Життєкрада (Lifestealer) віднині застосовується тією ж гарячою клавішею, незалежно від типу зараженої істоти.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Огр-велет віднині має звукові ефекти для заряджання й приголомшення.",
  "springcleaning22_gameplay_neutral_aura_radius": "Аури всіх нейтральних кліпів тепер показують свою область дії, якщо на них навести вказівник.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Примарна маска (Wraith Band) / талісман ануляції (Null Talisman) / наручень (Bracer) тепер оновлюють свої бонуси до характеристик у підказках до здібності після подвоєння на 25-й хвилині.",
  "springcleaning22_gameplay_heal_overhead": "Виправлено багато випадків, коли числа в сповіщеннях про лікування не враховували вплив посилень.",
  "springcleaning22_gameplay_fountain_invuln": "Гравці з ефектом невразливості від фонтану більше не здатні автоматично атакувати та втрачають це посилення, коли ворог входить в область досяжності.",
  "springcleaning22_gameplay_blink_range": "Покажчик дальності дії закляття «Стрибок» та його варіацій тепер враховує посилення дальності чаклування.",
  "springcleaning22_gameplay_desolator_tooltip": "Виправлена підказка для пасивної здібності Викрадач душ (Soul Stealer) Спустошувача (Desolator). Спустошувач отримує збільшення шкоди від атаки щоразу, коли вражений ворог гине від іншої пасивної здібності Спотворення (Corruption).",
  "springcleaning22_gameplay_ardm_stash": "Виправлено помилку в режимі ARDM, внаслідок якої смерть кур’єра, який ніс предмет до сховку, спричиняла зникнення цього предмета.",
  "springcleaning22_gameplay_neutral_items_lock": "Комбінування нейтральних предметів більше не можна заблокувати. Це зроблено для того, щоби кур’єри могли безпроблемно доставляти подібні нейтральні предмети.",
  "springcleaning22_gameplay_illusion_modifiers": "Виправлено помилку, внаслідок якої ілюзії з подвоєними модифікаторами мали неправильну тривалість дії, що дозволяло визначити серед них справжнього героя.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Виправлено помилку в режимі нового гравця та турбо, внаслідок якої певні джерела золота неправильно масштабувалися.",
  "springcleaning22_gameplay_turbo_courier": "Виправлено помилку в режимі турбо, внаслідок якої кур’єр гравця міг більше не працювати, якщо гравець від’єднувався під час фази вибору героя або стратегічної стадії.",
  "springcleaning22_gameplay_zero_tooltips": "Виправлено помилку, внаслідок якої певні ігрові підказки, на які впливали таланти, показували 0 замість правильного значення.",
  "springcleaning22_gameplay_euls_invulnerable": "Чаклування скіпетра Еула (Eul's Scepter) на невразливих до чарів клонів тепер правильно застосовуватиме дію, а не просто переходитиме до зарядки.",
  "springcleaning22_gameplay_kobold_aura": "Аура розвідництва (Prospecting Aura) кобольда більше не застосовується на кріпів героїв на кшталт ведмедя Самітного Друїда (Lone Druid). Це виправляє помилку, внаслідок якої аура хибно давала подвійний ефект.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Благословення скіпетром Аґаніма (Aghanim's Scepter) від Алхіміка (Alchemist) тепер правильно дає бонуси до характеристик клонам і Буремним двійникам (Tempest Double).",
  "springcleaning22_gameplay_chen_hand_of_god": "Божа десниця (Hand of God) Чена (Chen) тепер правильно застосовує лікування з часом кріпам, яких контролює Чен, а не просто лікує.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Штраф атаки з відстані Буремного двійника (Tempest Double) Вартового (Arc Warden) тепер враховує перевтілення самого Вартового.",
  "springcleaning22_gameplay_arc_warden_basher": "Додано підказку, яка пояснює, що клони й Буремні двійники не можуть використовувати приголомшення Череполамом (Skull Basher) або Клинком безодні (Abyssal Blade).",
  "springcleaning22_gameplay_arc_warden_blink": "Застосування Стрибкового кинджала (Blink Dagger) на Буремному двійнику Вартового не переводить предмет у стан зарядки.",
  "springcleaning22_gameplay_arc_warden_wards": "Буремний двійник Вартового більше не отримуватиме уламки.",
  "springcleaning22_gameplay_pa_scepter_double": "Поліпшення скіпетра Аґаніма Фантомною Вбивцею (Phantom Assassin) більше не скидає тривалість Мари (Blur) після вбивства Буремного двійника.",
  "springcleaning22_gameplay_naga_siren_riptide": "Талант Наґи-Сирени (Naga Siren) «-1 атака для спрацювання Нищівного припливу (Rip Tide)» тепер правильно віднімає 1 атаку, а не 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Додаткова шкода від Дуелі (Duel) Командувачки Легіону (Legion Commander) тепер завдається навіть у тих випадках, коли переможець невразливий.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Здібність «Під зад» (Walrus Kick) Бивня (Tusk) тепер має правильний 12-секундний час зарядки.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Метаморфоза (Metamorphosis) Терора (Terrorblade) тепер має правильну тривалість: 35/40/45/50.",
  "springcleaning22_gameplay_monkey_king_arena": "Танок між дерев (Tree Dance) Мавпячого Короля (Monkey King) більше не дозволяє йому уникнути Кривавої арени (Arena of Blood).",
  "springcleaning22_gameplay_naga_siren_ability_draft": "У режимі Ability Draft Нищівний приплив Наґи-Сирени тепер діятиме на правильного героя, а не завжди на Наґу.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Рікі (Riki) тепер може застосовувати Димову завісу (Smoke Screen) без переривання чаклування Професійних хитрощів (Tricks of the Trade), навіть якщо ввімкнена «Зупинка здібностей, що чаклуються, окремою клавішею».",
  "springcleaning22_gameplay_marci_dispose_lotus": "Виправлено взаємодію Диспозиції (Dispose) Марсі (Marci) зі Сферою лотоса (Lotus Orb) й Посохом чорного короля (BKB).",
  "springcleaning22_gameplay_sniper_grenade_icon": "Фугасна граната (Concussive Grenade) Снайпера (Sniper) тепер показує позначку роззброєння над головою героя.",
  "springcleaning22_gameplay_morphling_spirit_link": "Пасивний ефект Духовного зв’язку (Spirit Link) більше не діє нескінченно, якщо Морфник (Morphling) стає Самотнім Друїдом.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Додано позначку чаклування Потойбічних врат (Fiend's Gate) Підземним Лордом (Underlord).",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Додано підказку для послаблення Криговогняної бомби (Icefire Bomb) Древнього кригошамана (Ancient Ice Shaman).",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Ефекти часточок уламкового поліпшення Заклятої корони (Cursed Crown) Темної Верби (Dark Willow) тепер показуються вчасно.",
  "springcleaning22_gameplay_lone_druid_midas": "Коли ведмідь-дух Самотнього Друїда використовує Руку Мідаса (Hand of Midas), то досвід дається герою, який ведмедем керує.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Ведмідь-дух і Буремний двійник тепер можуть використовувати заряди Чарівної палички (Magic Stick), Чарівного жезла (Magic Wand) та Святого медальйона (Holy Locket).",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Текст підказки для Астрального кроку (Astral Step) Порожнечого Духа (Void Spirit) тепер правильно показує посилені чарами значення під час утримання клавіші Alt.",
  "springcleaning22_gameplay_heavenly_jump_range": "Небесний стрибок (Heavenly Jump) Зевса (Zeus) тепер показує радіус дії за наведення вказівника.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Виправлені підказки для Чаклунської аури (Arcane Aura) Кришталевої Діви (Crystal Maiden).",
  "springcleaning22_gameplay_hex_tooltip": "Виправлено помилку, внаслідок якої підказка для Обернення (Hex) Шамана Тіней (Shadow Shaman) помилково додавала секунду до тривалості з вибраним талантом «Hex знімає ефекти пасивних здібностей».",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Виправлено помилку, внаслідок якої у підказці до таланту 20-го рівня Абаддона (Abaddon) не оновлювався час зарядки Позиченого часу (Borrowed Time).",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Виправлено помилку, внаслідок якої Присутність темного володаря (Presence of the Dark Lord) Тінистого Нелюда (Shadow Fiend) неправильно застосовувалася на нейтральних кріпах.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Віднині Спалах перенесення (Warp Flare) Механіка (Tinker) не працює на Рошані.",
  "springcleaning22_gameplay_ability_draft_wukong": "У режимі Ability Draft виправлено помилку, внаслідок якої клони Загону Укуна (Wukong's Command) не мали правильних здібностей.",
  "springcleaning22_rubick_illusions": "Виправлено помилку, внаслідок якої ілюзії Рубіка (Rubick) мали неправильну анімацію викрадених чарів на кшталт Демонічної хватки (Fiend's Girip) Губителя (Bane) зі скіпетром Аґаніма.",
  "springcleaning22_rubick_hunter_in_the_night": "Тепер здібність «Нічний мисливець» (Hunter in the Night) можна викрасти навіть з уламковим поліпшенням.",
  "springcleaning22_rubick_juxtapose": "Тепер здібність «Роздвоєння» (Juxtapose) можна викрасти навіть з уламковим поліпшенням.",
  "springcleaning22_rubick_fireball": "Тепер здібність «Вогняна куля» (Fireball) Лицаря-Дракона (Dragon Knight) можна викрасти окремо; викрадення Форми дракона (Dragon Form) не надає її автоматично.",
  "springcleaning22_rubick_wolf_bite": "Вовчий укус (Wolf Bite) тепер працює після викрадення.",
  "springcleaning22_rubick_depth_shroud": "Глибинний саван (Depth Shroud) тепер працює після викрадення.",
  "springcleaning22_rubick_astral_spirit": "Викрадений Астральний дух (Astral Spirit) не надає додаткову здібність переміщення. Це дає можливість Рубіку викрадати дві здібності.",
  "springcleaning22_rubick_reverse_time_walk": "Якщо Рубік має уламок Аґаніма, то зворотний Стрибок крізь час (Reverse Time Walk) тепер займає ланку зі звичайним Стрибком крізь час (Time Walk). Це дає можливість Рубіку викрадати дві здібності.",
  "springcleaning22_rubick_jaunt": "Безтілесне переміщення (Ethereal Jaunt) тепер займає ланку з Примарною сферою (Illusory Orb). Це дає можливість Рубіку викрадати дві здібності.",
  "springcleaning22_rubick_eject": "Якщо Рубік має уламок Аґаніма, то Звільнення (Eject) тепер займає ланку з Розчленуванням (Dismember). Це дає можливість Рубіку викрадати дві здібності.",
  "springcleaning22_rubick_dismember": "Рубік тепер випльовує союзного героя, якщо викрадає іншу здібність на місце Розчленування.",
  "springcleaning22_rubick_spit_out": "Випльовування (Spit Out) тепер займає ланку з Поглинанням (Gobble Up). Це дає можливість Рубіку викрадати дві здібності.",
  "springcleaning22_rubick_decoy": "Викрадання Приманки (Decoy) більше не викрадає Лісову засідку (Bushwhack), проте застосовує її ефект під час чаклування.",
  "springcleaning22_rubick_spirits": "Виправлено помилку, унаслідок якої у Рубіка зі скіпетром Аґаніма неправильно працювали викрадені Духи (Spirits) Іо.",
  "springcleaning22_rubick_gravekeepers_cloak": "Тепер здібність «Убрання могильника» (Gravekeeper's Cloak) можна викрасти навіть з уламковим поліпшенням.",
  "springcleaning22_rubick_shard_cursed_crown": "Чаклування Заклятої корони Рубіком з уламком Аґаніма тепер також створює Ожиновий лабіринт (Brambles).",
  "springcleaning22_rubick_shard_venomous_gale": "Чаклування Отруйного подиху (Venomous Gale) Рубіком з уламком Аґаніма тепер також створює Чумні варди (Plague Ward).",
  "springcleaning22_rubick_shard_sprout": "Чаклування Паростків (Sprout) Рубіком з уламком Аґаніма тепер також створює ентів.",
  "springcleaning22_rubick_shard_shackles": "Чаклування Пут (Shackles) Рубіком з уламком Аґаніма тепер також створює Ватагу змієвардів (Serpent Wards).",
  "springcleaning22_rubick_shard_cold_embrace": "Чаклування Крижаних обіймів (Cold Embrace) Рубіком з уламком Аґаніма тепер також чаклує Скалковий вибух (Splinter Blast).",
  "springcleaning22_rubick_shard_earthshock": "Чаклування Струсу землі (Earthshock) Рубіком з уламком Аґаніма тепер також застосовує Оскаженіння (Enrage).",
  "springcleaning22_rubick_shard_shadow_step": "Чаклування Тіньового кроку (Shadow Step) Рубіком з уламком Аґаніма тепер також застосовує Спектральний кинджал (Spectral Dagger).",
  "springcleaning22_rubick_shard_terror_wave": "Чаклування Хвилі страху (Terror Wave) Рубіком з уламком Аґаніма тепер також застосовує Метаморфозу (Metamorphosis).",
  "springcleaning22_rubick_shard_homing_missile": "Чаклування Самонавідної ракети (Homing Missile) Рубіком з уламком Аґаніма тепер також застосовує Загороджувальний вогонь (Rocket Barrage).",
  "springcleaning22_rubick_shard_slithereen_crush": "Чаклування Слизеринського сплеску (Slithereen Crush) Рубіком з уламком Аґаніма тепер також застосовує Ядучий серпанок (Corrosive Haze).",
  "springcleaning22_rubick_scepter_flak_cannon": "Чаклування Зенітки (Flak Cannon) Рубіком з уламком Аґаніма тепер також дає Бокову гармату (Side Gunner).",
  "springcleaning22_rubick_scepter_time_walk": "Чаклування Стрибку крізь час (Time Walk) Рубіком з уламком Аґаніма тепер також застосовує Часову пастку (Time Lock).",
  "springcleaning22_rubick_scepter_shiruken_toss": "Чаклування Кидка сюрикена (Shuriken Toss) Рубіком з уламком Аґаніма тепер також застосовує Цінаду (Jinada).",
  "springcleaning22_rubick_scepter_sacred_arrow": "Чаклування Священної стріли (Sacred Arrow) Рубіком з уламком Аґаніма тепер також застосовує Зорепад (Starstorm).",
  "springcleaning22_ui_quickcast_vector_targeting": "Векторне прицілювання для швидкого чаклування з натисканням клавіші тепер змінено, щоби векторна лінія почала промальовуватися під час натискання клавіші та закінчувала промальовування з відтисканням. Подібне використовується у швидкому застосуванні здібностей.",
  "springcleaning22_ui_ward_bounty": "У вікні сповіщень матчу тепер показується, хто отримує нагороду за вбивство оглядового варда, якщо її отримав хтось інший.",
  "springcleaning22_ui_spectator_hud_player_view": "Інтерфейс спостерігача тепер правильно показує ім’я гравця, за яким дивиться спостерігач.",
  "springcleaning22_ui_post_game_scepter_shard": "У післяматчевій таблиці результатів підказки для скіпетра й уламка Аґаніма тепер показують їхні ефекти.",
  "springcleaning22_ui_post_game_backpack_neutral": "Нейтральні предмети й предмети в рюкзаку тепер показуються в післяматчевих результатах.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Значення вампіризму від чарів для героїв і кріпів тепер показуються окремо під час утримування клавіші Alt.",
  "springcleaning22_ui_skeleton_warrior_rally": "Аура Гуртування (Rally) Кістяного воїна (Skeleton Warrior) тепер показується одним посиленням із лічильником, а не кількома піктограмами.",
  "springcleaning22_ui_neutral_item_teleport": "Виправлено помилку, внаслідок якої після зміни нейтральних предметів і швидкого відправлення одного з них у сховище туди потрапляв хибний предмет.",
  "springcleaning22_ui_spectator_arcana": "Елементи інтерфейсу таємних предметів не показуються для глядачів професійних матчів ліги.",
  "springcleaning22_ui_ready_check_enter": "Тепер для підтвердження готовності можна просто натиснути клавішу Enter.",
  "springcleaning22_ui_alt_item_combine": "Тепер під час утримання клавіші Alt у швидкому меню закупу можна побачити предмет, у який інші предмети комбінуються.",
  "springcleaning22_ui_alt_items_ready": "Якщо утримувати клавіші Ctrl+Alt та клацнути ЛКМ на Зачаровані черевики (Arcane Boots), Багряного стража (Crimson Guard), Поножі Вартового (Guardian Greaves), Меканзм (Mekansm), Люльку прозріння (Pipe of Insight) або Дим омани (Smoke of Deceit), то ви не накажете своїй команді гуртуватися поруч, а скажете, що ці предмети готові.",
  "springcleaning22_ui_sentry_pregame": "Кількість вартових вардів, показаних у стратегічній стадії, збільшена з 2 до 3, бо саме 3 варди можна придбати на початку гри.",
  "springcleaning22_ui_guide_pregame": "Тепер після вибору героя розділ пропозицій помічника показуватиме перший розділ посібника, якщо в посібнику немає розділу «Стартові предмети».",
  "springcleaning22_ui_ward_planter": "Під час вибору варда ви побачите союзних гравців, глядачів та тренерів, які поставили його.",
  "springcleaning22_ui_courier_home_button": "Коли кур’єр повертатиметься на базу після натискання кнопки «Крамниця на базі», то він поверне у сховок будь-який предмет, який має із собою.",
  "springcleaning22_ui_combat_log_key": "Тепер у налаштуваннях можна призначити показ журналу бою певній клавіші.",
  "springcleaning22_ui_combat_log_right_align": "Журнал бою тепер розташований праворуч і більше не накладається на кнопки керування демо-героєм.",
  "springcleaning22_ui_combat_log_hud_flip": "Журнал бою тепер враховує віддзеркалення інтерфейсу (мінімапа праворуч) і переноситься ліворуч, коли цей параметр увімкнений.",
  "springcleaning22_ui_guide_apos": "Виправлено помилку, внаслідок якої в посібниках для предметів і здібностей апостроф замінювався на «&apos;» та інші символи розмітки HTML. Проте якщо посібники вже збережені з цією помилкою, то їх потрібно буде оновити вручну.",
  "springcleaning22_ui_vs_screen_widescreen": "Підправлено показ героїв на екрані поєдинку для моніторів із пропорціями 21:9 та ширше.",
  "springcleaning22_ui_charms": "Виправлено помилку, внаслідок якої інтерфейс амулетів накладався на текст, якщо ви маєте два й більше амулетів.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Виправлено помилку, внаслідок якої в тренері останнього удару можна було почати до появи героя, від чого кріпи не з’являлися.",
  "springcleaning22_ui_intro_scenes": "Вступні сцени (як-от появи героїв, таємних предметів чи персон) більше не показуватимуться гравцям, які не пройшли нове навчання.",
  "springcleaning22_cosmetics_illusion_skins": "Виправлено помилку, внаслідок якої ілюзії могли мати неправильні стилі певних косметичних моделей.",
  "springcleaning22_cosmetics_cloth_stretch": "Виправлено помилку, внаслідок якої одяг на деяких моделях неправильно розтягувався.",
  "springcleaning22_cosmetics_underlord_immortal": "Ефект нетлінного предмета Підземного Лорда «Смарагдове поневолення» (Emerald Subjugation) тепер замінює його ультимативну здібність.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Ефекти снаряду Тіньової отрути (Shadow Poison) Тінистого Нелюда (Shadow Demon) зі спорядженим нетлінним предметом «Золота мантія Похмурого Лику» (Mantle of Grim Facade) тепер націлюються правильно.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Нетлінний предмет Палаючої тіні (Blistering Shade) Короля-Духа (Wraith King) має під час чаклування Примарного вогню (Wraithfire Blast) більший пріоритет, ніж таємний предмет.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Виправлено ефекти оточення нетлінного предмета «Наручні печерного світла» (Bracers of the Cavern Luminar) для Землетруса (Earthshaker).",
  "springcleaning22_cosmetics_warlock_immortal": "Виправлені неправильні ефекти посилення й послаблення Слова тіней (Shadow Word) Чорнокнижника (Warlock) зі спорядженим нетлінним предметом «Темний гліф» (Umbral Glyph).",
  "springcleaning22_cosmetics_viper_immortal": "Виправлено неправильні частки удару по області Попідземного токсину (Nethertoxin) Гадюки (Viper) зі спорядженим нетлінним предметом «Отруйний удар» (Malefic Drake's Strike).",
  "springcleaning22_cosmetics_abaddon_vessel": "Відновлено ефекти Темного щита (Aphotic Shield) в Абаддона (Abaddon) зі спорядженим Клинком демонічної сутності (Blade of the Demonic Vessel).",
  "springcleaning22_cosmetics_tidehunder_belt": "Прибрано неправильні ефекти часток пояса Жах із глибин (Horror from the Deep Belt) для Хвилеріза (Tidehunter), які з’являлися не на руці, а на поясі.",
  "springcleaning22_cosmetics_faceless_incursion": "Виправлено ефекти оточення зброї «Навала клазуримів» (Claszureme Incursion) для Безликого (Faceless Void).",
  "springcleaning22_cosmetics_drow_arcana_aura": "Тепер аура таємного предмета «Стрілецької підготовки» (Marksmanship) для Дроу-Рейнджер (Drow Ranger) має нестандартні ефекти для обох стилів.",
  "springcleaning22_cosmetics_rubick_dilemma": "Відновлені ефекти оточення Смолоскипа дилеми Фанточінні (Torch of Fantoccini's Dilemma) для Рубіка (Rubick).",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Виправлено швидкість анімації бігу поранених Техніків (Techies) зі спорядженим таємним предметом.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Додано підтримку кольорових самоцвітів для Липкої бомби (Sticky Bomb) і Реактивного електрошокера (Reactive Tazer) Техніків (Techies) зі спорядженим таємним предметом.",
  "springcleaning22_cosmetics_techies_icons": "Додано відсутні кнопки інвентарю для таких наборів предметів для Техніків (Techies): «Powdersled Rookery», «Sapper's Guile», «Bombtrails and Boomsticks» і «March of the Powderkeg Patrol».",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Виправлено анімацію техніка Спуна під час телепортації зі спорядженим набором «Товстошкірий вибуховоз» (Pachyderm Powderwagon).",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Рубік зі спорядженим таємним предметом тепер має нестандартний ефект для Липкої бомби (Sticky Bomb) Техніків, а не Міни дистанційної дії (Remote Mine).",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Виправлено помилку з відсутньою анімацією Запальниці (Snapfilre), внаслідок якої вона застрягала в неправильній послідовності рухів.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Набір і предмети «Осяяна завойовниця» (Radiant Conqueror) для Командувачки Легіону (Legion Commander) тепер можна продавати на ринку й обмінювати.",
  "springcleaning22_cosmetics_legion_commander_wind": "Для стягів «Спадок полеглого легіону» (Legacy of the Fallen Legion) та «Осяяна завойовниця» (Radiant Conqueror) Командувачки Легіону (Legion Commander) додано ефект вітру, який діє зі спорядженою таємною зброєю чи без неї.",
  "springcleaning22_perf_panorama_atlas": "Оновлено роботу рушія інтерфейсу Panorama, щоби він дієвіше використовував графічний процесор для промальовування елементів. За нашими вимірюваннями це зменшило нам навантаження на графічний процесор на 20-30% для промальовування інтерфейсу й значно більше для певних завантажених елементами сторінок зі статистикою. Окрім того, ця зміна збільшує продуктивність центрального процесора на Vulkan і повинна збільшити ефективність для комп’ютерів Apple на процесорах M1.",
  "springcleaning22_perf_sand_king_particles": "Оптимізовано ефекти часток Піщаної бурі (Sand Storm) для поліпшення швидкодії.",
  "springcleaning22_perf_panorama_clears": "Оновлено рушій інтерфейсу Panorama. Ці зміни допоможуть уникнути промальовування непотрібних елементів, що зменшує навантаження на відеокарту.",
  "springcleaning22_perf_scenesystem_threading": "Виправлено помилку, внаслідок якої використовувалися не всі ядра процесора в тих місцях, де потрібна була багатоядерна обробка. Це особливо поліпшить швидкодію для комп’ютерів з 4 чи меншою кількістю процесорів.",
  "springcleaning22_perf_thread_affinity": "Виправлено помилку, внаслідок якої неправильно встановлена відповідність потоків могла призводити до зменшення швидкодії на певних комп’ютерах.",
  "springcleaning22_perf_power_savings": "У налаштуваннях графіки тепер є попередження про те, що комп’ютер працює в режимі енергозбереження, що може призвести до низької швидкодії.",
  "springcleaning22_perf_shop_tooltips": "Поліпшено роботу підказок під час перегляду крамниці предметів.",
  "springcleaning22_custom_games_overview_sort": "На вкладці «Аркади» тепер можна сортувати не лише за кількістю відкритих лобі, але й за поточною кількістю активних гравців.",
  "springcleaning22_custom_games_update": "Виправлено помилку, внаслідок якої нестандартні ігри на вкладці «Аркади» не показували, що їх потрібно оновити, до їхньої повторної інсталяції чи перезапуску Steam.",
  "springcleaning22_custom_games_lobby_version": "На вкладці «Аркади» більше не показуються ті лобі, які не відповідають версії нестандартної гри, що наразі інстальована, або до яких неможливо приєднатися з інших причин.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold відтепер може фільтрувати золото, отримане від рун достатку.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Змінено реліквію для Дазла (Dazzle): «Лихе чаклунство (Bad Juju) на чотирьох ворогів» → «Шкода та зцілення від Лихого чаклунства».",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Змінено реліквію для Техніків (Techies): «Убивств мінами дистанційної дії» → «Прикріплені до героїв Липкі бомби (Sticky Bombs)».",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Змінено реліквію для Техніків (Techies): «Приголомшення стазисними пастками (Stasis Trap)» → «Роззброєння кількох героїв від Реактивного електрошокера (Reactive Tazer)».",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Змінено реліквію для Механіка (Tinker): «Шкода від Маршу машин» (March of the Machines) → «Шкода, поглинена Захисною матрицею (Defense Matrix)».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Змінено реліквію для Підземного Лорда (Underlord): «Убивства після Темного розлому (Dark Rift)» → «Союзні вбивства з Потойбічними вратами (Fiend's Gate)».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Змінено реліквію для Підземного Лорда (Underlord): «Герої, врятовані Темним розломом (Dark Rift)» → «Додаткова шкода, завдана Аурою виснаження (Atrophy Aura)».",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Виправлено реліквію для Вселицаря (Omniknight) — «Шкода від союзників під дією Небесної милості (Heavenly Grace)».",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Виправлено реліквію для Первісного Звіра (Primal Beast) — «Штурм (Onslaught) на кількох героїв».",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Змінено випробування героя для Міпо (Meepo): «Магічна шкода, завдана героям» → «Абсолютна шкода, завдана героям».",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Змінено випробування героя для Наґа-Сирени (Naga Siren): «Зцілені під час Співу Сирени (Song of the Siren) герої» → «Завдання героям шкоди від спаленої мани (Mana Burn)».",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Змінено випробування героя для Механіка (Tinker): «Шкода від Маршу машин (March of the Machines)» → «Шкода, поглинена Захисною матрицею (Defense Matrix)».",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Змінено випробування героя для Техніків (Techies): «Убивства мінами дистанційної дії» → «Прикріплені Липкі бомби (Sticky Bombs)».",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Змінено випробування героя для Підземного Лорда (Underlord): «Телепортація кількох героїв Темним розломом (Dark Rift)» → «Союзні вбивства з Потойбічними вратами (Fiend's Gate)».",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Оновлено випробування героя для Чорнильника (Grimstroke) — «Шкода, завдана ворогам від Душов’яза (Soul Bind)» тепер включатиме шкоду від союзників.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Оновлено випробування героя для Мірани (Mirana) — «Шкода, завдана під час Стрибка (Leap)» тепер включатиме всі типи шкоди, а не лише фізичну.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Виправлено випробування героя для Губителя (Bane) — «Комбо Стрибкового кинджала (Blink Dagger), Посоха примусу (Force Staff) та Демонічної хватки (Fiend's Grip)».",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Виправлено випробування героя для Лицаря-Дракона (Dragon Knight) — «Вбивства у Формі дракона (Dragon Form)».",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Виправлено випробування героя для Дроу-Рейнджер (Drow Ranger) — «Приголомшення більше ніж 2 ворогів Поривом (Gust)».",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Виправлено випробування героя для Кришталевої Діви (Crystal Maiden) — «Вбивства кріпів з Обмороженням (Frostbite)».",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Виправлено випробування героя для Темного Провидця (Dark Seer) — «Завдана шкода під час дії Ривка (Surge)».",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Виправлено випробування героя для Життєкрада (Lifestealer) — «Завдана шкода під час дії Люті (Rage)».",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Виправлено випробування героя для Самітного Друїда (Lone Druid) — «Завдана шкода під час дії Істинної форми (True Form)».",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Виправлено випробування героя для Марса (Mars) — «Завдана шкода ворожим героям».",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Виправлено випробування героя для Марса (Mars) — «Убивство ворожих істот периферійною шкодою».",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Виправлено випробування героя для Вселицаря (Omniknight) — «Завдана шкода під час дії Небесної милості (Heavenly Grace)».",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Виправлено випробування героя для Вселицаря (Omniknight) — «Тривалість дії Небесної милості (Heavenly Grace) на союзників».",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Виправлено випробування героя для Рубіка (Rubick) — «Приголомшення кількох героїв Телекінезом (Telekinesis)».",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Виправлено випробування героя для Механіка (Tinker) — «Завдана героям шкода з Лазером (Laser), поліпшеним скіпетром Аґаніма».",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Виправлено випробування героя для Бивня (Tusk) — «Комбо Під дихало (Walrus Punch) та Під зад (Walrus Kick)».",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Вилучено випробування героя для Трутоманта (Venomancer) — «Завдана героям шкода від Срібного клинка (Silver Edge)».",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Вилучено випробування героя для Механіка (Tinker) — «Убивство кріпів за допомогою Маршу машин (March of the Machines)».",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Додано випробування героя для Підземного Лорда (Underlord) — «Завдана героям шкода від Вогняної бурі (Firestorm)».",
  "springcleaning22_workshop_modeldoc": "Інструменти майстерні Dota 2 для предметів та нестандартних режимів тепер використовуватимуть новий редактор моделей «ModelDoc». Автори майстерні повинні перенести всі моделі зі старого інструменту, який буде вилучено в одному з майбутніх оновлень."
}