// 549.js

{
  "language": "english",
  "springcleaning22_desc": "The Spring Cleaning 2022 update is here to patch a passel of bugs and implement a handful of new quality-of-life improvements. Check out some of the larger changes — like improvements to Aghanim's tooltips, Muting Controls, Shop Searches, and Demo Hero mode — and then dig into the longer list of fixes and gameplay adjustments in a comprehensive breakdown below.",
  "springcleaning22_aghs_tooltips": "Aghanim's Scepter and Shard Tooltips",
  "springcleaning22_aghs_tooltips_desc": "The inner workings of Aghanim's mind (and monologue) are undoubtedly beyond mortal comprehension, but with today's update the battlefield impact of his magnificent Scepters and Shards has been revealed like never before. Tooltips for Aghanim's upgrades now include more details about the exact numbers that change when equipped, and modified abilities also include this information in a dedicated section. Many upgrades have also received individual attention to make them simpler and easier for our non-magus minds to understand.",
  "springcleaning22_muting_ui": "Muting Improvements",
  "springcleaning22_muting_ui_desc": "Dota players are a boisterous bunch, and sometimes the wrong kind of emotions dominate amidst the heat of competition. In cases where that behavior becomes disruptive, it's important to have a quick and easy means to mute players and report them for additional scrutiny without further disrupting your game. To that end, a single click will now mute voice, mute text, and report a player. You can also right-click to mute text and voice independently for cases where a player's behavior may not be disruptive but their communications are still unwanted. For an easy high-level control, you can also use the new Team Mute buttons to block out an entire team's communications with a click.\\n\\nWe're also taking this opportunity to re-evaluate how we handle communication reports. Our goals are to make it quick and easy to mute disruptive players while also getting a clear indication of which players we might need to take stronger action on.",
  "springcleaning22_demo_hero": "Demo Hero Improvements",
  "springcleaning22_demo_hero_desc": "Want to test out the newest strategies or create some of your own? Or maybe just feel an overwhelming need to see how many incarnations of Axe can be slaughtered in a single Tidebringer strike? Either way, you're in luck! Hero demo has been updated with a rework that includes a host of new fuctionality:",
  "springcleaning22_demo_hero_map": "The northern section of the Demo Map has been expanded to provide more flat area for testing.",
  "springcleaning22_demo_hero_hero_spawn": "Added controls to easily spawn Allied heroes, in addition to enemies.",
  "springcleaning22_demo_hero_hero_reset": "Added a control to reset a hero back to level 1.",
  "springcleaning22_demo_hero_hero_remove": "Added a control to remove a hero once you're done testing.",
  "springcleaning22_demo_hero_hero_select": "Creating a new hero will add it to your current selection.",
  "springcleaning22_demo_hero_levelling": "Buttons for leveling, adding Scepter, adding Shard, and toggling invulnerability now apply to all currently selected heroes.",
  "springcleaning22_demo_creep_toggle": "When toggling creeps off all existing lane creeps will be destroyed.",
  "springcleaning22_demo_creep_spawn": "Added a button to spawn a single creep wave from each side.",
  "springcleaning22_demo_hero_runes": "Added buttons to spawn the 6 major runes.",
  "springcleaning22_shop_search": "Updated Shop Search",
  "springcleaning22_shop_search_desc": "Spending gold should be easy, fun, and most of all, effective. So to help make your sprees feel a little less \"meep merp\" and a lot more \"last hit,\" the Item Shop Search has been expanded with improved support for keywords — including a display that highlights searched-for attributes. Just search for \"Armor\", \"Strength\", \"Range\", etc to highlight the stats you're interested in. Picking the perfect item for the perfect plan has never been easier. All you need now is the gold.",
  "springcleaning22_item_tooltips": "Expanded Item Tooltips",
  "springcleaning22_item_tooltips_desc": "Keep forgetting how much Mana that Intelligence provides? Or how much Armor you get from Agility? Ponder no more, as simply holding ALT while looking at the tooltip for items will now expand those properties into all their component parts.",
  "springcleaning22_colored_ability_damage": "Ability Damage Colors",
  "springcleaning22_colored_ability_damage_desc": "Making good choices in battle relies on knowing the challenges that face you. To help you parse the potential dangers, damage dealt by spells and items is now color-coded according to whether the damage is Physical, Magical, or Pure.",
  "springcleaning22_pluralized_strings": "Enhanced Language Support for Pluralized Strings",
  "springcleaning22_pluralized_strings_desc": "To improve accessibility around the world, we've added features to better support pluralization rules for multiple languages, and updated over 400 lines of text to account for these changes.",
  "springcleaning22_permanent_debuffs": "Permanent Buffs",
  "springcleaning22_permanent_debuffs_desc": "Strategizing is difficult without understanding the efficacy of your actions. To make more info available after a match, kills from Necrophos' Reaper's Scythe and Axe's Culling Blade now show on the post-game screen.",
  "springcleaning22_post_game_sortable": "Sortable Post-Game Details",
  "springcleaning22_post_game_sortable_desc": "Want to dig deeper into the details behind your victories? The post-game scoreboard is now sortable for easier analysis.",
  "springcleaning22_gameplay_tp_boots": "Boots of Travel are less likely to target a creep when cast in range of a tower.",
  "springcleaning22_gameplay_sellback": "Players can now sell an item for full price for the first 30 seconds after the game begins instead of the normal 10-second sellback period.",
  "springcleaning22_gameplay_lifestealer_consume": "Lifestealer's Consume now uses the same hotkey, regardless of the infested unit type.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "The Ogre Bruiser now has sound effects for its windup and stun.",
  "springcleaning22_gameplay_neutral_aura_radius": "All neutral creep auras now show their radius on hover.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Wraith Band / Null Talisman / Bracer now update their stat bonuses in the ability tooltip when doubled at minute 25.",
  "springcleaning22_gameplay_heal_overhead": "Fixed a number of cases where popup heal numbers didn't take heal amplification into effect.",
  "springcleaning22_gameplay_fountain_invuln": "Players with the Fountain Invulnerablility buff will no longer auto-attack and break the buff when an enemy is within range.",
  "springcleaning22_gameplay_blink_range": "Spell range indicator for blink and its variants now take into consideration increased cast range buffs.",
  "springcleaning22_gameplay_desolator_tooltip": "Clarified the tooltip for Desolator's Soul Stealer passive. Desolator gains attack damage whenver an enemy dies while afflicted by the Corruption debuff.",
  "springcleaning22_gameplay_ardm_stash": "Fixed a bug in ARDM where a courier returning an item to the stash while dead would lead to the item vanishing.",
  "springcleaning22_gameplay_neutral_items_lock": "Neutral items can no longer be combine-locked. This fixes a bug where couriers would not deliver combine-locked neutrals.",
  "springcleaning22_gameplay_illusion_modifiers": "Fixed a bug where illusions with duplicated modifiers would have incorrect durations, allowing the real hero to be identified.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Fixed a bug in Turbo and the New Player Mode where some gold sources were not being correctly scaled.",
  "springcleaning22_gameplay_turbo_courier": "Fixed a bug in Turbo where a player's courier would no longer work if they were disconnected during hero selection or strategy time.",
  "springcleaning22_gameplay_zero_tooltips": "Fixed a bug where some in-game tooltips that are modified by talents were displaying as 0 instead of the correct value.",
  "springcleaning22_gameplay_euls_invulnerable": "Eul's Scepter cast on magic-immune clones will now correctly apply its affect to the clone rather than simply going on cooldown.",
  "springcleaning22_gameplay_kobold_aura": "Kobold's Prospecting Aura no longer applies to Creep Heroes (e.g. Lone Druid bear), fixing a bug where it was incorrectly granting double the effect.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Clones and Tempest Doubles now correctly receive the stat bonus from Alchemist-granted Aghanim's Scepter blessings.",
  "springcleaning22_gameplay_chen_hand_of_god": "Chen's Hand of God now correctly applies the heal over time to creeps controlled by Chen, not just the initial heal.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Arc Warden's Tempest Double attack penalty from distance now respects Arc Warden reincarnating.",
  "springcleaning22_gameplay_arc_warden_basher": "Added a tooltip clarifying that Clones and Tempest Doubles can't bash with Basher or Abyssal.",
  "springcleaning22_gameplay_arc_warden_blink": "Blink Dagger on Arc Warden's Tempest Double is no longer on cooldown upon summoning.",
  "springcleaning22_gameplay_arc_warden_wards": "Arc Warden's Tempest Double can no longer receive shared wards.",
  "springcleaning22_gameplay_pa_scepter_double": "Phantom Assassin's Aghanim's Scepter upgrade no longer refreshes Blur when killing a Tempest Double.",
  "springcleaning22_gameplay_naga_siren_riptide": "Naga Siren's -1 hits required for Riptide now correctly only reduces it by 1 hit, not 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Legion Commander's Duel bonus damage is now awarded even if the winner is invulnerable.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Tusk's Walrus Kick now has the correct cooldown of 12 seconds.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Terrorblade Metamorphosis now has the correct cooldown of 35/40/45/50.",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey King's Tree Dance can no longer escape Arena of Blood",
  "springcleaning22_gameplay_naga_siren_ability_draft": "In Ability Draft, Naga Siren's Riptide effects will now play on the correct hero instead of always Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki can now cast Smoke Screen while channeling Tricks of the Trade without breaking the channel even if \"Channel Requires Hold/Stop\" is enabled.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Fixed Marci's Dispose interaction with BKB and Lotus Orb.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Sniper's Concussive Grenade now adds an overhead disarm icon.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling no longer permanently keeps the Spirit Link passive when morphing into Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Added a missing channeling icon for Underlord's Fiend's Gate",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Added a missing tooltip for Icefire Bomb's debuff.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Dark Willow's Cursed Crown particle effects with Aghanim's Shard now has the correct timing.",
  "springcleaning22_gameplay_lone_druid_midas": "Using Hand of Midas on Lone Druid's Spirit Bear now grants experience to the controlling hero.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear and Tempest Doubles can now gain Magic Stick, Magic Wand, and Holy Locket charges.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Void Spirit's Astral Step tooltip now correctly shows spell amplification values when ALT is pressed.",
  "springcleaning22_gameplay_heavenly_jump_range": "Zeus Heavenly Jump now shows its range on mouseover.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Fixed Crystal Maiden Arcane Aura tooltips.",
  "springcleaning22_gameplay_hex_tooltip": "Fixed Shadow Shaman's Hex tooltip erroneously adding 1 second to its duration when the \"Hex applies Break\" talent is selected.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Fixed Abaddon's Level 20 talent not updating the Borrowed Time cooldown in the tooltip.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Fixed Shadow Fiend's Presence of the Dark Lord to correctly apply to neutral creeps.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Fixed Tinker's Warp Grenade working on Roshan",
  "springcleaning22_gameplay_ability_draft_wukong": "In Ability Draft, fixed Wukong's Command clones not having the correct abilities.",
  "springcleaning22_rubick_illusions": "Fixed a bug that prevented Rubick illusions from having correct animations based on stolen spells (e.g. Bane's Fiend's grip with Ahanim's Scepter).",
  "springcleaning22_rubick_hunter_in_the_night": "Hunter in the Night can now be stolen when upgraded by Aghanim's Scepter.",
  "springcleaning22_rubick_juxtapose": "Juxtapose can now be stolen when upgraded by Aghanim's Scepter.",
  "springcleaning22_rubick_fireball": "Dragon Knight's Fireball can now be stolen independently of Dragon Form, and is not granted automatically.",
  "springcleaning22_rubick_wolf_bite": "Wolf Bite now works when stolen.",
  "springcleaning22_rubick_depth_shroud": "Depth Shroud now works when stolen.",
  "springcleaning22_rubick_astral_spirit": "Removed Astral Spirit separate movement ability when stolen. Rubick can now keep both spell slots when stealing this ability.",
  "springcleaning22_rubick_reverse_time_walk": "Reverse Time Walk now swaps to the same ability slot as Time Walk if Rubick has the Aghanim's shard. Rubick can now keep both spell slots when stealing this ability.",
  "springcleaning22_rubick_jaunt": "Jaunt now swaps to the same ability slot as Illusory Orb. Rubick can now keep both spell slots when stealing this ability.",
  "springcleaning22_rubick_eject": "Eject now swaps to the same ability slot as Dismember if Rubick has the Aghanim's shard. Rubick can now keep both spell slots when stealing this ability.",
  "springcleaning22_rubick_dismember": "Dismember now ejects the friendly hero if another spell is stolen in its place.",
  "springcleaning22_rubick_spit_out": "Spit Out now swaps to the same ability slot as Gobble Up. Rubick can now keep both spell slots when stealing this ability.",
  "springcleaning22_rubick_decoy": "Stealing Decoy no longer also steals Bushwhack. Decoy still applies Bushwhack when cast.",
  "springcleaning22_rubick_spirits": "Stealing Io's Spirits now works correctly when getting an Aghanim's Scepter.",
  "springcleaning22_rubick_gravekeepers_cloak": "Gravekeeper's Cloak can now be stolen when upgraded by Aghanim's Scepter.",
  "springcleaning22_rubick_shard_cursed_crown": "If Rubick has Aghanim's Shard, Cursed Crown now will now also create Brambles.",
  "springcleaning22_rubick_shard_venomous_gale": "If Rubick has Aghanim's Shard, Venomous Gale now will now also create Plague Wards.",
  "springcleaning22_rubick_shard_sprout": "If Rubick has Aghanim's Shard, Sprout now will now also create Treants.",
  "springcleaning22_rubick_shard_shackles": "If Rubick has Aghanim's Shard, Shackles now will now also create Serpent Wards.",
  "springcleaning22_rubick_shard_cold_embrace": "If Rubick has Aghanim's Shard, Cold Embrace now will now also emanate a Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "If Rubick has Aghanim's Shard, Earthshock will also apply Enrage.",
  "springcleaning22_rubick_shard_shadow_step": "If Rubick has Aghanim's Shard, Shadow Step will also apply Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "If Rubick has Aghanim's Shard, Terror Wave will also apply Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "If Rubick has Aghanim's Shard, Homing Missile will also have Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "If Rubick has Aghanim's Shard, Slithereen Crush will also apply Corrosive Haze.",
  "springcleaning22_rubick_scepter_flak_cannon": "If Rubick has Aghanim's Scepter, Flak Cannon will also have the Sidegunner passive.",
  "springcleaning22_rubick_scepter_time_walk": "If Rubick has Aghanim's Scepter, Time Walk will also apply Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "If Rubick has Aghanim's Scepter, Shuriken Toss will also apply Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "If Rubick has Aghanim's Scepter, Sacred Arrow will also apply Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "Vector targeting for quick cast on key down has changed so that the vector begins drawing on key down and finishes on key up. This is the same as the behavior for quick cast on key up.",
  "springcleaning22_ui_ward_bounty": "The combat event for killing an observer ward now shows who received the bounty if it differs from the killer.",
  "springcleaning22_ui_spectator_hud_player_view": "Spectator HUD now correctly shows the player you're viewing.",
  "springcleaning22_ui_post_game_scepter_shard": "The tooltips for Aghanims Scepter and Shard now show their effects on the post-game scoreboard.",
  "springcleaning22_ui_post_game_backpack_neutral": "Backpack and neutral items now show in the post-game hero details.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Spell Lifesteal values for Heroes and Creeps are now shown separately while holding ALT.",
  "springcleaning22_ui_skeleton_warrior_rally": "Skeleton Warrior Rally aura is now tracked by a counter buff instead of multiple individual buff icons.",
  "springcleaning22_ui_neutral_item_teleport": "Fixed swapping neutral items and teleporting one fast enough in succession that the wrong one is teleported.",
  "springcleaning22_ui_spectator_arcana": "Arcana UIs in the HUD no longer show up in League matches as a spectator.",
  "springcleaning22_ui_ready_check_enter": "Can now press ENTER to accept a ready check.",
  "springcleaning22_ui_alt_item_combine": "Items in quick buy menu now show the full item they combine into when holding ALT.",
  "springcleaning22_ui_alt_items_ready": "Holding control while alt-clicking on the following items will tell your team that they're ready, rather than to gather: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pip of Insight, and Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Increased number of sentry wards ownership displayed during Strategy Time from 2 to 3. There are a maximum of 3 sentries that can be purchased at the beginning of the game.",
  "springcleaning22_ui_guide_pregame": "After selecting a hero, the Recommended Items section will now show the first section of a guide if the guide has no sections named \"Starting Items\".",
  "springcleaning22_ui_ward_planter": "Selecting wards now shows allied players, spectators, and allied coaches who planted it.",
  "springcleaning22_ui_courier_home_button": "The Courier's Home Shop button now also returns any items it has to the stash when it reaches the base.",
  "springcleaning22_ui_combat_log_key": "The Combat Log can now be bound to a key in the options.",
  "springcleaning22_ui_combat_log_right_align": "Combat Log is now right-aligned and no longer overlaps with the Hero Demo controls.",
  "springcleaning22_ui_combat_log_hud_flip": "Combat Log now respects the hud flip (minimap on right) and will move to the left side when this option is on.",
  "springcleaning22_ui_guide_apos": "Fixed guide item/ability comments replacing apostrophes with \"&apos;\" and other HTML symbols when saved. Guides which have already been saved with this issue will still need to be manually updated.",
  "springcleaning22_ui_vs_screen_widescreen": "Adjusted the display of heroes on the Versus Screen for 21:9 or wider monitors.",
  "springcleaning22_ui_charms": "Fix a bug where the Charms UI would show overlapping text if you had 2+ Charms.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Fixed a bug in the Last Hit Trainer where clicking start before your hero spawned would prevent creeps from spawning.",
  "springcleaning22_ui_intro_scenes": "Intro scenes (such as Hero and Arcana/Persona debuts) will no longer be shown for players that haven't gone through the initial New Player Experience flow.",
  "springcleaning22_cosmetics_illusion_skins": "Fixed a bug where illusions might not inherit the skins of certain cosmetic models correctly.",
  "springcleaning22_cosmetics_cloth_stretch": "Fixed a bug where the cloth on certain models could incorrectly stretch across the screen.",
  "springcleaning22_cosmetics_underlord_immortal": "Underlord Immortal \"Emerald Subjugation\" now has custom ability effects that replaces ultimate",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Shadow Demon Immortal \"Mantle of Grim Facade\" Shadow Poison projectile effects are now oriented correctly",
  "springcleaning22_cosmetics_wraith_king_immortal": "Wraith King Immortal \"Blistering Shade\" has higher priority over the Arcana when casting \"Wraithfire Blast\"",
  "springcleaning22_cosmetics_earthshaker_immortal": "Earthshaker Immortal \"Bracers of the Cavern Luminar\" ambient effects fixed",
  "springcleaning22_cosmetics_warlock_immortal": "Warlock Immortal \"Umbral Glyph\" fixed broken ability effects on Shadow Word (buff and debuff)",
  "springcleaning22_cosmetics_viper_immortal": "Viper Immortal \"Malefic Drake's Strike\" fixed broken aoe particles for Nethertoxin",
  "springcleaning22_cosmetics_abaddon_vessel": "Abaddon \"Blade of the Demonic Vessel\" Aphotic Shield effects restored",
  "springcleaning22_cosmetics_tidehunder_belt": "Tidehunter \"Horror From the Deep Belt\" removed incorrect particles from belt slot that were supposed to be on arm",
  "springcleaning22_cosmetics_faceless_incursion": "Faceless Void \"Claszureme Incursion\" Weapon ambient effects have been fixed",
  "springcleaning22_cosmetics_drow_arcana_aura": "Drow Ranger Arcana \"Marskmanship\" aura now has custom effects for both styles",
  "springcleaning22_cosmetics_rubick_dilemma": "Rubick \"Torch of Fantoccini's Dilemma\" restored ambient effects",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "The Techies Arcana injured run animation now plays at the correct speed.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Added support for gem colors on Sticky Mine and Reactive Tazer for the Techies Arcana.",
  "springcleaning22_cosmetics_techies_icons": "Added missing econ item icons for Techies sets \"Powdersled Rookery\", \"Sapper's Guile\", \"Bombtrails and Boomsticks\", and \"March of the Powderkeg Patrol\".",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Fixed animation for Techie's Spoon in the teleport preview with the Pachyderm Powderwagon set.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "The Rubick Arcana now has custom effects for Techies Sticky Bomb instead of Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Fix Snapfire's disabled animation so that she no longer gets stuck in an incorrect animation sequence.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Legion Commander's \"Radiant Conqueror\" bundle and items are now marketable and tradeable.",
  "springcleaning22_cosmetics_legion_commander_wind": "Added wind effects to Legion commander's \"Legacy of the Fallen\" and \"Radiant Conqueror\" banners, with or without the Arcana Weapons equipped.",
  "springcleaning22_perf_panorama_atlas": "Updated the Panorama UI engine to use atlassing to more efficiently interact with the GPU. In our measurements, this resulted in 25-30% better performance in the GPU work necessary for the HUD, and much more in some particularly complicated dashboard pages. This change also increases CPU performance for Vulkan, and should also be particularly effective for Apple computers with M1 processors.",
  "springcleaning22_perf_sand_king_particles": "Optimized \"Sand Storm\" particle effects to improve performance.",
  "springcleaning22_perf_panorama_clears": "Updated the Panorama UI engine to avoid some unnecessary render target clears, avoiding GPU work.",
  "springcleaning22_perf_scenesystem_threading": "Fixed a bug where we were sometimes using less threads than intended for doing multithreaded work. This fix is especially helpful for machines with 4 or less cores.",
  "springcleaning22_perf_thread_affinity": "Fixed a bug where incorrectly set thread affinities could cause stalls on some machines.",
  "springcleaning22_perf_power_savings": "Added a warning in the video settings dialog to indicate if the computer is running in power saving mode, which may lead to slow performance.",
  "springcleaning22_perf_shop_tooltips": "Improved the performance of tooltips while browsing the Item Shop.",
  "springcleaning22_custom_games_overview_sort": "The Arcade Overview tab now allows sorting by Currently Active Players in addition to the number of Open Lobbies.",
  "springcleaning22_custom_games_update": "Fixed an issue with Dota Arcade custom games sometimes not showing as needing an Update until they were reinstalled, or Steam had been restarted.",
  "springcleaning22_custom_games_lobby_version": "The Dota Arcade lobby list will no longer show lobbies that don't match the version of the custom game that's currently installed or are otherwise unjoinable.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold can now filter the gold received from Bounty Runes.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Replaced Relic for Dazzle - \"Four Enemy Juju Debuffs\" with \"Damage and Healing from Bad Juju\"",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Replaced Relic for Techies - \"Remote Mine Kills\" with \"Sticky Bombs Attached to Heroes\".",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Replaced Relic for Techies - \"Stasis Trap Stuns\" with \"Reactive Tazer Multi Hero Disarms\".",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Replaced Relic for Tinker - \"March of the Machines Damage\" with \"Defense Matrix Damage Absorbed\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Replaced Relic for Underlord - \"Kills After Dark Rift\" with \"Allied Kills Using Fiend's Gate\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Replaced Relic for Underlord - \"Heroes Saved By Dark Rift\" with \"Atrophy Aura Bonus Damage Dealt\".",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Fixed Relic for Omniknight - \"Ally Damage During Heavenly Grace\".",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Fixed Relic for Primal Beast - \"Multi Hero Onslaught Kills\".",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Replaced Hero Challenge for Meepo - \"Magic Damage dealt to Heroes\" with \"Pure Damage dealt to Heroes\".",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Replaced Hero Challenge for Naga Siren - \"Heroes Healed During Song\" with \"Deal Mana Burn Damage to Heroes\"",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Replaced Hero Challenge for Tinker - \"March of the Machines Damage\" with \"Damage Absorbed by Defense Matrix\"",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Replaced Hero Challenge for Techies - \"Remote Mine Kills\" with \"Sticky Bombs Attached\"",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Replaced Hero Challenge for Underlord - \"Multi Hero Dark Rift Teleports\" with \"Allied Kills after using Fiend's Gate\"",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Updated Hero Challenge for Grimstroke - \"Damage dealt to Enemies affected by Soul Bind\" now includes damage from allies.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Updated Hero Challenge for Mirana - \"Damage Done During Leap\" now includes all damage types instead of just Physical.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Fixed Hero Challenge for Bane - \"Blink / Force Staff and Feind's Grip Combos\".",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Fixed Hero Challenge for Dragon Knight - \"Kills During Dragon Form\".",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Fixed Hero Challenge for Drow Ranger - \"Silence 2+ Enemies with Gust\".",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Fixed Hero Challenge for Crystal Maiden - \"Creep Kills with Frostbite\".",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Fixed Hero Challenge for Dark Seer - \"Damage dealt during Surge\".",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Fixed Hero Challenge for Lifestealer - \"Damage dealt during Rage\".",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Fixed Hero Challenge for Lone Druid - \"Damage dealt during True Form\".",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Fixed Hero Challenge for Mars - \"Damage dealt to enemy Heroes\".",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Fixed Hero Challenge for Mars - \"Kill Enemy Units with Cleave\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Fixed Hero Challenge for Omniknight - \"Damage dealt during Heavely Grace\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Fixed Hero Challenge for Omniknight - \"Heavenly Grace on Allies Duration\".",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Fixed Hero Challenge for Rubick - \"Multi Hero Telekenisis Stuns\".",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Fixed Hero Challenge for Tinker - \"Damage dealt to Heroes with Laser upgraded by Aghanim's Scepter\".",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Fixed Hero Challenge for Tusk - \"Punch Kick Combos\".",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Removed Hero Challenge for Venomancer - \"Damage dealt to Silver Edge Broken Heroes\".",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Removed Hero Challenge for Tinker - \"Creep Kills with March of the Machines\".",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Added Hero Challenge for Underlord - \"Damage Dealt to Heroes with Firestorm\".",
  "springcleaning22_workshop_modeldoc": "The Dota workshop tools for items and custom games have been upgraded to use the new \"ModelDoc\" model editor. Workshop contributors should migrate any models from the old tool, which will be removed in a future update.",
  "NoCommaStub": ""
}