// 1040.js

{
  "language": "russian",
  "springcleaning22_desc": "Обновление «Весенняя уборка 2022» прибыло со множеством исправлений и улучшений. Взгляните на самые крупные изменения — например, в описаниях для предметов Аганима, интерфейсе заглушения, поиске в лавке и режиме пробы героя — а затем ознакомьтесь с полным списком изменений ниже.",
  "springcleaning22_aghs_tooltips": "Описания предметов Аганима",
  "springcleaning22_aghs_tooltips_desc": "В затеях Аганима (и его монологах) обычному смертному не разобраться, но сегодняшнее обновление разъясняет весь боевой потенциал его предметов полнее, чем когда-либо. В их описаниях теперь гораздо больше подробностей об изменениях показателей, и эти подробности также отдельно отображаются в описаниях улучшенных способностей. Более того, многие описания были разъяснены и упрощены специально для наших неаганимовых умов.",
  "springcleaning22_muting_ui": "Улучшения системы заглушений",
  "springcleaning22_muting_ui_desc": "Игроки в Dota — ребята лихие, и иногда в пылу сражения они поддаются не самым правильным эмоциям. Очень важно, чтобы у каждого была возможность быстро и без отрыва от игры пресечь неуместное поведение, заглушив нарушителей и оставив на них жалобу для дальнейшего рассмотрения ситуации — так что теперь можно одним кликом пожаловаться на человека и заглушить его в голосовом и текстовом чате. Также вы можете нажать на игрока правой кнопкой мыши и заглушить что-то одно в случае, если он ничего не нарушает, но вы не хотите с ним взаимодействовать. А в крайнем случае вы можете заглушить всех игроков разом одним нажатием на кнопку «Заглушение команды».\\n\\nКроме того, мы хотим воспользоваться этой возможностью, чтобы заново оценить систему жалоб на общение. Мы хотим, чтобы игроки могли быстро и просто ограничивать ненужное общение и при этом ясно давали нам знать, в каких случаях нужно предпринять серьёзные меры.",
  "springcleaning22_demo_hero": "Улучшения режима пробы героя",
  "springcleaning22_demo_hero_desc": "Хотите проверить новейшие стратегии или придумать свои собственные? А можете, хотите воочию увидеть, сколько разных инкарнаций Акса можно убить одним взмахом меча Кункки? Вам невероятно повезло! Режим пробы героев переработан и получил много новых возможностей:",
  "springcleaning22_demo_hero_map": "Север карты был расширен, чтобы для ваших тестов было больше ровных поверхностей.",
  "springcleaning22_demo_hero_hero_spawn": "Добавлена возможность с лёгкостью создавать союзных героев (а не только вражеских).",
  "springcleaning22_demo_hero_hero_reset": "Добавлена кнопка, которая сбрасывает уровень героя до 1.",
  "springcleaning22_demo_hero_hero_remove": "Добавлена кнопка, которой вы можете удалить героя после того, как закончите его тестировать.",
  "springcleaning22_demo_hero_hero_select": "Создание нового героя автоматически добавляет его в список выбранных существ.",
  "springcleaning22_demo_hero_levelling": "Теперь кнопки неузвимости, изменения уровня и добавления Aghanim's Scepter и Aghanim's Shard срабатывают на всех выделенных героев.",
  "springcleaning22_demo_creep_toggle": "Отключение крипов теперь сразу уничтожает всех живых крипов.",
  "springcleaning22_demo_creep_spawn": "Добавлена кнопка, которая создаёт по волне крипов с каждой стороны.",
  "springcleaning22_demo_hero_runes": "Добавлены кнопки для создания рун усиления.",
  "springcleaning22_shop_search": "Обновление поиска в лавке",
  "springcleaning22_shop_search_desc": "Тратить золото должно быть просто и весело, а самое главное — полезно. И для того, чтобы вы сосредотачивались не на названиях предметов, а на убийстве крипов, в поиск предметов в лавке была добавлена улучшенная поддержка ключевых слов, в том числе и подсветка атрибутов. Просто введите то, к чему вы хотите получить бонус — к «броне», «силе», «дальности» и так далее, — чтобы найти улучшения, которые вам его предоставят. Подобрать идеальный предмет для идеальной стратегии никогда не было проще. Осталось заработать золото.",
  "springcleaning22_item_tooltips": "Расширенные атрибуты предметов",
  "springcleaning22_item_tooltips_desc": "Не можете запомнить, как запас маны зависит от интеллекта? Или сколько брони даёт единица ловкости? Вам больше не придётся гадать, ведь простое нажатие на Alt во время просмотра описаний предметов покажет все подробности.",
  "springcleaning22_colored_ability_damage": "Цвета урона от заклинаний",
  "springcleaning22_colored_ability_damage_desc": "Принять верное решение в пылу битвы может лишь тот, кто ясно видит грядущие испытания. Чтобы вам было проще осознать все возможные опасности, числа урона от способностей и предметов теперь окрашены в цвет соответствующего типа: физического, магического или чистого.",
  "springcleaning22_pluralized_strings": "Улучшение поддержки локализации множественных чисел",
  "springcleaning22_pluralized_strings_desc": "Чтобы увеличить читаемость текста для пользователей по всему миру, мы улучшили поддержку множественных чисел для многих языков и обновили более 400 строк текста с учётом новых изменений.",
  "springcleaning22_permanent_debuffs": "Положительные эффекты",
  "springcleaning22_permanent_debuffs_desc": "Крайне сложно оценить свою стратегию, не понимая эффективности её компонентов. Мы расширили количество доступной после игры информации, добавив в послеигровую статистику число убийств при помощи Reaper's Scythe (способность Necrophos) и Culling Blade (способность Axe).",
  "springcleaning22_post_game_sortable": "Сортировка послеигровой статистики",
  "springcleaning22_post_game_sortable_desc": "Хотите углубиться в подробные данные своих побед? Теперь анализ всех показателей стал проще, ведь их можно сортировать на экране послеигровой статистики.",
  "springcleaning22_gameplay_tp_boots": "При телепортации в область башни при помощи Boots of Travel снижена вероятность выбрать целью телепортации крипа.",
  "springcleaning22_gameplay_sellback": "Теперь в первые 30 секунд после начала игры можно продавать предметы по полной стоимости.",
  "springcleaning22_gameplay_lifestealer_consume": "Теперь способность Consume у Lifestealer всегда использует одну и ту же клавишу, вне зависимости от существа.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Теперь огр-громила имеет отдельные звуковые эффекты при замахе и ударе способностью Ogre Smash!",
  "springcleaning22_gameplay_neutral_aura_radius": "Радиусы всех аур нейтральных крипов теперь отображаются при наведении курсора.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Теперь значения бонусов в описании предметов Wraith Band, Null Talisman и Bracer увеличиваются должным образом после 25:00.",
  "springcleaning22_gameplay_heal_overhead": "Исправлен ряд случаев, когда в описании лечащих способностей отображались заниженные значения, не учитывающие усиление лечения.",
  "springcleaning22_gameplay_fountain_invuln": "Игроки, находящиеся под неузвимостью от фонтана, больше не будут автоматически атаковать противника в радиусе атаки, теряя неуязвимость.",
  "springcleaning22_gameplay_blink_range": "Индикатор дальности Blink (и всех аналогов) теперь учитывает увеличенную дальность применения заклинаний.",
  "springcleaning22_gameplay_desolator_tooltip": "Более понятно переписано описание Soul Stealer (пассивная способность Desolator). Бонус к урону Desolator увеличивается, когда умирает вражеский герой, броня которого была уменьшена этой способностью.",
  "springcleaning22_gameplay_ardm_stash": "Исправлена ошибка, при которой в режиме ARDM пропадал предмет, возвращённый курьером в тайник во время смерти героя.",
  "springcleaning22_gameplay_neutral_items_lock": "Нейтральным предметам больше нельзя отключить сборку. Это исправляет ошибку, при которой курьер не доставлял нейтральные предметы с отключённой сборкой.",
  "springcleaning22_gameplay_illusion_modifiers": "Исправлена ошибка, из-за которой при создании иллюзий они копировали эффекты с неправильной длительностью, благодаря чему можно было определить настоящего героя.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Исправлена ошибка, из-за которой в Turbo и в режиме для новых игроков некоторые источники золота умножались неверно.",
  "springcleaning22_gameplay_turbo_courier": "Исправлена ошибка, когда в Turbo курьер игрока мог перестать работать, если игрок отключался во время выбора героя или на стадии планирования.",
  "springcleaning22_gameplay_zero_tooltips": "Исправлена ошибка, когда некоторые изменённые талантами описания отображали 0 вместо правильного значения.",
  "springcleaning22_gameplay_euls_invulnerable": "Применение Eul's Scepter of Divinity на невосприимчивых к магии клонов теперь работает должным образом, а не начинает перезаряжать способность без эффекта.",
  "springcleaning22_gameplay_kobold_aura": "Исправлена ошибка, при которой Prospecting Aura кобольда действовала на крипов-героев (например, на медведя Lone Druid) из-за чего их владельцы могли получать увеличенный эффект.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Теперь клоны и копия Tempest Double получают правильные бонусы к атрибутам от Agahnim's Scepter, которые подарил Alchemist.",
  "springcleaning22_gameplay_chen_hand_of_god": "Chen: исправлена ошибка, при которой Hand of God применяла на подконтрольных герою крипов только начальное лечение.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Arc Warden: если владелец Tempest Double умер с Aegis of Immortal, то расстояние от него до копии теперь будет считаться с места возрождения, а не с базы.",
  "springcleaning22_gameplay_arc_warden_basher": "Добавлена подсказка о том, что способность Bash у предметов Skull Basher и Abyssal Blade не работает у клонов героев и копии Tempest Double.",
  "springcleaning22_gameplay_arc_warden_blink": "Arc Warden: Blink Dagger у копии от Tempest Double больше не находится на перезарядке сразу после призыва клона.",
  "springcleaning22_gameplay_arc_warden_wards": "Arc Warden: копия от Tempest Double больше не может получать варды от других героев.",
  "springcleaning22_gameplay_pa_scepter_double": "Phantom Assassin: Blur больше не сбрасывает перезарядку с улучшением от Aghanim's Scepter после убийства копии от Tempest Double.",
  "springcleaning22_gameplay_naga_siren_riptide": "Naga Siren: талант «–1 атака для срабатывания Rip Tide» теперь соответствует описанию и уменьшает требование на один удар, а не на два.",
  "springcleaning22_gameplay_legion_commander_duel": "Legion Commander: исправлена ошибка, при которой победитель дуэли не получал дополнительный урон, если был неуязвим во время победы.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Tusk: исправлена перезарядка Walrus Kick (теперь она равна 12 секундам соответственно описанию).",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Terrorblade: исправлена длительность Metamorphosis (теперь она равна 35/40/45/60 секундам соответственно описанию).",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey King: теперь с помощью Tree Dance нельзя выбраться из арены от способности Arena of Blood у Mars.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "Naga Siren: теперь в Ability Draft эффекты от Rip Tide будут воспроизводиться на правильных героях, а не только вокруг Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki: теперь команда на применение способности Smoke Screen не прерывает действие Tricks of the Trade, даже если включена настройка «Остановка способностей отдельной клавишей», и будет исполнена после окончания Tricks of the Trade.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Marci: отражённая способность Dispose больше не игнорирует невосприимчивость к магии.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Sniper: теперь над жертвами Concussive Grenade отображается значок эффекта «Бессилие».",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling: исправлена ошибка, из-за которой эффект пассивной способности Spirit Link навсегда оставался у Morphling после превращения в Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Underlord: добавлена отсутствовавшая иконка способности при применении Fiend's Gate.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Добавлено описание для эффекта от способности Icefire Bomb у древнего шамана льда.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Dark Willow: теперь эффекты способности Cursed Crown отображаются в соответствии с изменениями от Aghanim's Shard.",
  "springcleaning22_gameplay_lone_druid_midas": "Lone Druid: опыт за использование медведем предмета Hand of Midas теперь будет получать тот, кто управляет медведем.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Теперь медведь и копия от Tempest Double могут получать заряды для предметов Magic Stick, Magic Wand и Holy Locket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Void Spirit: теперь при зажатии Alt в описании Astral Step отображаются верные значения, учитывающие увеличение урона от заклинаний.",
  "springcleaning22_gameplay_heavenly_jump_range": "Zeus: теперь способность Heavenly Jump отображает свой радиус при наведении на неё курсора.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Crystal Maiden: исправлено описание способности Arcane Aura.",
  "springcleaning22_gameplay_hex_tooltip": "Shadow Shaman: исправлена ошибка в описании Hex, из-за которой длительность увеличивалась на 1 секунду при выборе таланта «Hex накладывает истощение».",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Abaddon: исправлена ошибка, из-за которой перезарядка в описании Borrowed Time не менялась при выборе таланта 20 уровня на её уменьшение.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Shadow Fiend: исправлена ошибка, из-за которой аура Presence of the Dark Lord неправильно влияла на нейтральных крипов.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Tinker: исправлена ошибка, из-за которой Warp Flare действовала на Рошана.",
  "springcleaning22_gameplay_ability_draft_wukong": "Monkey King: исправлена ошибка, из-за которой у солдат от Wukong's Command в режиме Ability Draft были неправильные способности.",
  "springcleaning22_rubick_illusions": "Исправлена ошибка, из-за которой у иллюзий Rubick были неправильные анимации у некоторых украденных способностей (например, при применении Fiend's Grip с улучшением от Aghanim's Scepter).",
  "springcleaning22_rubick_hunter_in_the_night": "Теперь способность Hunter in the Night можно украсть, если её улучшили с помощью Aghanim's Shard и применили.",
  "springcleaning22_rubick_juxtapose": "Теперь способность Juxtapose можно украсть, если её улучшили с помощью Aghanim's Scepter и применили.",
  "springcleaning22_rubick_fireball": "Теперь способность Fireball у Dragon Knight нужно украсть отдельно, она больше не даётся автоматически кри краже Elder Dragon Form.",
  "springcleaning22_rubick_wolf_bite": "Теперь способность Wolf Bite работает и без украденной способности Shapeshift.",
  "springcleaning22_rubick_depth_shroud": "Теперь способность Depth Shroud работает и без украденной способности Shadow Dance.",
  "springcleaning22_rubick_astral_spirit": "Кража способности Astral Spirit больше не даёт дополнительную способность, перемещающую духа, из-за которой Rubick не мог иметь две украденные способности.",
  "springcleaning22_rubick_reverse_time_walk": "Теперь способность Reverse Time Walk занимает ту же ячейку, что и украденная Time Walk, если у Rubick есть Aghanim's Shard. Благодаря этому он может иметь две украденные способности.",
  "springcleaning22_rubick_jaunt": "Теперь способность Ethereal Jaunt занимает ту же ячейку, что и украденная Illusory Orb. Благодаря этому Rubick может иметь две украденные способности.",
  "springcleaning22_rubick_eject": "Теперь способность Eject занимает ту же ячейку, что и украденная Dismember, если у Rubick есть Aghanim's Shard. Благодаря этому он может иметь две украденные способности.",
  "springcleaning22_rubick_dismember": "Теперь Rubick автоматически выплёвывает союзника, если способность Dismember заменена другой.",
  "springcleaning22_rubick_spit_out": "Теперь способность Spit Out занимает ту же ячейку, что и украденная Gobble Up. Благодаря этому Rubick может иметь две украденные способности.",
  "springcleaning22_rubick_decoy": "Украденная способность Decoy больше не даёт способность Bushwhack, но всё ещё применяет её эффект при срабатывании.",
  "springcleaning22_rubick_spirits": "Теперь украденная у Io способность Spirits правильно работает с улучшением от Aghanim's Scepter.",
  "springcleaning22_rubick_gravekeepers_cloak": "Теперь способность Gravekeeper's Cloak можно украсть, если её улучшили с помощью Aghanim's Shard и применили.",
  "springcleaning22_rubick_shard_cursed_crown": "Теперь способность Cursed Crown с Aghanim's Shard создаёт терновые кусты и без украденной способности Bramble Maze.",
  "springcleaning22_rubick_shard_venomous_gale": "Теперь способность Venomous Gale с Aghanim's Shard создаёт чумные тотемы и без украденной способности Plague Ward.",
  "springcleaning22_rubick_shard_sprout": "Теперь способность Sprout с Aghanim's Shard создаёт энтов и без украденной способности Nature's Call.",
  "springcleaning22_rubick_shard_shackles": "Теперь способность Shackles с Aghanim's Shard создаёт змеиные тотемы и без украденной способности Mass Serprent Ward.",
  "springcleaning22_rubick_shard_cold_embrace": "Теперь способность Cold Embrace с Aghanim's Shard создаёт осколки и без украденной способности Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "Теперь способность Earthshock с Aghanim's Shard придаёт эффект способности Enrage без надобности её красть.",
  "springcleaning22_rubick_shard_shadow_step": "Теперь способность Shadow Step с Aghanim's Scepter бросает в жертву кинжал и без украденной способности Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "Теперь способность Terror Wave с Aghanim's Scepter придаёт демонический облик и без украденной способности Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "Теперь способность Homing Missile с Aghanim's Shard обстреливает врагов и без украденной способности Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Теперь способность Slithereen Crush с Aghanim's Shard накладывает эффект способности Corrosive Haze без надобности её красть.",
  "springcleaning22_rubick_scepter_flak_cannon": "Теперь украденная способность Flak Cannon с Aghanim's Scepter получает автоматическую турель.",
  "springcleaning22_rubick_scepter_time_walk": "Теперь способность Time Walk с Aghanim's Scepter применяет на врагов эффект способности Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Теперь способность Shuriken Toss с Aghanim's Scepter применяет на врагов эффект способности Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Теперь способность Sacred Arrow с Aghanim's Scepter применяет на врагов способность Starstorm без надобности её красть.",
  "springcleaning22_ui_quickcast_vector_targeting": "Изменено взаимодействие быстрого применения способностей с векторным применением. Теперь, если вы зажмёте клавишу способности, на месте курсора появится точка, от которой уже можно направлять способность. Она применится, как только вы отпустите клавишу.",
  "springcleaning22_ui_ward_bounty": "Журнал сражения теперь отображает, кто получил золото за уничтожение Observer Ward.",
  "springcleaning22_ui_spectator_hud_player_view": "Теперь интерфейс зрителя правильно отображает игрока, за которым следит камера.",
  "springcleaning22_ui_post_game_scepter_shard": "Теперь эффекты предметов Аганима отображаются в результатах и статистике после игры.",
  "springcleaning22_ui_post_game_backpack_neutral": "Теперь в результатах игры отображаются нейтральные предметы и предметы в ранце.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Теперь значения вампиризма заклинаниями при зажатии клавиши Alt отображаются отдельно для героев и крипов.",
  "springcleaning22_ui_skeleton_warrior_rally": "Ауры Rally у скелетов-воинов теперь отображаются одним эффектом со счётчиком, а не несколькими отдельными эффектами.",
  "springcleaning22_ui_neutral_item_teleport": "Исправлена ошибка, из-за которой при быстрой смене нейтрального предмета в общий тайник отправлялся неправильный предмет.",
  "springcleaning22_ui_spectator_arcana": "Элементы интерфейса, связанные с Arcana-предметами, больше не отображаются у зрителей при просмотре профессиональных игр.",
  "springcleaning22_ui_ready_check_enter": "Теперь проверку готовности можно пройти нажатием на клавишу Enter.",
  "springcleaning22_ui_alt_item_combine": "Теперь, если зажать клавишу Alt, в меню быстрой покупки иконка предмета отобразит, для сборки чего он вам нужен.",
  "springcleaning22_ui_alt_items_ready": "Теперь, если нажать на предмет с зажатыми клавишами Ctrl и Alt, вы сообщите союзникам о готовности своего предмета, а не попросите их собраться рядом. Это действует для предметов Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight и Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Увеличено количество вардов Sentry Ward, которые отображаются во время стадии планирования, ведь в начале игры можно купить 3 варда, а не 2.",
  "springcleaning22_ui_guide_pregame": "После выбора героя раздел «Рекомендуемые предметы» отобразит первый набор предметов в выбранном руководстве, если в нём не указаны начальные предметы.",
  "springcleaning22_ui_ward_planter": "Теперь союзники, зрители и союзный тренер могут выделить вард, чтобы увидеть, кто его установил.",
  "springcleaning22_ui_courier_home_button": "Теперь команда возвращения на базу заставляет курьера вернуть предметы в тайник по возвращении.",
  "springcleaning22_ui_combat_log_key": "Теперь в настройках управления можно задать клавишу для открытия журнала сражения.",
  "springcleaning22_ui_combat_log_right_align": "Теперь журнал сражения открывается справа и не накладывается на панель управления в тестовом режиме.",
  "springcleaning22_ui_combat_log_hud_flip": "Теперь журнал сражения учитывает отзеркаливание интерфейса (мини-карта справа) и будет появляться слева, если эта функция включена.",
  "springcleaning22_ui_guide_apos": "Исправлена ошибка, из-за которой в комментариях по предметам и способностям апострофы заменялись на «&apos;» и другие HTML-символы при сохранении руководства. Чтобы эта проблема пропала из уже существующих руководств, авторам придётся обновить их самостоятельно.",
  "springcleaning22_ui_vs_screen_widescreen": "Изменено отображение героев на экране соперников на мониторах с соотношением экрана 21:9 и шире.",
  "springcleaning22_ui_charms": "Исправлена ошибка, из-за которой интерфейс амулетов не влезал в отведённое ему место, если у вас есть 2 амулета или больше.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Исправлена ошибка, из-за которой в тренировке по добиванию крипов можно было нажать на кнопку «Начать» до появления героя, отчего крипы не появлялись.",
  "springcleaning22_ui_intro_scenes": "Особые вступления (например, выход нового героя, личности или Arcana-предмета) больше не вопроизводятся у игроков, которые ещё не прошли обучение.",
  "springcleaning22_cosmetics_illusion_skins": "Исправлена ошибка, из-за которой иллюзии использовали неправильные версии текстур у некоторых аксессуаров.",
  "springcleaning22_cosmetics_cloth_stretch": "Исправлена ошибка, из-за которой ткань на некоторых моделях могла неправильно растягиваться на весь экран.",
  "springcleaning22_cosmetics_underlord_immortal": "Underlord: Immortal-предмет Emerald Subjugation теперь заменяет эффекты у новой ульты.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Shadow Demon: особые эффекты Immortal-предмета Mantle of Grim Facade теперь повёрнуты в правильном направлении.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Wraith King: теперь эффекты Immortal-предмета Blistering Shade имеют более высокий приоритет, чем эффекты Arcana-предмета у способности Wraithfire Blast.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Earthshaker: исправлены визуальные эффекты у Immortal-предмета Bracers of the Cavern Luminar.",
  "springcleaning22_cosmetics_warlock_immortal": "Warlock: исправлены сломанные эффекты способности Shadow Word (как для союзников, так и врагов) у Immortal-предмета Umbral Glyph.",
  "springcleaning22_cosmetics_viper_immortal": "Viper: исправлены сломанные эффекты способности Nethertoxin у Immortal-предмета Malefic Drake's Strike.",
  "springcleaning22_cosmetics_abaddon_vessel": "Abaddon: исправлены эффекты способности Aphotic Shield у предмета Blade of the Demonic Vessel.",
  "springcleaning22_cosmetics_tidehunder_belt": "Tidehunter: убраны ненужные эффекты у предмета Horror From the Deep Belt, которые должны быть на руке, а появлялись на поясе.",
  "springcleaning22_cosmetics_faceless_incursion": "Faceless Void: исправлены визуальные эффекты у оружия Claszureme Incursion.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Drow Ranger: визуальный эффект от ауры Marskmanship с Arcana-предметом теперь имеет цвета для обоих стилей.",
  "springcleaning22_cosmetics_rubick_dilemma": "Rubick: исправлены сломанные эффекты у предмета Torch of Fantoccini's Dilemma.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Techies: теперь анимация бега с сильными ранениями при использовании Arcana-предмета имеет правильную скорость.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Techies: теперь призматический самоцвет Arcana-предмета окрашивает эффекты способностей Sticky Mine и Reactive Tazer.",
  "springcleaning22_cosmetics_techies_icons": "Techies: добавлены отсутствующие иконки инвентаря у некоторых предметов из наборов Powdersled Rookery, Sapper's Guile, Bombtrails and Boomsticks и March of the Powderkeg Patrol.",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Techies: исправлена анимация Спуна на эффекте телепортации с набором Pachyderm Powderwagon.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Rubick: теперь Arcana-предмет получает особый эффект для способности Sticky Bomb вместо Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Snapfire: исправлена ошибка с анимацией оглушения, из-за которой модель могла «застрять» в неправильной серии анимаций.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Legion Commander: набор Radiant Conqueror и все его предметы теперь доступны для продажи и обмена.",
  "springcleaning22_cosmetics_legion_commander_wind": "Legion Commander: добавлены эффекты ветра для знамён Legacy of the Fallen и Radiant Conqueror вне зависимости от использования Arcana-предмета.",
  "springcleaning22_perf_panorama_atlas": "Обновлена часть движка, отвечающая за интерфейс Panorama, чтобы прорисовывание элементов эффективнее использовало графический процессор. В результате наших измерений, необходимая нагрузка на видеокарту при обработке интерфейса снизилась на 25–30%, а для более сложных страниц главного меню — ещё больше. Данное изменение также уменьшает нагрузку на центральный процессор при использовании Vulkan и должно быть особенно эффективно на компьютерах Apple с процессорами M1.",
  "springcleaning22_perf_sand_king_particles": "Эффекты способности Sand Storm оптимизированы с целью улучшения производительности.",
  "springcleaning22_perf_panorama_clears": "Обновлена часть движка, отвечающая за интерфейс Panorama, чтобы ненужные элементы не прорисовывались и не нагружали графический процессор.",
  "springcleaning22_perf_scenesystem_threading": "Исправлена ошибка, из-за которой многоядерная обработка использовала не все ядра. Это исправление особенно будет заметно на компьютерах, у которых 4 ядра или меньше.",
  "springcleaning22_perf_thread_affinity": "Исправлена ошибка неправильной привязки потоков, которая вызывала снижение производительности на некоторых компьютерах.",
  "springcleaning22_perf_power_savings": "Теперь в настройках графики появляется уведомление, если компьютер работает в режиме энергосбережения, из-за которого у игры может быть низкая производительность.",
  "springcleaning22_perf_shop_tooltips": "Улучшена производительность при прорисовке подсказок в лавке.",
  "springcleaning22_custom_games_overview_sort": "Во вкладке «Обзор» теперь можно сортировать режимы не только по числу открытых лобби, но и по числу текущих игроков.",
  "springcleaning22_custom_games_update": "Исправлена ошибка, из-за которой иногда режим нужно было обновить, однако в игре этого не отображалось, из-за чего нужно было переустанавливать либо режим, либо весь Steam.",
  "springcleaning22_custom_games_lobby_version": "В списке открытых лобби больше не учитываются те, к которым нельзя присоединиться из-за того, что они были открыты на прежних версиях режима.",
  "springcleaning22_custom_games_bounty_filter": "Параметр SetFilterMoreGold позволяет фильтровать золото, получаемое от рун богатства.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Реликвия «Bad Juju по 4+ врагам» у Dazzle заменена на «Урона и лечения от Bad Juju».",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Реликвия «Убийств с помощью Remote Mines» у Techies заменена на «Приклеившихся к героям бомб от Sticky Bombs».",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Реликвия «Срабатываний Stasis Trap» у Techies заменена на «Бессилий по 2+ героям от Reactive Tazer».",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Реликвия «Урона от March of the Machines» у Tinker заменена на «Поглощено урона с помощью Defense Matrix».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Реликвия «Убийств после применения Dark Rift» у Underlord заменена на «Убийств союзниками после выхода из портала».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Реликвия «Спасений с помощью Dark Rift» у Underlord заменена на «Урона нанесено с помощью бонуса от Atrophy Aura».",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Исправлена реликвия «Урона от союзников под действием Heavenly Grace» у Omniknight.",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Исправлена реликвия «Onslaught по 2+ героям» у Primal Beast.",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Геройское испытание «Нанесите вражеским героям магический урон» у Meepo заменено на «Нанесите вражеским героям чистый урон».",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Геройское испытание «Вылечите союзных героев способностью Song of the Siren» у Naga Siren заменено на «Нанесите вражеским героям урон сжиганием маны».",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Геройское испытание «Нанесите урон способностью March of the Machines» у Tinker заменено на «Поглотите урон с помощью Defense Matrix».",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Геройское испытание «Нанесите урон способностью Remote Mine» у Techies заменено на «Приклейте бомбы от способности Sticky Bombs».",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Геройское испытание «Совершайте телепортации способностью Dark Rift с 2+ героями» у Underlord заменено на «Применяйте Fiend's Gate, чтобы выйдя из портала союзники совершали убийства».",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Геройское испытание «Наносите урон по врагам, связанным Soul Bind» у Grimstroke теперь учитывает и урон от союзников.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Геройское испытание «Наносите урон по врагам, находясь под действием Leap» у Mirana теперь учитывает любой урон, а не только физический.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Исправлено геройское испытание «Применение Fiend's Grip после Blink Dagger или Force Staff» у Bane.",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Исправлено геройское испытание «Убийства в форме дракона» у Dragon Knight.",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Исправлено геройское испытание «Gust по 2+ героям» у Drow Ranger.",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Исправлено геройское испытание «Убийства крипов способностью Frostbite» у Crystal Maiden.",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Исправлено геройское испытание «Нанесение урона во время Surge» у Dark Seer.",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Исправлено геройское испытание «Нанесение урона во время Rage» у Lifestealer.",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Исправлено геройское испытание «Нанесение урона во время True Form» у Lone Druid.",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Исправлено геройское испытание «Нанесение урона вражеским героям» у Mars.",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Исправлено геройское испытание «Нанесение прорубающего урона врагам» у Mars.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Исправлено геройское испытание «Нанесение урона во время Heavenly Grace» у Omniknight.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Исправлено геройское испытание «Длительное действие Heavenly Grace на союзников» у Omniknight.",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Исправлено геройское испытание «Оглушение 2+ героев с помощью Telekenisis» у Rubick.",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Исправлено геройское испытание «Нанесение урона способностью Laser, улучшенной с помощью Aghanim's Scepter» у Tinker.",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Исправлено геройское испытание «Использование Walrus PUNCH! и Walrus KICK!» у Tusk.",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Удалено геройское испытание «Нанесение урона жертвам Silver Edge» у Venomancer.",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Удалено геройское испытание «Убийство крипов с помощью March of the Machines» у Tinker.",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Добавлено геройское испытание «Нанесение урона вражеским героям с помощью Firestorm» у Underlord.",
  "springcleaning22_workshop_modeldoc": "Инструментарий Мастерской для предметов и пользовательских режимов теперь использует новый редактор моделей ModelDoc. Все имеющиеся работы нужно перенести в него, так как в ближайшем будущем мы удалим старый инструмент."
}