// 2654.js

{
  "language": "hungarian",
  "springcleaning22_desc": "Itt a 2022-es Tavaszi Nagytakarítás frissítés, hogy javítson egy rakás hibát, és eszközöljön néhány új játékminőségi fejlesztést. Nézz meg néhányat a nagyobb változtatások közül, mint az Aghanim elemleírások fejlesztései, a némítási kezelőelemek, a boltbeli keresés és a hőskipróbálás mód, majd ásd bele magad a javítások és játékmenet-igazítások átfogó listájába alább.",
  "springcleaning22_aghs_tooltips": "Aghanim's Scepter és Shard elemleírások",
  "springcleaning22_aghs_tooltips_desc": "Aghanim elméjének (és monológjainak) belső működése kétségtelenül felülmúlja a halandó felfogóképességet, de a mai frissítéssel fenséges jogarainak és szilánkjainak csatatérre gyakorolt hatása korábban nem látott módon került felfedésre. Aghanim fejlesztésleírásai mostantól több részletet tartalmaznak a felszereléskor változó pontos számokról, és a módosított képességek is tartalmazzák ezt az információt egy arra kijelölt szakaszban. Sok fejlesztés is egyedi figyelmet kapott, hogy egyszerűbbek és nem varázslói elménk számára könnyebben felfoghatóvá váljanak.",
  "springcleaning22_muting_ui": "Némítási fejlesztések",
  "springcleaning22_muting_ui_desc": "A Dota játékosok lármás bagázs, és néha a versengés közepette nem a megfelelő érzelmek uralkodnak. Azon esetekben, amikor az ilyen viselkedés zavaróvá válik, fontos, hogy legyen gyors és könnyű mód a játékosok elnémítására és jelentésére további alapos vizsgálathoz anélkül, hogy ez még inkább zavarná a játékodat. E célból mostantól egyetlen kattintás némítja a hangos és szöveges csevegést, és jelenti a játékost. Jobb kattintással némíthatod külön is a hangos és a szöveges csevegést olyan esetekhez, ahol egy játékos viselkedése talán nem zavaró, de a kommunikációja mégsem kívánatos. Könnyű magas szintű szabályozáshoz használhatod az új Csapatnémítás gombokat egy teljes csapat kommunikációjának blokkolásához egy kattintással.\\n\\nKihasználjuk ezt a lehetőséget arra is, hogy újraértékeljük azt, ahogyan a kommunikációs jelentéseket kezeljük. A célunk a zavaró játékosok némításának gyorssá és könnyűvé tétele, miközben arról is világos jelzést kapunk, mely játékosok ellen kell esetleg erősebben fellépni.",
  "springcleaning22_demo_hero": "Hőskipróbálási fejlesztések",
  "springcleaning22_demo_hero_desc": "Szeretnéd kipróbálni a legújabb stratégiákat, vagy megalkotni egy sajátot? Vagy csak elsöprő szükségét érzed látni, hogy hány Axe megtestesülést lehet lemészárolni egyetlen Tidebringer csapással? Így vagy úgy, szerencséd van! A hőskipróbálás frissítve lett egy átdolgozással, ami egy csomó új funkciót tartalmaz:",
  "springcleaning22_demo_hero_map": "A demópálya északi része ki lett terjesztve, hogy több lapos területet biztosítson a teszteléshez.",
  "springcleaning22_demo_hero_hero_spawn": "Vezérlőket adtunk hozzá, hogy az ellenségek mellett szövetséges hősöket is könnyen létre lehessen hozni.",
  "springcleaning22_demo_hero_hero_reset": "Vezérlőt adtunk egy hős 1-es szintre visszaállításához.",
  "springcleaning22_demo_hero_hero_remove": "Vezérlőt adtunk egy hős eltávolításához, miután végeztél a teszteléssel.",
  "springcleaning22_demo_hero_hero_select": "Új hős létrehozása hozzáadja azt a jelenlegi választásodhoz.",
  "springcleaning22_demo_hero_levelling": "A szintlépés, Scepter hozzáadás, Shard hozzáadás és a sérthetetlenséget váltó gombok mostantól minden jelenleg kiválasztott hősre vonatkoznak.",
  "springcleaning22_demo_creep_toggle": "A creepek kikapcsolásakor az összes létező vonali creep elpusztul.",
  "springcleaning22_demo_creep_spawn": "Hozzáadtunk egy gombot egyetlen creephullám létrehozására mindkét oldal felől.",
  "springcleaning22_demo_hero_runes": "Gombokat adtunk a hat fő rúna létrehozásához.",
  "springcleaning22_shop_search": "Frissített bolti keresés",
  "springcleaning22_shop_search_desc": "Az arany elköltésének könnyűnek, szórakoztatónak, és legfőképpen hatékonynak kellene lennie. Így segítségül, hogy a pénzszóró körútjaid „valami ilyesmi” helyett inkább „telitalálatnak” érződjenek, a boltbeli keresést javított kulcsszókereséssel bővítettük, benne egy kijelzővel, ami kiemeli a keresett tulajdonságokat. Csak keress rá a „páncél”, „erő”, „távolság” stb. szavakra a téged érdeklő értékek kiemeléséhez. Soha nem volt könnyebb kiválasztani a tökéletes tárgyat a tökéletes tervhez. Már csak az arany kell hozzá.",
  "springcleaning22_item_tooltips": "Bővített tárgyleírások",
  "springcleaning22_item_tooltips_desc": "Mindig elfelejted, mennyi manát ad az intelligencia? Vagy mennyi páncélt kapsz az ügyességből? Ne töprengj tovább, mert mostantól egyszerűen az ALT nyomva tartása a tárgyak leírását nézve összetevőikké bontja ezeket a jellemzőket.",
  "springcleaning22_colored_ability_damage": "Képességsebzés-színek",
  "springcleaning22_colored_ability_damage_desc": "A jó döntések meghozatala a csatában azon múlik, hogy ismered-e az előtted álló kihívásokat. Hogy segítsünk a lehetséges veszélyek kielemzésében, mostantól a tárgyak és varázslatok okozta sebzések színkódoltak az alapján, hogy a sebzés fizikai, mágikus vagy tiszta.",
  "springcleaning22_pluralized_strings": "Javított nyelvi támogatás a többes számot használó szövegekhez",
  "springcleaning22_pluralized_strings_desc": "Hogy világszerte javítsunk a hozzáférhetőségen, több nyelvhez funkciókat adtunk hozzá a többes számba vételi szabályok jobb támogatására, és több mint 400 sornyi szöveget frissítettünk e változtatások eszközölésére.",
  "springcleaning22_permanent_debuffs": "Maradandó erősítések",
  "springcleaning22_permanent_debuffs_desc": "A stratégiaalkotás nehéz anélkül, hogy értenéd tetteid hatékonyságát. Hogy több információt tegyünk elérhetővé a meccsek után, Necrophos Reaper's Scythe és Axe Culling Blade képessége mostantól látható a játékvégi képernyőn.",
  "springcleaning22_post_game_sortable": "Rendezhető játékvégi részletek",
  "springcleaning22_post_game_sortable_desc": "Mélyebbre akarsz ásni a győzelmeid mögötti részletekben? A játékvégi eredménytábla mostantól rendezhető a könnyebb elemzéshez.",
  "springcleaning22_gameplay_tp_boots": "A Boots of Travel kisebb valószínűséggel céloz creepeket torony hatósugarában varázsolva.",
  "springcleaning22_gameplay_sellback": "A játékosok mostantól a játék kezdetét követő 30 másodpercben adhatnak el tárgyakat teljes áron, az eddigi 10 másodperces visszaadási idő helyett.",
  "springcleaning22_gameplay_lifestealer_consume": "Lifestealer Consume képessége mostantól a fertőzött egységtípustól függetlenül ugyanazt a gyorsbillentyűt használja.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Az Ogre Bruisernek mostantól hangeffektjei vannak a felkészüléshez és a bénításhoz.",
  "springcleaning22_gameplay_neutral_aura_radius": "Mostantól rámutatáskor minden semleges creep aura mutatja a hatósugarát.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "A Wraith Band / Null Talisman / Bracer mostantól frissítik a statisztikabónuszaikat a képesség elemleírásában, amikor a 25. percben megduplázódnak.",
  "springcleaning22_gameplay_heal_overhead": "Javítottuk néhány esetet, amikor a felugró gyógyulási számok nem vették figyelembe a gyógyításerősítést.",
  "springcleaning22_gameplay_fountain_invuln": "A Kút sérthetetlenségerősítéssel rendelkező játékosok mostantól nem támadnak automatikusan, elveszítve az erősítést, amikor ellenség van hatósugárban.",
  "springcleaning22_gameplay_blink_range": "A Blinknek és változatainak varázslásitávolság-jelzője mostantól figyelembe veszi a megnövelt varázslásitávolság-erősítéseket.",
  "springcleaning22_gameplay_desolator_tooltip": "Egyértelműbbé tettük a Desolator Soul Stealer passzív képességének elemleírását. A Desolator támadási sebzést kap, valahányszor Corruption gyengítéssel sújtott ellenség hal meg.",
  "springcleaning22_gameplay_ardm_stash": "Javítottunk egy hibát az All Random Deathmatch módban, ahol ha a játékos halott volt, amikor a futár tárgyat vitt vissza a talonba, a tárgy eltűnt.",
  "springcleaning22_gameplay_neutral_items_lock": "A semleges tárgyakon mostantól nincs egyesítészárolás. Ez javítja a hibát, amikor a futár nem szállított egyesítés-zárolt semleges tárgyakat.",
  "springcleaning22_gameplay_illusion_modifiers": "Javítottunk egy hibát, aminél a duplikált módosítós illúzióknak helytelen időtartama volt, lehetővé téve a valódi hős azonosítását.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Javítottunk egy hibát Turbó és Új játékos módban, aminél néhány aranyforrás nem növekedett a megfelelő mértékben.",
  "springcleaning22_gameplay_turbo_courier": "Javítottunk egy hibát Turbó módban, aminél a játékos futára többé nem működött, ha a játékos hősválasztás vagy stratégiai idő alatt lekapcsolódott.",
  "springcleaning22_gameplay_zero_tooltips": "Javítottunk egy hibát, aminél néhány játékbeli, adottsággal módosult elemleírás 0-át mutatott a helyes érték helyett.",
  "springcleaning22_gameplay_euls_invulnerable": "Eul Scepter varázslása mágiaimmunis klónokon mostantól helyesen alkalmazza a klónra a hatást, és nem pusztán csak újratöltődésre kerül.",
  "springcleaning22_gameplay_kobold_aura": "A Kobold Prospecting Aurája többé nem alkalmazódik creep hősökre (pl. Lone Druid medvéjére), javítva azt a hibát, hogy helytelenül dupla hatást adott.",
  "springcleaning22_gameplay_aghs_scepter_clones": "A klónok és a Tempest Double-ök mostantól helyesen megkapják a statisztikabónuszukat az Alchemist adta Aghanim's Scepter áldásoktól.",
  "springcleaning22_gameplay_chen_hand_of_god": "Chen Hand of God képessége mostantól helyesen alkalmazza az időarányos gyógyítást a Chen által irányított creepeken, nem csak a kezdeti gyógyítást.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Arc Warden Tempest Double távolsági támadási büntetése mostantól tekintettel van Arc Warden reinkarnálódására.",
  "springcleaning22_gameplay_arc_warden_basher": "Hozzáadtunk egy elemleírást, ami tisztázza, hogy a klónok és a Tempest Double-ök Skull Basherrel vagy Abyssal Blade-del nem tudnak Basht okozni.",
  "springcleaning22_gameplay_arc_warden_blink": "A Blink Dagger megidézéskor már nincs újratöltődésen Arc Warden Tempest Double-ján.",
  "springcleaning22_gameplay_arc_warden_wards": "Arc Warden Tempest Double-ja mostantól nem kaphat megosztott wardokat.",
  "springcleaning22_gameplay_pa_scepter_double": "Phantom Assassin Aghanim's Scepteres fejlesztése Tempest Double megölésekor mostantól nem frissíti a Blurt.",
  "springcleaning22_gameplay_naga_siren_riptide": "Naga Siren -1 Rip Tide találat módosítója mostantól helyesen csak eggyel, és nem kettővel csökkenti az értéket.",
  "springcleaning22_gameplay_legion_commander_duel": "Legion Commander Duel sebzésbónusza akkor is megadásra kerül, ha a győztes sebezhetetlen.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Tusk Walrus Kickjének mostantól a helyes, 12 másodperces újratöltődési ideje van.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Terrorblade Metamorphosisának mostantól a helyes, 35/40/45/50 mp-es újratöltődési ideje van.",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey King Tree Dance képessége mostantól nem tud megszökni az Arena of Bloodból.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "Ability Draftben Naga Siren Riptide effektjei mostantól a helyes hősön játszódnak le, nem mindig Naga Sirenen.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki mostantól varázsolhat Smoke Screent Tricks of the Trade fenntartása közben a fenntartás megszakítása nélkül, még ha a „Képességek fenntartása megállást/tartást igényel” be is van kapcsolva.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Javítottuk Marci Dispose képességének együttműködését a Black King Barral és a Lotus Orbbal.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Sniper Concussive Grenade képessége mostantól egy fej fölött lefegyverzés ikont jelenít meg.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling mostantól nem tartja meg végleg a Spirit Link passzívját, amikor Lone Druiddá alakul.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Hozzáadtuk a hiányzó fenntartás ikont Underlord Fiend's Gate-jéhez.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Hozzáadtuk a hiányzó elemleírást az Ancient Ice Shaman Icefire Bomb képességének gyengítéséhez.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Dark Willow Aghanim's Shardos Cursed Crown részecskeeffektjének most már helyes az időzítése.",
  "springcleaning22_gameplay_lone_druid_midas": "Hand of Midas használata Lone Druid Spirit Bearjén mostantól tapasztalatot ad az irányító hősnek.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "A Spirit Bear és a Tempest Double-ök mostantól szerezhetnek Magic Stick, Magic Wand és Holy Locket tölteteket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Void Spirit Astral Step képességleírása mostantól helyesen mutatja a varázslaterősítés értékeket az ALT lenyomásakor.",
  "springcleaning22_gameplay_heavenly_jump_range": "Zeus Heavenly Jump képessége mostantól rámutatáskor mutatja a hatótávját.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Javítottuk Crystal Maiden Arcane Aura képességleírásait.",
  "springcleaning22_gameplay_hex_tooltip": "Javítottuk, hogy Shadow Shaman Hex képességleírása helytelenül hozzáadott 1 másodpercet az időtartamához a „Hex Breaket alkalmaz” adottság választásakor.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Javítottuk, hogy Abaddon 20. szintű adottsága nem frissítette a Borrowed Time újratöltődési idejét a képességleírásban.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Javítottuk, hogy Shadow Fiend Presence of the Dark Lord képessége helyesen alkalmazódjon semleges creepekre.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Javítottuk, hogy Tinker Warp Flare képessége működött Roshanon.",
  "springcleaning22_gameplay_ability_draft_wukong": "Javítottuk, hogy Ability Draft módban a Wukong's Command klónoknak nem megfelelő képességeik voltak.",
  "springcleaning22_rubick_illusions": "Javítottunk egy hibát, ami meggátolta, hogy a Rubick illúzióknak a lopott varázslatokon alapuló helyes animációik legyenek (pl. Bane Fiend's Gripje Aghanim's Scepterrel).",
  "springcleaning22_rubick_hunter_in_the_night": "A Hunter in the Night mostantól Aghanim's Scepterrel fejlesztve is ellopható.",
  "springcleaning22_rubick_juxtapose": "A Juxtapose mostantól Aghanim's Scepterrel fejlesztve is ellopható.",
  "springcleaning22_rubick_fireball": "Dragon Knight Fireball képessége mostantól a Dragon Formtól függetlenül lopható el, nem automatikusan van megadva.",
  "springcleaning22_rubick_wolf_bite": "A Wolf Bite mostantól lopottan is működik.",
  "springcleaning22_rubick_depth_shroud": "A Depth Shroud mostantól lopottan is működik.",
  "springcleaning22_rubick_astral_spirit": "Eltávolítottuk az Astral Spirit különálló mozgás képességét, amikor el van lopva. Rubick mostantól ezt a képességet ellopva mindkét varázslathelyet megtarthatja.",
  "springcleaning22_rubick_reverse_time_walk": "A Reverse Time Walk mostantól ugyanarra a képességhelyre cserélődik, mint a Time Walk, ha Rubicknál van Aghanim's Shard. E képesség ellopásakor Rubick mostantól mindkét varázslathelyet megtarthatja.",
  "springcleaning22_rubick_jaunt": "Az Ethereal Jaunt mostantól ugyanarra a képességhelyre cserélődik, mint az Illusory Orb. E képesség ellopásakor Rubick mostantól mindkét varázslathelyet megtarthatja.",
  "springcleaning22_rubick_eject": "Az Eject mostantól ugyanarra a képességhelyre cserélődik, mint a Dismember, ha Rubicknál van Aghanim's Shard. E képesség ellopásakor Rubick mostantól mindkét varázslathelyet megtarthatja.",
  "springcleaning22_rubick_dismember": "A Dismember mostantól kiveti a baráti hőst, ha másik varázslatot lopnak el helyette.",
  "springcleaning22_rubick_spit_out": "A Spit Out mostantól ugyanarra a képességhelyre cserélődik, mint a Gobble Up. E képesség ellopásakor Rubick mostantól mindkét varázslathelyet megtarthatja.",
  "springcleaning22_rubick_decoy": "A Decoy ellopása mostantól nem lopja el a Bushwhacket is. A Decoy varázsláskor továbbra is alkalmazza a Bushwhacket.",
  "springcleaning22_rubick_spirits": "Io Spirits képességének ellopása mostantól helyesen működik Aghanim's Scepter szerzésekor.",
  "springcleaning22_rubick_gravekeepers_cloak": "A Gravekeeper's Cloak mostantól Aghanim's Scepterrel fejlesztve is ellopható.",
  "springcleaning22_rubick_shard_cursed_crown": "Ha Rubicknál van Aghanim's Shard, a Cursed Crown mostantól Bramble Maze-t is létre fog hozni.",
  "springcleaning22_rubick_shard_venomous_gale": "Ha Rubicknál van Aghanim's Shard, a Venomous Gale mostantól Plague Wardokat is létre fog hozni.",
  "springcleaning22_rubick_shard_sprout": "Ha Rubicknál van Aghanim's Shard, a Sprout mostantól treantokat is létre fog hozni.",
  "springcleaning22_rubick_shard_shackles": "Ha Rubicknál van Aghanim's Shard, a Shackles mostantól Serpent Wardokat is létre fog hozni.",
  "springcleaning22_rubick_shard_cold_embrace": "Ha Rubicknál van Aghanim's Shard, a Cold Embrace mostantól Splinter Blastot is ki fog bocsátani.",
  "springcleaning22_rubick_shard_earthshock": "Ha Rubicknál van Aghanim's Shard, az Earthshock Enrage-et is alkalmazni fog.",
  "springcleaning22_rubick_shard_shadow_step": "Ha Rubicknál van Aghanim's Scepter, a Shadow Step Spectral Daggert is alkalmazni fog.",
  "springcleaning22_rubick_shard_terror_wave": "Ha Rubicknál van Aghanim's Scepter, a Terror Wave Metamorphosist is alkalmazni fog.",
  "springcleaning22_rubick_shard_homing_missile": "Ha Rubicknál van Aghanim's Shard, a Homing Missile-nak Rocket Barrage képessége is lesz.",
  "springcleaning22_rubick_shard_slithereen_crush": "Ha Rubicknál van Aghanim's Shard, a Slithereen Crush Corrosive Haze-t is alkalmazni fog.",
  "springcleaning22_rubick_scepter_flak_cannon": "Ha Rubicknál van Aghanim's Scepter, a Flak Cannon mostantól rendelkezni fog a Side Gunner passzívval is.",
  "springcleaning22_rubick_scepter_time_walk": "Ha Rubicknál van Aghanim's Scepter, a Time Walk Time Lockot is alkalmazni fog.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Ha Rubicknál van Aghanim's Scepter, a Shuriken Toss Jinadát is alkalmazni fog.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Ha Rubicknál van Aghanim's Scepter, a Sacred Arrow Starstormot is alkalmazni fog.",
  "springcleaning22_ui_quickcast_vector_targeting": "Az irányított célzás billentyűlenyomáskori gyors varázslásnál megváltozott úgy, hogy az iránykijelölés a billentyű lenyomásakor kezdődik, és a felengedésekor ér véget. Ez ugyanaz a viselkedés, mint a felengedéskori gyors varázslás.",
  "springcleaning22_ui_ward_bounty": "Az Observer Wardok megölésének harci eseménye mostantól mutatja, ki kapta a jutalmat, ha az eltér a megölőtől.",
  "springcleaning22_ui_spectator_hud_player_view": "A nézői HUD mostantól helyesen azt a játékost mutatja, akit nézel.",
  "springcleaning22_ui_post_game_scepter_shard": "Az Aghanim's Scepter és Shard elemleírásai mostantól mutatják hatásukat a játékvégi eredménytáblán.",
  "springcleaning22_ui_post_game_backpack_neutral": "A hátizsák és a semleges tárgyak mostantól láthatók a játékvégi hősrészleteknél.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "A varázslat életlopás értékek az ALT nyomva tartásakor mostantól hősökre és creepekre elkülönítve látszanak.",
  "springcleaning22_ui_skeleton_warrior_rally": "A Skeleton Warrior Rally auráját mostantól egy számlálós erősítés tartja számon, nem több, különálló ikon.",
  "springcleaning22_ui_neutral_item_teleport": "Javítottuk, hogy semleges tárgyak felcserélésekor majd azt követően egy tárgy nagyon gyors teleportálásakor nem a megfelelő lett teleportálva.",
  "springcleaning22_ui_spectator_arcana": "Mostantól ligameccseken nézőként nem jelennek meg a Titokzatos kezelőfelület-elemek.",
  "springcleaning22_ui_ready_check_enter": "A készültségjelzés mostantól elfogadható ENTER megnyomásával.",
  "springcleaning22_ui_alt_item_combine": "A gyorsvásárlási menü tárgyai mostantól az ALT nyomva tartásakor az egész tárgyat mutatják, amivé egyesíthetők.",
  "springcleaning22_ui_alt_items_ready": "A következő tárgyak a Control nyomva tartásával Alt+kattintással azt jelzik a csapatodnak, hogy készen vannak, nem azt, hogy a csapat gyűljön össze: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight és Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "2-ről 3-ra növeltük a stratégia-időben megjelenített Sentry Ward birtoklást. A játék kezdetén legfeljebb 3 Sentry Ward vásárolható.",
  "springcleaning22_ui_guide_pregame": "Hős kiválasztása után a „Tárgyjavaslatok” szakasz mostantól az útmutató első szakaszát fogja mutatni, ha az útmutatónak nincs „Kezdőtárgyak” nevű szakasza.",
  "springcleaning22_ui_ward_planter": "A wardok kiválasztása mostantól azokat a szövetséges játékosokat, nézőket és szövetséges edzőket mutatja, akik letették azt.",
  "springcleaning22_ui_courier_home_button": "A futár „Otthoni bolt” gombja mostantól visszahoz minden nála levő tárgyat a talonba a bázis elérésekor.",
  "springcleaning22_ui_combat_log_key": "A Csatanapló mostantól billentyűhöz rendelhető a Beállításokban.",
  "springcleaning22_ui_combat_log_right_align": "A Csatanapló mostantól jobbra igazított, és nem fedi át a Hőskipróbálás vezérlését.",
  "springcleaning22_ui_combat_log_hud_flip": "A Csatanapló mostantól figyelembe veszi a HUD megfordítását (minitérkép a jobb oldalon), és átmegy a bal oldalra, ha ez be van kapcsolva.",
  "springcleaning22_ui_guide_apos": "Javítottuk, hogy az útmutatók tárgyakkal, illetve képességekkel kapcsolatos megjegyzései mentéskor az aposztrófot „&apos;”-ra és más HTML-jelekre cserélték. Azokat az útmutatókat, amelyek már ezzel a hibával lettek elmentve, manuálisan kell javítani.",
  "springcleaning22_ui_vs_screen_widescreen": "Javítottuk a hősök megjelenítését az Ellenfél képernyőn 21:9-es vagy szélesebb monitorokon.",
  "springcleaning22_ui_charms": "Javítottunk egy hibát, aminél a Talizmánok kezelőfelületen átfedésben voltak a szövegek, ha kettőnél több talizmánod volt.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Javítottunk egy hibát az Utolsó találatok kiképzésben, aminél a kezdésre kattintás a hősöd megjelenése előtt meggátolta a creepek megjelenését.",
  "springcleaning22_ui_intro_scenes": "A bemutatkozó jelenetek (például a Titokzatos / Hősavatár bemutatkozások) mostantól nem jelennek meg olyan játékosoknak, akik még nem értek végig a kezdeti Új játékos élményen.",
  "springcleaning22_cosmetics_illusion_skins": "Javítottunk egy hibát, aminél az illúziók nem mindig örökölték jól bizonyos díszítőmodellek külsőit.",
  "springcleaning22_cosmetics_cloth_stretch": "Javítottunk egy hibát, aminél bizonyos modelleken a ruha helytelenül keresztülnyúlt a képernyőn.",
  "springcleaning22_cosmetics_underlord_immortal": "Underlord „Smaragd Leigázás” Halhatatlanjának mostantól az ultimate-et lecserélő egyedi képességeffektjei vannak.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Shadow Demon „A Zord Arcok Vállvértje” Halhatatlanjának Shadow Poison lövedékeffektjei mostantól helyes irányúak.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Wraith King „Perzselő Árny” Halhatatlanjának Wraithfire Blast varázslásakor magasabb a prioritása a Titokzatosénál.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Javítottuk Earthshaker „A Fénylő Barlang Karvédői” Halhatatlanjának környezeti effektjeit.",
  "springcleaning22_cosmetics_warlock_immortal": "Javítottuk Warlock „Árnyvéset” Halhatatlanjának hibás Shadow Word (erősítés és gyengítés) képességeffektjeit.",
  "springcleaning22_cosmetics_viper_immortal": "Javítottuk Viper „Az Ártó Sárkány Csapása” Halhatatlanjának hibás Nethertoxin hatóterületi részecskéit.",
  "springcleaning22_cosmetics_abaddon_vessel": "Helyreállítottuk Abaddon „A Démoni Hajó Pengéje” Aphotic Shield effektjeit.",
  "springcleaning22_cosmetics_tidehunder_belt": "Tidehunter „Mélységi Borzalom Öv” tárgyánál a helytelen részecskék, amelyeknek a karon kellene lenniük, el lettek távolítva az övtárgyhelyről.",
  "springcleaning22_cosmetics_faceless_incursion": "Javítottuk Faceless Void „Claszureme Betolakodás” fegyverének környezeti effektjeit.",
  "springcleaning22_cosmetics_drow_arcana_aura": "A Drow Ranger Titokzatos Marksmanship aurájának mostantól mindkét stílushoz van egyedi effektje.",
  "springcleaning22_cosmetics_rubick_dilemma": "Helyreállítottuk Rubick „A Bábjátékos Dilemmája Fáklya” tárgyának környezeti effektjeit.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "A Techies Titokzatos sebesült futási animációja mostantól helyes sebességgel játszódik le.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Ékkőszín-támogatást adtunk a Techies Titokzatosában a Sticky Bombhoz és a Reactive Tazerhez.",
  "springcleaning22_cosmetics_techies_icons": "Hozzáadtuk a hiányzó gazdaságikonokat a Techies „Lőporosszán Tanya”, „Az Utász Ármánya”, „Bombanyomok és Morajbotok” és „A Lőporos Őrjárat Menetelése” szettjeihez.",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Javítottuk a Techies Spoonjának animációját teleportálási előnézetben a Vastagbőrű Lőporkocsi szettel.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Rubick Titokzatosának mostantól a Remote Mine helyett a Techies Sticky Bombjához vannak egyedi effektjei.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Javítottuk Snapfire magatehetetlenségi animációját, hogy többé ne ragadjon be egy helytelenül ismétlődő animációba.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Legion Commander „Ragyogó Hódító” csomagja és tárgyai mostantól értékesíthetők és cserélhetők.",
  "springcleaning22_cosmetics_legion_commander_wind": "Széleffektet adtunk Legion Commander „Az Elesett Légió Öröksége” és „Ragyogó Hódító” lobogóihoz, a Titokzatos fegyver felszerelésével és anélkül is.",
  "springcleaning22_perf_panorama_atlas": "Frissítettük a Panorama UI motorját textúra-atlaszok használatához, hogy hatékonyabban működjön együtt a GPU-val. Méréseink szerint ez 25-30%-kal jobb teljesítményt eredményezett a HUD-hoz szükséges GPU-munkában, és sokkal többet egyes különösen bonyolult műszerfal-oldalakon. Ez a változás a CPU-teljesítményt is növeli Vulkanon, M1 processzoros Apple számítógépeknél pedig különösen hatásosnak kellene lennie.",
  "springcleaning22_perf_sand_king_particles": "Optimalizáltuk a „Sand Storm” részecskeeffekteket a teljesítmény javításához.",
  "springcleaning22_perf_panorama_clears": "Frissítettük a Panorama UI motort egyes szükségtelen képalkotó-célpont ürítések elkerülésére, ami csökkenti a GPU-munkát.",
  "springcleaning22_perf_scenesystem_threading": "Javítottunk egy hibát, aminél néha a tervezettnél kevesebb szálat használtunk többszálas feldolgozáshoz. Ez a javítás 4 vagy kevesebb magos gépeknél különösen hasznos.",
  "springcleaning22_perf_thread_affinity": "Javítottunk egy hibát, aminél a helytelenül beállított szálaffinitások egyes gépeken befulladásokat eredményezhettek.",
  "springcleaning22_perf_power_savings": "Hozzáadtunk egy figyelmeztetést a képbeállítások párbeszédablakban annak jelzésére, ha a számítógép energiatakarékos módban van, ami alacsony teljesítményhez vezethet.",
  "springcleaning22_perf_shop_tooltips": "Javítottuk az elemleírások teljesítményét a tárgybolt böngészése közben.",
  "springcleaning22_custom_games_overview_sort": "Az Árkád Áttekintés füle mostantól lehetővé teszi a Nyílt várók száma mellett a „Jelenleg aktív játékosok” szerinti rendezést is.",
  "springcleaning22_custom_games_update": "Javítottunk egy problémát, aminél a Dota Árkád egyedi játékai néha nem mutatták, hogy frissítésre van szükségük, hacsak nem lettek újratelepítve, vagy a Steam nem lett újraindítva.",
  "springcleaning22_custom_games_lobby_version": "A Dota Árkád várólistája többé nem mutat olyan várókat, amelyek nem felelnek meg az egyedi játék jelenleg telepített verziójának, vagy más okból nem lehet hozzájuk csatlakozni.",
  "springcleaning22_custom_games_bounty_filter": "A SetFilterMoreGold mostantól szűrni tudja az Adomány rúnáktól kapott aranyat.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Lecseréltük Dazzle relikviáját: a „Négy ellenséges Juju gyengítés” helyett „Sebzés és gyógyítás Bad Jujuval”.",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Lecseréltük a Techies relikviáját: az „Ölés Remote Minesszal” helyett „Hősökre ragadt Sticky Bomb”.",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Lecseréltük a Techies relikviáját: a „Bénítás Stasis Trappel” helyett „Többhősös Reactive Tazer lefegyverzés”.",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Lecseréltük Tinker relikviáját: a „Sebzés March of the Machineszal” helyett „Defense Matrix elnyelt sebzés”.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Lecseréltük Underlord relikviáját: a „Dark Rift utáni ölés” helyett „Szövetséges ölés Fiend's Gate használatával”.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Lecseréltük Underlord relikviáját: a „Dark Rifttel megmentett hős” helyett „Atrophy Aura okozta többletsebzés”.",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Javítottuk Omniknight relikviáját: „Szövetséges sebzés Heavenly Grace közben”.",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Javítottuk Primal Beast relikviáját: „Többhősös Onslaught találat”.",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Lecseréltük Meepo Hőspróbáját: „Okozz mágikus sebzést hősöknek” helyett „Okozz tiszta sebzést hősöknek”.",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Lecseréltük Naga Siren Hőspróbáját: „Gyógyíts hősöket Song of the Siren használatával” helyett „Okozz manaégetési sebzést hősöknek”.",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Lecseréltük Tinker Hőspróbáját: „March of the Machines sebzés” helyett „Defense Matrixszal elnyelt sebződés”.",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Lecseréltük a Techies Hőspróbáját: „Ölés Remote Minesszal” helyett „Hősökre ragadt Sticky Bomb”.",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Lecseréltük Underlord Hőspróbáját: „Többhősös Dark Rift teleportálások” helyett „Szövetséges ölések a Fiend's Gate használata után”.",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Frissítettük Grimstroke Hőspróbáját: a „Soulbind hatása alatt álló ellenségeknek okozott sebzés” mostantól a szövetségesektől származó sebzést is tartalmazza.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Frissítettük Mirana Hőspróbáját: a „Leap alatt okozott sebzés” mostantól az összes sebzésfajtát tartalmazza, nem csak a fizikait.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Javítottuk Bane Hőspróbáját: „Blink / Force Staff és Fiend's Grip kombinációk”.",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Javítottuk Dragon Knight Hőspróbáját: „Ölések Dragon Form közben”.",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Javítottuk Drow Ranger Hőspróbáját: „2 vagy több ellenség elnémítása Gusttal”.",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Javítottuk Crystal Maiden Hőspróbáját: „Creep-ölések Frostbite-tal”.",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Javítottuk Dark Seer Hőspróbáját: „Surge során okozott sebzés”.",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Javítottuk Lifestealer Hőspróbáját: „Rage során okozott sebzés”.",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Javítottuk Lone Druid Hőspróbáját: „True Form közben okozott sebzés”.",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Javítottuk Mars Hőspróbáját: „Ellenséges hősöknek okozott sebzés”.",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Javítottuk Mars Hőspróbáját: „Ölj ellenséges egységeket Cleave-vel”.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Javítottuk Omniknight Hőspróbáját: „Heavenly Grace során okozott sebzés”.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Javítottuk Omniknight Hőspróbáját: „Heavenly Grace időtartam szövetségeseken”.",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Javítottuk Rubick Hőspróbáját: „Többhősös Telekinesis bénítások”.",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Javítottuk Tinker Hőspróbáját: „Aghanim's Scepterrel fejlesztett Laserrel okozott sebzés hősöknek”.",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Javítottuk Tusk Hőspróbáját: „Punch és Kick kombinációk”.",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Eltávolítottunk egy Hőspróbát Venomancertől: „Silver Edge által megtört hősöknek okozott sebzés”.",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Eltávolítottunk egy Hőspróbát Tinkertől: „Creep-ölések March of the Machineszal”.",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Hőspróbát adtunk Underlordhoz: „Firestormmal hősöknek okozott sebzés”.",
  "springcleaning22_workshop_modeldoc": "A Dota 2 Műhely-eszközök frissítve lettek tárgyakhoz és egyedi játékokhoz az új „ModelDoc” modellszerkesztő használatára. A Műhely-hozzájárulóknak át kell költöztetniük meglévő modelljeiket a régi eszközről, ami egy jövőbeli frissítéssel el lesz távolítva."
}