// 2416.js

{
  "language": "bulgarian",
  "springcleaning22_desc": "Обновлението „Пролетно почистване“ 2022 е тук, за да поправи неопределен брой от грешки и да въведе куп нови подобрения, свързани с качеството на преживяването. Разгледайте някои от най-големите промени. Като например подобрения на поясненията за Aghanim's Scepter/Shard, контролите за заглушаване, търсачката в магазини и режима за демо на герой. А след това се разровете из по-дългия списък с промени и корекции на игралното преживяване в изчерпателната разбивка по-долу.",
  "springcleaning22_aghs_tooltips": "Пояснения за Aghanim's Scepter и Shard",
  "springcleaning22_aghs_tooltips_desc": "Вътрешните механизми на ума (и монолога) на Aghanim несъмнено са отвъд схващанията на простосмъртните, но с днешното обновление въздействието от неговите великолепни Scepters и Shards върху бойното поле беше разкрито както никога досега. Поясненията за подобренията с Aghanim's Scepter и Shard вече включват още подробности за точните стойности, които се променят при екипирането им, а модифицираните умения също включват тази информация в специализирана секция. Много подобрения също получиха индивидуално внимание, така че да бъдат опростени и по-лесни за разбиране от немагическите ни умове.",
  "springcleaning22_muting_ui": "Подобрения за заглушаването",
  "springcleaning22_muting_ui_desc": "Dota 2 играчите са бурна тайфа и понякога в разгара на съревнованието доминират грешният вид емоции. В случаите, когато това поведение стане подривно, е важно да имате бърз и лесен способ да заглушите играчите и да ги докладвате за допълнителна подробна проверка, без по-нататъшно нарушаване играта Ви. За тази цел едно кликване вече ще заглушава гласовия/текстовия чат и ще докладва даден играч. Също така можете да кликнете с десния бутон, за да заглушите текстовия или гласовия чат самостоятелно едни от други в случаите, когато е възможно поведението на даден играч да не е подривно, но комуникацията му да е все така нежелана. За удобна висока степен на контрол също можете да използвате новия бутон за „Отборно заглушаване“, така че да блокирате комуникацията към цял отбор с едно кликване.\\n\\nСъщо така ще се възползваме от тази благоприятна възможност, така че да преоценим как боравим с комуникационните доклади. Целите ни са да направим заглушаването на подривни играчи бързо и лесно, като същевременно с това придобием ясна индикация относно това към кои играчи може да се наложи да предприемем по-строги действия.",
  "springcleaning22_demo_hero": "Подобрения на режима за демо на герой",
  "springcleaning22_demo_hero_desc": "Искате да изпробвате най-новите стратегии или да създадете свои собствени? А може би просто изпитвате съкрушителна нужда да видите колко превъплъщения на Axe могат да бъдат заклани с един удар на Tidebringer? Така или иначе, имате късмет! Демо режимът за герои е обновен с преработка, която включва цял куп нови характеристики:",
  "springcleaning22_demo_hero_map": "Северната секция на демо карта беше разширена, така че да предостави по-плоска площ за тестване;",
  "springcleaning22_demo_hero_hero_spawn": "Добавени са контроли за лесно призоваване на съюзнически герои, освен вражеските;",
  "springcleaning22_demo_hero_hero_reset": "Добавени са контроли за нулиране на даден герой обратно до ниво 1;",
  "springcleaning22_demo_hero_hero_remove": "Добавени са контроли за премахване на даден герой, щом сте приключили с тестването;",
  "springcleaning22_demo_hero_hero_select": "Създаването на нов герой ще го добави към текущия Ви подбор;",
  "springcleaning22_demo_hero_levelling": "Бутоните за повишаване на нива, добавяне на Aghanim's Scepter/Shard и превключването на неуязвимост вече се прилагат към всички понастоящем избрани герои;",
  "springcleaning22_demo_creep_toggle": "Когато изключвате крийповете, всички съществуващи такива в алеите ще бъдат унищожени;",
  "springcleaning22_demo_creep_spawn": "Добавен е бутон за призоваване на една вълна с крийпове от всяка страна;",
  "springcleaning22_demo_hero_runes": "Добавени са бутони за призоваване на 6 значими руни.",
  "springcleaning22_shop_search": "Обновена търсачка за магазина",
  "springcleaning22_shop_search_desc": "Харченето на злато трябва да бъде лесно, забавно и най-вече ефективно. Ето защо, с цел да Ви помогнем да се чувствате някак по-малко като „пропуск“ и много повече като „попадение“, търсачката в магазин за предмети е разширена с подобрена поддръжка за ключови думи — включвайки изобразяване на отличени търсени атрибути. Просто потърсете „броня“, „сила“, „обсег“ и т.н., за да отличите статистиките, които Ви интересуват. Избирането на перфектния предмет за идеалния план никога не е било по-лесно. Сега вече Ви е нужно само златото.",
  "springcleaning22_item_tooltips": "Разширени пояснения на предметите",
  "springcleaning22_item_tooltips_desc": "Все забравяте колко мана се предоставя от този интелект? Или пък колко броня получавате от дадена ловкост? Не е нужно да умувате, тъй като простото задържане на ALT, докато гледате поясненията за предмети, вече ще разширява тези свойства в частите всичките им компоненти.",
  "springcleaning22_colored_ability_damage": "Цветове за щетите на умения",
  "springcleaning22_colored_ability_damage_desc": "Вземането на добри решения в битка разчита на това да познавате предизвикателствата, пред които сте изправени. С цел да Ви помогнем при осмислянето на потенциалните опасности, щетите, нанасяни от заклинания и предмети, вече са цветово кодирани според това дали са физически, магически или същински.",
  "springcleaning22_pluralized_strings": "Подобрена езикова поддръжка за низове в множествено число",
  "springcleaning22_pluralized_strings_desc": "С цел да подобрим достъпността по целия свят, добавихме характеристики, така че по-добре да поддържаме правилата за множествено число в много езици и обновихме над 400 реда текст, за да отразим тези промени.",
  "springcleaning22_permanent_debuffs": "Перманентни бъфове",
  "springcleaning22_permanent_debuffs_desc": "Вземането на стратегически решения е трудно, без да разбирате ефикасността на своите действия. С цел да направим още информация достъпна след даден мач, убийствата от Reaper's Scythe на Necrophos и Culling Blade на Axe вече се показват на екрана след игра.",
  "springcleaning22_post_game_sortable": "Сортиране на подробностите след игра",
  "springcleaning22_post_game_sortable_desc": "Искате да се задълбочите в подробностите зад победите Ви? Таблото с резултати след играта вече позволява сортиране за по-лесен анализ.",
  "springcleaning22_gameplay_tp_boots": "Boots of Travel е по-малко вероятно да се прицели към крийп, когато е изпълнено в обсег на кула;",
  "springcleaning22_gameplay_sellback": "Играчите вече могат да продадат даден предмет за пълната цена през първите 30 секунди, след като играта започне вместо през нормалния 10 секунден период за обратна продажба;",
  "springcleaning22_gameplay_lifestealer_consume": "Consume на Lifestealer вече използва същия бърз клавиш, независимо от типа на единицата, повлияна от Infest;",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Ogre Bruiser вече разполага със звукови ефекти за своето подготвяне и зашеметяване;",
  "springcleaning22_gameplay_neutral_aura_radius": "Всички аури на неутрални крийпове вече показват своите радиуси при задържане на мишката;",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Wraith Band/Null Talisman/Bracer вече обновяват бонусите за статистиките си в пояснението на умението, когато се удвоят при 25 минута;",
  "springcleaning22_gameplay_heal_overhead": "Поправени са редица случаи, при които изскачащите цифри за лечение не вземаха предвид усилването му;",
  "springcleaning22_gameplay_fountain_invuln": "Играчите с бъфа за неуязвимост от фонтана вече няма да атакуват автоматично и да го пречупват, когато даден враг е в рамките на обсега;",
  "springcleaning22_gameplay_blink_range": "Индикаторът за обсега на заклинания при Blink и вариантите му вече взема предвид увеличения обхват на заклинания от бъфове;",
  "springcleaning22_gameplay_desolator_tooltip": "Разяснено е пояснението за пасивното умение от Soul Stealer на Desolator. Desolator придобива щети за атака всеки път, когато даден враг умре, докато е повлиян от Corruption дебъфа;",
  "springcleaning22_gameplay_ardm_stash": "Поправена е грешка в ARDM, при която даден куриер, връщащ предмет в скривалището, докато е мъртъв, водеше до изчезването на предмета;",
  "springcleaning22_gameplay_neutral_items_lock": "Комбинирането на неутралните предмети вече не може да бъде заключвано. Това поправя грешка, при която куриерите не доставят неутрални предмети със заключено комбиниране;",
  "springcleaning22_gameplay_illusion_modifiers": "Поправена е грешка, при която илюзиите с дублирани модификатори разполагаха с неправилно времетраене, позволявайки истинският герой да бъде идентифициран;",
  "springcleaning22_gameplay_turbo_gold_scaling": "Поправена е грешка в Turbo и „Режима за нови играчи“, при която някои източници на злато не се изчисляваха правилно;",
  "springcleaning22_gameplay_turbo_courier": "Поправена е грешка в Turbo, при която куриерът на даден играч нямаше да работи, ако той е бил разкачен по време на избора за герои или стратегическия стадий;",
  "springcleaning22_gameplay_zero_tooltips": "Поправена е грешка, при която някои пояснения в играта, които се модифицират от таланти, изобразяваха 0 вместо правилната стойност;",
  "springcleaning22_gameplay_euls_invulnerable": "Изпълняването на Eul's Scepter върху клонинги с имунитета срещу магия, вече правилно ще прилага ефекта си върху тях, вместо просто да влиза във време за изчакване;",
  "springcleaning22_gameplay_kobold_aura": "Prospecting Aura на Kobold вече не се прилага за крийпове на герои (напр. мечката на Lone Druid), поправяйки грешка, при която неправилно предоставяше двоен ефект;",
  "springcleaning22_gameplay_aghs_scepter_clones": "Клонингите и Tempest Doubles вече правилно получават бонус статистиките, предоставени от Alchemist благодати на Aghanim's Scepter;",
  "springcleaning22_gameplay_chen_hand_of_god": "Hand of God на Chen вече правилно прилага лечението през време към крийпове, контролирани от Chen, а не само първоначалното такова;",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Tempest Double на Arc Warden — наказанието за атака от разстояние вече уважава превъплъщаването на Arc Warden;",
  "springcleaning22_gameplay_arc_warden_basher": "Добавено е пояснение, разясняващо, че клонингите и Tempest Doubles не могат да фрасват с Basher или Abyssal;",
  "springcleaning22_gameplay_arc_warden_blink": "Blink Dagger при Tempest Double на Arc Warden вече не е във време за изчакване при призоваване;",
  "springcleaning22_gameplay_arc_warden_wards": "Tempest Double на Arc Warden вече не може да получава споделени Wards;",
  "springcleaning22_gameplay_pa_scepter_double": "Aghanim's Scepter подобрението за Phantom Assassin вече не опреснява Blur, когато убива Tempest Double;",
  "springcleaning22_gameplay_naga_siren_riptide": "Талантът на Naga Siren -1 изисквани удари за Rip Tide вече правилно ги намалява с 1, а не 2;",
  "springcleaning22_gameplay_legion_commander_duel": "Duel на Legion Commander — бонус щетите вече се връчват дори ако победителят е неуязвим;",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Walrus Kick на Tusk вече разполага с правилното време за изчакване от 12 секунди;",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Metamorphosis на Terrorblade вече разполага с правилното времетраене от 35/40/45/50;",
  "springcleaning22_gameplay_monkey_king_arena": "Tree Dance на Monkey King вече не може да избяга от Arena of Blood;",
  "springcleaning22_gameplay_naga_siren_ability_draft": "В Ability Draft, Rip Tide ефектите на Naga Siren вече ще се изпълняват върху правилния герой, вместо винаги да са върху Naga Siren;",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki вече може да ползва Smoke Screen, докато изпълнява Tricks of the Trade. Това става, без да прекъсва изпълняването, дори ако „Изпълняващите се умения изискват задържане/спиране“ е включено;",
  "springcleaning22_gameplay_marci_dispose_lotus": "Поправени са взаимодействията за Dispose на Marci с BKB и Lotus Orb;",
  "springcleaning22_gameplay_sniper_grenade_icon": "Concussive Grenade на Sniper вече добавя икона за обезоръжаване над главата;",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling вече не запазва перманентно пасивното умение на Spirit Link, когато се преобразува в Lone Druid;",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Добавена е липсваща икона за изпълняване към Fiend's Gate на Underlord;",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Добавено е липсващо пояснение за дебъфа на Icefire Bomb;",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Cursed Crown на Dark Willow — ефектите на частиците с Aghanim's Shard вече разполагат с правилното време за поява;",
  "springcleaning22_gameplay_lone_druid_midas": "Използването на Hand of Midas върху Spirit Bear на Lone Druid вече предоставя опит на контролиращия герой;",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear и Tempest Doubles вече могат да придобиват заряди за Magic Stick, Magic Wand и Holy Locket;",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Astral Step на Void Spirit — пояснението вече правилно показва стойностите за усилване, когато е натиснат ALT;",
  "springcleaning22_gameplay_heavenly_jump_range": "Heavenly Jump на Zeus вече показва своя обсег при задържане на мишката;",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Поправени са поясненията за Arcane Aura на Crystal Maiden;",
  "springcleaning22_gameplay_hex_tooltip": "Поправено е пояснението за Hex на Shadow Shaman, добавящо погрешно 1 секунда към времетраенето, когато е избран таланта „Hex пречупва“;",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Поправена е, че талантът за ниво 20 на Abaddon не обновяваше времето за изчакване на Borrowed Time в пояснението;",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Presence of the Dark Lord на Shadow Fiend е поправено, така че правилно да се прилага върху неутрални крийпове;",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Warp Flare на Tinker — поправено е, че работеше върху Roshan;",
  "springcleaning22_gameplay_ability_draft_wukong": "В Ability Draft е поправено, че клонингите от Wukong's Command не разполагаха с правилните умения.",
  "springcleaning22_rubick_illusions": "Поправена е грешка, която възпрепятстваше илюзиите на Rubick да разполагат с правилни анимации, спрямо откраднатите заклинания (напр. Fiend's Grip на Bane с Aghanim's Scepter);",
  "springcleaning22_rubick_hunter_in_the_night": "Hunter in the Night вече може да бъде откраднато, когато е подобрено от Aghanim's Shard;",
  "springcleaning22_rubick_juxtapose": "Juxtapose вече може да бъде откраднато, когато е подобрено от Aghanim's Scepter;",
  "springcleaning22_rubick_fireball": "Fireball на Dragon Knight може да бъде откраднато, независимо от Dragon Form и не се предоставя автоматично;",
  "springcleaning22_rubick_wolf_bite": "Wolf Bite вече работи, когато е откраднато;",
  "springcleaning22_rubick_depth_shroud": "Depth Shroud вече работи, когато е откраднато;",
  "springcleaning22_rubick_astral_spirit": "Премахнато е отделно умение за движението на Astral Spirit при кражба. Rubick вече може запази и двата слота за заклинания, когато краде това умение;",
  "springcleaning22_rubick_reverse_time_walk": "Reverse Time Walk вече се заменя в същия слот за умение като Time Walk, ако Rubick разполага с Aghanim's Shard. Rubick вече може запази и двата слота за заклинания, когато краде това умение;",
  "springcleaning22_rubick_jaunt": "Ethereal Jaunt вече се заменя в същия слот за умение като Illusory Orb. Rubick вече може запази и двата слота за заклинания, когато краде това умение;",
  "springcleaning22_rubick_eject": "Eject вече се заменя в същия слот за умение като Dismember, ако Rubick разполага с Aghanim's Shard. Rubick вече може запази и двата слота за заклинания, когато краде това умение;",
  "springcleaning22_rubick_dismember": "Dismember вече изхвърля приятелския герой, ако наместо Dismember е откраднато друго заклинание;",
  "springcleaning22_rubick_spit_out": "Spit Out вече се заменя в същия слот за умение като Gobble Up. Rubick вече може запази и двата слота за заклинания, когато краде това умение;",
  "springcleaning22_rubick_decoy": "Кражбата на Decoy вече не краде и Bushwhack. Decoy все още прилага Bushwhack, когато се изпълнява;",
  "springcleaning22_rubick_spirits": "Кражбата на Spirits от Io вече работи правилно, когато се взема Aghanim's Scepter;",
  "springcleaning22_rubick_gravekeepers_cloak": "Gravekeeper's Cloak вече може да бъде откраднато, когато е подобрено от Aghanim's Shard;",
  "springcleaning22_rubick_shard_cursed_crown": "Ако Rubick разполага с Aghanim's Shard, Cursed Crown вече също ще създава Brambles;",
  "springcleaning22_rubick_shard_venomous_gale": "Ако Rubick разполага с Aghanim's Shard, Venomous Gale вече също ще създава Plague Wards;",
  "springcleaning22_rubick_shard_sprout": "Ако Rubick разполага с Aghanim's Shard, Sprout вече също ще създава Treants;",
  "springcleaning22_rubick_shard_shackles": "Ако Rubick разполага с Aghanim's Shard, Shackles вече също ще създава Serpent Wards;",
  "springcleaning22_rubick_shard_cold_embrace": "Ако Rubick разполага с Aghanim's Shard, Cold Embrace вече също ще излъчва Splinter Blast;",
  "springcleaning22_rubick_shard_earthshock": "Ако Rubick разполага с Aghanim's Shard, Earthshock също ще прилага Enrage;",
  "springcleaning22_rubick_shard_shadow_step": "Ако Rubick разполага с Aghanim's Shard, Shadow Step също ще прилага Spectral Dagger;",
  "springcleaning22_rubick_shard_terror_wave": "Ако Rubick разполага с Aghanim's Shard, Terror Wave също ще прилага Metamorphosis;",
  "springcleaning22_rubick_shard_homing_missile": "Ако Rubick разполага с Aghanim's Shard, Homing Missile също ще има Rocket Barrage;",
  "springcleaning22_rubick_shard_slithereen_crush": "Ако Rubick разполага с Aghanim's Shard, Slithereen Crush вече също ще прилага Corrosive Haze;",
  "springcleaning22_rubick_scepter_flak_cannon": "Ако Rubick разполага с Aghanim's Scepter, Flak Cannon също ще има пасивното умение на Side Gunner;",
  "springcleaning22_rubick_scepter_time_walk": "Ако Rubick разполага с Aghanim's Scepter, Time Walk също ще прилага Time Lock;",
  "springcleaning22_rubick_scepter_shiruken_toss": "Ако Rubick разполага с Aghanim's Scepter, Shuriken Toss също ще прилага Jinada;",
  "springcleaning22_rubick_scepter_sacred_arrow": "Ако Rubick разполага с Aghanim's Scepter, Sacred Arrow също ще прилага Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "Векторното прицелване за бързо изпълняване при натискане на клавиша е променено, така че векторът започва да се изписва при натискане и завършва това при освобождаване на клавиша. Това е същото поведението както при бързо изпълняване при натискане на клавиш;",
  "springcleaning22_ui_ward_bounty": "Бойното събитие за убийство на Observer Ward вече показва кой е получил плячката, ако той се различава от убиеца;",
  "springcleaning22_ui_spectator_hud_player_view": "Проекционният дисплей за наблюдатели вече правилно показва играча, който гледате;",
  "springcleaning22_ui_post_game_scepter_shard": "Поясненията за Aghanim's Scepter и Shard вече показват своите ефекти в таблото с резултати след играта;",
  "springcleaning22_ui_post_game_backpack_neutral": "Раницата и неутралните предмети вече се показват в подробностите за героите след игра;",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Стойностите за кражбата на здраве от заклинания за герои и крийпове вече се показват отделно, докато се задържа клавиша ALT;",
  "springcleaning22_ui_skeleton_warrior_rally": "Rally аурата на Skeleton Warrior вече се проследява от брояч за бъфове, вместо от множество индивидуални икони за такива;",
  "springcleaning22_ui_neutral_item_teleport": "Поправено е това, че достатъчно бързото последователно разменяне на неутрални предмети и телепортирането на един от тях, водеше до това да бъде телепортиран грешният;",
  "springcleaning22_ui_spectator_arcana": "Потребителските интерфейси на Arcana в проекционния дисплей вече няма да се появяват за наблюдатели в мачове от лиги;",
  "springcleaning22_ui_ready_check_enter": "Вече може да се натиска клавиша ENTER, така че да приемете проверка за готовност;",
  "springcleaning22_ui_alt_item_combine": "Предметите в менюто за бърза покупка вече показват пълния такъв, в който се комбинират при задържане на ALT;",
  "springcleaning22_ui_alt_items_ready": "Задържането на CTRL, докато ALT+кликвате върху следните предмети, ще осведоми отбора Ви, че те са готови, а не че трябва да се събират: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight и Smoke of Deceit;",
  "springcleaning22_ui_sentry_pregame": "Увеличен е броят на притежаваните Sentry Wards, изобразявани по време на стратегическия стадий от 2 на 3. Има максимум 3 Sentry Wards, които могат да бъдат закупени в началото на играта;",
  "springcleaning22_ui_guide_pregame": "След като изберете герой, секцията „Препоръчани предмети“ вече ще показва първата секция от дадено ръководство, ако то няма такава, наречена „Начални предмети“;",
  "springcleaning22_ui_ward_planter": "Изборът на Wards вече показва на съюзническите играчи/треньори и наблюдателите кой го е поставил;",
  "springcleaning22_ui_courier_home_button": "Бутонът за „Магазин в базата“ на куриера вече също връща всички предмети, с които той разполага в скривалището, когато достигне базата;",
  "springcleaning22_ui_combat_log_key": "Хронологията на битките вече може да бъде зададена към клавиш в опциите;",
  "springcleaning22_ui_combat_log_right_align": "Хронологията на битките вече е подравнена вдясно и не се припокрива с контролите за демо режима на герой;",
  "springcleaning22_ui_combat_log_hud_flip": "Хронологията на битките вече зачита обръщането на проекционния дисплей (показване на мини картата вдясно) и ще се премести отляво, когато тази опция е включена;",
  "springcleaning22_ui_guide_apos": "Поправено е, че коментарите в ръководства за предмети/умения, заместваха апострофите с „&apos;“ и други HTML символи, когато се запазват. Ръководствата с този проблем, които вече са запазени, все пак ще е нужно да бъдат обновени ръчно;",
  "springcleaning22_ui_vs_screen_widescreen": "Коригирано е изобразяването на герои в „Екрана за съперници“ при съотношение 21:9 или по-широки монитори;",
  "springcleaning22_ui_charms": "Поправена е грешка, при която потребителският интерфейс за амулетите показваше припокриващ се текст, ако имате 2+ такива;",
  "springcleaning22_ui_last_hit_trainer_spawn": "Поправена е грешка в „Тренажора за последни удари“, при която кликването върху стартирането, преди появата на героя Ви щеше да възпрепятства появата на крийпове;",
  "springcleaning22_ui_intro_scenes": "Въвеждащите сцени (като напр. дебютите на герои и Arcana/личности) вече няма да се показват за играчи, които не са преминали през първоначалния поток на „Новото потребителско преживяване“.",
  "springcleaning22_cosmetics_illusion_skins": "Поправена е грешка, при която илюзиите можеше да не наследяват правилно текстурите на определени козметични модели;",
  "springcleaning22_cosmetics_cloth_stretch": "Поправена е грешка, при която платовете на определени модели можеше да се разтягат неправилно по екрана;",
  "springcleaning22_cosmetics_underlord_immortal": "Underlord Immortal „Emerald Subjugation“ — вече разполага с персонализирани ефекти за уменията, които заменят ултимата;",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Shadow Demon Immortal „Mantle of Grim Facade“ — ефектите за снаряда на Shadow Poison вече са ориентирани правилно;",
  "springcleaning22_cosmetics_wraith_king_immortal": "Wraith King Immortal „Blistering Shade“ — разполага с по-висок приоритет над Arcana, когато изпълнява Wraithfire Blast;",
  "springcleaning22_cosmetics_earthshaker_immortal": "Earthshaker Immortal „Bracers of the Cavern Luminar“ — околните ефекти са поправени;",
  "springcleaning22_cosmetics_warlock_immortal": "Warlock Immortal „Umbral Glyph“ — поправени са повредени ефекти за умението Shadow Word (бъф и дебъф);",
  "springcleaning22_cosmetics_viper_immortal": "Viper Immortal „Malefic Drake's Strike“ — поправени са повредени частици за площта на ефекта за Nethertoxin;",
  "springcleaning22_cosmetics_abaddon_vessel": "Abaddon „Blade of the Demonic Vessel“ — ефектите на Aphotic Shield са възстановени;",
  "springcleaning22_cosmetics_tidehunder_belt": "Tidehunter „Horror from the Deep — колан“ — премахнати са неправилни частици от слота на колана, които трябваше да бъдат върху ръката;",
  "springcleaning22_cosmetics_faceless_incursion": "Faceless Void „Claszureme Incursion“ — поправени са околните ефекти на оръжието;",
  "springcleaning22_cosmetics_drow_arcana_aura": "Drow Ranger Arcana „Marksmanship“ — аурата вече разполага с персонализирани ефекти и за двата стила;",
  "springcleaning22_cosmetics_rubick_dilemma": "Rubick „Torch of Fantoccini's Dilemma“ — околните ефекти са възстановени;",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Techies Arcana — анимацията за бягане при наранявания вече се възпроизвежда с правилна скорост;",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Добавена е поддръжка за цветове на скъпоценните камъни върху Sticky Bomb и Reactive Tazer за Techies Arcana;",
  "springcleaning22_cosmetics_techies_icons": "Добавени са липсващи икони за артикули в икономиката на Steam общността за наборите на Techies „Powdersled Rookery“, „Sapper's Guile“, „Bombtrails and Boomsticks“ и „March of the Powderkeg Patrol“;",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Поправена е анимация за Spoon от Techies в прегледа на телепортиране с набора „Pachyderm Powderwagon“;",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Rubick Arcana — вече разполага с персонализирани ефекти за Sticky Bomb на Techies вместо Remote Mine;",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Поправена е анимация на Snapfire при преустановяване, така че вече да не се засяда в неправилна последователност от анимации;",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Legion Commander „Radiant Conqueror“ — комплектите и артикулите вече са продаваеми и търгуеми;",
  "springcleaning22_cosmetics_legion_commander_wind": "Добавени са вятърни ефекти към флаговете на Legion Commander от „Legacy of the Fallen Legion“ и „Radiant Conqueror“ с или без екипирани Arcana оръжия.",
  "springcleaning22_perf_panorama_atlas": "Обновен е двигателят на Panorama потребителския интерфейс, така че да се използва текстурен атлас за по-ефективно взаимодействие с видеокартата. При измерванията ни това доведе до 25% — 30% по-добра производителност в дейността на видеокартата, необходима за проекционния дисплей, а дори много повече в някои особено сложни страници на таблото. Тази промяна също увеличава производителността на процесора под Vulkan, а също така би трябвало да бъде особено ефективна за Apple компютри с M1 процесори;",
  "springcleaning22_perf_sand_king_particles": "Оптимизирани са ефектите на частиците за Sand Storm, така че да се подобри производителността;",
  "springcleaning22_perf_panorama_clears": "Обновен е двигателят на Panorama потребителския интерфейс, за да се избегнат някои ненужни изчиствания на цели за изобразяване. По този начин се избягва излишна работа на видеокартата;",
  "springcleaning22_perf_scenesystem_threading": "Поправена е грешка, при която понякога се използваха по-малко нишки от предвидените за извършване на многонишкова дейност. Тази поправка е особено полезна за машини с 4 или по-малко ядра;",
  "springcleaning22_perf_thread_affinity": "Поправена е грешка, при която неправилно зададените афинитети на нишки можеха да причинят засичане на някои машини;",
  "springcleaning22_perf_power_savings": "Добавено е предупреждение в диалоговия прозорец за видео настройките, така че да се посочи ако компютърът работи в енергоспестяващ режим, което може да доведе до ниска производителност;",
  "springcleaning22_perf_shop_tooltips": "Подобрена е производителността на поясненията, когато се преглежда магазина за предмети.",
  "springcleaning22_custom_games_overview_sort": "Разделът за обзор на аркадата вече позволява сортиране по текущи активни играчи в допълнение към броя на отворените лобита;",
  "springcleaning22_custom_games_update": "Поправен е проблем с персонализираните игри в Dota аркадата, които понякога не показваха, че се нуждаят от обновяване, докато не са преинсталирани или Steam не бъде рестартиран;",
  "springcleaning22_custom_games_lobby_version": "Списъкът с лобита на Dota аркадата вече няма да показва такива, които не съответстват на версията за персонализираната игра, която понастоящем е инсталирана, или по някакъв друг начин не позволява присъединяване;",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold вече може да филтрира златото, получено от руни на изобилието.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Заменена е реликвата за Dazzle — „Bad Juju — дебъфове върху четири врага“ → „Bad Juju — щети и лечение“;",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Заменена е реликвата за Techies — „Remote Mine — убийства“ → „Sticky Bombs — прикачени към герои“;",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Заменена е реликвата за Techies — „Stasis Trap — зашеметявания“ → „Reactive Tazer — обезоръжавания на множество герои“;",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Заменена е реликвата за Tinker — „March of the Machines — щети“ → „Defense Matrix — абсорбирани щети“;",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Заменена е реликвата за Underlord — „Dark Rifts — довели до убийства“ → „Fiend's Gate — съюзнически убийства“;",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Заменена е реликвата за Underlord — „Dark Rift — спасени герои“ → „Atrophy Aura — нанесени бонус щети“;",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Поправена е реликвата за Omniknight — „Heavenly Grace — съюзнически щети, докато трае“;",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Поправена е реликвата за Primal Beast— „Onslaught — попадения върху множество герои“;",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Заменена е реликвата за Meepo — „Магически щети, нанесени на герои“ → „Същински щети, нанесени на герои“;",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Заменена е реликвата за Naga Siren — „Song of the Siren — излекувани съюзници“ → „Щети от обгорена мана, нанесени на герои“;",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Заменено е героичното предизвикателство за Tinker — „March of the Machines — щети“ → „Defense Matrix — абсорбирани щети“;",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Заменено е героичното предизвикателство за Techies — „Remote Mine — убийства“ → „Sticky Bombs — прикачени към герои“;",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Заменено е героичното предизвикателство за Underlord — „Dark Rift — телепортирания на множество герои“ → „Fiend's Gate — съюзнически убийства“;",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Обновено е героичното предизвикателство за Grimstroke — „Soulbind — нанесени щети на повлияни врагове“ вече изключва щетите от съюзници;",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Обновено е героичното предизвикателство за Mirana — „Leap — нанесени щети, докато трае“ вече включва всички типове щети, вместо само физическите;",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Поправено е героичното предизвикателство за Bane — „Blink/Force Staff и Fiend's Grip комбинации“;",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Поправено е героичното предизвикателство за Dragon Knight — „Dragon Form — убийства, докато трае“;",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Поправено е героичното предизвикателство за Drow Ranger — „Gust — заглушаване на 2+ герои“;",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Поправено е героичното предизвикателство за Crystal Maiden — „Frostbite — убийства на крийпове“;",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Поправено е героичното предизвикателство за Dark Seer — „Surge — нанесени щети, докато трае“;",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Поправено е героичното предизвикателство за Lifestealer — „Dragon Form — нанесени щети, докато трае“;",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Поправено е героичното предизвикателство за Lone Druid — „True Form — нанесени щети, докато трае“;",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Поправено е героичното предизвикателство за Mars — „Нанесени щети на вражески “;",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Поправено е героичното предизвикателство за Mars — „Cleave — убити вражески единици“;",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Поправено е героичното предизвикателство за Omniknight — „Heavenly Grace — нанесени щети, докато трае“;",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Поправено е героичното предизвикателство за Omniknight — „Heavenly Grace — времетраене върху съюзници“;",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Поправено е героичното предизвикателство за Rubick — „Telekinesis — зашеметявания на множество герои“;",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Поправено е героичното предизвикателство за Rubick — „Laser с Aghanim's Scepter — щети, нанесени на герои“;",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Поправено е героичното предизвикателство за Tusk — „Walrus Punch и Walrus Kick комбинации“;",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Премахнато е героичното предизвикателство за Venomancer — „Silver Edge — нанесени щети върху пречупени герои“;",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Премахнато е героичното предизвикателство за Tinker — „March of the Machines — убийства на крийпове“;",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Добавено е героичното предизвикателство за Underlord — „Firestorm — щети, нанесени на герои“.",
  "springcleaning22_workshop_modeldoc": "Dota 2 инструментите към работилницата за артикули и персонализирани игри бяха подобрени, така че да използват новия „ModelDoc“ редактор за модели. Сътрудниците от работилницата трябва да мигрират всякакви модели от стария инструмент, който ще бъде премахнат в бъдещо обновление."
}