// 5513.js

{
  "language": "french",
  "springcleaning22_desc": "La mise à jour du nettoyage de printemps 2022 est arrivée : celle-ci élimine des tas de bugs d'un coup de balai et implémente une poignée de nouvelles améliorations de confort. Des changements de taille, détaillés ci-dessous, ont été apportés à la recherche dans l'échoppe, au mode démo, à l'interface pour bloquer des joueurs ou joueuses, ou encore aux descriptions liées à Aghanim. Plongez-vous ensuite dans la liste exhaustive qui suit pour découvrir les nombreux ajustements du gameplay et corrections.",
  "springcleaning22_aghs_tooltips": "Descriptions des effets de l'Aghanim's Scepter et de l'Aghanim's Shard",
  "springcleaning22_aghs_tooltips_desc": "Les ressorts intérieurs de l'esprit d'Aghanim, et par extension son monologue, sont sans nul doute au-delà de toute compréhension humaine, mais avec la mise à jour d'aujourd'hui, l'impact sur le champ de bataille de ses Scepters et Shards divins n'aura jamais été aussi prégnant. Les descriptions des effets améliorés d'Aghanim incorporent désormais plus de détails sur les nombres exacts modifiés une fois ceux-ci équipés. Ces détails ont aussi été annexés aux capacités modifiées dans une section dédiée. De nombreuses améliorations ont également été bichonnées pour les rendre plus simples à comprendre des esprits que la magie n'a pas encore ouverts.",
  "springcleaning22_muting_ui": "Amélioration de l'interface pour bloquer des joueurs ou joueuses",
  "springcleaning22_muting_ui_desc": "Les fans de Dota forment une communauté passionnée et pleine d'entrain, et il peut arriver que les émotions qui dominent au cœur de la compétition ne soient pas les bonnes. Quand un comportement devient perturbateur, il est important d'avoir un moyen simple et rapide de bloquer certaines personnes et de les signaler pour une enquête plus poussée sans que votre partie n'en souffre davantage. C'est pourquoi un simple clic pourra maintenant désactiver la voix et le texte de quelqu'un puis le signaler. Vous pouvez également faire un clic droit pour désactiver le texte et la voix uniquement, pour les cas où le comportement d'une personne ne serait pas spécialement gênant, mais vous ne souhaiteriez pas communiquer avec elle. Commande simple et qui monte d'un échelon, le nouveau bouton « bloquer les communications de l'équipe » est à votre disposition pour bloquer les messages d'une équipe entière en un seul clic.\\n\\nNous en profitons aussi pour réévaluer notre gestion des signalements de communication. Notre objectif est de rendre le blocage des personnes gênantes simple et rapide, tout en identifiant de manière claire celles avec qui il convient de prendre des mesures plus fermes.",
  "springcleaning22_demo_hero": "Améliorations du mode démo",
  "springcleaning22_demo_hero_desc": "Voulez-vous tester les toutes dernières stratégies ou en créer de nouvelles bien à vous ? Ou bien ressentez-vous seulement le besoin irrépressible de voir combien d'incarnations d'Axe peuvent être abattues par une seule frappe de Tidebringer ? Quelle chance ! Le mode démo a été retravaillé dans cette mise à jour pour inclure une kyrielle de nouvelles fonctionnalités :",
  "springcleaning22_demo_hero_map": "La zone au nord de la carte du mode démo s'est agrandit : elle offre plus de terrain plat pour vos expériences.",
  "springcleaning22_demo_hero_hero_spawn": "Ajouts de commandes pour invoquer facilement des unités héroïques alliées, en plus des unités ennemies.",
  "springcleaning22_demo_hero_hero_reset": "Ajout d'une commande pour réinitialiser une unité héroïque au niveau 1.",
  "springcleaning22_demo_hero_hero_remove": "Ajout d'une commande pour faire disparaitre une unité héroïque une fois vos essais terminés.",
  "springcleaning22_demo_hero_hero_select": "Invoquer une nouvelle unité héroïque l'ajoute maintenant à votre sélection actuelle.",
  "springcleaning22_demo_hero_levelling": "Les boutons pour augmenter de niveau, équiper l'Aghanim's Scepter ou l'Aghanim's Shard et activer l'invulnérabilité s'appliquent maintenant à toutes les unités héroïques sélectionnées.",
  "springcleaning22_demo_creep_toggle": "Désactiver la présence de creeps fait maintenant disparaitre tous les creeps de lane en vie.",
  "springcleaning22_demo_creep_spawn": "Ajout d'un bouton pour faire apparaitre une seule vague de creeps de chaque côté.",
  "springcleaning22_demo_hero_runes": "Ajouts de boutons pour faire apparaitre les 6 runes principales.",
  "springcleaning22_shop_search": "Mise à jour de la recherche dans l'échoppe",
  "springcleaning22_shop_search_desc": "Dépenser votre or devrait être facile, amusant, mais surtout, efficace. Alors, pour que vos dépenses effrénées vous fasse sentir moins « meep merp » et beaucoup plus « last hit », la recherche dans l'échoppe a été améliorée et offre une meilleure prise en charge des mots clés avec un affichage qui met en valeur les attributs recherchés. Vous n'avez plus qu'à saisir « armure », « force », « portée », etc. pour que les statistiques qui vous intéressent vous sautent aux yeux. Choisir le parfait objet pour la parfaite tactique n'a jamais été aussi facile. Tout ce qu'il vous faut, c'est de l'or.",
  "springcleaning22_item_tooltips": "Descriptions détaillées pour les effets des objets",
  "springcleaning22_item_tooltips_desc": "Vous ne pouvez jamais vous souvenir de combien de mana vous procure ces points d'intelligence ? Ou combien d'armure vous offrent ces points d'agilité ? Plus la peine de vous fatiguer, il vous suffit de maintenir ALT enfoncé quand vous regardez l'infobulle d'un objet pour afficher les propriétés de chacun de ses composants.",
  "springcleaning22_colored_ability_damage": "Couleurs pour le type de dégâts des capacités",
  "springcleaning22_colored_ability_damage_desc": "Pour faire de bons choix au combat, vous avez besoin de connaitre les défis que vous allez affronter. Pour vous aider à distinguer les dangers potentiels, les dégâts infligés par des sorts et des objets ont désormais un code couleur selon leur nature : physique, magique ou pure.",
  "springcleaning22_pluralized_strings": "Meilleure intégration des règles de pluralisation",
  "springcleaning22_pluralized_strings_desc": "Pour améliorer l'expérience Dota partout dans le monde, nous avons ajouté des fonctionnalités afin de mieux prendre en charge les règles de pluralisation pour plusieurs langues et avons mis à jour plus de 400 lignes de texte en conséquence.",
  "springcleaning22_permanent_debuffs": "Effets positifs permanents",
  "springcleaning22_permanent_debuffs_desc": "Sans comprendre l'étendue de ses actions, difficile de planifier soigneusement sa stratégie. Les victimes de Reaper's Scythe de Necrophos et de Culling Blade d'Axe sont maintenant répertoriées sur l'écran post-match pour vous permettre d'analyser au mieux vos parties à postériori.",
  "springcleaning22_post_game_sortable": "Tri des informations sur l'écran post-match",
  "springcleaning22_post_game_sortable_desc": "Vous voulez savoir comment s'est concrétisée votre victoire ? Les informations du tableau de bord post-match peuvent maintenant être triées pour vous permettre de les analyser facilement.",
  "springcleaning22_gameplay_tp_boots": "Quand on utilise Boots of Travel à portée d'une tour, il y a maintenant moins de chances qu'un creep soit pris pour cible.",
  "springcleaning22_gameplay_sellback": "Il est maintenant possible de vendre un objet au prix acheté au cours des 30 premières secondes de la partie. Auparavant, la période normale de 10 secondes s'appliquait.",
  "springcleaning22_gameplay_lifestealer_consume": "La capacité Consume de Lifestealer utilise maintenant le même raccourci qu'Infest, peu importe le type d'unité ciblée.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "L'animation de pré-attaque et l'étourdissement infligé par le creep neutre Ogre Bruiser ont maintenant un effet sonore.",
  "springcleaning22_gameplay_neutral_aura_radius": "Le rayon de toutes les auras des creeps neutres est maintenant affiché quand on les survole.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "La description de Wraith Bland, Null Talisman et Bracer se met maintenant à jour à partir de la 25ᵉ minute pour indiquer le doublement des bonus.",
  "springcleaning22_gameplay_heal_overhead": "Correction du problème suivant : parfois, l'amplification des soins n'était pas prise en compte dans l'affichage des valeurs de soins.",
  "springcleaning22_gameplay_fountain_invuln": "Les unités héroïques bénéficiant de l'effet d'invulnérabilité de la fontaine n'attaquent plus automatiquement. L'effet est maintenant dissipé quand une unité ennemie est à portée.",
  "springcleaning22_gameplay_blink_range": "Les indicateurs de portée de Blink Dagger et de ses variantes prennent maintenant en compte les bonus de portée d'incantation.",
  "springcleaning22_gameplay_desolator_tooltip": "La description de l'effet passif Soul Stealer de Desolator a été clarifiée. Le bonus de dégâts de Desolator augmente quand une unité ennemie meurt alors qu'elle était touchée par l'effet Corruption de l'objet.",
  "springcleaning22_gameplay_ardm_stash": "Correction du problème suivant : en mode All Random Deathmatch, quand le coursier d'une unité héroïque morte ramenait un objet à la réserve, celui-ci disparaissait.",
  "springcleaning22_gameplay_neutral_items_lock": "Il n'est plus possible d'empêcher la combinaison des objets neutres. Cela corrige le problème suivant : les coursiers ne pouvaient pas livrer des objets neutres dont la combinaison avait été empêchée.",
  "springcleaning22_gameplay_illusion_modifiers": "Correction du problème suivant : quand plusieurs effets étaient appliqués à une illusion, la durée de cette dernière changeait par mégarde, ce qui permettait d'identifier la vraie unité héroïque.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Correction du problème suivant : en modes turbo et novice, la valeur de certaines sources d'or était incorrecte.",
  "springcleaning22_gameplay_turbo_courier": "Correction du problème suivant : en mode turbo, il était impossible de contrôler son coursier si on avait quitté la partie pendant la phase de sélection ou de stratégie.",
  "springcleaning22_gameplay_zero_tooltips": "Correction du problème suivant : certaines valeurs en jeu modifiées par des talents étaient inexactes.",
  "springcleaning22_gameplay_euls_invulnerable": "Correction du problème suivant : l'effet d'Eul's Scepter of Divinity n'était pas appliqué aux clones immunisés contre la magie.",
  "springcleaning22_gameplay_kobold_aura": "La capacité Prospecting Aura du creep neutre Kobold ne s'applique plus aux creeps héroïques (comme Spirit Bear de Lone Druid). Cela corrige un problème qui créait un effet double.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Correction du problème suivant : quand Alchemist utilisait Aghanim's Scepter Synth sur Arc Warden, les clones de Tempest Double ne bénéficiaient pas des bonus de statistiques de l'Aghanim's Scepter.",
  "springcleaning22_gameplay_chen_hand_of_god": "Hand of God de Chen prodigue maintenant bien le bonus de régénération de PV aux creeps contrôlés par Chen, et non plus seulement les soins de base.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Le malus de dégâts d'attaque de Tempest Double en fonction de la distance prend maintenant en compte la réincarnation d'Arc Warden.",
  "springcleaning22_gameplay_arc_warden_basher": "Une description additionnelle a été ajoutée à Tempest Double. Elle précise que les clones de Tempest Double ne peuvent pas déclencher les effets d'étourdissement de Skull Basher et d'Abyssal Blade.",
  "springcleaning22_gameplay_arc_warden_blink": "Blink Dagger est maintenant utilisable par le clone de Tempest Double d'Arc Warden immédiatement après qu'il a été invoqué.",
  "springcleaning22_gameplay_arc_warden_wards": "Il n'est plus possible de donner de Wards au clone de Tempest Double d'Arc Warden.",
  "springcleaning22_gameplay_pa_scepter_double": "L'amélioration de l'Aghanim's Scepter de Phantom Assassin ne remet plus à zéro le temps de recharge de Blur quand elle tue un clone de Tempest Double d'Arc Warden.",
  "springcleaning22_gameplay_naga_siren_riptide": "Correction du problème suivant : le talent « –1 attaque pour déclencher Rip Tide » réduisait de 2 le nombre d'attaques nécessaires.",
  "springcleaning22_gameplay_legion_commander_duel": "Les dégâts bonus de Duel de Legion Commander sont maintenant accordés même si l'unité gagnante est invulnérable.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Walrus Kick de Tusk a maintenant bien un temps de recharge de 12 secondes.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Metamorphosis de Terrorblade a maintenant bien un temps de recharge de 35/40/45/50 secondes.",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey King ne peut plus utiliser Tree Dance pour s'échapper de l'Arena of Blood de Mars.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "Correction du problème suivant : en mode Ability Draft, les vagues de Rip Tide de Naga Siren déferlaient autour de cette dernière plutôt qu'autour de l'unité héroïque qui disposait effectivement de la capacité.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki peut maintenant utiliser Smoke Screen tout en canalisant Tricks of the Trade, même si l'option « \"Annuler l'action\" pour stopper les capacités » est activée.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Correction d'un problème d'interaction de la capacité Dispose de Marci avec Black King Bar et Lotus Orb.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Une icône de désarmement est maintenant affichée au-dessus de la tête de l'unité ciblée par Concussive Grenade de Sniper.",
  "springcleaning22_gameplay_morphling_spirit_link": "Correction du problème suivant : quand il prenait la forme de Lone Druid, Morphling gardait de manière permanente l'effet passif de Spirit Link.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Ajout d'une icône de canalisation manquante pour Fiend's Gate d'Underlord.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Ajout d'une description manquante pour l'effet négatif d'Icefire Bomb du creep Ancient Ice Shaman.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Correction du problème suivant : quand Dark Willow possédait l'Aghanim's Scepter, les effets de particules de Cursed Crown étaient désynchronisés.",
  "springcleaning22_gameplay_lone_druid_midas": "Utiliser Hand of Midas sur Spirit Bear de Lone Druid accorde maintenant des points d'expérience à l'unité héroïque qui le contrôle.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear et les clones de Tempest Double peuvent maintenant gagner des charges pour Magic Stick, Magic Wand et Holy Locket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "La description d'Astral Step de Void Spirit affiche maintenant les bonnes valeurs d'amplification des sorts quand on appuie sur ALT.",
  "springcleaning22_gameplay_heavenly_jump_range": "La portée de Heavenly Jump de Zeus est maintenant affichée quand on survole la capacité.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Corrections de problèmes avec les descriptions des effets positifs d'Arcane Aura de Crystal Maiden.",
  "springcleaning22_gameplay_hex_tooltip": "Correction du problème suivant : quand le talent « Hex interrompt la cible » était choisi, 1 seconde était ajoutée par mégarde à la description de la capacité Hex de Shadow Shaman.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Correction du problème suivant : quand le talent de niveau 20 d'Abaddon était choisi, le temps de recharge de Borrowed Time n'était pas mis à jour dans la description de la capacité.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Correction du problème suivant : les effets de Presence of the Dark Lord de Shadow Fiend s'appliquent maintenant bien aux creeps neutres.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Correction du problème suivant : Warp Flare de Tinker fonctionnait contre Roshan.",
  "springcleaning22_gameplay_ability_draft_wukong": "Correction du problème suivant : en mode Ability Draft, les clones de Wukong's Command ne disposaient pas des bonnes capacités.",
  "springcleaning22_rubick_illusions": "Correction du problème suivant : quand une illusion de Rubick utilisait une capacité volée, l'animation n'était pas toujours la bonne (c'était par exemple le cas avec Fiend's Grip de Bane, quand Rubick possédait l'Aghanim's Scepter).",
  "springcleaning22_rubick_hunter_in_the_night": "Rubick peut maintenant voler la version améliorée par Aghanim's Shard de Hunter in the Night de Night Stalker.",
  "springcleaning22_rubick_juxtapose": "Rubick peut maintenant voler la version améliorée par Aghanim's Scepter de Juxtapose de Phantom Lancer.",
  "springcleaning22_rubick_fireball": "Rubick peut maintenant voler Fireball de Dragon Knight sans voler Dragon Form. La capacité n'est pas accordée automatiquement.",
  "springcleaning22_rubick_wolf_bite": "Correction du problème suivant : quand Rubick volait Wolf Bite, la capacité ne fonctionnait pas.",
  "springcleaning22_rubick_depth_shroud": "Correction du problème suivant : quand Rubick volait Depth Shroud, la capacité ne fonctionnait pas.",
  "springcleaning22_rubick_astral_spirit": "Quand Rubick vole Astral Spirit, il n'obtient plus la capacité de déplacement distincte. Il peut maintenant garder ses deux emplacements de sorts quand il vole cette capacité.",
  "springcleaning22_rubick_reverse_time_walk": "Si Rubick dispose de l'Aghanim's Shard, Reverse Time Walk utilise maintenant le même emplacement que Time Walk. Il peut maintenant garder ses deux emplacements de sorts quand il vole cette capacité.",
  "springcleaning22_rubick_jaunt": "Ethereal Jaunt utilise maintenant le même emplacement qu'Illusory Orb. Rubick peut maintenant garder ses deux emplacements de sorts quand il vole cette capacité.",
  "springcleaning22_rubick_eject": "Si Rubick dispose de l'Aghanim's Shard, Eject utilise maintenant le même emplacement que Dismember. Il peut maintenant garder ses deux emplacements de sorts quand il vole cette capacité.",
  "springcleaning22_rubick_dismember": "Si Rubick vole un sort qui remplace Dismember, l'unité héroïque alliée sous l'effet de la capacité sera éjectée.",
  "springcleaning22_rubick_spit_out": "Spit Out utilise maintenant le même emplacement que Gobble Up. Rubick peut maintenant garder ses deux emplacements de sorts quand il vole cette capacité.",
  "springcleaning22_rubick_decoy": "Quand Rubick vole Decoy, il ne vole plus Bushwhack avec. Decoy applique tout de même les effets de Bushwhack.",
  "springcleaning22_rubick_spirits": "Correction du problème suivant : quand Rubick disposait de l'Aghanim's Scepter, Spirits d'Io ne fonctionnait pas correctement.",
  "springcleaning22_rubick_gravekeepers_cloak": "Rubick peut maintenant voler la version améliorée par Aghanim's Shard de Gravekeeper's Cloak de Visage.",
  "springcleaning22_rubick_shard_cursed_crown": "Si Rubick dispose de l'Aghanim's Shard, utiliser Cursed Crown invoquera maintenant des ronces de Bramble Maze.",
  "springcleaning22_rubick_shard_venomous_gale": "Si Rubick dispose de l'Aghanim's Shard, utiliser Venomous Gale invoquera maintenant des Plague Wards.",
  "springcleaning22_rubick_shard_sprout": "Si Rubick dispose de l'Aghanim's Shard, utiliser Sprout invoquera maintenant des Treants.",
  "springcleaning22_rubick_shard_shackles": "Si Rubick dispose de l'Aghanim's Shard, utiliser Shackles invoquera maintenant des Serpent Wards.",
  "springcleaning22_rubick_shard_cold_embrace": "Si Rubick dispose de l'Aghanim's Shard, utiliser Cold Embrace invoquera maintenant une instance de Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "Si Rubick dispose de l'Aghanim's Shard, utiliser Earthshock appliquera maintenant aussi les effets d'Enrage.",
  "springcleaning22_rubick_shard_shadow_step": "Si Rubick dispose de l'Aghanim's Shard, utiliser Shadow Step appliquera maintenant aussi les effets de Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "Si Rubick dispose de l'Aghanim's Shard, utiliser Terror Wave appliquera maintenant aussi les effets de Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "Si Rubick dispose de l'Aghanim's Shard, utiliser Homing Missile appliquera maintenant aussi les effets de Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Si Rubick dispose de l'Aghanim's Shard, utiliser Silthereen Crush appliquera maintenant aussi les effets de Corrosive Haze.",
  "springcleaning22_rubick_scepter_flak_cannon": "Si Rubick dispose de l'Aghanim's Scepter, l'effet passif Side Gunner sera maintenant aussi appliqué à Flak Cannon.",
  "springcleaning22_rubick_scepter_time_walk": "Si Rubick dispose de l'Aghanim's Scepter, utiliser Time Walk appliquera maintenant aussi les effets de Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Si Rubick dispose de l'Aghanim's Scepter, utiliser Shuriken Toss appliquera maintenant aussi les effets de Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Si Rubick dispose de l'Aghanim's Scepter, utiliser Sacred Arrow appliquera maintenant aussi les effets de Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "La manière dont le ciblage vectoriel fonctionne avec l'option « Activer l'util. rapide au moment de l'appui » a été modifiée. Maintenant, la position initiale du vecteur est définie quand on appuie sur la touche, et sa position de fin est définie quand on la relâche.",
  "springcleaning22_ui_ward_bounty": "Quand une Observer Ward est détruite, le menu de gauche affiche maintenant l'unité qui a reçu la prime s'il ne s'agit pas de celle qui l'a détruite.",
  "springcleaning22_ui_spectator_hud_player_view": "L'interface de visionnage affiche maintenant correctement la personne que vous regardez.",
  "springcleaning22_ui_post_game_scepter_shard": "Les descriptions des effets de l'Aghanim's Scepter et de l'Aghanim's Shard sont maintenant affichées sur le tableau des scores post-match.",
  "springcleaning22_ui_post_game_backpack_neutral": "Les objets neutres et ceux dans le sac à dos sont maintenant affichés sur l'écran post-match.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Les différents pourcentages de vol de vie pour les sorts (selon qu'ils s'appliquent aux unités héroïques ou aux creeps) sont maintenant affichés distinctement quand on appuie sur ALT.",
  "springcleaning22_ui_skeleton_warrior_rally": "Les dégâts d'attaque bonus accordés par la capacité Rally du creep Skeleton Warrior sont maintenant affichés sous la forme d'un seul effet positif, plutôt que de plusieurs.",
  "springcleaning22_ui_neutral_item_teleport": "Correction du problème suivant : quand on changeait d'objet neutre et qu'on en envoyait un vers la réserve rapidement et plusieurs fois d'affilée, le mauvais objet était parfois envoyé.",
  "springcleaning22_ui_spectator_arcana": "Les interfaces relatives aux items Arcanes n'apparaissent plus dans les matchs de ligue en mode visionnage.",
  "springcleaning22_ui_ready_check_enter": "Il est maintenant possible d'appuyer sur Entrée pour répondre à un appel de groupe.",
  "springcleaning22_ui_alt_item_combine": "Quand des objets combinables sont dans le menu d'achat rapide, il est maintenant possible d'appuyer sur ALT pour voir quel objet devrait être fabriqué.",
  "springcleaning22_ui_alt_items_ready": "Appuyer sur CTRL et ALT tout en cliquant sur les objets suivants indique maintenant à votre équipe s'ils sont prêts à être utilisés, plutôt que de demander aux membres de l'équipe de se réunir : Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight et Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Le nombre de Sentry Wards affichées pendant la phase de stratégie est passé de 2 à 3. Maintenant, 3 Sentry Wards au maximum peuvent être achetées en début de partie.",
  "springcleaning22_ui_guide_pregame": "Après avoir sélectionné une unité héroïque, la section des objets recommandés utilise maintenant la première section d'un guide si celui-ci n'a aucune section nommée « Objets de départ ».",
  "springcleaning22_ui_ward_planter": "Les membres de l'équipe, leurs coachs et les personnes en mode visionnage peuvent maintenant voir qui a planté une Ward en cliquant dessus.",
  "springcleaning22_ui_courier_home_button": "Appuyer sur le bouton « Échoppe de la base » demande maintenant au coursier de placer les objets qu'il transporte dans la réserve quand il rejoint la base.",
  "springcleaning22_ui_combat_log_key": "Un raccourci peut maintenant être assigné au journal de combat dans les options.",
  "springcleaning22_ui_combat_log_right_align": "Le journal de combat est maintenant aligné à droite et ne cache plus les options du mode démo.",
  "springcleaning22_ui_combat_log_hud_flip": "Le journal de combat respecte maintenant l'inversion de l'interface : si l'option « Minicarte à droite » est activée, alors il sera positionné à gauche.",
  "springcleaning22_ui_guide_apos": "Correction du problème suivant : quand des commentaires de guides sur des objets et des capacités comportaient des apostrophes, ces dernières étaient remplacées par « &apos; » et d'autres symboles HTML quand les guides étaient sauvegardés. Les guides sauvegardés qui présentent ce problème devront être mis à jour manuellement.",
  "springcleaning22_ui_vs_screen_widescreen": "Ajustement de la présentation des unités héroïques sur l'écran versus pour les formats d'écran 21:9 ou supérieur.",
  "springcleaning22_ui_charms": "Correction du problème suivant : le texte de l'interface des charmes se chevauchait quand on possédait plus de 2 charmes.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Correction du problème suivant : dans le mode d'entrainement aux Last Hits, démarrer l'entrainement avant que l'unité héroïque ne soit invoquée empêchait les creeps d'apparaitre.",
  "springcleaning22_ui_intro_scenes": "Les introductions (comme celles utilisées pour présenter de nouveaux héros ou héroïnes, Arcanes ou personas) ne seront plus affichées aux personnes n'ayant pas accompli la phase initiale du parcours pour les novices.",
  "springcleaning22_cosmetics_illusion_skins": "Correction du problème suivant : certains modèles cosmétiques n'étaient pas correctement appliqués aux illusions.",
  "springcleaning22_cosmetics_cloth_stretch": "Correction du problème suivant : le tissu de certains modèles dépassait parfois de l'écran.",
  "springcleaning22_cosmetics_underlord_immortal": "L'item immortel « Sujétion d'émeraude » d'Underlord a maintenant des effets de capacité personnalisés qui remplacent ceux de sa capacité ultime.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Les effets de projectiles personnalisés de Shadow Poison accordés par l'item immortel « Manteau de la camarde » de Shadow Demon sont maintenant orientés dans la bonne direction.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Quand Wraith King lance Wraithfire Blast, les effets cosmétiques de l'item immortel « Éclat foudroyant » prennent maintenant le dessus sur ceux de l'Arcane.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Les effets d'ambiance de l'item immortel « Bracelets de luminescence cavernicole » d'Earthshaker fonctionnent maintenant correctement.",
  "springcleaning22_cosmetics_warlock_immortal": "Correction d'un problème d'affichage des particules des effets positifs et négatifs de Shadow Word quand l'item immortel « Glyphe ombreux » de Warlock était équipé.",
  "springcleaning22_cosmetics_viper_immortal": "Correction d'un problème avec les particules de zone pour Nethertoxin quand l'item immortel « Toxine du Netherdrake » de Viper était équipé.",
  "springcleaning22_cosmetics_abaddon_vessel": "Les effets visuels d'Aphotic Shield liés à l'item « Lame du navire démoniaque » d'Abaddon ont été restaurés.",
  "springcleaning22_cosmetics_tidehunder_belt": "Suppression de particules incorrectes pour l'item « Abomination abyssale : ceinture » de Tidehunter : elles étaient placées sur la ceinture au lieu du bras.",
  "springcleaning22_cosmetics_faceless_incursion": "Correction d'un problème avec les effets d'ambiance de l'arme « Incursion de Claszureme » de Faceless Void.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Les effets personnalisés des deux styles de l'Arcane de Drow Ranger sont maintenant visibles pour l'aura de Marksmanship.",
  "springcleaning22_cosmetics_rubick_dilemma": "Les effets d'ambiance liés à l'item « Lanterne du dilemme de Fantoccini » de Rubick ont été restaurés.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Correction du problème suivant : quand les Techies avaient leur Arcane équipée, leur animation de course avec blessure ne s'exécutait pas à la bonne vitesse.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Les gemmes ont maintenant un code couleur sur Sticky Bomb et Reactive Tazer pour l'Arcane des Techies.",
  "springcleaning22_cosmetics_techies_icons": "Ajout des icônes d'items d'économie manquants pour les ensembles « Manchots bombardiers », « Sapeurs-miniers », « La communauté de l'explosif » et « Défilé de la patrouille explosive ».",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Correction de l'animation de Spoon, de la bande des Techies, dans l'aperçu de téléportation avec l'ensemble Charriot pachyderme.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "L'Arcane de Rubick offre des effets personnalisés sur la Sticky Bomb des Techies au lieu de Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Désactivation de l'animation de Snapfire : elle ne restent plus bloquée dans une séquence d'animation incorrecte.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Le bundle « Conquérante du Radiant » pour Legion Commander et les items associés peuvent maintenant être échangés et vendus sur le marché de la communauté.",
  "springcleaning22_cosmetics_legion_commander_wind": "Ajout d'effets ambiants venteux aux bannières de l'« Héritage de la légion déchue » et de « Conquérante du Radiant » de Legion Commander, avec ou sans équipment d'armes arcanes.",
  "springcleaning22_perf_panorama_atlas": "Le moteur de l'interface Panorama a été mis à jour pour cartographier plus efficacement l'interaction avec la carte graphique. Nos mesures indiquent que cela améliore les performances du GPU de 25 à 30 % concernant le HUD, et de beaucoup plus sur certains tableaux de bord particulièrement complexes. Ce changement augmente également les performances de l'unité centrale pour Vulkan , et il devrait être particulièrement bénéfique aux ordinateurs Apples dotés de processeurs M1.",
  "springcleaning22_perf_sand_king_particles": "Les effets de particules de Sand Storm ont été optimisées pour améliorer les performances.",
  "springcleaning22_perf_panorama_clears": "Le moteur de l'interface Panorama a été mis à jour pour empêcher l'élimination inutile de cibles de rendu (render targets), et épargner ainsi une charge de travail à la carte graphique.",
  "springcleaning22_perf_scenesystem_threading": "Correction du problème suivant : parfois, moins de threads qu'il n'en aurait fallu étaient utilisés pour effectuer des tâches multithreads. Cette correction est particulièrement profitable aux machines dotées de moins de 5 cœurs.",
  "springcleaning22_perf_thread_affinity": "Correction du problème suivant : les affinités de thread mal définies pouvait bloquer certaines machines.",
  "springcleaning22_perf_power_savings": "Ajout d'un avertissement dans les paramètres vidéos qui s'affiche quand un ordinateur est en mode économie d'énergie. Lorsque tel est le cas, cela peut avoir un impact négatif sur les performances.",
  "springcleaning22_perf_shop_tooltips": "La vitesse d'affichage des descriptions dans l'échoppe a été améliorée.",
  "springcleaning22_custom_games_overview_sort": "Dans l'onglet « Vue d'ensemble » de l'arcade de Dota, il est maintenant possible de trier les jeux customs par nombre de personnes en jeu, en plus du tri par nombre de salles d'attente publiques.",
  "springcleaning22_custom_games_update": "Correction du problème suivant : les jeux customs dans l'arcade de Dota n'indiquaient pas toujours qu'une mise à jour était nécessaire. Il fallait alors les réinstaller ou redémarrer Steam.",
  "springcleaning22_custom_games_lobby_version": "La liste de salles d'attente dans l'arcade de Dota ne répertorie plus les salles d'attente inaccessibles ou qui sont associés à une autre version du jeu installé.",
  "springcleaning22_custom_games_bounty_filter": "La fonction SetFilterMoreGold peut maintenant filtrer l'or obtenu grâce aux runes de Bounty.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Relique de Dazzle remplacée : « Dégâts et soins de Bad Juju » au lieu de « Bad Juju sur 4 cibles ».",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Relique des Techies remplacée : « Cibles héroïques de Sticky Bomb » au lieu de « Victimes de Remote Mines ».",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Relique des Techies remplacée : « Désarmements multiples de Reactive Tazer » au lieu de « Enracinements de Stasis Trap ».",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Relique de Tinker remplacée : « Dégâts absorbés par Defense Matrix » au lieu de « Dégâts infligés par March of the Machines ».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Relique d'Underlord remplacée : « Victimes alliées après Fiend's Gate » au lieu de « Victimes après Dark Rift ».",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Relique d'Underlord remplacée : « Dégâts bonus d'Atrophy Aura infligés » au lieu de « Sauvetages avec Dark Rift ».",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Relique d'Omniknight corrigée : « Dégâts alliés pendant Heavenly Grace ».",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Relique de Primal Beast corrigée : « Onslaught sur plusieurs cibles ».",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Défi héroïque de Meepo remplacé : « Infligez des dégâts purs aux unités héroïques » au lieu de « Infligez des dégâts magiques aux unités héroïques. »",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Défi héroïque de Naga Siren remplacé : « Consumez du mana aux unités héroïques » au lieu de « Soignez des unités héroïques pendant Song of the Siren. »",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Défi héroïque de Tinker remplacé : « Faites en sorte que Defense Matrix absorbe des dégâts » au lieu de « Infligez des dégâts à l'aide de March of the Machines. »",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Défi héroïque pour les Techies remplacé : « Sticky Bombs attachées » au lieu de « Victimes de Remote Mines ».",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Défi héroïque pour Underlord remplacé : « Victimes alliées avec Fiend's Gate » au lieu de « Téléportations de Dark Rift infligées à plusieurs unités héroïques ».",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Défi héroïque pour Grimstroke mis à jour : « Dégâts infligés aux unités ennemies affectées par Soulbind » incluent des dégâts provenant des unités alliées.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Défi héroïque pour Mirana mis à jour : « Dégâts infligés pendant Leap » inclut tous les types de dégâts au lieu de physiques uniquement.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Correction du défi héroïque pour Bane : « Blink / Force Staff et Combos de Fiend's Grip ».",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Correction du défi héroïque de Dragon Knight : « Faites des victimes pendant Dragon Form. »",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Correction du défi héroïque de Drow Ranger : « Réduisez au silence 2 unités ennemies ou plus à l'aide de Gust. »",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Correction du défi héroïque de Crystal Maiden : « Tuez des creeps à l'aide de Frostbite. »",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Correction du défi héroïque de Dark Seer : « Infligez des dégâts pendant Surge. »",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Correction du défi héroïque de Lifestealer : « Infligez des dégâts pendant Rage. »",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Correction du défi héroïque de Lone Druid : « Infligez des dégâts pendant True Form. »",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Correction du défi héroïque de Mars : « Infligez des dégâts aux unités héroïques ennemies. »",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Correction du défi héroïque de Mars : « Tuez des unités ennemies en leur infligeant des dégâts de zone. »",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Correction du défi héroïque d'Omniknight : « Infligez des dégâts pendant Heavenly Grace. »",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Correction du défi héroïque d'Omniknight : « Utilisez Heavenly Grace sur des membres de votre équipe pendant un total de X secondes. »",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Correction du défi héroïque de Rubick : « Étourdissez plusieurs unités héroïques en un lancer de Telekinesis. »",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Correction du défi héroïque de Tinker : « Infligez des dégâts aux unités héroïques à l'aide de Laser avec l'Aghanim's Scepter. »",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Correction du défi héroïque de Tusk : « Infligez des dégâts en utilisant Walrus Punch et Walrus Kick à la suite. »",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Suppression du défi héroïque de Venomancer : « Infligez des dégâts à des unités héroïques interrompues par Silver Edge. »",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Suppression du défi héroïque de Tinker : « Tuez des creeps à l'aide de March of the Machines. »",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Nouveau défi héroïque pour Underlord : « Infligez des dégâts aux unités héroïques à l'aide de Firestorm. »",
  "springcleaning22_workshop_modeldoc": "Les outils du Workshop Dota pour la création d'items et de jeux customs ont été actualisés et utilisent maintenant le nouvel éditer de modèles « ModelDoc ». Nous recommandons aux artistes du Workshop de migrer leurs modèles réalisés avec l'ancien outil, car il sera supprimé lors d'une prochaine mise à jour."
}