// 9540.js

{
  "language": "swedish",
  "springcleaning22_desc": "Vårstädningsuppdateringen 2022 är här för att åtgärda ett gäng med buggar och implementera några förbättringar som förgyller tillvaron. Kolla in några av de större ändringarna – som förbättringar av Aghanims verktygstips, mjutningsinställningar, butikssökningar och hjältedemoläge – och gå sedan in på djupet i den längre listan med åtgärder och speljusteringar som du hittar nedan.",
  "springcleaning22_aghs_tooltips": "Verktygstips för Aghanim's Scepter och Shard",
  "springcleaning22_aghs_tooltips_desc": "Vad som pågår i Aghanims inre (både sinne och monolog) är utan tvivel bortom vanliga dödligas fattningsförmåga, men med dagens uppdatering har effekterna av hans magnifika Scepter och Shard tydliggjorts som aldrig förr. Verktygstipsen för Aghanims uppgraderingar har nu fler detaljer om hur värdena ändras exakt vid utrustning, och modifierade förmågor har också denna information i en där för avsedd sektion. Många uppgraderingar har fått särskild uppmärksamhet som gör dem enklare att förstå för oss icke-magiker.",
  "springcleaning22_muting_ui": "Mjutningsförbättringar",
  "springcleaning22_muting_ui_desc": "Dota-spelarna är ett högljutt gäng, och ibland härjar starka känslouttryck i stridens hetta. Om dessa beteenden blir för störande är det viktigt att ha ett snabbt och enkelt sätt att mjuta spelare och anmäla att granskning behövs utan att det stör ditt spelande. Därför behövs nu bara ett enkelt klick för att mjuta röst, mjuta text och anmäla en spelare. Du kan också högerklicka för att mjuta text och röst enskilt för de fall där en spelares beteende kanske inte är störande men du ändå inte vill ta del av deras kommunikation. För att på ett enkelt sett ge dig kontroll på hög nivå kan du nu också använda de nya lagmjutningsknapparna för att blockera ett helt lags kommunikation med ett klick.",
  "springcleaning22_demo_hero": "Förbättringar av hjältedemor",
  "springcleaning22_demo_hero_desc": "Vill du testa de nyaste strategierna eller skapa egna? Eller kanske du helt enkelt känner ett övermäktigt behov av att se hur många inkarnationer av Axe som kan slaktas med ett enda hugg med Tidebringer? Oavsett skäl, så har du tur! Hjältedemorna har uppdaterats med en omarbetning som inkluderar flera nya funktioner:",
  "springcleaning22_demo_hero_map": "Den nordliga delen av demokartan har utökats för att nu omfatta en större flat yta till testning.",
  "springcleaning22_demo_hero_hero_spawn": "Lade till knappar för att enkelt spawna allierade hjältar, i tillägg till fiender.",
  "springcleaning22_demo_hero_hero_reset": "Lade till en knapp för att återställa en hjälte tillbaka till nivå 1.",
  "springcleaning22_demo_hero_hero_remove": "Lade till en knapp för att ta bort en hjälte när du har testat klart.",
  "springcleaning22_demo_hero_hero_select": "När du skapar en ny hjälte läggs den till i ditt nuvarande urval.",
  "springcleaning22_demo_hero_levelling": "Knappar till att levla, lägga till Scepter eller Shard och växla osårbarhet gäller nu för alla valda hjältar.",
  "springcleaning22_demo_creep_toggle": "När du växlar av creeps avlägsnas alla creeps från kartan.",
  "springcleaning22_demo_creep_spawn": "Lade till en knapp för spawna en creepvåg från varje sida.",
  "springcleaning22_demo_hero_runes": "Lade till knappar för att spawna de sex olika huvudrunorna.",
  "springcleaning22_shop_search": "Uppdaterade butikssökningen",
  "springcleaning22_shop_search_desc": "Det ska vara lätt, roligt och framförallt effektivt att spendera guld. Så för att se till att dina shoppingrundor känns mindre ”meep merp” och mer ”last hit” har sökningen i föremålsshoppen utökats med förbättrat stöd för nyckelord – inklusive en ruta som visar eftersökta attribut. Det är bara att söka efter ”Skydd”, ”Styrka”, ”Räckvidd” osv. för att belysa de attribut du är intresserad av. Det har aldrig varit enklare att välja det perfekta föremålet för den perfekta planen. Allt som behövs nu är guld.",
  "springcleaning22_item_tooltips": "Utökade verktygstips för föremål",
  "springcleaning22_item_tooltips_desc": "Brukar du glömma hur mycket mana du får med intelligens? Eller hur mycket skydd du får från agility? Du behöver inte tänka mer på det, för nu kan du helt enkelt hålla in ALT när du tittar på på föremålets verktygstips för att utöka egenskaperna till alla beståndsdelar.",
  "springcleaning22_colored_ability_damage": "Färger för förmågeskada",
  "springcleaning22_colored_ability_damage_desc": "Det krävs att man vet vilka utmaningar man ska möta för att kunna göra goda val i striden. För att hjälpa dig att förstå potentiell fara och skada från förmågor och föremål finns nu en färgkodning för om skadan är fysisk, magisk eller ren.",
  "springcleaning22_pluralized_strings": "Förbättrat språkstöd för strängar i plural",
  "springcleaning22_pluralized_strings_desc": "För att förbättra tillgängligheten världen över har vi lagt till funktioner för att ge bättre stöd för pluralregler på åtskilliga språk, och har därför uppdaterat mer än 400 rader med text till följd av dessa ändringar.",
  "springcleaning22_permanent_debuffs": "Permanenta buffar",
  "springcleaning22_permanent_debuffs_desc": "Det kan vara svårt att lägga upp en strategi utan att förstå hur effektiva ens handlingar är. För att göra mer information tillgänglig efter en match visas nu kills med Necrophos Reaper's Scythe och Axes Culling Blade efter matchen.",
  "springcleaning22_post_game_sortable": "Sorterbara detaljer efter matchen",
  "springcleaning22_post_game_sortable_desc": "Vill du veta mer om detaljerna bakom dina vinster? Resultattavlan som visas efter matchen kan nu sorteras för att underlätta din analys.",
  "springcleaning22_gameplay_tp_boots": "Det är mindre troligt att Boots of Travel teleporterar till ett creep när det används inom räckvidden för ett torn.",
  "springcleaning22_gameplay_sellback": "Spelare kan nu sälja ett föremål till fullt pris under första 30 sekunderna efter att matchen börjat, istället för den vanliga perioden på 20 sekunder.",
  "springcleaning22_gameplay_lifestealer_consume": "Lifestealers Consume använder nu samma snabbknapp, oberoende av vilken enhet som förmågan används på.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Ogre Bruiser har nu ljudeffekter för uppladdning och bedövning.",
  "springcleaning22_gameplay_neutral_aura_radius": "Man kan nu se radien för neutrala creeps auror genom att hålla markören över dem.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "När attributbonusarna för Wraith Band/Null Talisman/Bracer dubbleras i matchens 25 minut, så uppdateras nu också deras verktygstips.",
  "springcleaning22_gameplay_heal_overhead": "Åtgärdade ett antal fall där visade helningsvärden inte inkluderade förstärkning av helande.",
  "springcleaning22_gameplay_fountain_invuln": "Spelare med buffen Fountain Invulnerability attackerar inte längre automatiskt och avbryter buffen när fienden är inom räckhåll.",
  "springcleaning22_gameplay_blink_range": "Räckviddsindikatorn för Blink Dagger och dess varianter tar nu hänsyn till buffar som ger ökad räckvidd.",
  "springcleaning22_gameplay_desolator_tooltip": "Förtydligade verktygstipset för Desolators passiva förmåga Soul Stealer. Desolator får attackskada när en fiende dör under påverkan av debuffen från Corruption.",
  "springcleaning22_gameplay_ardm_stash": "Åtgärdade en bugg i ARDM där föremål som blev återförda av en kurir försvann när en kurir återförde föremålet till lagret medan man är död.",
  "springcleaning22_gameplay_neutral_items_lock": "Kan inte längre låsa kombinering av neutrala föremål. Detta åtgärdar en bugg där kurirer inte levererar neutrala föremål som hade låst kombinering.",
  "springcleaning22_gameplay_illusion_modifiers": "Åtgärdade en bugg där illusioner med dubbla modifierare hade felaktig varaktighet, vilket gjorde att den riktiga hjälten kunde bli identifierad.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Åtgärdade en bugg i Turbo och novisspelläget där vissa guldkällor inte skalades korrekt.",
  "springcleaning22_gameplay_turbo_courier": "Åtgärdade en bugg i Turbo där en spelares kurir inte längre fungerade om förbindelsen avbröts under hjältevals- eller strategiperioden.",
  "springcleaning22_gameplay_zero_tooltips": "Åtgärdade en bugg där vissa verktygstips i spelet som modifierats av talanger visades som 0 istället för det korrekta värdet.",
  "springcleaning22_gameplay_euls_invulnerable": "När Eul's Scepter används på kloner med magisk immunitet appliceras effekten nu korrekt på klonen istället för att bara få cooldown.",
  "springcleaning22_gameplay_kobold_aura": "Kobolts förmåga Prospecting Aura appliceras inte längre på creephjältar (t.ex. Lone Druids björn), vilket åtgärdar en bugg där den inkorrekt gav dubbel effekt.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Kloner och Tempest Doubles får nu korrekt attributbonus från Aghanim's Scepter-välsignelser givna av Alchemist.",
  "springcleaning22_gameplay_chen_hand_of_god": "Chens Hand of God applicerar nu korrekt helning över tid på creeps som kontrolleras av Chen, och inte bara den initiala helningen.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Arc Wardens klon från Tempest Double får nu sitt attackstraff på avstånd beräknat korrekt när Arc Warden återuppstår.",
  "springcleaning22_gameplay_arc_warden_basher": "Lade till ett verktygstips som förtydligar att kloner och Tempest Doubles inte kan genomföra bash med Skull Basher eller Abyssal Blade.",
  "springcleaning22_gameplay_arc_warden_blink": "Blink Dagger har inte längre någon cooldown vid framkallning av Arc Wardens Tempest Double.",
  "springcleaning22_gameplay_arc_warden_wards": "Arc Wardens Tempest Double kan inte längre ta emot delade wards.",
  "springcleaning22_gameplay_pa_scepter_double": "Aghanim's Scepter-uppgraderingen för Phantom Assassin nollställer inte längre Blur när en Tempest Double dödas.",
  "springcleaning22_gameplay_naga_siren_riptide": "Naga Sirens -1 träff med Rip Tide minskar nu förmågan korrekt med 1 träff, inte 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Legion Commanders bonusskada från Duel utdelas nu även om vinnaren är osårbar.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Tusks Walrus Kick har nu korrekt cooldown på 12 sekunder.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Terrorblades Metamorphosis har nu korrekt cooldown på 35/40/45/50.",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey Kings Tree Dance kan inte längre användas till att fly från Arena of Blood.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "I Ability Draft spelas nu Naga Sirens Rip Tide-effekter upp på rätt hjälte istället för alltid på Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki kan nu använda Smoke Screen medan han kanaliserar Tricks of the Trade utan att kanaliseringen avbryts, även om ”Kanaliserade förmågor kräver håll/stopp\" är aktiverat.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Åtgärdade interaktionen för Marcis Dispose med Black King Bar och Lotus Orb.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Snipers Concussive Grenade visar nu en avväpnad ikon över huvudet.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling behåller inte längre den passiva förmågan Spirit Link vid förvandling till Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Lade till en kanaliseringsikon som saknades för Underlords Fiend's Gate.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Lade till ett verktygstips som saknades för Icefire Bombs debuff.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Partikeleffekterna från Dark Willows Cursed Crown tillsammans med Aghanim's Shard har nu rätt tajming.",
  "springcleaning22_gameplay_lone_druid_midas": "Användning av Hand of Midas på Lone Druids Spirit Bear ger hjälten som styr XP.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear och Tempest Doubles kan nu få laddningar till Magic Stick, Magic Wand och Holy Locket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Void Spirits verktygstips för Astral Step visar nu korrekt värde för magiförstärkning när ALT trycks ned.",
  "springcleaning22_gameplay_heavenly_jump_range": "Räckvidden för Zeus Heavenly Jump visas nu när man för musen över den.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Åtgärdade verktygstipsen för Crystal Maidens Arcane Aura.",
  "springcleaning22_gameplay_hex_tooltip": "Åtgärdade att Shadow Shamans verktygstips för Hex felaktigt lade till 1 sekund till varaktigheten när talangen ”Hex inaktiverar passiva förmågor” valdes.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Åtgärdade att Abaddons nivå 20-talang inte uppdaterade cooldownen för Borrowed Time i verktygstipset.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Åtgärdade så att Shadow Fiends Presence of the Dark Lord appliceras korrekt på neutrala creeps.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Åtgärdade att Tinkers Warp Flare fungerade på Roshan.",
  "springcleaning22_gameplay_ability_draft_wukong": "Åtgärdade att Wukong's Command-kloner inte hade de korrekta förmågorna i Ability Draft.",
  "springcleaning22_rubick_illusions": "Åtgärdade en bugg som förhindrade att Rubicks illusioner hade de korrekta animationerna baserat på hans stulna förmågor (t.ex. Banes Fiend's Grip tillsammans med Aghanim's Scepter).",
  "springcleaning22_rubick_hunter_in_the_night": "Hunter in the Night kan nu stjälas när förmågan är uppgraderad av Aghanim's Scepter.",
  "springcleaning22_rubick_juxtapose": "Juxtapose kan nu stjälas när förmågan är uppgraderad av Aghanim's Scepter.",
  "springcleaning22_rubick_fireball": "Dragon Knights Fireball kan nu stjälas fristående från Dragon Form, och den tilldelas inte heller automatiskt.",
  "springcleaning22_rubick_wolf_bite": "Wolf Bite fungerar nu när förmågan stjäls.",
  "springcleaning22_rubick_depth_shroud": "Depth Shroud fungerar nu när förmågan stjäls.",
  "springcleaning22_rubick_astral_spirit": "Tog bort Astral Spirits separata förflyttningsförmåga när den stjäls. Rubick kan nu behålla båda förmågeplatserna när han stjäl denna förmåga.",
  "springcleaning22_rubick_reverse_time_walk": "Reverse Time Walk använder nu samma förmågeplats som Time Walk om Rubik har Aghanim's Shard. Rubick kan nu behålla båda förmågeplatserna när han stjäl denna förmåga.",
  "springcleaning22_rubick_jaunt": "Ethereal Jaunt använder nu samma förmågeplats som Illusory Orb. Rubick kan nu behålla båda förmågeplatserna när han stjäl denna förmåga.",
  "springcleaning22_rubick_eject": "Eject använder nu samma förmågeplats som Dismember om Rubik har Aghanim's Shard. Rubick kan nu behålla båda förmågeplatserna när han stjäl denna förmåga.",
  "springcleaning22_rubick_dismember": "Dismember kastar nu ut den allierade hjälten om en annan stulen förmåga tar över dess plats.",
  "springcleaning22_rubick_spit_out": "Spit Out använder nu samma förmågeplats som Gobble Up. Rubick kan nu behålla båda förmågeplatserna när han stjäl denna förmåga.",
  "springcleaning22_rubick_decoy": "Rubick stjäl inte längre Bushhack när han stjäl Decoy. Decoy applicerar fortfarande Bushwack när förmågan används.",
  "springcleaning22_rubick_spirits": "Om Ios förmåga Spirits stjäls, fungerar den nu korrekt när man skaffar sig Aghanim's Scepter.",
  "springcleaning22_rubick_gravekeepers_cloak": "Gravekeeper's Cloak kan nu stjälas när förmågan är uppgraderad av Aghanim's Scepter.",
  "springcleaning22_rubick_shard_cursed_crown": "Om Rubick har Aghanim's Shard skapar Cursed Crown nu även Brambles.",
  "springcleaning22_rubick_shard_venomous_gale": "Om Rubick har Aghanim's Shard skapar Venomous Gale nu även Plague Wards.",
  "springcleaning22_rubick_shard_sprout": "Om Rubick har Aghanim's Shard skapar Sprout nu även Treants.",
  "springcleaning22_rubick_shard_shackles": "Om Rubick har Aghanim's Shard skapar Shackles nu även Serpent Wards.",
  "springcleaning22_rubick_shard_cold_embrace": "Om Rubick har Aghanim's Shard frambringar Sprout nu även en Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "Om Rubick har Aghanim's Shard applicerar Earthshock även Enrage.",
  "springcleaning22_rubick_shard_shadow_step": "Om Rubick har Aghanim's Shard applicerar Shadow Step även Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "Om Rubick har Aghanim's Shard applicerar Terror Wave även Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "Om Rubick har Aghanim's Shard får Homing Missile även Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Om Rubick har Aghanim's Shard applicerar Slithereen Crush även Corrosive Haze.",
  "springcleaning22_rubick_scepter_flak_cannon": "Om Rubick har Aghanim's Scepter får Flak Cannon även den passiva förmågan Side Gunner.",
  "springcleaning22_rubick_scepter_time_walk": "Om Rubick har Aghanim's Scepter applicerar Time Walk även Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Om Rubick har Aghanim's Scepter applicerar Shuriken Toss även Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Om Rubick har Aghanim's Scepter applicerar Sacred Arrow även Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "Vektorinriktning för snabbanvändning vid nedåttryck av tangent har ändrats så att vektorn börjar vid nedåttryck av tangenten och slutar vid släpp av tangenten. Detta är samma som beteendet för snabbanvändning vid upptryck.",
  "springcleaning22_ui_ward_bounty": "När en Observer Ward förstörs visas nu vem som fick belöningen om belöningen inte gick till spelaren som förstörde den.",
  "springcleaning22_ui_spectator_hud_player_view": "HUD för åskådare visar nu korrekt vilken spelare man tittar på.",
  "springcleaning22_ui_post_game_scepter_shard": "Verktygstipsen för Aghanim's Scepter och Shard visar nu deras effekter på resultattavlan efter matchen.",
  "springcleaning22_ui_post_game_backpack_neutral": "Ryggsäck och neutrala föremål visas nu i hjältedetaljerna efter matchen.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Värden för magisk livstjälande effekt för hjältar och creeps visas nu separat när man trycker ned ALT-tangenten.",
  "springcleaning22_ui_skeleton_warrior_rally": "Skeleton Warriors rallyaura visas nu som en enda buffikon istället för flera.",
  "springcleaning22_ui_neutral_item_teleport": "Åtgärdade att man kunde byta ut neutrala föremål och teleportera ett så snabbt att fel föremål teleporterades.",
  "springcleaning22_ui_spectator_arcana": "Arcanagränssnitt visas inte längre upp i HUD för ligamatcher för åskådare.",
  "springcleaning22_ui_ready_check_enter": "Man kan nu trycka på ENTER för att bekräfta att man är redo.",
  "springcleaning22_ui_alt_item_combine": "Föremål i snabbköpsmenyn visar nu hela föremålet som de kombineras till när man trycker ned ALT-tangenten.",
  "springcleaning22_ui_alt_items_ready": "Om man trycker ned CTRL medan man Alt-klickar på följande föremål talar man om för sitt team att de är redo, istället för att samla dem: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight och Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Ökade antalet ägda Sentry Wards som visas under strategiperioden från 2 till 3. Max 3 Sentry Wards kan köpas i början av spelet.",
  "springcleaning22_ui_guide_pregame": "Efter att en hjälte har valts kommer sektionen med rekommenderade föremål nu att visa den första delen av en guide om guiden inte har ett avsnitt som heter Startföremål.",
  "springcleaning22_ui_ward_planter": "Om man väljer en ward visas nu den allierade spelare, allierade coach eller åskådare som placerat den.",
  "springcleaning22_ui_courier_home_button": "Hembutiksknappen för kurirer returnerar nu även alla föremål som den har till förrådet när den når basen.",
  "springcleaning22_ui_combat_log_key": "Stridsloggen kan nu bindas till en tangent i inställningarna.",
  "springcleaning22_ui_combat_log_right_align": "Stridsloggen är nu justerad till höger och överlappar inte längre med kontrollerna för hjältedemo.",
  "springcleaning22_ui_combat_log_hud_flip": "Stridsloggen tar nu hänsyn till omvänd HUD (minikarta till höger) och flyttar till vänster sida när detta alternativ är valt.",
  "springcleaning22_ui_guide_apos": "Åtgärdade att kommentarer på föremål/förmågor i guider ersatte apostrofer med ”&apos;” och andra HTML-symboler när de sparades. Guider som redan har sparats med det här problemet måste fortfarande uppdateras manuellt.",
  "springcleaning22_ui_vs_screen_widescreen": "Justerade visningen av hjältar på vs-skärmen för skärmar med ett höjd-/breddförhållande på 21:9 eller bredare.",
  "springcleaning22_ui_charms": "Åtgärdade en bugg där gränssnittet för berlocker visade överlappande text om du hade fler än 2 berlocker.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Åtgärdade en bugg i Last Hit-tränaren som förhindrade att creep spawnades om man klickade på start innan ens hjälte spawnats.",
  "springcleaning22_ui_intro_scenes": "Introduktionsscener (som hjälte- och Arcana-/Persona-debuter) visas inte längre för spelare som inte har gått igenom den inledande nybörjarupplevelsen.",
  "springcleaning22_cosmetics_illusion_skins": "Åtgärdade en bugg där illusioner ibland inte fick det korrekta utseendet från vissa kosmetiska modeller.",
  "springcleaning22_cosmetics_cloth_stretch": "Åtgärdade en bugg där tyget på vissa modeller ibland sträckte sig över skärmen.",
  "springcleaning22_cosmetics_underlord_immortal": "Underlords odödliga föremål Emerald Subjugation har nu en anpassad föremågeeffekt som ersätter effekten från hans ultimata förmåga.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Shadow Demons odödliga föremål Mantle of Grim Facade har nu korrekt riktning på projektileffekter för Shadow Poison.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Wraith King odödliga föremål Blistering Shade har prioritet över Arcana vid användning av Wraithfire Blast.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Korrigerade miljöeffekter för Earthshakers odödliga föremål Bracers of the Cavern Luminar.",
  "springcleaning22_cosmetics_warlock_immortal": "Åtgärdade felaktiga föremågeeffekter på Shadow Word (buff och debuff) för Warlocks odödliga föremål Umbral Glyph.",
  "springcleaning22_cosmetics_viper_immortal": "Åtgärdade felaktiga partiklar för Nethertoxins områdeseffekter för Vipers odödliga föremål Malefic Drake's Strike.",
  "springcleaning22_cosmetics_abaddon_vessel": "Aphotic Shield-effekterna har återställts för Abaddons Blade of the Demonic Vessel.",
  "springcleaning22_cosmetics_tidehunder_belt": "Tog bort partiklar från bältets plats som egentligen tillhörde armen för Tidehunters Horror From the Deep Belt.",
  "springcleaning22_cosmetics_faceless_incursion": "Åtgärdade miljöeffekter för vapen för Faceless Voids Claszureme Incursion.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Drow Rangers Arcana-aura för Marskmanship har nu anpassade effekter för båda stilarna.",
  "springcleaning22_cosmetics_rubick_dilemma": "Återställde miljöeffekter för Rubicks Torch of Fantoccini's Dilemma.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Animationen från Techies Arcana som visas när de springer medan de är skadade spelas nu i korrekt hastighet.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Lade till stöd för ädelstensfärger på Sticky Bomb och Reactive Tazer för Techies Arcana.",
  "springcleaning22_cosmetics_techies_icons": "Lade till saknade ekonomiföremål för Techies set Powdersled Rookery, Sapper's Guile, Bombtrails and Boomsticks och March of the Powderkeg Patrol.",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Åtgärdade animationen för Techie's Spoon i teleporteringsförhandsvisningen med Pachyderm Powderwagon-setet.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Rubicks Arcana har nu anpassade effekter för Techies Sticky Bomb istället för Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Åtgärdade Snapfires animation när hon är inaktiverad så att hon inte fastnar i en inkorrekt animationssekvens.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Legion Commanders Radiant Conqueror-bunt och -föremål kan nu säljas och bytas.",
  "springcleaning22_cosmetics_legion_commander_wind": "Lade till vindeffekter till Legion Commanders baner i Legacy of the Fallen Legion och Radiant Conqueror, oavsett om Arcana-vapen är utrustade eller inte.",
  "springcleaning22_perf_panorama_atlas": "Uppdaterade gränssnittsmotorn Panorama så att den använder texturatlas för att mer effektivt interagera med GPU:n. I våra mätningar resulterade detta i 25–30 % bättre prestanda i det GPU-arbete som krävs för HUD, och mycket mer på några särskilt komplicerade dashboardsidor. Denna förändring ökar även CPU-prestandan för Vulkan, och bör vara särskilt effektiv för Apple-datorer med M1-processorer.",
  "springcleaning22_perf_sand_king_particles": "Optimerade Sand Storm-partikeleffekter för att förbättra prestandan.",
  "springcleaning22_perf_panorama_clears": "Uppdaterade gränssnittsmotorn Panorama för att undvika onödig resning av renderingsmål, vilket undviker GPU-arbete.",
  "springcleaning22_perf_scenesystem_threading": "Åtgärdade en bugg där vi ibland använde färre trådar än avsett för att utföra flertrådsarbete. Denna korrigering är särskilt användbar för maskiner med 4 eller färre kärnor.",
  "springcleaning22_perf_thread_affinity": "Åtgärdade en bugg där felaktigt inställda trådtilldelningar kunde orsaka stopp på vissa maskiner.",
  "springcleaning22_perf_power_savings": "Lade till en varning i dialogrutan för videoinställningar som indikerar om datorn körs i energisparläge, vilket kan leda till långsam prestanda.",
  "springcleaning22_perf_shop_tooltips": "Förbättrade prestandan för verktygstips när man utforskar föremålsbutiken.",
  "springcleaning22_custom_games_overview_sort": "Fliken för arkadöversikt tillåter nu sortering efter antalet aktiva spelare, utöver antalet öppna lobbyer.",
  "springcleaning22_custom_games_update": "Åtgärdade ett problem med anpassade spel i arkaden som ibland inte visade att de behövde en uppdatering förrän de ominstallerades eller Steam hade startats om.",
  "springcleaning22_custom_games_lobby_version": "Lobbylistan i arkaden visar inte längre lobbyer som inte matchar versionen av det anpassade spelet som för närvarande är installerat, eller som man av andra anledningar inte kan ansluta till.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold kan nu filtrera guld mottaget från belöningsrunor.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Ersatte relik för Dazzle: ”Bad Juju-debuff på fyra hjältar” har ersatts av ”Skada och helande från Bad Juju”.",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Ersatte relik för Techies: ”Kills med Remote Mine” har ersatts av ”Sticky Bombs som fastnat på hjältar”.",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Ersatte relik för Techies: ”Bedövningar med Stasis Trap” har ersatts av ”Reactive Tazer som avväpnat flera hjältar”.",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Ersatte relik för Tinker: ”Skada med March of the Machines” har ersatts av ”Skada absorberad av Defense Matrix”.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Ersatte relik för Tinker: ”Kills efter Dark Rift” har ersatts av ”Kills av allierade som använt Fiend's Gate”.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Ersatte relik för Underlord: ”Hjältar räddade av Dark Rift” har ersatts av ”Utdelad bonusskada med Atrophy Aura”.",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Åtgärdade relik för Omniknight: ”Skada från allierade under Heavenly Grace”.",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Åtgärdade relik för Primal Beast: ”Onslaught som dödat flera hjältar”.",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Ersatte hjälteutmaning för Meepo: ”Magisk skada utdelad mot hjältar” ersattes av ”Ren skada utdelad mot hjältar”.",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Ersatte hjälteutmaning för Naga Siren: ”Hjältar som helades under Song of the Siren” ersattes av ”Utdela skada mot hjältar med bränd mana”.",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Ersatte hjälteutmaning för Tinker: ”Skada med March of the Machines” ersattes av ”Absorberad skada med Defense Matrix”.",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Ersatte hjälteutmaning för Techies: ”Kills med Remote Mine” ersattes av ”Sticky Bombs som fastnat”.",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Ersatte hjälteutmaning för Underlord: ”Teleportering av flera hjältar med Dark Rift” ersattes av ”Kills av allierade som använt Fiend's Gate”.",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Uppdaterade hjälteutmaning för Grimstroke: ”Skada utdelad mot fiender påverkade av Soul Bind” inkluderar nu skada från allierade.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Uppdaterade hjälteutmaning för Mirana: ”Skada utdelad under Leap” inkluderar nu alla skadetyper istället för enbart fysisk skada.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Åtgärdade hjälteutmaning för Bane: ”Kombinationer av Blink/Force Staff och Fiend's Grip”.",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Åtgärdade hjälteutmaning för Dragon Knight: ”Kills i Dragon Form”.",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Åtgärdade hjälteutmaning för Drow Ranger: ”Tysta 2+ fiender med Gust”.",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Åtgärdade hjälteutmaning för Crystal Maiden: ”Creepkills med Frostbite”.",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Åtgärdade hjälteutmaning för Dark Seer: ”Skada utdelad under Surge”.",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Åtgärdade hjälteutmaning för Lifestealer: ”Skada utdelad under Rage”.",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Åtgärdade hjälteutmaning för Lone Druid: ”Skada utdelad under True Form”.",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Åtgärdade hjälteutmaning för Mars: ”Skada utdelad mot fiendehjältar”.",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Åtgärdade hjälteutmaning för Mars: ”Döda fiendeenheter med Cleave”.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Åtgärdade hjälteutmaning för Omniknight: ”Skada utdelad under Heavely Grace”.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Åtgärdade hjälteutmaning för Omniknight: ”Varaktighet för Heavenly Grace på allierade”.",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Åtgärdade hjälteutmaning för Rubick: ”Telekenisis som bedövat flera hjältar”.",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Åtgärdade hjälteutmaning för Tinker: ”Skada utdelad mot hjältar med laseruppgradering från Aghanim's Scepter”.",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Åtgärdade hjälteutmaning för Tusk: ”Kombinationer av Walrus Kick och Walrus Punch”.",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Tog bort hjälteutmaning för Venomancer: ”Skada utdelad med Silver Edge mot hjältar påverkade av Break”.",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Tog bort hjälteutmaning för Tinker: ”Creepkills med March of the Machines”.",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Lade till hjälteutmaning för Underlord: ”Skada utdelad mot hjältar med Firestorm”.",
  "springcleaning22_workshop_modeldoc": "Dotas Workshop-verktyg för föremål och anpassade matcher har uppgraderats och använder nu den nya modellredigeraren ”ModelDoc”. Medverkande i Workshop bör migrera alla modeller från det gamla verktyget, som kommer att tas bort i en framtida uppdatering."
}