// 1361.js

{
  "language": "romanian",
  "springcleaning2025_website_year": "2025",
  "springcleaning2025_website_title": "Saltul primăvăratic",
  "springcleaning2025_website_title_year": "Saltul primăvăratic 2025",
  "springcleaning2025_website_introduction": "În Dota soarele strălucește și totul e plin de parfumul primăverii. Bucură-te acum de îmbunătățiri privind experiența de joc, 16 seturi noi de obiecte și actualizarea de joc 7.39.",
  "springcleaning2025_website_abovethefold_patch_header": "Actualizarea de joc 7.39",
  "springcleaning2025_website_abovethefold_treasure_header": "Heroes' Hoard",
  "springcleaning2025_website_abovethefold_features_header": "Îmbunătățiri privind experiența de joc",
  "springcleaning2025_website_abovethefold_patch_body": "Eroi reconcepuți, modificări pentru câmpul de luptă, noi obiecte neutre și o listă uriașă de modificări și remedieri.",
  "springcleaning2025_website_abovethefold_treasure_body": "16 seturi noi pentru eroi, inclusiv obiecte Immortal, Persona, batjocori și multe altele.",
  "springcleaning2025_website_abovethefold_features_body": "Totul, de la setările tale și până la magazin, a primit un tratament special.",
  "springcleaning2025_website_section_header_features": "Îmbunătățiri privind experiența de joc",
  "springcleaning2025_website_section_header_introduction": "Fiecare meci de Dota tocmai a devenit puțin mai bun.",
  "springcleaning2025_website_section_header_treasure": "Comoara de primăvară 2025",
  "springcleaning2025_website_section_header_patch": "Actualizarea de joc 7.39",
  "springcleaning2025_website_features_group_focus_on_hero": "Concentrează-te pe eroul tău",
  "springcleaning2025_website_features_group_focus_on_hero_summary": "Cu un magazin simplificat și multe automatizări, procesul de achiziționare nu a fost niciodată mai simplu.",
  "springcleaning2025_website_features_entry_team_items": "Obiectele echipei",
  "springcleaning2025_website_features_entry_team_items_desc": "Urmărește inventarele coechipierilor tăi la fel de ușor ca și pe al tău. Verifică ce obiecte au cumpărat sau așteaptă să cumpere, pentru a nu te mai trezi niciodată, [i]din greșeală[/i], cu două obiecte Radiance în echipa ta.",
  "springcleaning2025_website_features_entry_auto_deliver": "Livrare automată",
  "springcleaning2025_website_features_entry_auto_deliver_desc": "Personalizează-ți setările pentru curier pentru a livra automat obiectele achiziționate și fă chiar și o oprire la magazinul secret pe drum.",
  "springcleaning2025_website_features_entry_quickbuy": "Marchează pentru cumpărare",
  "springcleaning2025_website_features_entry_quickbuy_desc": "Folosește opțiunea „Marchează pentru cumpărare” pentru a desemna ce obiecte să fie cumpărate și livrate imediat ce ai suficient aur. Activează protecția pentru răscumpărare pentru a economisi niște aur pentru viața de apoi.",
  "springcleaning2025_website_features_entry_pregame_shop": "Afișare îmbunătățită a obiectelor de început",
  "springcleaning2025_website_features_entry_pregame_shop_desc": "Am adus modificări grilei de obiecte din faza de planificare, astfel încât să găsești cu ușurință obiectele de care ai nevoie, fără a fi nevoit să le filtrezi pe cele care nu te interesează.",
  "springcleaning2025_website_features_entry_buyback_tooltip": "Chenar cu informații despre răscumpărare",
  "springcleaning2025_website_features_entry_buyback_tooltip_desc": "Am îmbunătățit aspectul vizual al stării tale de răscumpărare, astfel încât vei putea ști imediat dacă răscumpărarea este disponibilă (sau dacă ai și un surplus de cheltuit).",
  "springcleaning2025_website_features_entry_identify_yourself": "Planificare clară",
  "springcleaning2025_website_features_entry_identify_yourself_desc": "Pe ecranul afișat înainte de începerea meciului, acum îți poți vedea cu ușurință rolul și echipa din care faci parte.",
  "springcleaning2025_website_features_entry_item_context_menu": "Meniu contextual pentru obiecte",
  "springcleaning2025_website_features_entry_item_context_menu_desc": "Am adăugat un meniu contextual pentru obiectele din magazin, care poate fi accesat dacă apeși CTRL + clic dreapta pe unul dintre obiecte.",
  "springcleaning2025_website_features_entry_dotaplus_shop": "Ghidul Dota Plus",
  "springcleaning2025_website_features_entry_dotaplus_shop_desc": "Dota Plus primește acum în mod permanent actualizări în funcție de versiunea ta compilată actuală și afișează sugestii detaliate și actualizate în timp real cu privire la următoarea ta achiziție.",
  "springcleaning2025_website_features_group_comms": "Comunicare și claritate",
  "springcleaning2025_website_features_group_comms_summary": "Modalități mai bune de a te coordona cu echipa ta și a obține informații importante cu privire la desfășurarea meciului.",
  "springcleaning2025_website_features_entry_pings": "Indicații noi",
  "springcleaning2025_website_features_entry_pings_desc": "Indicațiile au fost actualizate cu efecte vizuale și sunete noi pentru o comunicare îmbunătățită.",
  "springcleaning2025_website_features_entry_voice_chat": "Calitate îmbunătățită pentru chatul vocal",
  "springcleaning2025_website_features_entry_voice_chat_desc": "Indicațiile sunt grozave, dar uneori e mai bine să comunici vocal, iar chatul vocal sună acum mai bine ca niciodată.",
  "springcleaning2025_website_features_entry_aoe_effects": "Efecte pentru zonele de efect",
  "springcleaning2025_website_features_entry_aoe_effects_desc": "Atunci când un jucător folosește un obiect cu efect asupra aliaților din apropiere (Arcane Boots, Drum of Endurance etc.), efectele sunt afișate acum tuturor unităților beneficiare.",
  "springcleaning2025_website_features_entry_minimap_route": "Afișarea traseului pe minihartă",
  "springcleaning2025_website_features_entry_minimap_route_desc": "Indicația „Sunt pe drum” afișează traseul estimat al unui erou pe minihartă.",
  "springcleaning2025_website_features_entry_pickup_effects": "Efecte pentru preluarea obiectelor",
  "springcleaning2025_website_features_entry_pickup_effects_desc": "Atunci când un coechipier înșfacă un obiect important, precum Aegis of the Immortal sau Refresher Shard, pictograma obiectului va fi afișată pentru scurt timp deasupra eroului respectiv pentru ca toți să poată vedea.",
  "springcleaning2025_website_features_entry_status_labels": "Etichete de stare",
  "springcleaning2025_website_features_entry_status_labels_desc": "Sistemul de stare afișat deasupra eroilor a fost extins pentru a include un spectru mai larg de stări specifice eroilor, precum stări ca „Eteric”, „Blestemat”, „Unitatea nu poate fi țintită”, „Teleportare”, „Concentrare” și altele.",
  "springcleaning2025_website_features_group_control": "Putere și control",
  "springcleaning2025_website_features_group_control_summary": "Toate opțiunile pe care ți le-ai putea dori sunt, probabil, deja disponibile de mulți ani în joc, dar au fost ascunse într-un submeniu al unui submeniu. Dar acum nu mai e cazul. Setările au fost reorganizate pentru claritate, iar acum dispun și de o funcție de căutare.",
  "springcleaning2025_website_features_entry_settings": "Interfață nouă pentru setări",
  "springcleaning2025_website_features_entry_settings_desc": "Meniul cu setări este acum mai accesibil, cu un aspect mai curat și o organizare mai bună pentru a te ajuta să găsești mai repede ceea ce cauți.",
  "springcleaning2025_website_features_entry_settings_search": "Caută în setări",
  "springcleaning2025_website_features_entry_settings_search_desc": "Funcția de căutare din meniul cu setări facilitează personalizarea asocierilor și a stilului tău de joc preferat.",
  "springcleaning2025_website_features_entry_new_settings": "Descoperă setări noi",
  "springcleaning2025_website_features_entry_new_settings_desc": "Noile setări sunt acum marcate în mod clar, astfel încât să poți găsi și comuta cu ușurință caracteristicile noi.",
  "springcleaning2025_website_features_entry_chatwheel_ui": "Rotiță de chat și de indicații actualizată",
  "springcleaning2025_website_features_entry_chatwheel_ui_desc": "După ani întregi cu meniuri ascunse și o interfață de utilizator confuză, rotița de chat este în sfârșit ușor de găsit, mai ușor de utilizat și chiar mai ușor de personalizat.",
  "springcleaning2025_website_features_entry_notifications": "Gestionează notificările din joc",
  "springcleaning2025_website_features_entry_notifications_desc": "Economisește spațiu prețios în partea dreaptă a ecranului și primește doar notificările dorite.",
  "springcleaning2025_website_features_entry_graphs": "Îmbunătățiri aduse graficelor de la final de meci (și celor pentru spectatori)",
  "springcleaning2025_website_features_entry_graphs_desc": "Descoperă un grafic nou cu daunele cauzate de jucători, detalii mai bune și descrieri mai clare. Momentele cheie sunt evidențiate, astfel încât să le poți accesa imediat în timpul reluării.",
  "springcleaning2025_website_features_entry_perf": "Performanță",
  "springcleaning2025_website_features_entry_perf_desc": "O pornire mai rapidă, timpi de încărcare mai rapizi și o performanță mai stabilă în joc, cu un CPS mai mare.",
  "springcleaning2025_website_features_group_ability_draft": "Selecție abilități",
  "springcleaning2025_website_features_group_ability_draft_summary": "Actualizarea „Saltul primăvăratic” aduce o modificare importantă pentru modul „Selecție abilități: selecția eroilor”, care, alături de câteva alte mecanisme noi (împreună cu o grămadă de remedieri de erori), oferă modului „Selecție abilități” o actualizare cu adevărat necesară.",
  "springcleaning2025_website_features_entry_heroes": "Selecția eroilor",
  "springcleaning2025_website_features_entry_heroes_desc": "Acum nu mai selectezi doar abilitățile, ci selectezi și eroul de bază care la va folosi. Eroii sunt aleși oricând în timpul fazei de selecție, așa că decizia de a lege între acea abilitate extrem de puternică sau un erou de bază puternic și abilitățile native ale acestuia nu reprezintă doar o mișcare strategică, ci și o mișcare riscantă care poate face diferența.",
  "springcleaning2025_website_features_entry_facets": "Fațete",
  "springcleaning2025_website_features_entry_facets_desc": "În timpul selecției, cartonașul eroului tău va afișa fațetele disponibile în funcție de eroul și abilitățile selectate. Alege ce fațetă dorești să folosești pentru a-i oferi configurației tale un avantaj semnificativ.",
  "springcleaning2025_website_features_entry_cleanup": "Curățenie serioasă",
  "springcleaning2025_website_features_entry_cleanup_desc": "Pe lângă erorile remediate și îmbunătățirea performanței, am actualizat și sistemele din spate pentru a facilita actualizările de joc viitoare (și care vor strica jocul mai rar atunci când Dota se schimbă).",
  "springcleaning2025_website_features_group_everything_else": "O multitudine de alte lucruri",
  "springcleaning2025_website_features_group_everything_else_summary": "Cornucopiae este o plantă care este de obicei asociată cu recolta de toamnă, dar, alături de numeroasele îmbunătățiri din joc pe care le-am făcut, remediem și lucrurile din lumea reală. Recoltele se strâng acum primăvara, deci nu trebuie să plantezi nimic. Așa că bucură-te de roade și de toate celelalte lucruri menționate mai jos.",
  "springcleaning2025_website_features_entry_arcana_mvps": "Fundaluri cu Arcana pentru ecranul MVP",
  "springcleaning2025_website_features_entry_arcana_mvps_desc": "Ecranul MVP include acum fundaluri pentru obiectele Arcana și Persona pentru toți eroii demni de această onoare.",
  "springcleaning2025_website_features_entry_this_bug_is_old_enough_to_drive": "Eroare grafică pentru creepii neutri morți",
  "springcleaning2025_website_features_entry_this_bug_is_old_enough_to_drive_desc": "Am remediat-o! (Am avut nevoie doar de treisprezece ani.)",
  "springcleaning2025_website_features_entry_vector_targeting": "Îmbunătățiri pentru țintirea vectorială",
  "springcleaning2025_website_features_entry_vector_targeting_desc": "Abilitățile cu țintire vectorială (cum ar fi abilitatea Rebound a eroinei Marci) reacționează acum mai bine pentru a preveni clicurile greșite în timpul luptelor.",
  "springcleaning2025_website_features_entry_everything_else_else": "Îmbunătățiri",
  "springcleaning2025_website_treasures_label": "Comoara de primăvară 2025",
  "springcleaning2025_website_treasures_subheader": "Heroes' Hoard",
  "springcleaning2025_website_treasures_subheader_desc": "Începe noul sezon cu stil, cu 16 seturi noi pentru eroi, inclusiv obiecte Immortal, Persona, batjocuri și multe altele.",
  "springcleaning2025_website_gameplay_introduction": "Actualizarea de astăzi răspunde efectelor în lanț cauzate de valul de modificări aduse de actualizarea „Apele rătăcitoare”.",
  "springcleaning2025_website_gameplay_highlights": "Modificări importante",
  "springcleaning2025_website_gameplay_terrain_highlights": "Modificări importante aduse hărții",
  "springcleaning2025_website_gameplay_terrain_highlights_introduction": "Am realizat o serie de modificări mici, dar semnificative, pentru hartă, fiecare având ca scop îmbunătățirea cursului, echilibrului și clarității.",
  "springcleaning2025_website_gameplay_hero_highlights": "Modificări importante aduse eroilor",
  "springcleaning2025_website_gameplay_hero_highlights_introduction": "Câțiva eroi au primit niște modificări cu adevărat necesare și o serie întreagă de modificări pentru fațete, abilitățile native și îmbunătățirile acordare de Aghanim's Scepter și Aghanim's Shard.",
  "springcleaning2025_website_gameplay_neutral_highlights": "Modificări importante aduse obiectelor neutre",
  "springcleaning2025_website_gameplay_neutral_highlights_introduction": "Am readăugat câteva obiecte vechi preferate (și am eliminat alte câteva nedorite), cu opt artefacte neutre noi (și patru care sunt readăugate).",
  "springcleaning2025_website_gameplay_patchnotes": "Jurnalul actualizării",
  "springcleaning2025_treasure_hero_spiritbreaker": "Spirit Breaker",
  "springcleaning2025_treasure_hero_spiritbreaker_set": "Taurhorn Terror",
  "springcleaning2025_treasure_hero_antimage": "Anti-Mage Wei (persona inclusă)",
  "springcleaning2025_treasure_hero_antimage_set": "Spellbreaker's Braid",
  "springcleaning2025_treasure_hero_luna": "Luna",
  "springcleaning2025_treasure_hero_luna_set": "Seeker of the Crescent Wheel",
  "springcleaning2025_treasure_hero_invoker": "Kid Invoker (persona și batjocură incluse)",
  "springcleaning2025_treasure_hero_invoker_set": "Urchin of Kazim",
  "springcleaning2025_treasure_hero_necrophos": "Necrophos",
  "springcleaning2025_treasure_hero_necrophos_set": "Rot-Iron Ripper",
  "springcleaning2025_treasure_hero_huskar": "Huskar",
  "springcleaning2025_treasure_hero_huskar_set": "The Burning Sentinel",
  "springcleaning2025_treasure_hero_axe": "Axe",
  "springcleaning2025_treasure_hero_axe_set": "The Molten Fist",
  "springcleaning2025_treasure_hero_pudge": "Pudge (batjocură inclusă)",
  "springcleaning2025_treasure_hero_pudge_set": "Rotzo the Clown",
  "springcleaning2025_treasure_hero_earthshaker": "Earthshaker",
  "springcleaning2025_treasure_hero_earthshaker_set": "Pallbringer",
  "springcleaning2025_treasure_hero_sandking": "Sand King",
  "springcleaning2025_treasure_hero_sandking_set": "Serket of the Black Sands",
  "springcleaning2025_treasure_hero_lion": "Lion",
  "springcleaning2025_treasure_hero_lion_set": "Cannonroar Confessor",
  "springcleaning2025_website_bugfix_general": "Aspecte generale",
  "springcleaning2025_website_bugfix1": "Acum poți căuta un meci în timp ce urmărești un altul ca spectator.",
  "springcleaning2025_website_bugfix2": "A fost reactivată fila „Coechipieri” din istoricul meciurilor de pe profilul tău.",
  "springcleaning2025_website_bugfix3": "Meciurile care pot fi părăsite în siguranță nu te mai obligă acum să aștepți 5 secunde înainte de a le putea abandona.",
  "springcleaning2025_website_bugfix4": "Perioada de inactivitate permisă în modul Turbo a fost redusă de la 5 la 3 minute.",
  "springcleaning2025_website_bugfix5": "Tabela de scor afișează acum starea privind deținerea obiectelor Aghanim’s Scepter și Aghanim’s Shard pentru coechipieri și inamici (se actualizează cât timp sunt în raza vizuală).",
  "springcleaning2025_website_bugfix6": "A fost actualizată pictograma pentru daune de atac din secțiunea „Analize” a tabelei de scor, care indică, de asemenea, dacă eroul este de meleu sau de distanță.",
  "springcleaning2025_website_bugfix7": "Indicațiile privind obiectul Aegis of the Immortal al unui inamic afișează acum timpul rămas.",
  "springcleaning2025_website_bugfix8": "Trecerea cu mouse-ul peste abilități cu distanțe mari de invocare afișează acum distanța de invocare pe minihartă.",
  "springcleaning2025_website_bugfix9": "Acum poți face clic pentru a omite animațiile raportului de luptă.",
  "springcleaning2025_website_bugfix10": "A fost adăugată o vizualizare pentru spectatori care afișează fațetele tuturor eroilor.",
  "springcleaning2025_website_bugfix11": "A fost adăugat un efect sonor global nou care e redat la distrugerea unui oprimator.",
  "springcleaning2025_website_bugfix12": "Acum când se apasă clic dreapta pe un avanpost invulnerabil, unitatea se deplasează la acesta în loc să nu facă nimic.",
  "springcleaning2025_website_bugfix13": "Opțiunea „Selectează automat unitățile invocate” nu mai selectează obiectul Roshan’s Banner, pânzele eroinei Broodmother, scheletele lui Wraith King, minele eroilor Techies și piatra fuenrară a lui Undying.",
  "springcleaning2025_website_bugfix14": "Pictograma pentru zi/noapte din bara de sus afișează acum următorii eroi atunci când aceștia își folosesc abilitățile supreme: Phoenix Luna și Night Stalker.",
  "springcleaning2025_website_bugfix15": "A fost adăugat un buton nou pentru minijocuri, care este vizibil în timpul căutării unui meci.",
  "springcleaning2025_website_bugfix16": "Inelele pentru unitățile selectate afișează acum și direcția de orientare.",
  "springcleaning2025_website_bugfix17": "A fost adăugat un efect pentru Gleipnir, care e redat atunci când e invocat fără o țintă validă.",
  "springcleaning2025_website_bugfix18": "A fost adăugat un efect pentru modificarea atributelor obiectului Power Treads.",
  "springcleaning2025_website_bugfix19": "A fost adăugat un nou efect de particule pentru abilitatea nativă Aggrandize a lui Dark Seer.",
  "springcleaning2025_website_bugfixScan": "Scanarea unei zone produce acum un efect de particule în lume.",
  "springcleaning2025_website_bugfix20": "Chenarul cu informații al avanpostului explică acum cum poate fi ocupat.",
  "springcleaning2025_website_bugfix21": "Dacă amuțești o echipă în timpul unui meci, aceasta rămâne acum amuțită și în lobbyul de după meci.",
  "springcleaning2025_website_bugfix22": "Gyrocopter are acum un slot personalizabil pentru trăgătorul secundar.",
  "springcleaning2025_website_bugfix23": "A fost adăugată o animație în chenarul graficului de la sfârșit meciului pentru a afișa poziționarea eroilor de-a lungul timpului.",
  "springcleaning2025_website_bugfix24": "Eroii afectați de versiunea îmbunătățită de Aghanim's Scepter a abilității Smoke Screen a lui Riki au acum un efect unic și o etichetă de stare afișată deasupra barelor de viață, care indică faptul că nu pot fi țintiți de aliați.",
  "springcleaning2025_website_bugfix25": "Unitățile afectate de abilitatea Rupture a lui Bloodseeker acum au un efect deasupra care indică durata rămasă din Rupture.",
  "springcleaning2025_website_bugfix26": "A fost adăugată o nouă setare numită „Ocuparea structurilor poate fi oprită doar prin comanda de menținere a poziției/anulare” pentru a modifica dacă deplasarea sau invocarea unei abilități va anula concentrările asupra structurilor din lume. Acest lucru se aplică pentru observatoare, avanposturi, portalurile gemene și abilitatea Fiend's Gate a lui Underlord.",
  "springcleaning2025_website_bugfix31": "A fost remediată o situație în care funcția „Apasă pentru a vorbi” a chatului vocal nu funcționa uneori în timpul fazei de selecție a eroilor, fazei de planificare și în ecranul versus.",
  "springcleaning2025_website_bugfix32": "A fost remediată o situație în care utilizarea rapidă a invocării alternative pentru o abilitate nu invoca întotdeauna versiunea alternativă a abilității din cauza latenței.",
  "springcleaning2025_website_bugfix33": "Au fost remediate unele probleme de input care aveau loc atunci când jucătorii utilizau un creion de tabletă.",
  "springcleaning2025_website_bugfix_plus_relics": "Dota Plus – relicvele eroilor",
  "springcleaning2025_website_bugfix35": "Chen: relicva „Teleportări cu Divine Favor” a fost înlocuită cu „Ucideri după teleportări cu Divine Favor”.",
  "springcleaning2025_website_bugfix36": "Dazzle: relicva „Daune și vindecare de la Bad Juju” a fost înlocuită cu „Vindecare în timpul Nothl Projection”.",
  "springcleaning2025_website_bugfix37": "Tinker: relicva „Ucideri duble cu Heat-Seeking Missile” a fost înlocuită cu „Daune cauzate cu March of the Machines”.",
  "springcleaning2025_website_bugfix38": "Bristleback: relicva „Utilizări de Nasal Goo asupra a trei eroi” a fost înlocuită cu „Utilizări de Hairball asupra a trei eroi”.",
  "springcleaning2025_website_bugfix39": "Marci: relicva „Furt de viață cu Sidekick” a fost înlocuită cu „Atacuri cu Bodyguard”.",
  "springcleaning2025_website_bugfix40": "Gyrocopter: a fost remediată relicva „Daune cu trăgătorul secundar”.",
  "springcleaning2025_website_bugfix41": "Spirit Breaker: a fost remediată relicva „Șarje de la mare distanță”.",
  "springcleaning2025_website_bugfix42": "Venomancer: relicva „Utilizări de Poison Nova asupra a trei eroi” a fost înlocuită cu „Răspândiri de Noxious Plague asupra a doi eroi”.",
  "springcleaning2025_website_bugfix43": "Venomancer: relicva „Combinații de Poison Nova și Venomous Gale” a fost înlocuită cu „Atacuri de Septic Shock cu cinci sau mai multe efecte negative”.",
  "springcleaning2025_website_bugfix44": "Venomancer: relicva „Daune totale cu Poison Nova” a fost înlocuită cu „Daune totale cu Noxious Plague”.",
  "springcleaning2025_website_bugfix45": "Templar Assassin: a fost remediată relicva „Daune absorbite cu Refraction”.",
  "springcleaning2025_website_bugfix46": "Warlock: a fost remediată relicva „Ucideri cu Golemul”.",
  "springcleaning2025_website_bugfix47": "Axe: a fost remediată relicva „Inamici uciși de Culling Blade”.",
  "springcleaning2025_website_bugfix48": "Silencer: a fost remediată relicva „Inteligență furată”.",
  "springcleaning2025_website_bugfix49": "Relicva „Ucideri în urma folosirii obiectului Solar Crest” contorizează acum și uciderile realizate de un aliat care beneficiază de efectul obiectului.",
  "springcleaning2025_website_bugfix50": "A fost modificată relicva „Ucideri în urma folosirii obiectului Meteor Hammer” pentru a deveni mai ușor de obținut.",
  "springcleaning2025_website_bugfix51": "Morphling: relicva „Ucideri în urma folosirii obiectului Ethereal Blade” a fost înlocuită cu „Viață furată”.",
  "springcleaning2025_website_bugfix52": "Morphling: relicva „Combinații de Ethereal Blade și Adaptive Strike” a fost înlocuită cu „Durată la Attribute Shift maxim”.",
  "springcleaning2025_website_bugfix53": "Morphling: relicva „Năuciri maxime cu Adaptive Strike” a fost redenumită în „Împingeri maxime cu Adaptive Strike”.",
  "springcleaning2025_website_bugfix54": "A fost remediată problema în care animația introductivă a hărții din Dota începea cu un cadru mai târziu.",
  "springcleaning2025_website_bugfix55": "A fost remediată problema în care, la început de meci, camera era centrată pe centrul hărții în loc de locația de apariție a eroului.",
  "springcleaning2025_website_bugfix56": "A fost remediată problema în care era posibilă selectarea accidentală a mai multor unități atunci când se făcea dublu clic pe o unitate, chiar dacă unul dintre clicuri era pentru o invocare de vrajă.",
  "springcleaning2025_website_bugfix58": "A fost remediată problema în care derularea unei reluări nu era precisă la trecerea peste pauzele de joc.",
  "springcleaning2025_website_bugfix59": "A fost remediată problema în care tronul obiectului Arcana al lui Wraith King nu apărea uneori.",
  "springcleaning2025_website_bugfix60": "A fost remediată o eroare din cauza căreia slotul pentru obiecte neutre afișa întotdeauna un obiect disponibil în modul spectator.",
  "springcleaning2025_website_bugfix61": "A fost remediată situația în care pictograma abilității de scanare era gri atunci când avea încărcături.",
  "springcleaning2025_website_bugfix62": "A fost remediată problema în care, dacă erau active mai multe scanări, pe minihartă era afișat efectul unei singure scanări.",
  "springcleaning2025_website_bugfix63": "A fost remediată problema în care poziția de pe minihartă a indicatorului eroului nu era actualizată atunci când eroul se teleporta la o unitate.",
  "springcleaning2025_website_bugfix64": "A fost remediată o cădere din tutorialul „Progres la mijlocul meciului”.",
  "springcleaning2025_website_bugfix65": "A fost remediată eroarea din cauza căreia animația aferentă fațetei Sidestep a eroinei Drow Ranger o făcea pe aceasta să alunece pe pământ.",
  "springcleaning2025_website_bugfix66": "A fost remediată situația în care curierul putea lua obiecte de tip Bottle care conțineau o rună de putere atunci când obiectul era marcat pentru vânzare.",
  "springcleaning2025_website_bugfix67": "A fost remediată situația în care atacul spintecător al lui Wraith King nu era afișat corect în jurnalul de luptă.",
  "springcleaning2025_website_bugfix68": "A fost remediată problema în care prețul de vânzare al unui obiect din rucsac nu putea fi văzut.",
  "springcleaning2025_website_bugfix69": "A fost actualizată definiția din glosar a lui Roshan.",
  "springcleaning2025_website_bugfix70": "A fost remediată problema în care starea „Marchează pentru cumpărare” nu se actualiza corect în anumite situații.",
  "springcleaning2025_website_bugfix71": "A fost remediată problema în care raportul Dota Plus de detaliere a daunelor afișa valori incorecte pentru unitățile invocate.",
  "springcleaning2025_website_bugfix72": "A fost remediată situația în care puteai să vezi dacă un inamic aflat în ceață și-a folosit obiectul Smoke of Deceit, trăgând cu mouse-ul unul dintre obiectele tale Smoke of Deceit, apoi selectând inamicul respectiv în bara de sus, înainte de activarea obiectului.",
  "springcleaning2025_website_bugfix73": "A fost remediată problema în care eroul se teleporta la unitatea greșită atunci când folosea Boots of Travel pe minihartă, în timp ce jucătorul trecea cu mouse-ul peste o unitate în afara minihărții.",
  "springcleaning2025_website_bugfix74": "A fost remediată problema în care se folosea pictograma implicită a unui erou atunci când un jucător avea echipat un obiect Arcana sau Persona și se teleporta.",
  "springcleaning2025_website_bugfix75": "A fost remediată problema în care se afișa un mesaj de eroare atunci când nu aveai un erou selectat în faza de planificare.",
  "springcleaning2025_website_bugfix76": "A fost remediată situația în care efectul pozitiv oferit de Arcane Boots nu afișa o pictogramă pentru Basilius Aura.",
  "springcleaning2025_website_bugfix77": "A fost remediată problema în care graficul de la finalul meciului putea include date din faza de pregătire.",
  "springcleaning2025_website_bugfix78": "A fost remediată problema în care poveștile obiectelor neutre nu erau afișate în chenarele cu informații.",
  "springcleaning2025_website_bugfix79": "A fost remediată problema în care numele eroilor erau descentrate atunci când se excludeau eroi înaintea unui meci Turbo.",
  "springcleaning2025_website_bugfix80": "A fost remediată problema în care chenarele cu informații pentru abilități și obiecte nu se actualizau corect atunci când abilitatea sau obiectul cu chenarul deschis era actualizat sau eliminat în timp ce chenarul era afișat.",
  "springcleaning2025_website_bugfix_tooltips": "Chenare cu informații",
  "springcleaning2025_website_bugfix82": "A fost remediată problema în care descrierea abilității Fortune's End a lui Oracle nu indica faptul că durata de înrădăcinare crește proporțional cu durata concentrării.",
  "springcleaning2025_website_bugfix83": "A fost remediată problema în care descrierea abilității Blast Off! a lui Techies indica eronat daunele autoprovocate drept un procent din maximul de viață în loc de viață curentă.",
  "springcleaning2025_website_bugfix84": "A fost remediată problema în care descrierea îmbunătățirii oferite de Aghanim's Shard pentru abilitatea Spear of Mars a lui Mars nu conținea cuvântul „eroi”.",
  "springcleaning2025_website_bugfix85": "A fost remediată problema în care descrierea abilității Swashbuckle a lui Pangolier nu conținea și mențiunea alternativă.",
  "springcleaning2025_website_bugfix86": "A fost remediată problema în care descrierea abilității Splinter Blast a eroinei Winter Wyvern nu conținea durata încetinirii.",
  "springcleaning2025_website_bugfix87": "A fost adăugată durata efectului pozitiv în descrierea abilității Jingu Mastery a lui Monkey King.",
  "springcleaning2025_website_bugfix88": "A fost reformulată descrierea abilității Divided We Stand a lui Meepo pentru a clarifica faptul că Meepo poate avea activă doar o singură pereche de cizme.",
  "springcleaning2025_website_bugfix89": "Au fost actualizate descrierile abilităților lui Nyx Assassin pentru a înlocui „Nyx” cu „Nyx Assassin”.",
  "springcleaning2025_website_bugfix90": "A fost remediată problema în care descrierea abilității Summon Wolves a lui Lycan nu afișa mențiunile alternative.",
  "springcleaning2025_website_bugfix91": "A fost eliminată mențiunea alternativă din descrierea abilității Shapeshift a lui Lycan în care era menționat faptul că zona sa de coliziune se modifică.",
  "springcleaning2025_website_bugfix92": "A fost remediată problema în care descrierea modificatorului aferent fațetei Spirit Wolves a lui Lycan nu indica valoarea corectă a bonusului de daune.",
  "springcleaning2025_website_bugfix93": "A fost remediată problema în care denumirea modificatorului aferent fațetei Spirit Wolves a lui Lycan folosea numele vechi al fațetei.",
  "springcleaning2025_website_bugfix94": "A fost remediată problema în care descrierea modificatorului aferent abilității Stone Gaze a Medusei nu afișa valoarea corectă de reducere a vitezei.",
  "springcleaning2025_website_bugfix95": "A fost remediată problema în care descrierea modificatorului aferent abilității Empower (cu fațeta Eternal Empowerment) a lui Magnus nu conținea anumite informații."
}