// 4300.js

{
  "language": "latam",
  "springcleaning22_desc": "La actualización Limpieza de Primavera de 2022 ya llegó para parchar un aluvión de fallos e implementar un puñado de correcciones de fallos y muchísimos arreglos generales. Échale un vistazo a algunos de nuestros cambios más importantes, tales como mejoras a las descripciones de los objetos de Aghanim, control de silenciado, búsquedas en la tienda y el modo de prueba del héroe, o revisa la lista completa de mejoras y ajustes a la jugabilidad abajo.",
  "springcleaning22_aghs_tooltips": "Descripciones emergentes de Cetro y Fragmento de Aghanim",
  "springcleaning22_aghs_tooltips_desc": "El funcionamiento interno de la mente de Aghanim (y sus monólogos) es, sin duda, incomprensible para un simple mortal, pero con la actualización de hoy, se ha develado el impacto que tienen sus magníficos cetros y fragmentos en el campo de batalla. Las descripciones de las mejoras de Aghanim ahora incluyen más detalle sobre las cantidades exactas que cambian al equiparse y las habilidades modificadas también incluyen esos datos en una sección especial. También hemos prestado atención especial a muchas de las mejoras para simplificarlas y que resulten más fáciles de entender a nuestras mentes menos grandiosas.",
  "springcleaning22_muting_ui": "Mejoras de Silenciar",
  "springcleaning22_muting_ui_desc": "Los jugadores de Dota son un grupo bullicioso y, a veces, las emociones equivocadas se imponen en medio del calor de la competencia. En los casos en que ese comportamiento se vuelva disruptivo es importante tener una manera rápida y fácil para silenciar a los jugadores y denunciarlos para un escrutinio adicional sin mayores interrupciones en tu partida. Para ello, ahora con un solo clic silenciarás la voz y los textos, y denunciarás a un jugador. También puedes hacer clic con el botón derecho para silenciar el texto y la voz de forma independiente en los casos en que el comportamiento de un jugador no sea perjudicial pero sus comunicaciones aún no sean deseadas. Para un control sencillo de alto nivel, también puedes usar los nuevos botones Silenciar al equipo para bloquear las comunicaciones de todo un equipo con un clic.\\n\\nTambién aprovechamos esta oportunidad para reevaluar la manera en que manejamos las denuncias de comunicaciones. Nuestro objetivo es poder silenciar con rapidez y facilidad a los jugadores disruptivos a la vez que obtenemos una indicación clara de cuáles son los jugadores que merecerían medidas más severas.",
  "springcleaning22_demo_hero": "Mejoras de prueba de héroes",
  "springcleaning22_demo_hero_desc": "¿Quieres probar las últimas estrategias o crear algunas propias? O a lo mejor no te puedes resistir a ver cuántas encarnaciones de Axe se pueden aniquilar con un solo golpe de Clamamareas. En todo caso, ¡estás de suerte! El modo de prueba de héroes se actualizó con una revisión que incluye un montón de funcionalidades nuevas:",
  "springcleaning22_demo_hero_map": "La sección norte del mapa de prueba se amplió para proporcionar más espacio llano para realizar pruebas.",
  "springcleaning22_demo_hero_hero_spawn": "Se añadieron controles para reaparecer fácilmente héroes aliados, así como enemigos.",
  "springcleaning22_demo_hero_hero_reset": "Se añadió un control para restablecer al héroe al nivel 1.",
  "springcleaning22_demo_hero_hero_remove": "Se añadió un control para eliminar al héroe una vez que hayas terminado de probar.",
  "springcleaning22_demo_hero_hero_select": "Los nuevos héroes creados se añaden a la selección actual.",
  "springcleaning22_demo_hero_levelling": "Los botones para subir de nivel, añadir cetros y fragmentos, y activar o desactivar la invulnerabilidad afectan ahora a todos los héroes seleccionados.",
  "springcleaning22_demo_creep_toggle": "Al desactivar creeps, se destruyen todos los creeps de senda existentes.",
  "springcleaning22_demo_creep_spawn": "Se añadió un botón para generar una sola oleada de creeps de cada lado.",
  "springcleaning22_demo_hero_runes": "Se añadieron botones para generar las 6 runas principales.",
  "springcleaning22_shop_search": "Actualización de búsquedas en la tienda",
  "springcleaning22_shop_search_desc": "Gastar el oro debería ser fácil, divertido y, principalmente, eficaz. Por lo que para ayudarte a que tus compras sean menos aburridas y mucho más exitosas, la búsqueda de la tienda de objetos se ha ampliado con mayor soporte para palabras clave —incluyendo una sección que destaca los atributos de la búsqueda. Busca \"Armadura\", \"Fuerza\", \"Alcance\", etc., para destacar los atributos que te interesan. Nunca ha sido tan fácil escoger el objeto perfecto para el plan perfecto. Ahora, lo único que necesitas es el oro.",
  "springcleaning22_item_tooltips": "Ampliación de las descripciones emergentes de objetos",
  "springcleaning22_item_tooltips_desc": "Si se te olvida continuamente cuánto maná proporciona esa inteligencia o cuánta armadura recibes por la agilidad, no te preocupes: ahora, al mantener pulsado ALT mientras ves las descripciones emergentes de los objetos, las propiedades se amplían para mostrar todos los componentes.",
  "springcleaning22_colored_ability_damage": "Colores de daño de habilidad",
  "springcleaning22_colored_ability_damage_desc": "Tomar buenas decisiones durante las batallas depende de cuánto sabes de los desafíos que enfrentas. Para ayudarte a analizar los posibles peligros, el daño infligido por hechizos y objetos aparece ahora con un color diferente si se trata de un daño físico, mágico o puro.",
  "springcleaning22_pluralized_strings": "Se mejoró la pluralización en diferentes idiomas",
  "springcleaning22_pluralized_strings_desc": "Para mejorar la accesibilidad en todo el mundo, añadimos funcionalidades para mejorar las reglas de pluralización para varios idiomas, y actualizamos más de 400 líneas de texto para reflejar estos cambios.",
  "springcleaning22_permanent_debuffs": "Mejoras permanentes",
  "springcleaning22_permanent_debuffs_desc": "Es difícil crear estrategias sin comprender la eficacia de tus acciones. Para que tengas más información después de una partida, las víctimas de la Guadaña de la Muerte de Necrophos y la Hoja Selectiva de Axe aparecen ahora en la pantalla posterior a la partida.",
  "springcleaning22_post_game_sortable": "Detalles pospartida ordenables",
  "springcleaning22_post_game_sortable_desc": "¿Quieres profundizar en los detalles detrás de tus victorias? La tabla de puntuaciones se puede ordenar al final de la partida para facilitar el análisis.",
  "springcleaning22_gameplay_tp_boots": "Es menos probable que un creep sea el objetivo de Botas de Viaje cuando se lanza dentro del alcance de una torre.",
  "springcleaning22_gameplay_sellback": "Los jugadores pueden vender ahora un objeto por su precio original durante los 30 primeros segundos de la partida, en lugar del periodo de reventa normal de 10 segundos.",
  "springcleaning22_gameplay_lifestealer_consume": "Consumir de Lifestealer ahora utiliza la misma tecla rápida, independientemente del tipo de unidad infestada.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "El preataque y el aturdimiento del Luchador Ogro tienen ahora efectos de sonido.",
  "springcleaning22_gameplay_neutral_aura_radius": "Todas las auras de los creeps neutrales muestran ahora el radio al pasar el mouse por encima.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Las bonificaciones de atributos de Antifaz Espectral, Talismán Anulador y Brazalete se actualizan ahora en las descripciones emergentes de las habilidades cuando se duplican en el minuto 25.",
  "springcleaning22_gameplay_heal_overhead": "Se corrigió una serie de casos en los que las cantidades de curación emergentes no tenían en cuenta la amplificación de la curación.",
  "springcleaning22_gameplay_fountain_invuln": "Los jugadores con el efecto positivo de Invulnerabilidad de la Fuente ya no autoatacan ni rompen el efecto cuando tienen enemigos a su alcance.",
  "springcleaning22_gameplay_blink_range": "El indicador de alcance del hechizo Traslación y sus variantes ya tiene en cuenta los efectos positivos de aumento del alcance de lanzamiento.",
  "springcleaning22_gameplay_desolator_tooltip": "Se aclaró la descripción emergente del componente pasivo Corrupción de Desoladora. Desoladora obtiene daño de ataque cada vez que un enemigo muere cuando es afligido por efecto negativo de Corrupción.",
  "springcleaning22_gameplay_ardm_stash": "Se corrigió un fallo en el modo TAAM por el cual, cuando un mensajero devolvía un objeto a la reserva estando muerto, el objeto desaparecía.",
  "springcleaning22_gameplay_neutral_items_lock": "Las combinaciones de objetos neutrales ya no se pueden bloquear. De esta forma, se soluciona un fallo que hacía que los mensajeros no entregaran objetos neutrales en combinaciones bloqueadas.",
  "springcleaning22_gameplay_illusion_modifiers": "Se corrigió un fallo que hacía que las ilusiones con modificadores duplicados tuviesen duraciones incorrectas, lo que permitía la identificación del héroe real.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Se corrigió un fallo en los modos Turbo y Jugador Nuevo por el que algunas fuentes de oro no aumentaban correctamente.",
  "springcleaning22_gameplay_turbo_courier": "Se corrigió un fallo en el Modo Turbo por el cual el mensajero de un jugador dejaba de funcionar si se perdía la conexión al seleccionar un héroe o planificar.",
  "springcleaning22_gameplay_zero_tooltips": "Se corrigió un error por el cual algunas descripciones en el juego modificadas por talentos mostraban el valor 0 en lugar del valor correcto.",
  "springcleaning22_gameplay_euls_invulnerable": "El lanzamiento del Cetro de Eul a clones inmunes a la magia aplica ahora correctamente su efecto a los clones, en lugar de simplemente recargar.",
  "springcleaning22_gameplay_kobold_aura": "El Aura de Prospección de Kóbold ya no se aplica a los creeps de héroes (por ejemplo, Espíritu Oso de Lone Druid), lo cual corrige un fallo que hacía que otorgase el doble del efecto por error.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Los clones y los Duplicados de la Tempestad ya reciben correctamente la bonificación de atributos de las bendiciones del Cetro de Aghanim otorgadas por Alchemist.",
  "springcleaning22_gameplay_chen_hand_of_god": "La Mano de Dios de Chen ahora aplica correctamente la curación con el tiempo en creeps controlados por Chen, no solo la curación inicial.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "La penalización al ataque a distancia de Duplicado de la Tempestad de Arc Warden ahora respeta la rencarnación de Arc Warden.",
  "springcleaning22_gameplay_arc_warden_basher": "Se añadió una descripción emergente para aclarar que Clones y Duplicado de la Tempestad no puede golpear con Aplastacráneos o Abisal.",
  "springcleaning22_gameplay_arc_warden_blink": "La Daga de Traslación ya no tiene tiempo de recarga para Duplicado de la Tempestad de Arc Warden al ser invocados.",
  "springcleaning22_gameplay_arc_warden_wards": "El Duplicado de la Tempestad de Arc Warden ya no puede redibir guardianes compartidos.",
  "springcleaning22_gameplay_pa_scepter_double": "La mejora del Cetro de Aghanim de Phantom Assassin ya no actualiza Desvanecer al matar a un Duplicado de la Tempestad.",
  "springcleaning22_gameplay_naga_siren_riptide": "El -1 de ataque necesario para Aguas Revueltas de Naga Siren ya disminuye correctamente 1 solo de ataque, en lugar de 2.",
  "springcleaning22_gameplay_legion_commander_duel": "El daño adicional de Duelo de Legion Commander se otorga ahora aún si el ganador es invulnerable.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Patada de Morsa de Tusk tiene ahora el tiempo de recarga correcto de 12 segundos.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Metamorfosis de Terrorblade tiene ahora el tiempo de recarga correcto de 35/40/45/50.",
  "springcleaning22_gameplay_monkey_king_arena": "Danza Arbórea de Monkey King ya no puede escapar de Arena de Sangre.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "En Selección de habilidades, los efectos de Marea de Naga Siren ahora se aplican al héroe correcto en lugar de siempre a Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Ahora Riki puede lanzar Cortina de Humo mientras canaliza Secretos del Oficio sin interrumpir el canal aunque se haya activado \"Canal requiere Mantener/Detener\".",
  "springcleaning22_gameplay_marci_dispose_lotus": "Se corrigió la interacción de Apartar de Marci con BKB y Orbe de Loto.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Granada Aturdidora de Sniper ahora añade un ícono de desarmar en la parte alta.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling ya no conserva permanentemente Vínculo Espiritual pasivo cuando se transforma en Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Se añadió un ícono faltante de canalización para Portal Demoníaco de Underlord.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Se añadió una descripción para el efecto negativo de la habilidad Bomba de Fuego helada.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Los efectos de partículas de Corona Maldita para Dark Willow con Fragmento de Aghanim tienen ahora el tiempo correcto.",
  "springcleaning22_gameplay_lone_druid_midas": "Usar Mano de Midas en Espíritu Oso de Lone Druid ahora otorga experiencia al héroe en control.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Espíritu Oso y Duplicado de la Tempestad ahora pueden obtener cargas de Palo Mágico, Varita Mágica y Medallón Sagrado.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "La descripción emergente de Paso Astral para Void Spirit ahora muestra correctamente los valores de amplificación de hechizo cuando se pulsa ALT.",
  "springcleaning22_gameplay_heavenly_jump_range": "La habilidad Salto Celestial de Zeus ahora muestra su alcance cuando se pasa el mouse por encima.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Se corrigieron las descripciones de Aura Arcana de Crystal Maiden.",
  "springcleaning22_gameplay_hex_tooltip": "Se corrigió la descripción emergente de la Maldición de Shadow Shaman que añadía un segundo por error cuando se selecciona el talento \"Maldición aplica Ruptura\".",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Se corrigió el talento de nivel 20 de Abaddon que no actualizaba el tiempo de recarga de Tiempo Prestado en la descripción del objeto.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Se corrigió la Presencia del Señor Oscuro de Shadow Fiend para que se aplique correctamente en creeps neutrales.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Se corrigió cuando la Bengala de Teletransportación de Tinker funcionaba en Roshan.",
  "springcleaning22_gameplay_ability_draft_wukong": "Se corrigió un fallo que impedía que los clones de Dominio de Wukong en el modo de selección de habilidades no tenía las habilidades correctas.",
  "springcleaning22_rubick_illusions": "Se corrigió un error que prevenía que las ilusiones de Rubick tuvieran las animaciones correctas basadas en los hechizos robados (por ejemplo, Garra del Diablo de Bane junto con el Cetro de Aghanim).",
  "springcleaning22_rubick_hunter_in_the_night": "Ahora se puede robar Cazador Nocturno cuando se mejora con Cetro de Aghanim.",
  "springcleaning22_rubick_juxtapose": "Ahora se puede robar Yuxtaponer cuando se mejora con Cetro de Aghanim.",
  "springcleaning22_rubick_fireball": "La Bola de Fuego de Dragon Knight ya se puede robar independientemente de la Forma Dragón y no se otorga automáticamente.",
  "springcleaning22_rubick_wolf_bite": "Mordisco de Lobo ahora funciona cuando se roba.",
  "springcleaning22_rubick_depth_shroud": "Manto de las Profundidades ahora funciona cuando se roba.",
  "springcleaning22_rubick_astral_spirit": "Eliminar Espíritu Astral separa la habilidad de movimiento al ser robado. Rubick ahora puede mantener ambos espacios de habilidad al robar esta habilidad.",
  "springcleaning22_rubick_reverse_time_walk": "Salto Temporal Inverso ahora se intercambia al mismo espacio de habilidad que Salto Temporal si Rubick tiene el Fragmento de Aghanim. Rubick ahora puede mantener ambos espacios de hechizo al robar esta habilidad.",
  "springcleaning22_rubick_jaunt": "Viaje Etéreo ahora se intercambia al mismo espacio de habilidad de Orbe Ilusorio. Rubick ahora puede mantener ambos espacios de habilidad al robar esta habilidad.",
  "springcleaning22_rubick_eject": "Expulsar ahora se intercambia al mismo espacio de habilidad que Descuartizar si Rubick tiene el Fragmento de Aghanim. Rubick ahora puede mantener ambos espacios de hechizo al robar esta habilidad.",
  "springcleaning22_rubick_dismember": "Descuartizar ahora expulsa al héroe aliado si en su lugar se robó otro hechizo.",
  "springcleaning22_rubick_spit_out": "Escupir ahora se intercambia para el mismo espacio de habilidad de Engullir. Rubick ahora puede mantener ambos espacios de habilidad al robar esta habilidad.",
  "springcleaning22_rubick_decoy": "Al robar Señuelo ya no se roba también Emboscada. Al lanzar Señuelo, se sigue aplicando Emboscada.",
  "springcleaning22_rubick_spirits": "Ya funciona correctamente el robo de Espíritus de Io al conseguir el Cetro de Aghanim.",
  "springcleaning22_rubick_gravekeepers_cloak": "Ahora se puede robar Manto del Guardián de la Tumba con la mejora Cetro de Aghanim.",
  "springcleaning22_rubick_shard_cursed_crown": "Si Rubick tiene Fragmento de Aghanim, Corona Maldita ahora también creará Zarzas.",
  "springcleaning22_rubick_shard_venomous_gale": "Si Rubick tiene Fragmento de Aghanim, Vendaval Venenoso ahora también creará Guardianes de la Plaga.",
  "springcleaning22_rubick_shard_sprout": "Si Rubick tiene Fragmento de Aghanim, Brotar ahora también creará Ents.",
  "springcleaning22_rubick_shard_shackles": "Si Rubick tiene Fragmento de Aghanim, Ataduras ahora también creará Guardianes Serpiente.",
  "springcleaning22_rubick_shard_cold_embrace": "Si Rubick tiene Fragmento de Aghanim, Abrazo Helado ahora también emanará una Esquirla Explosiva.",
  "springcleaning22_rubick_shard_earthshock": "Si Rubick tiene Fragmento de Aghanim, Sacudida también aplicará Enfurecer.",
  "springcleaning22_rubick_shard_shadow_step": "Si Rubick tiene Fragmento de Aghanim, Pisasombra también aplicará Daga Espectral.",
  "springcleaning22_rubick_shard_terror_wave": "Si Rubick tiene Fragmento de Aghanim, Oleada de Terror también aplicará Metamorfosis. ",
  "springcleaning22_rubick_shard_homing_missile": "Si Rubick tiene el Fragmento de Aghanim, Misil Buscador también tendrá Andanada de Cohetes.",
  "springcleaning22_rubick_shard_slithereen_crush": "Si Rubick tiene el Fragmento de Aghanim, Aplastamiento Deslizante también aplicará Neblina Corrosiva.",
  "springcleaning22_rubick_scepter_flak_cannon": "Si Rubick tiene el Cetro de Aghanim, Cañón Antiaéreo también tendrá al Artillero lateral pasivo.",
  "springcleaning22_rubick_scepter_time_walk": "Si Rubick tiene el Cetro de Aghanim, Salto Temporal también aplicará Bloqueo Temporal.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Si Rubick tiene el Cetro de Aghanim, Lanzamiento de Shuriken también aplicará Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Si Rubick tiene el Cetro de Aghanim, Flecha Sagrada también aplicará Tormenta Estelar.",
  "springcleaning22_ui_quickcast_vector_targeting": "El apuntado vectorial para lanzamiento rápido al presionar la tecla ha cambiado para que se empiece a dibujar el vector al presionar la tecla y se acabe al soltarla. Este es el mismo comportamiento que el lanzamiento rápido al soltar la tecla.",
  "springcleaning22_ui_ward_bounty": "El evento de combate al matar a un Guardián Observador ahora muestra a quien haya recibido la recompensa si es alguien diferente al asesino.",
  "springcleaning22_ui_spectator_hud_player_view": "El HUD de espectador ahora muestra correctamente al jugador que estás viendo.",
  "springcleaning22_ui_post_game_scepter_shard": "Las descripciones del Cetro de Aghanim y los fragmentos ahora muestran sus efectos en la tabla de puntuación posterior a la partida.",
  "springcleaning22_ui_post_game_backpack_neutral": "Los objetos neutros y de la mochila ahora aparecen en los detalles del héroe en la pantalla pospartida.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Los valores de robo de vida por hechizo por habilidades en héroes y creeps ahora aparecen por separado cuando la tecla ALT está presionada.",
  "springcleaning22_ui_skeleton_warrior_rally": "El seguimiento del aura para Rally de Guerrero Esqueleto ahora se hace usando un contador de efectos positivos en lugar de múltiples íconos individuales de efectos positivos.",
  "springcleaning22_ui_neutral_item_teleport": "Se corrigió un fallo que hacía que intercambiar los objetos neutrales y teletransportar uno de ellos muy rápido ocasionara la teletransportación del objeto equivocado.",
  "springcleaning22_ui_spectator_arcana": "Las interfaces relacionadas con objetos arcanos ya no aparecen en partidas de liga en modo espectador.",
  "springcleaning22_ui_ready_check_enter": "Ahora es posible presionar ENTER para aceptar que estás listo.",
  "springcleaning22_ui_alt_item_combine": "Los objetos en el menú de compra rápida ahora muestran el objeto completo del que forman parte cuando presionas la tecla ALT.",
  "springcleaning22_ui_alt_items_ready": "Mantener presionada la tecla CTRL al hacer clic derecho en los siguientes objetos le indicará a tu equipo que están listos, en lugar de recogerlos: Botas Arcanas, Protector Carmesí, Grebas del Guardián, Mekansm, Pipa de la Perspicacia y Humo del Engaño.",
  "springcleaning22_ui_sentry_pregame": "Se aumentó la cantidad de Guardianes centinelas que se poseen y que se muestran durante el tiempo de estrategia de 2 a 3. Hay un máximo de 3 centinelas que se pueden comprar al comienzo de la partida.",
  "springcleaning22_ui_guide_pregame": "Después de seleccionar un héroe, ahora la selección de objetos recomendados mostrará la primera sección de una guía si la guía no tiene secciones llamadas: \"Objetos iniciales\".",
  "springcleaning22_ui_ward_planter": "La selección de guardianes ahora se muestra a los jugadores aliados, los espectadores y los entrenadores aliados que los colocaron.",
  "springcleaning22_ui_courier_home_button": "Ahora el botón \"Tienda local\" del mensajero también devuelve cualquier objeto que tenga cuando regrese a la base.",
  "springcleaning22_ui_combat_log_key": "Ahora la actividad de combate se puede vincular a una tecla en las opciones.",
  "springcleaning22_ui_combat_log_right_align": "Ahora la actividad de combate se alinea a la derecha y no se superpone con los controles del modo de prueba de héroes.",
  "springcleaning22_ui_combat_log_hud_flip": "Ahora la actividad de combate acompaña el cambio de interfaz (minimapa a la derecha) y se moverá a la izquierda cuando esta opción esté activada.",
  "springcleaning22_ui_guide_apos": "Se corrigieron los comentarios sobre objetos y habilidades de la guía sustituyendo los apóstrofos con \"&apos;\" así como otros símbolos de HTML al guardarla. Las guías que ya se hayan guardado con este problema todavía tendrán que actualizarse manualmente.",
  "springcleaning22_ui_vs_screen_widescreen": "Se corrigió la presentación de los héroes en la pantalla de enfrentamiento para monitores 21:9 o más anchos.",
  "springcleaning22_ui_charms": "Se corrigió un fallo por el que la interfaz de usuario de Amuletos mostraba texto que se solapaba cuando tenías 2 o más Amuletos.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Se corrigió un fallo en el Entrenamiento de último golpe por el que hacer clic en Iniciar antes de que reapareciera tu héroe impedía que reaparicieran tus creeps.",
  "springcleaning22_ui_intro_scenes": "Las escenas introductorias (como los debuts de personajes y arcanos de héroes) ya no se mostrarán a los jugadores que no hayan pasado por el flujo de la experiencia para jugadores nuevos.",
  "springcleaning22_cosmetics_illusion_skins": "Se corrigió un fallo por el que las ilusiones no podían heredar de forma correcta las apariencias de determinados modelos cosméticos.",
  "springcleaning22_cosmetics_cloth_stretch": "Se corrigió un fallo por el que la ropa de determinados modelos podía extenderse de forma incorrecta a través de la pantalla.",
  "springcleaning22_cosmetics_underlord_immortal": "El immortal de Underlod \"Esmeralda de Subyugación\" ahora tiene efectos de habilidad personalizada que sustituyen a los de la habilidad definitiva.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Los efectos de proyectiles de Veneno Sombrío con el Inmortal \"Manto de Apariencia Sombría\" de Shadow Demon ahora se orientan correctamente.",
  "springcleaning22_cosmetics_wraith_king_immortal": "El inmortal de Wraith King \"Sombra Abrasadora\" tiene una prioridad más alta que el arcano cuando se lanza Explosión de Fuego Espectral.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Se corrigieron los efectos ambientales del Inmortal \"Brazaletes de la Caverna Luminaria\" de Earthshaker.",
  "springcleaning22_cosmetics_warlock_immortal": "Se corrigieron los efectos positivos y negativos del Inmortal \"Glifo Sombrío\" de Warlock, que funcionaban con Palabra de las Sombras.",
  "springcleaning22_cosmetics_viper_immortal": "Se corrigieron los fallos en las partículas en el área de efecto para Infratoxina con el inmortal de Viper \"Ataque del Draco Maléfico\".",
  "springcleaning22_cosmetics_abaddon_vessel": "Se restauraron los efectos de Escudo Afótico para \"Hoja del Receptáculo Demoníaco\" de Abaddon.",
  "springcleaning22_cosmetics_tidehunder_belt": "Se corrigieron las partículas incorrectas del objeto \"Horror From the Deep Belt\" para eliminarlas del área del cinturón, ya que deberían estar en el brazo.",
  "springcleaning22_cosmetics_faceless_incursion": "Se corrigieron los efectos ambientales del arma Incursión de Claszureme de Faceless Void.",
  "springcleaning22_cosmetics_drow_arcana_aura": "El set arcano de Drow Ranger \"Puntería\" ahora tiene efectos visuales personalizados para ambos estilos.",
  "springcleaning22_cosmetics_rubick_dilemma": "La \"Antorcha del Dilema de Fantoccini\" de Rubick recuperó sus efectos ambientales.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "La animación del set arcano de los Techies \"Correr herido\" ahora se reproduce a la velocidad correcta.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Las gemas coloridas ahora son compatibles con Bomba Pegajosa y Tazer Reactiva con el set arcano de los Techies.",
  "springcleaning22_cosmetics_techies_icons": "Se añadieron los íconos adecuados a los objetos de los Techies \"Nido de Pólvora\", \"Astucia del Zapador\", \"Bombazos y Cañonazos\" y \"Marcha de la Patrulla Polvorín\".",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Se corrigió la animación de \"Spoon\" en la vista preliminar de la teletransportación con el Paquidermo Polvorín de los Techies.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "El arcano de Rubick ahora tiene efectos personalizados para Bomba Pegajosa de los Techies en lugar de las Minas Remotas.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Se corrigió la animación de desactivación de Snapfire, para que ella no se quedara atascada en una secuencia incorrecta de animación.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "El lote \"Conquistador Radiante\" de Legion Commander y los objetos ahora se pueden comercializar e intercambiar.",
  "springcleaning22_cosmetics_legion_commander_wind": "Se añadieron efectos de viento a los estandartes de \"Legado de la Legión Caída\" y \"Radiant Conqueror\" para Legion Commander, con o sin las armas arcanas equipadas.",
  "springcleaning22_perf_panorama_atlas": "Se actualizó la interfaz de usuario del motor Panorama para que use atlas de texturas para interactuar más eficientemente con la GPU. De acuerdo con nuestras medidas, esto resultó en una mejora de rendimiento del 25 al 30 % en el trabajo de la GPU necesario para el HUD, y mucho más en algunas páginas del menú principal particularmente complicadas. Este cambio también aumenta el rendimiento de la CPU para Vulkan, y también debería ser particularmente efectivo para computadoras Apple con procesadores M1.",
  "springcleaning22_perf_sand_king_particles": "Se optimizaron los efectos de partículas de \"Tormenta de Arena\" para mejorar el rendimiento.",
  "springcleaning22_perf_panorama_clears": "Se actualizó la interfaz de usuario del motor Panorama para evitar la eliminación de algunos destinos de representación, reduciendo la carga en la GPU.",
  "springcleaning22_perf_scenesystem_threading": "Se corrigió un fallo que hacía que el juego usara menos subprocesos de lo pretendido en tareas que requerían varios procesos. Esta corrección es especialmente útil para los equipos con 4 núcleos o menos.",
  "springcleaning22_perf_thread_affinity": "Se corrigió un fallo en el que las definiciones de la afinidad del subproceso podían causar retrasos en algunas computadoras.",
  "springcleaning22_perf_power_savings": "Se añadió una advertencia al diálogo de las configuraciones de video para indicar si el equipo está funcionando en modo de ahorro de energía, lo que podría ocasionar un bajo rendimiento.",
  "springcleaning22_perf_shop_tooltips": "Se mejoró el rendimiento de las descripciones al explorar la tienda de objetos.",
  "springcleaning22_custom_games_overview_sort": "La pestaña de resumen del modo arcade ahora permite ordenar por la cantidad de jugadores activos, además de por la cantidad de salas de espera abiertas.",
  "springcleaning22_custom_games_update": "Se corrigió un problema con los modos personalizados de arcade que algunas veces no mostraban que era necesario una actualización hasta que se reinstalaban o se reiniciaba Steam.",
  "springcleaning22_custom_games_lobby_version": "La lista de sala de espera ya no mostrará las salas que no coincidan con la versión de la partida personalizada que está instalada o las salas a las que no se puede entrar.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold ahora puede filtrar el oro recibido de Runas de recompensa.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Se reemplazó la reliquia de Dazzle \"Mal Yuyus cuádruples\" con \"Daño y curación de Mal agüero\".",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Se reemplazó la reliquia de los Techies: \"Víctimas por Minas Remotas\" con \"Bombas Pegajosas unidas a héroes\".",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Se reemplazó la reliquia de los Techies: \"Aturdimientos por Trampa Estática\" con \"Desarme múltiple con Tazer Reactiva\".",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Se reemplazó la reliquia de Tinker: \"Daño por Rebelión de las Máquinas\" con \"Daño absorbido para Matriz de Defensa\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Se reemplazó la reliquia de Underlord: \"Víctimas después de Grieta Oscura\" con \"Víctimas aliadas al usar Portal Demoníaco\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Se reemplazó la reliquia de Underlord: \"Héroes salvados por Grieta Oscura\" con \"Bonificación de ataque adicional por Aura Atrofiante\".",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Se corrigió la reliquia de Omniknight: \"Daño aliado durante Gracia Celestial\".",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Se corrigió la reliquia de Primal Beast: \"Víctimas múltiples por Asalto\".",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Se reemplazó el desafío de héroe de Meepo: \"Daño Mágico infligido a héroes\" con \"Daño Puro infligido a héroes\".",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Se reemplazó el desafío de héroe de Naga Siren: \"Curación a héroes durante Canto de la Sirena\" con \"Inflige daño a héroes con Quemadura de Maná\".",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Se reemplazó el desafío de héroe de Tinker: \"Daño por Rebelión de las Máquinas\" con \"Daño absorbido para Matriz de Defensa\".",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Se reemplazó el desafío de héroes de los Techies: \"Víctimas por Minas Remotas\" con \"Bombas Pegajosas unidas a héroes\".",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Se reemplazó el desafío de héroe de Underlord: \"Teletransportación múltiple por Grieta Oscura\" con \"Víctimas aliadas al usar Portal Demoníaco\".",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Se actualizó el desafío de héroe de Grimstroke: \"Daño infligido a enemigos afectados por Vínculo de Almas\" ahora incluye daño de aliados.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Se actualizó el desafío de héroe de Mirana: \"Daño infligido durante Brinco\" ahora incluye todos los tipos de daño en lugar solo daño físico.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Se corrigió el desafío de héroe de Bane: \"Combos Traslación/Bastón de la Fuerza y Garra del Diablo\".",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Se corrigió el desafío de héroe de Dragon Knight: \"Mata a héroes enemigos durante Forma de Dragón\".",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Se corrigió el desafío de héroe de Drow Ranger: \"Silencia 2+ enemigos con Ráfaga\".",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Se corrigió el desafío de héroe de Crystal Maiden: \"Mata creeps con Congelación\".",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Se corrigió el desafío de héroe de Dark Seer: \"Inflige daño durante Subidón\".",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Se corrigió el desafío de héroe de Lifestealer: \"Inflige daño durante Furia\".",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Se corrigió el desafío de héroe de Lone Druid: \"Inflige daño durante Forma Verdadera\".",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Se corrigió el desafío de héroe de Mars: \"Inflige daño a héroes enemigos\".",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Se corrigió el desafío de héroe de Mars: \"Mata unidades enemigas con Hendidura\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Se corrigió el desafío de héroe de Omniknight: \"Inflige daño durante Gracia Celestial\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Se corrigió el desafío de héroe de Omniknight: \"Duración de Gracia Celestial en los aliados\".",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Se corrigió el desafío de héroe de Rubick: \"Aturdimiento múltiple por Telequinesis\".",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Se corrigió el desafío de héroe de Tinker: \"Inflige daño a héroes con la mejora de Láser por el Cetro de Aghanim\".",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Se corrigió el desafío de héroe de Tusk: \"Combo de golpes y patadas\".",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Se eliminó el desafío de héroe de Venomancer: \"Inflige daño a héroes cuyas habilidades pasivas hayan sido desactivadas por Hoja Plateada\".",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Se eliminó el desafío de héroe de Tinker: \"Mata creeps con Rebelión de las Máquinas\".",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Se añadió un desafío de héroe para Underlord: \"Inflige daño a héroes con Tormenta de Fuego\".",
  "springcleaning22_workshop_modeldoc": "Las herramientas del Workshop de Dota para objetos y modos de juego personalizados se actualizaron para usar el nuevo editor \"ModelDoc\". Quienes colaboren con el Workshop deben migrar cualquier modelo de la herramienta anterior, que se eliminará en una actualización futura."
}