// 6463.js

{
  "language": "dutch",
  "springcleaning22_desc": "De Voorjaarsschoonmaak-update van 2022 zit boordevol oplossingen voor bugs en een aantal verbeteringen waar je gegarandeerd blij van wordt. Bekijk de belangrijkste wijzigingen, zoals verbeteringen voor Aghanim's tooltips, opties voor negeren, zoeken in de winkel en de modus Held testen, en duik er daarna verder in met het volledige overzicht van oplossingen en spelwijzigingen hieronder.",
  "springcleaning22_aghs_tooltips": "Tooltips voor Aghanim's Scepter en Shard",
  "springcleaning22_aghs_tooltips_desc": "De diepste geheimen van Aghanim's brein (en monologen) gaan ongetwijfeld het verstand van gewone stervelingen te boven, maar met de update van vandaag is de impact van zijn geweldige Scepters en Shards op het slagveld nu duidelijker dan ooit. Tooltips voor Aghanim's-verbeteringen bieden nu meer details over hoe de cijfers precies veranderen bij uitrusten en aangepaste vaardigheden geven deze informatie ook weer in een apart gedeelte. Veel verbeteringen hebben daarnaast wat extra aandacht gekregen, waardoor ze nu eenvoudiger en makkelijker te begrijpen zijn voor ons als niet-magiërs.",
  "springcleaning22_muting_ui": "Opties voor negeren",
  "springcleaning22_muting_ui_desc": "Dota-spelers zijn nogal een luidruchtige bende en soms krijgen de verkeerde emoties in het heetst van de strijd de overhand. Als dat gedrag storend wordt, is het belangrijk om op een snelle, eenvoudige manier andere spelers te kunnen negeren en hun gedrag te rapporteren zonder dat het je spel verder verstoort. Daarom kun je nu met een enkele klik een speler negeren zodat je diegene niet meer hoort, berichten niet meer ziet en hun gedrag wordt gerapporteerd. Je kunt ook rechtsklikken als je alleen tekst of geluid wilt negeren, bijvoorbeeld als iemand niet echt storend is maar je toch niet met hen wilt communiceren. Ook op hoger niveau kun je eenvoudig je instellingen beheren. Met de nieuwe knop Team negeren blokkeer je met een enkele klik alle communicatie van een heel team.\\n\\nWe grijpen deze kans ook aan om te evalueren hoe we communicatierapporten afhandelen. We willen het makkelijk maken om storende spelers snel en eenvoudig te negeren, maar ook inzicht krijgen in welke spelers verder aangepakt moeten worden.",
  "springcleaning22_gameplay_arc_warden_basher": "Tooltip toegevoegd met uitleg dat klonen en Tempest Doubles geen gebruik kunnen maken van Basher of Abyssal.",
  "springcleaning22_gameplay_arc_warden_blink": "Blink Dagger voor Tempest Double van Arc Warden hoeft niet meer eerst af te koelen na oproepen.",
  "springcleaning22_gameplay_arc_warden_wards": "Tempest Double van Arc Warden kan geen gedeelde wards meer ontvangen."
}