// 9736.js

{
  "language": "vietnamese",
  "springcleaning22_desc": "Cập nhật dọn dẹp Xuân 2022 xin ra mắt để vá lỗi và giới thiệu nhiều cải thiện đẹp lòng mát dạ. Xem dưới đây để tìm hiểu thêm về các thay đổi lớn hơn — như cải thiện về mẹo công cụ Aghanim, điều khiển tắt tiếng, tìm kiếm cửa hàng, chế độ thử tướng — rồi đào sâu về những sửa lỗi và thay đổi lối chơi liệt kê bên dưới.",
  "springcleaning22_aghs_tooltips": "Mẹo công cụ Aghanim's Scepter và Shard",
  "springcleaning22_aghs_tooltips_desc": "Cách tâm trí của Aghanim hoạt động (và độc thoại) vốn ngoài tầm hiểu biết của phàm phu, song với cập nhật hôm nay, tầm ảnh hưởng kỳ vĩ của Scepter và Shard lên chiến trường trở nên rõ ràng hơn bao giờ hết. Chú thích các nâng cấp Aghanim giờ sẽ chi tiết hơn và ghi rõ thay đổi thông số khi trang bị, các kỹ năng được biến hóa cũng sẽ kèm thông tin tại mục riêng. Nhiều nâng cấp được chăm chút riêng để trở nên tinh giản, dễ hiểu hơn cho các bộ não chưa đạt đến bậc đại pháp sư.",
  "springcleaning22_muting_ui": "Cải thiện về tắt tiếng",
  "springcleaning22_muting_ui_desc": "Game thủ Dota vô cùng huyên náo, đôi lúc tranh đua căng thẳng, cảm xúc tuôn trào, thì lời ra tiếng vào không thể tránh khỏi. Khi hành vi  phiền hà đến mức rõ rệt, thì tất yếu là phải có cách vừa dễ lẫn nhanh chóng tắt tiếng và tố cáo trong khi vẫn không gián đoạn trận đấu. Vì thế, chỉ cần một cú nhấp chuột để tắt tiếng / trò chuyện, và tố cáo người chơi. Bạn có thể nhấp chuột phải để tắt trò chuyện hoặc tiếng của họ trong trường hợp hành vi tuy không gây phiền hà, nhưng không muốn giao tiếp gì thêm. Với bảng điều khiển cấp cao đơn giản hơn, bạn cũng có thể tắt tiếng toàn đội chỉ với một cú nhấp chuột.\\n\\nChúng tôi cũng nhân dịp này để nhìn nhận lại quá trình xử lý các tố cáo giao tiếp. Với mục tiêu là đẩy nhanh và đơn giản hóa quá trình tắt tiếng người chơi phiền hà, đồng thời hiểu rõ hơn người chơi nào cần có biện pháp mạnh hơn từ chúng tôi.",
  "springcleaning22_demo_hero": "Cải thiện việc thử tướng",
  "springcleaning22_demo_hero_desc": "Muốn thử chiến thuật mới hay tự tạo đường đi nước bước của riêng mình? Hoặc đơn giản muốn đạt cảm giác bá chủ thiên hạ bằng việc tiễn một loạt Axe lên bảng điểm số với đòn Tidebringer duy nhất? Dù muốn gì thì bạn cũng gặp may rồi! Chế độ thử tướng đã được cập nhật và làm lại với loạt tính năng mới:",
  "springcleaning22_demo_hero_map": "Phía bắc của bản đồ thử tướng đã được mở rộng để thêm khu vực bằng phẳng tiện cho việc thử nghiệm.",
  "springcleaning22_demo_hero_hero_spawn": "Thêm bộ điều khiển để dễ dàng tạo tướng đồng minh cũng như kẻ thù.",
  "springcleaning22_demo_hero_hero_reset": "Thêm bộ điều khiển để đưa tướng về cấp 1.",
  "springcleaning22_demo_hero_hero_remove": "Thêm bộ điều khiển để gỡ bỏ một tướng sau khi bạn đã thử nghiệm xong.",
  "springcleaning22_demo_hero_hero_select": "Tạo một tướng mới sẽ thêm tướng đó vào lựa chọn hiện tại của bạn.",
  "springcleaning22_demo_hero_levelling": "Nút cho việc lên cấp, thêm Scepter, thêm Shard, và bật tắt bất tử giờ sẽ áp dụng lên toàn bộ tướng được chọn.",
  "springcleaning22_demo_creep_toggle": "Khi bật tắt tính năng quái, toàn bộ quái đường hiện tại sẽ bị tiêu diệt.",
  "springcleaning22_demo_creep_spawn": "Thêm một nút để tạo một đợt quái duy nhất từ mỗi bên.",
  "springcleaning22_demo_hero_runes": "Thên nút để tạo 6 loại rune chính.",
  "springcleaning22_shop_search": "Cập nhật chức năng tìm kiếm cửa hàng",
  "springcleaning22_shop_search_desc": "Tiêu vàng thì nên đơn giản và vui, và quan trọng hơn là phải hiệu quả. Để giúp bạn sắm tuồng ít tiếng \"mít mập\" hơn và thêm thật nhiều \"kết liễu\", bộ tìm kiếm trong cửa hàng được mở rộng và cải thiện về từ khóa — gồm một màn hình làm nổi bật các thuộc tính được tìm. Với từ khóa như \"Armor\", \"Strength\", \"Range\" (giáp, sức mạnh, đánh xa, tầm xa) v.v... sẽ làm nổi bật các thông số bạn quan tâm. Thật dễ dàng để chọn vật phẩm hoàn hảo cho mưu sâu kế hiểm. Giờ bạn chỉ cần vàng mà thôi.",
  "springcleaning22_item_tooltips": "Mở rộng các mẹo công cụ của vật phẩm",
  "springcleaning22_item_tooltips_desc": "Không nhớ nổi một điểm Trí Tuệ cho bao nhiêu mana? Hay Nhanh Nhẹn cho bao nhiêu giáp? Khỏi lăn tăn, giữ ALT và nhìn vào chỉ dẫn vật phẩm để biết các thuộc tính này và cấu phần của chúng.",
  "springcleaning22_colored_ability_damage": "Màu sát thương của kỹ năng",
  "springcleaning22_colored_ability_damage_desc": "Muốn ra quyết định đúng trong chiến trận thì phải biết địch biết ta. Để giúp bạn phân tích nguy hiểm tiềm tàng, sát thương gây ra bởi phép và vật phẩm giờ sẽ có màu để nhận diện sát thương vật lý, phép, hoặc thuần.",
  "springcleaning22_pluralized_strings": "Cải thiện hỗ trợ ngôn ngữ cho các văn bản có số nhiều",
  "springcleaning22_pluralized_strings_desc": "Để giúp bản dịch dễ tiếp cận hơn, chúng tôi đã thêm tính năng để hỗ trợ luật số nhiều của nhiều ngôn ngữ, có khoảng hơn 400 câu được cập nhật.",
  "springcleaning22_permanent_debuffs": "Bùa lợi (buff) vĩnh cửu",
  "springcleaning22_permanent_debuffs_desc": "Muốn lên kế sách mà không hiểu hành động của bản thân thì quả thật là khó đỡ. Để hiểu biết thêm sau mỗi trận, các kỹ năng như Reaper's Scythe của Necrophos và Culling Blade của Axe giờ sẽ có trong giao diện sau trận đấu.",
  "springcleaning22_post_game_sortable": "Sắp xếp thông tin sau trận đấu",
  "springcleaning22_post_game_sortable_desc": "Muốn tìm hiểu kỹ hơn tại sao mình thắng? Bạn giờ có thể sắp xếp thông tin bảng điểm sau trận đấu để phân tích dễ dàng hơn.",
  "springcleaning22_gameplay_tp_boots": "Boots of Travel sẽ giảm ưu tiên vào quái nếu chọn trong phạm vi gần trụ.",
  "springcleaning22_gameplay_sellback": "Người chơi giờ có thể hoàn tiền vật phẩm nguyên giá trong 30 giây sau khi trận đấu bắt đầu, thay vì 10 giây như bình thường.",
  "springcleaning22_gameplay_lifestealer_consume": "Lifestealer: Consume giờ dùng chung phím tắt, bất chấp loại đơn vị đang được Infest.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Ogre Bruiser: Thêm hiệu ứng âm thanh cho chuẩn bị tung chiêu và gây choáng.",
  "springcleaning22_gameplay_neutral_aura_radius": "Khi di chuột vào, hào quang của quái rừng giờ sẽ hiện bán kính ảnh hưởng.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Wraith Band / Null Talisman / Bracer: Cập nhật chỉ số bổ sung của chúng trong mẹo chú thích khi được nhân đôi vào phút 25.",
  "springcleaning22_gameplay_heal_overhead": "Sửa một số trường hợp trong đó số báo hiệu máu hồi không tính đến hiệu ứng cường hóa hồi phục.",
  "springcleaning22_gameplay_fountain_invuln": "Người chơi với bùa bất tử khi ở hồ máu sẽ không tự động tấn công kẻ địch trong phạm vi, tránh các trường hợp dễ mất bùa.",
  "springcleaning22_gameplay_blink_range": "Báo hiệu tầm thi triển cho Blink và các biến thể của chúng giờ sẽ tính luôn cả các bùa lợi tăng tầm thi triển.",
  "springcleaning22_gameplay_desolator_tooltip": "Desolator: Làm rõ chỉ dẫn nội tại Soul Stealer. Desolator thêm sát thương khi một kẻ địch chết với bùa hại Corruption.",
  "springcleaning22_gameplay_ardm_stash": "Chế độ All Random Deathmatch: Sửa lỗi khi thú vận chuyển đưa vật phẩm về kho đồ trong khi chết sẽ dẫn đến vật phẩm biến mất.",
  "springcleaning22_gameplay_neutral_items_lock": "Vật phẩm rừng: Không còn có thể khóa kết hợp các vật phẩm. Sửa lỗi thú vận chuyển không giao vật phẩm rừng bị khóa kết hợp.",
  "springcleaning22_gameplay_illusion_modifiers": "Sửa một lỗi trong đó phân thân với các hiệu ứng được sao y sẽ có thời lượng không chính xác, làm lộ diện tướng thật.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Chế độ Turbo và Tân Thủ: Sửa lỗi một số nguồn cấp vàng không được điều chỉnh chính xác.",
  "springcleaning22_gameplay_turbo_courier": "Chế độ Turbo: Sửa lỗi thú vận chuyển của người chơi không hoạt động nếu mất kết nối lúc chọn tướng hay trong giai đoạn bàn bạc chiến thuật.",
  "springcleaning22_gameplay_zero_tooltips": "Sửa một lỗi trong đó mẹo công cụ trong trận đấu được điều chính bởi tiềm năng sẽ hiện số 0 thay vì giá trị chính xác.",
  "springcleaning22_gameplay_euls_invulnerable": "Eul's Scepter: Dùng lên trên phân thân miễn nhiễm phép sẽ áp dụng đúng hiệu ứng của nó lên bản sao thay vì chỉ đơn giản tính thời gian hồi chiêu.",
  "springcleaning22_gameplay_kobold_aura": "Kobold: Hào quang Prospecting không còn áp dụng cho quái của tướng (ví dụ gấu Lone Druid), sửa lỗi nhân đôi hiệu ứng.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Bản sao và Tempest Double: Giờ có thể nhận đúng thông số bổ sung từ phước lành Aghanim's Scepter từ Alchemist.",
  "springcleaning22_gameplay_chen_hand_of_god": "Chen: Hand of God giờ cho đệ sẽ áp dụng đúng mức hồi theo thời gian, chứ không chỉ mức hồi ban đầu.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Arc Warden: Mức sát thương bị phạt của Tempest Double khi ở xa giờ tính đến cả Arc Warden hồi sinh.",
  "springcleaning22_gameplay_arc_warden_basher": "Thêm mẹo công cụ để làm rõ việc bản sao và Tempest Double không thể đánh choáng với Basher hoặc Abyssal.",
  "springcleaning22_gameplay_arc_warden_blink": "Arc Warden: Blink Dagger trên Tempest Double không phải chờ hồi chiêu khi được triệu hồi.",
  "springcleaning22_gameplay_arc_warden_wards": "Tempest Double không còn nhận được mắt chia sẻ.",
  "springcleaning22_gameplay_pa_scepter_double": "Phantom Assassin: Nâng cấp Aghanim's Scepter sẽ không hồi chiêu Blur khi giết một Tempest Double.",
  "springcleaning22_gameplay_naga_siren_riptide": "Naga Siren: Tiềm năng -1 đòn để Riptide giờ đúng là bớt 1 đòn, thay vì 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Legion Commander: Sát thương bổ sung từ Duel giờ hiệu lực kể cả khi người thắng ở trạng thái bất tử.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Tusk: Walrus Kick áp dung đúng thời gian hồi chiêu 12 giây.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Terrorblade: Metamorphosis sửa lại đúng giá trị thời gian hồi chiêu 35/40/45/50.",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey King: Tree Dance giờ không thể thoát khỏi Arena of Blood",
  "springcleaning22_gameplay_naga_siren_ability_draft": "Naga Siren: Trong chế độ chọn kỹ năng, hiệu ứng Riptide giờ sẽ hiện trên đúng tướng thay vì luôn hiện trên Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki: Giờ có thể dùng Smoke Screen khi đang vận pháp Tricks of the Trade mà không phá vận pháp dù có bật chức năng \"Vận pháp cần tạm ngừng/dừng hẳn\".",
  "springcleaning22_gameplay_marci_dispose_lotus": "Marci: Sửa tương tác Dispose với BKB và Lotus Orb.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Sniper: Thêm biểu tượng cấm đánh lên trên đầu với Concussive Grenade.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling: Không còn giữ vĩnh viễn nội tại Spirit Link khi hóa thành Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Underlord: Thêm biểu tượng vận pháp bị thiếu cho Fiend's Gate.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Ancient Ice Shaman: Thêm mẹo chú thích bị thiếu cho bùa hại Icefire Bomb.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Dark Willow: Hiệu ứng hạt Cursed Crown với Aghanim's Shard giờ sẽ hiện đúng thời điểm.",
  "springcleaning22_gameplay_lone_druid_midas": "Lone Druid: Dùng Hand of Midas trên gấu sẽ trao kinh nghiệm cho tướng điều khiển.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear và Tempest Double giờ có thể nhận lượt dùng cho Magic Stick, Magic Wand, và Holy Locket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Void Spirit: Mẹo chú thích Astral Step giờ hiện đúng giá trị cường hóa phép khi nhấn ALT.",
  "springcleaning22_gameplay_heavenly_jump_range": "Zeus: Heavenly Jump giờ hiện cự ly khi di chuột lên.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Crystal Maiden: Sửa mẹo chú thích Arcane Aura.",
  "springcleaning22_gameplay_hex_tooltip": "Shadow Shaman: Sửa lỗi chú thích Hex ghi sai rằng thêm 1 giây vào thời lượng khi chọn tiềm năng \"Hex phá nội tại\".",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Abaddon: Sửa tiềm năng cấp 20 không cập nhật thời gian hồi Borrowed Time trong chú thích.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Shadow Fiend: Sửa Presence of the Dark Lord để áp dụng đúng lên trên quái rừng.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Tinker: Sửa lỗi Warp Flare có thể tác động lên Roshan.",
  "springcleaning22_gameplay_ability_draft_wukong": "Monkey King: Trong chế độ chọn kỹ năng, sửa lỗi các bản sao Wukong's Command không có đúng kỹ năng.",
  "springcleaning22_rubick_illusions": "Sửa lỗi ngăn phân thân dùng đúng chuyển động dựa theo phép cướp được (ví dụ Fiend's Grip của Bane với Ahanim's Scepter).",
  "springcleaning22_rubick_hunter_in_the_night": "Giờ có thể cướp được Hunter in the Night khi nâng cấp Aghanim's Scepter.",
  "springcleaning22_rubick_juxtapose": "Giờ có thể cướp được Juxtapose khi nâng cấp Aghanim's Scepter.",
  "springcleaning22_rubick_fireball": "Giờ có thể cướp được Fireball của Dragon Knight độc lập so với Dragon Form, và không được tự động trao kỹ năng.",
  "springcleaning22_rubick_wolf_bite": "Wolf Bite giờ sẽ hoạt động khi cướp được.",
  "springcleaning22_rubick_depth_shroud": "Depth Shroud giờ sẽ hoạt động khi cướp được.",
  "springcleaning22_rubick_astral_spirit": "Gỡ bỏ kỹ năng di chuyển độc lập của Astral Spirit khi cướp được. Rubick giờ có thể giữ cả hai ô phép khi cướp kỹ năng này.",
  "springcleaning22_rubick_reverse_time_walk": "Reverse Time Walk giờ đổi chung ô kỹ năng với Time Walk nếu Rubick có Aghanim's Shard. Rubick giờ có thể giữ cả hai ô phép khi cướp kỹ năng này.",
  "springcleaning22_rubick_jaunt": "Ethereal Jaunt giờ đổi tới chung ô kỹ năng với Illusory Orb. Rubick giờ có thể giữ cả hai ô phép khi cướp kỹ năng này.",
  "springcleaning22_rubick_eject": "Eject giờ đổi tới chung ô kỹ năng với Dismember nếu Rubick có Aghanim's Shard. Rubick giờ có thể giữ cả hai ô phép khi cướp kỹ năng này.",
  "springcleaning22_rubick_dismember": "Dismember giờ đẩy tướng đồng minh ra ngoài nếu có phép nào cướp được thay thế nó.",
  "springcleaning22_rubick_spit_out": "Spit Out giờ đổi tới chung ô kỹ năng với Gobble Up. Rubick giờ có thể giữ cả hai ô phép khi cướp kỹ năng này.",
  "springcleaning22_rubick_decoy": "Cướp Decoy sẽ không kèm theo Bushwhack. Decoy vẫn áp dụng Bushwhack khi dùng.",
  "springcleaning22_rubick_spirits": "Cướp Spirits của Io giờ hoạt động đúng khi có Aghanim's Scepter.",
  "springcleaning22_rubick_gravekeepers_cloak": "Giờ có thể cướp được Gravekeeper's Cloak khi nâng cấp Aghanim's Scepter.",
  "springcleaning22_rubick_shard_cursed_crown": "Nếu Rubick có Aghanim's Shard, Cursed Crown giờ cũng sẽ tạo Bramble.",
  "springcleaning22_rubick_shard_venomous_gale": "Nếu có Aghanim's Shard, Venomous Gale giờ cũng sẽ tạo Plague Ward.",
  "springcleaning22_rubick_shard_sprout": "Nếu có Aghanim's Shard, Sprout giờ cũng sẽ tạo đệ Treant.",
  "springcleaning22_rubick_shard_shackles": "Nếu Rubick có Aghanim's Shard, Shackles giờ cũng sẽ tạo Serpent Ward.",
  "springcleaning22_rubick_shard_cold_embrace": "Nếu Rubick có Aghanim's Shard, Cold Embrace giờ cũng sẽ tạo Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "Nếu Rubick có Aghanim's Shard, Earthshock giờ cũng sẽ áp dụng Enrage.",
  "springcleaning22_rubick_shard_shadow_step": "Nếu Rubick có Aghanim's Scepter, Shadow Step giờ cũng sẽ áp dụng Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "Nếu Rubick có Aghanim's Scepter, Terror Wave giờ cũng sẽ áp dụng Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "Nếu Rubick có Aghanim's Shard, Homing Missile giờ cũng sẽ có Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Nếu Rubick có Aghanim's Shard, Slithereen Crush giờ cũng sẽ áp dụng Corrosive Haze.",
  "springcleaning22_rubick_scepter_flak_cannon": "Nếu Rubick có Aghanim's Scepter, Flak Cannon giờ cũng sẽ có nội tại Side Gunner.",
  "springcleaning22_rubick_scepter_time_walk": "Nếu Rubick có Aghanim's Scepter, Time Walk giờ cũng sẽ áp dụng Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Nếu Rubick có Aghanim's Scepter, Shuriken Toss giờ cũng sẽ áp dụng Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Nếu Rubick có Aghanim's Scepter, Sacred Arrow giờ cũng sẽ áp dụng Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "Định hướng véc-tơ cho dùng phép nhanh khi nhấn xuống giờ được thay đổi để hướng mũi tên bắt đầu hiện khi ấn xuống và kết thúc khi nhấc tay lên. Hành vi tương tự như dùng phép nhanh khi nhấc tay lên.",
  "springcleaning22_ui_ward_bounty": "Sự kiện phá mắt quan sát giờ sẽ hiện ai nhận tiền thưởng, trong trường hợp bên nhận khác với người phá.",
  "springcleaning22_ui_spectator_hud_player_view": "Giao diện khán giả giờ hiện tên người chơi bạn đang xem.",
  "springcleaning22_ui_post_game_scepter_shard": "Chú thích cho Aghanims Scepter và Shard giờ hiện hiệu ứng của chúng trên bảng điểm sau trận đấu.",
  "springcleaning22_ui_post_game_backpack_neutral": "Vật phẩm rừng và đồ trong ba lô giờ sẽ hiện tại mục chi tiết tướng sau trận đấu.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Giá trị hút máu phép cho tướng và quái giờ sẽ hiện riêng biệt khi ấn giữ ALT.",
  "springcleaning22_ui_skeleton_warrior_rally": "Skeleton Warrior: Hào quang Rally giờ sẽ được theo dõi bởi bộ đếm bùa lợi thay vì nhiều biểu tượng bùa lợi đơn lẻ.",
  "springcleaning22_ui_neutral_item_teleport": "Sửa lỗi khi đổi vật phẩm rừng và dịch chuyển về kho đồ quá nhanh sẽ khiến dịch chuyển sai món.",
  "springcleaning22_ui_spectator_arcana": "Giao diện Arcana không còn hiện các trận đấu giải dưới góc nhìn khán giả.",
  "springcleaning22_ui_ready_check_enter": "Giờ có thể nhấn ENTER để xác nhận kiểm tra sẵn sàng.",
  "springcleaning22_ui_alt_item_combine": "Các vật phẩm trong menu mua nhanh giờ sẽ hiện vật phẩm do chúng kết hợp thành khi giữ ALT.",
  "springcleaning22_ui_alt_items_ready": "Giữ Ctrl + Alt và nhấp lên các vật phẩm sau sẽ báo đội của mình biết chúng đã sẵn sàng, thay vì báo hiệu tập trung lại: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pipe of Insight, và Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Mắt soi tàng hình: Tăng số lượng mắt có thể sở hữu trong thời gian bàn bạc chiến thuật từ 2 lên 3. Có thể mua tối đa 3 mắt tàng hình khi bắt đầu trận đấu.",
  "springcleaning22_ui_guide_pregame": "Sau khi chọn tướng, mục vật phẩm khuyến nghị giờ sẽ hiện phần đầu của một hướng dẫn nếu hướng dẫn không có mục trang bị khởi đầu.",
  "springcleaning22_ui_ward_planter": "Khi chọn đơn vị mắt, người chơi đồng minh, khán giả, và huấn luyện viên đồng minh sẽ thấy được ai đã cắm nó.",
  "springcleaning22_ui_courier_home_button": "Thú vận chuyển: Nút về nhà giờ sẽ hoàn lại bất kỳ vật phẩm nào trong kho đồ khi nó về đến căn cứ.",
  "springcleaning22_ui_combat_log_key": "Chiến ký: Giờ có thể được gán thành một nút trong tùy chọn.",
  "springcleaning22_ui_combat_log_right_align": "Chiến ký: Giờ sẽ nằm bên tay phải và không còn trùng lắp với bảng điều khiển của thử tướng.",
  "springcleaning22_ui_combat_log_hud_flip": "Chiến ký: Sẽ tuân theo việc đảo chiều giao diện (bản đồ nhỏ bên tay phải) và sẽ di chuyển sang bên trái nếu có bật tùy chọn này.",
  "springcleaning22_ui_guide_apos": "Sửa bình luận về hướng dẫn vật phẩm/kỹ năng khi thay dấu nháy đơn với \"&apos;\" và các biểu tượng HTML khác khi lưu. Hướng dẫn đã được lưu với các vấn đề này vẫn sẽ cần phải được cập nhật thủ công lại.",
  "springcleaning22_ui_vs_screen_widescreen": "Điều chỉnh hiển thị tướng trên màn hình giáp đấu cho màn hình từ tỉ lệ 21:9 hoặc rộng hơn.",
  "springcleaning22_ui_charms": "Sửa lỗi bùa dự đoán chiến thắng sẽ hiện văn bản đè lên nhau khi bạn có 2 bùa trở lên.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Chế độ luyện đòn kết liễu: Sửa lỗi khi nhấp bắt đầu trước lúc tướng xuất hiện sẽ khiến quái không được tạo.",
  "springcleaning22_ui_intro_scenes": "Cảnh giới thiệu (ra mắt tướng/Arcana/nhân cách) sẽ không còn hiện cho người chơi chưa trải qua giai đoạn trải nghiệm tân thủ.",
  "springcleaning22_cosmetics_illusion_skins": "Sửa lỗi phân thân không thừa hưởng đúng mô hình của một số vật phẩm trang trí.",
  "springcleaning22_cosmetics_cloth_stretch": "Sửa lỗi trong đó vải trên một số mô hình có thể bị dãn sai cách tràn màn hình.",
  "springcleaning22_cosmetics_underlord_immortal": "Underlord: Vật phẩm bất diệt \"Emerald Subjugation\" giờ có hiệu ứng kỹ năng tùy biến thay thế cho tuyệt kỹ",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Shadow Demon: Vật phẩm bất diệt \"Mantle of Grim Facade\" với hiệu ứng đường đạn cho Shadow Poison giờ sẽ được đặt đúng hướng",
  "springcleaning22_cosmetics_wraith_king_immortal": "Wraith King: Vật phẩm bất diệt \"Blistering Shade\" giờ có ưu tiên cao hơn Arcana khi dùng \"Wraithfire Blast\"",
  "springcleaning22_cosmetics_earthshaker_immortal": "Earthshaker: Sửa hiệu ứng môi trường của vật phẩm bất diệt \"Bracers of the Cavern Luminar\".",
  "springcleaning22_cosmetics_warlock_immortal": "Warlock: Sửa lỗi hiệu ứng kỹ năng với Vật phẩm bất diệt \"Umbral Glyph\" trên Shadow Word (bùa lợi và bùa hại)",
  "springcleaning22_cosmetics_viper_immortal": "Vật phẩm bất diệt \"Malefic Drake's Strike\" của Viper sửa hiệu ứng hạt khu vực Nethertoxin",
  "springcleaning22_cosmetics_abaddon_vessel": "Abaddon: Sửa và khôi phục hiệu ứng Aphotic Shield cho vật phẩm \"Blade of the Demonic Vessel\".",
  "springcleaning22_cosmetics_tidehunder_belt": "Tidehunter: Gỡ bỏ các hiệu ứng hạt sai từ vị trí thắt lưng mà đáng lẽ phải ở trên tay cho vật phẩm \"Horror From the Deep Belt\" ",
  "springcleaning22_cosmetics_faceless_incursion": "Faceless Void: Sửa hiệu ứng môi trường của vũ khí \"Claszureme Incursion\"",
  "springcleaning22_cosmetics_drow_arcana_aura": "Drow Ranger: Hào quang trên Arcana \"Marksmanship\" giờ có hiệu ứng tùy biến cho cả hai kiểu dáng",
  "springcleaning22_cosmetics_rubick_dilemma": "Sủa và khôi phục hiệu ứng môi trường của vật phẩm \"Torch of Fantoccini's Dilemma\"",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Techies: Cử động chạy khi bị thương với Arcana giờ được phát đi đúng tốc độ.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Techies: Thêm hỗ trợ cho màu ngọc trên Sticky Bomb và Reactive Tazer cho Arcana.",
  "springcleaning22_cosmetics_techies_icons": "Techies: Thêm các biểu tượng kinh tế bị thiếu cho các bộ vật phẩm sau: \"Powdersled Rookery\", \"Sapper's Guile\", \"Bombtrails and Boomsticks\", và \"March of the Powderkeg Patrol\".",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Techies: Sửa lỗi cử động cho Spoon trong cửa sổ xem trước lúc dùng hiệu ứng thành phù với bộ vật phẩm Powderwagon.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Arcana cho Rubick giờ có hiệu ứng tùy biến cho Sticky Bomb của Techies thay vì Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Snapfire: Sửa hiệu ứng bị khống chế để bà không còn bị kẹt trong chuỗi cử động không đúng.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Legion Commander: Bộ vật phẩm và từng món lẻ trong \"Radiant Conqueror\" giờ có thể đăng bán lên chợ và trao đổi được.",
  "springcleaning22_cosmetics_legion_commander_wind": "Legion Commander: Thêm hiệu ứng gió cho cờ hiệu của vật phẩm \"Legacy of the Fallen Legion\" và \"Radiant Conqueror\", dù có trang bị vũ khí Arcana hay không.",
  "springcleaning22_perf_panorama_atlas": "Cập nhật engine giao diện Panorama để dùng texture atlas hiệu quả hơn khi tương tác với GPU. Theo đo lường của chúng tôi, điều này cải thiện 25-30% hiệu suất tài nguyên GPU cần cho giao diện, và thậm chí nhiều hơn với các phần phức tạp của trang tổng quan. Thay đổi này cũng tăng hiệu suất CPU cho Vulkan, và cũng rất hiệu quả đối với máy Apple có vi xử lý M1.",
  "springcleaning22_perf_sand_king_particles": "Sand King: Tối ưu hiệu ứng hạt của \"Sand Storm\" để cải thiện hiệu suất.",
  "springcleaning22_perf_panorama_clears": "Cập nhật engine giao diện Panorama để tránh dựng các mục tiêu đã xong, giúp giảm tải GPU.",
  "springcleaning22_perf_scenesystem_threading": "Sửa một lỗi trong đó chúng tôi đôi lúc dùng ít luồng hơn dự kiến khi xử lý đa luồng. Sửa lỗi này đặc biệt hữu dụng với các máy có từ 4 nhân  trở xuống.",
  "springcleaning22_perf_thread_affinity": "Sửa một lỗi trong đó việc điều chỉnh sai affinity cho luồng có thể khiến một số máy bị đứng.",
  "springcleaning22_perf_power_savings": "Thêm hộp thoại cảnh báo thiết lập đồ họa để báo nếu máy đang chạy ở chế độ tiết kiệm điện năng (có thể làm giảm hiệu suất).",
  "springcleaning22_perf_shop_tooltips": "Cải thiện hiệu suất mẹo chú thích khi duyệt tìm cửa hàng vật phẩm.",
  "springcleaning22_custom_games_overview_sort": "Thẻ tổng quan Arcade giờ cho phép xếp theo số người chơi hiện hành và phòng chờ đang mở.",
  "springcleaning22_custom_games_update": "Sửa lỗi các trận Dota Arcade tùy chọn đôi lúc không hiện yêu cầu cần cập nhật cho đến khi chúng được cài lại, hoặc khởi động lại Steam.",
  "springcleaning22_custom_games_lobby_version": "Danh sách phòng chờ Dota Arcade giờ không hiện các phòng không khớp với phiên bản hiện đang được cài hoặc không thể tham gia.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold giờ có thể lọc vàng nhận được từ rune phần thưởng.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Dazzle: Thay ấn tích, \"Juju bùa hại bốn kẻ địch\" sang \"Sát thương và hồi phục từ Bad Juju\"",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Techies: Thay ấn tích, \"Giết với Remote Mine\" sang \"Sticky Bomb bám vào tướng\".",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Techies: Thay ấn tích, \"Làm choáng với Stasis Trap\" sang \"Reactive Tazer cấm đánh nhiều tướng\".",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Tinker: Thay ấn tích, \"Sát thương với March of the Machines\" sang \"Sát thương Defense Matrix hấp thụ\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Underlord: Thay ấn tích, \"Giết sau khi Dark Rift\" sang \"Đồng đội lấy mạng nhờ Fiend's Gate\".",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Underlord: Thay ấn tích, \"Tướng cứu bằng Dark Rift\" sang \"Sát thương thêm gây ra nhờ Atrophy Aura\".",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Omniknight: Sửa ấn tích \"Sát thương từ đồng minh khi có Heavenly Grace\".",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Primal Beast: Sửa ấn tích \"Onslaught trúng nhiều tướng\".",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Meepo: Thay thử thách tướng, \"Sát thương phép gây lên tướng\" sang \"Sát thương thuần gây lên tướng\".",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Naga Siren: Thay thử thách tướng, \"Tướng hồi phục khi có Song\" sang \"Gây sát thương Mana Burn cho tướng\"",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Tinker: Thay thử thách tướng, \"Sát thương với March of the Machines\" sang \"Sát thương Defense Matrix hấp thụ\"",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Techies: Thay thử thách tướng, \"Giết với Remote Mine\" sang \"Số Sticky Bomb bám\"",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Underlord: Thay thử thách tướng, \"Dark Rift dịch chuyển nhiều tướng\" sang \"Đồng đội lấy mạng nhờ Fiend's Gate\"",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Grimstroke: Cập nhật thử thách tướng, \"Sát thương gây lên kẻ địch bị ảnh hưởng bởi Soulbind\" giờ tính cả sát thương từ đồng minh.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Mirana: Cập nhật thử thách tướng, \"Sát thương gây khi đang Leap\" giờ kèm mọi loại sát thương chứ không chỉ vật lý.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Bane: Sửa thử thách tướng, \"Combo Blink / Force Staff + Fiend's Grip\".",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Dragon Knight: Sửa lỗi với thử thách tướng \"Giết khi dùng Dragon Form\".",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Drow Ranger: Sửa lỗi với thử thách tướng \"Khóa phép 2+ kẻ địch bằng Gust\".",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Crystal Maiden: Sửa lỗi với thử thách tướng \"Giết quái bằng Frostbite\".",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Dark Seer: Sửa lỗi với thử thách tướng \"Gây sát thương khi dùng Surge\".",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Lifestealer: Sửa lỗi với thử thách tướng \"Gây sát thương khi dùng Rage\".",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Lone Druid: Sửa lỗi với thử thách tướng \"Gây sát thương khi dùng True Form\".",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Mars: Sửa lỗi với thử thách tướng \"Gây sát thương lên tướng địch\".",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Mars: Sửa lỗi với thử thách tướng \"Giết đơn vị địch với đánh lan\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Omniknight: Sửa lỗi với thử thách tướng \"Gây sát thương khi dùng Heavenly Grace\".",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Omniknight: Sửa lỗi với thử thách tướng \"Thời gian Heavenly Grace cho đồng minh\".",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Sửa lỗi với thử thách tướng \"Gây choáng nhiều tướng bằng Telekinesis\".",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Tinker: Sửa lỗi với thử thách tướng \"Gây sát thương lên tướng bằng Laser được nâng cấp với Aghanim's Scepter\".",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Tusk: Sửa lỗi với thử thách tướng \"Combo đấm đá\".",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Venomancer: Gỡ bỏ thử thách tướng \"Gây sát thương lên tướng bị Silver Edge phá nội tại\".",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Tinker: Gỡ bỏ thử thách tướng \"Giết quái bằng March of the Machines\".",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Underlord: Thêm thử thách thướng \"Gây sát thương lên tướng bằng Firestorm\".",
  "springcleaning22_workshop_modeldoc": "Bộ công cụ Dota Workshop cho vật phẩm trang bị và trận đấu tùy chỉnh đã được nâng cấp để sử dụng trình chỉnh sửa mẫu \"ModelDoc\" mới. Các nhà đóng góp trên Workshop nên chuyển mọi model khỏi công cụ cũ vì sẽ bị xóa trong một bản cập nhật tương lai."
}