// 6739.js

{
  "language": "german",
  "springcleaning22_desc": "Mit dem Frühjahrsputz-Update 2022 öffnet Dota heute alle Fenster und Türen. Es wurden fleißig Fehler ausgemerzt und die Qualität verbessert. Schauen Sie sich die Highlights, wie die Beschreibungstexte der Aghanim-Boni, die Kontrollen zum Stummschalten, die Shopsuche sowie den Testmodus für Helden an. Lesen Sie dann in der umfassenden Aufschlüsselung unten die vollständige Liste an Fehlerkorrekturen und Gameplay-Anpassungen.",
  "springcleaning22_aghs_tooltips": "Beschreibungstexte für Aghanims Zepter und Splitter",
  "springcleaning22_aghs_tooltips_desc": "Das Innenleben von Aghanims Verstand (und der interne Monolog) liegen zweifellos jenseits des Verständnisses von Sterblichen. Mit dem heutigen Update jedoch wird der Einfluss seiner grandiosen Zepter und Splitter auf die Schlacht wie nie zuvor enthüllt. Die Beschreibungstexte für Aghanim-Boni sind jetzt detaillierter und enthalten die exakte Änderungen in Zahlen. Die geänderten Fähigkeiten zeigen ebenfalls diese Informationen an, in einem speziell dafür vorgesehenen Bereich. Diverse Boni haben außerdem besondere Aufmerksamkeit erfahren und sind jetzt einfacher und verständlicher für den Verstand von Nicht-Magiern.",
  "springcleaning22_muting_ui": "Verbesserungen an der Stummschaltung",
  "springcleaning22_muting_ui_desc": "Dota-Spieler sind ein wilder Haufen und manchmal gewinnen in der Hitze der Schlacht die falschen Emotionen die Oberhand. In Fällen, in denen ein solches Verhalten störend wird, ist es wichtig, diese Spieler schnell und einfach stummzuschalten und zur Überprüfung zu melden, ohne dass dadurch der Spielfluss noch weiter unterbrochen wird. Deshalb genügt jetzt ein einziger Klick, um einen Spieler im Sprachchat sowie im Textchat stummzuschalten und diesen zu melden. Mit einem Rechtsklick können Sprach- und Textchat weiterhin unabhängig stummgeschaltet werden, wenn das Verhalten zwar nicht störend, aber dennoch ungewollt ist. Für noch mehr Kontrolle gibt es nun auch die Möglichkeit, ganze Teams gleichzeitig stummzuschalten.\\n\\nWir ändern bei dieser Gelegenheit auch unseren Umgang mit Meldungen von Kommunikationsverstößen. Unser Ziel ist es, das Stummschalten störender Spieler so einfach wie möglich zu gestalten und gleichzeitig eine Übersicht zu gewinnen, bei welchen Spielern weitergehende Maßnahmen notwendig sind.",
  "springcleaning22_demo_hero": "Verbesserungen am Heldentestmodus",
  "springcleaning22_demo_hero_desc": "Sie möchten die neusten Strategien testen oder eigene entwickeln? Oder haben Sie einfach ein überwältigendes Bedürfnis zu testen, wie viele Inkarnationen von Axe Sie mit einem einzigen Tidebringer-Angriff abschlachten können? Ganz gleich weshalb, Sie haben Glück! Der Heldentestmodus wurde überarbeitet und bietet jetzt eine Reihe neuer Funktionen:",
  "springcleaning22_demo_hero_map": "Die nördliche Hälfte der Testkarte wurde erweitert und bietet jetzt mehr ebene Fläche zum Testen.",
  "springcleaning22_demo_hero_hero_spawn": "Möglichkeit hinzugefügt, um neben gegnerischen auch einfach verbündete Helden zu beschwören.",
  "springcleaning22_demo_hero_hero_reset": "Möglichkeit hinzugefügt, einen Helden auf Level 1 zurückzustufen.",
  "springcleaning22_demo_hero_hero_remove": "Möglichkeit hinzugefügt, einen Held zu entfernen.",
  "springcleaning22_demo_hero_hero_select": "Beim Erschaffen eines neuen Helden wird dieser nun der aktuellen Auswahl hinzugefügt.",
  "springcleaning22_demo_hero_levelling": "Schaltflächen für Leveln, Zepter, Splitter sowie Unverwundbarkeit betreffen nun alle derzeit ausgewählten Helden.",
  "springcleaning22_demo_creep_toggle": "Beim Deaktivieren der Dienerwellen sterben nun alle derzeit aktiven Diener.",
  "springcleaning22_demo_creep_spawn": "Möglichkeit hinzugefügt, eine einzelne Dienerwelle zu erschaffen.",
  "springcleaning22_demo_hero_runes": "Möglichkeit hinzugefügt, die 6 Hauptrunen zu erschaffen.",
  "springcleaning22_shop_search": "Aktualisierte Shopsuche",
  "springcleaning22_shop_search_desc": "Gold ausgeben sollte einfach sein, Spaß machen und vor allem effektiv sein. Damit Ihr Kaufrausch weniger mau und mehr wow wird, wurde die Shopsuche für Gegenstände um eine verbesserte Unterstützung von Schlüsselwörtern erweitert, inklusive einer hervorgehobenen Anzeige gesuchter Attribute. Geben Sie einfach „Rüstung“, „Stärke“, „Reichweite“ usw. ein und die für Sie interessanten Werte werden hervorgehoben. Die Wahl des perfekten Gegenstands für den perfekten Plan war noch nie einfacher. Sie brauchen halt nur das Gold dafür.",
  "springcleaning22_item_tooltips": "Erweiterte Gegenstandsbeschreibungen",
  "springcleaning22_item_tooltips_desc": "Sie vergessen immer wieder, wie viel Mana diese Intelligenz hinzufügt oder um wie viel diese Agilität ihre Rüstung erhöht? Grämen Sie sich nicht länger, denn einfaches Halten der Alt-Taste erweitert jetzt die Beschreibungen von Gegenständen um genau diese Werte und Informationen.",
  "springcleaning22_colored_ability_damage": "Farbiger Fähigeitenschaden",
  "springcleaning22_colored_ability_damage_desc": "Um in der Schlacht gute Entscheidungen zu treffen, müssen Sie erst einmal alle Herausforderungen kennen. Um bei der Verarbeitung potenzieller Gefahren zu helfen, wird nun durch Fähigkeiten oder Gegenstände verursachter Schaden basierend auf der Schadensart (physisch, magisch, rein) farblich kodiert.",
  "springcleaning22_pluralized_strings": "Verbesserte Unterstützung von Pluralformen",
  "springcleaning22_pluralized_strings_desc": "Um der weltweiten Zugänglichkeit des Clients Rechnung zu tragen, haben wir ein System zur Unterstützung von Pluralformen diverser Sprachen entwickelt und mehr als 400 Texte daran angepasst.",
  "springcleaning22_permanent_debuffs": "Permanente Stärkungen",
  "springcleaning22_permanent_debuffs_desc": "Für die Entwicklung von Strategien ist die Sichtbarkeit der Auswirkungen Ihrer Taten erforderlich. Um nach einer Partie weitere Informationen sichtbar zu machen, werden Kills mit Reaper's Scythe von Necrophos und Culling Blade von Axe nun auch in der Zusammenfassung der Partie angezeigt.",
  "springcleaning22_post_game_sortable": "Sortieren der Partiezusammenfassung",
  "springcleaning22_post_game_sortable_desc": "Sie möchten noch tiefer in die Details hinter Ihren Siegen gehen? Die Punktetabelle nach dem Spiel ist jetzt zur einfacheren Analyse sortierbar.",
  "springcleaning22_gameplay_tp_boots": "Boots of Travel visieren jetzt seltener Diener an, wenn sie im Umkreis eines Turms aktiviert werden.",
  "springcleaning22_gameplay_sellback": "Spieler können nun Gegenstände innerhalb von 30 Sekunden, statt 10 Sekunden nach Beginn der Partie zum vollen Preis rückerstatten.",
  "springcleaning22_gameplay_lifestealer_consume": "Consume von Lifestealer hat jetzt immer den gleichen Hotkey, unabhängig von der befallenen Einheitenart.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Der Oger-Schläger hat nun einen Soundeffekt beim Ausholen und Betäubung.",
  "springcleaning22_gameplay_neutral_aura_radius": "Alle Auren neutraler Einheiten zeigen jetzt beim Drüberfahren mit der Maus ihren Radius.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Wraith Band, Null Talisman und Bracer aktualisieren jetzt die Werte in den Beschreibungen, wenn sich die Boni bei Minute 25 verdoppeln.",
  "springcleaning22_gameplay_heal_overhead": "Mehrere Fälle behoben, in denen die über einer Einheit angezeigten Heilungswerte Heilungsverstärkung außer Acht ließen.",
  "springcleaning22_gameplay_fountain_invuln": "Durch Brunnennähe unverwundbare Helden greifen nun nicht mehr automatisch Gegner in Reichweite an, was die Unverwundbarkeit aufheben würde.",
  "springcleaning22_gameplay_blink_range": "Die Anzeige der Zauberreichweite von Blink Dagger und seinen Varianten berücksichtigt jetzt Effekte, welche die Zauberreichweite erhöhen.",
  "springcleaning22_gameplay_desolator_tooltip": "Beschreibung der passiven Fähigkeit des Desolators, Soul Stealer, klarer formuliert. Desolator erhält Angriffsschaden, wann immer ein Gegner unter dem Effekt von Zerfall stirbt.",
  "springcleaning22_gameplay_ardm_stash": "Fehler im ARDM-Modus korrigiert, durch den ein Gegenstand verschwinden konnte, wenn ein Kurier einen Gegenstand zum Lager zurückbrachte, während der eigene Held gerade tot war.",
  "springcleaning22_gameplay_neutral_items_lock": "Kombinieren neutraler Gegenstände kann nicht mehr gesperrt werden. Hierdurch wird ein Fehler umgangen, durch den Kuriere keine neutralen Gegenstände lieferten, bei denen Kombinieren gesperrt war.",
  "springcleaning22_gameplay_illusion_modifiers": "Fehler korrigiert, durch bei Illusionen mit verdoppelten Modifikatoren deren Dauer inkorrekt dargestellt wurde, sodass der echte Held identifiziert werden konnte.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Fehler im Turbo- und Neue-Spieler-Modus korrigiert, durch den einige Goldquellen nicht korrekt skaliert wurden.",
  "springcleaning22_gameplay_turbo_courier": "Fehler im Turbo-Modus behoben, durch den der Kurier eines Spielers nicht länger funktionierte, wenn während der Heldenauswahl oder Planungsphase die Verbindung getrennt war.",
  "springcleaning22_gameplay_zero_tooltips": "Fehler korrigiert, durch den manche von Talenten modifizierte Beschreibungstexte eine 0 statt den korrekten Wert anzeigten.",
  "springcleaning22_gameplay_euls_invulnerable": "Wenn Euls Zepter auf zauberimmune Klone gezaubert wird, wird der Gegenstandeffekt jetzt ordnungsgemäß auf den Klon angewendet, statt einfach direkt abzuklingen.",
  "springcleaning22_gameplay_kobold_aura": "Die Aura des Schürfers des Kobolds wirkt nicht mehr auf Heldendiener (z. B. Lone Druids Bär), wodurch ein Fehler umgangen wird, durch den fälschlicherweise der doppelte Effekt gewährt wurde.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Klone und Tempest Doubles erhalten jetzt ordnungsgemäß die Attributboni des von Alchemist gewährten Aghanims Zeptersegen.",
  "springcleaning22_gameplay_chen_hand_of_god": "Chens Hand of God wirkt nun auch wie erwartet die Heilung über Zeit auf seine Diener, nicht nur die initiale Heilung.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Arc Wardens Tempest Double hat nun keinen reduzierten Angriiffsschaden mehr, wenn Arc Warden in der Nähe wiedergeboren wird.",
  "springcleaning22_gameplay_arc_warden_basher": "Beschreibung ergänzt um den Fakt, dass Klone und Tempest Doubles die Betäubung von Basher und Abyssal Blade nicht auslösen können.",
  "springcleaning22_gameplay_arc_warden_blink": "Blink Dagger eines neu erschaffenen Tempest Double ist nun nicht mehr in Abklingzeit.",
  "springcleaning22_gameplay_arc_warden_wards": "Mit Arc Wardens Tempest Double können nun keine Wards mehr geteilt werden.",
  "springcleaning22_gameplay_pa_scepter_double": "Phantom Assassins Zepterbonus setzt nun nicht mehr die Abklingzeit von Blur zurück, wenn ein Tempest Double getötet wird.",
  "springcleaning22_gameplay_naga_siren_riptide": "Naga Sirens −1 Treffer für Riptide reduziert die nötigen Angriffe nun tatsächlich um 1 und nicht mehr um 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Legion Commanders Duel fügt nun auch Bonusschaden hinzu, wenn der Sieger unverwundbar ist.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Tusks Walrus Kick klingt nun wie erwartet 12 Sekunden lang ab.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Terrorblades Metamorphosis klingt nun wie erwartet 35/40/45/50 Sekunden lang ab.",
  "springcleaning22_gameplay_monkey_king_arena": "Monkey King kann nun nicht mehr mit Tree Dance der Arena of Blood entkommen.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "In Ability Draft werden die Riptide-Effekte jetzt um den korrekten Helden angezeigt und nicht immer um Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Riki kann jetzt Smoke Screen während der Kanalisierung von Tricks of the Trade aktivieren, ohne die Kanalisierung zu unterbrechen, selbst wenn „Kanalisierungsabbruch nur durch ‚Position halten‘ oder ‚Aktion abbrechen‘“ aktiviert ist.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Interaktion von Marcis Dispose mit Black King Bar und Lotus Orb behoben.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Snipers Concussive Grenade fügt dem Ziel nun ein „Entwaffnet“-Symbol über dem Kopf hinzu.",
  "springcleaning22_gameplay_morphling_spirit_link": "Morphling behält nicht mehr den passiven Bonus von Spirit Link, wenn er sich in Lone Druid verwandelt.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Fehlendes Kanalisierungssymbol für Underlords Fiend's Gate hinzugefügt.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Fehlenden Beschreibungstext zum Schwächungseffekt der Eisfeuerbombe des Uralten Eisschamanen hinzugefügt.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Das Timing der Partikeleffekte von Dark Willows Cursed Crown mit Aghanims Splitter ist jetzt korrekt.",
  "springcleaning22_gameplay_lone_druid_midas": "Beim Benutzen von Hand of Midas durch Lone Druids Spirit Bear wird jetzt dem kontrollierenden Helden Erfahrung gewährt.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Spirit Bear und Tempest Doubles erhalten jetzt Ladungen für Magic Stick, Magic Wand und Holy Locket.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Die Beschreibung von Void Spirits Astral Step zeigt jetzt beim Drücken der Alt-Taste die korrekte Zauberverstärkung.",
  "springcleaning22_gameplay_heavenly_jump_range": "Zeus' Heavenly Jump zeigt jetzt beim Überfahren mit der Maus die Reichweite an.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Beschreibungstexte von Crystal Maidens Arcane Aura korrigiert.",
  "springcleaning22_gameplay_hex_tooltip": "Die Beschreibung von Shadow Shamans Hex fügt nicht mehr fälschlicherweise 1 Sekunde zur Dauer hinzu, wenn das Talent „Hex unterbricht passive Fähigkeiten“ gewählt wird.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Abbadons Level-20-Talent aktualisiert jetzt die Abklingzeit in der Beschreibung von Borrowed Time.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Shadow Fiends Presence of the Dark Lord wird jetzt korrekt auf neutrale Einheiten angewandt.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Fehler korrigiert, durch den Tinkers Warp Flare auf Roshan wirkte.",
  "springcleaning22_gameplay_ability_draft_wukong": "In Ability Draft haben die Klone von Wukong's Command jetzt die korrekten Fähigkeiten.",
  "springcleaning22_rubick_illusions": "Fehler behoben, der Rubick-Illusionen daran hinderte, die korrekten Animationen gestohlener Zaubersprüche anzuzeigen (z. B. Banes Fiend's Grip mit Aghanims Zepter).",
  "springcleaning22_rubick_hunter_in_the_night": "Hunter in the Night kann jetzt gestohlen werden, wenn es mit Aghanims Splitter verstärkt wurde.",
  "springcleaning22_rubick_juxtapose": "Juxtapose kann jetzt gestohlen werden, wenn es mit Aghanims Zepter verstärkt wurde.",
  "springcleaning22_rubick_fireball": "Dragon Knights Fireball kann jetzt unabhängig von Dragon Form gestohlen werden und wird nicht automatisch gewährt.",
  "springcleaning22_rubick_wolf_bite": "Wolf Bite funktioniert nun, wenn gestohlen.",
  "springcleaning22_rubick_depth_shroud": "Depth Shroud funktioniert nun, wenn gestohlen.",
  "springcleaning22_rubick_astral_spirit": "Astral Spirits separate Bewegungsfähigkeit wird beim Stehlen entfernt. Rubick behält jetzt beide Fähigkeitsslots, wenn er diese Fähigkeit stiehlt.",
  "springcleaning22_rubick_reverse_time_walk": "Reverse Time Walk wechselt jetzt zum selben Fähigkeitsslot wie Time Walk, wenn Rubick Aghanims Splitter besitzt. Rubick behält jetzt beide Fähigkeitsslots, wenn er diese Fähigkeit stiehlt.",
  "springcleaning22_rubick_jaunt": "Ethereal Jaunt wechselt jetzt zum selben Fähigkeitsslot wie Illusory Orb. Rubick behält jetzt beide Fähigkeitsslots, wenn er diese Fähigkeit stiehlt.",
  "springcleaning22_rubick_eject": "Eject wechselt jetzt zum selben Fähigkeitsslot wie Dismember, wenn Rubick Aghanims Splitter besitzt. Rubick behält jetzt beide Fähigkeitsslots, wenn er diese Fähigkeit stiehlt.",
  "springcleaning22_rubick_dismember": "Dismember stößt jetzt den verbündeten Helden aus, wenn ein anderer Zauber an dessen Stelle gestohlen wird.",
  "springcleaning22_rubick_spit_out": "Spit Out wechselt jetzt zum selben Fähigkeitsslot wie Gobble Up. Rubick behält jetzt beide Fähigkeitsslots, wenn er diese Fähigkeit stiehlt.",
  "springcleaning22_rubick_decoy": "Das Stehlen von Decoy stiehlt nicht mehr auch Bushwhack. Decoy löst beim Aktivieren weiterhin Bushwhack aus.",
  "springcleaning22_rubick_spirits": "Ios Spirits kann jetzt ordnungsgemäß mit Aghanims Zepter gestohlen werden.",
  "springcleaning22_rubick_gravekeepers_cloak": "Gravekeeper's Cloak kann jetzt gestohlen werden, wenn es mit Aghanims Zepter verstärkt wurde.",
  "springcleaning22_rubick_shard_cursed_crown": "Wenn Rubick Aghanims Splitter besitzt, erschafft Cursed Crown nun auch Dornenbüsche.",
  "springcleaning22_rubick_shard_venomous_gale": "Wenn Rubick Aghanims Splitter besitzt, erschafft Venomous Gale nun auch Pestwächter.",
  "springcleaning22_rubick_shard_sprout": "Wenn Rubick Aghanims Splitter besitzt, erschafft Sprout nun auch Treants.",
  "springcleaning22_rubick_shard_shackles": "Wenn Rubick Aghanims Splitter besitzt, erschaffen Shackles nun auch Schlangenwächter.",
  "springcleaning22_rubick_shard_cold_embrace": "Wenn Rubick Aghanims Splitter besitzt, erschafft Cold Embrace nun auch einen Splinter Blast.",
  "springcleaning22_rubick_shard_earthshock": "Wenn Rubick Aghanims Splitter besitzt, gewährt Earthshock nun auch Enrage.",
  "springcleaning22_rubick_shard_shadow_step": "Wenn Rubick Aghanims Splitter besitzt, wirkt Shadow Step nun auch Spectral Dagger.",
  "springcleaning22_rubick_shard_terror_wave": "Wenn Rubick Aghanims Splitter besitzt, wirkt Terror Wave nun auch Metamorphosis.",
  "springcleaning22_rubick_shard_homing_missile": "Wenn Rubick Aghanims Splitter besitzt, wirkt Homing Missile nun auch Rocket Barrage.",
  "springcleaning22_rubick_shard_slithereen_crush": "Wenn Rubick Aghanims Splitter besitzt, wirkt Slithereen Crush nun auch Corrosive Haze.",
  "springcleaning22_rubick_scepter_flak_cannon": "Wenn Rubick Aghanims Zepter besitzt, fügt Flak Cannon nun auch ihm einen Zweitschützen hinzu.",
  "springcleaning22_rubick_scepter_time_walk": "Wenn Rubick Aghanims Zepter besitzt, wirkt Time Walk nun auch Time Lock.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Wenn Rubick Aghanims Zepter besitzt, wirkt Shuriken Toss nun auch Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Wenn Rubick Aghanims Zepter besitzt, wirkt Sacred Arrow nun auch Starstorm.",
  "springcleaning22_ui_quickcast_vector_targeting": "Der Vektorzielmodus für Schnellzauber beim Tastendruck wurde geändert, sodass der Vektor vom Drücken bis zum Loslassen der Taste bestimmt werden kann. Gleiches Verhalten für Schnellzauber beim Loslassen der Taste.",
  "springcleaning22_ui_ward_bounty": "Das Event für den Kill eines Observer Wards zeigt jetzt an, wer die Goldprämie erhalten hat, wenn es sich hierbei nicht um dieselbe Person handelt.",
  "springcleaning22_ui_spectator_hud_player_view": "Das Zuschauer-HUD zeigt jetzt den korrekten Spieler an, dem Sie zuschauen.",
  "springcleaning22_ui_post_game_scepter_shard": "Die Beschreibungstexte für Aghanims Zepter und Splitter zeigen jetzt deren Effekte in der Punktetabelle nach dem Spiel an.",
  "springcleaning22_ui_post_game_backpack_neutral": "Der Rucksack und die neutralen Gegenstände werden jetzt in den Heldendetails nach dem Spiel angezeigt.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Die Zauberlebensraubwerte für Helden sowie Diener und Einheiten werden nun beim Drücken der Alt-Taste separat angezeigt.",
  "springcleaning22_ui_skeleton_warrior_rally": "Die Aura des Ansporns des Skelettkriegers wird nun über einen Stärkungseffekt mit Zähler nachverfolgt, statt über mehrere einzelne Symbole.",
  "springcleaning22_ui_neutral_item_teleport": "Fehler behoben, durch den bei zu schnellem Wechsel neutraler Gegenstände und anschließendem Teleportieren der falsche Gegenstand teleportiert wurde.",
  "springcleaning22_ui_spectator_arcana": "Die Arcana-Elemente des HUD werden beim Zuschauen von Ligapartien nicht mehr angezeigt.",
  "springcleaning22_ui_ready_check_enter": "Die Bereitschaftsabfrage kann nun auch mit der Eingabetaste beantwortet werden.",
  "springcleaning22_ui_alt_item_combine": "Gegenstände im Schnellkauf zeigen jetzt bei Halten der Alt-Taste den vollständigen Gegenstand an, in den sie kombiniert werden können.",
  "springcleaning22_ui_alt_items_ready": "Mit Strg+Alt-Klick auf die folgenden Gegenstände können Sie Ihrem Team nun mitteilen, dass diese bereit sind, statt der Nachricht „Hier sammeln“: Arcane Boots, Crimson Guard, Guardian Greaves, Mekansm, Pip of Insight und Smoke of Deceit.",
  "springcleaning22_ui_sentry_pregame": "Die maximale Anzahl der in der Planungsphase verfügbaren Sentry Wards wurde von 2 auf 3 erhöht. Es können zu Beginn der Partie maximal 3 Sentry Wards gekauft werden.",
  "springcleaning22_ui_guide_pregame": "Nach Auswahl eines Helden zeigt der Bereich für empfohlene Gegenstände nun den ersten Abschnitt des Guides an, wenn der Guide nicht über den Abschnitt „Startgegenstände“ verfügt.",
  "springcleaning22_ui_ward_planter": "Beim Auswählen von Wards wird nun Verbündeten, Zuschauern bzw. Mentoren angezeigt, wer diese platziert hat.",
  "springcleaning22_ui_courier_home_button": "Die Basis-Shop-Schaltfläche des Kuriers legt jetzt auch sämtliche vom Kurier gehaltenen Gegenstände ins Lager, sobald dieser den Brunnen erreicht.",
  "springcleaning22_ui_combat_log_key": "Das Spielprotokoll kann jetzt in den Einstellungen einer Taste zugewiesen werden.",
  "springcleaning22_ui_combat_log_right_align": "Das Spielprotokoll ist jetzt rechtsbündig orientiert und überlappt nicht mehr die Steuerung des Heldentestmodus.",
  "springcleaning22_ui_combat_log_hud_flip": "Das Spielprotokoll respektiert jetzt den HUD-Wechsel (Minikarte rechts) und wird bei Aktivierung dieser Option zur linken Seite bewegt.",
  "springcleaning22_ui_guide_apos": "Problem behoben, durch das Apostrophe in Guide-Kommentaren zu Gegenständen/Fähigkeiten mit „&apos;“ und anderen HTML-Symbolen ersetzt wurden. Guides, die bereits mit diesem Problem gespeichert wurden, müssen manuell aktualisiert werden.",
  "springcleaning22_ui_vs_screen_widescreen": "Anzeige von Helden auf dem Versus-Bildschirm für Bildschirme mit Seitenverhältnis von 21:9 und breiter angepasst.",
  "springcleaning22_ui_charms": "Fehler korrigiert, durch den die Texte der Benutzeroberfläche für Amulette sich überlappten, wenn man 2 oder mehr Amulette besaß.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Fehler im Last-Hit-Training behoben, durch den Diener und Einheiten nicht erschienen, wenn vor dem Erscheinen des eigenen Helden auf Start geklickt wurde.",
  "springcleaning22_ui_intro_scenes": "Introszenen (wie Helden- und Arkana-/Persona-Debüts) werden nicht mehr angezeigt, wenn ein Account den Einstieg für neue Spieler noch nicht abgeschlossen hat.",
  "springcleaning22_cosmetics_illusion_skins": "Fehler behoben, durch den Illusionen die Skins bestimmter kosmetischer Modelle nicht ordnungsgemäß übernahmen.",
  "springcleaning22_cosmetics_cloth_stretch": "Fehler korrigiert, durch den sich der Stoff bestimmter Modelle fälschlicherweise über den Bildschirm streckte.",
  "springcleaning22_cosmetics_underlord_immortal": "Das Immortal „Smaragd der Unterjochung“ für Underlord hat jetzt angepasste Fähigkeitseffekte, welche die der ultimativen Fähigkeit ersetzen.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Die Projektileffekte von Shadow Poison durch das Immortal „Mantle of Grim Facade“ für Shadow Demon sind jetzt korrekt orientiert.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Das Immortal „Blistering Shade“ für Wraith King hat Priorität über das Arkana, wenn „Wraithfire Blast“ aktiviert wird.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Umgebungseffekte des Immortals „Bracers of the Cavern Luminar“ für Earthshaker wiederhergestellt.",
  "springcleaning22_cosmetics_warlock_immortal": "Partikeleffekte für Shadow Word (Stärkung und Schwächung) durch das Immortal „Glyphe der Umbra“ für Warlock wiederhergestellt.",
  "springcleaning22_cosmetics_viper_immortal": "Partikeleffekte im Wirkungsbereich von Nethertoxin durch das Immortal „Stachel des bösartigen Drachen“ für Viper wiederhergestellt.",
  "springcleaning22_cosmetics_abaddon_vessel": "Die Effekte für Aphotic Shield durch Abbadons „Blade of the Demonic Vessel“ wurden wiederhergestellt.",
  "springcleaning22_cosmetics_tidehunder_belt": "Inkorrekte Partikeleffekte von Tidehunters „Horror From the Deep Belt“ vom Gürtel-Slot entfernt (sollte am Arm-Slot angezeigt werden).",
  "springcleaning22_cosmetics_faceless_incursion": "Die Waffeneffekte von Faceless Voids „Invasion aus Claszureme“ wurden wiederhergestellt.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Drow Rangers „Marksmanship“-Aura hat jetzt angepasste Arkana-Effekte für beide Stile.",
  "springcleaning22_cosmetics_rubick_dilemma": "Umgebungseffekte von Rubicks „Torch of Fantoccini's Dilemma“ wiederhergestellt.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Die Laufanimation des Techies-Arkana für „verletzt“ wird jetzt in der korrekten Geschwindigkeit abgespielt.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Unterstützung von Edelsteinfarben des Techies-Arkanas für Sticky Mine und Reactive Tazer hinzugefügt.",
  "springcleaning22_cosmetics_techies_icons": "Fehlende Marktsymbole für die Techies-Sets „Puderschneerodler“, „Zünder der listigen Bergleute“, „Eulenbombe und Hexenknall“ sowie „Marsch der Puderfass-Patrouille“ hinzugefügt.",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Animation des Techie „Spoon“ in der Teleport-Vorschau mit dem Set „Sprengkommando Dickhaut“ repariert.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Das Rubick-Arkana hat jetzt angepasste Effekte für Techies Sticky Bomb statt Remote Mine.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Snapfires Animation für „Außer Gefecht“ repariert, sodass sie nicht mehr in einer falschen Animationssequenz festhängen kann.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Legion Commanders Paket und Gegenstände des Sets „Glühende Besatzerin“ sind jetzt handelbar und marktfähig.",
  "springcleaning22_cosmetics_legion_commander_wind": "Neue Banner-Windeffekte für die Sets „Legacy of the Fallen Legion“ und „Glühende Besatzerin“ für Legion Commander hinzugefügt, sowohl mit ausgerüsteten Arkana-Waffen als auch ohne.",
  "springcleaning22_perf_panorama_atlas": "Die Panorama-UI-Engine verwendet jetzt Atlassing, um effizienter mit der GPU zu interagieren. Unseren Messungen nach steigert das die GPU-Leistung in Bezug auf das HUD um 25–30 % und um bedeutend mehr bei besonders komplizierten Dashboard-Seiten. Diese Änderung verbessert außerdem die CPU-Leistung von Vulkan und sollte insbesondere bei Apple-Computern mit M1-Prozessoren einen Unterschied machen.",
  "springcleaning22_perf_sand_king_particles": "Partikeleffekte von Sand Storm optimiert, sodass sie die Leistung weniger beeinträchtigen.",
  "springcleaning22_perf_panorama_clears": "Die Panorama-UI-Engine vermeidet jetzt unnötiges Entfernen von Renderzielen, was die GPU belastete.",
  "springcleaning22_perf_scenesystem_threading": "Fehler behoben, durch den wir beim Multithreading manchmal weniger Threads als vorgesehen verwendeten. Diese Änderung sollte besonders auf Rechner mit 4 oder weniger Kernen hilfreich sein.",
  "springcleaning22_perf_thread_affinity": "Fehler behoben, durch den falsch gesetzte Threadaffinitäten bei einigen Rechnern zu Hängern führen konnten.",
  "springcleaning22_perf_power_savings": "Warnmeldung in den Videoeinstellungen hinzugefügt, die auf einen aktivierten Energiesparmodus des Rechners hinweist. Dieser kann die Leistung negativ beeinflussen.",
  "springcleaning22_perf_shop_tooltips": "Leistung der Beschreibungsboxen im Gegenstandsshop verbessert.",
  "springcleaning22_custom_games_overview_sort": "Der Übersichtsreiter der Spielhalle kann jetzt auch nach „Derzeit aktive Spieler“ sortiert werden. (Zusätzlich zu „Anzahl offener Lobbys“.)",
  "springcleaning22_custom_games_update": "Fehler behoben, durch den angepasste Spiele in der Spielhalle manchmal nicht auf ein notwendiges Update hingewiesen haben, bis diese neu installiert oder Steam neu gestartet wurde.",
  "springcleaning22_custom_games_lobby_version": "Die Lobbyliste in der Spielhalle zeigt keine Lobbys mehr an, die nicht der aktuell installierten Version des angepassten Spiels entsprechen oder aus sonstigen Gründen nicht betreten werden können.",
  "springcleaning22_custom_games_bounty_filter": "SetFilterMoreGold kann jetzt das von Runen der Gunst gewährte Gold filtern.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Heldenrelikt von Dazzle ersetzt: „Schwächungen mit Bad Juju auf vier Gegner“ > „Schaden und Heilung mit Bad Juju“",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Heldenrelikt von Techies ersetzt: „Kills mit Remote Mines“ > „An Helden geheftete Sticky Bombs“",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Heldenrelikt von Techies ersetzt: „Betäubungen mit Stasis Trap“ > „Entwaffnung mehrerer Helden mit Reactive Tazer“",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Heldenrelikt von Tinker ersetzt: „Schaden mit March of the Machines“ > „Schaden mit Defense Matrix absorbiert“",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Heldenrelikt von Underlord ersetzt: „Kills nach Reality Rift“ > „Kills von Verbündeten durch Fiends Gate“",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Heldenrelikt von Underlord ersetzt: „Helden mit Dark Rift gerettet“ > „Bonusschaden durch Atrophy Aura verursacht“",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Heldenrelikt von Omniknight repariert: „Verbündeter Schaden während Heavenly Grace“",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Heldenrelikt von Primal Beast repariert: „Mehrfachkills mit Onslaught“",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Heldenherausforderung von Meepo ersetzt: „Helden zugefügter magischer Schaden“ > „Helden zugefügter reiner Schaden“",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Heldenherausforderung von Naga Siren ersetzt: „Während Song geheilte Helden“ > „Manabrand-Schaden an Helden“",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Heldenherausforderung von Tinker ersetzt: „Schaden mit March of the Machines“ > „Mit Defense Matrix absorbierter Schaden“",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Heldenherausforderung von Techies ersetzt: „Kills mit Remote Mines“ > „Angeheftete Sticky Bombs“",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Heldenherausforderung von Underlord ersetzt: „Teleports mehrerer Helden mit Dark Rift“ > „Verbündete Kills nach Fiend's Gate“",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Heldenherausforderung von Grimstroke aktualisiert: „Schaden an von Soulbind betroffenen Gegnern“ schließt jetzt auch Schaden von Verbündeten mit ein.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Heldenherausforderung von Mirana aktualisiert: „Schaden während Leap“ schließt jetzt alle Schadensarten ein, nicht nur physischen Schaden.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Heldenherausforderung von Bane repariert: „Blink-Force-Staff-Fiend's-Grip-Kombos“",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Heldenherausforderung von Dragon Knight repariert: „Kills während Dragon Form“",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Heldenherausforderung von Drow Ranger repariert: „Mehr als 2 Gegner mit Gust verstummen“",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Heldenherausforderung von Crystal Maiden repariert: „Einheiten mit Frostbite töten“",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Heldenherausforderung von Dark Seer repariert: „Schaden während Surge“",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Heldenherausforderung von Lifestealer repariert: „Schaden während Rage“",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Heldenherausforderung von Lone Druid repariert: „Schaden während True Form“",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Heldenherausforderung von Mars repariert: „Schaden an gegnerischen Helden“",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Heldenherausforderung von Mars repariert: „Gegnerische Einheiten mit Flächenschaden töten“",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Heldenherausforderung von Omniknight repariert: „Schaden während Heavenly Grace“",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Heldenherausforderung von Omniknight repariert: „Dauer von Heavenly Grace bei Verbündeten“",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Heldenherausforderung von Rubick repariert: „Mehrfachbetäubungen mit Telekinesis“",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Heldenherausforderung von Tinker repariert: „Heldenschaden mit durch Zepter verbessertem Laser“",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Heldenherausforderung von Tusk repariert: „Punch-Kick-Kombos“",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Heldenherausforderung von Venomancer entfernt: „Schaden an mit Silver Edge unterbrochenen Helden“",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Heldenherausforderung von Tinker entfernt: „Einheiten mit March of the Machines getötet“",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Heldenherausforderung für Underlord hinzugefügt: „Schaden mit Firestorm an Helden“",
  "springcleaning22_workshop_modeldoc": "Die Dota-Workshop-Werkzeuge für Gegenstände und angepasste Spiele wurden um den neuen Modelleditor „ModelDoc“ erweitert. Workshop-Künstler sollten jetzt alle Modelle vom alten zum neuen Werkzeug migrieren, da das alte Werkzeug in einem zukünftigen Update entfernt wird."
}