// 663.js

{
  "language": "brazilian",
  "springcleaning22_desc": "A atualização Tirando a Poeira de 2022 chegou para corrigir vários problemas e implementar alguns aprimoramentos gerais. Confira algumas das maiores alterações — como as melhorias para as descrições do Cetro e Fragmento de Aghanim, controles de silenciamento de jogadores, buscas na loja e modo de teste de heróis — e aprofunde-se na lista completa de correções e ajustes de jogabilidade na lista abaixo.",
  "springcleaning22_aghs_tooltips": "Descrições do Cetro e Fragmento de Aghanim",
  "springcleaning22_aghs_tooltips_desc": "As minúcias da mente (e monólogos) de Aghanim estão, sem sombra de dúvidas, além da compreensão mortal. Mas, com a atualização de hoje, os impactos dos seus magníficos cetros e fragmentos no campo de batalha foram revelados como nunca antes. Agora, as descrições dos aprimoramentos de Aghanim incluem mais detalhes sobre os valores que são alterados, e habilidades modificadas também incluem essas informações em uma seção a parte. Diversos aprimoramentos também receberam uma atenção individual para torná-los mais simples e compreensíveis para as nossas mentes desprovidas de magia.",
  "springcleaning22_muting_ui": "Silenciamentos aprimorados",
  "springcleaning22_muting_ui_desc": "Jogadores de Dota podem ser pessoas intensas e às vezes as emoções erradas tomam o controle no calor da competição. Em casos onde esse comportamento se torna incômodo, é importante ter uma forma fácil e rápida de silenciar jogadores e denunciá-los para uma avaliação mais completa sem atrapalhar a sua partida ainda mais. Pensando nisso, um único clique será o suficiente para silenciar a comunicação (por voz e por texto) de um jogador e denunciá-lo. É possível clicar com o botão direito para silenciar texto e voz de forma independente, para aqueles casos em que o comportamento do jogador não seja incômodo, mas cuja comunicação seja indesejada. Para facilitar, também disponibilizamos um novo botão para silenciar toda a equipe com um único clique.\\n\\nTambém estamos aproveitando essa oportunidade para reavaliar como lidamos com denúncias de comunicação. O nosso objetivo é tornar fácil e rápido o silenciamento de jogadores incômodos e também obter um indicador claro sobre quais jogadores poderão precisar de medidas mais severas.",
  "springcleaning22_demo_hero": "Aprimoramentos no teste de heróis",
  "springcleaning22_demo_hero_desc": "Deseja testar novas estratégias ou criar as suas próprias? Bateu aquela vontade incontrolável de ver quantas encarnações de Axe podem ser destruídas com um único golpe da Emissária da Maré? Seja qual for o motivo, chegou o seu momento! O teste de heróis foi reformulado com vários recursos novos:",
  "springcleaning22_demo_hero_map": "Expansão da parte mais ao norte do mapa de testes, assim você terá um maior espaço livre para os seus experimentos.",
  "springcleaning22_demo_hero_hero_spawn": "Adição de controles para criar heróis aliados facilmente, além de inimigos.",
  "springcleaning22_demo_hero_hero_reset": "Adição de comando para reverter um herói de volta ao nível 1.",
  "springcleaning22_demo_hero_hero_remove": "Adição de comando para remover um herói quando não precisar mais dele nos testes.",
  "springcleaning22_demo_hero_hero_select": "Criar um novo herói o adicionará à sua seleção atual.",
  "springcleaning22_demo_hero_levelling": "Agora, os botões de subir de nível, adicionar cetro, adicionar fragmento e alternar invulnerabilidade funcionam para todos os heróis selecionados.",
  "springcleaning22_demo_creep_toggle": "Ao desativar a presença de criaturas, todas as criaturas de trilha serão destruídas.",
  "springcleaning22_demo_creep_spawn": "Adição de botão para criar uma única onda de criaturas em cada lado.",
  "springcleaning22_demo_hero_runes": "Adição de botões para criar as seis Runas de Poder.",
  "springcleaning22_shop_search": "Atualização da busca na loja",
  "springcleaning22_shop_search_desc": "Gastar ouro deveria ser fácil, divertido e, acima de tudo, eficiente. Então para ajudar as suas compras a serem menos \"meep merp\" e mais \"finalizações\", a busca de itens na loja foi expandida com maior compatibilidade para palavras-chave — incluindo um destaque para atributos buscados. Basta buscar por \"armadura\", \"Força\", \"alcance\" etc. para destacar os atributos nos quais você tem interesse. Acostumado com os termos em inglês? [i]Dei uôrqui tchú.[/i] Escolher o item perfeito para o plano perfeito nunca foi tão fácil. Basta ter ouro.",
  "springcleaning22_item_tooltips": "Descrições expansivas para itens",
  "springcleaning22_item_tooltips_desc": "Continua esquecendo quanto mana aquela Inteligência concede? Ou quanta armadura você recebe da Agilidade? Os seus problemas acabaram: basta segurar ALT com a descrição do item aberta para expandir essas propriedades sobre todos os seus atributos.",
  "springcleaning22_colored_ability_damage": "Cores para o dano de habilidades",
  "springcleaning22_colored_ability_damage_desc": "Fazer boas escolhas na batalha depende de conhecer os desafios à sua frente. Para ajudar a desvendar esses possíveis perigos, agora o dano causado por habilidades e itens é colorido de acordo com o tipo de dano: físico, mágico e puro.",
  "springcleaning22_pluralized_strings": "Compatibilidade de pluralização para os idiomas",
  "springcleaning22_pluralized_strings_desc": "Para aprimorar a acessibilidade ao redor do mundo, adicionamos recursos para que o jogo comporte melhor as regras de pluralização de diversos idiomas — alteramos mais de 400 linhas de texto para dar conta [i]dessa(s) mudança(s)[/i].",
  "springcleaning22_permanent_debuffs": "Quem bate, lembra",
  "springcleaning22_permanent_debuffs_desc": "É difícil montar as suas estratégias sem compreender a eficácia das suas ações. Para disponibilizar mais informações após uma partida, agora a quantidade de vítimas da Foice da Morte do Necrophos e da Lâmina de Abate do Axe será exibida na tela pós-partida.",
  "springcleaning22_post_game_sortable": "Detalhes pós-partida ordenáveis",
  "springcleaning22_post_game_sortable_desc": "Quer ir mais a fundo nos detalhes das suas vitórias? Agora, o placar pós-partida pode ser ordenado para facilitar as análises.",
  "springcleaning22_gameplay_tp_boots": "As Botas de Teletransporte são menos propensas a alvejar uma criatura quando usadas no alcance de uma torre.",
  "springcleaning22_gameplay_sellback": "Agora, jogadores podem vender um item pelo preço cheio durante os primeiros 30 segundos após o início da partida, em vez do período normal de 10 segundos.",
  "springcleaning22_gameplay_lifestealer_consume": "Agora, a habilidade Consumir do Lifestealer usa a mesma tecla, independente do tipo da unidade Infestada.",
  "springcleaning22_gameplay_ogre_bruiser_sfx": "Agora, o Ogro Robusto tem efeitos sonoros para o carregamento e atordoamento.",
  "springcleaning22_gameplay_neutral_aura_radius": "Agora, todas as auras de criaturas neutras exibem o raio quando inspecionadas.",
  "springcleaning22_gameplay_wraith_null_bracer_tooltip": "Agora, o Talismã Nulo / Tiara Assombrada / Braçadeira atualiza os seus atributos adicionais na descrição quando dobrados aos 25 minutos.",
  "springcleaning22_gameplay_heal_overhead": "Correção de vários casos em que o valor de cura exibido na unidade não levava em conta amplificações de cura.",
  "springcleaning22_gameplay_fountain_invuln": "Jogadores sob efeito da invulnerabilidade da fonte não mais atacarão automaticamente (perdendo o efeito) caso haja um inimigo no alcance.",
  "springcleaning22_gameplay_blink_range": "Agora, o indicador de alcance da Adaga de Translocação e as suas variantes leva em conta efeitos de aumento de alcance de uso.",
  "springcleaning22_gameplay_desolator_tooltip": "Esclarecimento da descrição da passiva Roubo de Alma da Desoladora. A Desoladora ganha dano de ataque sempre que um inimigo morre sob efeito da Corrupção.",
  "springcleaning22_gameplay_ardm_stash": "Correção de problema no mata-mata aleatório, onde um item retornado pelo entregador para o armário de um jogador morto resultava no desaparecimento do item.",
  "springcleaning22_gameplay_neutral_items_lock": "Não é mais possível impedir a combinação de itens neutros. Isso corrige um problema que impedia entregadores de entregarem itens neutros com combinação travada.",
  "springcleaning22_gameplay_illusion_modifiers": "Correção de problema que fazia com que ilusões com modificadores duplicados tivessem durações incorretas, permitindo a identificação do herói verdadeiro.",
  "springcleaning22_gameplay_turbo_gold_scaling": "Correção de problema no modo Turbo e no Modo para Novatos, onde algumas fontes de ouro não estavam sendo dimensionadas corretamente.",
  "springcleaning22_gameplay_turbo_courier": "Correção de problema no modo Turbo, onde o entregador de um jogador não funcionaria mais caso ele se desconectasse durante a seleção de heróis ou tempo de estratégia.",
  "springcleaning22_gameplay_zero_tooltips": "Correção de problema que fazia com que algumas descrições com valores modificados por talentos fossem exibidas como 0 em vez do valor correto.",
  "springcleaning22_gameplay_euls_invulnerable": "Agora, o uso do Cetro de Eul em clones imunes a magias aplicará o seu efeito corretamente no clone, em vez de simplesmente entrar no intervalo entre usos.",
  "springcleaning22_gameplay_kobold_aura": "A Aura de Prospecção do Kobold não é mais aplicada em criaturas heroicas (como o Espírito Urso), corrigindo um problema que resultava no efeito dobrado.",
  "springcleaning22_gameplay_aghs_scepter_clones": "Agora, Clones e Duplicatas Tempestuosas recebem corretamente os atributos adicionais de bênçãos do Cetro de Aghanim concedidas pelo Alchemist.",
  "springcleaning22_gameplay_chen_hand_of_god": "Agora, a Mão de Deus de Chen aplica corretamente a cura por segundo a criaturas controladas por Chen, em vez de somente a cura inicial.",
  "springcleaning22_gameplay_arc_warden_reincarnate": "Agora, a penalidade de dano de ataque da Duplicata Tempestuosa do Arc Warden respeita a reencarnação do Arc Warden.",
  "springcleaning22_gameplay_arc_warden_basher": "Adição de descrição esclarecendo que Clones e Duplicatas Tempestuosas não podem causar pancadas com o Esmagador de Crânios e Lâmina Abissal.",
  "springcleaning22_gameplay_arc_warden_blink": "A Adaga de Translocação não entra mais no intervalo entre usos de Duplicatas Tempestuosas do Arc Warden quando invocadas.",
  "springcleaning22_gameplay_arc_warden_wards": "A Duplicata Tempestuosa do Arc Warden não pode mais receber sentinelas compartilhadas.",
  "springcleaning22_gameplay_pa_scepter_double": "O aprimoramento do Cetro de Aghanim da Phantom Assassin não restaura mais o intervalo entre usos de Ofuscada ao matar uma Duplicata Tempestuosa.",
  "springcleaning22_gameplay_naga_siren_riptide": "Agora, o talento \"-1 ataque para ativar Corredeira\" reduz corretamente a quantidade em 1 ataque, em vez de 2.",
  "springcleaning22_gameplay_legion_commander_duel": "Agora, o dano adicional do Duelo da Legion Commander é concedido mesmo caso o vencedor esteja invulnerável.",
  "springcleaning22_gameplay_tusk_walrus_kick_cd": "Agora, o Chute Morsal tem o intervalo entre usos correto de 12 segundos.",
  "springcleaning22_gameplay_terrorblade_metamorphosis_cd": "Agora, a Metamorfose de Terrorblade tem a duração correta de 35/40/45/50 segundos.",
  "springcleaning22_gameplay_monkey_king_arena": "Agora, a Dança da Árvore não permite mais escapar da Arena Sangrenta.",
  "springcleaning22_gameplay_naga_siren_ability_draft": "Na Seleção de Habilidades, agora os efeitos da Corredeira da Naga Siren serão exibidos no herói correto, em vez de sempre na Naga Siren.",
  "springcleaning22_gameplay_riki_smoke_screen_cast": "Agora, Riki pode usar a Cortina de Fumaça durante a canalização dos Truques do Ofício sem quebrar a canalização mesmo caso a opção [b]Hab. canalizadas exigem \"Manter pos.\"/\"Cancelar\"[/b] esteja ativada.",
  "springcleaning22_gameplay_marci_dispose_lotus": "Correção de interações da habilidade Dispor de Marci com o Bastão Preto da Realeza e o Orbe de Lótus.",
  "springcleaning22_gameplay_sniper_grenade_icon": "Agora, a Granada de Concussão do Sniper adiciona um ícone de desarme acima do herói.",
  "springcleaning22_gameplay_morphling_spirit_link": "O Morphling não mantém mais a passiva Conexão de Espírito permanentemente ao se morfar no Lone Druid.",
  "springcleaning22_gameplay_underlord_fiends_gate_icon": "Adição de ícone de canalização para o Portal do Demônio do Underlord.",
  "springcleaning22_gameplay_icefire_bomb_tooltip": "Adição de descrição para o efeito negativo da Bomba de Gelo Ardente.",
  "springcleaning22_gameplay_dark_willow_cursed_crown_shard": "Agora, os efeitos de partículas da Coroa Amaldiçoada da Dark Willow com o Fragmento de Aghanim seguem o tempo correto.",
  "springcleaning22_gameplay_lone_druid_midas": "Agora, usar a Mão de Midas no Espírito Urso do Lone Druid concede experiência para o herói que o controla.",
  "springcleaning22_gameplay_magic_stick_tempest_double": "Agora, o Espírito Urso e Duplicadas Tempestuosas podem ganhar cargas de Graveto Mágico, Varinha Mágica e Pingente Sagrado.",
  "springcleaning22_gameplay_void_spirit_astral_step_amp": "Agora, a descrição da Projeção Astral do Void Spirit exibe corretamente os valores de amplificação arcana ao pressionar ALT.",
  "springcleaning22_gameplay_heavenly_jump_range": "Agora, o Salto Divino de Zeus exibe o seu alcance ao passar o mouse.",
  "springcleaning22_gameplay_arcane_aura_tooltip": "Correção de descrições da Aura Arcana da Crystal Maiden.",
  "springcleaning22_gameplay_hex_tooltip": "Correção de problema na descrição de Enfeitiçar do Shadow Shaman, que adicionava um segundo à sua duração quando o talento \"Enfeitiçar quebra o alvo\" estivesse selecionado.",
  "springcleaning22_gameplay_abaddon_talent_tooltip": "Correção de problema em que o talento nível 20 de Abaddon não atualizava o intervalo entre usos do Tempo Emprestado na sua descrição.",
  "springcleaning22_gameplay_shadowfiend_presence_fix": "Correção de problema com a Presença do Lorde das Trevas do Shadow Fiend, para funcionar corretamente contra criaturas neutras.",
  "springcleaning22_gameplay_tinker_warp_grenade_roshan": "Correção de problema que permitia o Clarão Errático do Tinker afetar Roshan.",
  "springcleaning22_gameplay_ability_draft_wukong": "Na Seleção de Habilidades, correção de problema em que os clones do Comando de Wukong não tinham as habilidades corretas.",
  "springcleaning22_rubick_illusions": "Correção de problema que impedia ilusões de Rubick de terem animações corretas de acordo com habilidades roubadas (como o Aperto do Demônio de Bane com o Cetro de Aghanim).",
  "springcleaning22_rubick_hunter_in_the_night": "Agora, o Predador Noturno pode ser roubado quando aprimorado pelo Fragmento de Aghanim.",
  "springcleaning22_rubick_juxtapose": "Agora, a Justaposição pode ser roubada quando aprimorada pelo Cetro de Aghanim.",
  "springcleaning22_rubick_fireball": "Agora, a Bola de Fogo pode ser roubada independentemente da Forma de Dragão e não é concedida automaticamente.",
  "springcleaning22_rubick_wolf_bite": "Agora, a Mordida Lupina funciona quando roubada.",
  "springcleaning22_rubick_depth_shroud": "Agora, o Manto das Profundezas funciona quando roubado.",
  "springcleaning22_rubick_astral_spirit": "Remoção de habilidade de movimento separada para o Espírito Astral quando roubado. Agora, Rubick pode manter ambos os compartimentos de habilidade ao roubá-lo.",
  "springcleaning22_rubick_reverse_time_walk": "Agora, Andar Temporal, quando usado, é substituído por Reverter Andar Temporal na barra de habilidades caso Rubick tenha o Fragmento de Aghanim. Rubick pode manter ambos os compartimentos de habilidade ao roubá-lo.",
  "springcleaning22_rubick_jaunt": "Agora, o Orbe Ilusório, quando usado, é substituído por Viagem Etérea na barra de habilidades caso Rubick tenha o Fragmento de Aghanim. Rubick pode manter ambos os compartimentos de habilidade ao roubá-lo.",
  "springcleaning22_rubick_eject": "Agora, Desmembrar, quando usada, é substituída por Ejetar na barra de habilidades caso Rubick tenha o Fragmento de Aghanim. Rubick pode manter ambos os compartimentos de habilidade ao roubá-la.",
  "springcleaning22_rubick_dismember": "Agora, Desmembrar ejeta o herói aliado caso outra habilidade seja roubada no seu lugar.",
  "springcleaning22_rubick_spit_out": "Agora, Engolir, quando usada, é substituída por Cuspir na barra de habilidades caso Rubick tenha o Fragmento de Aghanim. Rubick pode manter ambos os compartimentos de habilidade ao roubá-la.",
  "springcleaning22_rubick_decoy": "Roubar Chamariz não rouba mais Enredamento junto. O Chamariz ainda aplica um Enredamento quando usado.",
  "springcleaning22_rubick_spirits": "Agora, os Espíritos roubados de Io funcionam corretamente com o Cetro de Aghanim.",
  "springcleaning22_rubick_gravekeepers_cloak": "Agora, o Manto do Coveiro pode ser roubado quando aprimorado pelo Cetro de Aghanim.",
  "springcleaning22_rubick_shard_cursed_crown": "Caso Rubick tenha o Fragmento de Aghanim, a Coroa Amaldiçoada também criará Espinheiros.",
  "springcleaning22_rubick_shard_venomous_gale": "Caso Rubick tenha o Fragmento de Aghanim, a Bola de Veneno também criará Sentinelas de Praga.",
  "springcleaning22_rubick_shard_sprout": "Caso Rubick tenha o Fragmento de Aghanim, Brotar também criará Treants.",
  "springcleaning22_rubick_shard_shackles": "Caso Rubick tenha o Fragmento de Aghanim, Algemas também criará Serpentes Sentinelas.",
  "springcleaning22_rubick_shard_cold_embrace": "Caso Rubick tenha o Fragmento de Aghanim, o Abraço Gelado também emanará uma Explosão Estilhaçante.",
  "springcleaning22_rubick_shard_earthshock": "Caso Rubick tenha o Fragmento de Aghanim, o Choque Terrestre também o deixará Enfurecido.",
  "springcleaning22_rubick_shard_shadow_step": "Caso Rubick tenha o Fragmento de Aghanim, Andar nas Sombras também lançará uma Adaga Espectral.",
  "springcleaning22_rubick_shard_terror_wave": "Caso Rubick tenha o Fragmento de Aghanim, a Onda de Terror também aplicará uma Metamorfose.",
  "springcleaning22_rubick_shard_homing_missile": "Caso Rubick tenha o Fragmento de Aghanim, o Míssil Teleguiado também ativará uma Artilharia de Foguetes.",
  "springcleaning22_rubick_shard_slithereen_crush": "Caso Rubick tenha o Fragmento de Aghanim, o Esmagamento do Slithereen também aplicará uma Neblina Corrosiva.",
  "springcleaning22_rubick_scepter_flak_cannon": "Caso Rubick tenha o Cetro de Aghanim, o Canhão Antiaéreo também terá a Artilharia Lateral passiva.",
  "springcleaning22_rubick_scepter_time_walk": "Caso Rubick tenha o Cetro de Aghanim, o Andar Temporal também aplicará uma Tranca Temporal.",
  "springcleaning22_rubick_scepter_shiruken_toss": "Caso Rubick tenha o Cetro de Aghanim, o Lançamento de Shuriken também aplicará Jinada.",
  "springcleaning22_rubick_scepter_sacred_arrow": "Caso Rubick tenha o Cetro de Aghanim, a Flecha Sagrada também aplicará Chuva Estelar.",
  "springcleaning22_ui_quickcast_vector_targeting": "Alteração do funcionamento de habilidades com alvo vetorizado ao usar atalhos rápidos com a opção [b]Ativar atalho rápido ao pressionar tecla[/b] ativada. Agora, o ponto de origem do vetor é definido ao pressionar a tecla, e o ângulo, ao soltá-la — semelhante ao comportamento do atalho rápido com essa opção desativada.",
  "springcleaning22_ui_ward_bounty": "Agora, quando uma sentinela é destruída, também é exibido quem recebeu a recompensa (caso não tenha sido o mesmo herói que a destruiu).",
  "springcleaning22_ui_spectator_hud_player_view": "Agora, a interface de espectadores exibe corretamente o jogador sendo observado.",
  "springcleaning22_ui_post_game_scepter_shard": "Agora, os símbolos do Cetro e Fragmento de Aghanim no placar pós-partida exibem os seus efeitos.",
  "springcleaning22_ui_post_game_backpack_neutral": "Agora, itens neutros e na mochila são exibidos na tela pós-partida.",
  "springcleaning22_ui_spell_lifesteal_tooltip": "Agora, valores de roubo de vida arcano para heróis e criaturas são exibidos separadamente ao segurar ALT.",
  "springcleaning22_ui_skeleton_warrior_rally": "Agora, a aura de Agrupamento do Guerreiro Esqueleto é contabilizada em um único efeito, em vez de múltiplos efeitos individuais.",
  "springcleaning22_ui_neutral_item_teleport": "Correção de problema ao trocar itens neutros e enviar para o armário neutro rapidamente, resultando no envio do item incorreto.",
  "springcleaning22_ui_spectator_arcana": "A interface de Arcanos não é mais exibida para espectadores em partidas de ligas.",
  "springcleaning22_ui_ready_check_enter": "Agora, é possível apertar ENTER para confirmar uma verificação de prontidão.",
  "springcleaning22_ui_alt_item_combine": "Agora, itens no menu de compra rápida exibem o item completo que será montado ao pressionar ALT.",
  "springcleaning22_ui_alt_items_ready": "Pressionar Ctrl + Alt ao clicar nos seguintes itens informará a sua equipe que o item está pronto, em vez de solicitar que se juntem: Botas Arcanas, Cachimbo de Introspecção, Fumaça da Enganação, Grevas Guardiãs, Mekansm e Proteção Carmesim.",
  "springcleaning22_ui_sentry_pregame": "Aumento da quantidade de Sentinelas Reveladoras exibidas durante o tempo de estratégia (2 → 3). Há um máximo de três Sentinelas Reveladoras por equipe no início da partida.",
  "springcleaning22_ui_guide_pregame": "Após selecionar um herói, agora a seção de itens recomendados exibirá a primeira seção do guia caso ele não tenha uma seção chamada \"Itens Iniciais\".",
  "springcleaning22_ui_ward_planter": "Agora, selecionar uma sentinela exibirá quem a plantou (para aliados, espectadores e instrutores aliados).",
  "springcleaning22_ui_courier_home_button": "Agora, o botão \"Loja da Base\" do entregador também retornará quaisquer itens que ele carregar de volta para o armário ao chegar na base.",
  "springcleaning22_ui_combat_log_key": "Agora, o histórico do combate pode ser vinculado a uma tecla nas opções.",
  "springcleaning22_ui_combat_log_right_align": "Agora, o histórico do combate é alinhado à direta e não se sobrepõe mais aos controles do teste de heróis.",
  "springcleaning22_ui_combat_log_hud_flip": "Agora, o histórico do combate acompanha a troca de interface (minimapa à direita) e também será movido quando essa opção for ativada.",
  "springcleaning22_ui_guide_apos": "Correção de problema com comentários em itens/habilidades de guias, que trocava apóstrofos por \"&apos;\" e outros símbolos HTML após salvar. Guias que já haviam sido salvos com esse problema ainda precisam de correção manual.",
  "springcleaning22_ui_vs_screen_widescreen": "Ajuste da exibição de heróis na tela de combate em monitores de formato 21:9 ou mais largos.",
  "springcleaning22_ui_charms": "Correção de problema que resultava na sobreposição de textos na interface de amuletos caso houvesse mais de um.",
  "springcleaning22_ui_last_hit_trainer_spawn": "Correção de problema no treinamento de finalizações, que impedia o nascimento de criaturas ao clicar em iniciar antes do nascimento do herói.",
  "springcleaning22_ui_intro_scenes": "Cenas de introdução (como novos heróis e Arcanos/personas) não serão mais exibidas para jogadores que ainda não passaram por toda a experiência de novos jogadores.",
  "springcleaning22_cosmetics_illusion_skins": "Correção de problema que fazia com que ilusões não herdassem certos itens cosméticos corretamente.",
  "springcleaning22_cosmetics_cloth_stretch": "Correção de problema que fazia com que o tecido de certos modelos se esticasse incorretamente ao longo da tela.",
  "springcleaning22_cosmetics_underlord_immortal": "Agora, o Imortal \"Subjugação Esmeralda\" do Underlord tem efeitos personalizados para a Ultimate.",
  "springcleaning22_cosmetics_shadow_demon_immortal": "Correção do direcionamento dos efeitos do projétil do Veneno Sombrio com o Imortal \"Manto da Fachada Sombria\" do Shadow Demon.",
  "springcleaning22_cosmetics_wraith_king_immortal": "Agora, o Imortal \"Aquecimento Sombrio\" do Wraith King tem prioridade sobre o Arcano ao usar a Explosão Maldita.",
  "springcleaning22_cosmetics_earthshaker_immortal": "Correção dos efeitos ambientes do Imortal \"Braçadeiras da Caverna Luminosa\" do Earthshaker.",
  "springcleaning22_cosmetics_warlock_immortal": "Correção dos efeitos (positivos e negativos) da Palavra Sombria com o Imortal \"Glifo Umbrático\" do Warlock.",
  "springcleaning22_cosmetics_viper_immortal": "Correção de problema com as partículas da Toxina Letal com o Imortal \"Ferrão do Dragonete Maligno\" do Viper.",
  "springcleaning22_cosmetics_abaddon_vessel": "Retorno dos efeitos para o Escudo Afótico com a \"Lâmina do Receptáculo Demoníaco\" de Abaddon.",
  "springcleaning22_cosmetics_tidehunder_belt": "Remoção de partículas incorretas do \"Horror das Profundezas — Cinturão\" do Tidehunter, que deveriam estar no item dos braços.",
  "springcleaning22_cosmetics_faceless_incursion": "Correção dos efeitos ambientes da arma do conjunto \"Incursão de Claszureme\" para o Faceless Void.",
  "springcleaning22_cosmetics_drow_arcana_aura": "Agora, a aura da Pontaria conta com efeitos personalizados para ambos os estilos do Arcano da Drow Ranger.",
  "springcleaning22_cosmetics_rubick_dilemma": "Retorno dos efeitos ambientes da \"Tocha do Dilema da Marionete\" de Rubick.",
  "springcleaning22_cosmetics_techies_arcana_run_anim": "Agora, a animação de corrida enquanto feridos do Arcano dos Techies é reproduzida na velocidade correta.",
  "springcleaning22_cosmetics_techies_arcana_gem_color": "Adição de compartibilidade com gemas coloridas para Bomba Pegajosa e Taser Reativo com o Arcano dos Techies.",
  "springcleaning22_cosmetics_techies_icons": "Adição de ícones ausentes para os seguintes conjuntos dos Techies: \"Viveiro Polvorento\", \"Artimanha dos Sabotadores\", \"Bombardeiros Estrigídeos\" e \"Marcha da Patrulha do Barril de Pólvora\".",
  "springcleaning22_cosmetics_techies_wagon_spoon": "Correção da animação de Spoon na prévia de teletransporte com o conjunto \"Paquiderme Explosivo\" dos Techies.",
  "springcleaning22_cosmetics_rubick_arcana_techies": "Agora, o Arcano de Rubick tem os efeitos personalizados das Bombas Pegajosas dos Techies, em vez das Minas Remotas.",
  "springcleaning22_cosmetics_snapfire_disabled_anim": "Correção da animação de desativação da Snapfire, para que ela não fique mais presa em uma sequência de animação incorreta.",
  "springcleaning22_cosmetics_legion_commander_conqueror": "Agora, o pacote e itens do conjunto \"Conquistadora Radiante\" da Legion Commander podem ser trocados e comercializados.",
  "springcleaning22_cosmetics_legion_commander_wind": "Adição de efeitos de vento para os estandartes do Imortal \"Legado da Legião Derrotada\" e conjunto \"Conquistadora Radiante\" da Legion Commander, com ou sem as espadas do Arcano equipadas.",
  "springcleaning22_perf_panorama_atlas": "Atualização da engine da interface Panorama para usar [i]atlassing[/i], permitindo uma interação mais eficiente com o processador gráfico (GPU). De acordo com os nossos testes, isso resultou em um desempenho 25% a 30% melhor do processador gráfico para renderizar a interface, e muito maior em algumas páginas do painel particularmente complicadas. Essa alteração também aumenta o desempenho de processamento geral ao usar a API Vulkan e deve ser particularmente eficaz para computadores da Apple com processadores Apple Silicon (como M1).",
  "springcleaning22_perf_sand_king_particles": "Otimização de partículas de efeito da Tempestade de Areia para aprimorar o desempenho.",
  "springcleaning22_perf_panorama_clears": "Atualização da engine da interface Panorama para evitar limpezas desnecessárias de [i]render targets[/i], reduzindo o trabalho do processador gráfico.",
  "springcleaning22_perf_scenesystem_threading": "Correção de erro ocasional que fazia com que o jogo usasse menos [i]threads[/i] que o pretendido para tarefas paralelizáveis. Essa correção é especialmente útil para máquinas com quatro núcleos ou menos.",
  "springcleaning22_perf_thread_affinity": "Correção de erro em que afinidades de [i]threads[/i] definidas incorretamente poderiam resultar em engasgos em algumas máquinas.",
  "springcleaning22_perf_power_savings": "Adição de aviso à tela de configurações de vídeo se o computador estiver no modo de economia de energia, o que pode resultar em um desempenho pior do que o esperado.",
  "springcleaning22_perf_shop_tooltips": "Aprimoramento do desempenho das janelas de descrições ao explorar a loja de itens.",
  "springcleaning22_custom_games_overview_sort": "Agora, a aba \"Visão geral\" do Salão de Jogos permite ordenar pela quantidade de jogadores ativos, assim como pela quantidade de salas abertas.",
  "springcleaning22_custom_games_update": "Correção de problema ocasional em que não era indicado que modos alternativos do Salão de Jogos precisavam ser atualizados até que fossem reinstalados ou o Steam fosse reiniciado.",
  "springcleaning22_custom_games_lobby_version": "A lista de salas do Salão de Jogos não exibirá mais salas que não estão usando a versão atual do modo alternativo ou que sejam inacessíveis por outros motivos.",
  "springcleaning22_custom_games_bounty_filter": "Agora, a função SetFilterMoreGold pode filtrar o ouro recebido de runas de Recompensas.",
  "springcleaning22_dota_plus_relic_replace_dazzle_juju": "Alteração de relíquia de Dazzle: Mandingas aplicadas em quatro inimigos → Dano e cura com a Mandinga.",
  "springcleaning22_dota_plus_relic_replace_techies_remote": "Alteração de relíquia dos Techies: Vítimas de Minas Remotas → Bombas Pegajosas presas a heróis.",
  "springcleaning22_dota_plus_relic_replace_techies_stasis": "Alteração de relíquia dos Techies: Atordoamentos de Armadilhas Imobilizantes → Tasers Reativos que desarmam múltiplos heróis.",
  "springcleaning22_dota_plus_relic_replace_tinker_march": "Alteração de relíquia do Tinker: Dano causado pela Marcha das Máquinas → Dano absorvido com a Matriz Defensiva.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_kills": "Alteração de relíquia do Underlord: Vítimas resultantes de Fendas Sombrias → Vítimas de aliados que usaram o Portal do Demônio.",
  "springcleaning22_dota_plus_relic_replace_underlord_rift_saves": "Alteração de relíquia do Underlord: Heróis salvos por Fendas → Dano adicional causado com a Aura Atrofiante.",
  "springcleaning22_dota_plus_relic_fix_omniknight_grace": "Correção de relíquia do Omniknight: Dano causado por aliados durante a Graça Divina.",
  "springcleaning22_dota_plus_relic_fix_primal_beast_onslaught": "Correção de relíquia da Fera Primal: Investidas que atingem múltiplos heróis.",
  "springcleaning22_dota_plus_challenge_replace_meepo_magic_damage": "Substituição de desafio de herói para Meepo: Cause dano mágico a heróis → Cause dano puro a heróis.",
  "springcleaning22_dota_plus_challenge_replace_naga_heal": "Substituição de desafio de herói para a Naga Siren: Cure heróis com a Canção → Cause dano de queima de mana a heróis.",
  "springcleaning22_dota_plus_challenge_replace_tinker_march": "Substituição de desafio de herói para o Tinker: Cause dano com a Marcha das Máquinas → Absorva dano com a Matriz Defensiva.",
  "springcleaning22_dota_plus_challenge_replace_techies_remote": "Substituição de desafio de herói para os Techies: Mate com Minas Remotas → Prenda Bombas Pegajosas.",
  "springcleaning22_dota_plus_challenge_replace_underlord_rift": "Substituição de desafio de herói para o Underlord: Teletransporte múltiplos heróis com Fendas Sombrias → Ajude aliados a matar inimigos com o Portal do Demônio.",
  "springcleaning22_dota_plus_challenge_update_grimstroke_soul_bind": "Atualização de desafio de herói do Grimstroke: agora, o dano causado a inimigos afetados pelo Vínculo Espiritual inclui dano causado por aliados.",
  "springcleaning22_dota_plus_challenge_update_mirana_leap": "Atualização de desafio de herói de Mirana: agora, o dano causado durante o Salto inclui todos os tipos de dano, em vez de apenas físico.",
  "springcleaning22_dota_plus_challenge_fix_bane_grip": "Correção de desafio de herói de Bane: combinações de Adaga Translocação/Cajado de Força e Aperto do Demônio.",
  "springcleaning22_dota_plus_challenge_fix_dragon_knight_dragon": "Correção de desafio de herói do Dragon Knight: vítimas durante a Forma de Dragão.",
  "springcleaning22_dota_plus_challenge_fix_drow_silence": "Correção de desafio de herói da Drow Ranger: silencie 2+ heróis com a Rajada de Vento.",
  "springcleaning22_dota_plus_challenge_fix_cm_frostbite": "Correção de desafio de herói da Crystal Maiden: mate criaturas com Congelamento.",
  "springcleaning22_dota_plus_challenge_fix_dark_seer_surge": "Correção de desafio de herói do Dark Seer: cause dano durante o Surto.",
  "springcleaning22_dota_plus_challenge_fix_lifestealer_rage": "Correção de desafio de herói do Lifestealer: cause dano durante a Fúria.",
  "springcleaning22_dota_plus_challenge_fix_lone_druid_true_form": "Correção de desafio de herói do Lone Druid: cause dano durante a Forma Verdadeira.",
  "springcleaning22_dota_plus_challenge_fix_mars_hero_damage": "Correção de desafio de herói de Marte: cause dano a heróis inimigos.",
  "springcleaning22_dota_plus_challenge_fix_mars_cleave": "Correção de desafio de herói de Marte: mate unidades inimigas com transposição.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_damage": "Correção de desafio de herói do Omniknight: cause dano a heróis durante a Graça Divina.",
  "springcleaning22_dota_plus_challenge_fix_omniknight_grace_duration": "Correção de desafio de herói do Omniknight: duração de Graças Divinas em aliados.",
  "springcleaning22_dota_plus_challenge_fix_rubick_telekenisis_stun": "Correção de desafio de herói de Rubick: atordoe múltiplos heróis com Telecineses.",
  "springcleaning22_dota_plus_challenge_fix_tinker_laser_aghs": "Correção de desafio de herói do Tinker: cause dano a heróis com o Laser aprimorado pelo Cetro de Aghanim.",
  "springcleaning22_dota_plus_challenge_fix_tusk_punch_kick": "Correção de desafio de herói do Tusk: combine socos e chutes morsais.",
  "springcleaning22_dota_plus_challenge_remove_venomancer_silver_edge": "Remoção de desafio de herói do Venomancer: cause dano a heróis quebrados pela Lâmina de Prata.",
  "springcleaning22_dota_plus_challenge_remove_tinker_march_kills": "Remoção de desafio de herói do Tinker: mate criaturas com a Marcha das Máquinas.",
  "springcleaning22_dota_plus_challenge_add_underlord_firestorm": "Adição de desafio de herói para o Underlord: cause dano a heróis com a Chuva de Meteoros.",
  "springcleaning22_workshop_modeldoc": "Aprimoramento das ferramentas da Oficina do Dota para itens e modos personalizados, usando o novo editor de modelos \"ModelDoc\". Colaboradores da Oficina devem migrar quaisquer modelos da antiga ferramenta, que será removida em uma atualização futura."
}