// 9082.js

{
  "language": "vietnamese",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Trang hoàng hội trường Frostivus với những món trang trí đậm chất lễ hội, bản cập nhật lối chơi 7.35, ba bộ vật phẩm Dota Plus cao cấp cùng hàng loạt tính năng cải tiến",
  "winter2023_subtitle_short": "Vật phẩm trang trí lễ hội, bản cập nhật lối chơi & hàng loạt tính năng cải tiến",
  "winter2023_section_introduction": "Frostivus từng có <i>một ý nghĩa</i> gì đó. Không phải về bạn bè, gia đình hay cảm xúc của bạn. Mục đích của lễ hội là <i>săn đồ</i>. Nhưng đến một thời điểm nọ, chủ nghĩa vật chất bị hút khỏi lễ hội và bỗng dưng tinh thần tương thân tương ái ngốc nghếch của thiên hạ lại lên ngôi với việc trao tặng quà. Vậy nên năm nay chúng ta sẽ khám phá lại ý nghĩa ĐÍCH THỰC của Frostivus: Đồ trang trí.",
  "winter2023_frostivus_section_title": "Hòm kho báo Frostivus",
  "winter2023_frostivus_section_date": "14/12/2023 - 11/01/2024",
  "winter2023_frostivus_section_introduction": "Thắng trận để lấp đầy thanh khí thế Frostivus và nhận một hòm kho báu Frostivus bị khóa CÙNG một quà nhỏ nhồi vớ ngẫu nhiên, từ sơn xịt cho đến biểu tượng cảm xúc và hình dán.",
  "winter2023_frostivus_earn_chests": "Kiếm hòm kho báu",
  "winter2023_frostivus_how_to_earn_chests": "Mỗi khi nạp đầy thanh khí thế, tinh thần Frostivus sẽ ngập tràn và lan tỏa khắp cơ thể, hình thành nên một hòm kho báu Frostivus 2023 được khóa.",
  "winter2023_frostivus_buy_keys": "Mua chìa",
  "winter2023_frostivus_how_to_buy_keys": "Mua chìa để mở khóa và khám phá ý nghĩa đích thực của kho báu bên trong.",
  "winter2023_naughty_or_nice_section_title": "Bạn là...",
  "winter2023_naughty_or_nice_naughty": "Trẻ hư?",
  "winter2023_naughty_or_nice_naughty_desc": "Đừng phủ nhận nha. Đức vua Kringle biết hết. Ngài đã kiểm điểm hành vi của bạn tới hai lần, và đang đến với chiếc búa cấm để nghiền nát tài khoản smurf chơi lệch hạng của tất cả bé trai bé gái hư, tiếp theo là áp hình phạt lên cả tài khoản chính liên quan.",
  "winter2023_naughty_or_nice_nice": "Hay trẻ ngoan?",
  "winter2023_naughty_or_nice_nice_desc": "Bạn chơi Dota năm nay một cách mẫu mực? Tuyệt! Đức vua Kringle có một cây búa <i>khác</i> cho bạn! Nhưng chớ lầm, <i>vẫn bị gõ một cái thật đau đó</i>. Nhưng khi tỉnh lại trong bệnh viện, bạn sẽ thắc mắc đấy có phải là mơ không? Và bên cạnh gối tôi có cái gì thế này? A, một <i>món quà Frostivus miễn phí!</i> Điểm hành vi tốt đổi được gì đây? Hãy mở quà ra và khám phá...",
  "winter2023_naughty_or_nice_nice_desc2": "Bạn có điểm hành vi hân hoan hết nấc? Tuyệt! Đức vua Kringle có một cây búa <i>khác</i> cho bạn! Nhưng chớ lầm, vẫn bị gõ một cái thật đau đó. Nhưng khi tỉnh lại trong bệnh viện, bạn sẽ thắc mắc đấy có phải là mơ không? Và bên cạnh gối tôi có cái gì thế này? A, một <i>chìa Frostivus miễn phí!</i>",
  "winter2023_frostivus_section_event_title": "Kho báu Frostivus 2023",
  "winter2023_frostivus_section_event_introduction": "Tất cả vật phẩm mới cho tướng bạn yêu thích, cộng với sự trở lại của những món mê mẩn mùa lễ hội — và thậm chí Arcana Wraith King và Persona Crystal Maiden sẽ giá đáo nữa!",
  "winter2023_bonus_item_title": "Mùa để (thi thoảng) trao đi",
  "winter2023_bonus_item_desc": "Đây chính là phép kỳ diệu của Frostivus! Cứ mỗi khi mở khóa một bộ vật phẩm, bạn <i>cũng sẽ</i> có cơ hội mở khóa thêm phiên bản độc lạ của một trong các món <i>trong</i> bộ đó! Và như bao điều kỳ diệu khác, tỉ lệ nhận về tay xấp xỉ việc bị thiên thạch đánh trúng, vậy nên đừng vội dọn chỗ trong kho đồ nha.",
  "winter2023_bonus_item_fullset": "Bộ đầy đủ",
  "winter2023_bonus_item_unusual": "Phiên bản độc lạ",
  "winter2023_stocking_stuffer_title": "Quà nhỏ nhồi vớ",
  "winter2023_stocking_stuffer_desc": "Nếu thực tế đắng lòng của đoạn văn trên làm bạn u sầu về khả năng nhận được quà kèm thêm đồ thường, đừng buồn! Đội tuần tra quà thưởng Frostivus sẽ <i>đảm bảo</i> ghé qua nhà bạn mỗi khi thanh khí thế Frostivus được lấp đầy, và theo đó là một trong những món quà tuyệt vời bên dưới.",
  "winter2023_stocking_stuffer_sprays_stickers": "Sơn xịt & hình dán",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Các sơn xịt mới này chỉ có trong mùa Frostivus thôi, nhưng chúng tôi đã lắng nghe đề xuất của các bạn — phiên bản hình dán có hiệu lực vĩnh viễn. Dán chúng lên khắp hồ sơ đi nào.",
  "winter2023_stocking_stuffer_emoticons": "Biểu tượng cảm xúc",
  "winter2023_stocking_stuffer_emoticons_desc": "Trước khi Marie Curie phát minh ra biểu tượng cảm xúc, chưa từng ai có khả năng diễn đạt xúc cảm. Dota trân trọng sự hy sinh của cô, vì những phát minh đầu tiên rất là phóng xạ.",
  "winter2023_stocking_stuffer_ward": "Frosty the North Ward",
  "winter2023_stocking_stuffer_ward_desc": "Bí mật bổ sung: người tuyết tí hon này thực ra còn mạnh hơn CẢ HAI Ancient. Nhưng bạn sẽ không bao giờ biết được. Tại sao á? Vì ảnh <i>khiêm tốn lắm</i>.",
  "winter2023_stocking_stuffer_courier": "Thú vận chuyển Seal",
  "winter2023_stocking_stuffer_courier_desc": "Nhìn cu cậu dễ thương chưa kìa? Điểm cộng là ăn được luôn đó. Thịt mỡ dồi dào để giúp bạn vượt qua tình cảnh \"đói ăn vụng, túng làm càn\".",
  "winter2023_frostivus_festive_items_title": "Vật phẩm lễ hội",
  "winter2023_frostivus_party_hats": "Nón Frostivus",
  "winter2023_frostivus_party_hats_description": "Chúng tôi có nón Frostivus cho tất cả mọi người! Không đầu? Không vấn đề! Quá nhiều đầu? Chuyện nhỏ! Đội tuần tra quà thưởng Frostivus đang de xe tải chở nón và nâng thùng xe lên bất cứ thứ gì trông giống đầu.",
  "winter2023_frostivus_free_event_items": "Hàng miễn phí",
  "winter2023_frostivus_free_event_items_description": "Trong các mùa Frostivus trước đây, vật phẩm tiêu thụ có giới hạn số lần dùng. Năm nay, bạn có thể dùng thoải mái! Đây là quà mà. À, thực ra cho mượn thì đúng hơn. Đội tuần tra quà thưởng Frostivus sẽ quay lại thu hồi vào cuối sự kiện.",
  "winter2023_frostivus_high_fives": "Đập tay",
  "winter2023_frostivus_high_fives_description": "Khác với kiểu đập tay mà bạn liên tục làm với bè bạn và gia đình, đập tay Frostivus nóng hổi như cạn cốc sô cô la bốc khói mừng lễ hội. Mà để chúng tôi nói thật, nghỉ tay chút đi bạn, gia đình và bè bạn cũng mỏi tay lắm rồi đó.",
  "winter2023_frostivus_section_treasure_title": "Kho báu Frostivus 2023",
  "winter2023_clientupdate_section_title": "Cập nhật phần mềm",
  "winter2023_clientupdate_introduction": "Chà, Đức vua Kringle đã lần nữa phát hết quà của năm. Frostivus vui vẻ nhé bà con, đi đường an toàn nhưng KHOAN! Vẫn còn thứ gì <i>khác</i> ở đáy túi quà kìa!",
  "winter2023_qol_section_title": "Cải tiến chất lượng",
  "winter2023_qol_introduction": "Thông tin tốt hơn để ra quyết định chuẩn hơn",
  "winter2023_qol_tower_range_indicator_title": "Báo hiệu cự ly trụ",
  "winter2023_qol_tower_range_indicator_desc": "Ngán ngẩm vì không biết khi nào thì trụ nhắm vào đối tượng quan trọng nào đó (như bạn chẳng hạn)? Hiệu ứng được cải tiến để làm rõ hơn khi nào thì an toàn đâm đầu vào trụ hoặc chạy mất dép.",
  "winter2023_qol_teleport_time_title": "Thời gian thành phù",
  "winter2023_qol_teleport_time_desc": "Có một sự thật ít ai hay là thời gian thành phù trong Dota không cố định — và cho đến thời điểm này, hoàn toàn vô hình. Giờ bạn có thể xem trước thời gian tới nơi khi dùng thành phù.",
  "winter2023_qol_minimap_title": "Biểu tượng bản đồ nhỏ",
  "winter2023_qol_minimap_desc": "Mũi tên hay biểu tượng tướng — cái nào cũng tuyệt. <i>\"Nhưng sao phải chọn?\"</i> bạn chất vấn trời xanh. Giờ không phải chọn nữa đâu. Bởi vì — Dota hé lộ bí mật — bầu trời là ông bụt.",
  "winter2023_qol_ability_shape_indicator_title": "Thêm tâm ngắm cho kỹ năng",
  "winter2023_qol_ability_shape_indicador_desc": "\"<i>Sao một số kỹ năng của con lại thiếu tâm ngắm?\"</i> Bạn chất vấn trời xanh. Úm ba la! Xin giới thiệu thêm nhiều kỹ năng hiển thị chính xác khu vực tác động.",
  "winter2023_qol_ability_icons_title": "Trạng thái biểu tượng kỹ năng",
  "winter2023_qol_ability_icons_desc": "Dù là nội tại bị phá bởi Silver Edge, hay bị trói và không thể blink đi, giờ bạn sẽ biết ngay khi kỹ năng bị vô hiệu nhờ tính năng trạng thái biểu tượng kỹ năng mới ra lò.",
  "winter2023_qol_item_tooltips_title": "Mẹo công cụ vật phẩm tốt hơn",
  "winter2023_qol_item_tooltips_desc": "Để có được thông tin chọn mục tiêu của trang bị, bạn thường phải cất công đi đến thư viện, rồi cãi nhau với một thủ thư đầy bối rối. Còn bây giờ loại mục tiêu, loại sát thương, khả năng hóa giải cùng các thông tin khác đều có trong mẹo công cụ.",
  "winter2023_qol_xp_range_title": "Báo hiệu cự ly XP",
  "winter2023_qol_xp_range_desc": "XP có ở khắp quanh ta, chỉ chờ bạn nhận về, nhưng biết phải tìm chúng ở đâu đây. Giờ thì bạn có thể, chỉ cần di chuột lên cấp độ tướng của mình. Không cần ấn ALT làm gì!",
  "winter2023_qol_wisdom_rune_timer_title": "Đồng hồ Rune tri thức với Dota+",
  "winter2023_qol_wisdom_rune_timer_desc": "Dù tận tụy với trí tuệ nhưng rune tri thức trước đây hơi dốt trong việc báo hiệu thời gian xuất hiện. May thay nó đã thông minh hơn và sau cùng cũng chọn mua một chiếc đồng hồ.",
  "winter2023_qol_creep_bounties_title": "Thưởng giết quái",
  "winter2023_qol_creep_bounties_desc": "<i>\"Sao con không thể xem thưởng giết quái là bao nhiêu, từ trong rừng lẫn ra đường?\"</i> bạn chất vấn trời xanh. \"Vậy à?\" ông bụt trời xanh đáp. \"Nếu là ta, ta sẽ xin thêm điều ước. Dù thế nào đi nữa, cầu được ước thấy. Hẹn con ở Frostivus kỳ sau\".",
  "winter2023_qol_misc_title": "...Và các cải tiến giao diện khác",
  "winter2023_qol_misc_desc": "Có hàng tấn thông tin cần hấp thu trong Dota, và chúng tôi đã cải thiện nhiều yếu tố giao diện để trợ giúp. Nhấp chuột phải vào trang bị trong túi đồ sẽ hiện nổi bật món đã chọn, bằng cách làm tối đi các món khác. Không sợ bán hay làm bỏ nhầm trang bị xuống đất nữa. Trang bị phổ biến giờ chỉ hiện viền xám khi bạn có đủ tiền để mua chúng. Thế là không còn nhầm lẫn về phân biệt đường viền. Còn nữa, máu tốn và mana để dùng trang bị sẽ được ẩn đi khi nằm trong ba lô. Cuối cùng, vào chế độ Thử tướng, bạn sẽ xuất hiện xa khỏi các trụ để thêm không gian thử nghiệm mọi thứ mình muốn.",
  "winter2023_profileshowcase_section_title": "Quầy trưng bày hồ sơ",
  "winter2023_profileshowcase_introduction": "Thêm nhiều cách để biểu đạt bản thân hơn bao giờ hết",
  "winter2023_profileshowcase_animations_title": "Cử động",
  "winter2023_profileshowcase_animations_desc": "Chán vì tướng của bạn chỉ biết đứng yên một chỗ? Giờ có thể chọn hành động để họ biểu diễn rồi đấy.",
  "winter2023_profileshowcase_anchoring_title": "Gắn vào tướng",
  "winter2023_profileshowcase_anchoring_desc": "Giờ bạn có thể gắn các yếu tố khác của hồ sơ vào mô hình tướng, rồi xem chúng di chuyển theo từng cử động của tướng.",
  "winter2023_profileshowcase_freezeframes_title": "Khóa khung hình",
  "winter2023_profileshowcase_freezeframes_desc": "Khóa bất kỳ khung hình nào trong một cử động để lưu lại khoảnh khắc khó đỡ vô cùng hoàn hảo đó.",
  "winter2023_profileshowcase_gridsnapping_title": "Bám vào ô ly",
  "winter2023_profileshowcase_gridsnapping_desc": "Bạn đang sắp xếp bằng đôi mắt kém cỏi của con người và \"cảm giác\" của bản thân? Sao không dùng SnapGridTron™ để cho mọi thứ thật hoàn hảo?",
  "winter2023_profileshowcase_improved_portraits_title": "Cải thiện chân dung",
  "winter2023_profileshowcase_improved_portraits_desc": "Chọn giữa phiên bản chân dung 3D hoặc 2D cho tướng mình yêu thích. Khoe huy hiệu cấp độ tướng và ấn tích của bạn.",
  "winter2023_profileshowcase_more_items_title": "Thêm nhiều mô hình",
  "winter2023_profileshowcase_more_items_desc": "Quái triệu hồi, mắt, khiêu khích, thú cưng, vật phẩm tiêu biểu... và bất cứ thứ gì bạn muốn đều nhét được vào hồ sơ.",
  "winter2023_armory_section_title": "Kho đồ",
  "winter2023_armory_introduction": "Thêm nhiều cải thiện cho kho đồ của bạn",
  "winter2023_armory_grouping_title": "Cải thiện gộp nhóm",
  "winter2023_armory_grouping_desc": "Tất cả vật phẩm giờ có thể được nhóm theo tên tướng. ",
  "winter2023_armory_filters_tags_title": "Bộ lọc và nhãn tái xuất giang hồ",
  "winter2023_armory_filters_tags_desc": "Bộ lọc sử dụng từ khóa tìm kiếm và cho ra kết quả với các tiêu chí tìm kiếm được xác định trước.",
  "winter2023_armory_stickers_title": "Tìm hình dán",
  "winter2023_armory_stickers_desc": "Xem hình dán mình không sở hữu, và thậm chí tìm xem các hình dán từng có trước đây.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Bộ vật phẩm cao cấp mới, nhiệm vụ và phần thưởng bang hội",
  "winter2023_dotaplus_premium_sets_title": "Bộ vật phẩm cao cấp mới",
  "winter2023_dotaplus_premium_sets_desc": "Mùa Dota Plus này cho ra mắt ba bộ vật phẩm cao cấp mới với giá bán 150k pha lê mỗi bộ trong cửa hàng pha lê.",
  "winter2023_dotaplus_seasonal_quests_title": "Làm mới nhiệm vụ mùa",
  "winter2023_dotaplus_seasonal_quests_desc": "Thêm nhiều cách để tích trữ pha lê.",
  "winter2023_dotaplus_guild_rewards_title": "Cập nhật thưởng bang hội",
  "winter2023_dotaplus_guild_rewards_desc": "Như thường lệ, biểu tượng cảm xúc, sơn xịt và vòng tán gẫu mới cho các bang hội điểm số cao.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Silent Wight",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silver Squall",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo and Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (mở khóa luôn cả Persona)",
  "frosty_treasure_treasure_name_5": "Frosty the Sew-Man",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Jingle Fist",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "The Abominable Snowbeast",
  "frosty_treasure_hero_name_8": "Crystal Maiden (mở khóa luôn cả Persona)",
  "frosty_treasure_treasure_name_8": "Guardian Snow Angel",
  "frosty_treasure_hero_name_9": "Wraith King (mở khóa luôn cả Arcana)",
  "frosty_treasure_treasure_name_9": "Đức vua Kringle",
  "frosty_treasure_hero_name_10": "Thú vận chuyển",
  "frosty_treasure_treasure_name_10": "Baby Roshan Bánh gừng",
  "winter2023_gameplay_section_title": "Cập nhật lối chơi",
  "winter2023_patchnotes_new_items_title": "Vật phẩm mới và cập nhật trong trò chơi",
  "winter2023_patchnotes_new_items_introduction": "Dường như vẫn còn một món quà trong túi của Đức vua Kringle, và với quyền hành của bậc quân vương, có lẽ ngài đây giành nó bằng cách đánh nhau chí tử với một nhóc tì. Trường kiếm vung lên và — vâng, ngài đã chiếm được món quà bằng giao đấu! Đấy là phần thưởng tu bổ lại vật phẩm Dota— một số món hoàn toàn mới, một số thì quá thân quen.",
  "winter2023_patchnotes_section_title": "Ghi chú cập nhật 7.35",
  "winter2023_recipe": "Công thức:"
}