// 9632.js

{
  "language": "czech",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Kosmetické předměty, herní aktualizace 7.35, tři nové prémiové sety a tuna užitečných novinek. Svátky jsou oficiálně tady!",
  "winter2023_subtitle_short": "Sváteční předměty, herní aktualizace a tuna užitečných novinek",
  "winter2023_section_introduction": "To byly časy, když Frostivus něco <i>znamenal</i>. Žádné hlouposti o přátelích, rodině nebo pocitech – znamenal <i>hory dárků</i>. Jenže pak se materialismus jednoho dne vytratil a všichni měli najednou plná ústa pokory a pomoci potřebným. Půjdeme tedy příkladem a letos uspořádáme SKUTEČNÝ Frostivus. Ten plný dárků a kosmetických předmětů!",
  "winter2023_frostivus_section_title": "Tematická truhla",
  "winter2023_frostivus_section_date": "14. pro. 2023 – 11. led. 2024",
  "winter2023_frostivus_section_introduction": "Vyhrávejte zápasy a naplňujte svůj ukazatel sváteční nálady – jedině tak získáte zamčenou truhlu PLUS náhodný dáreček v podobě spreje, emotikonu nebo samolepky.",
  "winter2023_frostivus_earn_chests": "Získávejte truhly",
  "winter2023_frostivus_how_to_earn_chests": "Vždy když naplníte svůj ukazatel sváteční nálady, prolétne Vaším pokojem duch Frostivusu a zanechá za sebou truhlu Frostivus 2023 Treasure Chest.",
  "winter2023_frostivus_buy_keys": "Odemykejte truhly",
  "winter2023_frostivus_how_to_buy_keys": "K odemčení truhly si musíte zakoupit klíč, ale věřte, že kouzlo ukryté uvnitř za tu malou investici stojí.",
  "winter2023_naughty_or_nice_section_title": "Byli jste...",
  "winter2023_naughty_or_nice_naughty": "Zlobiví?",
  "winter2023_naughty_or_nice_naughty_desc": "Nemá cenu lhát, Zimní král moc dobře ví. Dvakrát zkontroloval Vaše skóre chování a už k Vám letí se svým banovacím kladivem, které vyhubí smurfovací účty všech zlobivých kluků a holek a uvalí penalizaci na jejich související hlavní účty.",
  "winter2023_naughty_or_nice_nice": "Nebo hodní?",
  "winter2023_naughty_or_nice_nice_desc": "Dodržovali jste letos při hraní Doty všechna pravidla? Výtečně! Pro Vás má Zimní král <i>jinačí</i> kladivo! Ještě neslavte, <i>stejně Vás s ním bací</i>. Ale až se probudíte v nemocnici, napadne Vás, jestli to nebyl sen. A na stolku vedle uvidíte <i>dárek gratis</i>! Co v něm asi tak bude? Rozbalte ho a podle svého skóre chování poznáte...",
  "winter2023_naughty_or_nice_nice_desc2": "Je Vaše skóre chování dostatečně sváteční? Výborně! Pro Vás má Zimní král <i>jinačí</i> kladivo! Ještě neslavte, stejně Vás s ním bací. Ale až se probudíte v nemocnici, napadne Vás, jestli to nebyl sen. A vedle Vašeho polštáře jeden <i>klíč k truhle</i>!",
  "winter2023_frostivus_section_event_title": "Frostivus 2023 Treasure Chest",
  "winter2023_frostivus_section_event_introduction": "Zbrusu nové sety pro oblíbené hrdiny, pár duchů svátků minulých, a dokonce i speciální návštěva Arcany pro Wraith Kinga a persony pro Crystal Maiden.",
  "winter2023_bonus_item_title": "Čas (velmi vzácného) obdarování",
  "winter2023_bonus_item_desc": "Je to zázrak Frostivusu! Vždy když získáte z truhly set, budete mít <i>také</i> šanci na získání bonusové Unusual verze jednoho z předmětů <i>tohoto</i> setu! Ale jak už to se zázraky bývá, ona šance je někde na úrovni toho, že Vám spadne na hlavu meteorit. Aneb s přípravou místa ve zbrojnici nechvátejte.",
  "winter2023_bonus_item_fullset": "Celý set",
  "winter2023_bonus_item_unusual": "Unusual verze",
  "winter2023_stocking_stuffer_title": "Dárečky navíc",
  "winter2023_stocking_stuffer_desc": "Pokud Vás krutá matematická realita předchozího odstavce uvrhla do deprese, neboť s největší pravděpodobností žádný dárek navíc nedostanete, máme pro Vás dobrou zprávu! Dárková hlídka <i>garantuje</i>, že vždy když naplníte svůj ukazatel sváteční nálady, do okna Vám hodí jeden z následujících dárečků.",
  "winter2023_stocking_stuffer_sprays_stickers": "Spreje a samolepky",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Ačkoli nové spreje zmizí společně s koncem Frostivusu, v něčem jsme Vás poslechli – samolepky zůstanou navždy. Tak si je nalepte třeba na čelo!",
  "winter2023_stocking_stuffer_emoticons": "Emotikony",
  "winter2023_stocking_stuffer_emoticons_desc": "Než Marie Curie vynalezla emotikony, nikdo nevěděl, jak vyjadřovat své emoce. Tímto děkujeme za její sebeobětování (protože prototypy byly vysoce radioaktivní).",
  "winter2023_stocking_stuffer_ward": "Frosty the North Ward",
  "winter2023_stocking_stuffer_ward_desc": "Tajná dárková informace: Věděli jste, že tenhle prťavý sněhulák je mocnější než OBA Ancienti? Jeho <i>skromnost</i> mu ale brání se tím chvástat.",
  "winter2023_stocking_stuffer_courier": "Serac and Floe",
  "winter2023_stocking_stuffer_courier_desc": "No nejsou ti tulení bratři k sežrání? To mimochodem neříkáme jen tak, opravdu je můžete sníst a udělat si na zimu zásoby masa a tuku. Když Vám to svědomí dovolí...",
  "winter2023_frostivus_festive_items_title": "Sváteční vybavení",
  "winter2023_frostivus_party_hats": "Zimní čapky",
  "winter2023_frostivus_party_hats_description": "Zimní čapky s bambulí! Zdarma pro každého! Nemáte hlavu? Žádný problém! Máte příliš mnoho hlav? Ale kdeže, čapek tu máme hned několik kamionů a jsme připraveni je nasadit na vše, co alespoň vzdáleně připomíná hlavu.",
  "winter2023_frostivus_free_event_items": "(Ne)omezené schopnosti",
  "winter2023_frostivus_free_event_items_description": "V dřívějších letech byly omezené schopnosti... inu omezené. Letos jich však můžete použít, kolik chcete! Berte to jako dárek. Nebo spíš jako půjčku, protože až skončí Frostivus, dárková hlídka si je do poslední zase vyzvedne.",
  "winter2023_frostivus_high_fives": "Plácnutí",
  "winter2023_frostivus_high_fives_description": "Na rozdíl od plácnutí, kterými neustále obtěžujete své přátele a příbuzné, jsou ta zimní přesněji řečeno ťuknutími hrnky horké čokolády. Stejně už Vás musely bolet dlaně, tak jim dejte přes svátky volno.",
  "winter2023_frostivus_section_treasure_title": "Frostivus 2023 Treasure Chest",
  "winter2023_clientupdate_section_title": "Aktualizace klienta",
  "winter2023_clientupdate_introduction": "A tím máme rozbalené všechny dárky. Přejeme Vám šťastný Frostivus, jeďte opatrně a uvidíme se za rok... TAK MOMENT! Pod stromečkem ještě <i>něco</i> zůstalo!",
  "winter2023_qol_section_title": "Užitečné novinky",
  "winter2023_qol_introduction": "Lepší informace utváří lepší rozhodnutí",
  "winter2023_qol_tower_range_indicator_title": "Ukazatel dosahu věží",
  "winter2023_qol_tower_range_indicator_desc": "Už Vás unavuje žít v nevědomosti ohledně toho, na co důležitého (tzn. Vás) ta která věž míří? Díky vylepšeným efektům snáze určíte, kdy mlátit, a kdy naopak vzít nohy na ramena.",
  "winter2023_qol_teleport_time_title": "Prodleva teleportování",
  "winter2023_qol_teleport_time_desc": "Jen skuteční profíci vědí, že doba vyvolávání teleportu je proměnlivá. A nezjistitelná. Respektive byla – dnes můžete ještě před vyvoláváním vidět, jak dlouho bude trvat.",
  "winter2023_qol_minimap_title": "Ikony na minimapě",
  "winter2023_qol_minimap_desc": "Šipky, nebo ikonky hrdinů – obojí je na minimapě super, tak <i>proč si člověk musí vybrat?</i> Bývávalo. Teď Vás totiž slyšel džin v lahvi vaječňáku a ikonám přidal směrové šipky.",
  "winter2023_qol_ability_shape_indicator_title": "Další ukazatele rozsahu",
  "winter2023_qol_ability_shape_indicador_desc": "Po úspěchu s ikonkami zkoušíte štěstí se zvoláním, <i>proč některé schopnosti nemají ukazatele rozsahu?</i> A vida, fungovalo to a džin rozšířil seznam podporovaných schopností.",
  "winter2023_qol_ability_icons_title": "Stavy ikon schopností",
  "winter2023_qol_ability_icons_desc": "Ať už jsou Vaše pasivní schopnosti zlomeny předmětem Silver Edge, nebo jste zakořeněni a nemůžete blinknout, nově to díky stavům ikon schopností poznáte na první pohled.",
  "winter2023_qol_item_tooltips_title": "Lepší popisy předmětů",
  "winter2023_qol_item_tooltips_desc": "Když jste dříve hledali podrobnosti o předmětu, museli jste zajít do knihovny. Na žádost zmatených knihovníků jsme však info o průraznosti, odstranitelnosti a všem dalším přidali přímo do popisu.",
  "winter2023_qol_xp_range_title": "Ukazatel rozsahu zkušeností",
  "winter2023_qol_xp_range_desc": "Zajímalo Vás někdy, z jaké vzdálenosti můžete parazitovat na cizích, těžce vydřených zkušenostech? Nyní to zjistíte po najetí myší na úroveň hrdiny i bez nutnosti držet ALT.",
  "winter2023_qol_wisdom_rune_timer_title": "Odpočet run vědomostí",
  "winter2023_qol_wisdom_rune_timer_desc": "Runy vědomostí byly navzdory svému jménu poměrně hloupé, alespoň co se odpočtu do objevení týče. Zdá se ale, že minimálně členům programu Dota Plus svítá na lepší časy.",
  "winter2023_qol_creep_bounties_title": "Odměny za zabití creepů",
  "winter2023_qol_creep_bounties_desc": "<i>Proč není vidět, kolik zlaťáků vypadne ze zabitého creepa?</i> „Vážně?“ zeptá se vaječňákový džin překvapeně. „Já bych si býval do třetice řekl o víc přání, ale jak chcete. Tak zase za rok.“",
  "winter2023_qol_misc_title": "A další vylepšení ukazatelů na obrazovce",
  "winter2023_qol_misc_desc": "V Dotě je nutné mít přehled o nespočtu různých informací, což nebylo vždy snadné. Zkusili jsme s tím něco udělat, takže například po kliknutí na předmět v inventáři pravým tlačítkem myši nově dojde ke ztmavení ostatních předmětů. Dál jsme zajistili, že populární předměty jsou šedě obtaženy, pouze když si je můžete dovolit. Předměty odložené v batohu už neukazují ani spotřebu many, ani spotřebu zdraví. A konečně, při zkoušení hrdinů jste nově vysazeni daleko od věží, abyste měli na své pokusy dostatek volného prostoru.",
  "winter2023_profileshowcase_section_title": "Přehlídka profilu",
  "winter2023_profileshowcase_introduction": "Ještě více možností, jak vystoupit z davu",
  "winter2023_profileshowcase_animations_title": "Animace",
  "winter2023_profileshowcase_animations_desc": "Omrzelo Vás, jak hrdinové na profilu jen tak stojí? Vyberte jim nějakou animaci a rozhýbejte je!",
  "winter2023_profileshowcase_anchoring_title": "Ukotvování k hrdinům",
  "winter2023_profileshowcase_anchoring_desc": "Nově lze ukotvit ostatní prvky profilu k modelům hrdinů a dát je také do pohybu.",
  "winter2023_profileshowcase_freezeframes_title": "Snímky animací",
  "winter2023_profileshowcase_freezeframes_desc": "Zastavte animaci na libovolném snímku a zachyťte ten nejlepší (nebo nejdivnější) moment.",
  "winter2023_profileshowcase_gridsnapping_title": "Přichycování k mřížce",
  "winter2023_profileshowcase_gridsnapping_desc": "Chápeme, že ne každý má tak dokonalé oči jako my, a proto jsme vytrénovali umělou inteligenci PřichytoMřížkoTron 3 000™.",
  "winter2023_profileshowcase_improved_portraits_title": "Vylepšené portréty",
  "winter2023_profileshowcase_improved_portraits_desc": "Vyberte si mezi 3D, nebo 2D verzí portrétu hrdiny a pochlubte se zároveň odznakem hodnosti tohoto hrdiny i jeho relikviemi.",
  "winter2023_profileshowcase_more_items_title": "Více modelů",
  "winter2023_profileshowcase_more_items_desc": "Vyvolané jednotky, wardy, taunty, pety, vybrané předměty. To vše a mnohem více si teď můžete nacpat na profil!",
  "winter2023_armory_section_title": "Zbrojnice",
  "winter2023_armory_introduction": "Další vylepšení inventáře",
  "winter2023_armory_grouping_title": "Lepší seskupování",
  "winter2023_armory_grouping_desc": "Všechny předměty lze nově seskupit dle jména hrdiny.",
  "winter2023_armory_filters_tags_title": "Návrat filtrů a značek",
  "winter2023_armory_filters_tags_desc": "Filtrujte obsah zbrojnice podle klíčových výrazů a vytvářejte zobrazení s předdefinovanými kritérii.",
  "winter2023_armory_stickers_title": "Vyhledávání samolepek",
  "winter2023_armory_stickers_desc": "Prohlížejte si samolepky, které nemáte, nebo omrkněte ty, které už ani nejdou sehnat.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Nové prémiové sety, úkoly a odměny pro guildy",
  "winter2023_dotaplus_premium_sets_title": "Nové prémiové sety",
  "winter2023_dotaplus_premium_sets_desc": "Tato sezóna programu Dota Plus přináší tři nové prémiové sety, které jsou dostupné v plusovém obchodu, každý za 150 000 střepů.",
  "winter2023_dotaplus_seasonal_quests_title": "Obnovení sezónních úkolů",
  "winter2023_dotaplus_seasonal_quests_desc": "V souvislosti s novými sety Vám pochopitelně nabízíme příležitosti, jak si na ně vydělat.",
  "winter2023_dotaplus_guild_rewards_title": "Aktualizované odměny pro guildy",
  "winter2023_dotaplus_guild_rewards_desc": "A jako vždy, nová sezóna se rovná novým emotikonům, sprejům a zvukům chatovacího kolečka pro nejschopnější guildy.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Silent Wight",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silver Squall",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo and Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (včetně persony)",
  "frosty_treasure_treasure_name_5": "Frosty the Sew-Man",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Jingle Fist",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "Abominable Snowbeast",
  "frosty_treasure_hero_name_8": "Crystal Maiden (včetně persony)",
  "frosty_treasure_treasure_name_8": "Guardian Snow Angel",
  "frosty_treasure_hero_name_9": "Wraith King (včetně Arcany)",
  "frosty_treasure_treasure_name_9": "King Kringle",
  "frosty_treasure_hero_name_10": "Kurýr",
  "frosty_treasure_treasure_name_10": "Gingerbread Baby Roshan",
  "winter2023_gameplay_section_title": "Herní aktualizace",
  "winter2023_patchnotes_new_items_title": "Nové a aktualizované předměty",
  "winter2023_patchnotes_new_items_introduction": "Hle, úplně vzadu pod stromkem se schovával jeden poslední dárek, a jak je tradicí, o takový dárek se musíte utkat se Zimním králem. Naštěstí ten dárek podle své tvrdosti obsahuje hromádku nových a přepracovaných herních předmětů, takže si nějaký rychle vyberte a vzhůru do boje o zbytek.",
  "winter2023_patchnotes_section_title": "Herní aktualizace 7.35"
}