// 5881.js

{
  "language": "spanish",
  "winter2023_title": "Fiesta de la Escarcha 2023",
  "winter2023_subtitle": "Decóralo todo con cosméticos festivos, el parche de jugabilidad 7.35, tres sets Premium de Dota Plus y un montón de mejoras del cliente",
  "winter2023_subtitle_short": "Cosméticos festivos, parche de jugabilidad y un montón de mejoras del cliente",
  "winter2023_section_introduction": "La Fiesta de la Escarcha solía tener un <i>significado<i>. No se trataba de tus amigos ni de tu familia ni de tus sentimientos. Se trataba de <i>conseguir lo que fuera</i>. Pero, en algún momento, todo ese materialismo se evaporó de las fiestas y, de repente, a todo el mundo le dio por la tontería de la generosidad. Así que este año hemos recuperado el VERDADERO significado de la Fiesta de la Escarcha: los objetos cosméticos.",
  "winter2023_frostivus_section_title": "Cofres del Tesoro de la Fiesta de la Escarcha",
  "winter2023_frostivus_section_date": "Del 14 de diciembre de 2023 al 11 de enero de 2024",
  "winter2023_frostivus_section_introduction": "Gana partidas para llenar el contador del Espíritu de la Fiesta de la Escarcha y conseguir un Cofre del Tesoro de la Fiesta de la Escarcha cerrado Y un regalito al azar (desde espráis a emoticonos o pegatinas).",
  "winter2023_frostivus_earn_chests": "Consigue cofres",
  "winter2023_frostivus_how_to_earn_chests": "Cada vez que llenes el contador del Espíritu de la Fiesta de la Escarcha, el espíritu te embargará en forma de Cofre cerrado del Tesoro de la Fiesta de la Escarcha 2023.",
  "winter2023_frostivus_buy_keys": "Compra llaves",
  "winter2023_frostivus_how_to_buy_keys": "Compra llaves para abrir cofres y descubre el verdadero significado de los tesoros que esconden.",
  "winter2023_naughty_or_nice_section_title": "Te has portado...",
  "winter2023_naughty_or_nice_naughty": "¿Mal?",
  "winter2023_naughty_or_nice_naughty_desc": "Da igual lo que digas. Kringle King lo sabe todo. Ha revisado y requeterrevisado tu puntuación de comportamiento, y viene listo para pulverizar a golpe de bloqueo las cuentas de <i>smurf</i> de todos los niños y niñas malos, antes de repartir penalizaciones entre las cuentas principales correspondientes.",
  "winter2023_naughty_or_nice_nice": "¿O bien?",
  "winter2023_naughty_or_nice_nice_desc": "¿Jugaste a Dota este año sin saltarte las normas? ¡Perfecto! Kringle King tiene una sorpresa <i>diferente</i> para ti. No te equivoques, <i>te va a dar un buen golpe igualmente</i>, pero cuando te despiertes en el hospital... ¿Fue todo un sueño? ¿Qué tienes al lado en la almohada? ¡Un <i>Regalo gratis de la Fiesta de la Escarcha</i>! ¿Qué conseguiste con tu puntuación de comportamiento? Abre el regalo para verlo...",
  "winter2023_naughty_or_nice_nice_desc2": "¿Tienes una puntuación de comportamiento próspera y feliz? ¡Perfecto! Kringle King tiene una sorpresa <i>diferente</i> para ti. No te equivoques, te va a dar un buen golpe igualmente, pero cuando te despiertes en el hospital... ¿Fue todo un sueño? ¿Qué tengo al lado en la almohada? ¡Una <i>Llave gratis de la Fiesta de la Escarcha</i>!",
  "winter2023_frostivus_section_event_title": "Tesoros de la Fiesta de la Escarcha 2023",
  "winter2023_frostivus_section_event_introduction": "Sets de objetos completamente nuevos para tus héroes preferidos, además de la vuelta de algunos favoritos de las fiestas ¡e incluso una visita del Arcano de Wraith King y del personaje de Crystal Maiden!",
  "winter2023_bonus_item_title": "Es época de regalar (de vez en cuando)",
  "winter2023_bonus_item_desc": "¡Es un milagro de la Fiesta de la Escarcha! Cada vez que abras un set, <i>también</i> tendrás la posibilidad de desbloquear una variante inusual de uno de los artículos <i>de</i> ese set. Y, como suele pasar con los milagros, las probabilidades de que eso llegue a pasar son bastante nulas, así que no le hagas sitio todavía en la armería.",
  "winter2023_bonus_item_fullset": "Set completo",
  "winter2023_bonus_item_unusual": "Variante inusual",
  "winter2023_stocking_stuffer_title": "Otros regalitos",
  "winter2023_stocking_stuffer_desc": "Si la cruda realidad del párrafo anterior te ha dejado sin muchas esperanzas de conseguir ningún otro regalo que un regalo normal, ¡prepárate! La Patrulla Premiadora de la Fiesta de la Escarcha <i>siempre</i> pasará por tu casa para dejarte alguno de los fantásticos regalos siguientes cada vez que llenes el contador del Espíritu de la Fiesta de la Escarcha.",
  "winter2023_stocking_stuffer_sprays_stickers": "Espráis y pegatinas",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Estos espráis nuevos solo están disponibles durante la Fiesta de la Escarcha, pero queremos atender vuestras plegarias, y las pegatinas son para siempre. Pegadlas por todos vuestros perfiles.",
  "winter2023_stocking_stuffer_emoticons": "Emoticonos",
  "winter2023_stocking_stuffer_emoticons_desc": "Hasta que Marie Curie inventó los emoticonos, nadie podía expresar sus emociones. Dota rinde homenaje a su sacrificio, ya que los primeros eran muy radioactivos.",
  "winter2023_stocking_stuffer_ward": "Frosty, el Centinela Polar",
  "winter2023_stocking_stuffer_ward_desc": "Historia secreta de regalo: este pequeño muñeco de nieve es en realidad más poderoso que AMBOS Ancestros, pero nadie lo sospecha. ¿Por qué? Porque es <i>discreto</i>.",
  "winter2023_stocking_stuffer_courier": "Mensajero Foca",
  "winter2023_stocking_stuffer_courier_desc": "Por favor, mira qué mono es. Y encima es comestible, con bastante carne y grasa si te encuentras en una situación desesperada.",
  "winter2023_frostivus_festive_items_title": "Objetos festivos",
  "winter2023_frostivus_party_hats": "Sombreros de la Fiesta de la Escarcha",
  "winter2023_frostivus_party_hats_description": "¡Tenemos sombreros de la Fiesta de la Escarcha para todos! ¿Que no tienes cabeza? ¡No pasa nada! ¿Que tienes demasiadas cabezas? ¡Siempre vienen bien! La Patrulla Premiadora de la Fiesta de la Escarcha viene con el camión de sombreros a rebosar para repartirlos a todo aquello que se asemeje lo más mínimo a una cabeza.",
  "winter2023_frostivus_free_event_items": "Regalos",
  "winter2023_frostivus_free_event_items_description": "En anteriores Fiestas de la Escarcha, los consumibles tenían cargas limitadas, ¡pero este año puedes usar todas las que quieras! De regalo. Bueno, más bien, a modo de préstamo. La Patrulla Premiadora de la Fiesta de la Escarcha volverá a recogerlos todos al final del evento.",
  "winter2023_frostivus_high_fives": "Choca esos cinco",
  "winter2023_frostivus_high_fives_description": "A diferencia de cómo saludas habitualmente a tus familiares y amigos, los saludos de la Fiesta de la Escarcha son como brindar por las fiestas con un chocolate calentito. A decir verdad, tanto tu familia como tus amigos se merecen un descanso de tanto saludo efusivo de todas formas.",
  "winter2023_frostivus_section_treasure_title": "Tesoros de la Fiesta de la Escarcha 2023",
  "winter2023_clientupdate_section_title": "Actualizaciones del cliente",
  "winter2023_clientupdate_introduction": "Bueno, pues el gran Kringle King ha terminado de repartir sus regalos un año más. Feliz Fiesta de la Escarcha a todos, conducid con cuidado y ¡UN MOMENTO! ¡Hay algo <i>más</i> en el fondo del saco!",
  "winter2023_qol_section_title": "Calidad de vida",
  "winter2023_qol_introduction": "Mejor información para tomar mejores decisiones",
  "winter2023_qol_tower_range_indicator_title": "Indicador del alcance de las torres",
  "winter2023_qol_tower_range_indicator_desc": "¿Estás hasta las narices de no saber si el objetivo de una torre es algo importante (tu héroe, por ejemplo)? Hemos mejorado los efectos para que veas más fácilmente si puedes acercarte o es hora de salir corriendo.",
  "winter2023_qol_teleport_time_title": "Tiempo de Teletransporte",
  "winter2023_qol_teleport_time_desc": "No todo el mundo sabe que los tiempos del teletransporte en Dota varían y, hasta ahora, no se podían ver. Pero ya puedes saber cuánto vas a tardar antes de usar el Pergamino de Teletransporte.",
  "winter2023_qol_minimap_title": "Iconos del minimapa",
  "winter2023_qol_minimap_desc": "Tanto las flechas como los iconos de héroe están muy bien. <i>«¿Por qué tengo que elegir?»</i>, clamaban algunos al cielo. Bueno, ya no hace falta que elijas, porque (como cuenta la leyenda de Dota) el cielo es como el genio de la lámpara que concede deseos.",
  "winter2023_qol_ability_shape_indicator_title": "Más retículas de habilidades",
  "winter2023_qol_ability_shape_indicador_desc": "<i>«¿Por qué faltan las retículas de ciertas habilidades?»</i>, clamaban algunos al cielo. ¡Y pumba! Ya hay aún más habilidades que muestran de forma precisa el área de efecto.",
  "winter2023_qol_ability_icons_title": "Estados de las habilidades",
  "winter2023_qol_ability_icons_desc": "Tanto si la Hoja Plateada ha incapacitado tus habilidades pasivas como si estás inmovilizado/a y no puedes usar la traslación, con los nuevos estados de los iconos de las habilidades, podrás ver enseguida las habilidades que están desactivadas.",
  "winter2023_qol_item_tooltips_title": "Descripciones emergentes",
  "winter2023_qol_item_tooltips_desc": "Para conseguir información sobre los objetivos de los objetos, casi había que ir a la biblioteca y pelearse con el bibliotecario que no entendía nada, pero ahora, las descripciones emergentes indican el tipo de objetivo, el tipo de daño, la disipabilidad y mucho más.",
  "winter2023_qol_xp_range_title": "Indicador del rango de EXP",
  "winter2023_qol_xp_range_desc": "Hay EXP por todas partes para el disfrute de los aprovechados. El caso es saber dónde está. Pero ahora ya puedes saberlo con solo pasar el ratón por el nivel de tu héroe. ¡Sin necesidad de pulsar «ALT»!",
  "winter2023_qol_wisdom_rune_timer_title": "Temporizador de la Runa de Sabiduría de Dota Plus",
  "winter2023_qol_wisdom_rune_timer_desc": "Para ser una runa dedicada a la sabiduría, la Runa de Sabiduría era bastante torpe a la hora de mostrar el tiempo de reaparición, pero parece que ha entrado en razón y se ha comprado un reloj.",
  "winter2023_qol_creep_bounties_title": "Recompensas de creeps",
  "winter2023_qol_creep_bounties_desc": "<i>«¿Por qué no puedo ver cuánto obtengo de recompensa por cada creep, tanto en las sendas como en los campamentos?»</i>, clamaban algunos al cielo. «¿En serio?», dijo el genio. «Yo habría pedido más deseos, pero vale, concedido. Hasta la próxima Fiesta de la Escarcha».",
  "winter2023_qol_misc_title": "... Y otras mejoras del HUD",
  "winter2023_qol_misc_desc": "Hay muchísima información que asimilar en Dota y, para que sea más fácil, hemos realizado varias mejoras en el HUD. Al hacer clic con el botón derecho en los objetos del inventario, ahora se resalta el objeto seleccionado y se oscurecen los demás. No vuelvas a soltar ni vender el objeto equivocado. Los objetos populares ahora solo tienen el borde gris cuando tienes suficiente oro para comprarlos. Se acabaron las confusiones con los diferentes bordes. Además, los costes de vida de los objetos se ocultan junto con el maná cuando los objetos están en la mochila. Por último, al entrar en el modo de prueba de héroe, ahora apareces lejos de las torres para que tengas suficiente espacio para probar todo lo que quieras.",
  "winter2023_profileshowcase_section_title": "Expositor del perfil",
  "winter2023_profileshowcase_introduction": "Más formas de expresarte que nunca",
  "winter2023_profileshowcase_animations_title": "Animaciones",
  "winter2023_profileshowcase_animations_desc": "¿Te aburre ver a tu héroe sin hacer nada? Ahora puedes elegir una secuencia de animación para que se mueva un poco.",
  "winter2023_profileshowcase_anchoring_title": "Anclaje en héroes",
  "winter2023_profileshowcase_anchoring_desc": "Ahora puedes anclar otros elementos del perfil en los modelos de los héroes y ver cómo se mueven con la animación.",
  "winter2023_profileshowcase_freezeframes_title": "Congelación de fotogramas",
  "winter2023_profileshowcase_freezeframes_desc": "Congela cualquier fotograma de una animación para capturar ese momento incómodo perfecto.",
  "winter2023_profileshowcase_gridsnapping_title": "Ajuste de cuadrícula",
  "winter2023_profileshowcase_gridsnapping_desc": "¿Para qué usar la intuición y esos dichosos ojos normales cuando el Super Ajuste de Cuadrícula (™) puede ahorrarte todo el trabajo?",
  "winter2023_profileshowcase_improved_portraits_title": "Retratos mejorados",
  "winter2023_profileshowcase_improved_portraits_desc": "Elige el modelo en 3D o el retrato en 2D de tus héroes favoritos y presume de tu insignia de nivel de héroe e incluso de tus reliquias.",
  "winter2023_profileshowcase_more_items_title": "Más modelos",
  "winter2023_profileshowcase_more_items_desc": "Invocaciones, guardianes, burlas, mascotas, objetos destacados... Puedes meter en tu perfil todo lo que quieras.",
  "winter2023_armory_section_title": "Armería",
  "winter2023_armory_introduction": "Otras mejoras del inventario",
  "winter2023_armory_grouping_title": "Agrupación mejorada",
  "winter2023_armory_grouping_desc": "Todos los artículos se pueden agrupar ahora por héroe. ",
  "winter2023_armory_filters_tags_title": "Vuelven los filtros y las etiquetas",
  "winter2023_armory_filters_tags_desc": "Filtra los artículos mediante la búsqueda de palabras clave y crea vistas con criterios de búsqueda predefinidos.",
  "winter2023_armory_stickers_title": "Búsqueda de pegatinas",
  "winter2023_armory_stickers_desc": "Mira qué pegatinas te faltan e incluso repasa las que estuvieron disponibles anteriormente.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Nuevos sets Premium, misiones y recompensas de clan",
  "winter2023_dotaplus_premium_sets_title": "Nuevos sets Premium",
  "winter2023_dotaplus_premium_sets_desc": "Esta temporada de Dota Plus trae tres nuevos sets Premium que puedes comprar en la tienda de fragmentos por 150 000 fragmentos cada uno.",
  "winter2023_dotaplus_seasonal_quests_title": "Renovación de las misiones estacionales",
  "winter2023_dotaplus_seasonal_quests_desc": "Más formas de aumentar tu reserva de fragmentos.",
  "winter2023_dotaplus_guild_rewards_title": "Recompensas de clan actualizadas",
  "winter2023_dotaplus_guild_rewards_desc": "Como siempre, están disponibles nuevos emoticonos, espráis y ruedas de chat para los clanes con puntuaciones altas.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Nieve Ancestral",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Ráfaga Plateada",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo y Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Equinoccio de la Bola de Cristal",
  "frosty_treasure_hero_name_5": "Pudge (desbloqueo de personaje incluido)",
  "frosty_treasure_treasure_name_5": "Frosty, el Muñeco de Trapo",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Puño Festivo",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "La Abominable Bestia de las Nieves",
  "frosty_treasure_hero_name_8": "Crystal Maiden (desbloqueo de personaje incluido)",
  "frosty_treasure_treasure_name_8": "Ángel Guardián de las Nieves",
  "frosty_treasure_hero_name_9": "Wraith King (desbloqueo de arcano incluido)",
  "frosty_treasure_treasure_name_9": "Kringle King",
  "frosty_treasure_hero_name_10": "Mensajero",
  "frosty_treasure_treasure_name_10": "Roshan Bebé de Jengibre",
  "winter2023_gameplay_section_title": "Actualizaciones del juego",
  "winter2023_patchnotes_new_items_title": "Objetos dentro del juego nuevos y actualizados",
  "winter2023_patchnotes_new_items_introduction": "Parece que queda un regalo en el saco de Kringle King y, como está en su derecho, es posible que luche a muerte contra cualquier niño para quedárselo. Ataca con su espada de hoja larga y... ¡sí, se hace con el regalo a través del combate! Es una recompensa de artículos de Dota renovados, algunos nueovs y otros favoritos de siempre.",
  "winter2023_patchnotes_section_title": "Notas del parche 7.35",
  "winter2023_recipe": "Receta:"
}