// 1665.js

{
  "language": "thai",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "แต่งห้องโถงสุดเย็นยะเยือกของคุณด้วยชุดตกแต่งฉลองเทศกาล, แพตช์เกมเพลย์ 7.35, ชุดเซ็ต Dota Plus พรีเมียม 3 ชุด และคุณสมบัติปรับปรุงเสริมความสะดวกมากมาย",
  "winter2023_subtitle_short": "ชุดตกแต่งฉลองเทศกาล แพตช์เกมเพลย์ และคุณสมบัติปรับปรุงเสริมความสะดวกมากมาย",
  "winter2023_section_introduction": "Frostivus เคย<i>มีความหมาย</i>เกี่ยวกับอะไรบางอย่าง ซึ่งก็ไม่ได้เกี่ยวกับเพื่อน ครอบครัว หรือความรู้สึกของคุณ แต่เป็น<i>การได้รับข้าวของต่าง ๆ นานา</i> แต่เมื่อถึงจุดหนึ่งแล้ว ความเป็นวัตถุนิยมทั้งหมดก็ปลิดปลิวออกไปจากเทศกาล และหัวใจโง่งั่งของทุกคนก็ดันสะพรั่งไปด้วยจิตวิญญาณของการเป็นผู้ให้กันไปหมด ดังนั้นในปีนี้เราจะมาสืบค้นความหมายที่แท้จริงของ Frostivus กันอีกครั้ง นั่นก็คือ ของตกแต่งและเครื่องแต่งกาย",
  "winter2023_frostivus_section_title": "หีบสมบัติ Frostivus",
  "winter2023_frostivus_section_date": "14 ธ.ค. 2023 - 11 ม.ค. 2024",
  "winter2023_frostivus_section_introduction": "ชนะแมตช์เพื่อเติมมาตรวัดพลัง Frostivus ของคุณ แล้วรับสมบัติ Frostivus ที่ล็อคอยู่ 1 หีบ และสารพันของขวัญแบบสุ่ม 1 ชิ้น ซึ่งมีตั้งแต่สเปรย์ อีโมติคอน ไปจนถึงสติกเกอร์",
  "winter2023_frostivus_earn_chests": "รับหีบสมบัติ",
  "winter2023_frostivus_how_to_earn_chests": "ทุกครั้งที่คุณเติมมาตรวัดพลัง Frostivus สำเร็จ พลังแห่ง Frostivus จะไหลแผ่ซ่านไปทั่วร่างคุณในรูปแบบหีบสมบัติ Frostivus 2023 ที่ถูกล็อคไว้",
  "winter2023_frostivus_buy_keys": "ซื้อกุญแจ",
  "winter2023_frostivus_how_to_buy_keys": "ซื้อกุญแจเพื่อปลดล็อคหีบและค้นพบความหมายที่แท้จริงของสมบัติภายใน",
  "winter2023_naughty_or_nice_section_title": "ที่ผ่านมานั้นเจ้าเป็น...",
  "winter2023_naughty_or_nice_naughty": "เด็กดื้อ?",
  "winter2023_naughty_or_nice_naughty_desc": "ไม่มีทางหนีได้เลย ราชาซานตาจิตป่วนรู้ทุกอย่าง เขาได้ตรวจคะแนนความประพฤติของคุณไปสองรอบ และเขาก็มาพร้อมกับค้อนเตรียมหวดแบนบัญชีสเมิร์ฟเด็กดื้อทั้งหมดให้สูญสิ้น จากนั้นมอบบทลงโทษต่อบัญชีหลักที่เกี่ยวข้อง",
  "winter2023_naughty_or_nice_nice": "หรือเด็กดี?",
  "winter2023_naughty_or_nice_nice_desc": "คุณเล่น Dota ในปีนี้โดยไม่ได้แหกกฎอะไรใช่ไหม? เยี่ยมไปเลย! ราชาซานตาจิตป่วนมีค้อน<i>อีกแบบ</i>สำหรับคุณ! ไม่ต้องกลัว เพราะว่าเขาจะ<i>หวดค้อนใส่คุณเช่นกัน</i> แต่เมื่อคุณตื่นขึ้นมาในโรงพยาบาลแล้ว... ทั้งหมดเป็นความฝันหรือเปล่าเนี่ย? แล้วนี่มีอะไรข้าง ๆ บนหมอนของฉัน? ว้าว <i>ของขวัญ Frostivus ฟรี 1 ชิ้น</i>! คะแนนความประพฤติของคุณจะทำให้ได้รับอะไรกันนะ? ลองเปิดของขวัญของคุณและลุ้นดูสิ...",
  "winter2023_naughty_or_nice_nice_desc2": "คุณมีคะแนนความประพฤติชวนให้สุขสันต์ใช่ไหม? เยี่ยมไปเลย! ราชาซานตาจิตป่วนมีค้อน<i>อีกแบบ</i>สำหรับคุณ! ไม่ต้องกลัว เพราะว่าเขาจะหวดค้อนใส่คุณเช่นกัน แต่เมื่อคุณตื่นขึ้นมาในโรงพยาบาลแล้ว... ทั้งหมดเป็นความฝันหรือเปล่าเนี่ย? แล้วนี่มีอะไรข้าง ๆ บนหมอนของฉัน? ว้าว <i>กุญแจ Frostivus ฟรี 1 ดอก!</i>",
  "winter2023_frostivus_section_event_title": "สมบัติ Frostivus 2023",
  "winter2023_frostivus_section_event_introduction": "ชุดเซ็ตไอเท็มใหม่ล่าสุดสำหรับฮีโร่ที่ทุกคนชื่นชอบ พร้อมกับการกลับมาของชุดโปรดช่วงเทศกาล และมีแม้กระทั่งการมาเยือนของ Arcana ของ Wraith King และรูปลักษณ์ของ Crystal Maiden!",
  "winter2023_bonus_item_title": "เทศกาลแห่งการให้ (แบบนาน ๆ ครั้ง)",
  "winter2023_bonus_item_desc": "ปาฏิหาริย์วัน Frostivus! ทุกครั้งที่คุณแกะชุดเซ็ต คุณยังมีโอกาส<i>เพิ่มเติม</i>ที่จะปลดล็อครูปแบบโบนัสพิเศษของหนึ่งในไอเท็ม<i>ใน</i>เซ็ตนั้น! และเช่นเดียวกับปาฏิหาริย์อื่น ๆ โอกาสที่คุณจะคว้ามาได้นั้นค่อนข้างใกล้เคียงกับการโดนดาวตกหล่นทับ ดังนั้นอย่าเพิ่งเคลียร์พื้นที่ในคลังแสงของคุณสำหรับรอรับไอเท็มขนาดนั้น",
  "winter2023_bonus_item_fullset": "ชุดทั้งเซ็ต",
  "winter2023_bonus_item_unusual": "รูปแบบพิเศษ",
  "winter2023_stocking_stuffer_title": "สารพันของขวัญ",
  "winter2023_stocking_stuffer_desc": "หากความเป็นจริงตามหลักสถิติอันแสนโหดร้ายในย่อหน้าที่ผ่านมาทำให้คุณรู้สึกหม่นหมองเกี่ยวกับโอกาสที่จะได้รับของขวัญเพิ่มเติมนอกเหนือจากของขวัญปกติแล้วละก็ อย่าได้เศร้าไป! ขบวนของขวัญ Frostivus <i>รับประกัน</i>ว่าจะมาหยุดที่หน้าบ้านคุณทุกครั้งที่คุณเติมมาตรวัดพลัง Frostivus สำเร็จ ด้วยหนึ่งในของขวัญอันยอดเยี่ยมดังต่อไปนี้",
  "winter2023_stocking_stuffer_sprays_stickers": "สเปรย์และสติกเกอร์",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "สเปรย์ใหม่เหล่านี้จะอยู่ในช่วง Frostivus เท่านั้น แต่เมื่อคุณขอมา เราก็จัดให้ เวอร์ชันสติกเกอร์จะอยู่ได้อย่างถาวร แปะให้เต็มโปรไฟล์ของคุณกันไปเลย",
  "winter2023_stocking_stuffer_emoticons": "อีโมติคอน",
  "winter2023_stocking_stuffer_emoticons_desc": "ก่อนที่มารี กูรีจะคิดค้นอีโมติคอนขึ้นมาได้ ไม่มีใครสามารถแสดงอารมณ์ได้เลย Dota ขอยกย่องความเสียสละของเธอ เนื่องจากอีโมติคอนยุคแรกมีกัมมันตภาพรังสีสูงมาก",
  "winter2023_stocking_stuffer_ward": "Ward \"Frosty the North\"",
  "winter2023_stocking_stuffer_ward_desc": "ข้อมูลตำนานเกมลับเฉพาะ: มนุษย์หิมะตัวจ้อยนี้แท้จริงแล้วมีพลังยิ่งใหญ่กว่า Ancient ทั้งสองอีก แต่คุณก็ไม่มีวันทราบได้ ทำไมน่ะหรือ? เพราะว่าเขา<i>ถ่อมตัว</i>ไง",
  "winter2023_stocking_stuffer_courier": "Seal Courier",
  "winter2023_stocking_stuffer_courier_desc": "ดูสิว่าน้องตัวนี้น่ารักขนาดไหน? แถมน้องยังกินได้ด้วย น้องมีเนื้อหนังมากมายหากคุณต้องตกอยู่ในสถานการณ์ประมาณว่าติดเกาะร้าง",
  "winter2023_frostivus_festive_items_title": "ไอเท็มฉลองเทศกาล",
  "winter2023_frostivus_party_hats": "หมวก Frostivus",
  "winter2023_frostivus_party_hats_description": "เรามีหมวก Frostivus ให้กับทุกคน! ไม่มีหัวเหรอ? ไม่มีปัญหา! มีหัวมากเกินไป? ไม่มีเยอะเกินหรอก! ขบวนของขวัญ Frostivus พร้อมถอยรถบรรทุกหมวกและยกรถเทใส่ทุกสิ่งอย่างที่มีรูปลักษณะคล้ายหัว",
  "winter2023_frostivus_free_event_items": "ของแจกฟรี",
  "winter2023_frostivus_free_event_items_description": "ในเทศกาล Frostivus ก่อนหน้านี้ ของใช้จะมีจำนวนชาร์จจำกัด แต่ในปีนี้ คุณสามารถใช้ได้ไม่อั้น! เรามอบให้เป็นของขวัญ แต่ก็นะ เอาที่จริงเหมือนกับให้กู้ยืมมากกว่า เพราะขบวนของขวัญ Frostivus จะวกกลับมาทวงของคืนเมื่อสิ้นสุดกิจกรรม",
  "winter2023_frostivus_high_fives": "ไฮไฟฟ์",
  "winter2023_frostivus_high_fives_description": "ไฮไฟฟ์ของ Frostivus แตกต่างจากไฮไฟฟ์ที่คุณมอบให้กับเพื่อนและครอบครัวของคุณอยู่เสมอทั่วไป แต่เป็นเหมือนกับการชนแก้วช็อกโกแลตร้อนฉลองเทศกาลกันมากกว่า หากให้เราบอกตามตรง เพื่อนและครอบครัวของคุณก็คงกำลังคิดว่าคุณควรหยุดพักจากการไฮไฟฟ์มากมายนั่นได้แล้ว",
  "winter2023_frostivus_section_treasure_title": "สมบัติ Frostivus 2023",
  "winter2023_clientupdate_section_title": "อัปเดตไคลเอนต์",
  "winter2023_clientupdate_introduction": "ราชาซานตาจิตป่วนผู้แสนดีได้แจกของขวัญทั้งหมดของเขาครบไปอีกปีแล้ว ขอให้ทุกคนสุขสันต์กับเทศกาล Frostivus ขับรถกลับบ้านปลอดภัย แต่ช้าก่อน! มีอะไรอยู่ที่ก้นกระสอบของขวัญ<i>อีก</i>กันเนี่ย!",
  "winter2023_qol_section_title": "การปรับปรุงเสริมความสะดวก",
  "winter2023_qol_introduction": "ข้อมูลที่ดีกว่าเพื่อการตัดสินใจที่ดีขึ้น",
  "winter2023_qol_tower_range_indicator_title": "เส้นบอกระยะโจมตีป้อมปราการ",
  "winter2023_qol_tower_range_indicator_desc": "เบื่อหน่ายกับการที่มิอาจรู้ว่าป้อมกำลังโจมตีเป้าหมายสำคัญ (นั่นคือคุณ) ใช่ไหม? เอฟเฟกต์ปรับปรุงใหม่จะทำให้เห็นได้ชัดเจนยิ่งขึ้นว่าปลอดภัยที่จะบุกเข้าไปในป้อมหรือถึงเวลาเผ่น",
  "winter2023_qol_teleport_time_title": "เวลาเทเลพอร์ต",
  "winter2023_qol_teleport_time_desc": "ผู้คนอาจไม่ค่อยทราบกันว่าเวลาเทเลพอร์ตใน Dota นั้นเปลี่ยนแปลงได้จากหลายปัจจัย และก่อนหน้านี้ก็ไม่แสดงให้เห็นว่าใช้เวลาเท่าไหร่ แต่ตอนนี้คุณจะสามารถตรวจสอบเวลาเดินทางก่อนใช้ Town Portal Scroll ของคุณได้แล้ว",
  "winter2023_qol_minimap_title": "ไอคอนแผนที่ย่อ",
  "winter2023_qol_minimap_desc": "ไม่ว่าจะเป็นลูกศรหรือไอคอนฮีโร่ ต่างก็ดีทั้งคู่ <i>\"แล้วทำไมฉันต้องเลือกด้วยล่ะ?\"</i> คุณร้องโวยวายใส่ท้องฟ้า แต่หลังจากนี้คุณไม่ต้องเลือกอีกต่อไป เพราะว่าตามตำนานใหม่ล่าสุดของเกม Dota แล้ว ท้องฟ้าเป็นจินนี่ให้ขอพรได้ด้วย",
  "winter2023_qol_ability_shape_indicator_title": "เส้นแสดงสกิลเพิ่มเติม",
  "winter2023_qol_ability_shape_indicador_desc": "<i>\"ทำไมสกิลของฉันบางสกิลไม่มีเส้นแสดงพื้นที่ด้วย?\"</i> คุณร้องโวยวายใส่ท้องฟ้า ปิ๊ง! ขอนำเสนอสกิลมากกว่าเดิมที่แสดงพื้นที่อย่างแม่นยำ",
  "winter2023_qol_ability_icons_title": "สถานะไอคอนสกิล",
  "winter2023_qol_ability_icons_desc": "ไม่ว่าสกิลติดตัวของคุณจะถูกปิดการทำงานโดย Silver Edge หรือว่าคุณติดรากแล้วไม่สามารถ Blink ออกได้ ต่อจากนี้คุณจะสามารถมองเห็นได้ทันทีว่าสกิลถูกปิดการทำงานอยู่หรือไม่ด้วยสถานะไอคอนสกิลใหม่ของเรา",
  "winter2023_qol_item_tooltips_title": "รายละเอียดไอเท็มที่ดีกว่าเดิม",
  "winter2023_qol_item_tooltips_desc": "ปกติแล้ว กว่าจะได้ข้อมูลเป้าหมายเกี่ยวกับไอเท็ม คุณจะต้องขับรถทางไกลไปยังห้องสมุด แล้วก็ต้องต่อความยาวสาวความยืดกับบรรณารักษ์ที่มีสีหน้าสับสน ตอนนี้ประเภทเป้าหมาย ประเภทความเสียหาย ความสามารถในการลบล้าง และอื่น ๆ ล้วนอยู่ในรายละเอียดไอเท็มแล้ว",
  "winter2023_qol_xp_range_title": "ตัวบอกระยะ XP",
  "winter2023_qol_xp_range_desc": "XP อยู่รอบตัวเรา มีไว้ให้ดูดซับรับเก็บไว้ หากเพียงแค่คุณรู้ว่าจะหาเจอได้ที่ไหนเท่านั้นแหละ แต่ตอนนี้คุณรู้ได้ไม่ยาก แค่ชี้ไปบนเลเวลฮีโร่ของคุณก็พอ ไม่ต้องกดปุ่ม ALT ให้เมื่อย!",
  "winter2023_qol_wisdom_rune_timer_title": "ตัวบอกเวลารูน Wisdom สำหรับ Dota+",
  "winter2023_qol_wisdom_rune_timer_desc": "แม้ว่ารูน Wisdom จะขึ้นชื่อว่าเป็นรูนแห่งปัญญา แต่เมื่อพูดถึงการแสดงเวลาเกิดแล้วก็ไม่ค่อยมีปัญญาสักเท่าไหร่ แต่ตอนนี้รูนก็ได้ประเทืองปัญญาขึ้นและซื้อนาฬิกามาเรียบร้อยแล้ว",
  "winter2023_qol_creep_bounties_title": "ค่าหัวครีป",
  "winter2023_qol_creep_bounties_desc": "<i>\"ทำไมฉันไม่สามารถเห็นจำนวนค่าหัวของครีปแต่ละตัวได้ด้วย? ทั้งครีปในเลนและในแคมป์เลย\"</i> คุณร้องโวยวายใส่ท้องฟ้า \"เอาจริงดิ?\" ท้องฟ้าประทานพรตอบ \"ถ้าเป็นข้าจะขอให้ได้พรหลายข้อมากกว่านี้นะ แต่ก็เถอะ เราจัดให้ แล้วเจอกันใน Frostivus ครั้งถัดไปนะบาย\"",
  "winter2023_qol_misc_title": "...และการปรับปรุงอื่น ๆ เกี่ยวกับ HUD",
  "winter2023_qol_misc_desc": "Dota มีข้อมูลมากมายมหาศาล เราจึงได้ปรับปรุง HUD ไว้หลายด้านเพื่อช่วยให้เรียนรู้ได้ง่ายขึ้น ตอนนี้หากคุณคลิกขวาที่ไอเท็มในช่องเก็บของ ก็จะเห็นไอเท็มที่คุณเลือกได้ชัดเจนขึ้นเพราะไอเท็มอื่นจะมืดคล้ำลง ไม่มีทางที่จะดรอปหรือขายไอเท็มผิดอีกต่อไป ตอนนี้ไอเท็มยอดนิยมจะมีขอบสีเทาเฉพาะเมื่อคุณมีโกลด์มากพอที่จะซื้อได้เท่านั้น ไม่ต้องสับสนกับกรอบที่แตกต่างกันอีกแล้ว อีกทั้ง จำนวนพลังชีวิตที่สูญเสียสำหรับไอเท็มจะซ่อนไปพร้อมกับจำนวนมานาเมื่ออยู่ในกระเป๋าของคุณ ข้อสุดท้าย เมื่อเข้าโหมดลองฮีโร่ต่อจากนี้ฮีโร่จะเกิดห่างจากป้อม ทำให้คุณสามารถมีพื้นที่กว้างขวางสำหรับทดลองทุกอย่างได้ตามต้องการ",
  "winter2023_profileshowcase_section_title": "หน้าแสดงผลงานบนโปรไฟล์",
  "winter2023_profileshowcase_introduction": "แสดงความเป็นตัวตนของคุณได้หลากหลายวิธีมากกว่าเดิม",
  "winter2023_profileshowcase_animations_title": "แอนิเมชัน",
  "winter2023_profileshowcase_animations_desc": "เบื่อกับการที่ฮีโร่ของคุณยืนจุมปุ๊กอยู่เฉย ๆ ใช่ไหม? ตอนนี้คุณสามารถเลือกท่าแอนิเมชันให้ฮีโร่ขยับได้แล้ว",
  "winter2023_profileshowcase_anchoring_title": "ยึดติดไปกับฮีโร่",
  "winter2023_profileshowcase_anchoring_desc": "ตอนนี้คุณสามารถยึดองค์ประกอบโปรไฟล์อื่น ๆ ไว้บนโมเดลฮีโร่เพื่อให้เคลื่อนไหวไปพร้อมกับแอนิเมชันได้",
  "winter2023_profileshowcase_freezeframes_title": "หยุดเฟรม",
  "winter2023_profileshowcase_freezeframes_desc": "หยุดแอนิเมชันในเฟรมใดก็ได้เพื่อให้เห็นเป็นจังหวะน่าประหลาดมากที่สุด",
  "winter2023_profileshowcase_gridsnapping_title": "จัดเข้ากริด",
  "winter2023_profileshowcase_gridsnapping_desc": "ยังนั่งเล็งจัดสิ่งของต่าง ๆ ด้วยตาโง่ ๆ ของคุณกับ \"สัญชาตญาณ\" อยู่งั้นหรือ? ทำไมไม่ลองใช้ ระบบจัดเข้ากริดอัตโนมัติ™ ช่วยจัดให้คุณได้อย่างสมบูรณ์แบบล่ะ?",
  "winter2023_profileshowcase_improved_portraits_title": "ภาพฮีโร่ปรับปรุงใหม่",
  "winter2023_profileshowcase_improved_portraits_desc": "เลือกภาพฮีโร่โปรดของคุณระหว่างเวอร์ชันโมเดล 3 มิติหรือรูป 2 มิติ แสดงระดับตราสัญลักษณ์ฮีโร่ของคุณจนไปถึงตรามณีของคุณ",
  "winter2023_profileshowcase_more_items_title": "โมเดลเพิ่มเติม",
  "winter2023_profileshowcase_more_items_desc": "ยูนิตอัญเชิญ Ward ท่าเยาะเย้ย สัตว์เลี้ยง ไฮไลต์ไอเท็ม... ทุกอย่างที่คาดฝัน สามารถยัดลงโปรไฟล์ของคุณได้ทั้งหมด",
  "winter2023_armory_section_title": "คลังแสง",
  "winter2023_armory_introduction": "การปรับปรุงเพิ่มเติมในกับช่องเก็บของของคุณ",
  "winter2023_armory_grouping_title": "ปรับปรุงการจัดกลุ่ม",
  "winter2023_armory_grouping_desc": "ต่อจากนี้ไอเท็มทั้งหมดสามารถจัดกลุ่มตามชื่อฮีโร่ได้ ",
  "winter2023_armory_filters_tags_title": "ตัวกรองและแท็กกลับมาแล้ว",
  "winter2023_armory_filters_tags_desc": "กรองโดยใช้คำค้นหาและสร้างมุมมองต่าง ๆ ด้วยเกณฑ์การค้นหาที่กำหนดไว้",
  "winter2023_armory_stickers_title": "ค้นหาสติกเกอร์",
  "winter2023_armory_stickers_desc": "ดูสติกเกอร์ที่คุณยังไม่มี และเปิดหาสติกเกอร์ที่เคยมีอยู่ก่อนหน้านี้",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "ชุดเซ็ตพรีเมียม ภารกิจ และรางวัลกิลด์ใหม่",
  "winter2023_dotaplus_premium_sets_title": "ชุดเซ็ตพรีเมียมใหม่",
  "winter2023_dotaplus_premium_sets_desc": "Dota Plus ฤดูกาลนี้เปิดตัวชุดพรีเมียมใหม่ 3 ชุด มีให้ซื้อในร้านค้าเศษมณี สนนราคา 150,000 เศษมณีต่อชุด",
  "winter2023_dotaplus_seasonal_quests_title": "ปรับเปลี่ยนภารกิจประจำฤดูกาล",
  "winter2023_dotaplus_seasonal_quests_desc": "วิธีเพิ่มเติมสำหรับเสริมคลังเศษมณีของคุณ",
  "winter2023_dotaplus_guild_rewards_title": "อัปเดตรางวัลกิลด์",
  "winter2023_dotaplus_guild_rewards_desc": "อีโมติคอน สเปรย์ และวงล้อสนทนาใหม่ ๆ พร้อมให้ใช้งานสำหรับกิลด์ที่ทำคะแนนสูงเช่นเคย",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Silent Wight",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silver Squall",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo and Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (มาพร้อมกับไอเท็มปลดล็อครูปลักษณ์)",
  "frosty_treasure_treasure_name_5": "Frosty the Sew-Man",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Jingle Fist",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "The Abominable Snowbeast",
  "frosty_treasure_hero_name_8": "Crystal Maiden (มาพร้อมกับไอเท็มปลดล็อครูปลักษณ์)",
  "frosty_treasure_treasure_name_8": "Guardian Snow Angel",
  "frosty_treasure_hero_name_9": "Wraith King (มาพร้อมกับไอเท็มปลดล็อค Arcana)",
  "frosty_treasure_treasure_name_9": "ราชาซานตาจิตป่วน",
  "frosty_treasure_hero_name_10": "Courier",
  "frosty_treasure_treasure_name_10": "Gingerbread Baby Roshan",
  "winter2023_gameplay_section_title": "อัปเดตเกมเพลย์",
  "winter2023_patchnotes_new_items_title": "ไอเท็มในเกมใหม่และอัปเดตไอเท็ม",
  "winter2023_patchnotes_new_items_introduction": "ดูเหมือนว่ามีของขวัญชิ้นหนึ่งเหลืออยู่ในกระสอบของราชาซานตาจิตป่วน และตามสิทธิของเขาแล้ว เขาจะสามารถรับของขวัญได้ด้วยการต่อสู้กับเด็กน้อยจนถึงตาย เขากวัดแกว่งดาบยาวและก็... เรียบร้อย ของขวัญได้กลายเป็นของเขาจากการต่อสู้! ซึ่งก็เป็นไอเท็ม Dota ที่ปรับใหม่มากมาย บางชิ้นเป็นไอเท็มใหม่ ควบคู่ไปกับบางไอเท็มที่เป็นของโปรดดั้งเดิม",
  "winter2023_patchnotes_section_title": "รายละเอียดแพตช์ 7.35",
  "winter2023_recipe": "สูตรผสม:"
}