// 3468.js

{
  "language": "polish",
  "winter2023_title": "Mroźny Festiwal 2023",
  "winter2023_subtitle": "Przyozdób swą mizerną, cichą, stajenkę lichą świątecznymi przedmiotami ozdobnymi, aktualizacją rozgrywki 7.35, trzema zestawami premium Dota Plus i mnóstwem funkcji klienta ulepszających jakość rozgrywki",
  "winter2023_subtitle_short": "Świąteczne przedmioty ozdobne, łatka rozgrywki i mnóstwo funkcji klienta zwiększających jakość rozgrywki",
  "winter2023_section_introduction": "Niegdyś Mroźny Festiwal <i>coś znaczył</i>. Nie chodziło w nim o twoich przyjaciół, rodzinę, czy twoje uczucia. Chodziło o <i>dostawanie rzeczy</i>. Ale w pewnym momencie cały ten materializm uleciał ze święta i nagle głupie serca wszystkich pękały od ducha szczodrości. Zatem w tym roku na nowo odkryliśmy PRAWDZIWY sens Mroźnego festiwalu: przedmioty ozdobne.",
  "winter2023_frostivus_section_title": "Skrzynia Skarbu Mroźnego Festiwalu",
  "winter2023_frostivus_section_date": "14 grudnia 2023 – 11 stycznia 2024",
  "winter2023_frostivus_section_introduction": "Wygrywaj mecze, aby zapełnić wskaźnik Ducha Mroźnego Festiwalu i zdobyć zamkniętą Skrzynię Skarbów Mroźnego Festiwalu ORAZ losowy upominek pod choinkę, począwszy od sprayów, a na emotikonach i naklejkach skończywszy.",
  "winter2023_frostivus_earn_chests": "Zdobywaj skrzynie",
  "winter2023_frostivus_how_to_earn_chests": "Za każdym razem, gdy zapełnisz swój wskaźnik Ducha Mroźnego Festiwalu, to przeniknie cię on w formie zamkniętej Skrzyni Skarbu Mroźnego Festiwalu 2023.",
  "winter2023_frostivus_buy_keys": "Kupuj klucze",
  "winter2023_frostivus_how_to_buy_keys": "Kupuj klucze, by otworzyć skrzynie i odkryć prawdziwe znaczenie znajdujących się w nich skarbów.",
  "winter2023_naughty_or_nice_section_title": "Czy byłeś...",
  "winter2023_naughty_or_nice_naughty": "Niegrzeczny?",
  "winter2023_naughty_or_nice_naughty_desc": "Nie sposób zaprzeczyć – Mikołajowy Król wszystko wie. Po dwukroć sprawdził twoją ocenę zachowania i nadciąga ze swoim młotem do banów, by zdematerializować konta do smerfowania należące do wszystkich niegrzecznych chłopców i dziewcząt. Co dalej? Rozdanie kar powiązanym z nimi głównym kontom.",
  "winter2023_naughty_or_nice_nice": "Czy grzeczny?",
  "winter2023_naughty_or_nice_nice_desc": "Grałeś przez ten rok w Dota bez łamania zasad? Świetnie! Mikołajowy Król ma dla ciebie <i>inny</i> młot! Nie miej złudzeń, bo <i>wciąż nim oberwiesz</i>. A gdy przebudzisz się w szpitalnej sali – czy to wszystko ci się przyśniło? Co to takiego koło ciebie na poduszce? <i>Darmowy prezent Mroźnego Festiwalu</i>! Co przyniosła ci twoja ocena zachowania? Otwórz swój podarunek i zobacz sam...",
  "winter2023_naughty_or_nice_nice_desc2": "Masz wesołą ocenę zachowania? Świetnie! Mikołajowy Król ma dla ciebie <i>inny</i> młot! Nie miej złudzeń, bo wciąż nim oberwiesz. A gdy przebudzisz się w szpitalnej sali – czy to wszystko to był sen? Co to takiego koło mnie na poduszce? <i>Darmowy klucz Mroźnego Festiwalu</i>!",
  "winter2023_frostivus_section_event_title": "Skarb Mroźnego Festiwalu 2023",
  "winter2023_frostivus_section_event_introduction": "Całkowicie nowe zestawy przedmiotów dla twoich bohaterów oraz powrót niektórych świątecznych ulubieńców – a do tego odwiedziny ze strony arkanów dla Wraith Kinga oraz persony dla Crystal Maiden!",
  "winter2023_bonus_item_title": "Czas na (bardzo sporadyczne) obdarowywanie",
  "winter2023_bonus_item_desc": "Toż to cud Mroźnego Festiwalu! Za każdym razem, gdy odpakowujesz zestaw, istnieje <i>także</i> szansa na odblokowanie dodatkowego, niezwykłego wariantu jednego z przedmiotów <i>wewnątrz</i> tego zestawu! I tak jak w przypadku większości cudów, prawdopodobieństwo wpadnięcia czegoś takiego w twoje ręce jest dość bliskie szansy, że uderzy w ciebie meteoryt, więc nie zwalniaj jeszcze miejsca w swojej zbrojowni.",
  "winter2023_bonus_item_fullset": "Pełny zestaw",
  "winter2023_bonus_item_unusual": "Niezwykły wariant",
  "winter2023_stocking_stuffer_title": "Prezenciki",
  "winter2023_stocking_stuffer_desc": "Jeśli surowa, aktuarialna rzeczywistość ostatniego akapitu wpędziła cię w depresję związaną z tym, czy w ogóle masz szansę otrzymania dodatkowego prezentu oprócz zwykłego, to się rozchmurz! Patrol Prezentów Mroźnego Festiwalu <i>na pewno</i> zatrzyma się obok twojego domu za każdym razem, gdy zapełnisz wskaźnik Ducha Mroźnego Festiwalu. Czeka na ciebie jeden ze świetnych prezentów poniżej.",
  "winter2023_stocking_stuffer_sprays_stickers": "Spraye i naklejki",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Te nowe spraye będą dostępne tylko na czas Mroźnego Festiwalu, ale słuchamy tego, co nam ludzie mówią – wersje naklejkowe pozostaną na zawsze. Wrzuć ich całą masę na swój profil.",
  "winter2023_stocking_stuffer_emoticons": "Emotikony",
  "winter2023_stocking_stuffer_emoticons_desc": "Zanim Maria Skłodowska-Curie wynalazła emotikony, nikt nie miał zdolności wyrażania emocji. Dota pragnie zasalutować jej poświęceniu, ponieważ wczesne egzemplarze były wysoce radioaktywne.",
  "winter2023_stocking_stuffer_ward": "Znak Północy Mroziak",
  "winter2023_stocking_stuffer_ward_desc": "Dodatkowe tajemne tło fabularne: ten malutki bałwan jest w rzeczywistości potężniejszy od OBYDWU Starożytnych. Ale nigdy się o tym, nie przekonasz. Dlaczego? Bo jest <i>skromny</i>.",
  "winter2023_stocking_stuffer_courier": "Foczy kurier",
  "winter2023_stocking_stuffer_courier_desc": "No spójrz tylko, jak rozkoszny jest ten maluch. Co lepsze, jest jadalny. Sporo na nim mięsa i sadła, na wypadek, gdybyś znalazł się w sytuacji podobnej do wyprawy Donnera.",
  "winter2023_frostivus_festive_items_title": "Świąteczne przedmioty",
  "winter2023_frostivus_party_hats": "Nakrycia głowy Mroźnego Festiwalu",
  "winter2023_frostivus_party_hats_description": "Mamy nakrycia głowy z Mroźnego Festiwalu dla każdego! Nie masz głowy? Nie ma problemu! Masz zbyt wiele głów? Nie ma czegoś takiego! Patrol Prezentów Mroźnego Festiwalu podjeżdża ciężarówką pełną czapek i unosi naczepę na wszystko, co chociaż trochę przypomina głowę.",
  "winter2023_frostivus_free_event_items": "Darmowe przedmioty",
  "winter2023_frostivus_free_event_items_description": "W minionych Mroźnych Festiwalach przedmioty zużywalne miały limitowaną liczbę użyć. W tym roku możesz ich używać tyle, ile chcesz! To prezent. W sumie bardziej pożyczka. Patrol Prezentów Mroźnego Festiwalu powróci, by zebrać je pod koniec wydarzenia.",
  "winter2023_frostivus_high_fives": "Piątki",
  "winter2023_frostivus_high_fives_description": "W przeciwieństwie do piątek, które zbijasz ze swoją rodziną i znajomymi, te z Mroźnego Festiwalu są bardziej niczym toasty ze świątecznej gorącej czekolady. Jak mamy być szczerzy, to twoja rodzina i znajomi sądzą, że i tak przydałaby ci się przerwa od tych wszystkich piątek.",
  "winter2023_frostivus_section_treasure_title": "Skarby Mroźnego Festiwalu 2023",
  "winter2023_clientupdate_section_title": "Aktualizacje klienta",
  "winter2023_clientupdate_introduction": "Cóż, Mikołajowy Król rozdał wszystkie prezenty na następny rok. Życzymy wszystkim wesołego Mroźnego Festiwalu i bezpiecznych podróży. Ale MOMENT! Na dnie wora jest <i>coś jeszcze</i>!",
  "winter2023_qol_section_title": "Usprawnienie elementów gry",
  "winter2023_qol_introduction": "Lepsze poinformowanie dla lepszego podejmowania decyzji",
  "winter2023_qol_tower_range_indicator_title": "Wskaźnik zasięgu wieży",
  "winter2023_qol_tower_range_indicator_desc": "Zmęczony tym, że nie wiesz, kiedy wieża obejmuje za cel coś ważnego (tj. ciebie)? Ulepszone efekty wyklarowują, kiedy można bezpiecznie wejść dalej, a kiedy czas na wycofkę.",
  "winter2023_qol_teleport_time_title": "Czas teleportacji",
  "winter2023_qol_teleport_time_desc": "Mało znanym faktem jest to, że czasy teleportacji w Dota są zmienne i, aż do teraz, niewidoczne. Ale już to nie ma zastosowania, bo możecie sprawdzić czas transportu przed użyciem zwoju teleportacji.",
  "winter2023_qol_minimap_title": "Ikony na minimapie",
  "winter2023_qol_minimap_desc": "Strzałki i ikony bohaterów. Obydwie te rzeczy są świetne. <i>„Tylko czemu muszę między nimi wybierać?”</i> – da się usłyszeć, jak krzyczysz ku niebu. No cóż, od teraz już nie musisz, ponieważ – i tu kolejna szczypta fabuły świata Dota – niebo jest dżinem spełniającym życzenia.",
  "winter2023_qol_ability_shape_indicator_title": "Więcej znaczników umiejętności",
  "winter2023_qol_ability_shape_indicador_desc": "<i>„Czemu brakuje niektórych moich znaczników?”</i> – znów krzyczysz ku niebu. Myk! Przedstawiamy jeszcze więcej umiejętności z dokładnym wyświetlaniem obszaru działania.",
  "winter2023_qol_ability_icons_title": "Stany ikon umiejętności",
  "winter2023_qol_ability_icons_desc": "Czy to twoje pasywki są złamane przez Silver Edge, czy też jesteś ukorzeniony lub nie możesz błysnąć, od teraz będziesz w stanie od razu rozpoznać, czy umiejętność jest wyłączona dzięki naszym nowym stanom ikon umiejętności.",
  "winter2023_qol_item_tooltips_title": "Lepsze opisy przedmiotów",
  "winter2023_qol_item_tooltips_desc": "Dowiadywanie się o tym, co dany przedmiot obejmuje za cel zwykle oznaczało długi wypad do biblioteki i wdawanie się w długą kłótnię ze zdezorientowanym bibliotekarzem. Od teraz typ celowania, obrażeń, możliwość rozproszenia (i wiele innych informacji) są podane w dymku z opisem.",
  "winter2023_qol_xp_range_title": "Wskaźnik zasięgu PD",
  "winter2023_qol_xp_range_desc": "Punkty doświadczenia są wszędzie wokół nas i tylko czekają, by je wyssać niczym pijawka, gdyby tylko dało się wiedzieć, gdzie je znaleźć. Od teraz da się, poprzez najechanie na poziom twojego bohatera. Nie wymaga klawisza ALT!",
  "winter2023_qol_wisdom_rune_timer_title": "Czasomierz runy mądrości Dota+",
  "winter2023_qol_wisdom_rune_timer_desc": "Jak na runę dedykowaną mądrości, to była ona całkiem głupia, jeśli chodzi o pokazywanie czasu pojawiania się jej. Wygląda na to, że trochę zmądrzała i w końcu poszła kupić zegarek.",
  "winter2023_qol_creep_bounties_title": "Nagrody za stwory",
  "winter2023_qol_creep_bounties_desc": "<i>„Czemu nie mogę zobaczyć, ile nagrody otrzymam za stwora na ścieżce i w obozach?”</i> – znów krzyczysz ku niebu. No i dżin nieba ci odpowiada: „Ty tak na serio? Ja bym spytał o więcej życzeń. No ale niech ci będzie. Do zobaczenia na kolejnym Mroźnym Festiwalu”.",
  "winter2023_qol_misc_title": "...I inne ulepszenia interfejsu",
  "winter2023_qol_misc_desc": "Dota 2 ma w sobie tonę informacji do przyswojenia i wprowadziliśmy od groma ulepszeń w interfejsie, by w tym pomóc. Kliknięcie przedmiotów w twoim ekwipunku prawym przyciskiem myszy od teraz podświetla wybrany przedmiot i przyciemnia pozostałe. Już nigdy nie upuścisz ani nie sprzedasz złego przedmiotu. Popularne przedmioty od teraz mają szarą ramkę, gdy cię na nie stać. Koniec z mylącą niejednolitością ramek. A do tego koszty zdrowia i koszty many są ukryte, gdy przedmioty są w twoim plecaku. Na sam koniec, wejście w tryb przetestowania bohatera od teraz umieszcza cię z dala od wież, więc masz sporo miejsca, by sprawdzić, co tylko zechcesz.",
  "winter2023_profileshowcase_section_title": "Gablota profilu",
  "winter2023_profileshowcase_introduction": "Więcej sposobów na wyrażenie siebie niż kiedykolwiek",
  "winter2023_profileshowcase_animations_title": "Animacje",
  "winter2023_profileshowcase_animations_desc": "Masz dość tego, że twoi bohaterowie po prostu sobie stoją? Od teraz możesz wybrać sekwencję animacji, by wprawić ich w ruch.",
  "winter2023_profileshowcase_anchoring_title": "Zakotwiczanie na bohaterach",
  "winter2023_profileshowcase_anchoring_desc": "Od teraz możesz zakotwiczyć inne elementy profilu na modelach bohaterów i patrzeć, jak poruszają się z animacją.",
  "winter2023_profileshowcase_freezeframes_title": "Stopklatki",
  "winter2023_profileshowcase_freezeframes_desc": "Zatrzymaj animację na dowolnej klatce, by uchwycić ten perfekcyjny niezręczny moment.",
  "winter2023_profileshowcase_gridsnapping_title": "Przeciąganie po siatce",
  "winter2023_profileshowcase_gridsnapping_desc": "Dopasowujesz rzeczy, używając do tego swoich głupich ludzkich oczu i tzw. instynktownych przeczuć? Dlaczego nie dasz tego idealnie zrobić SiatkoPrzeciągaTronowi™?",
  "winter2023_profileshowcase_improved_portraits_title": "Ulepszone portrety",
  "winter2023_profileshowcase_improved_portraits_desc": "Wybieraj spomiędzy swoich ulubionych bohaterów w wersjach modelu 3D lub dwuwymiarowego portretu. Pochwal się swoją odznaką poziomu bohatera, a nawet relikwiami.",
  "winter2023_profileshowcase_more_items_title": "Więcej modeli",
  "winter2023_profileshowcase_more_items_desc": "Żywiołaki, znaki, drwiny, zwierzaki, wyróżnienia przedmiotów... możesz wcisnąć do swojego profilu, co tylko chcesz.",
  "winter2023_armory_section_title": "Zbrojownia",
  "winter2023_armory_introduction": "Więcej usprawnień twojego ekwipunku",
  "winter2023_armory_grouping_title": "Ulepszone grupowanie",
  "winter2023_armory_grouping_desc": "Wszystkie przedmioty można od teraz pogrupować według imienia bohatera. ",
  "winter2023_armory_filters_tags_title": "Powrót filtrów i tagów",
  "winter2023_armory_filters_tags_desc": "Filtruj za pomocą wyszukiwania na podstawie słów kluczowych i twórz widoki z predefiniowanymi kryteriami wyszukiwania.",
  "winter2023_armory_stickers_title": "Znajdź naklejki",
  "winter2023_armory_stickers_desc": "Zobacz naklejki, których nie posiadasz, a nawet przeglądaj te, które były dostępne w przeszłości.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Nowe zestawy premium, misje i nagrody gildii",
  "winter2023_dotaplus_premium_sets_title": "Nowe zestawy premium",
  "winter2023_dotaplus_premium_sets_desc": "Ten sezon Dota Plus prezentuje trzy nowe zestawy premium dostępne w sprzedaży w sklepie odłamków za 150 000 odłamków każdy.",
  "winter2023_dotaplus_seasonal_quests_title": "Odświeżenie misji sezonowych",
  "winter2023_dotaplus_seasonal_quests_desc": "Więcej sposobów na dorzucenie do twojego składzika z odłamkami.",
  "winter2023_dotaplus_guild_rewards_title": "Zaktualizowne nagrody gildii",
  "winter2023_dotaplus_guild_rewards_desc": "Tak jak zawsze: nowe emotikony, spraye i kwestie koła czatu są dostępne dla gildii, które zdobedą wiele punktów.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Cicha Zmora",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Srebrny Szkwał",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo i Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Równonoc Kryształowej Kuli",
  "frosty_treasure_hero_name_5": "Pudge (zawiera odblokowaną personę)",
  "frosty_treasure_treasure_name_5": "Szwacz Mroziak",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Dzwoniąca Pięść",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "Wstrętna Śnieżna Bestia",
  "frosty_treasure_hero_name_8": "Crystal Maiden (zawiera odblokowaną personę)",
  "frosty_treasure_treasure_name_8": "Śnieżny Anioł Stróż",
  "frosty_treasure_hero_name_9": "Wraith King (zawiera odblokowane arkana)",
  "frosty_treasure_treasure_name_9": "Mikołajowy Król",
  "frosty_treasure_hero_name_10": "Kurier",
  "frosty_treasure_treasure_name_10": "Mały Roshan z Piernika",
  "winter2023_gameplay_section_title": "Aktualizacje rozgrywki",
  "winter2023_patchnotes_new_items_title": "Nowe i zaktualizowane przedmioty w grze",
  "winter2023_patchnotes_new_items_introduction": "Wygląda na to, że w worku Mikołajowego Króla pozostał jeszcze jeden prezent, a jego prawem jest, by odebrać go, walcząc na śmierć i życie z dziecięciem. Wywija swoim długim mieczem i zgadza się, prezent należy do niego prawem walki! To nagroda w postaci przerobionych przedmiotów Dota – niektóre są zupełnie nowe, a towarzyszy im nieco starych ulubieńców.",
  "winter2023_patchnotes_section_title": "Lista zmian aktualizacji 7.35",
  "winter2023_recipe": "Schemat:"
}