// 4402.js

{
  "language": "italian",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Accogli lo spirito festivo con oggetti cosmetici a tema, l'aggiornamento di gioco 7.35, tre set premium di Dota Plus e tantissime migliorie al client",
  "winter2023_subtitle_short": "Oggetti cosmetici festivi, un aggiornamento di gioco e varie migliorie al client",
  "winter2023_section_introduction": "Un tempo il Frostivus aveva un significato. Nulla a che fare con gli amici, la famiglia o i sentimenti, naturalmente: <i>guadagnare cose</i> era il fulcro di tutto. Ad un tratto, però, questa ricorrenza ha perso tutto lo spirito materialistico e gli stupidi cuori della gente si sono riempiti di benevolenza e generosità. Pertanto, quest'anno abbiamo riscoperto il VERO significato del Frostivus: gli oggetti cosmetici.",
  "winter2023_frostivus_section_title": "Scrigni del tesoro del Frostivus",
  "winter2023_frostivus_section_date": "Dal 14 dicembre 2023 all'11 gennaio 2024",
  "winter2023_frostivus_section_introduction": "Vinci le partite per riempire lo Spiritometro del Frostivus, ottenendo così uno scrigno chiuso del Frostivus e un regalo casuale, come spray, emoticon o adesivi.",
  "winter2023_frostivus_earn_chests": "Ottieni gli scrigni",
  "winter2023_frostivus_how_to_earn_chests": "Ogni volta che riempi lo Spiritometro, lo spirito del Frostivus si manifesterà a te sotto forma di uno scrigno chiuso del Frostivus 2023.",
  "winter2023_frostivus_buy_keys": "Acquista le chiavi",
  "winter2023_frostivus_how_to_buy_keys": "Acquista le chiavi per aprire gli scrigni e scoprire il vero significato dei tesori al loro interno.",
  "winter2023_naughty_or_nice_section_title": "Sei stato...",
  "winter2023_naughty_or_nice_naughty": "Cattivo?",
  "winter2023_naughty_or_nice_naughty_desc": "Non ha senso nasconderlo: Babbo Spettrale lo sa. Ha verificato il punteggio di condotta dei giocatori ed è in arrivo per polverizzare gli account smurf di tutti i bambini e le bambine cattive, per poi inviare una serie di penalità ai loro account principali.",
  "winter2023_naughty_or_nice_nice": "O buono?",
  "winter2023_naughty_or_nice_nice_desc": "Quest'anno hai giocato a Dota senza infrangere le regole? Ottimo! Babbo Spettrale ha in serbo qualcosa di <i>diverso</i> per te! Non fraintendere, <i>cercherà comunque di polverizzarti</i>, ma quando ti sveglierai in ospedale... Era tutto un sogno? Cosa c'è accanto al tuo cuscino? Un <i>dono gratuito del Frostivus</i>! Che cosa avrai ricevuto grazie al tuo punteggio di condotta? Apri il regalo per scoprirlo...",
  "winter2023_naughty_or_nice_nice_desc2": "Il tuo punteggio di condotta è degno dello spirito festivo? Ottimo! Babbo Spettrale ha in serbo qualcosa di <i>diverso</i> per te! Non fraintendere, cercherà comunque di polverizzarti, ma quando ti sveglierai in ospedale... Era tutto un sogno? Cosa c'è accanto al mio cuscino? Una <i>chiave gratuita del Frostivus</i>!",
  "winter2023_frostivus_section_event_title": "Tesori del Frostivus 2023",
  "winter2023_frostivus_section_event_introduction": "Nuovissimi set di oggetti per i tuoi Eroi preferiti, il ritorno di alcuni classici festivi e persino una visita dall'oggetto Arcano di Wraith King e dal personaggio di Crystal Maiden!",
  "winter2023_bonus_item_title": "La stagione dei regali (molto occasionali)",
  "winter2023_bonus_item_desc": "È un miracolo del Frostivus! Ogni volta che trovi un set in uno scrigno, avrai <i>anche</i> la possibilità di sbloccare una variante Insolita di uno degli oggetti che lo compongono! Come tutti i miracoli che si rispettino, la probabilità che questo accada è pari a quella di essere colpiti da una meteora, quindi non perdere tempo a fare spazio nell'Arsenale.",
  "winter2023_bonus_item_fullset": "Set completo",
  "winter2023_bonus_item_unusual": "Variante Insolita",
  "winter2023_stocking_stuffer_title": "Regali del Frostivus",
  "winter2023_stocking_stuffer_desc": "Se sei caduto in depressione dopo aver letto la dura realtà attuariale dell'ultimo paragrafo sulla probabilità di ricevere un regalo bonus in aggiunta a un regalo normale, aspetta di sentire questo! La Pattuglia dei Premi del Frostivus verrà a farti visita ogni volta che riempi il tuo Spiritometro, portandoti uno dei fantastici regali elencati qui sotto.",
  "winter2023_stocking_stuffer_sprays_stickers": "Spray e adesivi",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Questi nuovi spray scompariranno al termine del Frostivus ma, come da richiesta della Comunità, le versioni adesive saranno permanenti. Incollali su tutto il tuo profilo!",
  "winter2023_stocking_stuffer_emoticons": "Emoticon",
  "winter2023_stocking_stuffer_emoticons_desc": "Prima che Marie Curie inventasse le emoticon, nessuno aveva la capacità di esprimere emozioni. Considerato che i primi prototipi erano altamente radioattivi, Dota la ringrazia per il suo sacrificio.",
  "winter2023_stocking_stuffer_ward": "Frosty il Guardiano del Nord",
  "winter2023_stocking_stuffer_ward_desc": "Curiosità segreta sulla storia di Dota: questo sottodimensionato pupazzo di neve è in realtà più potente di ENTRAMBI gli Antichi messi insieme, ma non te ne accorgerai mai. Perché? Vuole rimanere <i>umile</i>.",
  "winter2023_stocking_stuffer_courier": "Corriere Foca",
  "winter2023_stocking_stuffer_courier_desc": "Non solo questo piccoletto è incredibilmente carino, ma è anche commestibile. Se mai dovessi trovarti in situazioni di emergenza, la sua carne potrà offrirti sostentamento.",
  "winter2023_frostivus_festive_items_title": "Oggetti festivi",
  "winter2023_frostivus_party_hats": "Cappelli del Frostivus",
  "winter2023_frostivus_party_hats_description": "Ci sono cappelli del Frostivus per tutti! Sei senza testa? Nessun problema! Hai troppe teste? Nessun timore! La Pattuglia dei Premi del Frostivus è in arrivo con un camion stracolmo di cappelli per qualsiasi cosa che assomigli vagamente a una testa.",
  "winter2023_frostivus_free_event_items": "Consumabili senza limiti",
  "winter2023_frostivus_free_event_items_description": "Nei Frostivus passati, i consumabili avevano utilizzi limitati. Quest'anno, invece, puoi usarne quanti ne vuoi! Consideralo un regalo da parte nostra. Beh, un prestito, più che un regalo: la Pattuglia dei Premi del Frostivus tornerà a riprenderseli alla fine dell'evento.",
  "winter2023_frostivus_high_fives": "Batti cinque",
  "winter2023_frostivus_high_fives_description": "A differenza dei noiosi batti cinque con amici e parenti, i batti cinque del Frostivus saranno un po' come brindare con una tazza fumante di cioccolata calda. Non vorremmo essere noi a dirtelo, ma i tuoi amici e parenti sono stufi di continuare a batterti il cinque.",
  "winter2023_frostivus_section_treasure_title": "Tesori del Frostivus 2023",
  "winter2023_clientupdate_section_title": "Aggiornamenti del client",
  "winter2023_clientupdate_introduction": "Ebbene sì, anche quest'anno il buon Babbo Spettrale ha consegnato tutti i suoi regali. Buon Frostivus a tutti, guidate con prudenza e... UN ATTIMO! Sembra ci sia <i>qualcos'altro</i> in fondo al suo sacco!",
  "winter2023_qol_section_title": "Miglioramenti alla qualità generale",
  "winter2023_qol_introduction": "Informazioni migliori per decisioni migliori",
  "winter2023_qol_tower_range_indicator_title": "Indicatore della gittata delle torri",
  "winter2023_qol_tower_range_indicator_desc": "Sei stanco di non sapere quando una torre sta bersagliando qualcosa di importante (te, ad esempio)? I nuovi effetti rendono più facile capire se è sicuro avanzare o se è meglio battere in ritirata.",
  "winter2023_qol_teleport_time_title": "Teletrasporti puntuali",
  "winter2023_qol_teleport_time_desc": "È un fatto poco noto che la durata dei teletrasporti su Dota può essere variabile, ma tutti sanno che fino ad ora non era visibile. Ora puoi verificare la durata del viaggio prima di usare le tue Pergamene.",
  "winter2023_qol_minimap_title": "Icone della minimappa",
  "winter2023_qol_minimap_desc": "Frecce e icone degli Eroi: entrambe sono fantastiche. <i>\"Perché devo scegliere?\"</i>, continui a urlare al cielo. Beh, ora non dovrai più farlo, perché (colpo di scena della storia di Dota) il cielo è in realtà un genio che esaudisce i desideri.",
  "winter2023_qol_ability_shape_indicator_title": "Reticoli delle abilità",
  "winter2023_qol_ability_shape_indicador_desc": "<i>\"Perché alcune abilità sono senza reticoli?\"</i>, continui a urlare al cielo. Puf! Ora l'area d'effetto di molte altre abilità viene mostrata in modo accurato.",
  "winter2023_qol_ability_icons_title": "Icone di stato delle abilità",
  "winter2023_qol_ability_icons_desc": "Che le tue abilità passive siano disabilitate dalla Lama Argentea, o che qualcuno ti abbia radicato impedendoti di usare il Baleno, le nuove icone di stato consentiranno di capire a colpo d'occhio se un'abilità è disponibile o meno.",
  "winter2023_qol_item_tooltips_title": "Descrizione degli oggetti migliorata",
  "winter2023_qol_item_tooltips_desc": "In passato, capire il tipo di bersaglio di un oggetto significava guidare nel traffico fino alla biblioteca più vicina e discutere con un bibliotecario dall'aspetto confuso. Ora il pannello informativo di ciascun oggetto indica se l'effetto può essere dissipato, il tipo di bersaglio e il tipo di danno.",
  "winter2023_qol_xp_range_title": "Raggio di guadagno dell'ESP",
  "winter2023_qol_xp_range_desc": "L'esperienza è tutt'intorno a noi, pronta per essere assimilata... se solo sapessimo dove trovarla. Ora lo sappiamo: passa il cursore del mouse sul livello del tuo Eroe. Premere ALT non è più necessario!",
  "winter2023_qol_wisdom_rune_timer_title": "Timer di Dota Plus per le Rune della Saggezza",
  "winter2023_qol_wisdom_rune_timer_desc": "Per essere una Runa dedicata alla saggezza, la Runa della Saggezza si dimostrava piuttosto stupida quando si trattava di mostrare quanto tempo mancava alla sua ricomparsa. Ora si è fatta furba e ha finalmente comprato un orologio.",
  "winter2023_qol_creep_bounties_title": "Ricompense dei creep",
  "winter2023_qol_creep_bounties_desc": "<i>\"Perché non posso visualizzare la ricompensa in oro di ciascun creep, sia nelle corsie che nei campi?\"</i>, continui a urlare al cielo. \"Ma davvero?\", ribatte il genio dei cieli. \"Io avrei chiesto altri tre desideri. Oh beh, ti accontento subito. Ci vediamo al prossimo Frostivus.\"",
  "winter2023_qol_misc_title": "...E altri miglioramenti all'interfaccia",
  "winter2023_qol_misc_desc": "Poiché Dota richiede di assimilare moltissime informazioni, abbiamo apportato diverse migliorie all'interfaccia per aiutarti in questo senso. Cliccare con il tasto destro sugli oggetti nell'inventario ora evidenzierà l'elemento selezionato ed oscurerà tutti gli altri, così da evitare di vendere o lasciare a terra l'oggetto sbagliato. Ora gli oggetti popolari mostrano un bordo grigio soltanto quando hai oro a sufficienza per acquistarli. Inoltre, le informazioni relative al costo in mana degli oggetti nello zaino verranno nascoste insieme al costo in mana. Infine, il tuo Eroe adesso nascerà lontano dalle Torri nella modalità di prova, così da lasciarti tutto lo spazio che ti serve.",
  "winter2023_profileshowcase_section_title": "Galleria del profilo",
  "winter2023_profileshowcase_introduction": "Ancora più modi per esprimere te stesso",
  "winter2023_profileshowcase_animations_title": "Animazioni",
  "winter2023_profileshowcase_animations_desc": "Sei stufo di vedere i tuoi Eroi lì impalati? Ora puoi scegliere una sequenza di animazioni per tenerli in movimento.",
  "winter2023_profileshowcase_anchoring_title": "Ancoraggio sugli Eroi",
  "winter2023_profileshowcase_anchoring_desc": "Ora puoi ancorare altri elementi del profilo sul modello degli Eroi e osservare come si muovono durante le animazioni.",
  "winter2023_profileshowcase_freezeframes_title": "Fermi immagine",
  "winter2023_profileshowcase_freezeframes_desc": "Crea un fermo immagine di una qualsiasi animazione per catturare il momento imbarazzante perfetto.",
  "winter2023_profileshowcase_gridsnapping_title": "Griglia",
  "winter2023_profileshowcase_gridsnapping_desc": "Perché cercare di allineare le cose con i tuoi stupidi occhi umani e il tuo \"infallibile\" istinto quando puoi lasciare che GrigliaTron™ si occupi di tutto?",
  "winter2023_profileshowcase_improved_portraits_title": "Ritratti migliorati",
  "winter2023_profileshowcase_improved_portraits_desc": "Scegli tra il modello 3D o la versione 2D del ritratto dei tuoi Eroi preferiti. Mostra la medaglia con il tuo livello Eroico o le Reliquie in tuo possesso.",
  "winter2023_profileshowcase_more_items_title": "Altri modelli",
  "winter2023_profileshowcase_more_items_desc": "Evocazioni, Guardiani, provocazioni, animali domestici, oggetti in evidenza... Qualsiasi cosa ti venga in mente, ora puoi aggiungerla al tuo profilo.",
  "winter2023_armory_section_title": "Arsenale",
  "winter2023_armory_introduction": "Ulteriori miglioramenti al tuo inventario",
  "winter2023_armory_grouping_title": "Nuova opzione di raggruppamento",
  "winter2023_armory_grouping_desc": "Ora tutti gli oggetti possono essere raggruppati in base al nome dell'Eroe. ",
  "winter2023_armory_filters_tags_title": "Il ritorno di etichette e filtri",
  "winter2023_armory_filters_tags_desc": "Filtra gli oggetti cercando le parole chiave e crea delle viste con criteri di ricerca predefiniti.",
  "winter2023_armory_stickers_title": "Alla ricerca degli adesivi",
  "winter2023_armory_stickers_desc": "Esplora gli adesivi che non possiedi e sfoglia quelli disponibili in precedenza.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Nuovi set premium, missioni e ricompense delle gilde",
  "winter2023_dotaplus_premium_sets_title": "Nuovi set premium",
  "winter2023_dotaplus_premium_sets_desc": "Questa stagione di Dota Plus presenta tre nuovi set premium acquistabili nel negozio dei Frammenti per 150.000 Frammenti l'uno.",
  "winter2023_dotaplus_seasonal_quests_title": "Aggiornamento stagionale delle missioni",
  "winter2023_dotaplus_seasonal_quests_desc": "Altri modi per aumentare la tua scorta di Frammenti.",
  "winter2023_dotaplus_guild_rewards_title": "Nuove ricompense delle gilde",
  "winter2023_dotaplus_guild_rewards_desc": "Come al solito, nuovi spray, emoticon e frasi della chat radiale sono disponibili per le gilde con i punteggi più alti.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "La Notte Tenebrosa",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "La Burrasca Argentea",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo e Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (personaggio incluso)",
  "frosty_treasure_treasure_name_5": "Frosty il Pupazzo di Pezza",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Il Pugno Festivo",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "L'Abominevole Bestia delle Nevi",
  "frosty_treasure_hero_name_8": "Crystal Maiden (personaggio incluso)",
  "frosty_treasure_treasure_name_8": "L'Angelo Custode delle Nevi",
  "frosty_treasure_hero_name_9": "Wraith King (Arcano incluso)",
  "frosty_treasure_treasure_name_9": "Babbo Spettrale",
  "frosty_treasure_hero_name_10": "Corriere",
  "frosty_treasure_treasure_name_10": "Piccolo Roshan di Pan di Zenzero",
  "winter2023_gameplay_section_title": "Aggiornamenti di gioco",
  "winter2023_patchnotes_new_items_title": "Oggetti nuovi e aggiornati",
  "winter2023_patchnotes_new_items_introduction": "Sembra ci sia un ultimo regalo nel sacco di Babbo Spettrale e, com'è in suo diritto, può rivendicarlo sfidando un bambino all'ultimo sangue. Ecco che brandisce la sua spada lunga e... Sì, il combattimento è finito e il regalo è ora nelle sue mani. Si tratta di una selezione di oggetti di Dota rivisitati: alcuni sono nuovi di zecca e altri sono classici popolari.",
  "winter2023_patchnotes_section_title": "Aggiornamento 7.35"
}