// 4945.js

{
  "language": "ukrainian",
  "winter2023_title": "Мороздво 2023",
  "winter2023_subtitle": "Прикрашаймо наші мороздвяні хати святковими принадами, ігроладним оновленням 7.35, трьома преміальними наборами Dota Plus та безліччю поліпшень клієнта.",
  "winter2023_subtitle_short": "Святкові принади, ігроладне оновлення й безліч поліпшень клієнта",
  "winter2023_section_introduction": "Мороздво раніше <i>дещо означало</i>. Воно не стосувалося ваших друзів, родини чи ваших почуттів. Ішлося про <i>отримання речей</i>. Та якось увесь цей матеріалізм було втрачено й дурненьке серце кожного став наповнювати дух дарування. Цього року ми повертаємо ІСТИННЕ значення Мороздва: принадні косметичні предмети.",
  "winter2023_frostivus_section_title": "Скрині з мороздвяними скарбами",
  "winter2023_frostivus_section_date": "14 грудня 2023 — 11 січня 2024",
  "winter2023_frostivus_section_introduction": "Вигравайте матчі, щоби заповнити духолічильник Мороздва й отримати замкнену скриню з мороздвяними скарбами та випадкову шкарпетку з дарунками — графіті, смайликами й наліпками.",
  "winter2023_frostivus_earn_chests": "Заробляйте скрині",
  "winter2023_frostivus_how_to_earn_chests": "Щоразу, коли ви заповнюватимете свій духолічильник Мороздва, сам дух Мороздва відвідуватиме вас у формі замкненої скрині з мороздвяними скарбами 2023 року.",
  "winter2023_frostivus_buy_keys": "Купуйте ключі",
  "winter2023_frostivus_how_to_buy_keys": "Купуйте ключі, щоби відімкнути скрині й пізнати істинну суть скарбів усередині.",
  "winter2023_naughty_or_nice_section_title": "Ви були…",
  "winter2023_naughty_or_nice_naughty": "Неслухняними?",
  "winter2023_naughty_or_nice_naughty_desc": "Немає сенсу це заперечувати. Король Мороз і так знає. Він двічі перевіряв вашу оцінку поведінки і вже йде зі своїм блокувальним молотом, щоби розтрощити смурф-акаунти всіх неслухняних хлопчиків і дівчаток, а потім виписати штрафи пов’язаним основним акаунтам.",
  "winter2023_naughty_or_nice_nice": "Чи слухняними?",
  "winter2023_naughty_or_nice_nice_desc": "Цього року ви не порушували правила в Dota? Чудово! Король Мороз має <i>інший</i> молот для вас! Не сумнівайтеся, він <i>усе одно вас ударить</i>. Та коли ви прийдете до тями в лікарні чи не здасться вам усе сном? Що це поруч зі мною на подушці? <i>Безкоштовний мороздвяний дарунок!</i> Що ж ви заробили своєю оцінкою поведінки? Відкрийте дарунок і дізнайтеся…",
  "winter2023_naughty_or_nice_nice_desc2": "У вас дуже пристойна оцінка поведінки? Чудово! Король Мороз має <i>інший</i> молот для вас! Не сумнівайтеся, він все одно вас вдарить. Та коли ви прийдете до тями в лікарні чи не здасться вам усе сном? Що це поруч зі мною на подушці? <i>Безкоштовний мороздвяний ключ!</i>",
  "winter2023_frostivus_section_event_title": "Мороздвяні скарби 2023",
  "winter2023_frostivus_section_event_introduction": "Цілковито нові набори предметів для ваших улюблених героїв, а також повернення деяких старих улюбленців і відвідини таємного предмета для Короля-Духа й персони для Кришталевої Діви!",
  "winter2023_bonus_item_title": "Сезон (дуже рідкісних) дарів",
  "winter2023_bonus_item_desc": "Це Мороздвяне Чудо! Щоразу, коли ви розпаковуватимете набір, ви <i>також</i> матимете шанс розблокувати бонусний чудний варіант одного з предметів <i>в</i> цьому наборі! Утім, як частенько з чудесами, дійсний шанс потримати його в руках наближається до шансу потрапити під удар метеорита, тож не поспішайте одразу звільняти місце в зброярні.",
  "winter2023_bonus_item_fullset": "Повний набір",
  "winter2023_bonus_item_unusual": "Чудний варіант",
  "winter2023_stocking_stuffer_title": "Шкарпетки з дарунками",
  "winter2023_stocking_stuffer_desc": "Якщо сувора реальність останнього абзацу засмутила вас через малу ймовірність коли-небудь отримати бонусний дарунок на додаток до звичайного, заробляйте гроші! Нагородний патруль Мороздва <i>гарантовано</i> зупинятиметься біля вашого дому щоразу, коли ви заповнюєте свій духолічильник Мороздва, і видасть вам щось із переліченого нижче.",
  "winter2023_stocking_stuffer_sprays_stickers": "Графіті й наліпки",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Ці нові графіті діятимуть лише під час Мороздва, але ми почули ваші прохання — варіанти наліпок залишаться назавжди. Можете обліпити ними весь свій профіль.",
  "winter2023_stocking_stuffer_emoticons": "Смайлики",
  "winter2023_stocking_stuffer_emoticons_desc": "До того як Марія Кюрі винайшла смайлики, ніхто не вмів виражати свої емоції. Dota дякує їй за самопожертву, адже ранні версії були дуже радіоактивними.",
  "winter2023_stocking_stuffer_ward": "Морозний вард Півночі",
  "winter2023_stocking_stuffer_ward_desc": "Таємна бонусна історія: цей сніговик-коротун насправді могутніший за ОБОХ Древніх. Та ви цього ніколи не побачите. Чому? Він <i>скромний</i>.",
  "winter2023_stocking_stuffer_courier": "Кур’єр-тюлень",
  "winter2023_stocking_stuffer_courier_desc": "Погляньте, який чарівний цей хлопака! Мало того, він ще їстівний. У цій штуці чимало м’ясця та сальця, якщо вам раптом доведеться вдатися до канібалізму.",
  "winter2023_frostivus_festive_items_title": "Святкові предмети",
  "winter2023_frostivus_party_hats": "Мороздвяні капелюхи",
  "winter2023_frostivus_party_hats_description": "Маємо мороздвяні капелюхи для кожного! Не маєте голови? Без проблем! Дуже багато голів? Не страшно! Нагородний патруль Мороздва підганяє капелюшну вантажівку й вивертає кузов на все, що хоч трохи нагадує голову.",
  "winter2023_frostivus_free_event_items": "Халява",
  "winter2023_frostivus_free_event_items_description": "У мороздвяному минулому витратні предмети мали обмежену кількість використань. Цього року обмежень немає! Це подарунок. Точніше позика. Нагородний патруль Мороздва повернеться після завершення події, щоби забрати їх назад.",
  "winter2023_frostivus_high_fives": "Дайте п’ять",
  "winter2023_frostivus_high_fives_description": "На відміну від звичайних п’ятюнь, що ви постійно даєте друзям і родині, мороздвяні більше схожі на святкові гарячі шоколадні тости. Якщо чесно, то ваші друзі й родина думають, що пора вже трохи відпочити від таких привітань.",
  "winter2023_frostivus_section_treasure_title": "Мороздвяні скарби 2023",
  "winter2023_clientupdate_section_title": "Оновлення клієнту",
  "winter2023_clientupdate_introduction": "Що ж, добрий Король Мороз роздав усі свої подарунки. Усім щасливого Мороздва, бережіть себе… ЧЕКАЙТЕ! Тут є <i>ще</i> щось на дні його мішка!",
  "winter2023_qol_section_title": "Приємні покращення",
  "winter2023_qol_introduction": "Краща інформація для кращих рішень",
  "winter2023_qol_tower_range_indicator_title": "Індикатор дальності вежі",
  "winter2023_qol_tower_range_indicator_desc": "Стомилися від незнання, коли вежа цілиться на щось важливе, як-от на вас? Поліпшені ефекти покажуть, коли можна безпечно наближатися до неї, а коли час утікати.",
  "winter2023_qol_teleport_time_title": "Час телепортування",
  "winter2023_qol_teleport_time_desc": "Не всі знають, що телепортування в Dota варіативне за тривалістю, а донині цього ще й не можна було побачити. Тепер же ви можете дізнатися час подорожі перед застосуванням свого сувою телепортації.",
  "winter2023_qol_minimap_title": "Піктограми на мінімапі",
  "winter2023_qol_minimap_desc": "Стрілочки, піктограми героїв — чудово як одне, так і інше. <i>«Чому доводиться вибирати?»</i> — кричите ви до неба. Що ж, тепер вибирати не потрібно. Бо — ось вам урок з історії — небо в Dota — це джин, який виконує бажання.",
  "winter2023_qol_ability_shape_indicator_title": "Ще більше вказівників для здібностей",
  "winter2023_qol_ability_shape_indicador_desc": "<i>«Чому не для всіх моїх здібностей є вказівники?»</i> — кричите ви в небо. Вуаля! Представляємо точну передачу зони дії ще більшої кількості здібностей.",
  "winter2023_qol_ability_icons_title": "Стани здібностей",
  "winter2023_qol_ability_icons_desc": "Вашу пасивну здібність перервали Срібним клинком? Не можете стрибнути через укорінення? З новими піктограмами станів здібностей ви одразу це помічатимете.",
  "winter2023_qol_item_tooltips_title": "Кращі підказки щодо предметів",
  "winter2023_qol_item_tooltips_desc": "Щоб отримати інформацію про дію предметів, раніше треба було довго діставатися бібліотеки, а потім довго сперечатися зі спантеличеним бібліотекарем. Тепер тип націлювання, тип шкоди, розвіюваність і багато іншого знаходяться одразу в підказці.",
  "winter2023_qol_xp_range_title": "Індикатор дальності досвіду",
  "winter2023_qol_xp_range_desc": "Досвід навколо нас, очікує, щоби його забрали. Якби ж тільки ви знали, де саме він знаходиться! Тепер знатимете, якщо просто наведете вказівник миші на рівень героя. Навіть ALT не потрібен!",
  "winter2023_qol_wisdom_rune_timer_title": "Час до рун мудрості в Dota Plus",
  "winter2023_qol_wisdom_rune_timer_desc": "Як для руни, що присвячена мудрості, вона виявлялася досить дурненькою, коли мова йшла про час до її появи. Гляньте — вона зрештою помудрішала й купила собі годинник.",
  "winter2023_qol_creep_bounties_title": "Нагорода за кріпів",
  "winter2023_qol_creep_bounties_desc": "<i><i>«Чому я не можу дізнатися, яку нагороду дадуть за кожного кріпа на лініях та в лісі?»</i> — кричите ви в небо. «Серйозно?» — каже небесний джин. — «На вашому місці я б побажав чогось серйознішого. Втім, як хочете. А тепер бувайте, побачимося наступного Мороздва».",
  "winter2023_qol_misc_title": "…та інші покращення інтерфейсу",
  "winter2023_qol_misc_desc": "У Dota є безліч інформації для споживання, тож ми зробили кілька покращень інтерфейсу, які з цим допоможуть. Клацання правою кнопкою миші на предметах у вашому інвентарі тепер виділяє обраний вами предмет, бо інші стають темнішими. Тепер ви не викинете й не продасте щось не те. Популярні предмети тепер отримують сірий край, коли ви маєте достатньо золота, щоби їх собі дозволити. Більше вас не плутатимуть невідповідні краї. Також витрата здоров’я (а також мани) на предмети ховається, якщо вони у вашому рюкзаку. Зрештою, вхід до режиму тестування героя тепер відбувається подалі від веж, тож ви матимете достатньо часу перевірити все, що вам потрібно.",
  "winter2023_profileshowcase_section_title": "Вітрина профілю",
  "winter2023_profileshowcase_introduction": "Більше способів виразити себе, ніж будь-коли раніше",
  "winter2023_profileshowcase_animations_title": "Анімації",
  "winter2023_profileshowcase_animations_desc": "Стомилися, що ваші герої просто стовбичать там? Тепер можете обрати анімацію, щоби вони рухалися.",
  "winter2023_profileshowcase_anchoring_title": "Прив’язка до героїв",
  "winter2023_profileshowcase_anchoring_desc": "Прив’яжіть до моделей героїв інші елементи профілю, і вони рухатимуться всі разом.",
  "winter2023_profileshowcase_freezeframes_title": "Стоп-кадри",
  "winter2023_profileshowcase_freezeframes_desc": "Зупиніть будь-який кадр анімації, щоби схопити ідеальний незручний момент.",
  "winter2023_profileshowcase_gridsnapping_title": "Прив’язка до сітки",
  "winter2023_profileshowcase_gridsnapping_desc": "Вирівнюєте все своїми примітивними людськими очима й «довіряєте інстинктам»? Чому не дозволити системі СіткоВ’язоТрон™ зробити це ідеально?",
  "winter2023_profileshowcase_improved_portraits_title": "Покращені портрети",
  "winter2023_profileshowcase_improved_portraits_desc": "Обирайте між тривимірною моделлю чи двовимірним портретом своїх улюблених героїв. Показуйте їхні рівні чи навіть реліквії.",
  "winter2023_profileshowcase_more_items_title": "Більше моделей",
  "winter2023_profileshowcase_more_items_desc": "Прикликувані істоти, варди, кепкування, тваринки, предмети… Будь-що з гри можна запхнути в профіль.",
  "winter2023_armory_section_title": "Зброярня",
  "winter2023_armory_introduction": "Більше покращень вашого інвентарю",
  "winter2023_armory_grouping_title": "Покращене групування",
  "winter2023_armory_grouping_desc": "Тепер усі предмети можна згрупувати за іменем героя.",
  "winter2023_armory_filters_tags_title": "Фільтри й позначки повертаються",
  "winter2023_armory_filters_tags_desc": "Фільтруйте через пошук за ключовими словами і створюйте подання з наперед визначеним пошуковим запитом.",
  "winter2023_armory_stickers_title": "Пошук за наліпками",
  "winter2023_armory_stickers_desc": "Переглядайте наліпки, якими ви не володієте, і навіть ті, які колись мали.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Нові преміальні набори, завдання й нагороди гільдії",
  "winter2023_dotaplus_premium_sets_title": "Нові преміальні набори",
  "winter2023_dotaplus_premium_sets_desc": "У цьому сезоні Dota Plus з’являються три нові преміальні набори, кожен із яких доступний у крамниці уламків за 150 000 уламків.",
  "winter2023_dotaplus_seasonal_quests_title": "Оновлення сезонних завдань",
  "winter2023_dotaplus_seasonal_quests_desc": "Більше способів поповнити запаси ваших уламків.",
  "winter2023_dotaplus_guild_rewards_title": "Оновлені нагороди гільдії",
  "winter2023_dotaplus_guild_rewards_desc": "Як завжди, для гільдій із високими результатами доступні нові смайлики, графіті та фрази для колеса чату.",
  "frosty_treasure_hero_name_1": "Древній Привид",
  "frosty_treasure_treasure_name_1": "Тиха ніч",
  "frosty_treasure_hero_name_2": "Запальниця",
  "frosty_treasure_treasure_name_2": "Срібний скрик",
  "frosty_treasure_hero_name_3": "Алхімік",
  "frosty_treasure_treasure_name_3": "Люмпо і Рупертус",
  "frosty_treasure_hero_name_4": "Вартовий",
  "frosty_treasure_treasure_name_4": "Снігове рівнодення",
  "frosty_treasure_hero_name_5": "Пузань (включно з розблоковуваною персоною)",
  "frosty_treasure_treasure_name_5": "Сніговичок-Різничок",
  "frosty_treasure_hero_name_6": "Бивень",
  "frosty_treasure_treasure_name_6": "Святковий кулак",
  "frosty_treasure_hero_name_7": "Первісний Звір",
  "frosty_treasure_treasure_name_7": "Мерзенний Сніговий Звір",
  "frosty_treasure_hero_name_8": "Кришталева Діва (включно з розблоковуваною персоною)",
  "frosty_treasure_treasure_name_8": "Сніговий ангел-охоронець",
  "frosty_treasure_hero_name_9": "Король-Дух (включно з розблоковуваним таємним предметом)",
  "frosty_treasure_treasure_name_9": "Король Мороз",
  "frosty_treasure_hero_name_10": "Кур’єр",
  "frosty_treasure_treasure_name_10": "Імбирний малюк Рошана",
  "winter2023_gameplay_section_title": "Ігроладні оновлення",
  "winter2023_patchnotes_new_items_title": "Нові й оновлені внутрішньоігрові предмети",
  "winter2023_patchnotes_new_items_introduction": "Схоже, ще один дарунок лишився в мішку Короля Мороза, і за своє право на нього він готовий битися з будь-якою дитиною на смерть. Він витягає свій довгий меч і… Так, тепер дарунок у нього, чесно здобутий в бою! Це добірка перероблених предметів Dota, а також деяких цілковито нових або повернених старих улюбленців.",
  "winter2023_patchnotes_section_title": "Нотатки про оновлення 7.35"
}