// 1259.js

{
  "language": "english",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Deck Your Frosty Halls With Festive Cosmetics, Gameplay Patch 7.35, Three Dota Plus Premium Sets and a Ton of QoL Client Features",
  "winter2023_subtitle_short": "Festive Cosmetics, a Gameplay Patch & a Ton of QoL Client Features",
  "winter2023_section_introduction": "Frostivus used to <i>mean</i> something. It wasn't about your friends or your family or your feelings. It was about <i>getting stuff</i>. But at some point, all that materialism seeped out of the holiday and suddenly everybody's stupid heart was bursting with the spirit of giving. So this year we've rediscovered the TRUE meaning of Frostivus: Cosmetics.",
  "winter2023_frostivus_section_title": "Frostivus Treasure Chests",
  "winter2023_frostivus_section_date": "Dec 14, 2023 - Jan 11, 2024",
  "winter2023_frostivus_section_introduction": "Win matches to fill up your Frostivus Spirit Meter and get a locked Frostivus Treasure Chest AND a random Stocking Stuffer, from sprays to emoticons to stickers.",
  "winter2023_frostivus_earn_chests": "Earn Chests",
  "winter2023_frostivus_how_to_earn_chests": "Every time you fill up your Frostivus Spirit Meter, the spirit of Frostivus will flow through you, in the form of a locked Frostivus 2023 Treasure Chest.",
  "winter2023_frostivus_buy_keys": "Buy Keys",
  "winter2023_frostivus_how_to_buy_keys": "Buy keys to unlock chests and discover the true meaning of the treasures inside.",
  "winter2023_naughty_or_nice_section_title": "Have you been...",
  "winter2023_naughty_or_nice_naughty": "Naughty?",
  "winter2023_naughty_or_nice_naughty_desc": "There's no sense denying it. King Kringle knows. He's checked your behavior score twice, and he's coming with his ban hammer to pulverize the smurf accounts of all the naughty boys and girls, before handing out penalties to their associated main accounts.",
  "winter2023_naughty_or_nice_nice": "Or Nice?",
  "winter2023_naughty_or_nice_nice_desc": "Did you play Dota this year without breaking the rules? Great! King Kringle has a <i>different</i> hammer for you! Make no mistake, he's <i>still going to hit you with it</i>. But once you wake up in the hospital — was it all a dream? What's that next to you on your pillow? A <i>free Frostivus Gift</i>! What did your behavior score earn you? Open your present and see...",
  "winter2023_naughty_or_nice_nice_desc2": "Do you have a very merry behavior score? Great! King Kringle has a <i>different</i> hammer for you! Make no mistake, he's still going to hit you with it. But once you wake up in the hospital — was it all a dream? What's this next to me on my pillow? A <i>free Frostivus Key!</i>",
  "winter2023_frostivus_section_event_title": "Frostivus 2023 Treasures",
  "winter2023_frostivus_section_event_introduction": "All-new item sets for your favorite heroes, plus the return of some holiday favorites — and even a visit from the Wraith King Arcana and the Crystal Maiden Persona!",
  "winter2023_bonus_item_title": "The Season of (Very Occasional) Giving",
  "winter2023_bonus_item_desc": "It's a Frostivus Miracle! Every time you unbox a set, you'll <i>also</i> have a chance to unlock a bonus Unusual variant of one of the items <i>in</i> that set! And like most miracles, the odds of actually getting your hands on it are pretty close to being hit by a meteor, so don't clear a space for it in your Armory just yet.",
  "winter2023_bonus_item_fullset": "Full set",
  "winter2023_bonus_item_unusual": "Unusual variant",
  "winter2023_stocking_stuffer_title": "Stocking Stuffers",
  "winter2023_stocking_stuffer_desc": "If the harsh actuarial reality of that last paragraph got you depressed about the likelihood of ever getting a bonus gift in addition to a regular gift, buck up! The Frostivus Prize Patrol is <i>guaranteed</i> to stop at your house every time you fill up your Frostivus Spirit Meter, with one of the great gifts below.",
  "winter2023_stocking_stuffer_sprays_stickers": "Sprays & Stickers",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "These new sprays will only stick around for Frostivus, but you asked and we listened — the sticker versions will be permanent. Slap 'em all over your profiles.",
  "winter2023_stocking_stuffer_emoticons": "Emoticons",
  "winter2023_stocking_stuffer_emoticons_desc": "Before Marie Curie invented emoticons, nobody had the ability to express emotions. Dota salutes her sacrifice, since the early ones were highly radioactive.",
  "winter2023_stocking_stuffer_ward": "Frosty the North Ward",
  "winter2023_stocking_stuffer_ward_desc": "Secret bonus lore: this undersized snowman is actually more powerful than BOTH Ancients. But you'll never know it. Why? He's <i>modest</i>.",
  "winter2023_stocking_stuffer_courier": "Seal Courier",
  "winter2023_stocking_stuffer_courier_desc": "Would you look at how adorable this little guy is? Even better, it's edible. Plenty of meat and blubber on this thing if you get in a Donner Party sort of situation.",
  "winter2023_frostivus_festive_items_title": "Festive Items",
  "winter2023_frostivus_party_hats": "Frostivus Hats",
  "winter2023_frostivus_party_hats_description": "We've got Frostivus hats for everyone! No head? No problem! Too many heads? No such thing! The Frostivus Prize Patrol is backing up the hat truck and raising the dump bed onto anything that even slightly resembles a head.",
  "winter2023_frostivus_free_event_items": "Freebies",
  "winter2023_frostivus_free_event_items_description": "In Frostivuses Past, consumables had limited charges. This year, you can use as many as you want! It's a gift. Well, more of a loan, really. The Frostivus Prize Patrol will be coming back to collect them at the end of the event.",
  "winter2023_frostivus_high_fives": "High Fives",
  "winter2023_frostivus_high_fives_description": "Unlike the high fives you constantly give your friends and family, Frostivus High Fives are more like festive hot chocolate toasts. If we're being honest, your friends and family think you could take a break from all those high fives anyway.",
  "winter2023_frostivus_section_treasure_title": "Frostivus 2023 Treasures",
  "winter2023_clientupdate_section_title": "Client Updates",
  "winter2023_clientupdate_introduction": "Well, good King Kringle has given out all his presents for another year. Happy Frostivus, everyone, drive safe but WAIT! There's something <i>else</i> at the bottom of his sack!",
  "winter2023_qol_section_title": "Quality of Life",
  "winter2023_qol_introduction": "Better Info For Better Decision Making",
  "winter2023_qol_tower_range_indicator_title": "Tower Range Indicator",
  "winter2023_qol_tower_range_indicator_desc": "Tired of not knowing when that tower's targeting something important (i.e. you)? Enhanced effects make it more obvious when it's safe to dive or time to run.",
  "winter2023_qol_teleport_time_title": "Teleport Time",
  "winter2023_qol_teleport_time_desc": "It's a little-known fact that teleport times in Dota are variable — and up till now, invisible. Now you can check that commute time before you use your TP Scroll.",
  "winter2023_qol_minimap_title": "Minimap Icons",
  "winter2023_qol_minimap_desc": "Arrows, hero icons — they're both great. <i>\"Why must I choose?\"</i> you scream at the sky. Well, now you don't have to. Because — Dota lore drop — the sky is a wish-granting genie.",
  "winter2023_qol_ability_shape_indicator_title": "More Ability Reticles",
  "winter2023_qol_ability_shape_indicador_desc": "\"<i>Why are some of my ability reticles missing?\"</i> you scream at the sky. Poof! Presenting even more abilities with an accurate AOE display.",
  "winter2023_qol_ability_icons_title": "Ability Icon States",
  "winter2023_qol_ability_icons_desc": "Whether your passives are broken by Silver Edge, or you're rooted and can't blink away, you'll now be able to tell at a glance whether an ability is disabled with our new Ability Icon States.",
  "winter2023_qol_item_tooltips_title": "Better Item Tooltips",
  "winter2023_qol_item_tooltips_desc": "Getting targeting info on items usually meant a long drive to the library, then a long argument with a confused-looking librarian. Now target type, damage type, dispellability and more are all in the tooltip.",
  "winter2023_qol_xp_range_title": "XP Range Indicator",
  "winter2023_qol_xp_range_desc": "XP is all around us, just there for the leeching, if only you knew where to find it. Now you can, simply by hovering over your hero’s level. No ALT needed!",
  "winter2023_qol_wisdom_rune_timer_title": "Dota+ Wisdom Rune Timer",
  "winter2023_qol_wisdom_rune_timer_desc": "For a rune dedicated to wisdom, the Wisdom Rune used to be pretty stupid when it came to showing its spawn timer. Looks like it smartened up and finally bought a watch.",
  "winter2023_qol_creep_bounties_title": "Creep Bounties",
  "winter2023_qol_creep_bounties_desc": "<i>\"Why can't I see how much bounty each creep is worth, both in lane and in camps?\"</i> you scream at the sky. \"Really?\" the sky genie says. \"I would have asked for more wishes. Anyway, you got it. See you next Frostivus.\"",
  "winter2023_qol_misc_title": "...And Other HUD Improvements",
  "winter2023_qol_misc_desc": "There's a ton of information to absorb in Dota, and we've made several HUD improvements to help. Right-clicking on items in your inventory now highlights which item you've selected by making other items darker. Never drop or sell the wrong item again. Popular items now only feature a gray border when you have enough gold to afford them. No more confusing border discrepancy. Plus, health costs for items are hidden along with mana when they’re in your backpack.  Lastly, entering Hero Demo Mode now spawns you away from the towers, so you can have lots of space to test everything you want.",
  "winter2023_profileshowcase_section_title": "Profile Showcase",
  "winter2023_profileshowcase_introduction": "More Ways to Express Yourself Than Ever Before",
  "winter2023_profileshowcase_animations_title": "Animations",
  "winter2023_profileshowcase_animations_desc": "Tired of your heroes just standing there? Now you can choose an animation sequence to get them moving.",
  "winter2023_profileshowcase_anchoring_title": "Anchoring Onto Heroes",
  "winter2023_profileshowcase_anchoring_desc": "Now you can anchor other profile elements onto hero models and watch them move with the animation.",
  "winter2023_profileshowcase_freezeframes_title": "Freeze frames",
  "winter2023_profileshowcase_freezeframes_desc": "Freeze on any frame of an animation to capture that perfect awkward moment.",
  "winter2023_profileshowcase_gridsnapping_title": "Grid Snap",
  "winter2023_profileshowcase_gridsnapping_desc": "Aligning things with your stupid human eyes and \"gut instincts\"? Why not let SnapGridTron™ do it for you perfectly?",
  "winter2023_profileshowcase_improved_portraits_title": "Improved Portraits",
  "winter2023_profileshowcase_improved_portraits_desc": "Choose between the 3D model or 2D portrait version of your favorite heroes. Show off your hero level badge and even your relics.",
  "winter2023_profileshowcase_more_items_title": "More Models",
  "winter2023_profileshowcase_more_items_desc": "Summons, wards, taunts, pets, item highlights... you name it, you can jam it into your profile.",
  "winter2023_armory_section_title": "Armory",
  "winter2023_armory_introduction": "More Improvements to Your Inventory",
  "winter2023_armory_grouping_title": "Improved Grouping",
  "winter2023_armory_grouping_desc": "All items can now be grouped by hero name. ",
  "winter2023_armory_filters_tags_title": "Filters and Tags Are Back",
  "winter2023_armory_filters_tags_desc": "Filter using keyword search and create views with pre-defined search criteria.",
  "winter2023_armory_stickers_title": "Find Stickers",
  "winter2023_armory_stickers_desc": "See stickers that you don't own, and even browse previously available ones.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "New Premium Sets, Quests and Guild Rewards",
  "winter2023_dotaplus_premium_sets_title": "New Premium Sets",
  "winter2023_dotaplus_premium_sets_desc": "This season of Dota Plus unveils three new premium sets available for purchase in the Shard Shop for 150,000 shards each.",
  "winter2023_dotaplus_seasonal_quests_title": "Seasonal Quest Refresh",
  "winter2023_dotaplus_seasonal_quests_desc": "More ways to increase your shard stash.",
  "winter2023_dotaplus_guild_rewards_title": "Updated Guild Rewards",
  "winter2023_dotaplus_guild_rewards_desc": "As always, new emoticons, sprays and chat wheels are available to high-scoring guilds.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Silent Wight",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silver Squall",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo and Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (Persona unlock included)",
  "frosty_treasure_treasure_name_5": "Frosty the Sew-Man",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Jingle Fist",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "The Abominable Snowbeast",
  "frosty_treasure_hero_name_8": "Crystal Maiden (Persona unlock included)",
  "frosty_treasure_treasure_name_8": "Guardian Snow Angel",
  "frosty_treasure_hero_name_9": "Wraith King (Arcana unlock included)",
  "frosty_treasure_treasure_name_9": "King Kringle",
  "frosty_treasure_hero_name_10": "Courier",
  "frosty_treasure_treasure_name_10": "Gingerbread Baby Roshan",
  "winter2023_gameplay_section_title": "Gameplay Updates",
  "winter2023_patchnotes_new_items_title": "New and Updated In-Game Items",
  "winter2023_patchnotes_new_items_introduction": "Looks like there's one gift left in King Kringle's sack, and as is his right, he may claim it by fighting a child to the death. He's swinging his longsword and — yes, the gift is his by combat! It's a bounty of reworked Dota items — some brand new, alongside some old favorites.",
  "winter2023_patchnotes_section_title": "7.35 Patch Notes",
  "winter2023_recipe": "Recipe:",
  "NoCommaStub": ""
}