// 532.js

{
  "language": "russian",
  "winter2023_title": "Холодрыжество — 2023",
  "winter2023_subtitle": "К нам пришло Холодрыжество — а вместе с ним праздничные аксессуары, обновление 7.35, три премиум-набора в Dota Plus и куча улучшений клиента",
  "winter2023_subtitle_short": "Праздничные аксессуары, обновление игрового процесса и куча улучшений клиента",
  "winter2023_section_introduction": "Холодрыжество не всегда было <i>обыкновенным</i> праздником. Важнее всего были не ваши друзья, родственники или чувства. Важнее всего было <i>обзавестись всякой всячиной</i>. Но в какой-то момент эта меркантильность куда-то пропала, и все внезапно преобразились в презренных альтруистов. Так что в этом году мы заново открываем ИСТИННЫЙ смысл Холодрыжества: косметические предметы.",
  "winter2023_frostivus_section_title": "Холодрыжеские сундуки",
  "winter2023_frostivus_section_date": "14 декабря 2023 года — 11 января 2024 года",
  "winter2023_frostivus_section_introduction": "Побеждайте, чтобы пополнять свой счётчик духа Холодрыжества и получать не только закрытые сундуки, но и чулки со случайными подарками: от граффити до смайликов и наклеек.",
  "winter2023_frostivus_earn_chests": "Зарабатывайте сундуки",
  "winter2023_frostivus_how_to_earn_chests": "Заполните счётчик духа Холодрыжества, и на вас снизойдёт его благодать в виде закрытого праздничного сундука.",
  "winter2023_frostivus_buy_keys": "Покупайте ключи",
  "winter2023_frostivus_how_to_buy_keys": "Ключом можно открыть сундук и познать истинный смысл сокровищ внутри него.",
  "winter2023_naughty_or_nice_section_title": "Вы вели себя...",
  "winter2023_naughty_or_nice_naughty": "Плохо?",
  "winter2023_naughty_or_nice_naughty_desc": "Можете не отнекиваться. Скелет Мороз уже всё знает. Он тщательно проверил вашу порядочность и готов вдарить бан-молотом по всем смурф-аккаунтам непослушных мальчиков и девочек, а также раздать наказания их основным аккаунтам.",
  "winter2023_naughty_or_nice_nice": "Или хорошо?",
  "winter2023_naughty_or_nice_nice_desc": "В этом году вы были послушным игроком в Доту и не нарушали правил? Отлично! Для вас у Скелета Мороза припасён <i>другой</i> молот! Не сомневайтесь, <i>он всё равно им вдарит</i>. Но вот когда вы очнётесь в больнице... «Это был сон? Ой, а что это лежит у меня на подушке? Неужели <i>бесплатный холодрыжеский подарок</i>?» Что же получат игроки с хорошей порядочностью? Откройте подарок и узнайте...",
  "winter2023_naughty_or_nice_nice_desc2": "Порядочность показывает, что игра с вами — сплошной праздник? Отлично! Для вас у Скелета Мороза припасён <i>другой</i> молот! Не сомневайтесь, он всё равно им вдарит. Но вот когда вы очнётесь в больнице... «Это был сон? Ой, а что это лежит у меня на подушке? Неужели <i>бесплатный холодрыжеский ключ</i>?»",
  "winter2023_frostivus_section_event_title": "Сокровищница Холодрыжества",
  "winter2023_frostivus_section_event_introduction": "Совершенно новые наборы для ваших любимых героев, а также возвращение некоторых праздничных фаворитов — в гости заглянули даже Arcana-набор для Wraith King и личность для Crystal Maiden!",
  "winter2023_bonus_item_title": "Сезон (крайне редких) подарков",
  "winter2023_bonus_item_desc": "Холодрыжеское чудо! С каждым набором из сокровищницы вы можете получить дополнительную необычную версию одного из предметов в нём! Как и подобает чудесам, вероятность этого события сравнима с шансом угодить под метеорит, так что не торопитесь расчищать место в арсенале.",
  "winter2023_bonus_item_fullset": "Полный набор",
  "winter2023_bonus_item_unusual": "Необычный вариант",
  "winter2023_stocking_stuffer_title": "Чулки с подарками",
  "winter2023_stocking_stuffer_desc": "Если вам взгрустнулось от описанной в прошлом абзаце суровой вероятностной реальности — выше нос, ведь у нас есть и другие бонусные подарки! За каждый заполненный счётчик духа Холодрыжества ваш дом <i>гарантированно</i> посетит подарочный патруль с одним из следующих замечательных гостинцев.",
  "winter2023_stocking_stuffer_sprays_stickers": "Граффити и наклейки",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Новые граффити пропадут после Холодрыжества, но по многочисленным просьбам мы создали их постоянные версии в виде наклеек. Нарядите ими свой профиль!",
  "winter2023_stocking_stuffer_emoticons": "Смайлики",
  "winter2023_stocking_stuffer_emoticons_desc": "Пока Мария Кюри не изобрела смайлики, человечество не умело выражать эмоции. Дота приносит дань уважения её самоотверженности — как-никак, ранние смайлики были крайне радиоактивными.",
  "winter2023_stocking_stuffer_ward": "Frosty the North Ward",
  "winter2023_stocking_stuffer_ward_desc": "Секрет для любителей сюжета: этот неприметный снеговичок могущественнее, чем ОБА Древних. Но вы об этом никогда не узнаете. Почему? Просто он <i>скромный</i>.",
  "winter2023_stocking_stuffer_courier": "Курьер-тюлень",
  "winter2023_stocking_stuffer_courier_desc": "Вы только посмотрите на этого очаровашку. А ведь он ещё и съедобный. В нём достаточно мяса и жира — чтобы даже в крайнем случае вам не пришлось следовать примеру группы Доннера.",
  "winter2023_frostivus_festive_items_title": "Праздничные предметы",
  "winter2023_frostivus_party_hats": "Холодрыжеские шапки",
  "winter2023_frostivus_party_hats_description": "Каждому по холодрыжеской шапке! Нет головы? Нет проблемы! Слишком много голов? Ну нет, голов много не бывает! Подарочный патруль уже подвёз целый грузовик шапок и готов вывалить содержимое кузова на всё, что хоть немного напоминает голову.",
  "winter2023_frostivus_free_event_items": "Никаких ограничений",
  "winter2023_frostivus_free_event_items_description": "В прошлые Холодрыжества у расходуемых предметов было ограниченное число зарядов. В этот же раз вы можете использовать их сколько угодно! Считайте, что это подарок. Но, строго говоря, временный. Подарочный патруль придёт за этими предметами в конце праздника.",
  "winter2023_frostivus_high_fives": "Дай пять!",
  "winter2023_frostivus_high_fives_description": "В отличие от обычных пятюнь, которые вы без остановки даёте друзьям и родственникам, холодрыжеские скорее напоминают праздничные тосты. Наконец-таки ваши (будем честны) притомившиеся близкие могут вздохнуть спокойно!",
  "winter2023_frostivus_section_treasure_title": "Сокровищница Холодрыжества",
  "winter2023_clientupdate_section_title": "Обновления клиента",
  "winter2023_clientupdate_introduction": "Что ж, славный Скелет Мороз выдал все подарки. Счастливого всем Холодрыжества, осторожней за рулём — но ПОСТОЙТЕ! На дне его мешка завалялось <i>кое-что ещё</i>!",
  "winter2023_qol_section_title": "Улучшения клиента",
  "winter2023_qol_introduction": "Чем точнее информация, тем вернее ваши решения",
  "winter2023_qol_tower_range_indicator_title": "Индикатор дальности башни",
  "winter2023_qol_tower_range_indicator_desc": "Хотите знать наверняка, что башня целится во что-то важное (например, в вас)? Улучшенные эффекты помогут вам понять, когда можно наглеть и когда пора сматываться.",
  "winter2023_qol_teleport_time_title": "Время телепортации",
  "winter2023_qol_teleport_time_desc": "Немногие знают, что длительность телепортации в Доте не всегда одинаковая — и до сих пор это нельзя было увидеть. Теперь же вы можете узнать время в пути до применения свитка телепортации.",
  "winter2023_qol_minimap_title": "Иконки на мини-карте",
  "winter2023_qol_minimap_desc": "Стрелочки, иконки героев... Чудесно и то и другое. <i>«Ну почему мне приходится выбирать?»</i> — кричите вы в небо. Что ж, выбирать больше не придётся. Потому что (и это канон) небо в Доте — это исполняющий желания джинн.",
  "winter2023_qol_ability_shape_indicator_title": "Ещё больше указателей способностей",
  "winter2023_qol_ability_shape_indicador_desc": "<i>«Ну почему не у всех моих способностей есть указатели?»</i> — кричите вы в небо. Вжух! Теперь область действия многих способностей обозначается точнее.",
  "winter2023_qol_ability_icons_title": "Состояния для иконок способностей",
  "winter2023_qol_ability_icons_desc": "Вашу пассивную способность отключили ударом из невидимости? Оцепенение не даёт вашему Антимагу упрыгать? Благодаря новым состояниям для иконок способностей вы будете подмечать такие нюансы с первого взгляда.",
  "winter2023_qol_item_tooltips_title": "Улучшенные описания предметов",
  "winter2023_qol_item_tooltips_desc": "Раньше все премудрости предметов можно было познать, лишь проделав долгий путь в библиотеку и переспорив обескураженных вашими вопросами работников. Теперь же тип заклинания, вид урона, развеиваемость и прочее можно найти прямо в описании предмета.",
  "winter2023_qol_xp_range_title": "Индикатор области получения опыта",
  "winter2023_qol_xp_range_desc": "Опыт везде и всюду, и он так и ждёт, чтобы его кто-нибудь да впитал! Где же его искать? Теперь узнать это крайне просто — наведите курсор на уровень своего героя, и вы увидите радиус получения опыта. И даже не нужно нажимать Alt!",
  "winter2023_qol_wisdom_rune_timer_title": "Таймер рун мудрости в Dota Plus",
  "winter2023_qol_wisdom_rune_timer_desc": "Хоть руна мудрости и должна наделять умом и сообразительностью, сама она как-то не догадалась показывать таймер своего появления. Зато теперь исправилась: видимо, такие вещи приходят с возрастом.",
  "winter2023_qol_creep_bounties_title": "Награда за крипов",
  "winter2023_qol_creep_bounties_desc": "<i>«Ну почему я не вижу, сколько золота дают за крипов на линиях и в лесу?»</i> — кричите вы в небо. «Ты серьёзно? — отвечает небесный джинн. — На твоём месте я бы пожелал больше желаний. Впрочем, как хочешь. Увидимся в следующее Холодрыжество».",
  "winter2023_qol_misc_title": "...и другие улучшения интерфейса",
  "winter2023_qol_misc_desc": "В Доте невероятное количество информации, и, чтобы вам было проще её поглощать, мы улучшили интерфейс. Теперь при нажатии правой кнопкой мыши на один из предметов все остальные будут затемняться, чтобы вы не продали и не выбросили что-нибудь не то. Серая рамочка вокруг популярных предметов появляется, только когда на них хватает золота (прямо как жёлтая). Ещё у предметов в ранце скрывается расход не только маны, но и здоровья. И, наконец, в режиме пробы героя вы появляетесь вдали от башен, так что теперь у вас сразу есть простор для экспериментов.",
  "winter2023_profileshowcase_section_title": "Витрина профиля",
  "winter2023_profileshowcase_introduction": "Как никогда много способов выразить себя",
  "winter2023_profileshowcase_animations_title": "Анимации",
  "winter2023_profileshowcase_animations_desc": "Устали, что ваши герои стоят просто так? Теперь вы можете заставить их двигаться, выбрав одну из анимаций.",
  "winter2023_profileshowcase_anchoring_title": "Привязка к героям",
  "winter2023_profileshowcase_anchoring_desc": "Привяжите к моделям героев другие элементы профиля, и они будут двигаться в такт анимации.",
  "winter2023_profileshowcase_freezeframes_title": "Стоп-кадры",
  "winter2023_profileshowcase_freezeframes_desc": "Остановите анимацию на любом кадре, чтобы запечатлеть неповторимый неловкий момент.",
  "winter2023_profileshowcase_gridsnapping_title": "Привязка к сетке",
  "winter2023_profileshowcase_gridsnapping_desc": "Всё ещё выравниваете элементы профиля на свой допотопный глаз? Тогда мы идём к вам!",
  "winter2023_profileshowcase_improved_portraits_title": "Улучшенные портреты",
  "winter2023_profileshowcase_improved_portraits_desc": "Выбирайте между моделью и портретом ваших любимых героев. Похвастайтесь их уровнями или даже реликвиями.",
  "winter2023_profileshowcase_more_items_title": "Больше моделей",
  "winter2023_profileshowcase_more_items_desc": "Призываемые существа, варды, насмешки, питомцы, предметы... В профиль можно запихнуть всё, что есть в игре.",
  "winter2023_armory_section_title": "Арсенал",
  "winter2023_armory_introduction": "Больше улучшений вашего инвентаря",
  "winter2023_armory_grouping_title": "Улучшенная группировка",
  "winter2023_armory_grouping_desc": "Теперь все предметы можно сгруппировать по имени героя. ",
  "winter2023_armory_filters_tags_title": "Фильтры и метки вернулись",
  "winter2023_armory_filters_tags_desc": "Вы можете искать предметы по названию и даже создавать специальные комбинации фильтров.",
  "winter2023_armory_stickers_title": "Поиск по наклейкам",
  "winter2023_armory_stickers_desc": "Просматривайте как те наклейки, которых у вас нет, так и те, что были доступны лишь в прошлом.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Новые премиум-наборы, задания и награды гильдии",
  "winter2023_dotaplus_premium_sets_title": "Новые премиум-наборы",
  "winter2023_dotaplus_premium_sets_desc": "Этот сезон Dota Plus добавляет в игру три новых премиум-набора, каждый из которых можно купить в магазине за 150 000 осколков.",
  "winter2023_dotaplus_seasonal_quests_title": "Сброс сезонных заданий",
  "winter2023_dotaplus_seasonal_quests_desc": "Больше способов пополнить запасы осколков.",
  "winter2023_dotaplus_guild_rewards_title": "Обновлённые награды гильдии",
  "winter2023_dotaplus_guild_rewards_desc": "Как всегда, наиболее успешные гильдии получают новые смайлики, граффити и звуки для колеса чата.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Silent Wight",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silver Squall",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo and Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (личность прилагается)",
  "frosty_treasure_treasure_name_5": "Frosty the Sew-Man",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Jingle Fist",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "The Abominable Snowbeast",
  "frosty_treasure_hero_name_8": "Crystal Maiden (личность прилагается)",
  "frosty_treasure_treasure_name_8": "Guardian Snow Angel",
  "frosty_treasure_hero_name_9": "Wraith King (Arcana-набор прилагается)",
  "frosty_treasure_treasure_name_9": "King Kringle",
  "frosty_treasure_hero_name_10": "Курьер",
  "frosty_treasure_treasure_name_10": "Gingerbread Baby Roshan",
  "winter2023_gameplay_section_title": "Изменения баланса",
  "winter2023_patchnotes_new_items_title": "Новые и обновлённые предметы",
  "winter2023_patchnotes_new_items_introduction": "Похоже, у Скелета Мороза остался для вас ещё один подарочек, и он вправе заполучить его в смертельном бою с ребёнком. Он делает замах мечом и... победа! Наградой стал целый ворох значительно изменённых предметов и несколько новинок.",
  "winter2023_patchnotes_section_title": "Обновление 7.35",
  "winter2023_recipe": "Рецепт:"
}