// 5682.js

{
  "language": "greek",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Να τα πούμε; Γιορτινά κοσμητικά για να στολίσετε όπως πρέπει, Ενημέρωση Παιχνιδιού 7.35, τρία Premium σετ Dota Plus και πάμπολλες βελτιώσεις στα χαρακτηριστικά του παιχνιδιού",
  "winter2023_subtitle_short": "Γιορτινά κοσμητικά, Ενημέρωση Παιχνιδιού και πάμπολλες βελτιώσεις στα χαρακτηριστικά της εφαρμογής",
  "winter2023_section_introduction": "Το Frostivus κάποτε <i>σήμαινε</i> κάτι. Δεν είχε να κάνει με τους φίλους, την οικογένεια και τα συναισθήματά σας. Είχε να κάνει με τα <i>δώρα</i> που θα παίρνατε. Αλλά κάποια στιγμή, όλη αυτή η αγάπη για τα υλικά αγαθά χάθηκε και την αντικατέστησε το πνεύμα της προσφοράς που γέμιζε τις χαζοκαρδιές όλων. 'Ετσι, φέτος βρήκαμε και πάλι το ΠΡΑΓΜΑΤΙΚΟ νόημα του Frostivus, τα κοσμητικά αντικείμενα.",
  "winter2023_frostivus_section_title": "ΣΕΝΤΟΥΚΙΑ ΘΗΣΑΥΡΟΥ FROSTIVUS",
  "winter2023_frostivus_section_date": "14 ΔΕΚ. 2023 – 11 ΙΑΝ. 2024",
  "winter2023_frostivus_section_introduction": "Κερδίστε αγώνες για να γεμίσετε τον Μετρητή Πνεύματος Frostivus και να αποκτήσετε ένα κλειδωμένο Σεντούκι Θησαυρού Frostivus ΚΑΙ ένα τυχαίο Δώρο Κάλτσας, από σπρέι μέχρι emoticon και αυτοκόλλητα.",
  "winter2023_frostivus_earn_chests": "ΚΕΡΔΙΣΤΕ ΣΕΝΤΟΥΚΙΑ",
  "winter2023_frostivus_how_to_earn_chests": "Κάθε φορά που γεμίζετε τον Μετρητή Πνεύματος Frostivus, το πνεύμα του Frostivus θα ρέει μέσα σας, με τη μορφή ενός κλειδωμένου Σεντουκιού Θησαυρού Frostivus 2023.",
  "winter2023_frostivus_buy_keys": "ΑΓΟΡΑΣΤΕ ΚΛΕΙΔΙΑ",
  "winter2023_frostivus_how_to_buy_keys": "Αγοράστε κλειδιά για να ξεκλειδώσετε σεντούκια και να ανακαλύψετε το αληθινό νόημα των θησαυρών εντός.",
  "winter2023_naughty_or_nice_section_title": "ΗΣΑΣΤΑΝ…",
  "winter2023_naughty_or_nice_naughty": "Ατακτούλικα;",
  "winter2023_naughty_or_nice_naughty_desc": "Μην προσπαθείτε να το αρνηθείτε. Ο Βασιλιάς Kringle γνωρίζει. Έλεγξε δύο φορές τη βαθμολογία συμπεριφοράς σας και έρχεται με το σφυρί αποκλεισμού του για να συνθλίψει τους λογαριασμούς σμερφ όλων των άτακτων αγοριών και κοριτσιών, πριν μοιράσει ποινές στους συσχετιζόμενους κύριους λογαριασμούς τους.",
  "winter2023_naughty_or_nice_nice": "Ή φρονιμούλικα;",
  "winter2023_naughty_or_nice_nice_desc": "Παίξατε Dota φέτος χωρίς να παραβιάσετε τους κανόνες;Τέλεια! Ο Βασιλιάς Kringle έχει ένα <i>διαφορετικό</i> σφυρί για εσάς! Μην απατάστε, <i>πάλι θα τις φάτε</i>. Αλλά αφού ξυπνήσετε στο νοσοκομείο θα αναρωτηθείτε: Ήταν όλα ένα όνειρο; Τι είναι αυτό στο μαξιλάρι δίπλα μου; Ένα <i>δώρο Frostivus</i>! Τι κερδίσατε από τη βαθμολογία συμπεριφοράς σας; Ανοίξτε το δώρο σας και θα δείτε…",
  "winter2023_naughty_or_nice_nice_desc2": "Έχετε καλή βαθμολογία συμπεριφοράς; Τέλεια! Ο Βασιλιάς Kringle έχει ένα <i>διαφορετικό</i> σφυρί για εσάς! Μην απατάστε, πάλι θα τις φάτε. Μετά θα ξυπνήσετε στο νοσοκομείο και θα αναρωτηθείτε: Ήταν όλα ένα όνειρο; Τι είναι αυτό στο μαξιλάρι δίπλα μου; Ένα <i>δωρεάν Κλειδί Frostivus!</i>",
  "winter2023_frostivus_section_event_title": "ΘΗΣΑΥΡΟΙ FROSTIVUS 2023",
  "winter2023_frostivus_section_event_introduction": "Ολοκαίνουρια σετ αντικειμένων για τους αγαπημένους σας ήρωες, μαζί με την επιστροφή μερικών εορταστικών αγαπημένων, καθώς και μια επίσκεψη από το Arcana του Wraith King και την Περσόνα της Crystal Maiden!",
  "winter2023_bonus_item_title": "Η ΕΠΟΧΗ ΤΗΣ (ΠΟΛΥ ΠΕΡΙΣΤΑΣΙΑΚΗΣ) ΠΡΟΣΦΟΡΑΣ",
  "winter2023_bonus_item_desc": "Το Θαύμα του Frostivus! Κάθε φορά που ανοίγετε ένα σετ, θα έχετε <i>επίσης</i> μια πιθανότητα να ξεκλειδώσετε μια επιπλέον ασυνήθιστη παραλλαγή ενός από τα αντικείμενα <i>μέσα</i> στο σετ! Και, όπως τα περισσότερα θαύματα, οι πιθανότητες να το αποκτήσετε είναι παρόμοιες με το να χτυπηθείτε από μετεωρίτη, οπότε μην κάνετε χώρο στο Οπλοστάσιό σας από τώρα.",
  "winter2023_bonus_item_fullset": "ΠΛΗΡΕΣ ΣΕΤ",
  "winter2023_bonus_item_unusual": "ΑΣΥΝΗΘΙΣΤΗ ΠΑΡΑΛΛΑΓΗ",
  "winter2023_stocking_stuffer_title": "ΜΙΝΙ ΔΩΡΑΚΙΑ",
  "winter2023_stocking_stuffer_desc": "Αν πάθατε κατάθλιψη με τη σκληρή στατιστική πραγματικότητα της τελευταίας παραγράφου, σχετικά με τις πιθανότητές σας να πάρετε ένα επιπλέον δώρο εκτός από το κανονικό σας, αναθαρρήστε! Η Περίπολος Δώρων Frostivus θα περνά <i>εγγυημένα</i> από το σπίτι σας κάθε φορά που φουλάρετε τον Μετρητή Πνεύματος Frostivus, με ένα από τα παρακάτω υπέροχα δώρα.",
  "winter2023_stocking_stuffer_sprays_stickers": "ΣΠΡΕΙ ΚΑΙ ΑΥΤΟΚΟΛΛΗΤΑ",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Αυτά τα νέα σπρέι θα είναι διαθέσιμα μόνο κατά τη διάρκεια του Frostivus, αλλά το ζητήσατε και το κάναμε πράξη. Οι εκδόσεις αυτοκόλλητων θα είναι μόνιμες. Κολλήστε τα παντού στα προφίλ σας.",
  "winter2023_stocking_stuffer_emoticons": "Emoticon",
  "winter2023_stocking_stuffer_emoticons_desc": "Πριν εφεύρει τα emoticon η Μαρί Κιουρί, κανένας δεν μπορούσε να εκφράσει συναισθήματα. Το Dota τιμά τη θυσία της, μιας και τα πρώτα emoticon ήταν άκρως ραδιενεργά.",
  "winter2023_stocking_stuffer_ward": "Frosty the North Ward",
  "winter2023_stocking_stuffer_ward_desc": "Μπόνους μυστική ιστορία: Αυτός ο μικροκαμωμένος χιονάνθρωπος είναι στην πραγματικότητα πολύ πιο ισχυρός ΚΑΙ ΑΠΟ ΤΑ ΔΥΟ Αρχαία. Αλλά δεν θα το δείξει ποτέ. Γιατί; Είναι <i>μετριόφρων</i>.",
  "winter2023_stocking_stuffer_courier": "Μεταφορέας Φώκια",
  "winter2023_stocking_stuffer_courier_desc": "Βλέπετε πόσο αξιολάτρευτος είναι αυτός ο μικρούλης; Και όχι μόνο αυτό, αλλά τρώγεται κιόλας. Άφθονο κρέας και λιπάκι για να τσιμπολογήσετε αν σας τύχει τίποτα παρόμοιο με τους «Επιζήσαντες».",
  "winter2023_frostivus_festive_items_title": "ΓΙΟΡΤΙΝΑ ΑΝΤΙΚΕΙΜΕΝΑ",
  "winter2023_frostivus_party_hats": "ΚΑΠΕΛΑ FROSTIVUS",
  "winter2023_frostivus_party_hats_description": "Έχουμε καπέλα Frostivus για όλους! Δεν έχετε κεφάλι; Κανένα πρόβλημα! Πάρα πολλά κεφάλια; Δεν υφίσταται τέτοιο πράγμα! Η Περίπολος Δώρων Frostivus έχει βάλει στην όπισθεν το φορτηγό με τα καπέλα και ξεφορτώνει πάνω σε οτιδήποτε μοιάζει έστω και λίγο με κεφάλι.",
  "winter2023_frostivus_free_event_items": "ΔΩΡΕΑΝ ΚΑΛΟΥΔΙΑ",
  "winter2023_frostivus_free_event_items_description": "Σε Frostivus του παρελθόντος, τα αναλώσιμα είχαν περιορισμένο αριθμό φορτίσεων. Φέτος, μπορείτε να χρησιμοποιήσετε όσα θέλετε! Είναι δώρο. Βασικά, πιο πολύ σαν δάνειο. Η Περίπολος Δώρων Frostivus θα επιστρέψει για να τα πάρει πίσω στο τέλος του συμβάντος.",
  "winter2023_frostivus_high_fives": "ΚΟΛΛΑ ΠΕΝΤΕ",
  "winter2023_frostivus_high_fives_description": "Αντίθετα με τα κόλλα πέντε που κάνετε με τους φίλους και την οικογένειά σας, τα Κόλλα Πέντε του Frostivus μοιάζουν περισσότερα με γιορτινά τσουγκρίσματα ζεστής σοκολάτας. Για να είμαστε ειλικρινείς, οι φίλοι και οι συγγενείς σας πιστεύουν ότι θα πρέπει να κάνετε ένα διάλειμμα από όλα αυτά τα κόλλα όπως και να 'χει.",
  "winter2023_frostivus_section_treasure_title": "ΘΗΣΑΥΡΟΙ FROSTIVUS 2023",
  "winter2023_clientupdate_section_title": "ΕΝΗΜΕΡΩΣΕΙΣ ΕΦΑΡΜΟΓΗΣ",
  "winter2023_clientupdate_introduction": "Λοιπόν, ο καλός Βασιλιάς Kringle μοίρασε όλα του τα δώρα για ακόμη μια χρονιά. Καλό Frostivus σε όλους, να οδηγείτε με ασφάλεια αλλά ΩΠΑ! Υπάρχει και κάτι <i>άλλο</i> στον πάτο του σάκου του!",
  "winter2023_qol_section_title": "ΒΕΛΤΙΩΣΕΙΣ",
  "winter2023_qol_introduction": "Καλύτερες πληροφορίες για καλύτερες αποφάσεις",
  "winter2023_qol_tower_range_indicator_title": "ΔΕΙΚΤΗΣ ΒΕΛΗΝΕΚΟΥΣ ΠΥΡΓΟΥ",
  "winter2023_qol_tower_range_indicator_desc": "Κουραστήκατε πια να μην γνωρίζετε πότε οι πύργοι στοχεύουν κάτι σημαντικό (δηλαδή εσάς); Με τα βελτιωμένα εφέ, θα γνωρίζετε ευκολότερα πότε είναι ασφαλές να χωθείτε στη μάχη και πότε να υποχωρήσετε.",
  "winter2023_qol_teleport_time_title": "ΧΡΟΝΟΣ ΤΗΛΕΜΕΤΑΦΟΡΑΣ",
  "winter2023_qol_teleport_time_desc": "Δεν είναι πολύ γνωστό ότι οι χρόνοι τηλεμεταφοράς στο Dota είναι μεταβλητοί και μέχρι τώρα, αόρατοι. Πλέον, μπορείτε να βλέπετε πόσο χρόνο θα χρειαστεί η τηλεμεταφορά, πριν χρησιμοποιήσετε το Town Portal Scroll σας.",
  "winter2023_qol_minimap_title": "ΕΙΚΟΝΙΔΙΑ ΜΙΚΡΟΥ ΧΑΡΤΗ",
  "winter2023_qol_minimap_desc": "Βέλη, εικονίδια ηρώων… είναι όλα υπέροχα. <i>«Γιατί πρέπει να διαλέξω;»</i> ουρλιάζετε κοιτώντας προς τον ουρανό. Λοιπόν, δεν χρειάζεται πλέον. Επειδή —ακολουθεί ιστορία του Dota— ο ουρανός είναι τζίνι που εκπληρώνει ευχές.",
  "winter2023_qol_ability_shape_indicator_title": "ΠΕΡΙΣΣΟΤΕΡΑ ΠΛΕΓΜΑΤΑ ΣΤΟΧΕΥΣΗΣ ΙΚΑΝΟΤΗΤΩΝ",
  "winter2023_qol_ability_shape_indicador_desc": "<i>«Γιατί λείπουν μερικά από τα πλέγματα στόχευσής μου;»</i> ουρλιάζετε κοιτώντας προς τον ουρανό. Πουφ! Παρουσιάζουμε ακόμα περισσότερες ικανότητες με ακριβείς προβολές των περιοχών επίδρασης.",
  "winter2023_qol_ability_icons_title": "ΚΑΤΑΣΤΑΣΕΙΣ ΕΙΚΟΝΙΔΙΩΝ ΙΚΑΝΟΤΗΤΩΝ",
  "winter2023_qol_ability_icons_desc": "Πλέον θα μπορείτε να αντιλαμβάνεστε με μια ματιά αν οι παθητικές σας ικανότητες έχουν απενεργοποιηθεί από θραύση του Silver Edge ή αν έχετε ακινητοποιηθεί και δεν μπορείτε να τηλεμεταφερθείτε, με τις νέες καταστάσεις εικονιδίων ικανότητας.",
  "winter2023_qol_item_tooltips_title": "ΚΑΛΥΤΕΡΕΣ ΕΠΕΞΗΓΗΣΕΙΣ ΑΝΤΙΚΕΙΜΕΝΩΝ",
  "winter2023_qol_item_tooltips_desc": "Προκειμένου να πάρουμε πληροφορίες στόχευσης για τα αντικείμενα, έπρεπε να οδηγήσουμε πολύ μέχρι τη βιβλιοθήκη και στη συνέχεια να τσακωθούμε για ώρα με την μπερδεμένη βιβλιοθηκονόμο. Τώρα, ο τύπος στόχευσης, ο τύπος ζημιάς, η δυνατότητα κατάλυσης και πολλά άλλα βρίσκονται στην επεξήγηση.",
  "winter2023_qol_xp_range_title": "ΔΕΙΚΤΗΣ ΒΕΛΗΝΕΚΟΥΣ ΕΜΠΕΙΡΙΑΣ",
  "winter2023_qol_xp_range_desc": "Η εμπειρία βρίσκεται παντού γύρω μας, έτοιμη να την ξεζουμίσετε, αρκεί να ξέρετε πού να τη βρείτε. Τώρα μπορείτε, απλά τοποθετώντας τον δείκτη του ποντικιού πάνω από το επίπεδο του ήρωά σας. Δεν χρειάζεται ALT!",
  "winter2023_qol_wisdom_rune_timer_title": "ΧΡΟΝΟΜΕΤΡΟ ΡΟΥΝΟΥ WISDOM DOTA PLUS",
  "winter2023_qol_wisdom_rune_timer_desc": "Για ρούνο αφιερωμένο στη σοφία, ο Ρούνος Σοφίας δεν ήταν και ό,τι πιο έξυπνο έχουμε δει όσον αφορά την εμφάνιση του χρόνου αναβίωσής του. Φαίνεται ότι έβαλε μυαλό και αγόρασε επιτέλους ρολόι.",
  "winter2023_qol_creep_bounties_title": "ΑΜΟΙΒΕΣ ΚΡΙΠΑΚΙΩΝ",
  "winter2023_qol_creep_bounties_desc": "<i>«Γιατί δεν μπορώ να δω πόση αμοιβή χρυσού παρέχει κάθε κριπάκι, στο μέτωπο και στους καταυλισμούς;»</i> ουρλιάζετε κοιτώντας προς τον ουρανό. «Αλήθεια;» αναρωτιέται το ουράνιο τζίνι, «Εγώ θα είχα ζητήσει περισσότερες ευχές. Τέλος πάντων, ορίστε. Τα λέμε στο επόμενο Frostivus.»",
  "winter2023_qol_misc_title": "…ΚΑΙ ΑΛΛΕΣ ΒΕΛΤΙΩΣΕΙΣ ΔΙΕΠΑΦΗΣ",
  "winter2023_qol_misc_desc": "Στο Dota υπάρχουν πάρα πολλές πληροφορίες που πρέπει να συγκρατεί κανείς, οπότε κάναμε πολλές βελτιώσεις στο HUD για να βοηθήσουμε. Με δεξί κλικ στα αντικείμενα της λίστας αντικειμένων σας, θα επισημαίνεται πλέον το αντικείμενο που έχετε επιλέξει με τα υπόλοιπα να γίνονται πιο σκούρα. Δεν θα ξαναρίξετε ούτε θα ξαναπουλήσετε λάθος αντικείμενο. Τα δημοφιλή αντικείμενα τώρα θα εμφανίζουν ένα γκρι πλαίσιο μόνο όταν έχετε αρκετό χρυσό για να τα αγοράσετε. Τα πλαίσια δεν θα προκαλούν πλέον σύγχυση. Τα κόστη ζωής των αντικειμένων δεν θα εμφανίζονται πλέον, όπως και η ενέργεια, όταν τα αντικείμενα βρίσκονται στο σακίδιό σας. Τέλος, όταν εισέρχεστε σε λειτουργία Demo ηρώων, ο ήρωάς σας θα εμφανίζεται πλέον μακριά από τους πύργους, για να έχετε αρκετό χώρο να δοκιμάσετε όλα όσα θέλετε.",
  "winter2023_profileshowcase_section_title": "ΠΑΡΟΥΣΙΑΣΗ ΠΡΟΦΙΛ",
  "winter2023_profileshowcase_introduction": "Ακόμα περισσότεροι τρόποι να εκφραστείτε",
  "winter2023_profileshowcase_animations_title": "ΚΙΝΗΣΕΙΣ",
  "winter2023_profileshowcase_animations_desc": "Κουραστήκατε να βλέπετε τους ήρωές σας να ξεροσταλιάζουν; Τώρα μπορείτε να επιλέξετε κινήσεις για αυτούς.",
  "winter2023_profileshowcase_anchoring_title": "ΤΟΠΟΘΕΤΗΣΗ ΣΕ ΗΡΩΕΣ",
  "winter2023_profileshowcase_anchoring_desc": "Μπορείτε πλέον να τοποθετείτε άλλα στοιχεία προφίλ σε μοντέλα ηρώων και να τα παρακολουθείτε να ακολουθούν την κίνηση.",
  "winter2023_profileshowcase_freezeframes_title": "ΠΑΓΩΜΑ ΚΑΡΕ",
  "winter2023_profileshowcase_freezeframes_desc": "Παγώστε οποιοδήποτε καρέ μιας κίνησης για να απαθανατίσετε την πιο τέλεια αμήχανη στιγμή.",
  "winter2023_profileshowcase_gridsnapping_title": "ΕΥΘΥΓΡΑΜΜΙΣΗ ΠΛΕΓΜΑΤΟΣ",
  "winter2023_profileshowcase_gridsnapping_desc": "Προσπαθείτε να ευθυγραμμίσετε τα πάντα με τα χαζά ανθρώπινα μάτια σας και το «αλάνθαστο» ένστικτό σας; Γιατί δεν αφήνετε τον Ευθυγραμμιστή™ να το κάνει τέλεια για εσάς;",
  "winter2023_profileshowcase_improved_portraits_title": "ΒΕΛΤΙΩΜΕΝΑ ΠΟΡΤΡΕΤΑ",
  "winter2023_profileshowcase_improved_portraits_desc": "Επιλέξτε μεταξύ της έκδοσης 3D ή 2D του μοντέλου για το πορτρέτο των αγαπημένων σας ηρώων. Προβάλετε το επίπεδο του εμβλήματος ήρωα, καθώς και τα κειμήλιά σας.",
  "winter2023_profileshowcase_more_items_title": "ΠΕΡΙΣΣΟΤΕΡΑ ΜΟΝΤΕΛΑ",
  "winter2023_profileshowcase_more_items_desc": "Κλητεύσεις, ματάκια, χλευασμοί, κατοικίδια, αξιοσημείωτα στατιστικά αντικειμένων. Ό,τι μπορείτε να σκεφτείτε μπορείτε να βάλετε και στο προφίλ σας.",
  "winter2023_armory_section_title": "ΟΠΛΟΣΤΑΣΙΟ",
  "winter2023_armory_introduction": "Περισσότερες βελτιώσεις στο Οπλοστάσιό σας",
  "winter2023_armory_grouping_title": "ΒΕΛΤΙΩΜΕΝΗ ΟΜΑΔΟΠΟΙΗΣΗ",
  "winter2023_armory_grouping_desc": "Όλα τα αντικείμενα μπορούν πλέον να ομαδοποιηθούν ανά όνομα ήρωα.",
  "winter2023_armory_filters_tags_title": "ΤΑ ΦΙΛΤΡΑ ΚΑΙ ΟΙ ΕΤΙΚΕΤΕΣ ΕΠΕΣΤΡΕΨΑΝ",
  "winter2023_armory_filters_tags_desc": "Μπορείτε να φιλτράρετε χρησιμοποιώντας αναζήτηση λέξεων-κλειδιών και να δημιουργήσετε προβολές με προκαθορισμένα κριτήρια αναζήτησης.",
  "winter2023_armory_stickers_title": "ΒΡΕΙΤΕ ΑΥΤΟΚΟΛΛΗΤΑ",
  "winter2023_armory_stickers_desc": "Δείτε αυτοκόλλητα που δεν έχετε και ρίξτε μια ματιά σε όσα ήταν διαθέσιμα παλιά.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Νέα Premium σετ, αποστολές και ανταμοιβές συλλόγων",
  "winter2023_dotaplus_premium_sets_title": "ΝΕΑ PREMIUM ΣΕΤ",
  "winter2023_dotaplus_premium_sets_desc": "Αυτή η σεζόν του Dota Plus αποκαλύπτει τρία νέα Premium σετ, που είναι διαθέσιμα για αγορά στο Μαγαζί Πετραδιών με 150.000 πετράδια το καθένα.",
  "winter2023_dotaplus_seasonal_quests_title": "ΑΝΑΝΕΩΣΗ ΕΠΟΧΙΑΚΩΝ ΑΠΟΣΤΟΛΩΝ",
  "winter2023_dotaplus_seasonal_quests_desc": "Περισσότεροι τρόποι για να αυξήσετε τα πετράδια σας.",
  "winter2023_dotaplus_guild_rewards_title": "ΕΝΗΜΕΡΩΜΕΝΕΣ ΑΝΤΑΜΟΙΒΕΣ ΣΥΛΛΟΓΟΥ",
  "winter2023_dotaplus_guild_rewards_desc": "Όπως πάντα, νέα emoticon, σπρέι και ηχητικά ροδέλας συνομιλίας είναι διαθέσιμα σε συλλόγους με υψηλή βαθμολογία.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Silent Wight",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silver Squall",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo and Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (Συμπεριλαμβάνεται ξεκλείδωμα Περσόνας)",
  "frosty_treasure_treasure_name_5": "Frosty the Sew-Man",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Jingle Fist",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "The Abominable Snowbeast",
  "frosty_treasure_hero_name_8": "Crystal Maiden (Συμπεριλαμβάνεται ξεκλείδωμα Περσόνας)",
  "frosty_treasure_treasure_name_8": "Guardian Snow Angel",
  "frosty_treasure_hero_name_9": "Wraith King (Συμπεριλαμβάνεται ξεκλείδωμα Arcana)",
  "frosty_treasure_treasure_name_9": "King Kringle",
  "frosty_treasure_hero_name_10": "Μεταφορέας",
  "frosty_treasure_treasure_name_10": "Gingerbread Baby Roshan",
  "winter2023_gameplay_section_title": "ΕΝΗΜΕΡΩΣΕΙΣ ΠΑΙΧΝΙΔΙΟΥ",
  "winter2023_patchnotes_new_items_title": "ΝΕΑ ΚΑΙ ΕΝΗΜΕΡΩΜΕΝΑ ΑΝΤΙΚΕΙΜΕΝΑ",
  "winter2023_patchnotes_new_items_introduction": "Φαίνεται ότι υπάρχει ένα ακόμα δώρο στον σάκο του Βασιλιά Kringle και, εφόσον είναι δικαίωμά του, μπορεί να το διεκδικήσει παλεύοντας με ένα παιδί μέχρι θανάτου. Κραδαίνει το μεγάλο σπαθί του και ναι, το δώρο του ανήκει μετά από μάχη! Είναι πολλά ανακατασκευασμένα αντικείμενα Dota, μερικά ολοκαίνουρια και μερικά παλιά αγαπημένα.",
  "winter2023_patchnotes_section_title": "ΣΗΜΕΙΩΣΕΙΣ ΕΝΗΜΕΡΩΣΗΣ 7.35"
}