// 3732.js

{
  "language": "romanian",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Împodobește, creepule, bradul cu accesorii festive, actualizarea de joc 7.35, trei seturi premium noi pentru Dota Plus și o tonă de îmbunătățiri privind experiența de joc",
  "winter2023_subtitle_short": "Accesorii festive, o actualizare de joc și o tonă de îmbunătățiri privind experiența de joc",
  "winter2023_section_introduction": "Acum mult timp, Frostivus avea o altă <i>însemnătate</i>. Nu era vorba despre prieteni, familie sau sentimentele tale, ci despre un singur lucru: <i>primirea de cadouri</i>. Dar, la un moment dat, tot acel materialism a dispărut din sărbătoare, iar inimile proaste ale oamenilor s-au umplut brusc cu spiritul generozității. Așa că anul acesta redescoperim ADEVĂRATUL sens al sărbătorii de Frostivus: accesoriile.",
  "winter2023_frostivus_section_title": "Comoara Frostivus",
  "winter2023_frostivus_section_date": "14 decembrie 2023 - 11 ianuarie 2024",
  "winter2023_frostivus_section_introduction": "Câștigă meciuri pentru a-ți umple contorul cu spirit Frostivus și vei primi un cufăr Frostivus încuiat ȘI un mic cadou aleatoriu, care variază de la graffitiuri până la emoticoane și abțibilduri.",
  "winter2023_frostivus_earn_chests": "Obține cufere",
  "winter2023_frostivus_how_to_earn_chests": "De fiecare dată când îți umpli contorul cu spirit Frostivus, spiritul sărbătorii se va manifesta sub forma unui cufăr Frostivus 2023 încuiat.",
  "winter2023_frostivus_buy_keys": "Cumpără chei",
  "winter2023_frostivus_how_to_buy_keys": "Cumpără chei pentru a descuia cufere și a descoperi adevăratul sens al comorilor din interior.",
  "winter2023_naughty_or_nice_section_title": "Ai fost...",
  "winter2023_naughty_or_nice_naughty": "o fire neascultătoare?",
  "winter2023_naughty_or_nice_naughty_desc": "N-are rost să negi. King Kringle știe. Ți-a verificat scorul comportamental de două ori și vine cu ciocanul de interdicții să spulbere orice cont de smurf de la băieții și fetele care nu ascultă, înainte de a înmâna penalizări conturilor principale asociate ale acestora.",
  "winter2023_naughty_or_nice_nice": "sau una cuminte?",
  "winter2023_naughty_or_nice_nice_desc": "Ai jucat Dota anul acesta fără să încalci regulile? Grozav! King Kringle are un <i>alt</i> tip de ciocan pentru tine! Nu te amăgi, <i>căci n-o să scapi de lovitura acestuia</i>. Dar după ce te vei trezi în spital, te vei întreba daca a fost doar un vis. Dar ce ai lângă pernă? <i>Un cadou Frostivus gratuit</i>! Ce ți-a adus scorul comportamental? Deschide cadoul pentru a afla...",
  "winter2023_naughty_or_nice_nice_desc2": "Ai un scor comportamental model? Grozav! King Kringle are un <i>alt</i> tip de ciocan pentru tine! Nu te amăgi, căci n-o să scapi de lovitura acestuia. Dar după ce te vei trezi în spital, te vei întreba dacă a fost doar un vis. Dar ce ai lângă pernă? O cheie <i>Frostivus gratuită!</i>",
  "winter2023_frostivus_section_event_title": "Comori Frostivus 2023",
  "winter2023_frostivus_section_event_introduction": "Seturi nou-nouțe pentru eroii tăi preferați sunt însoțite de câteva seturi preferate din anii anteriori, dar și de Arcana pentru Wraith King și Persona pentru Crystal Maiden!",
  "winter2023_bonus_item_title": "Spiritul generozității (cu moderație)",
  "winter2023_bonus_item_desc": "E un miracol de Frostivus! De fiecare dată când deschizi un set, vei avea, <i>de asemenea</i>, șansa de a debloca o variantă bonus neobișnuită pentru unul dintre obiectele <i>din</i> acel set! Dar, așa cum se întâmplă cu majoritatea miracolelor, șansele de a pune mâna pe un asemenea obiect sunt aproape la fel de mari ca șansele de a fi lovit de un meteorit, așa că încearcă să nu-ți faci spațiu în arsenal din timp.",
  "winter2023_bonus_item_fullset": "Set complet",
  "winter2023_bonus_item_unusual": "Variantă neobișnuită",
  "winter2023_stocking_stuffer_title": "Mici cadouri",
  "winter2023_stocking_stuffer_desc": "Dacă realitatea cruntă a paragrafului anterior cu privire la șansa de a primi un cadou bonus pe lângă cadoul standard te-a deprimat, stai și-ascultă! Patrula cu premii Frostivus se va opri <i>garantat</i> la casa ta, de fiecare dată când îți umpli contorul de spirit Frostivus, cu unul dintre darurile grozave de mai jos.",
  "winter2023_stocking_stuffer_sprays_stickers": "Graffitiuri și abțibilduri",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Aceste graffitiuri noi vor fi disponibile doar pe perioada evenimentului Frostivus, dar, la solicitarea comunității, abțibildurile vor putea fi utilizate pentru totdeauna. Lipește-le peste tot profilul tău.",
  "winter2023_stocking_stuffer_emoticons": "Emoticoane",
  "winter2023_stocking_stuffer_emoticons_desc": "Înainte ca Marie Curie să inventeze emoticoanele, nimeni n-a avut posibilitatea să-și exprime sentimentele. Dota salută sacrificiul acesteia, fiindcă primele variante erau foarte radioactive.",
  "winter2023_stocking_stuffer_ward": "Frosty the North Ward",
  "winter2023_stocking_stuffer_ward_desc": "Informații secrete bonus: omul ăsta de zăpadă în miniatură este mai puternic decât AMBELE Ancienturi. Dar nu vei afla asta niciodată. De ce? E <i>modest</i>.",
  "winter2023_stocking_stuffer_courier": "Seal Courier",
  "winter2023_stocking_stuffer_courier_desc": "Vezi cât de adorabil e micuțul ăsta? Iar asta nu e tot... e și comestibil. E plin de carne suculentă. Dacă într-adevăr n-ai ce pune pe masă, acesta îți poate potoli foamea.",
  "winter2023_frostivus_festive_items_title": "Obiecte festive",
  "winter2023_frostivus_party_hats": "Pălării Frostivus",
  "winter2023_frostivus_party_hats_description": "Avem pălării Frostivus pentru toată lumea! N-ai cap? Nicio problemă! Prea multe capete? Imposibil! Patrula de premii Frostivus vine cu un camion plin cu pălării pregătite pentru absolut orice se aseamănă unui cap.",
  "winter2023_frostivus_free_event_items": "Gratuități",
  "winter2023_frostivus_free_event_items_description": "În edițiile anterioare ale evenimentului Frostivus, obiectele consumabile aveau un număr limitat de utilizări. Anul acesta le poți folosi de ori câte ori vrei! E un dar. Ei bine, mai degrabă un împrumut. Patrula de premii Frostivus se va întoarce pentru a le recupera la finalul evenimentului.",
  "winter2023_frostivus_high_fives": "Bate palma",
  "winter2023_frostivus_high_fives_description": "Spre deosebire de celelalte ocazii de bătut palma, cu familia și prietenii, Frostivus este mult mai festiv, ca toastul cu ciocolată caldă. Sinceri să fim, prietenii și familia ta sunt obosiți să to bată palma.",
  "winter2023_frostivus_section_treasure_title": "Comori Frostivus 2023",
  "winter2023_clientupdate_section_title": "Actualizări pentru client",
  "winter2023_clientupdate_introduction": "Ei bine, bunul King Kringle a oferit toate cadourile sale pentru încă un an. Festivus fericit, tuturor, conduceți prudent, dar AȘTEPTAȚI! Mai e <i>ceva</i> la fundul sacului!",
  "winter2023_qol_section_title": "Îmbunătățiri privind experiența de joc",
  "winter2023_qol_introduction": "Informații mai bune pentru decizii mai bune",
  "winter2023_qol_tower_range_indicator_title": "Indicator pentru distanța de atac a turnurilor",
  "winter2023_qol_tower_range_indicator_desc": "Te-ai săturat să fii atacat pe neașteptate de turn atunci când se află alte unități în apropiere? Mulțumită efectelor îmbunătățite, acum vei înțelege mai ușor dacă e momentul potrivit pentru a te aventura sau nu.",
  "winter2023_qol_teleport_time_title": "Durata de teleportare",
  "winter2023_qol_teleport_time_desc": "E puțin cunoscut faptul că durata teleportărilor din Dota este variabilă, iar până acum era invizibilă. Acum poți vedea acea durată de transfer atunci când folosești Town Portal Scroll.",
  "winter2023_qol_minimap_title": "Pictograme pentru minihartă",
  "winter2023_qol_minimap_desc": "Săgeți, pictograme pentru eroi, ambele sunt minunate. <i>„Dar de ce trebuie să aleg?”</i> strigi la cer. Ei bine, acum nu mai trebuie, pentru că cerul e un duh care ți-a ascultat rugăciunile și ți-a îndeplinit dorința.",
  "winter2023_qol_ability_shape_indicator_title": "Mai multe reticule pentru abilități",
  "winter2023_qol_ability_shape_indicador_desc": "<i>„De ce unele dintre abilitățile mele nu au reticule?”</i> continui să strigi către cer. Puf! Acum și mai multe abilități vor indica precis zona de efect.",
  "winter2023_qol_ability_icons_title": "Pictograme pentru stările abilităților",
  "winter2023_qol_ability_icons_desc": "Indiferent dacă abilitățile tale pasive sunt perturbate de Silver Edge sau ești înrădăcinat și nu poți folosi Blink, acum îți poți da seama cu ușurință dacă o abilitate este dezactivată, datorită noilor noastre pictograme pentru stările abilităților.",
  "winter2023_qol_item_tooltips_title": "Descrieri îmbunătățite pentru obiecte",
  "winter2023_qol_item_tooltips_desc": "De regulă, pentru a obține informații despre țintirea cu abilitățile obiectelor, trebuia să parcurgi un drum lung cu mașina până la bibliotecă, iar apoi să te cerți cu un bibliotecar care părea derutat. Acum, tipul de țintire, tipul de daune, informații despre faptul dacă efectele pot fi descântate și multe altele sunt disponibile în descrierea obiectelor.",
  "winter2023_qol_xp_range_title": "Indicator pentru raza de experiență",
  "winter2023_qol_xp_range_desc": "Experiența este pretutindeni, așteptând să fie revendicată de cei însetați. Trebuie doar să știi unde s-o găsești. Acum o poți face: trebuie doar să treci cu mouse-ul peste nivelul eroului tău. Poți da uitării nevoia de a apăsa tasta ALT!",
  "winter2023_qol_wisdom_rune_timer_title": "Temporizator Dota+ pentru runa de înțelepciune",
  "winter2023_qol_wisdom_rune_timer_desc": "Pentru o rună dedicată înțelepciunii, runa de înțelepciune era cam prostuță, fiindcă nu știa ce-i ăla temporizator de apariție. Se pare că s-a deșteptat, iar în cele din urmă și-a luat un ceas.",
  "winter2023_qol_creep_bounties_title": "Recompense de la creepi",
  "winter2023_qol_creep_bounties_desc": "<i>„De ce nu pot vedea valoarea recompensei pentru fiecare creep, atât în culoar, cât și în tabere?”</i> urli spre cer. „Pe bune?”, a răspuns duhul cerului. „Eu aș fi cerut mai multe dorințe. Oricum, poftim. Ne vedem la următorul Frostivus.”",
  "winter2023_qol_misc_title": "... și alte îmbunătățiri pentru interfața de joc",
  "winter2023_qol_misc_desc": "Cu toții știm că Dota este plin de informații ce trebuie asimilate, așa că am realizat câteva îmbunătățiri pentru interfața de joc care să-ți vină în sprijin. Atunci când apeși clic dreapta pe un obiect din inventarul tău, selecția ta va fi evidențiată prin reducerea opacității celorlalte obiecte, astfel că nu vei mai vinde sau arunca din greșeală obiectul greșit. De asemenea, obiectele populare au acum doar un chenar gri atunci când ai suficient aur pentru a le cumpăra. Gata cu discrepanțele dintre chenare. De asemenea, costurile de viață și mana ale obiectelor sunt ascunse cât timp acestea se află în rucsacul tău. În cele din urmă, zona de apariție a eroului tău în modul demo pentru eroi se află departe de turnuri, astfel încât să ai suficient spațiu pentru a încerca orice îți dorești.",
  "winter2023_profileshowcase_section_title": "Afișierul profilului",
  "winter2023_profileshowcase_introduction": "Mai multe moduri ca niciodată de a te exprima",
  "winter2023_profileshowcase_animations_title": "Animații",
  "winter2023_profileshowcase_animations_desc": "Te-ai săturat să vezi cum eroii tăi doar stau molâi pe loc? Acum poți alege o secvență de animații pentru a-i pune în mișcare.",
  "winter2023_profileshowcase_anchoring_title": "Ancorarea pe eroi",
  "winter2023_profileshowcase_anchoring_desc": "Acum poți ancora alte elemente de profil pe modelele eroilor și să vezi cum se mișcă odată cu animația.",
  "winter2023_profileshowcase_freezeframes_title": "Stop-cadre",
  "winter2023_profileshowcase_freezeframes_desc": "Oprește animația la orice cadru pentru a surprinde acel moment perfect de incomod.",
  "winter2023_profileshowcase_gridsnapping_title": "Alinierea la grilă",
  "winter2023_profileshowcase_gridsnapping_desc": "Ai probleme cu alinierea din cauza ochilor tăi varză de om și a „instinctelor”? De ce nu lași asta în seama Gril-Aliniatorului™?",
  "winter2023_profileshowcase_improved_portraits_title": "Portrete îmbunătățite",
  "winter2023_profileshowcase_improved_portraits_desc": "Poți alege între versiunile de portrete 2D și 3D ale eroilor preferați. Etalează-ți insigna pentru nivelul eroului și relicvele tale.",
  "winter2023_profileshowcase_more_items_title": "Mai multe modele",
  "winter2023_profileshowcase_more_items_desc": "Creaturi invocare, warduri, batjocuri, creaturi de companie, obiecte evidențiate... orice-ai vrea, acum poate fi inclus acum pe profilul tău.",
  "winter2023_armory_section_title": "Arsenal",
  "winter2023_armory_introduction": "Mai multe îmbunătățiri pentru inventarul tău",
  "winter2023_armory_grouping_title": "Grupare îmbunătățită",
  "winter2023_armory_grouping_desc": "Toate obiectele pot fi grupate acum în funcție de numele eroului.",
  "winter2023_armory_filters_tags_title": "Filtrele și etichetele s-au întors",
  "winter2023_armory_filters_tags_desc": "Folosește cuvinte cheie pentru a filtra rezultatele și a crea vizualizări cu criterii predefinite de căutare.",
  "winter2023_armory_stickers_title": "Caută abțibilduri",
  "winter2023_armory_stickers_desc": "Vezi abțibildurile pe care nu le deții și poți chiar să le răsfoiești pe cele care au fost disponibile anterior.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Seturi premium, misiuni și recompense noi pentru clanuri",
  "winter2023_dotaplus_premium_sets_title": "Seturi premium noi",
  "winter2023_dotaplus_premium_sets_desc": "Sezonul acesta de Dota Plus vinde cu trei seturi premium noi care pot fi achiziționate din magazinul cu fragmente pentru prețul de 150.000 de fragmente fiecare.",
  "winter2023_dotaplus_seasonal_quests_title": "Actualizarea misiunilor de sezon",
  "winter2023_dotaplus_seasonal_quests_desc": "Mai multe moduri de a-ți mări rezerva de fragmente.",
  "winter2023_dotaplus_guild_rewards_title": "Recompense de clan actualizate",
  "winter2023_dotaplus_guild_rewards_desc": "Ca de obicei, noutăți în materie de emoticonuri, graffitiuri și rotițe de chat sunt acum disponibile pentru clanurile bine-cotate.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Silent Wight",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silver Squall",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo and Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (variantă inclusă pentru Persona)",
  "frosty_treasure_treasure_name_5": "Frosty the Sew-Man",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Jingle Fist",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "The Abominable Snowbeast",
  "frosty_treasure_hero_name_8": "Crystal Maiden (variantă inclusă pentru Persona)",
  "frosty_treasure_treasure_name_8": "Guardian Snow Angel",
  "frosty_treasure_hero_name_9": "Wraith King (variantă inclusă pentru Arcana)",
  "frosty_treasure_treasure_name_9": "King Kringle",
  "frosty_treasure_hero_name_10": "Curier",
  "frosty_treasure_treasure_name_10": "Gingerbread Baby Roshan",
  "winter2023_gameplay_section_title": "Actualizări de joc",
  "winter2023_patchnotes_new_items_title": "Obiecte din joc noi și actualizate",
  "winter2023_patchnotes_new_items_introduction": "Se pare că mai e un cadou în sacul lui King Kringle, iar, conform tradiției sale, îl poate revendica dacă luptă până la moarte împotriva unui copil. Lovește cu spada lungă și, ei bine, darul i se cuvine! Acel cadou constă într-o selecție de obiecte revizuite din Dota, unele fiind noi-nouțe, altele numărându-se printre obiectele tale preferate mai vechi.",
  "winter2023_patchnotes_section_title": "Jurnalul actualizării 7.35",
  "winter2023_recipe": "Rețetă:"
}