// 8180.js

{
  "language": "finnish",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Koristele huurteiset huoneesi juhlakosmetiikalla, 7.35-pelipäivityksellä, kolmella Dota Plus Premium -kokoelmalla ja mahtavilla QoL-ominaisuuksilla",
  "winter2023_subtitle_short": "Juhlavia kosmeettisia esineitä, pelipäivitys ja QoL-ominaisuuksia",
  "winter2023_section_introduction": "Frostivus <i>tarkoitti</i> aiemmin jotain. Ei ollut kyse kavereista, perheestä tai tunteista. Kyse oli siitä, että <i>saa lahjoja</i>. Jossain vaiheessa kaikki se materialismi tihkui pois juhlasta, ja yhtäkkiä jokaisen tyhmä sydän uhkui antamisen henkeä. Tänä vuonna olemme löytäneet uudelleen Frostivuksen todellisen merkityksen: kosmeettiset esineet.",
  "winter2023_frostivus_section_title": "Frostivus-aarrearkut",
  "winter2023_frostivus_section_date": "14.12.23–11.1.24",
  "winter2023_frostivus_section_introduction": "Voita otteluita täyttääksesi Frostivuksen juhlamielimittaria ja ansaitse lukittuja Frostivus-aarteita ja satunnaisia sukantäytteitä, kuten graffiteja, hymiöitä ja tarroja.",
  "winter2023_frostivus_earn_chests": "Ansaitse aarteita",
  "winter2023_frostivus_how_to_earn_chests": "Aina kun Frostivuksen juhlamielimittari täyttyy, Frostivuksen henki virtaa lävitsesi lukitun Frostivus 2023 -aarteen muodossa.",
  "winter2023_frostivus_buy_keys": "Osta avaimia",
  "winter2023_frostivus_how_to_buy_keys": "Ostamalla avaimia voit avata aarteita ja löytää niiden todellisen merkityksen.",
  "winter2023_naughty_or_nice_section_title": "Oletko ollut...",
  "winter2023_naughty_or_nice_naughty": "tuhma?",
  "winter2023_naughty_or_nice_naughty_desc": "Kyllä joku on sen muistiin merkinnyt, ja Juhlakunkkukin tietää saa, kuka kiellon ansaitsee. Juhlakunkku matkaan jo käy. Siis: ei huijata saa, ei smurffata saa, reilu peli on paljon mukavampaa. Smurffaajia rangaistaan!",
  "winter2023_naughty_or_nice_nice": "vai kiltti?",
  "winter2023_naughty_or_nice_nice_desc": "Pelasitko tänä vuonna Dotaa reilusti, rikkomatta sääntöjä? Hienoa! Saat Juhlakunkulta <i>erilaisen</i> vasaran – jolla hän kumauttaa sinua! Heräät sairaalasta ja mietit, oliko se unta ja mikä ihme siinä tyynyllä on. Se on <i>ilmainen Frostivus-lahja!</i> Katso, mitä ansaitsit käytöspisteillä...",
  "winter2023_naughty_or_nice_nice_desc2": "Ovatko käyttäytymispisteesi moitteettomat? Hienoa! Juhlakunkulla on <i>erilainen</i> vasara sinulle! Hän lyö sillä sinua joka tapauksessa. Mutta kun heräät sairaalassa ja mietit, oliko se kaikki unta? Mikä on tuo esine tyynyni päällä? Se on <i>ilmainen Frostivus-avain!</i>",
  "winter2023_frostivus_section_event_title": "Vuoden 2023 Frostivus-aarteet",
  "winter2023_frostivus_section_event_introduction": "Täysin uusia esinekokoelmia lempisankareillesi ja juhlapyhien suosikkien paluu. Kaiken lisäksi Wraith Kingin salatieteellisen esineen ja Crystal Maidenin persoonan yllätysvierailu!",
  "winter2023_bonus_item_title": "(Hyvin satunnaisen) antamisen iloa",
  "winter2023_bonus_item_desc": "Oikea Frostivus-ihme! Aina kun avaat kokoelman, sinulla on mahdollisuus saada <i>myös</i> ylimääräinen Epätavallinen versio yhdestä <i>kyseisen kokoelman</i> esineestä! Useimpien ihmeiden tavoin mahdollisuus saada esine on kuitenkin samaa luokkaa meteori-iskun kanssa, joten älä aivan vielä raivaa sille tilaa asevarastosta.",
  "winter2023_bonus_item_fullset": "Täysi kokoelma",
  "winter2023_bonus_item_unusual": "Epätavallinen versio",
  "winter2023_stocking_stuffer_title": "Sukantäytteet",
  "winter2023_stocking_stuffer_desc": "Jos viimeisen kappaleen ankara vakuutusmatemaattinen todellisuus sai sinut masentumaan todennäköisyydestä saada bonuslahja tavallisen lahjan lisäksi, ota kantaa! Frostivuksen palkintopartio pysähtyy <i>taatusti</i> kotisi kohdalla joka kerta, kun saavutat Frostivuksen juhlamielimittarin maksimilukeman, ja tuo mukanaan jonkin alla olevista mahtavista lahjoista.",
  "winter2023_stocking_stuffer_sprays_stickers": "Graffitit ja tarrat",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Uudet graffitit ovat pysyviä vain Frostivuksessa, mutta niiden tarraversiot ovat pysyviä myös sen jälkeen. Liimaile niitä profiiliisi.",
  "winter2023_stocking_stuffer_emoticons": "Hymiöt",
  "winter2023_stocking_stuffer_emoticons_desc": "Ennen kuin Marie Curie keksi hymiöt, kenelläkään ei ollut kykyä ilmaista tunteitaan. Dota arvostaa hänen uhraustaan, koska varhaiset hymiöt olivat erittäin radioaktiivisia.",
  "winter2023_stocking_stuffer_ward": "Frosty, pohjoisen wardi",
  "winter2023_stocking_stuffer_ward_desc": "Salainen bonustarina: keskenkasvuinen lumiukko on voimakkaampi kuin molemmat muinaislinnoitukset yhdessä, mutta et vaan voi nähdä sitä, koska hän on niin <i>vaatimaton</i>.",
  "winter2023_stocking_stuffer_courier": "Seal-kuriiri",
  "winter2023_stocking_stuffer_courier_desc": "Katso, kuinka söpö tämä pieni kaveri on. Ja kaiken lisäksi maukas! Runsaasti lihaa ja rasvaa koko jutussa, jos joutuu Donnerin uudisraivaajajoukko -tyyppiseen tilanteeseen.",
  "winter2023_frostivus_festive_items_title": "Juhlaesineet",
  "winter2023_frostivus_party_hats": "Frostivus-hatut",
  "winter2023_frostivus_party_hats_description": "Meillä on Frostivus-hattuja kaikille! Oletko päätön? Ei huolta! Liian monta päätä? Ei ole mahdollista! Frostivuksen palkintopartio peruuttaa hattukuormaa ja nostaa lavalle kaiken, mikä edes hieman muistuttaa päätä.",
  "winter2023_frostivus_free_event_items": "Ilmaislahjat",
  "winter2023_frostivus_free_event_items_description": "Frostivuksen menneisyydessä kulutustarvikkeita pystyi lataamaan rajallisesti. Tänä vuonna voit käyttää niin monta kuin haluat! Ajattele sitä lahjana. No, enemmän lainana, oikeastaan. Frostivuksen palkintopartio tulee takaisin keräämään ne pois tapahtuman päätteeksi.",
  "winter2023_frostivus_high_fives": "Ylävitoset",
  "winter2023_frostivus_high_fives_description": "Toisin kuin kavereille ja perheelle jatkuvasti antamasi ylävitoset, Frostivus-ylävitoset ovat enemmänkin kuin juhlavia kaakaomukien kilistelyjä. Jos totta puhutaan, kaverisi ja perheesi olisivat iloisia, jos pitäisit pientä taukoa koko ylävitostelusta.",
  "winter2023_frostivus_section_treasure_title": "Vuoden 2023 Frostivus-aarteet",
  "winter2023_clientupdate_section_title": "Sovelluspäivitykset",
  "winter2023_clientupdate_introduction": "Vanha kunnon Juhlakunkku on jälleen jakanut kaikki lahjansa. Hyvää Frostivusta kaikille ja ajelkaa turvallisesti. Hei odota! Säkin pohjalla on vielä <i>jotakin</i>!",
  "winter2023_qol_section_title": "Elämänlaatu",
  "winter2023_qol_introduction": "Parempaa tietoa parempaan päätöksentekoon",
  "winter2023_qol_tower_range_indicator_title": "Tornin etäisyysilmaisin",
  "winter2023_qol_tower_range_indicator_desc": "Oletko kyllästynyt siihen, että et tiedä, milloin torni tähtää kohti jotain tärkeää (eli itseäsi)? Parannetut tehosteet auttavat huomaamaan, milloin on turvallista hyökätä tai milloin on aika paeta.",
  "winter2023_qol_teleport_time_title": "Teleporttausaika",
  "winter2023_qol_teleport_time_desc": "On vähän tunnettu tosiasia, että teleporttausajat Dotassa vaihtelevat – eikä sitä ole edes voitu nähdä aiemmin. Nyt voit tarkistaa ajan ennen kuin käytät Town Portal Scrollia.",
  "winter2023_qol_minimap_title": "Karttakuvakkeet",
  "winter2023_qol_minimap_desc": "Nuolet, sankarikuvakkeet – ne ovat tärkeitä. <i>\"Miksi minun täytyy valita?\"</i>, sinä huudat. Ei sinun tarvitsekaan. Sillä Dotan taustatarinan ansiosta toiveesi toteutuu.",
  "winter2023_qol_ability_shape_indicator_title": "Enemmän kykyverkkoja",
  "winter2023_qol_ability_shape_indicador_desc": "\"<i>Miksi jotkut kykyverkoistani puuttuvat?\"</i>, huudat. Simsalabim! Nyt entistä enemmän kykyjä tarkemmalla vaikutusalueen näytöllä.",
  "winter2023_qol_ability_icons_title": "Kykykuvakkeen tilat",
  "winter2023_qol_ability_icons_desc": "Vaikka Silver Edge olisi rikkonut passiivisi tai olisit juurtunut maahan etkä voi räpäyttää silmiäsi, voit nyt yhdellä silmäyksellä todeta, onko kyky poistettu käytöstä uusien kykykuvaketilojen avulla.",
  "winter2023_qol_item_tooltips_title": "Paremmat esineiden kuvaukset",
  "winter2023_qol_item_tooltips_desc": "Jos halusi ennen tarkempia tietoja esineistä, piti raahautua kirjastoon ja kinata pöllämystyneen kirjastovirkailijan kanssa. Nyt kohde- ja vahinkotyyppi, puhdistustieto ja paljon muuta löytyy työkaluvihjeestä.",
  "winter2023_qol_xp_range_title": "Kokemuspistealueen ilmaisin",
  "winter2023_qol_xp_range_desc": "Kokemuspisteitä on vaikka muille jakaa, jos vain tietää, mistä etsiä. Nyt löytäminen käy helposti pitämällä hiirtä sankarin tason päällä. Ilman ALT-näppäintä!",
  "winter2023_qol_wisdom_rune_timer_title": "Dota Plus -viisausriimuajastin",
  "winter2023_qol_wisdom_rune_timer_desc": "Viisausriimu oli ennen nimestään huolimatta aika typerä, mitä sen ilmestymisajastimen näkymiseen tuli. Se näyttää viisastuneen ja hankkineen kellon.",
  "winter2023_qol_creep_bounties_title": "Kätyripalkkiot",
  "winter2023_qol_creep_bounties_desc": "<i>\"Miksi en näe, kuinka paljon palkkiota saa kustakin kätyristä joko linjalla tai leireillä?\"</i>, kysyt turhautuneena. \"Ihanko totta?\", lahjojen henki sanoo. \"Odotin enemmän toiveita. Joka tapauksessa, toteutan toiveesi. Nähdään taas ensi Frostivuksena.\"",
  "winter2023_qol_misc_title": "...ja muita parannuksia ulkoasuun",
  "winter2023_qol_misc_desc": "Dotassa on paljon opittavaa, joten sitä on helpotettu tekemällä useita HUD-parannuksia. Tavaraluettelon esineiden klikkaaminen hiiren oikealla painikkeella korostaa nyt valittua esinettä ja tummentaa muut. Väärän tuotteen pudottaminen tai myyminen on nyt historiaa. Suosituissa tuotteissa on nyt harmaa reunus vain silloin, kun sinulla on tarpeeksi kultaa niihin. Hämmennystä aiheuttaneet reunukset ovat nyt poissa. Tavaraluettelon esineiden terveydentarpeet ja mana on nyt piilotettu. Sankarin koeajotilassa synnyt nyt kartalle kaukana torneista, jotta sinulla on tilaa testata kaikkea rauhassa. ",
  "winter2023_profileshowcase_section_title": "Profiilivitriini",
  "winter2023_profileshowcase_introduction": "Enemmän tapoja itseilmaisuun kuin koskaan ennen",
  "winter2023_profileshowcase_animations_title": "Animaatiot",
  "winter2023_profileshowcase_animations_desc": "Oletko kyllästynyt sankareihisi, jotka vain seisovat paikoillaan? Nyt voit valita animaatiosekvenssin saadaksesi heidät liikkumaan.",
  "winter2023_profileshowcase_anchoring_title": "Sankareiden ankkurointi",
  "winter2023_profileshowcase_anchoring_desc": "Voit ankkuroida muita profiilielementtejä sankarimalleihin ja katsella niiden liikkumista animaatioiden avulla.",
  "winter2023_profileshowcase_freezeframes_title": "Jääkehyksiä",
  "winter2023_profileshowcase_freezeframes_desc": "Jäädytä mikä tahansa animaatio kehykseen tallentaaksesi täydellisesti kiusallisen hetken.",
  "winter2023_profileshowcase_gridsnapping_title": "Automaattikohdistus",
  "winter2023_profileshowcase_gridsnapping_desc": "Asioiden yhdenmukaistaminen tyhmien ihmissilmiesi ja \"harmaiden aavistustesi\" kanssa? Miksi et anna AutoKohdistinBotin™ tehdä sitä puolestasi täydellisesti?",
  "winter2023_profileshowcase_improved_portraits_title": "Parannetut muotokuvat",
  "winter2023_profileshowcase_improved_portraits_desc": "Valitse suosikkisankareidesi 3D-malli tai 2D-muotokuva. Esittele sankaritason merkkiäsi ja jopa riimujasi.",
  "winter2023_profileshowcase_more_items_title": "Enemmän malleja",
  "winter2023_profileshowcase_more_items_desc": "Voit esitellä profiilissasi lähes kaikkea: kutsuja, wardeja, pilkkoja, lemmikkejä, esineiden korostusta ja paljon muuta.",
  "winter2023_armory_section_title": "Asevarasto",
  "winter2023_armory_introduction": "Lisää parannuksia tavaraluetteloosi",
  "winter2023_armory_grouping_title": "Parannettu ryhmittely",
  "winter2023_armory_grouping_desc": "Kaikki esineet voidaan nyt ryhmitellä sankarin nimen perusteella. ",
  "winter2023_armory_filters_tags_title": "Suodattimet ja tunnisteet ovat palanneet",
  "winter2023_armory_filters_tags_desc": "Suodata avainsanahakua käyttämällä ja luo näkymiä ennalta määritetyillä hakuehdoilla.",
  "winter2023_armory_stickers_title": "Löydä tarroja",
  "winter2023_armory_stickers_desc": "Näe tarroja, joita et omista. Voit jopa selata aiemmin saatavilla olleita tarroja.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Uusia premium-kokoelmia, tehtäviä ja kiltapalkintoja",
  "winter2023_dotaplus_premium_sets_title": "Uusia premium-kokoelmia",
  "winter2023_dotaplus_premium_sets_desc": "Tällä kaudella Dota Plus paljastaa kolme uutta premium-kokoelmaa, jotka ovat ostettavissa sirpalekaupasta 150 000 sirpaleella.",
  "winter2023_dotaplus_seasonal_quests_title": "Kausittainen tehtäväpäivitys",
  "winter2023_dotaplus_seasonal_quests_desc": "Lisää tapoja kasvattaa sirpalekätköäsi.",
  "winter2023_dotaplus_guild_rewards_title": "Päivitetyt kiltapalkinnot",
  "winter2023_dotaplus_guild_rewards_desc": "Kuten aina, uudet hymiöt, graffitit ja chatrullat ovat saatavilla paljon pisteitä saaneille killoille.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Kuurahaamu",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Hopeahalla",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo ja Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Kristallinkirkas unelma",
  "frosty_treasure_hero_name_5": "Pudge (sisältää persoonan avauksen)",
  "frosty_treasure_treasure_name_5": "Vanu-ukko Villaparta",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Kurituksen kilinä",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "Kammottava lumipeto",
  "frosty_treasure_hero_name_8": "Crystal Maiden (sisältää persoonan avauksen)",
  "frosty_treasure_treasure_name_8": "Suojeluslumienkeli",
  "frosty_treasure_hero_name_9": "Wraith King (sisältää salatieteellisen avauksen)",
  "frosty_treasure_treasure_name_9": "Juhlakunkku",
  "frosty_treasure_hero_name_10": "Kuriiri",
  "frosty_treasure_treasure_name_10": "Piparinen Roshan-vauva",
  "winter2023_gameplay_section_title": "Pelipäivitykset",
  "winter2023_patchnotes_new_items_title": "Uusia ja päivitettyjä pelinsisäisiä esineitä",
  "winter2023_patchnotes_new_items_introduction": "Juhlakunkun säkissä näyttää olevan yksi lahja jäljellä, ja kuten hänen oikeutensa on, hän voi lunastaa sen uhraamalla lapsen kuolemaan. Hän heilauttaa pitkää miekkansa ja – kyllä, lahja on hänen hallussaan! Se sisältää runsaasti muokattuja Dota-esineitä – osa upouusia ja osa vanhoja suosikkeja.",
  "winter2023_patchnotes_section_title": "Päivitystiedot 7.35",
  "winter2023_recipe": "Resepti:"
}