// 4532.js

{
  "language": "latam",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Decora tus pasillos congelados con accesorios festivos, el parche de jugabilidad 7.35, tres sets Premium de Dota Plus y muchísimas características para facilitar el desempeño del cliente",
  "winter2023_subtitle_short": "Aspectos festivos, un parche de jugabilidad y muchísimas características para facilitar el desempeño del cliente",
  "winter2023_section_introduction": "Frostivus solía que <i>siginifcar</i> algo. No se trataba de tus amigos, ni de tu familia, ni de tus sentimientos. Se trataba de <i>obtener cosas</i>, pero en algún momento, todo ese materialismo se esfumó de las fiestas y de repente, el estúpido corazón de todos estalló con el espíritu de dar. Así que este año hemos redescubierto el VERDADERO significado de Frostivus: los aspectos.",
  "winter2023_frostivus_section_title": "Cofres del tesoro de Frostivus",
  "winter2023_frostivus_section_date": "Del 14 de diciembre de 2023 al 11 de enero de 2024",
  "winter2023_frostivus_section_introduction": "Gana partidas para llenar tu medidor del espíritu Frostivus y obtén un cofre del tesoro de Frostivus cerrado, así como un regalo para tu bota navideña aleatorio, que puede ser desde aerosoles hasta emoticones y calcomanías.",
  "winter2023_frostivus_earn_chests": "Gana cofres",
  "winter2023_frostivus_how_to_earn_chests": "Cada vez que llenes tu medidor del espíritu de Frostivus, el espíritu de Frostivus fluirá a través de ti, en forma de un cofre del tesoro cerrado de Frostivus 2023.",
  "winter2023_frostivus_buy_keys": "Compra llaves",
  "winter2023_frostivus_how_to_buy_keys": "Compra llaves para abrir cofres y descubrir el verdadero significado del tesoro dentro de ellos.",
  "winter2023_naughty_or_nice_section_title": "¿Te portaste...",
  "winter2023_naughty_or_nice_naughty": "mal?",
  "winter2023_naughty_or_nice_naughty_desc": "No vale la pena negarlo. Santa Claus lo sabe. Vio tu reporte de comportamiento dos veces, y vino a pulverizar con su martillo las cuentas de \"smurf\" de todos los niños y niñas malos antes de repartir las penalizaciones a sus cuentas principales asociadas.",
  "winter2023_naughty_or_nice_nice": "o bien?",
  "winter2023_naughty_or_nice_nice_desc": "¿Jugaste Dota este año sin romper las reglas? ¡Muy bien! Santa Claus tiene algo <i>distinto</i> para ti! No te equivoques, <i>aún va a tratar de bloquearte</i>, pero una vez que despiertes pensarás, ¿esto fue un sueño?, ¿qué es esto al lado de mi almohada? ¡Es un <i>regalo gratis de Frostivus</i>! ¿Cómo te recompensó esa puntuación que ganaste? Abre tu regalo y averígualo...",
  "winter2023_naughty_or_nice_nice_desc2": "¿Tienes un reporte de comportamiento de fiestas decembrinas de más de 10 K? ¡Excelente! ¡Santa Claus tiene un martillo <i>distinto</i> para ti!\\nNo te equivoques, aún va a pegarte con él, pero una vez que despiertes en el hospital pensarás, ¿esto fue un sueño?, ¿qué es esto al lado de mi almohada? ¡Es una <i>llave gratis de Frostivus</i>!",
  "winter2023_frostivus_section_event_title": "Tesoros de Frostivus 2023",
  "winter2023_frostivus_section_event_introduction": "Sets completamente nuevos para tus héroes favoritos, además del regreso de algunos de los favoritos de las fiestas decembrinas, ¡e incluso una visita del Arcano de Wraith King y del personaje de Crystal Maiden!",
  "winter2023_bonus_item_title": "La temporada (esporádica) de dar",
  "winter2023_bonus_item_desc": "¡Es un milagro de Frostivus! ¡Cada vez que abres un set, <i>también</i> tienes la oportunidad de desbloquear un bono inusual de una variante de alguno de los objetos <i>dentro</i> de ese set! Y como la mayoría de los milagros, las posibilidades de tenerlo en tus manos son casi iguales a las de ser golpeado por un meteorito, así que todavía no hagas espacio para él en tu Armería.",
  "winter2023_bonus_item_fullset": "Sets completos",
  "winter2023_bonus_item_unusual": "Variantes inusuales",
  "winter2023_stocking_stuffer_title": "Regalos para la bota navideña",
  "winter2023_stocking_stuffer_desc": "Si la dura realidad actuarial de ese último párrafo te deprimió sobre la probabilidad de siquiera recibir alguna vez un regalo de recompensa, además de un regalo regular, ¡anímate! La patrulla de premios de Frostivus te <i>garantiza</i> hacer una parada en tu casa cada vez que llenes tu medidor espiritual de Frostivus con uno de los grandes regalos a continuación:",
  "winter2023_stocking_stuffer_sprays_stickers": "Aerosoles y calcomanías",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Estos nuevos aerosoles solo estarán disponibles durante Frostivus, pero tú preguntaste y nosotros te escuchamos; las versiones de las calcomanías serán permanentes. Pégalos en todo tu perfil.",
  "winter2023_stocking_stuffer_emoticons": "Emoticonos",
  "winter2023_stocking_stuffer_emoticons_desc": "Antes de que Marie Curie inventara los emoticones, nadie tenía la capacidad de expresar emociones. Dota rinde homenaje a su sacrificio, ya que los primeros que hizo eran altamente radiactivos.",
  "winter2023_stocking_stuffer_ward": "Mis guardianes del polo norte",
  "winter2023_stocking_stuffer_ward_desc": "Historia secreta extra: este pequeño hombre de nieve es más poderoso que AMBOS ancestros, y nunca sabrás por qué, y dirás, ¿por qué? Porque es <i>modesto</i>.",
  "winter2023_stocking_stuffer_courier": "Mensajero foca",
  "winter2023_stocking_stuffer_courier_desc": "¿Te encantaría ver a este adorable chiquito? Mejor aún, es comestible. Mucha carne y grasa en esta cosa en caso de que te quedes atorado sin comida en una travesía por las montañas.",
  "winter2023_frostivus_festive_items_title": "Objetos festivos",
  "winter2023_frostivus_party_hats": "Sombreros de Frostivus",
  "winter2023_frostivus_party_hats_description": "¡Tenemos sombreros de Frostivus para todos! ¿No tienes cabeza? ¡No hay problema! ¿Demasiadas cabezas? ¡No existe tal cosa! La patrulla de premios de Fostivus está estacionando el camión lleno de sombreros para dárselos a cualquier cosa que parezca por más mínimo, una cabeza.",
  "winter2023_frostivus_free_event_items": "Regalitos gratis",
  "winter2023_frostivus_free_event_items_description": "En los Frostivus pasados, los consumibles tenían cargas limitadas. Este año, ¡puedes usar las que quieras! Es un regalo. Bueno, más bien como un préstamo, en realidad. La patrulla de premios de Frostivus estará de regreso para coleccionarlos todos al final del evento.",
  "winter2023_frostivus_high_fives": "¡Chócalas!",
  "winter2023_frostivus_high_fives_description": "A diferencia de ese \"¡Chócalas!\" que haces con tus amigos y familia constantemente, los \"¡Chócalas!\" de Frostivus son más parecidos a los brindis con un ponche. Siendo honestos, tus amigos y familiares podrían pensar que estás tomando un descanso de chocar esos cinco de todos modos,",
  "winter2023_frostivus_section_treasure_title": "Tesoros de Frostivus 2023",
  "winter2023_clientupdate_section_title": "Actualizaciones del cliente",
  "winter2023_clientupdate_introduction": "Pues el buen Santa Claus repartió todos sus regalos un año más. ¡Feliz Frostivus a todos, conduzcan con cuidado pero, ESPEREN! ¡Hay algo <i>más</i> en el fondo de su saco!",
  "winter2023_qol_section_title": "Calidad de vida",
  "winter2023_qol_introduction": "Mejor información para una mejor toma de decisiones",
  "winter2023_qol_tower_range_indicator_title": "Indicador de alcance de las torres",
  "winter2023_qol_tower_range_indicator_desc": "¿Estás cansado de no saber cuándo esa torre apunta a algo importante (por ejemplo, a ti)? Los efectos mejorados hacen más obvio cuando es seguro caminar por los alrededores o cuando es hora de salir corriendo.",
  "winter2023_qol_teleport_time_title": "Hora de teletransportarte",
  "winter2023_qol_teleport_time_desc": "Es un hecho poco conocido que los tiempos de teletransportación en Dota son variables, y hasta ahora, invisibles. Ahora puedes verificar ese tiempo de viaje antes de usar tu pergamino de teletransporte.",
  "winter2023_qol_minimap_title": "Íconos del minimapa",
  "winter2023_qol_minimap_desc": "Flechas, íconos de héroes: ambos son geniales. Gritas al cielo, <i>\"¿Por qué debo elegir?\"</i>. Bueno, ahora no lo tienes que hacer porque, según la tradición de Dota, el cielo es un genio de la lámpara que concede deseos.",
  "winter2023_qol_ability_shape_indicator_title": "Más retículas de habilidad",
  "winter2023_qol_ability_shape_indicador_desc": "Gritas al cielo, <i>\"¿Por qué faltan algunas de mis retículas de habilidad?\"</i>. ¡Puuum! Presentando incluso más habilidades con una visualización del radio del área de efecto precisa.",
  "winter2023_qol_ability_icons_title": "Estados de íconos de habilidad",
  "winter2023_qol_ability_icons_desc": "Ya sea que tus pasivas estén deshabilitadas gracias a Hoja Plateada, que estés atrapado y no puedas usar tu traslación, ahora podrás echar un vistazo y saber si una habilidad está deshabilitada con nuestro nuevo ícono de estado de habilidad.",
  "winter2023_qol_item_tooltips_title": "Mejor descripción de los objetos",
  "winter2023_qol_item_tooltips_desc": "Obtener información sobre los objetos generalmente significaba un largo viaje a la biblioteca, luego una larga discusión con un bibliotecario de aspecto confundido. Ahora el tipo de objetivo, el tipo de daño, la capacidad de disipación y más se encuentran en la descripción de objetos.",
  "winter2023_qol_xp_range_title": "Indicador de alcance de EXP",
  "winter2023_qol_xp_range_desc": "Es temporada de EXP, justo para poner sacarle jugo. Si tan solo supieras dónde encontrarla. Ahora simplemente puedes hacerlo colocando el mouse sobre el nivel del héroe. ¡No necesitas presionar la tecla ALT!",
  "winter2023_qol_wisdom_rune_timer_title": "Temporizador de la runa de sabiduría de Dota Plus",
  "winter2023_qol_wisdom_rune_timer_desc": "Para una runa dedicada a la sabiduría, la Runa de Sabiduría solía ser bastante estúpida a la hora de mostrar su temporizador de reaparición. Parece que se mejoró y finalmente se compró un reloj.",
  "winter2023_qol_creep_bounties_title": "Recompensas de creeps",
  "winter2023_qol_creep_bounties_desc": "Gritas mirando al cielo, <i>\"¿por qué no puedo ver cuánto vale cada recompensa por creep, tanto en una senda como en los campamentos?\"</i> \"¿Es en serio?\", contesta el genio de la lámpara en el cielo. \"Yo hubiera pedido más deseos, pero de todos modos, te lo concedo. Nos vemos en el siguiente Frostivus\".",
  "winter2023_qol_misc_title": "... y otras mejoras del HUD",
  "winter2023_qol_misc_desc": "Hay muchísima información que absorber en Dota, e hicimos varias mejoras en el HUD para ayudar. Al hacer clic con el botón derecho en los objetos de tu inventario, ahora se resalta el objeto que seleccionaste y hace que otros objetos se vean más oscuros. Nunca más volverás a soltar o vender el objeto equivocado. Los objetos populares ahora solo cuentan con un borde gris cuando tienes suficiente oro para pagarlos. No más discrepancias confusas. Además, los costos de los objetos de armadura están ocultos junto con el maná cuando están en tu mochila. Por último, al entrar en el modo \"Probar héroe\" ahora te aleja de las torres, por lo que puedes tener mucho espacio para probar todo lo que quieras.",
  "winter2023_profileshowcase_section_title": "Galería del perfil",
  "winter2023_profileshowcase_introduction": "Con más formas para expresarte que nunca",
  "winter2023_profileshowcase_animations_title": "Animaciones",
  "winter2023_profileshowcase_animations_desc": "¿Cansado de que tus héroes se queden ahí parados? Ahora puedes elegir una secuencia de animación para que se muevan.",
  "winter2023_profileshowcase_anchoring_title": "Anclaje en héroes",
  "winter2023_profileshowcase_anchoring_desc": "Ahora puedes anclar otros elementos del perfil en modelos de héroes y verlos moverse con animación.",
  "winter2023_profileshowcase_freezeframes_title": "Captura de fotogramas",
  "winter2023_profileshowcase_freezeframes_desc": "Captura cualquier fotograma de una animación para capturar ese momento incómodo.",
  "winter2023_profileshowcase_gridsnapping_title": "Ajuste de cuadrícula",
  "winter2023_profileshowcase_gridsnapping_desc": "¿Alinear las cosas con tus estúpidos ojos humanos y tu \"intuición\"? ¿Por qué no dejar que SnapGridTron™ lo haga por ti a la perfección?",
  "winter2023_profileshowcase_improved_portraits_title": "Retratos mejorados",
  "winter2023_profileshowcase_improved_portraits_desc": "Selecciona entre el modelo 3D o la versión de retrato 2D de tus héroes favoritos. Muestra tu insignia de nivel de héroe e incluso tus reliquias.",
  "winter2023_profileshowcase_more_items_title": "Más modelos",
  "winter2023_profileshowcase_more_items_desc": "Invocaciones, torres, burlas, mascotas, elementos destacados... lo que sea, puedes meterlo en tu perfil.",
  "winter2023_armory_section_title": "Armería",
  "winter2023_armory_introduction": "Más mejoras en tu inventario",
  "winter2023_armory_grouping_title": "Agrupación mejorada",
  "winter2023_armory_grouping_desc": "Ahora todos los objetos se pueden agrupar por nombre del héroe. ",
  "winter2023_armory_filters_tags_title": "Regresan los filtros y etiquetas",
  "winter2023_armory_filters_tags_desc": "Filtra usando la búsqueda por palabra clave y crea vistas con criterios de búsqueda predefinidos.",
  "winter2023_armory_stickers_title": "Encuentra calcomanías",
  "winter2023_armory_stickers_desc": "Ve calcomanías que no tienes e incluso explora las que ya estaban disponibles.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Nuevos sets premium, misiones y recompensas de clanes",
  "winter2023_dotaplus_premium_sets_title": "Nuevos sets Premium",
  "winter2023_dotaplus_premium_sets_desc": "Esta temporada de Dota Plus revela tres sets Premium nuevos disponibles para su compra en la tienda de fragmentos por 150 000 fragmentos cada uno.",
  "winter2023_dotaplus_seasonal_quests_title": "Actualización de misiones de temporada",
  "winter2023_dotaplus_seasonal_quests_desc": "Más formas de aumentar tu reserva de fragmentos.",
  "winter2023_dotaplus_guild_rewards_title": "Recompensas de clanes actualizadas",
  "winter2023_dotaplus_guild_rewards_desc": "Como siempre, nuevos emoticonos, aerosoles y ruedas de chat disponibles para clanes con alta puntuación.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Succionador silencioso",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Tempestad plateada",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo y Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Bola de cristal del equinoccio",
  "frosty_treasure_hero_name_5": "Pudge (desbloqueo de personaje incluido)",
  "frosty_treasure_treasure_name_5": "Frosty, la bestia de las nieves",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Puño festivo",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "La abominable bestia de las nieves",
  "frosty_treasure_hero_name_8": "Crystal Maiden (desbloqueo de personaje incluido)",
  "frosty_treasure_treasure_name_8": "Ángel guardián de las nieves",
  "frosty_treasure_hero_name_9": "Wraith King (desbloqueo de Arcano incluido)",
  "frosty_treasure_treasure_name_9": "Santa Claus",
  "frosty_treasure_hero_name_10": "Mensajero",
  "frosty_treasure_treasure_name_10": "Roshan Bebé de Jengibre",
  "winter2023_gameplay_section_title": "Actualizaciones del jugabilidad",
  "winter2023_patchnotes_new_items_title": "Objetos dentro del juego nuevos y actualizados",
  "winter2023_patchnotes_new_items_introduction": "Parece que queda un regalo en el saco de Santa Claus y, como es su derecho, puede reclamarlo luchando contra un niño hasta la muerte. Balancea su espada larga y... ¡sí, el regalo es suyo por combate! Hay muchos objetos de Dota modificados; algunos completamente nuevos junto con algunos viejos favoritos.",
  "winter2023_patchnotes_section_title": "Notas del parche 7.35",
  "winter2023_recipe": "Receta:"
}