// 9164.js

{
  "language": "bulgarian",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Украсете мразовитите си помещения с тържествени козметични артикули, игрални промени 7.35, три премиум Dota Plus набора и купища подобрения на жизнения стандарт",
  "winter2023_subtitle_short": "Тържествени козметични артикули, игрална променя и купища подобрения на жизнения стандарт",
  "winter2023_section_introduction": "Навремето Frostivus <i>значеше</i> нещо. Не беше за приятелите, семейството или чувствата Ви. Беше за това да <i>получавате разни неща</i>. Но в някакъв момент всичкият този материализъм изфиряса от празника и изведнъж сърцата на де що има наивни хорица се пръскаха от духа на раздаването. Ето защо тази година преоткрихме ИСТИНСКОТО значение на Frostivus — козметичните артикули.",
  "winter2023_frostivus_section_title": "Frostivus сандъци със съкровище",
  "winter2023_frostivus_section_date": "14 декември 2023 — 11 януари 2024",
  "winter2023_frostivus_section_introduction": "Печелете мачове, за да запълвате своя брояч за Frostivus дух. Така ще получите заключен Frostivus сандък със съкровище И произволен дар за празничния чорап, който може да варира от спрейове, емотикони, та чак до стикери.",
  "winter2023_frostivus_earn_chests": "Печелете сандъци",
  "winter2023_frostivus_how_to_earn_chests": "Всеки път, когато запълните своя брояч, духът на Frostivus ще протича през Вас под формата на заключен Frostivus 2023 сандък със съкровище.",
  "winter2023_frostivus_buy_keys": "Купувайте ключове",
  "winter2023_frostivus_how_to_buy_keys": "Купувайте ключове, за да отключвате сандъците и да откриете истинското значение на съкровищата в тях.",
  "winter2023_naughty_or_nice_section_title": "Дали сте били…",
  "winter2023_naughty_or_nice_naughty": "Палавички?",
  "winter2023_naughty_or_nice_naughty_desc": "Няма смисъл да го отричате. King Kringle знае. Той е провери поведенческата Ви оценка дваж! Ето защо той иде със своя чук за забрани, така че да направи на пух и прах „смърф“ акаунтите на всички непослушни момченца и момиченца, преди да раздаде наказания на всичките им асоциирани основни акаунти.",
  "winter2023_naughty_or_nice_nice": "Или добрички?",
  "winter2023_naughty_or_nice_nice_desc": "Тази година играхте ли Dota 2, без да нарушавате правилата? Страхотно! King Kringle има <i>различен</i> чук за Вас! Не се заблуждавайте, <i>пак ще Ви удари с него</i>. Но щом се събудите в болницата… Дали всичко това е било блян? Какво е това до Вас връз възглавницата Ви? <i>Безплатен Frostivus подарък</i>! Какво Ви е спечелила Вашата поведенческа оценка? Отворете своя подарък и вижте…",
  "winter2023_naughty_or_nice_nice_desc2": "Имате ли много весела поведенческа оценка? Страхотно! King Kringle има <i>различен</i> чук за Вас! Не се заблуждавайте, пак ще Ви удари с него. Но щом се събудите в болницата… Дали всичко това е било блян? Какво е това до мен връз възглавницата ми? <i>Безплатен Frostivus ключ</i>!",
  "winter2023_frostivus_section_event_title": "Frostivus 2023 съкровища",
  "winter2023_frostivus_section_event_introduction": "Съвсем нови набори с артикули за любимите Ви герои. Плюс завръщането на някои любими празнични артикули. А дори и посещение от Wraith King Arcana заедно с Crystal Maiden личност!",
  "winter2023_bonus_item_title": "Сезонът на (много случайните) дарове",
  "winter2023_bonus_item_desc": "Това е Frostivus чудо! Всеки път, когато разопаковате даден набор, <i>също така</i> ще разполагате с шанс да отключите бонус необичаен вариант на един от артикулите <i>в</i> него! А както при повечето чудеса, шансовете действително да се докопате до него са доста близки до това да бъдете ударени от метеор… Така че все още не препирайте да освобождавате място за него в „Оръжейната“ си.",
  "winter2023_bonus_item_fullset": "Пълен набор",
  "winter2023_bonus_item_unusual": "Необикновен вариант",
  "winter2023_stocking_stuffer_title": "Дарове за чорапче",
  "winter2023_stocking_stuffer_desc": "Ако суровата статистическа реалност на последния параграф Ви е депресирала относно вероятността изобщо нявга да получите бонус подарък в допълнение към обикновения такъв… Я се стегнете! <i>Гарантирано</i> е, че наградният Frostivus патрул ще се отбива в дома Ви с един от страхотните подаръци по-долу всеки път, когато напълните запълвате своя брояч за Frostivus дух.",
  "winter2023_stocking_stuffer_sprays_stickers": "Спрейове и стикери",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Тези нови спрейове ще се задържат само за Frostivus, но тъй като помолихте, а ние се вслушахме — версиите им в стикери ще бъдат перманентни. Цапвайте ги навсякъде из профилите си.",
  "winter2023_stocking_stuffer_emoticons": "Емотикони",
  "winter2023_stocking_stuffer_emoticons_desc": "Преди Мария Кюри да изобрети емотиконите, никой нямал способността да изразява своите емоции. Dota 2 поздравява нейната жертва, тъй като ранните версии бяха силно радиоактивни.",
  "winter2023_stocking_stuffer_ward": "Frosty the North Ward",
  "winter2023_stocking_stuffer_ward_desc": "Тайна бонус история — този маломерен снежен човек всъщност е по-могъщ от ДВАТА Ancients. Но нивга не бихте узнали това. Защо ли? <i>Скромен</i> е.",
  "winter2023_stocking_stuffer_courier": "Тюлен куриер",
  "winter2023_stocking_stuffer_courier_desc": "Я вижте само колко е очарователен този мъник? Още по-хубавото е, че става за ядене. По това нещо има изобилие от месо и мазнини, ако попаднете в ситуация от типа на дюнер празненство.",
  "winter2023_frostivus_festive_items_title": "Тържествени артикули",
  "winter2023_frostivus_party_hats": "Frostivus шапки",
  "winter2023_frostivus_party_hats_description": "Имаме Frostivus шапки за всекиго! Нямате глава? Няма проблем! Имате прекалено много глави? Няма такова нещо! Наградният Frostivus патрул паркира камиона с шапки и подготвя да изсипе съдържанието на каросерията върху всичко, което дори вяло наподобява глава.",
  "winter2023_frostivus_free_event_items": "Даром нещица",
  "winter2023_frostivus_free_event_items_description": "През отминалите Frostivuses, консумативите бяха с ограничени заряди. Тази година можете да ги използвате толкова, колкото Ви се ще! Това е дар. Е, всъщност… По-скоро е като даване назаем. Наградният Frostivus патрул ще се върне, за да си ги прибере обратно в края на събитието.",
  "winter2023_frostivus_high_fives": "Давания на гепи",
  "winter2023_frostivus_high_fives_description": "За разлика от даванията на гепи, които постоянно давате на приятелите и семейството си, тези във Frostivus са по-скоро като празнични наздравици с горещ шоколад. Ако трябва да сме честни, приятелите и семейството смятат, че така или иначе можете да поспрете с всичките тези давания на гепи.",
  "winter2023_frostivus_section_treasure_title": "Frostivus 2023 съкровища",
  "winter2023_clientupdate_section_title": "Обновления на клиента",
  "winter2023_clientupdate_introduction": "Е, добрият King Kringle раздаде всичките си подаръци за поредна година. Честит Frostivus на всички, шофирайте безопасно, но… Я ПОЧАКАЙТЕ! На дъното на чувала му има нещо <i>друго</i>!",
  "winter2023_qol_section_title": "Подобрения на жизнения стандарт",
  "winter2023_qol_introduction": "По-добра информация за по-добро вземане на решения",
  "winter2023_qol_tower_range_indicator_title": "Показатели за обсега на кулите",
  "winter2023_qol_tower_range_indicator_desc": "Омръзнало ли Ви е да не знаете кога тази кула е насочена към нещо важно (т.е. Вас)? Подобрените ефекти правят по-очевидно кога е безопасно да се впускате или е време да бягате.",
  "winter2023_qol_teleport_time_title": "Време за телепортиране",
  "winter2023_qol_teleport_time_desc": "Малко известен факт е, че времената за телепортиране в Dota 2 са променливи — а досега бяха и невидими. Вече можете да проверите времето за пътуване, преди да използвате своя TP Scroll.",
  "winter2023_qol_minimap_title": "Икони в мини картата",
  "winter2023_qol_minimap_desc": "Стрелки, икони на герои — и двете са страхотни. <i>„Защо трябва да избирам?“</i>, крещите Вие към небесата. Е, вече не Ви се налага. Защото — внезапно изтърсване на знание от Dota 2 — небето е изпълняващо желанията духче.",
  "winter2023_qol_ability_shape_indicator_title": "Още мерници за прицелване на умения",
  "winter2023_qol_ability_shape_indicador_desc": "<i>„Защо липсват някои от мерниците за прицелване на уменията ми?“</i>, крещите Вие към небесата. И хоп! Представяме дори още повече умения с прецизно изобразяване за площта на ефекта.",
  "winter2023_qol_ability_icons_title": "Състояния на иконите за умения",
  "winter2023_qol_ability_icons_desc": "Пасивните Ви умения биват пречупени от Silver Edge? Или сте вкоренени и не можете да ползвате Blink? Независимо от това вече ще сте способни да разберете чрез бегъл поглед дали дадено умение е преустановено, с новите ни „Състояния на иконите за умения“.",
  "winter2023_qol_item_tooltips_title": "По-добри пояснения на предметите",
  "winter2023_qol_item_tooltips_desc": "Получаването на информация за прицелването на предметите обикновено означаваше дълго пътуване до библиотеката. Последвано от дълъг спор с объркан библиотекар. Сега видът на прицелване, типът на щетите, възможността за разсейване и още друга информация е достъпна в пояснението.",
  "winter2023_qol_xp_range_title": "Показател на обсега за опит",
  "winter2023_qol_xp_range_desc": "Опитът е навсякъде около нас. Просто чака да бъде извлечен… Само ако знаехте къде да го намерите. Вече можете! Като просто задържите курсора на мишката върху нивото на героя Ви. Не е нужно натискане на ALT клавиша!",
  "winter2023_qol_wisdom_rune_timer_title": "Dota+ брояч за руни на мъдростта",
  "winter2023_qol_wisdom_rune_timer_desc": "За руна, посветена на мъдростта, руната на мъдростта беше доста глупава, когато ставаше въпрос да показва своя брояч за поява. Изглежда, че е поумняла и най-сетне си е купила часовник.",
  "winter2023_qol_creep_bounties_title": "Плячки за крийпове",
  "winter2023_qol_creep_bounties_desc": "<i>„Защо не мога да видя каква е стойността на плячката от всеки крийп, както в алеите, така и в лагерите?“</i>, крещите Вие към небесата. „Наистина ли?“, отвръща небесният дух. „Аз щях да поискам още желания. Както и да е, готово. Ще се видим следващия Frostivus.“",
  "winter2023_qol_misc_title": "… И други подобрения на проекционния дисплей",
  "winter2023_profileshowcase_section_title": "Профилно изложение",
  "winter2023_profileshowcase_introduction": "Повече начини от всякога, за да изразите себе си",
  "winter2023_profileshowcase_animations_title": "Анимации",
  "winter2023_profileshowcase_animations_desc": "Омръзнало ли Ви е Вашите герои просто да си стоят ей така? Вече можете да изберете последователност от анимации, за да ги разкършите.",
  "winter2023_profileshowcase_anchoring_title": "Закотвяне върху героите",
  "winter2023_profileshowcase_anchoring_desc": "Вече можете да закотвяте други профилни елементи върху моделите на герои и да гледате как се движат с анимацията.",
  "winter2023_profileshowcase_freezeframes_title": "Стопкадри",
  "winter2023_profileshowcase_freezeframes_desc": "Спирайте се на някой кадър от анимация, за да уловите идеалния неловък момент.",
  "winter2023_profileshowcase_gridsnapping_title": "Прилепване към решетката",
  "winter2023_profileshowcase_gridsnapping_desc": "Подравнявате ли неща с глупавите Ви човешки очи и „вътрешната интуиция“? Защо не позволите на „МашиннотоПрилепванеКъмРешетката™“ да го направи перфектно вместо Вас?",
  "winter2023_profileshowcase_improved_portraits_title": "Подобрени потрети",
  "winter2023_profileshowcase_improved_portraits_desc": "Избирайте между триизмерен модел или двуизмерна портретна версия на Вашите любими герои. Похвалете се със значката Ви за ниво на герой и дори с Вашите реликви.",
  "winter2023_profileshowcase_more_items_title": "Още модели",
  "winter2023_profileshowcase_more_items_desc": "Призовавани единици, Wards, присмехи, питомци, отличени артикули… Всевъзможни нещица, които можете да натикате в своя профил.",
  "winter2023_armory_section_title": "Оръжейна",
  "winter2023_armory_introduction": "Още подобрения на инвентара Ви",
  "winter2023_armory_grouping_title": "Подобрено групиране",
  "winter2023_armory_grouping_desc": "Всички артикули вече могат да бъдат групирани по име на героя.",
  "winter2023_armory_filters_tags_title": "Филтрите и таговете се завръщат",
  "winter2023_armory_filters_tags_desc": "Филтрирайте, използвайки търсене по ключови думи. Създавайте изгледи с предварително определени критерии за търсене.",
  "winter2023_armory_stickers_title": "Намиране на стикери",
  "winter2023_armory_stickers_desc": "Виждайте стикери, които не притежавате, а дори прегледайте и предходно достъпните.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Нови премиум набори, приключения и гилдийни награди",
  "winter2023_dotaplus_premium_sets_title": "Нови премиум набори",
  "winter2023_dotaplus_premium_sets_desc": "Този Dota Plus сезон разкрива три нови премиум набора, достъпни за покупка в „Магазина за късове“, а всеки от тях е на стойност 150 000 къса.",
  "winter2023_dotaplus_seasonal_quests_title": "Сезонно опресняване на приключенията",
  "winter2023_dotaplus_seasonal_quests_desc": "Още начини да повишите наличните Ви скътани късове.",
  "winter2023_dotaplus_guild_rewards_title": "Обновени гилдийни награди",
  "winter2023_dotaplus_guild_rewards_desc": "Както винаги са достъпни нови емотикони, спрейове и чат рулетки за гилдиите с високи резултати.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Silent Wight",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silver Squall",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo and Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (включено отключване на личност)",
  "frosty_treasure_treasure_name_5": "Frosty the Sew-Man",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Jingle Fist",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "The Abominable Snowbeast",
  "frosty_treasure_hero_name_8": "Crystal Maiden (включено отключване на личност)",
  "frosty_treasure_treasure_name_8": "Guardian Snow Angel",
  "frosty_treasure_hero_name_9": "Wraith King (включено отключване на Arcana)",
  "frosty_treasure_treasure_name_9": "King Kringle",
  "frosty_treasure_hero_name_10": "Куриер",
  "frosty_treasure_treasure_name_10": "Gingerbread Baby Roshan",
  "winter2023_gameplay_section_title": "Игрални обновления",
  "winter2023_patchnotes_new_items_title": "Нови и обновени игрални предмети",
  "winter2023_patchnotes_new_items_introduction": "Изглежда, че в чувала на King Kringle е останал още един дар… А както е негово право, може да го заяви, като се сражава до смърт с дете. Той размахва дългия си меч и… Да, дарът е негов по повелята на битката! Цял куп плячка от преработени Dota 2 артикули — някои чисто нови, редом с други стари любими.",
  "winter2023_patchnotes_section_title": "Списък с промени 7.35",
  "winter2023_recipe": "Рецепта:"
}