// 1285.js

{
  "language": "danish",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Kom i julestemning med festlige kosmetiske genstande, spilopdatering 7.35, tre premiumsæt til Dota Plus og en masse kvalitetsforbedringer i klienten",
  "winter2023_subtitle_short": "Festlige kosmetiske genstande, en spilopdatering og en masse kvalitetsforbedringer i klienten",
  "winter2023_section_introduction": "Engang <i>betød</i> Frostivus noget. Det handlede ikke om dine venner, din familie eller dine følelser. Det handlede om <i>at anskaffe sig ting</i>. Men på et eller andet tidspunkt sivede materialismen ud af højtiden, og pludselig var alles hjerter fyldt med gavmildhed. Så i år har vi genopdaget den SANDE mening med Frostivus: kosmetiske genstande.",
  "winter2023_frostivus_section_title": "Frostivus-skattekister",
  "winter2023_frostivus_section_introduction": "Vind kampe for at fylde Frostivus-stemningsmåleren og få en låst Frostivus-skattekiste OG en tilfældig sokkegave, fra sprays og emotikoner til klistermærker.",
  "winter2023_frostivus_earn_chests": "Optjen kister",
  "winter2023_frostivus_how_to_earn_chests": "Hver gang du fylder Frostivus-stemningsmåleren, fyldes du af Frostivus-glæde i form af en låst skattekiste fra Frostivus 2023.",
  "winter2023_frostivus_buy_keys": "Køb nøgler",
  "winter2023_frostivus_how_to_buy_keys": "Køb nøgler for at låse kister op og opdage den SANDE mening med skattene indeni.",
  "winter2023_naughty_or_nice_section_title": "Har du været...",
  "winter2023_naughty_or_nice_naughty": "uartig?",
  "winter2023_naughty_or_nice_naughty_desc": "Det nytter ikke at benægte det. Julemanden kender sandheden. Han har dobbelttjekket din opførselsscore og kommer med sin udelukkelseshammer for at pulverisere alle de uartige drenge og pigers smurfkontoer, før han uddeler straffe til de tilhørende hovedkontoer.",
  "winter2023_naughty_or_nice_nice": "eller sød?",
  "winter2023_naughty_or_nice_nice_desc": "Har du spillet Dota i år uden at overtræde reglerne? Fedt! Så har julemanden en <i>anden</i> hammer til dig! Tag ikke fejl, <i>han banker dig stadig med den</i>. Men når du vågner op på sygehuset, var det så alt sammen en drøm? Hvad er det ved siden af dig på din pude? En <i>gratis Frostivus-gave</i>! Hvad fik du for din opførselsscore? Åbn gaven og se...",
  "winter2023_naughty_or_nice_nice_desc2": "Har du en glædelig opførselsscore? Fedt! Så har julemanden en <i>anden</i> hammer til dig! Tag ikke fejl, han banker dig stadig med den. Men når du vågner op på sygehuset, var det så alt sammen en drøm? Hvad er det ved siden af mig på min pude? En <i>gratis Frostivus-nøgle!</i>",
  "winter2023_frostivus_section_event_title": "Frostivus 2023-skatte",
  "winter2023_frostivus_section_event_introduction": "Helt nye sæt til dine yndlingshelte samt et gensyn med nogle gode gamle favoritter – og Arcanaen til Wraith King og personaen til Crystal Maiden er der også!",
  "winter2023_bonus_item_title": "De sjældne gavers højtid",
  "winter2023_bonus_item_desc": "Det er et Frostivus-mirakel! Hver gang du udpakker et sæt, har du <i>også</i> chance for at låse op for en ekstra, usædvanlig variant af en af genstandene <i>i</i> det pågældende sæt! Og ligesom de fleste mirakler er chancen for at få fingrene i den nogenlunde den samme som chancen for at blive ramt af en meteor, så du behøver ikke at gøre plads til den i arsenalet endnu.",
  "winter2023_bonus_item_fullset": "Fuldt sæt",
  "winter2023_bonus_item_unusual": "Usædvanlig variant",
  "winter2023_stocking_stuffer_title": "Sokkegaver",
  "winter2023_stocking_stuffer_desc": "Hvis den barske realitet i den sidste sætning gjorde dig deprimeret over sandsynligheden for nogensinde at få en bonusgave udover en almindelig gave, så op med humøret! Frostivus-gavepatruljen stopper <i>med garanti</i> ved dit hus, hver gang du fylder Frostivus-stemningsmåleren, med en af de fine gaver nedenfor.",
  "winter2023_stocking_stuffer_sprays_stickers": "Sprays og klistermærker",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Disse nye sprays er her kun under Frostivus, men I spurgte, og vi lyttede: Klistermærkeversionerne er permanente. Klæb dem fast på hele jeres profil.",
  "winter2023_stocking_stuffer_emoticons": "Emotikoner",
  "winter2023_stocking_stuffer_emoticons_desc": "Før Marie Curie opfandt emotikoner, kunne ingen give udtryk for deres følelser. Dota gør honnør for hendes opofrelse, da de første af dem var meget radioaktive.",
  "winter2023_stocking_stuffer_ward_desc": "Hemmelig bonushistorie: Denne snemand i understørrelse er faktisk stærkere end BEGGE Ancients. Men det ville du aldrig vide. Hvorfor? Fordi han er meget <i>beskeden</i>.",
  "winter2023_stocking_stuffer_courier_desc": "Har du set, hvor nuttet den her lille fyr er? Og så kan den spises. Masser af kød og spæk på den, hvis du kommer i samme situation som Donner-selskabet.",
  "winter2023_frostivus_festive_items_title": "Festlige genstande",
  "winter2023_frostivus_party_hats": "Frostivus-hatte",
  "winter2023_frostivus_party_hats_description": "Vi har Frostivus-hatte til alle! Intet hoved? Intet problem! For mange hoveder? Det er der ikke noget, der hedder! Frostivus-gavepatruljen bakker hattelastbilen op og hæver ladet til alt, der minder om et hoved.",
  "winter2023_frostivus_free_event_items": "Gratis ting",
  "winter2023_frostivus_free_event_items_description": "I tidligere Frostivus-begivenheder havde forbrugsvarer begrænsede ladninger. Men i år kan du bruge lige så mange, du vil! Det er en gave. Eller snarere et lån. Frostivus-gavepatruljen kommer tilbage og indsamler dem sidst i begivenheden.",
  "winter2023_frostivus_high_fives": "Highfives",
  "winter2023_frostivus_high_fives_description": "Til forskel fra de highfives, du konstant giver venner og familie, er Frostivus-highfives mere en festlig skål i varm kakao. Hvis vi skal være ærlige, så synes dine venner og familie godt, at du kunne holde en pause med alle de highfives.",
  "winter2023_frostivus_section_treasure_title": "Frostivus 2023-skatte",
  "winter2023_clientupdate_section_title": "Klientopdateringer",
  "winter2023_clientupdate_introduction": "Nå, den gode julemand har givet alle sine gaver ud i endnu et år. Glædelig Frostivus, allesammen. Kør forsigtigt, men VENT! Der er noget <i>andet</i> på bunden af hans sæk!",
  "winter2023_qol_section_title": "Kvalitetsforbedringer",
  "winter2023_qol_introduction": "Bedre information til bedre spilbeslutninger",
  "winter2023_profileshowcase_animations_title": "Animationer",
  "winter2023_profileshowcase_animations_desc": "Træt af, at dine helte bare står stille? Nu kan du vælge en animationssekvens for at få dem til at bevæge sig.",
  "winter2023_profileshowcase_improved_portraits_title": "Bedre portrætter",
  "winter2023_profileshowcase_improved_portraits_desc": "Vælg mellem en 3D-model eller et 2D-portræt af dine yndlingshelte. Vis dit helteemblem og dine relikvier frem.",
  "winter2023_profileshowcase_more_items_title": "Flere modeller",
  "winter2023_profileshowcase_more_items_desc": "Hidkaldelser, wards, hån, kæledyr, genstandsfremhævninger... du kan sætte alt muligt på din profil.",
  "winter2023_patchnotes_new_items_title": "Nye og opdaterede genstande i spillet",
  "winter2023_patchnotes_new_items_introduction": "Det ser ud til, at der er én gave tilbage i julemandens sæk. Og han vil måske gøre krav på den, hvilket han har ret til, ved at kæmpe til døden mod et barn. Han svinger sit langsværd og – jo, gaven er hans efter kampen! Det er en dusør med omarbejdede Dota-genstande, både helt nye og gamle favoritter.",
  "winter2023_patchnotes_section_title": "Spilopdatering 7.35"
}