// 5966.js

{
  "language": "brazilian",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Enfeite os corredores congelados com cosméticos festivos, a atualização de jogabilidade 7.35, três conjuntos especiais do Dota+ e várias melhorias para o cliente",
  "winter2023_subtitle_short": "Cosméticos festivos, atualização de jogabilidade várias melhorias para o cliente",
  "winter2023_section_introduction": "O Frostivus costumava ter um <i>significado</i>. Não era sobre amizades, famílias ou sentimentos. Era sobre <i>ganhar coisas</i>. Porém, em algum momento, todo esse materialismo foi deixado de lado — e, de repente, os corações moles de todo mundo foram preenchidos por um espírito benevolente. Mas, neste ano, nós relembramos o VERDADEIRO significado do Frostivus: itens cosméticos.",
  "winter2023_frostivus_section_title": "Baús de Tesouro de Frostivus",
  "winter2023_frostivus_section_date": "14/12/2023 a 11/01/2024",
  "winter2023_frostivus_section_introduction": "Vença partidas para preencher o seu Frostivômetro e ganhar um Baú do Tesouro de Frostivus trancado E MAIS uma lembrancinha, como pinturas, emoticons e adesivos.",
  "winter2023_frostivus_earn_chests": "Ganhe baús",
  "winter2023_frostivus_how_to_earn_chests": "Sempre que preencher o seu Frostivômetro, você emanará o espírito do Frostivus (na forma de um Baú do Tesouro de Frostivus de 2023 trancado).",
  "winter2023_frostivus_buy_keys": "Compre chaves",
  "winter2023_frostivus_how_to_buy_keys": "Compre chaves para destrancar baús e descobrir o verdadeiro significado dos tesouros nos seus interiores.",
  "winter2023_naughty_or_nice_section_title": "Você foi uma pessoa...",
  "winter2023_naughty_or_nice_naughty": "Levada?",
  "winter2023_naughty_or_nice_naughty_desc": "Não adianta esconder. O Papai Cruel sabe. Ele conferiu a sua nota comportamental duas vezes, e está chegando com o seu martelo do banimento para pulverizar as contas smurfs de todos os meninos e meninas travessos, antes de penalizar as suas contas principais.",
  "winter2023_naughty_or_nice_nice": "Ou comportada?",
  "winter2023_naughty_or_nice_nice_desc": "Você jogou Dota neste ano sem quebrar as regras? Ótimo! O Papai Cruel tem um <i>outro</i> martelo! Não se engane, ele <i>ainda irá usá-lo contra você</i>. Mas quando você acordar no hospital... Isso era tudo um sonho? O que é aquilo ali perto do seu travesseiro? Um <i>Presente de Frostivus gratuito</i>! O que será que a sua nota comportamental trouxe para você? Abra o presente e descubra...",
  "winter2023_naughty_or_nice_nice_desc2": "A sua nota comportamental está lá em cima? Ótimo! O Papai Cruel tem um <i>outro</i> martelo! Não se engane, ele ainda irá usá-lo contra você. Mas quando você acordar no hospital... Isso era tudo um sonho? O que é isso aqui perto do meu travesseiro? Uma <i>Chave de Frostivus gratuita</i>!",
  "winter2023_frostivus_section_event_title": "Tesouros de Frostivus de 2023",
  "winter2023_frostivus_section_event_introduction": "Conjuntos inéditos para os seus heróis favoritos, além da volta de alguns clássicos festivos — e até mesmo as visitas do Arcano do Wraith King e a persona da Crystal Maiden!",
  "winter2023_bonus_item_title": "O importante é amar (os presentes)",
  "winter2023_bonus_item_desc": "É um milagre de Frostivus! Sempre que você abrir um conjunto, <i>também</i> terá a chance de destravar uma variante Incomum de algum dos itens <i>dele</i>! E como todo bom milagre, as chances de realmente testemunhá-lo são bem próximas das de ser atingido por um meteoro, então não saia abrindo espaço no seu arsenal apressadamente.",
  "winter2023_bonus_item_fullset": "Conjunto completo",
  "winter2023_bonus_item_unusual": "Variante Incomum",
  "winter2023_stocking_stuffer_title": "Lembrancinhas",
  "winter2023_stocking_stuffer_desc": "Se a dureza factual da realidade apresentada no último parágrafo desanimou você sobre as chances de conseguir um presentinho adicional além do presente normal, sorria! A patrulha dos prêmios de Frostivus faz uma parada <i>obrigatória</i> na sua casa sempre que você preencher o seu Frostivômetro, trazendo um dos incríveis presentes abaixo.",
  "winter2023_stocking_stuffer_sprays_stickers": "Pinturas e adesivos",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Essas novas pinturas só estarão por aqui durante as frostividades, mas vocês pediram e nós ouvimos: as versões em adesivos serão permanentes. Colem-nas por todos os seus perfis.",
  "winter2023_stocking_stuffer_emoticons": "Emoticons",
  "winter2023_stocking_stuffer_emoticons_desc": "Antes de Marie Curie inventar os Emoticons, ninguém sabia como expressar emoções. O Dota saúda o seu sacrifício, já que os primeiros eram altamente radioativos.",
  "winter2023_stocking_stuffer_ward": "Nevinho, o Sentinela Polar",
  "winter2023_stocking_stuffer_ward_desc": "História secreta adicional: esse pequeno boneco de neve é, na realidade, mais poderoso que AMBOS os Ancestrais. Por que ele não usa todo esse poder? Bem, ele é <i>modesto</i>.",
  "winter2023_stocking_stuffer_courier": "Entregador Foca",
  "winter2023_stocking_stuffer_courier_desc": "Olhe só que criatura mais fofinha! E melhor ainda: é comestível. Há muita carne e gordura nessa coisinha caso você se encontre em uma situação muito adversa.",
  "winter2023_frostivus_festive_items_title": "Itens festivos",
  "winter2023_frostivus_party_hats": "Gorros de Frostivus",
  "winter2023_frostivus_party_hats_description": "Temos gorros de Frostivus para todo mundo! Não tem uma cabeça? Sem problema! Cabeças demais? Que nada! A patrulha dos prêmios de Frostivus está com o caminhão de gorros bem abastecido e anda despejando eles em tudo que se parecer com uma cabeça.",
  "winter2023_frostivus_free_event_items": "Inconsumíveis",
  "winter2023_frostivus_free_event_items_description": "Em Frostivus passados, consumíveis tinham cargas limitadas. Neste ano, você pode usar quantos quiser! É um presente. Bom, na verdade, é tipo um empréstimo. A patrulha dos prêmios de Frostivus voltará para recolhê-los ao final do evento.",
  "winter2023_frostivus_high_fives": "Brinda aqui!",
  "winter2023_frostivus_high_fives_description": "Em vez das batidinhas de mão que você rotineiramente troca com os seus amigos e familiares, os \"Toca aqui!\" de Frostivus são como fazer um brinde com chocolate quente. E, cá entre nós, os seus amigos e familiares acham que você poderia dar uma pausa nas batidinhas mesmo.",
  "winter2023_frostivus_section_treasure_title": "Tesouros de Frostivus de 2023",
  "winter2023_clientupdate_section_title": "Atualizações do cliente",
  "winter2023_clientupdate_introduction": "Enfim, o bom Papai Cruel distribuiu todos os seus presentes. Feliz Frostivus, pessoal, dirijam com cuidado e... ESPERE! Tem <i>mais algo</i> no fundo do saco!",
  "winter2023_qol_section_title": "Qualidade de vida",
  "winter2023_qol_introduction": "Melhores informações levam a melhores decisões",
  "winter2023_qol_tower_range_indicator_title": "Indicador do alcance de torres",
  "winter2023_qol_tower_range_indicator_desc": "Cansou de não saber quando aquela torre está alvejando algo importante (tipo você)? Efeitos aprimorados facilitam a percepção de quando é seguro avançar ou se é hora de bater em retirada.",
  "winter2023_qol_teleport_time_title": "Teletransporte pontual",
  "winter2023_qol_teleport_time_desc": "Nem todo mundo sabe que as durações dos teletransportes no Dota são variadas — e, até recentemente, invisíveis. Agora, você pode conferir o tempo de viagem antes de usar o seu pergaminho.",
  "winter2023_qol_minimap_title": "Ícones do minimapa",
  "winter2023_qol_minimap_desc": "Setas, ícones de heróis — ambos são incríveis. <i>\"Por que eu preciso escolher?\"</i>, você grita para os céus. Então, você não precisa. Porque — atenção para a história do Dota! — o céu é um gênio, e ele concede desejos.",
  "winter2023_qol_ability_shape_indicator_title": "Mais retículas de habilidades",
  "winter2023_qol_ability_shape_indicador_desc": "<i>\"Por que algumas das minhas habilidades estão sem retículas?\"</i>, você grita para os céus. Puf! Aqui estão ainda mais habilidades com uma exibição precisa da área de efeito.",
  "winter2023_qol_ability_icons_title": "Estados das habilidades",
  "winter2023_qol_ability_icons_desc": "Estejam as suas passivas quebradas por uma Lâmina de Prata, ou esteja você enraizado e incapaz de se translocar para longe, agora você poderá vislumbrar rapidamente se uma habilidade está desativada com os novos indicadores.",
  "winter2023_qol_item_tooltips_title": "Descrições aprimoradas para itens",
  "winter2023_qol_item_tooltips_desc": "Antigamente, para saber o tipo de alvo de um item era necessário fazer uma longa viagem até a biblioteca e ter uma longa discussão com um bibliotecário confuso. Agora, o tipo de alvo, tipo de dano, dissipabilidade e outras informações são exibidas junto da descrição.",
  "winter2023_qol_xp_range_title": "Indicador do alcance de XP",
  "winter2023_qol_xp_range_desc": "Existe experiência por tudo quanto é canto, esperando para você roubar... Basta saber onde procurar. Agora, ficou ainda mais fácil — é só passar o cursor sobre o nível do seu herói. Nem precisa mais apertar Alt!",
  "winter2023_qol_wisdom_rune_timer_title": "Cronômetro da Runa de Sabedoria para o Dota+",
  "winter2023_qol_wisdom_rune_timer_desc": "Para uma runa dedicada à sabedoria, a Runa de Sabedoria estava deixando a desejar e não sabia exibir o seu tempo para renascer. Felizmente, ela ficou mais esperta e finalmente comprou um relógio.",
  "winter2023_qol_creep_bounties_title": "Recompensas de criaturas",
  "winter2023_qol_creep_bounties_desc": "<i>\"Por que eu não posso ver quanto de ouro cada criatura vale, seja nas trilhas ou na floresta?\"</i>, você grita para os céus. <i>\"Sério mesmo?\"</i>, o gênio dos céus responde. <i>\"Eu teria pedido por mais desejos. Enfim, aqui está. Até o próximo Frostivus.\"</i>",
  "winter2023_qol_misc_title": "...e outras melhorias para a interface",
  "winter2023_qol_misc_desc": "Há muitas informações para absorver no Dota, e aprimoramos várias partes da interface para ajudar. Agora, clicar com o botão direito em um item do inventário escurece os outros, deixando claro qual você selecionou e evitando que largue ou venda o item errado. Itens populares exibem uma borda cinza apenas quando você tiver ouro suficiente para comprá-los. Além disso, os custos de vida de itens na mochila ficam ocultos, assim como o custo de mana. Por último, ao entrar no modo de teste de heróis, você nascerá longe das torres — dando bastante espaço para testar o que quiser.",
  "winter2023_profileshowcase_section_title": "Destaques de perfil",
  "winter2023_profileshowcase_introduction": "Mais formas de se expressar do que nunca",
  "winter2023_profileshowcase_animations_title": "Animações",
  "winter2023_profileshowcase_animations_desc": "Cansou de ver os seus heróis parados ali? Agora, você pode escolher uma sequência de animação para mantê-los em movimento.",
  "winter2023_profileshowcase_anchoring_title": "Vinculando a heróis",
  "winter2023_profileshowcase_anchoring_desc": "Agora, você pode anexar outros elementos de perfil aos modelos de heróis e vê-los se movimentar com a animação.",
  "winter2023_profileshowcase_freezeframes_title": "Congelando quadros",
  "winter2023_profileshowcase_freezeframes_desc": "Congele qualquer quadro de uma animação para capturar o momento constrangedor perfeito.",
  "winter2023_profileshowcase_gridsnapping_title": "Alinhamento em grade",
  "winter2023_profileshowcase_gridsnapping_desc": "Alinhar coisas com os seus meros olhos humanos e \"instintos\"? Que tal deixar o AlinhadorSemDor™ fazê-lo perfeitamente?",
  "winter2023_profileshowcase_improved_portraits_title": "Retratos aprimorados",
  "winter2023_profileshowcase_improved_portraits_desc": "Escolha entre o modelo 3D ou retrato em 2D dos seus heróis favoritos. Exiba a insígnia do seu Nível+ de herói e até mesmo as suas relíquias.",
  "winter2023_profileshowcase_more_items_title": "Mais modelos",
  "winter2023_profileshowcase_more_items_desc": "Invocações, sentinelas, provocações, mascotes, destaques... Se você pode imaginar, também pode colocar no seu perfil.",
  "winter2023_armory_section_title": "Arsenal",
  "winter2023_armory_introduction": "Mais aprimoramentos para o seu inventário",
  "winter2023_armory_grouping_title": "Agrupamento aprimorado",
  "winter2023_armory_grouping_desc": "Agora, todos os seus itens podem ser agrupados pelo nome do herói.",
  "winter2023_armory_filters_tags_title": "Filtros e marcadores estão de volta",
  "winter2023_armory_filters_tags_desc": "Filtre usando o teclado e crie visões com critérios de busca predefinidos.",
  "winter2023_armory_stickers_title": "Encontrando adesivos",
  "winter2023_armory_stickers_desc": "Confira adesivos que você não possui, e navegue até mesmo por aqueles que não estão mais disponíveis.",
  "winter2023_dotaplus_section_title": "Dota+",
  "winter2023_dotaplus_introduction": "Novos conjuntos exclusivos, missões e recompensas de clã",
  "winter2023_dotaplus_premium_sets_title": "Conjuntos exclusivos",
  "winter2023_dotaplus_premium_sets_desc": "Esta temporada do Dota+ revela três novos conjuntos exclusivos disponíveis para compra na loja de fragmentos por 150.000 cada.",
  "winter2023_dotaplus_seasonal_quests_title": "Atualização sazonal de missões",
  "winter2023_dotaplus_seasonal_quests_desc": "Mais formas de aumentar o seu estoque de fragmentos.",
  "winter2023_dotaplus_guild_rewards_title": "Recompensas de clã atualizadas",
  "winter2023_dotaplus_guild_rewards_desc": "Como sempre, novos emoticons, pinturas e mensagens sonoras estão disponíveis para clãs bem posicionados.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Noite Infeliz",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Rajada Prateada",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo e Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Equinócio Orbicular",
  "frosty_treasure_hero_name_5": "Pudge (inclui persona destravável)",
  "frosty_treasure_treasure_name_5": "Boneco de Neve Remendado",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Punho de Frostivus",
  "frosty_treasure_hero_name_7": "Fera Primal",
  "frosty_treasure_treasure_name_7": "Abominável Fera das Neves",
  "frosty_treasure_hero_name_8": "Crystal Maiden (inclui persona destravável)",
  "frosty_treasure_treasure_name_8": "Anjo Guardião das Neves",
  "frosty_treasure_hero_name_9": "Wraith King (inclui Arcano destravável)",
  "frosty_treasure_treasure_name_9": "Papai Cruel",
  "frosty_treasure_hero_name_10": "Entregador",
  "frosty_treasure_treasure_name_10": "Bebê Roshan de Gengibre",
  "winter2023_gameplay_section_title": "Atualizações de jogabilidade",
  "winter2023_patchnotes_new_items_title": "Itens novos e atualizados",
  "winter2023_patchnotes_new_items_introduction": "Parece que ainda resta um presente no saco do Papai Cruel, e, como é de direito, ele pode reivindicá-lo enfrentando uma criança até a morte. Ele balança a sua espada longa e... Sim, por combate, o presente é dele! É uma seleção de itens de Dota reformulados — alguns novinhos em folha, e outros velhos queridos.",
  "winter2023_patchnotes_section_title": "Detalhes da atualização 7.35"
}