// 2791.js

{
  "language": "swedish",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Kom i julstämning med festliga kosmetiska föremål, speluppdatering 7.35, tre premiumset till Dota Plus och massor av kvalitetsförbättringar av klienten",
  "winter2023_subtitle_short": "Festlig kosmetika, en speluppdatering och massor av kvalitetsförbättringar",
  "winter2023_section_introduction": "Frostivus brukade <i>betyda</i> något. Det handlade inte om dina vänner eller din familj eller dina känslor. Det handlade om att <i>få grejer</i>. Men någon gång sipprade all materialism bort från högtiden och plötsligt var allas hjärtan dumt nog fyllda av givmildhet. Så i år har vi återupptäckt den sanna betydelsen av Frostivus: kosmetiska föremål.",
  "winter2023_frostivus_section_title": "Frostivus-skattkistor",
  "winter2023_frostivus_section_date": "14 december 2023–11 januari 2024",
  "winter2023_frostivus_section_introduction": "Vinn matcher för att fylla upp din Frostivus-stämningsmätare och få en låst Frostivus-skattkista OCH en slumpvald småklapp som innehåller allt från sprejer och uttryckssymboler till klistermärken.",
  "winter2023_frostivus_earn_chests": "Få kistor",
  "winter2023_frostivus_how_to_earn_chests": "Varje gång du fyller på din Frostivus-stämningsmätare kommer Frostivus anda att flöda genom dig, i form av en låst Frostivus 2023-skattkista.",
  "winter2023_frostivus_buy_keys": "Köp nycklar",
  "winter2023_frostivus_how_to_buy_keys": "Köp nycklar för att låsa upp kistor och upptäck den sanna innebörden av skatterna inuti.",
  "winter2023_naughty_or_nice_section_title": "Har du varit ...",
  "winter2023_naughty_or_nice_naughty": "Stygg?",
  "winter2023_naughty_or_nice_naughty_desc": "Försök inte att förneka det. Julsnubben vet. Han har dubbelkollat dina uppförandepoäng och han har med sig sin hammare för att pulvrisera alla styggingars smurfkonton, innan han utdelar påföljder till deras tillhörande huvudkonton.",
  "winter2023_naughty_or_nice_nice": "Eller snäll?",
  "winter2023_naughty_or_nice_nice_desc": "Spelade du Dota i år utan att bryta mot reglerna? Bra! Julsnubben har en <i>annan</i> hammare till dig! Men inbilla dig inget, han kommer <i>fortfarande att slå dig med den</i>. Men sedan när du väl vaknat på sjukhuset tänker du: Var allt en dröm? Vad är det här bredvid mig på min kudde? En <i>gratis Frostivus-klapp!</i> Vad fick du för dina uppförandepoäng? Öppna klappen så får du se ...",
  "winter2023_naughty_or_nice_nice_desc2": "Har du en glädjande mängd uppförandepoäng? Bra! Julsnubben har en <i>annan</i> hammare till dig! Men inbilla dig inget, han kommer fortfarande att slå dig med den. Men sedan när du väl vaknat på sjukhuset tänker du: Var allt en dröm? Vad är det här bredvid mig på min kudde? En <i>gratis Frostivus-nyckel!</i>",
  "winter2023_frostivus_section_event_title": "Frostivus-skatter 2023",
  "winter2023_frostivus_section_event_introduction": "Helt nya föremålsset för dina favorithjältar, plus återkomsten av några högtidsfavoriter – och till och med ett besök från Wraith Kings arcana och Crystal Maidens persona!",
  "winter2023_bonus_item_title": "Högtiden för (ytterst tillfällig) givmildhet",
  "winter2023_bonus_item_desc": "Det är ett Frostivus-mirakel! Varje gång du packar upp ett set kommer du <i>även</i> att ha en chans att låsa upp en extra ovanlig variant av ett av föremålen <i>i</i> det setet! Och som de flesta mirakel är oddsen att faktiskt lyckas få det i princip samma som chansen att bli träffad av en meteor, så gör inte plats för det i ditt vapenförråd riktigt än.",
  "winter2023_bonus_item_fullset": "Komplett set",
  "winter2023_bonus_item_unusual": "Ovanlig variant",
  "winter2023_stocking_stuffer_title": "Småklappar",
  "winter2023_stocking_stuffer_desc": "Om den tuffa faktiska realiteten i det senaste stycket gjorde dig deprimerad över sannolikheten att någonsin få en bonusklapp utöver en vanlig klapp – upp med hakan! Frostivus klappatrull kommer <i>garanterat</i> att stanna till vid ditt hus med en av de finfina klapparna nedan varje gång du fyller upp Frostivus-stämningsmätaren.",
  "winter2023_stocking_stuffer_sprays_stickers": "Sprejer och klistermärken",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "De här nya sprejerna finns bara under Frostivus. Men ni frågade och vi lyssnade – klistermärkesversionerna är permanenta. Klistra fast dem på era profiler.",
  "winter2023_stocking_stuffer_emoticons": "Uttryckssymboler",
  "winter2023_stocking_stuffer_emoticons_desc": "Innan Marie Curie uppfann uttryckssymboler hade ingen förmågan att uttrycka känslor. Dota hyllar hennes uppoffring, eftersom de första av dem var mycket radioaktiva.",
  "winter2023_stocking_stuffer_ward": "Frosty the North Ward",
  "winter2023_stocking_stuffer_ward_desc": "Hemlig bonushistoria: denna underdimensionerade snögubbe är faktiskt mer kraftfull än BÅDA ancients. Men han visar det inte. Varför? Han är <i>blygsam</i>.",
  "winter2023_stocking_stuffer_courier": "Sälkurir",
  "winter2023_stocking_stuffer_courier_desc": "Har du sett hur gullig denna lilla rackare är? Och inte bara det, den går att äta också. Gott om kött och späck om vintern kommer som en överraskning.",
  "winter2023_frostivus_festive_items_title": "Festliga föremål",
  "winter2023_frostivus_party_hats": "Frostivus-hattar",
  "winter2023_frostivus_party_hats_description": "Vi har Frostivus-hattar till alla! Inget huvud? Inga problem! För många huvuden? Oroa dig inte! Frostivus klappatrull \\nbackar upp hattbilen innehållandes något till allt huvudliknande.",
  "winter2023_frostivus_free_event_items": "Gratisprylar",
  "winter2023_frostivus_free_event_items_description": "Under Frostivus föregående år hade förbrukningsvaror ett begränsat antal laddningar. I år kan du använda hur många du vill! Det är en gåva. Eller ja, mer av ett lån faktiskt. Frostivus klappatrull kommer att hämta dem i slutet av eventet.",
  "winter2023_frostivus_high_fives": "High fives",
  "winter2023_frostivus_high_fives_description": "Till skillnad från de high fives du ständigt ger vänner och familj är Frostivus high fives mer som festligt skålande med glögg. Om vi ​​ska vara ärliga tycker nog vännerna och familjen att du kan ta en paus från alla dessa high fives ändå.",
  "winter2023_frostivus_section_treasure_title": "Frostivus-skatter 2023",
  "winter2023_clientupdate_section_title": "Klientuppdateringar",
  "winter2023_clientupdate_introduction": "Nåväl, den gamla goda julsnubben har gett ut alla klappar även detta år. Glad Frostivus till er alla, kör försiktigt – men VÄNTA! Det finns något <i>mer</i> i botten av hans säck!",
  "winter2023_qol_section_title": "Kvalitetsförbättringar",
  "winter2023_qol_introduction": "Bättre information för bättre beslutstagande",
  "winter2023_qol_tower_range_indicator_title": "Indikator för tornräckvidd",
  "winter2023_qol_tower_range_indicator_desc": "Är du trött på att inte veta när tornet riktar sig mot något viktigt (dvs. dig)? Förbättrade effekter gör det mer uppenbart när det är säkert att dyka upp eller dags att springa.",
  "winter2023_qol_teleport_time_title": "Teleporteringstid",
  "winter2023_qol_teleport_time_desc": "Det är ett föga känt faktum att teleporteringstider i Dota är varierande – och hittills osynliga. Nu kan du kontrollera den pendlingstiden innan du använder din Town Portal Scroll.",
  "winter2023_qol_minimap_title": "Ikoner på minikartan",
  "winter2023_qol_minimap_desc": "Pilar och hjälteikoner – bra grejer, eller hur? <i>”Varför måste jag välja?”</i> skriker du mot himlen. Nu behöver du inte det. För i Dota är himlen en ande som uppfyller önskningar.",
  "winter2023_qol_ability_shape_indicator_title": "Fler förmågeindikatorer",
  "winter2023_qol_ability_shape_indicador_desc": "Du skriker ”<i>Varför saknas några av mina förmågeindikatorer?”</i> mot himlen. Pang! Vi introducerar ännu fler förmågor med exakt visning av radie.",
  "winter2023_qol_ability_icons_title": "Status på förmågeikoner",
  "winter2023_qol_ability_icons_desc": "Oavsett om dina passiva förmågor blir avbrutna av Silver Edge, eller om du är rotad och inte kan använda Blink för att ta dig därifrån kommer du nu att kunna se om en förmåga är inaktiverad med den nya förmågeikonstatusen.",
  "winter2023_qol_item_tooltips_title": "Bättre verktygstips för föremål",
  "winter2023_qol_item_tooltips_desc": "Om man är nyfiken på ett föremåls riktingsinformation krävs vanligtvis en lång bilresa till biblioteket och sedan en lång diskussion med en förvirrad bibliotekarie. Nu finns måltyp, skadetyp, borttagbarhet och mer i verktygstipset.",
  "winter2023_qol_xp_range_title": "Indikator för XP-räckvidd",
  "winter2023_qol_xp_range_desc": "XP finns överallt, du behöver bara veta var du kan hitta det. Nu kan du lätt göra det genom att hovra över din hjältes nivå. ALT behövs inte alls!",
  "winter2023_qol_wisdom_rune_timer_title": "Timer för visdomsruna (Dota Plus)",
  "winter2023_qol_wisdom_rune_timer_desc": "För en runa tillägnad visdom var visdomsrunan ganska dum när det gällde att visa spawningstimern. Det verkar som att den skärpte till sig och skaffade en klocka.",
  "winter2023_qol_creep_bounties_title": "Creepbelöningar",
  "winter2023_qol_creep_bounties_desc": "<i>”Varför kan jag inte se hur mycket belöning varje creep är värd, både på vägarna och i lägren?”</i> skriker du mot himlen. ”Skojar du?” säger himmelanden.” Jag skulle ha bett om fler önskningar. Hur som helst, det fixar jag. Vi ses nästa Frostivus.”",
  "winter2023_qol_misc_title": "... och andra HUD-förbättringar",
  "winter2023_qol_misc_desc": "Det finns massor av information att ta till sig i Dota, och vi har gjort flera HUD-förbättringar för att hjälpa till. Genom att högerklicka på föremål i ditt förråd markeras nu vilket föremål du har valt genom att göra andra föremål mörkare. Släpp eller sälj aldrig fel föremål igen. Populära föremål har nu bara en grå kant när du har tillräckligt med guld för att ha råd med dem. Inga fler förvirrande kantskillnader. Dessutom så är nu HP-kostnader för föremål dolda tillsammans med mana när de ligger i din ryggsäck. Slutligen spawnas du nu iväg från tornen när du går in i hjältedemoläge, så att du får tillräckligt med utrymme för att testa allt du vill.",
  "winter2023_profileshowcase_section_title": "Profilmontern",
  "winter2023_profileshowcase_introduction": "Fler sätt att uttrycka sig själv på än någonsin tidigare",
  "winter2023_profileshowcase_animations_title": "Animationer",
  "winter2023_profileshowcase_animations_desc": "Trött på att dina hjältar bara står där? Nu kan du välja en animationssekvens för att få dem att röra på sig.",
  "winter2023_profileshowcase_anchoring_title": "Förankring på hjältar",
  "winter2023_profileshowcase_anchoring_desc": "Nu kan du förankra andra profilelement på hjältemodeller och se dem röra sig med animationen.",
  "winter2023_profileshowcase_freezeframes_title": "Stillbilder",
  "winter2023_profileshowcase_freezeframes_desc": "Stanna på valfri bildruta i en animation för att fånga det perfekta genanta tillfället.",
  "winter2023_profileshowcase_gridsnapping_title": "Hjälplinjer",
  "winter2023_profileshowcase_gridsnapping_desc": "Placerar du grejer med dina fåniga mänskliga ögon och efter magkänsla? Låt Hjälplinjeassistenten göra det åt dig med perfekt precision!",
  "winter2023_profileshowcase_improved_portraits_title": "Förbättrade porträtt",
  "winter2023_profileshowcase_improved_portraits_desc": "Välj mellan 3D-modellen eller 2D-porträttversionen av dina favorithjältar. Visa upp ditt hjältenivåmärke och till och med dina reliker.",
  "winter2023_profileshowcase_more_items_title": "Fler modeller",
  "winter2023_profileshowcase_more_items_desc": "Framkallningar, wards, hån, husdjur ... du kan sätta ut allt möjligt på din profil.",
  "winter2023_armory_section_title": "Vapenförråd",
  "winter2023_armory_introduction": "Fler förbättringar av ditt förråd",
  "winter2023_armory_grouping_title": "Förbättrad gruppering",
  "winter2023_armory_grouping_desc": "Alla föremål kan nu grupperas efter hjältenamn. ",
  "winter2023_armory_filters_tags_title": "Filter och taggar är tillbaka",
  "winter2023_armory_filters_tags_desc": "Filtrera med hjälp av sökord och skapa vyer med fördefinierade sökkriterier.",
  "winter2023_armory_stickers_title": "Hitta klistermärken",
  "winter2023_armory_stickers_desc": "Se klistermärken som du inte äger, och bläddra till och med bland sådana som varit tillgängliga tidigare.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Nya premiumset, uppdrag och gillesbelöningar",
  "winter2023_dotaplus_premium_sets_title": "Nya premiumset",
  "winter2023_dotaplus_premium_sets_desc": "Den här Dota Plus-säsongen avslöjar tre nya premiumset som finns att köpa i skärvbutiken för 150 000 skärvor vardera.",
  "winter2023_dotaplus_seasonal_quests_title": "Säsongsuppdatering av uppdrag",
  "winter2023_dotaplus_seasonal_quests_desc": "Fler sätt att få fler skärvor.",
  "winter2023_dotaplus_guild_rewards_title": "Uppdaterade gillesbelöningar",
  "winter2023_dotaplus_guild_rewards_desc": "Som alltid är nya uttryckssymboler, sprejer och chatthjul tillgängliga för högt rankade gillen.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Silent Wight",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silver Squall",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo och Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (persona ingår)",
  "frosty_treasure_treasure_name_5": "Frosty the Sew-Man",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Jingle Fist",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "The Abominable Snowbeast",
  "frosty_treasure_hero_name_8": "Crystal Maiden (persona ingår)",
  "frosty_treasure_treasure_name_8": "Guardian Snow Angel",
  "frosty_treasure_hero_name_9": "Wraith King (arcana ingår)",
  "frosty_treasure_treasure_name_9": "King Kringle",
  "frosty_treasure_hero_name_10": "Courier",
  "frosty_treasure_treasure_name_10": "Gingerbread Baby Roshan",
  "winter2023_gameplay_section_title": "Speluppdateringar",
  "winter2023_patchnotes_new_items_title": "Nya och uppdaterade föremål i spelet",
  "winter2023_patchnotes_new_items_introduction": "Det verkar som om det finns en klapp kvar i tomtens säck, och han har rätten på sin sida att göra anspråk på den genom att slåss mot ett barn till döds. Han svänger sitt långsvärd och – ja, klappen är hans genom strid! Det är en mängd omarbetade Dota-föremål – några helt nya, tillsammans med några gamla favoriter.",
  "winter2023_patchnotes_section_title": "Speluppdatering 7.35",
  "winter2023_recipe": "Recept:"
}