// 7243.js

{
  "language": "norwegian",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Kom i julestemning med festlige pyntegjenstander, spilloppdatering 7.35, tre premiumsett til Dota Plus og en haug med kvalitetsforbedringer",
  "winter2023_subtitle_short": "Festlige pyntegjenstander, en spilloppdatering og en haug med kvalitetsforbedringer",
  "winter2023_section_introduction": "Frostivus pleide å <i>bety</i> noe. Det handlet ikke om venner, familien eller følelser. Det handlet om å <i>få ting</i>. Men på et eller annet tidspunkt sivet all den materialismen ut av høytiden, og plutselig var alles dumme hjerter stappfulle av giverglede. Så i år har vi gjenoppdaget den VIRKELIGE meningen med Frostivus: pyntegjenstander.",
  "winter2023_frostivus_section_title": "Frostivus-skattkister",
  "winter2023_frostivus_section_date": "14. desember 2023–11. januar 2024",
  "winter2023_frostivus_section_introduction": "Vinn kamper for å fylle opp Frostivus-stemningsmåleren og få en låst Frostivus-skattkiste OG en tilfeldig smågave – fra graffitier og klistremerker til uttrykksikoner.",
  "winter2023_frostivus_earn_chests": "Få kister",
  "winter2023_frostivus_how_to_earn_chests": "Hver gang du fyller opp Frostivus-stemningsmåleren, fylles du av Frostivus-glede i form av en låst Frostivus-skattkiste 2023.",
  "winter2023_frostivus_buy_keys": "Kjøp nøkler",
  "winter2023_frostivus_how_to_buy_keys": "Kjøp nøkler for å låse opp kister og oppdage hvilke skatter de skjuler.",
  "winter2023_naughty_or_nice_section_title": "Har du vært …",
  "winter2023_naughty_or_nice_naughty": "Slem?",
  "winter2023_naughty_or_nice_naughty_desc": "Du får ikke lurt deg unna. Nissekongen vet. Han sjekket atferdspoengene dine, og han kommer med hammeren for å pulverisere smurfekontoene til alle slemme gutter og jenter, før han deler ut straff til tilhørende hovedkontoer. ",
  "winter2023_naughty_or_nice_nice": "Eller snill?",
  "winter2023_naughty_or_nice_nice_desc": "Spilte du Dota i år uten å bryte reglene? Så flott! Nissekongen har en <i>annen</i> hammer for deg! Vær du trygg, han <i>kommer fremdeles til å slå deg med den</i>. Men når du så våkner opp … var det hele en drøm? Hva er det som ligger på puten? En <i>gratis Frostivus-nøkkel</i>! Hva fikk du av å ha gode atferdspoeng? Åpne gaven og se …",
  "winter2023_naughty_or_nice_nice_desc2": "Har du en gledelig mengde atferdspoeng? Så flott! Nissekongen har en <i>annen</i> hammer for deg! Vær du trygg, han kommer fremdeles til å slå deg med den. Men når du så våkner opp … var det hele en drøm? Hva er det som ligger på puten? En <i>gratis Frostivus-nøkkel!</i>",
  "winter2023_frostivus_section_event_title": "Frostivus-skatter 2023",
  "winter2023_frostivus_section_event_introduction": "Helt nye gjenstandssett til favorittheltene, samt et gjensyn med noen gamle favoritter – og til og med et besøk fra arkanaen til Wraith King og personaen til Crystal Maiden!",
  "winter2023_bonus_item_title": "(De sjeldne) Gavenes høytid",
  "winter2023_bonus_item_desc": "Det er et Frostivus-mirakel! Hver gang du åpner et sett, har du <i>også</i> en sjanse til å låse opp en ekstra uvanlig variant av én av gjenstandene <i>i</i> det settet! Og som de fleste mirakler er sjansene for at du faktisk får tak i den omtrent like stor som å bli truffet av en meteoritt, så ikke rydd plass i arsenalet helt ennå.",
  "winter2023_bonus_item_fullset": "Fullstendig sett",
  "winter2023_bonus_item_unusual": "Uvanlig variant",
  "winter2023_stocking_stuffer_title": "Smågaver",
  "winter2023_stocking_stuffer_desc": "Hvis den tøffe realiteten i den forrige paragrafen gjorde deg deprimert over sannsynligheten for å noensinne få en bonusgave i tillegg til den vanlige gaven, opp med haka! Frostivus' gavepatrulje stopper <i>garantert</i> ved huset ditt hver gang du fyller opp Frostivus-stemningsmåleren, men én av de fine gavene nedenfor.",
  "winter2023_stocking_stuffer_sprays_stickers": "Graffitier og klistremerker",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "De nye graffitiene varer kun under Frostivus, men dere spurte og vi lyttet – klistremerkeversjonene varer evig. Klistre dem overalt på profilen.",
  "winter2023_stocking_stuffer_emoticons": "Uttrykksikoner",
  "winter2023_stocking_stuffer_emoticons_desc": "Før Marie Curie oppfant uttrykksikoner var det umulig å uttrykke følelser. Dota hyller selvoppofrelsen hennes – uttrykksikoner var tross alt radioaktive til å begynne med.",
  "winter2023_stocking_stuffer_ward": "Frosty the North Ward",
  "winter2023_stocking_stuffer_ward_desc": "Hemmelig bakgrunnsinformasjon: Denne lille snømannen er faktisk mektigere enn BEGGE eldene. Men det hadde du aldri fått vite. Hvorfor? Fordi han er <i>beskjeden</i>.",
  "winter2023_stocking_stuffer_courier": "Selkurer",
  "winter2023_stocking_stuffer_courier_desc": "Har du sett hvor søt denne lille fyren er? Og enda bedre, den er spiselig. Masse kjøtt og spekk på denne om du skulle havne i en lignende situasjon som Donner-følget.",
  "winter2023_frostivus_festive_items_title": "Festlige gjenstander",
  "winter2023_frostivus_party_hats": "Frostivus-hatter",
  "winter2023_frostivus_party_hats_description": "Vi har Frostivus-hatter til alle! Ikke noe hode? Ikke noe problem! For mange hoder? Det er det ikke noe som heter! Frostivus' gavepatrulje rygger hattedumperen på plass og tipper lasset på alt som kan minne om et hode.",
  "winter2023_frostivus_free_event_items": "Gratis ting",
  "winter2023_frostivus_free_event_items_description": "I tidligere Frostivuser hadde forbruksgjenstander begrensede ladninger. Men i år kan du bruke så mange du måtte ønske! Det er en gave. Eller snarere et lån. Frostivus' gavepatrulje kommer tilbake og samler dem inn når festen er slutt.",
  "winter2023_frostivus_high_fives": "High five",
  "winter2023_frostivus_high_fives_description": "I motsetning til de high fivene du hele tiden gir venner og familie, er Frostivus-high fivene mer en festlig skål i varm kakao. For å være ærlig synes venner og familie at du godt kan ta en pause fra alle de high fivene uansett.",
  "winter2023_frostivus_section_treasure_title": "Skatter fra Frostivus 2023",
  "winter2023_clientupdate_section_title": "Klientoppdateringer",
  "winter2023_clientupdate_introduction": "Den snille nissekongen har gitt bort alle gavene sine for enda et år. Gledelig Frostivus, alle sammen. Kjør forsiktig, men VENT! Det er noe <i>mer</i> helt nederst i sekken hans!",
  "winter2023_qol_section_title": "Kvalitetsforbedringer",
  "winter2023_qol_introduction": "Bedre informasjon for bedre avgjørelser",
  "winter2023_qol_tower_range_indicator_title": "Rekkeviddeindikator for tårn",
  "winter2023_qol_tower_range_indicator_desc": "Er du lei av å ikke vite når tårnet sikter på noe viktig (dvs. deg)? Forbedrede effekter gjør det mer åpenbart når det er trygt å hoppe inn, eller når man bør stikke av.",
  "winter2023_qol_teleport_time_title": "Teleporteringstid",
  "winter2023_qol_teleport_time_desc": "Det er et lite kjent faktum at tiden det tar å teleportere i Dota varierer – og at den frem til nå har vært usynlig. Nå kan du sjekke hvor lang tid det tar før du bruker Town Portal Scroll.",
  "winter2023_qol_minimap_title": "Ikoner på minikartet",
  "winter2023_qol_minimap_desc": "Piler, helteikoner – begge deler er bra.<i>«Hvorfor må jeg velge?»</i> skriker du ut i det store intet. Nå trenger du ikke å gjøre det lenger. Fordi – i Dota – er det ånden i det store intet som oppfyller ønsker.",
  "winter2023_qol_ability_shape_indicator_title": "Flere evneindikatorer",
  "winter2023_qol_ability_shape_indicador_desc": "<i>«Hvorfor mangler jeg så mange evneindikatorer?»</i> skriker du ut i det store intet. Puff! Se der, enda flere evner med nøyaktige områdeindikatorer.",
  "winter2023_qol_ability_icons_title": "Tilstand på evneikoner",
  "winter2023_qol_ability_icons_desc": "Om de passive evnene er avbrutt av Silver Edge, eller om du er rotfestet og ikke kan blinke av sted, kan du nå se om en evne er uskadeliggjort med nye tilstander på evneikoner.",
  "winter2023_qol_item_tooltips_title": "Bedre verktøytips for gjenstander",
  "winter2023_qol_item_tooltips_desc": "Å få informasjon om målrettingen til gjenstander betydde vanligvis en lang kjøretur til biblioteket, deretter en lang diskusjon med en forvirret bibliotekar. Nå vises måltype, skadetype, fordrivelsesevne og mer i verktøytipset.",
  "winter2023_qol_xp_range_title": "Rekkeviddeindikator for XP",
  "winter2023_qol_xp_range_desc": "XP finnes overalt rundt oss, det er bare å snike det til seg. Hvis bare du visste hvor du kan finne det. Vel, nå kan du det ganske enkelt ved å holde over heltens nivå. Trenger ikke bruke ALT engang!",
  "winter2023_qol_wisdom_rune_timer_title": "Nedtelling for visdomsrune i Dota Plus",
  "winter2023_qol_wisdom_rune_timer_desc": "For en rune tilegnet visdom pleide visdomsrunen å være ganske så dum når det kom til å vise en nedtelling til når den dukket opp. Ser ut som den endelig skjerpet seg og skaffet seg en klokke.",
  "winter2023_qol_creep_bounties_title": "Dusører fra kryp",
  "winter2023_qol_creep_bounties_desc": "<i>«Hvorfor kan jeg ikke se hvor mye dusør et kryp er verdt, både i stien og i leirer?»</i> skriker du ut i det store intet. «Virkelig?» svarer ånden i det store intet. «Jeg hadde bedt om flere ønsker. Uansett, det kan vi ordne. Sees neste Frostivus.»",
  "winter2023_qol_misc_title": "… og andre forbedringer til grensesnittet",
  "winter2023_qol_misc_desc": "Det er masse informasjon å ta innover seg i Dota, og vi har gjort flere forbedringer til grensesnittet for å hjelpe. Høyreklikk på gjenstander i oppakningen fremhever nå hvilke gjenstand du har valgt ved å gjøre de andre mørkere. Aldri slipp eller selg feil gjenstand igjen. Populære gjenstander har nå en grå kant når du har råd til dem. Endelig samsvar og ingen forvirrende kanter. I tillegg er nå helsekostnader for gjenstander skjult sammen med mana når de er i ryggsekken. Til slutt, når du går inn i heltedemomodus, starter du nå unna tårnene, slik at du har mye plass til å teste det du vil med det samme.",
  "winter2023_profileshowcase_section_title": "Profilutstilling",
  "winter2023_profileshowcase_introduction": "Flere måter å uttrykke seg på enn noen gang før",
  "winter2023_profileshowcase_animations_title": "Animasjoner",
  "winter2023_profileshowcase_animations_desc": "Er du lei av at heltene dine bare står der? Nå kan du velge en animasjonssekvens for å få dem til å bevege seg.",
  "winter2023_profileshowcase_anchoring_title": "Forankring på helter",
  "winter2023_profileshowcase_anchoring_desc": "Nå kan du ankre andre profilelementer på heltemodeller og se dem bevege seg med animasjonen.",
  "winter2023_profileshowcase_freezeframes_title": "Stillbilder",
  "winter2023_profileshowcase_freezeframes_desc": "Sett på pause på et valgfritt bilde i en animasjon for å fange det perfekte klønete øyeblikket.",
  "winter2023_profileshowcase_gridsnapping_title": "Fest til rutenett",
  "winter2023_profileshowcase_gridsnapping_desc": "Plasserer du ting med dumt menneskelig øyemål og magefølelse? Hvorfor ikke la dataen gjøre det perfekt for deg?",
  "winter2023_profileshowcase_improved_portraits_title": "Forbedrede portretter",
  "winter2023_profileshowcase_improved_portraits_desc": "Velg mellom 3D-modellen eller 2D-portrettversjonen av heltene. Vis frem helteemblem og til og med relikvier.",
  "winter2023_profileshowcase_more_items_title": "Flere modeller",
  "winter2023_profileshowcase_more_items_desc": "Tilkalte skapninger, varder, hån, kjæledyr, gjenstander … du kan presse alt mulig inn i profilen.",
  "winter2023_armory_section_title": "Arsenal",
  "winter2023_armory_introduction": "Flere forbedringer til lageret",
  "winter2023_armory_grouping_title": "Forbedret gruppering",
  "winter2023_armory_grouping_desc": "Alle gjenstander kan nå grupperes etter heltenavn. ",
  "winter2023_armory_filters_tags_title": "Filtre og merkelapper er tilbake",
  "winter2023_armory_filters_tags_desc": "Filtrer ved bruk av nøkkelord og opprett visninger med forhåndsdefinerte søkekriterier.",
  "winter2023_armory_stickers_title": "Finn klistremerker",
  "winter2023_armory_stickers_desc": "Se klistremerker du ikke eier, og bla gjennom klistremerker som var tilgjengelige tidligere.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Nye premiumsett, oppdrag og gildebelønninger",
  "winter2023_dotaplus_premium_sets_title": "Nye premiumsett",
  "winter2023_dotaplus_premium_sets_desc": "Denne sesongen med Dota Plus har tre nye premiumsett som kan kjøpes for 150 000 skår hver i skårbutikken.",
  "winter2023_dotaplus_seasonal_quests_title": "Tilbakestilte sesongoppdrag",
  "winter2023_dotaplus_seasonal_quests_desc": "Flere måter å tjene skår.",
  "winter2023_dotaplus_guild_rewards_title": "Oppdaterte gildebelønninger",
  "winter2023_dotaplus_guild_rewards_desc": "Som alltid er nye uttrykksikoner, graffitier og samtalehjul tilgjengelige for gilder som tjener mange poeng.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Silent Wight",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silver Squall",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo and Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (inkludert persona)",
  "frosty_treasure_treasure_name_5": "Frosty the Sew-Man",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Jingle Fist",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "The Abominable Snowbeast",
  "frosty_treasure_hero_name_8": "Crystal Maiden (inkludert persona)",
  "frosty_treasure_treasure_name_8": "Guardian Snow Angel",
  "frosty_treasure_hero_name_9": "Wraith King (inkludert arkana)",
  "frosty_treasure_treasure_name_9": "King Kringle",
  "frosty_treasure_hero_name_10": "Kurer",
  "frosty_treasure_treasure_name_10": "Gingerbread Baby Roshan",
  "winter2023_gameplay_section_title": "Spilloppdateringer",
  "winter2023_patchnotes_new_items_title": "Nye og oppdaterte spillgjenstander",
  "winter2023_patchnotes_new_items_introduction": "Det virker som om det er én gave igjen i nissekongens sekk, og han er i sin fulle rett til å gjøre krav på den ved å slåss mot et barn til det siste. Han svinger langsverdet og – ja, gaven er hans ved kamp! Det er en rekke omgjorte Dota-gjenstander – noen helt nye, sammen med noen gamle favoritter.",
  "winter2023_patchnotes_section_title": "Endringslogg 7.35",
  "winter2023_recipe": "Oppskrift:"
}