// 905.js

{
  "language": "german",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Wir legen Euch festliche kosmetische Gegenstände, das Gameplay-Update 7.35, drei Premium-Sets für Dota Plus und jede Menge an Verbesserungen am Spielerlebnis unter den Weihnachtsbaum",
  "winter2023_subtitle_short": "Festliche kosmetische Gegenstände, ein Gameplay-Update und Verbesserungen am Spielerlebnis",
  "winter2023_section_introduction": "Frostivus hatte früher einmal eine <i>Bedeutung</i>. Es ging nicht etwa um Ihre Freunde, Ihre Familie oder Ihre Gefühle. Es ging ausschließlich darum, <i>Geschenke zu bekommen</i>. Aber eines Tages löste sich dieser Brauch von dem ganzen Materialismus und plötzlich war das einfältige Herz eines Jeden nur noch vom Geist des Gebens erfüllt. Deshalb haben wir dieses Jahr die WAHRE Bedeutung von Frostivus wiederbelebt: kosmetische Gegenstände.",
  "winter2023_frostivus_section_title": "Frostivus-Schatz",
  "winter2023_frostivus_section_date": "14. Dezember 2023 – 11. Januar 2024",
  "winter2023_frostivus_section_introduction": "Gewinnen Sie Partien, um Ihre Frostivus-Fortschrittsanzeige aufzufüllen und einen verschlossenen Frostivus-Schatz UND einen zufälligen Gefüllten Stiefel zu erhalten, der viele Geschenke von Graffitis über Emoticons bis hin zu Aufklebern enthält.",
  "winter2023_frostivus_earn_chests": "Truhen verdienen",
  "winter2023_frostivus_how_to_earn_chests": "Jedes Mal, wenn Sie Ihre Frostivus-Fortschrittsanzeige auffüllen, durchströmt Sie der Geist von Frostivus in Form eines verschlossenen Frostivus-Schatzes 2023.",
  "winter2023_frostivus_buy_keys": "Schlüssel kaufen",
  "winter2023_frostivus_how_to_buy_keys": "Kaufen Sie Schlüssel, um Schätze zu öffnen und die wahre Bedeutung der darin enthaltenen Gaben zu entdecken.",
  "winter2023_naughty_or_nice_section_title": "Waren Sie …",
  "winter2023_naughty_or_nice_naughty": "Unartig?",
  "winter2023_naughty_or_nice_naughty_desc": "Es hat keinen Sinn, es abzustreiten. König Krampus weiß Bescheid. Er hat Ihre Verhaltenswertungen zweimal überprüft und zieht mit seinem Bannhammer von Haus zu Haus, um diesen auf die Smurfaccounts aller unartiger Jungen und Mädchen niederfahren zu lassen, bevor er Strafen an die zugehörigen Hauptaccounts verteilt.",
  "winter2023_naughty_or_nice_nice": "Oder brav?",
  "winter2023_naughty_or_nice_nice_desc": "Haben Sie dieses Jahr Dota gespielt, ohne gegen die Spielregeln zu verstoßen? Großartig! König Krampus hat einen <i>anderen</i> Hammer für Sie! Machen Sie sich nichts vor, <i>er wird Sie trotzdem damit schlagen</i>. Aber wenn Sie dann im Krankenhaus aufwachen, werden Sie sich fragen: War das alles nur ein Traum? Was ist das neben mir auf meinem Kissen? Ein <i>kostenloses Frostivus-Geschenk</i>! Was hat Ihnen Ihre Verhaltenswertung eingebracht? Öffnen Sie Ihr Geschenk und finden Sie es heraus …",
  "winter2023_naughty_or_nice_nice_desc2": "Haben Sie eine besonders artige Verhaltenswertung? Großartig! König Krampus hat einen <i>anderen</i> Hammer für Sie! Machen Sie sich nichts vor, er wird Sie trotzdem damit schlagen. Aber wenn Sie dann im Krankenhaus aufwachen, werden Sie sich fragen: War das alles nur ein Traum? Was ist das neben mir auf meinem Kissen? Ein <i>kostenloser Frostivus-Schlüssel</i>!",
  "winter2023_frostivus_section_event_title": "Frostivus-Schatz 2023",
  "winter2023_frostivus_section_event_introduction": "Brandneue Gegenstandssets für Ihre Lieblingshelden sowie die Rückkehr einiger winterlichen Lieblinge — und sogar das Wraith-King-Arkana und die Crystal-Maiden-Persona sind mit von der Partie!",
  "winter2023_bonus_item_title": "Die Zeit des (sehr sporadischen) Schenkens",
  "winter2023_bonus_item_desc": "Es ist ein Frostivus-Wunder! Jedes Mal, wenn Sie ein Set auspacken, erhalten Sie <i>zusätzlich</i> die Chance, eine ungewöhnliche Variante eines in <i>diesem</i> Set enthaltenen Gegenstands freizuschalten! Und wie bei den meisten Wundern ist die Wahrscheinlichkeit, einen solchen Gegenstand in die Hände zu bekommen, so groß wie die, von einem Meteoriten getroffen zu werden. Sie müssen also noch keinen Platz in Ihrem Arsenal leer räumen.",
  "winter2023_bonus_item_fullset": "Komplettes Set",
  "winter2023_bonus_item_unusual": "Ungewöhnliche Variante",
  "winter2023_stocking_stuffer_title": "Gefüllte Stiefel",
  "winter2023_stocking_stuffer_desc": "Falls Sie die harte versicherungsmathematische Realität des letzten Absatzes über die Wahrscheinlichkeit, jemals eines dieser zusätzlichen Geschenke über ein reguläres Geschenk hinaus zu erhalten, deprimiert hat, dann Kopf hoch! Das Frostivus-Geschenkkomitee kommt <i>garantiert</i> jedes Mal, wenn Sie Ihre Frostivus-Fortschrittsanzeige aufgefüllt haben, bei Ihrem Haus vorbei und bringt Ihnen eines dieser tollen Geschenke, die unten aufgeführt sind.",
  "winter2023_stocking_stuffer_sprays_stickers": "Graffitis und Aufkleber",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Diese neuen Graffitis sind nur während des Frostivus-Events verfügbar, jedoch erfüllen wir gerne die Wünsche der Community: Die Aufklebervarianten sind permanent verfügbar. Kleben Sie sie überall in Ihre Profilaussteller!",
  "winter2023_stocking_stuffer_emoticons": "Emoticons",
  "winter2023_stocking_stuffer_emoticons_desc": "Bevor Marie Curie die Emoticons erfand, wusste niemand seine Gefühle auszudrücken. Dota würdigt ihre Selbstaufopferung, denn die ersten Emoticons waren hochgradig radioaktiv.",
  "winter2023_stocking_stuffer_ward": "Flöckchen der Nordwächter",
  "winter2023_stocking_stuffer_ward_desc": "Geheimes Zusatzwissen: Dieser zu kurz geratene Schneemann ist in Wirklichkeit mächtiger als BEIDE Ancients ZUSAMMEN. Aber Sie werden seine Macht nie zu Gesicht bekommen. Warum? Er ist <i>bescheiden</i>.",
  "winter2023_stocking_stuffer_courier": "Robbenkurier",
  "winter2023_stocking_stuffer_courier_desc": "Sieh sich einer an, wie niedlich dieses kleine Kerlchen ist. Und es kommt noch besser: Es ist essbar. Sollten Sie mal vom Winter überrascht werden, steckt jede Menge Fleisch und Speck in diesem Ding.",
  "winter2023_frostivus_festive_items_title": "Festliche Gegenstände",
  "winter2023_frostivus_party_hats": "Frostivus-Hüte",
  "winter2023_frostivus_party_hats_description": "Wir haben Frostivus-Hüte für alle! Kein Kopf? Kein Problem! Zu viele Köpfe? So etwas gibt es nicht! Das Frostivus-Geschenkkomitee scheut hierbei keine Mühen und Kosten und stattet alles, was auch nur ansatzweise wie ein Kopf aussieht, mit einem passenden Hut aus.",
  "winter2023_frostivus_free_event_items": "Gebrauchsgegenstände",
  "winter2023_frostivus_free_event_items_description": "In der Vergangenheit hatten Frostivus-Gegenstände nur eine begrenzte Anzahl an Aufladungen. In diesem Jahr werden aus den Verbrauchsgegenständen Gebrauchsgegenstände, d. h. Sie können sie so oft benutzen, wie Sie wollen! Sozusagen als Geschenk. Obwohl: eher eine Leihgabe. Das Frostivus-Geschenkkomitee kehrt am Ende des Events zurück, um sie wieder einzusammeln.",
  "winter2023_frostivus_high_fives": "High Fives",
  "winter2023_frostivus_high_fives_description": "Im Gegensatz zu den High Fives, die Sie Ihren Freunden und Ihrer Familie ständig geben, sind die Frostivus-High-Fives eher wie festliche Trinksprüche mit heißer Schokolade. Und wenn wir ehrlich sind: Ihre Freunde und Ihre Familie denken ohnehin, dass Sie sich eine Pause von all diesen High Fives gönnen sollten.",
  "winter2023_frostivus_section_treasure_title": "Frostivus-Schatz 2023",
  "winter2023_clientupdate_section_title": "Client-Updates",
  "winter2023_clientupdate_introduction": "Es ist wieder so weit, der gute alte König Krampus hat für ein weiteres Jahr all seine Geschenke verteilt. Fröhliches Frostivus! Passen Sie auf den Pfaden auf, denn es ist glatt – doch MOMENT! Da ist noch etwas <i>anderes</i> in seinem Geschenksack!",
  "winter2023_qol_section_title": "Verbessertes Spielerlebnis",
  "winter2023_qol_introduction": "Bessere Informationen für bessere Spielentscheidungen",
  "winter2023_qol_tower_range_indicator_title": "Turmreichweitenindikator",
  "winter2023_qol_tower_range_indicator_desc": "Sind Sie es nicht leid, zu wissen, wann ein Turm auf etwas Wichtiges zielt (z. B. auf Sie)? Verbesserte Effekte machen nun deutlich, wann es sicher ist, sich dem Turm zu nähern, oder wann es Zeit ist, die Beine in die Hand zu nehmen.",
  "winter2023_qol_teleport_time_title": "Teleportationsdauer",
  "winter2023_qol_teleport_time_desc": "Es ist eine wenig bekannte Tatsache, dass die Teleportationsdauer in Dota unterschiedlich ist — und bisher auch nicht angezeigt wurde. Jetzt können Sie die jeweilige Reisedauer überprüfen, bevor Sie Ihre TP-Schriftrolle benutzen.",
  "winter2023_qol_minimap_title": "Minikartensymbole",
  "winter2023_qol_minimap_desc": "Pfeile, Heldensymbole – beides ist großartig. <i>„Warum muss ich mich entscheiden?“</i>, rufen Sie in den Himmel. Nun, das müssen Sie jetzt nicht mehr. Denn der Himmel – kurzer Einwurf zur Dota-Hintergrundgeschichte – ist ein wunscherfüllender Dschinn.",
  "winter2023_qol_ability_shape_indicator_title": "Mehr Fähigkeitsindikatoren",
  "winter2023_qol_ability_shape_indicador_desc": "<i>„Warum fehlen einige meiner rechteckigen Fähigkeitsindikatoren?“</i>, rufen Sie in den Himmel. Simsalabim! Weitere Fähigkeiten haben eine genaue Anzeige ihres Wirkungsbereichs erhalten.",
  "winter2023_qol_ability_icons_title": "Fähigkeitssymbolstatus",
  "winter2023_qol_ability_icons_desc": "Egal, ob Ihre passiven Fähigkeiten durch Silver Edge beeinflusst werden oder ob Sie festgesetzt sind und sich nicht wegblinzeln können – mit dem neuen Fähigkeitssymbolstatus können Sie jetzt auf einen Blick erkennen, ob eine Fähigkeit deaktiviert ist.",
  "winter2023_qol_item_tooltips_title": "Bessere Kurzinfos für Gegenstände",
  "winter2023_qol_item_tooltips_desc": "Um die gewünschten Informationen über Gegenstände zu erhalten, musste man früher einen langen Weg zur Bibliothek auf sich nehmen und sich dann mit einem verwirrt dreinblickenden Bibliothekar auseinandersetzen. Jetzt stehen Zieltyp, Schadenstyp, Entzauberbarkeit und mehr in den Kurzinfos.",
  "winter2023_qol_xp_range_title": "EP-Reichweitenindikator",
  "winter2023_qol_xp_range_desc": "Erfahrungspunkte gibt es überall, man muss nur wissen, wo sie zu finden sind. Jetzt können Sie sie finden, indem Sie einfach mit dem Mauszeiger über Ihr Heldenlevel fahren. Kein ALT-Tastendruck erforderlich!",
  "winter2023_qol_wisdom_rune_timer_title": "Timer für Weisheitsrunen (Dota Plus)",
  "winter2023_qol_wisdom_rune_timer_desc": "Die Rune der Weisheit hat sich bisher ziemlich dumm angestellt, wenn es darum ging, ihren Erscheinungstimer anzuzeigen. Sieht aus, als hätte sie dazugelernt und endlich eine Uhr gekauft.",
  "winter2023_qol_creep_bounties_title": "Goldprämien für Einheiten",
  "winter2023_qol_creep_bounties_desc": "<i>„Warum kann ich sowohl auf den Pfaden als auch in den neutralen Lagern nicht sehen, wie hoch die Goldprämie einer jeden Einheit ist?“</i>, rufen Sie in den Himmel. „Echt jetzt?“, antwortet der Himmelsdschinn. „Ich an deiner Stelle hätte mir ja mehr Wünsche gewünscht. Wie dem auch sei, bitte sehr. Dann bis zum nächsten Frostivus.“",
  "winter2023_qol_misc_title": "… und andere Verbesserungen am HUD",
  "winter2023_qol_misc_desc": "In Dota gibt es eine Menge Informationen zu verarbeiten, deshalb haben wir einige Verbesserungen am HUD vorgenommen, um Ihnen dabei zu helfen. Wenn Sie mit der rechten Maustaste auf Gegenstände in Ihrem Inventar klicken, wird der ausgewählte Gegenstand jetzt hervorgehoben, indem andere Gegenstände abgedunkelt werden. So lassen Sie nie wieder den falschen Gegenstand fallen oder verkaufen ihn gar. Gegenstände in Guides haben jetzt nur noch einen grauen Rand, wenn Sie genug Gold haben, um sie sich zu leisten. Nie wieder verwirrende Diskrepanzen bei den Rändern! Außerdem werden die Lebenskosten für Gegenstände sowie die Manakosten versteckt, wenn sie sich in Ihrem Rucksack befinden. Zu guter Letzt steigen Helden im Demomodus jetzt weit genug weg von den Türmen ein, sodass Sie genügend Platz haben, um alles zu testen, was Sie wollen.",
  "winter2023_profileshowcase_section_title": "Profilschaukasten",
  "winter2023_profileshowcase_introduction": "Neue Möglichkeiten, Ihre Persönlichkeit auszudrücken",
  "winter2023_profileshowcase_animations_title": "Animationen",
  "winter2023_profileshowcase_animations_desc": "Haben Sie es nicht auch satt, dass Ihre Helden einfach nur dastehen? Jetzt können Sie eine Animationssequenz auswählen, um etwas Bewegung in die Sache zu bringen.",
  "winter2023_profileshowcase_anchoring_title": "Verankerung auf Helden",
  "winter2023_profileshowcase_anchoring_desc": "Jetzt können Sie andere Elemente in Ihrem Profilaussteller an einem Heldenmodell verankern und beobachten, wie sie sich mit der Animation bewegen.",
  "winter2023_profileshowcase_freezeframes_title": "Standbilder",
  "winter2023_profileshowcase_freezeframes_desc": "Wählen Sie ein beliebiges Standbild einer Animation aus, um den perfekten plumpen Moment einzufangen.",
  "winter2023_profileshowcase_gridsnapping_title": "Hilfslinien",
  "winter2023_profileshowcase_gridsnapping_desc": "Richten Sie die Dinge mit Ihren unzulänglichen menschlichen Augen oder Ihrem „Bauchgefühl“ aus? Warum lassen Sie das nicht den Hilfslinien-O-Mat™ auf perfekte Weise für Sie erledigen?",
  "winter2023_profileshowcase_improved_portraits_title": "Verbesserte Heldenporträts",
  "winter2023_profileshowcase_improved_portraits_desc": "Wählen Sie zwischen dem 3D-Modell oder dem 2D-Porträt Ihrer Lieblingshelden. Präsentieren Sie Ihr Heldenabzeichen oder Ihre Heldenrelikte.",
  "winter2023_profileshowcase_more_items_title": "Weitere Elemente",
  "winter2023_profileshowcase_more_items_desc": "Beschwörungen, Wächter, Spott, Begleiter, häufig gekaufte Gegenstände … Sie können Ihrem Profilaussteller hinzufügen, was immer Sie wollen.",
  "winter2023_armory_section_title": "Arsenal",
  "winter2023_armory_introduction": "Weitere Verbesserungen an Ihrem Arsenal",
  "winter2023_armory_grouping_title": "Verbesserte Gruppierung",
  "winter2023_armory_grouping_desc": "Alle Gegenstände können jetzt nach Heldennamen gruppiert werden.",
  "winter2023_armory_filters_tags_title": "Filter und Tags kehren zurück",
  "winter2023_armory_filters_tags_desc": "Filtern Sie mithilfe der Stichwortsuche und erstellen Sie Ansichten mit vordefinierten Suchkriterien.",
  "winter2023_armory_stickers_title": "Aufkleber entdecken",
  "winter2023_armory_stickers_desc": "Entdecken Sie Aufkleber, die Sie nicht besitzen, oder stöbern Sie nach jenen, die früher einmal verfügbar waren.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Neue Premium-Sets, Quests und Gildenbelohnungen",
  "winter2023_dotaplus_premium_sets_title": "Neue Premium-Sets",
  "winter2023_dotaplus_premium_sets_desc": "Diese Dota-Plus-Saison bringt drei neue Premium-Sets mit sich, die im Splitter-Shop für jeweils 150.000 Splitter erworben werden können.",
  "winter2023_dotaplus_seasonal_quests_title": "Neue saisonale Quests",
  "winter2023_dotaplus_seasonal_quests_desc": "Noch mehr Möglichkeiten, Ihren Splittervorrat aufzufüllen.",
  "winter2023_dotaplus_guild_rewards_title": "Aktualisierte Gildenbelohnungen",
  "winter2023_dotaplus_guild_rewards_desc": "Wie gewohnt gibt es neue Emoticons, Graffitis und Chatradsprüche für Gilden mit entsprechend hoher Punktzahl.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Unheilige Nacht",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silberne Böe",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo und Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Glaskugel des Äquinoktiums",
  "frosty_treasure_hero_name_5": "Pudge (enthält Persona)",
  "frosty_treasure_treasure_name_5": "Frosti der Nähmann",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Klingende Schellen",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "Schreckliche Schneebestie",
  "frosty_treasure_hero_name_8": "Crystal Maiden (enthält Persona)",
  "frosty_treasure_treasure_name_8": "Schutzengel des Schnees",
  "frosty_treasure_hero_name_9": "Wraith King (enthält Arkana)",
  "frosty_treasure_treasure_name_9": "König Krampus",
  "frosty_treasure_hero_name_10": "Kurier",
  "frosty_treasure_treasure_name_10": "Lebkuchen Baby-Roshan",
  "winter2023_gameplay_section_title": "Gameplay-Updates",
  "winter2023_patchnotes_new_items_title": "Neue und aktualisierte Gegenstände",
  "winter2023_patchnotes_new_items_introduction": "Es sieht so aus, als wäre noch ein letztes Geschenk in König Krampus’ Sack. Wie es ihm zusteht, kann er es durch einen Kampf auf Leben und Tod gegen ein Kind für sich beanspruchen. Er schwingt sein Langschwert … und siehe da, das Geschenk gehört ihm! Dabei handelt es sich um einen Haufen überarbeiteter Dota-Gegenstände: einige sind brandneu, andere wiederum altbekannt.",
  "winter2023_patchnotes_section_title": "Patchnotizen für 7.35",
  "winter2023_recipe": "Rezept:"
}