// 6080.js

{
  "language": "portuguese",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Acaba o ano em grande com itens cosméticos festivos, a atualização de jogabilidade 7.35, três conjuntos exclusivos do Dota Plus e muitos melhoramentos para o jogo",
  "winter2023_subtitle_short": "Cosméticos festivos, atualização de jogabilidade e muitos melhoramentos para o jogo",
  "winter2023_section_introduction": "Frostivus costumava ter um <i>significado</i>. Não era sobre amigos, família ou sentimentos. Era sobre <i>receber presentes</i>. No entanto, todo este materialismo desapareceu e, de repente, os corações parvos de toda a gente foram preenchidos com um espírito benevolente. Por isso, este ano, redescobrimos o VERDADEIRO significado de Frostivus: itens cosméticos.",
  "winter2023_frostivus_section_title": "Tesouros de Frostivus",
  "winter2023_frostivus_section_date": "14 dez. 2023 - 11 jan. 2024",
  "winter2023_frostivus_section_introduction": "Vence partidas para encheres o teu Frostivómetro e ganhares um Tesouro de Frostivus trancado E AINDA um sapatinho com presentes aleatórios, como sprays, emoticons e autocolantes.",
  "winter2023_frostivus_earn_chests": "Ganha tesouros",
  "winter2023_frostivus_how_to_earn_chests": "Sempre que encheres o teu Frostivómetro, irás sentir o verdadeiro espírito de Frostivus, ou seja, irás receber um Tesouro de Frostivus 2023 trancado.",
  "winter2023_frostivus_buy_keys": "Compra chaves",
  "winter2023_frostivus_how_to_buy_keys": "Compra chaves para destrancares tesouros e descobrires o verdadeiro significado das riquezas no seu interior.",
  "winter2023_naughty_or_nice_section_title": "Portaste-te...",
  "winter2023_naughty_or_nice_naughty": "Mal?",
  "winter2023_naughty_or_nice_naughty_desc": "Não vale a pena negar. O Pai Espectral sabe. Ele viu a tua pontuação de conduta duas vezes e vem aí com a sua marreta para banir as contas smurf de todas as crianças marotas, antes de penalizar as contas principais associadas.",
  "winter2023_naughty_or_nice_nice": "Ou bem?",
  "winter2023_naughty_or_nice_nice_desc": "Jogaste Dota este ano sem infringir as regras! Excelente! O Pai Espectral tem uma marreta <i>diferente</i> para ti! Não te iludas, <i>vais levar uma marretada na mesma</i>. Mas assim que acordares no hospital... \"Foi tudo um sonho? O que é isto debaixo da minha almofada?\" Um <i>presente de Frostivus GRÁTIS</i>! Será que o conteúdo deste presente é proporcional à tua pontuação de conduta? Vais ter de o abrir para descobrir...",
  "winter2023_naughty_or_nice_nice_desc2": "Tens uma pontuação de conduta bastante alta? Excelente! O Pai Espectral tem uma marreta <i>diferente</i> para ti! Não te iludas, vais levar uma marretada na mesma. Mas assim que acordares no hospital... \"Foi tudo um sonho? O que é isto debaixo da minha almofada?\" Uma <i>chave de Frostivus GRÁTIS!</i>",
  "winter2023_frostivus_section_event_title": "Tesouros de Frostivus 2023",
  "winter2023_frostivus_section_event_introduction": "Conjuntos inéditos para os teus heróis favoritos, além do regresso de alguns clássicos favoritos. E até as visitas do Arcano do Wraith King e da Persona da Crystal Maiden!",
  "winter2023_bonus_item_title": "O espírito da (muito ocasional) generosidade",
  "winter2023_bonus_item_desc": "É um milagre de Frostivus! Sempre que abrires um conjunto, <i>também</i> terás a chance de desbloquear uma variante Inusual de um dos itens <i>desse</i> conjunto! Como na maioria dos milagres, a probabilidade de isto acontecer é idêntica à de ser atingido por um meteoro, então, não tenhas pressa em fazer espaço no teu Arsenal.",
  "winter2023_bonus_item_fullset": "Conjunto completo",
  "winter2023_bonus_item_unusual": "Variante Inusual",
  "winter2023_stocking_stuffer_title": "Sapatinhos com presentes",
  "winter2023_stocking_stuffer_desc": "Se a dura realidade factual do parágrafo acima te deprimiu por causa da probabilidade de receber um presente adicional além do presente normal, anima‑te! Sempre que encheres o Frostivómetro, é <i>garantido</i> que a Patrulha dos Prémios de Frostivus bata à tua porta para te entregar um dos incríveis presentes abaixo.",
  "winter2023_stocking_stuffer_sprays_stickers": "Sprays e autocolantes",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Estes novos sprays só estarão disponíveis durante o Frostivus. Contudo, a pedido de muitas famílias, as versões em autocolante serão permanentes. Cola‑os por todo o teu perfil!",
  "winter2023_stocking_stuffer_emoticons": "Emoticons",
  "winter2023_stocking_stuffer_emoticons_desc": "Antes de Marie Curie inventar os emoticons, ninguém sabia como exprimir emoções. O Dota saúda o sacrifício de Marie Curie, já que os primeiros autocolantes eram altamente radioativos.",
  "winter2023_stocking_stuffer_ward": "Frosty the North Ward",
  "winter2023_stocking_stuffer_ward_desc": "História secreta adicional: este bonequinho de neve é, na verdade, mais poderoso do que AMBOS os Ancients. Porque é que ele não os destrói, então? Bem, ele é <i>modesto</i>.",
  "winter2023_stocking_stuffer_courier": "Foca Estafeta",
  "winter2023_stocking_stuffer_courier_desc": "Mas que criatura adorável temos aqui! Melhor ainda, é comestível. Tem tanta chicha que te deve safar quando um dia te perderes nas montanhas.",
  "winter2023_frostivus_festive_items_title": "Itens festivos",
  "winter2023_frostivus_party_hats": "Chapéus de Frostivus",
  "winter2023_frostivus_party_hats_description": "Temos chapéus de Frostivus para toda a gente! Não tens uma cabeça? Sem problemas! Tens cabeças a mais? Nunca são a mais! A Patrulha dos Prémios de Frostivus vem aí com um camião cheio de chapéus e vai despejá‑los em tudo o que se possa parecer com uma cabeça.",
  "winter2023_frostivus_free_event_items": "Consumíveis infinitos",
  "winter2023_frostivus_free_event_items_description": "Em Frostivus passados, os itens consumíveis tinham cargas limitadas. Este ano, podes usar quantos quiseres! É um presente. Ou melhor, é mais um empréstimo. A Patrulha dos Prémios de Frostivus irá voltar para os recolher todos no fim do evento.",
  "winter2023_frostivus_high_fives": "Dá cá mais cinco",
  "winter2023_frostivus_high_fives_description": "Em vez das palmadas que costumas dar nas mãos de amigos e familiares, os \"Dá cá mais cinco\" de Frostivus são como fazer um brinde com canecas de chocolate quente. Cá entre nós, os teus amigos e familiares acham que devias parar com tanta palmada.",
  "winter2023_frostivus_section_treasure_title": "Tesouros de Frostivus 2023",
  "winter2023_clientupdate_section_title": "Atualizações à aplicação",
  "winter2023_clientupdate_introduction": "E pronto, o bom velho Pai Espectral distribuiu todos os presentes. Feliz Frostivus a todos, façam uma boa viagem e... ALTO! Há <i>outras surpresas</i> no fundo do saco!",
  "winter2023_qol_section_title": "Melhoramentos de qualidade",
  "winter2023_qol_introduction": "Melhores informações levam a melhores decisões",
  "winter2023_qol_tower_range_indicator_title": "Indicador do alcance das torres",
  "winter2023_qol_tower_range_indicator_desc": "Incomoda‑te não saber quando é que uma torre tem algo importante como alvo (tu, por exemplo)? Com os novos efeitos melhorados, é mais fácil perceber quando é que deves avançar ou bater em retirada.",
  "winter2023_qol_teleport_time_title": "Duração de teletransportes",
  "winter2023_qol_teleport_time_desc": "É um facto pouco conhecido que as durações dos teletransportes no Dota variam. A duração não é indicada no jogo. Isto é, até hoje. Agora, podes verificar quanto tempo irá durar a preparação do teletransporte antes de usares o teu TP Scroll.",
  "winter2023_qol_minimap_title": "Ícones no minimapa",
  "winter2023_qol_minimap_desc": "Setas, ícones de heróis, ambos são fantásticos. <i>\"Porque é que preciso de escolher?\"</i>, gritas tu para os céus. Mas agora já não precisas de escolher. Porque, segundo a história do Dota, o céu é um génio que concede desejos.",
  "winter2023_qol_ability_shape_indicator_title": "Mais retículas de habilidades",
  "winter2023_qol_ability_shape_indicador_desc": "<i>\"Porque é que algumas das minhas habilidades não têm retículas?\"</i>, gritas tu para os céus. Puf! Apresentamos ainda mais habilidades com uma indicação precisa da área de efeito.",
  "winter2023_qol_ability_icons_title": "Estados das habilidades",
  "winter2023_qol_ability_icons_desc": "Quer estejam as tuas habilidades passivas desativadas pela Silver Edge ou esteja o teu herói preso ao chão sem poder usar Blink para outro sítio, agora podes ver de relance o estado das tuas habilidades graças aos novos indicadores nos ícones das habilidades.",
  "winter2023_qol_item_tooltips_title": "Melhores descrições de itens",
  "winter2023_qol_item_tooltips_desc": "Antigamente, para saber o tipo de alvo de um item, era preciso fazer uma longa viagem até à biblioteca e ter uma longa discussão com uma bibliotecária confusa. Agora, a janela descritiva de cada item indica se o efeito pode ser dissipado, o tipo de alvo, o tipo de dano e muito mais.",
  "winter2023_qol_xp_range_title": "Indicador de distância para ganhar XP",
  "winter2023_qol_xp_range_desc": "XP existe em todo o lado, à mão de semear. É só uma questão de saber procurar. E agora, isso também é fácil: basta passar o cursor sobre o nível do teu herói. Nem é preciso manter ALT premido!",
  "winter2023_qol_wisdom_rune_timer_title": "Temporizador do Dota Plus para runas de Sabedoria",
  "winter2023_qol_wisdom_rune_timer_desc": "Para uma runa dedicada à sabedoria, a Runa de Sabedoria era demasiado burra para indicar quanto tempo faltava para reaparecer. Parece que a runa ganhou juízo e finalmente comprou um relógio.",
  "winter2023_qol_creep_bounties_title": "Recompensas por matar creeps",
  "winter2023_qol_creep_bounties_desc": "<i>\"Porque é que não posso ver quanto recebo por matar um creep, tanto nas lanes como em acampamentos?\"</i>, gritas tu para os céus. <i>\"A sério?\"</i>, responde o génio dos céus. <i>\"Eu teria pedido mais desejos. Mas pronto, toma lá. Vemo‑nos no próximo Frostivus.\"</i>",
  "winter2023_qol_misc_title": "... e outros melhoramentos para a interface",
  "winter2023_qol_misc_desc": "Existem muitas informações para absorver no Dota e melhorámos várias partes da interface para ajudar. Clicar com o botão direito em itens no teu inventário agora destaca o item que selecionaste enquanto escurece os outros. Nunca mais vais largar ou vender o item errado. Itens populares agora têm uma borda cinzenta apenas quando tiveres ouro suficiente para os comprares. Não há mais bordas inconsistentes e confusas. Além disso, os custos de vida de itens na mochila são ocultados, assim como os custos de mana. Por último, no modo de teste de heróis, agora começas longe das torres, para que tenhas bastante espaço para testar tudo o que quiseres.",
  "winter2023_profileshowcase_section_title": "Galeria do Perfil",
  "winter2023_profileshowcase_introduction": "Mais formas de te exprimires do que nunca",
  "winter2023_profileshowcase_animations_title": "Animações",
  "winter2023_profileshowcase_animations_desc": "Já cansa ter os teus heróis parados ali? Agora podes escolher uma sequência de animação para os meteres a mexer.",
  "winter2023_profileshowcase_anchoring_title": "Juntar a heróis",
  "winter2023_profileshowcase_anchoring_desc": "Agora podes juntar outros elementos do perfil aos modelos dos heróis e vê‑los em movimento com a animação.",
  "winter2023_profileshowcase_freezeframes_title": "Parar animações",
  "winter2023_profileshowcase_freezeframes_desc": "Podes parar uma animação em qualquer frame para capturares aquele perfeito momento deselegante.",
  "winter2023_profileshowcase_gridsnapping_title": "Alinhamento em grelha",
  "winter2023_profileshowcase_gridsnapping_desc": "Alinhar coisas com os teus imperfeitos olhos humanos e \"instintos\"? Porque não deixar o AlinhaTron™ fazer isso por ti com perfeição?",
  "winter2023_profileshowcase_improved_portraits_title": "Retratos melhorados",
  "winter2023_profileshowcase_improved_portraits_desc": "Escolhe entre o modelo 3D e o retrato 2D dos teus heróis favoritos. Exibe a tua medalha de Nível Heroico e até as tuas relíquias.",
  "winter2023_profileshowcase_more_items_title": "Mais modelos",
  "winter2023_profileshowcase_more_items_desc": "Unidades invocadas, Wards, provocações, mascotes, destaques... Se existe, podes colocá‑lo no teu perfil.",
  "winter2023_armory_section_title": "Arsenal",
  "winter2023_armory_introduction": "Mais melhoramentos para o teu inventário",
  "winter2023_armory_grouping_title": "Agrupamento melhorado",
  "winter2023_armory_grouping_desc": "Todos os itens podem agora ser agrupados pelo nome do herói. ",
  "winter2023_armory_filters_tags_title": "Regresso dos filtros e marcadores",
  "winter2023_armory_filters_tags_desc": "Filtra ao escrever no campo de pesquisa e cria vistas com critérios de pesquisa predefinidos.",
  "winter2023_armory_stickers_title": "Encontra autocolantes",
  "winter2023_armory_stickers_desc": "Vê autocolantes que ainda não tens e visualiza aqueles que já não estão disponíveis.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Novos conjuntos premium, missões e recompensas de clã",
  "winter2023_dotaplus_premium_sets_title": "Novos conjuntos premium",
  "winter2023_dotaplus_premium_sets_desc": "Esta temporada do Dota Plus revela três novos conjuntos premium disponíveis para compra na Loja de Fragmentos por 150 000 Fragmentos cada um.",
  "winter2023_dotaplus_seasonal_quests_title": "Atualização sazonal de missões",
  "winter2023_dotaplus_seasonal_quests_desc": "Mais formas de aumentar a tua reserva de Fragmentos.",
  "winter2023_dotaplus_guild_rewards_title": "Recompensas de clã atualizadas",
  "winter2023_dotaplus_guild_rewards_desc": "Como sempre, novos emoticons, sprays e mensagens para a Chat Wheel estão disponíveis para os clãs com mais pontos.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Silent Wight",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Silver Squall",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo and Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (inclui Persona)",
  "frosty_treasure_treasure_name_5": "Frosty the Sew-Man",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Jingle Fist",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "The Abominable Snowbeast",
  "frosty_treasure_hero_name_8": "Crystal Maiden (inclui Persona)",
  "frosty_treasure_treasure_name_8": "Guardian Snow Angel",
  "frosty_treasure_hero_name_9": "Wraith King (inclui Arcano)",
  "frosty_treasure_treasure_name_9": "King Kringle (Pai Espectral)",
  "frosty_treasure_hero_name_10": "Estafeta",
  "frosty_treasure_treasure_name_10": "Gingerbread Baby Roshan",
  "winter2023_gameplay_section_title": "Atualizações de jogabilidade",
  "winter2023_patchnotes_new_items_title": "Itens novos e atualizados",
  "winter2023_patchnotes_new_items_introduction": "Parece que sobrou um presente no saco do Pai Espectral e, como é de direito, ele pode reivindicá‑lo ao lutar com uma criança até à morte. Ele dá um golpe com a espada e... Sim, por combate, o presente é dele! É uma seleção de itens do Dota: alguns são completamente novos e outros são clássicos atualizados.",
  "winter2023_patchnotes_section_title": "Notas da atualização 7.35"
}