// 8173.js

{
  "language": "hungarian",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "Díszítsd fagyos termeidet ünnepi díszítőkkel, a 7.35-ös játékmenet-frissítéssel, három Dota Plusz prémium szettel és rengeteg kényelmi funkcióval a klienshez",
  "winter2023_subtitle_short": "Ünnepi díszítők, játékfrissítés és rengeteg kliensfunkció",
  "winter2023_section_introduction": "A Frostivus korábban <i>jelentett</i> valamit. Nem a barátaidról, a családodról vagy az érzéseidről szólt. Hanem arról, hogy <i>kaptál valamit</i>. Aztán ez az anyagiasság valahol elillant az ünnepből, és hirtelen mindenki szíve valami hülye ajándékozási szellemiséggel telt meg. Így idén újra felfedeztük a Frostivus IGAZI jelentését: a díszítőket.",
  "winter2023_frostivus_section_title": "Frostivus kincsesládák",
  "winter2023_frostivus_section_date": "2023. december 14. – 2024. január 11.",
  "winter2023_frostivus_section_introduction": "Nyerj meccseket Frostivus-hangulatmérőd feltöltésére, és kapsz egy bezárt Frostivus Kincsesládát ÉS egy véletlenszerű Zoknitölteléket a festésektől a hangulatjeleken át a matricákig.",
  "winter2023_frostivus_earn_chests": "Szerezz ládákat",
  "winter2023_frostivus_how_to_earn_chests": "Valahányszor feltöltöd a Frostivus-hangulatmérődet, eltölt majd a Frostivus hangulata, egy bezárt Frostivus 2023 Kincsesláda formájában.",
  "winter2023_frostivus_buy_keys": "Vegyél kulcsokat",
  "winter2023_frostivus_how_to_buy_keys": "Vegyél kulcsokat a ládák kinyitásához, és fedezd fel, miféle kincs rejtőzik bennük.",
  "winter2023_naughty_or_nice_section_title": "Idén...",
  "winter2023_naughty_or_nice_naughty": "...rossz voltál?",
  "winter2023_naughty_or_nice_naughty_desc": "Nincs értelme tagadni. Rémapó tudja. Kétszer is ellenőrizte a viselkedési pontszámodat, és hozza a tiltókalapácsát, hogy porrá zúzza a sok rosszcsont smurf fiókját, mielőtt kiosztaná a büntetést a hozzájuk tartozó fő fiókoknak.",
  "winter2023_naughty_or_nice_nice": "...vagy jó?",
  "winter2023_naughty_or_nice_nice_desc": "Szabályszegés nélkül játszottál idén a Dotában? Nagyszerű! Rémapó neked <i>másfajta</i> kalapácsot tartogat! Ne ess tévedésbe, <i>attól még meg fog ütni vele</i>. De miután magadhoz tértél a kórházban, azon tűnődsz majd: álom volt talán? És mi az ott melletted a párnán? Egy <i>ingyen frostivusi ajándék</i>! Mit érdemeltél ki a viselkedési pontszámoddal? Bontsd ki az ajándékodat, és meglátod...",
  "winter2023_naughty_or_nice_nice_desc2": "Nagyon vidám viselkedési pontszámod van? Nagyszerű! Rémapó neked <i>másfajta</i> kalapácsot tartogat! Ne ess tévedésbe, attól még meg fog ütni vele. De miután magadhoz tértél a kórházban, azon tűnődsz majd: álmodtam az egészet? És mi ez itt mellettem a párnán? Egy <i>ingyen Frostivus Kulcs</i>!",
  "winter2023_frostivus_section_event_title": "Frostivus 2023 Kincsek",
  "winter2023_frostivus_section_event_introduction": "Vadonatúj tárgyszettek kedvenc hőseidnek, valamint néhány ünnepi kedvenc visszatérése; sőt, még a Wraith King Titokzatos és a Crystal Maiden hősavatár is látogatást tesz!",
  "winter2023_bonus_item_title": "Az (igen ritka) ajándékozás időszaka",
  "winter2023_bonus_item_desc": "Ez frostivusi csoda! Valahányszor kicsomagolsz egy szettet, esélyed lesz az <i>abban</i> a szettben levő valamelyik tárgyból pluszban egy Rendkívüli változatot <i>is</i> kapni! És mint a csodák legtöbbjénél, az esélye annak, hogy tényleg kézhez kapsz egyet, nagyjából ugyanannyi, mint hogy eltaláljon egy meteor, így ne kezdj el máris helyet csinálni a Fegyvertáradban.",
  "winter2023_bonus_item_fullset": "Teljes szett",
  "winter2023_bonus_item_unusual": "Rendkívüli változat",
  "winter2023_stocking_stuffer_title": "Zoknitöltelékek",
  "winter2023_stocking_stuffer_desc": "Ha az előző bekezdés nyers, tényszerű valósága a plusz ajándék szerzésének esélyéről a normál mellett lehangolt, fel a fejjel! A Frostivusi Jutalomőrjárat <i>garantáltan</i> meg fog állni nálad, valahányszor feltöltöd a Frostivus-hangulatmérődet, az alábbi nagyszerű ajándékok egyikével.",
  "winter2023_stocking_stuffer_sprays_stickers": "Festések és matricák",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Ezek az új festések csak a Frostivus idejére maradnak velünk, de te kérted, mi pedig meghallgattunk: a matrica változatai véglegesek. Ragasztgasd tele velük a profilodat.",
  "winter2023_stocking_stuffer_emoticons": "Hangulatjelek",
  "winter2023_stocking_stuffer_emoticons_desc": "Mielőtt Marie Curie feltalálta a hangulatjeleket, senki sem volt képes érzelmeket kifejezni. A Dota tiszteleg az önfeláldozása előtt, tekintve, hogy az elsők erősen radioaktívak voltak.",
  "winter2023_stocking_stuffer_ward": "Deres, az északi ward",
  "winter2023_stocking_stuffer_ward_desc": "Titkos ráadás történet: Ez a méreten aluli hóember valójában erősebb, mint a két Ős együtt. De sosem fogsz erre rájönni. Miért? Mert <i>szerény</i>.",
  "winter2023_stocking_stuffer_courier": "Fóka futár",
  "winter2023_stocking_stuffer_courier_desc": "Nézd már, milyen aranyos! És ami még jobb, hogy ehető. Rengeteg hús és zsír van rajta, ha egyszer sütögethetnéked támadna.",
  "winter2023_frostivus_festive_items_title": "Ünnepi tárgyak",
  "winter2023_frostivus_party_hats": "Frostivusi sapkák",
  "winter2023_frostivus_party_hats_description": "Mindenkinek van frostivusi sapkánk! Nincs fejed? Semmi gond! Túl sok fejed van? Olyan nincs! A Frostivusi Jutalomőrjárat megrakta a sapkás teherautót, és ráborítja a platót mindenre, ami akár csak kicsit is emlékeztet egy fejre.",
  "winter2023_frostivus_free_event_items": "Ingyen holmi",
  "winter2023_frostivus_free_event_items_description": "A régmúlt Frostivusokon az elhasználható tárgyaknak korlátozott töltetszáma volt. Idén annyit használhatsz, amennyit csak akarsz! Ajándék. Hát, igazából inkább kölcsön. A Frostivusi Jutalomőrjárat az esemény végén vissza fog jönni, hogy begyűjtse őket.",
  "winter2023_frostivus_high_fives": "Pacsizás",
  "winter2023_frostivus_high_fives_description": "Ellentétben azokkal a pacsikkal, amiket a barátaidnak és családtagjaidnak adsz, a Frostivusi Pacsi inkább olyan, mint egy forró csokis ünnepi köszöntő. És ha őszinték akarunk lenni, a barátaid és a családod szerint egyébként is tarthatnál már egy kis szünetet a folytonos pacsizásban.",
  "winter2023_frostivus_section_treasure_title": "Frostivus 2023 Kincsek",
  "winter2023_clientupdate_section_title": "Kliensfrissítés",
  "winter2023_clientupdate_introduction": "Nos, a jó Rémapó egy újabb évre kiosztotta az ajándékait. Boldog Frostivust mindenkinek, vezessetek óvatosan... Várjunk csak! Van <i>még valami</i> ennek a zsáknak az alján!",
  "winter2023_qol_section_title": "Kényelmi funkciók",
  "winter2023_qol_introduction": "Jobb információk a jobb döntéshozáshoz",
  "winter2023_qol_tower_range_indicator_title": "Toronyhatótáv-jelző",
  "winter2023_qol_tower_range_indicator_desc": "Unod, hogy nem tudod, mikor céloz az a torony valami fontosat (mondjuk téged)? A fejlesztett hatások nyilvánvalóbbá teszik, mikor biztonságos nekiesni, és mikor kell menekülni.",
  "winter2023_qol_teleport_time_title": "Teleportálási idő",
  "winter2023_qol_teleport_time_desc": "Kevéssé ismert tény, hogy a Dotában a teleportálási idők eltérőek, és mindeddig láthatatlanok voltak. Mostantól megnézheted a járatidőt, mielőtt használnád a TP tekercsedet.",
  "winter2023_qol_minimap_title": "Minitérkép-ikonok",
  "winter2023_qol_minimap_desc": "Nyilak, hősikonok; mindkettő nagyszerű. <i>„Miért kell választanom?”</i> kiabálsz az égre. Nos, most már nem kell. Mert – kis Dota-háttértörténet – az ég egy kívánságteljesítő dzsinn.",
  "winter2023_qol_ability_shape_indicator_title": "Több képességcélzó",
  "winter2023_qol_ability_shape_indicador_desc": "<i>„Miért hiányzanak egyes képességcélzóim?”</i> kiabálsz az égre. Puff! Tessék, még több képesség pontos hatóterület-jelölővel.",
  "winter2023_qol_ability_icons_title": "Képességikon-állapotok",
  "winter2023_qol_ability_icons_desc": "Akár a Silver Edge szakította meg a passzívjaidat, akár le vagy gyökereztetve, így nem tudsz elblinkelni, mostantól az új képességikon-állapotainkkal egy pillantással meg tudod állapítani, le van-e tiltva egy képesség.",
  "winter2023_qol_item_tooltips_title": "Jobb elemleírások a tárgyakhoz",
  "winter2023_qol_item_tooltips_desc": "A tárgyak célzási információinak megszerzése általában hosszú utat jelentett a könyvtárhoz, majd hosszú vitát egy zavartnak látszó könyvtárossal. Mostantól a célzástípus, a sebzéstípus, a megszüntethetőség és egyebek mind szerepelnek az elemleírásban.",
  "winter2023_qol_xp_range_title": "TP tartományjelző",
  "winter2023_qol_xp_range_desc": "A TP mindenütt körülvesz, el lehet szipkázni, ha tudod, hol kell keresni. Mostantól te is tudhatod, egyszerűen a hősöd szintjére mutatva. Alt-ra semmi szükség!",
  "winter2023_qol_wisdom_rune_timer_title": "Dota Plusz Bölcsesség rúna időmérő",
  "winter2023_qol_wisdom_rune_timer_desc": "A bölcsességnek szentelt rúna létére a Bölcsesség rúna régebben elég ostoba volt a születési időzítőjének mutatása tekintetében. Úgy tűnik, megokosodott, és végre vett egy órát.",
  "winter2023_qol_creep_bounties_title": "Creepjutalmak",
  "winter2023_qol_creep_bounties_desc": "<i>„Miért nem látom, mennyi jutalmat ér minden creep, akár a vonalon, akár a táborokban?”</i> kiabálsz az égre. „Komolyan?” kérdez vissza az égdzsinn, „Én több kívánságot kértem volna. Mindegy, tessék. Viszlát következő Frostivuskor.”",
  "winter2023_qol_misc_title": "... és egyéb HUD fejlesztések",
  "winter2023_qol_misc_desc": "A Dotában rengeteg a befogadni való információ, és számos HUD-fejlesztést végeztünk, hogy segítsünk. A jobb gombbal egy tárgyra kattintás a felszerelésedben kiemeli azt, elsötétítve a többi tárgyat. Sosem dobsz vagy adsz el többé helytelen tárgyat. A népszerű tárgyakon mostantól csak akkor van szürke keret, amikor van elég aranyad megvenni azokat. Nincs több zavaró kereteltérés. Plusz, a tárgyak életerő- és manaköltsége el van rejtve, amikor a hátizsákodban vannak. Végezetül, a Hőskipróbálás mód mostantól a tornyoktól távol tesz le, hogy sok helyed legyen mindent kipróbálni, amit akarsz.",
  "winter2023_profileshowcase_section_title": "Profilvitrin",
  "winter2023_profileshowcase_introduction": "Minden korábbinál több mód önmagad kifejezésére",
  "winter2023_profileshowcase_animations_title": "Animációk",
  "winter2023_profileshowcase_animations_desc": "Unod, hogy a hőseid csak állnak ott? Mostantól animációsorozatot választhatsz a mozgásba hozásukra.",
  "winter2023_profileshowcase_anchoring_title": "Hősökhöz rögzítés",
  "winter2023_profileshowcase_anchoring_desc": "Mostantól a hősmodellekre rögzíthetsz más profilelemeket, és figyelheted, ahogy azok együtt mozognak az animációval.",
  "winter2023_profileshowcase_freezeframes_title": "Pillanatképek",
  "winter2023_profileshowcase_freezeframes_desc": "Bármelyik képkockánál megállíthatsz egy animációt, hogy elcsípj egy tökéletesen kínos pillanatot.",
  "winter2023_profileshowcase_gridsnapping_title": "Rácshoz igazítás",
  "winter2023_profileshowcase_gridsnapping_desc": "A vacak emberszemeiddel, meg az „ösztöneiddel” igazítgatod a dolgokat? Miért nem hagyod, hogy a Rács-igazít-o-mata™ tökéletesen megoldja neked?",
  "winter2023_profileshowcase_improved_portraits_title": "Javított portrék",
  "winter2023_profileshowcase_improved_portraits_desc": "Válassz kedvenc hőseid 3D modell vagy 2D portré változata közül. Mutasd be hősszint-kitűződet, és akár még a relikviáidat is.",
  "winter2023_profileshowcase_more_items_title": "További modellek",
  "winter2023_profileshowcase_more_items_desc": "Idézettek, wardok, gúnyolódások, kisállatok, tárgykiemelések... akármi; bele tudod gyömöszölni a profilodba.",
  "winter2023_armory_section_title": "Fegyvertár",
  "winter2023_armory_introduction": "További felszerelésfejlesztések",
  "winter2023_armory_grouping_title": "Javított csoportosítás",
  "winter2023_armory_grouping_desc": "Mostantól minden tárgy csoportosítható hősnév szerint. ",
  "winter2023_armory_filters_tags_title": "Visszatértek a szűrők és a címkék",
  "winter2023_armory_filters_tags_desc": "Szűrj kulcsszókereséssel, és készíts nézeteket előre meghatározott keresési feltételekkel.",
  "winter2023_armory_stickers_title": "Matricakeresés",
  "winter2023_armory_stickers_desc": "Láthatod a matricákat, amelyek nincsenek meg, és akár még a régebben megjelenteket is böngészheted.",
  "winter2023_dotaplus_section_title": "Dota Plusz",
  "winter2023_dotaplus_introduction": "Új prémium szettek, küldetések és céhjutalmak",
  "winter2023_dotaplus_premium_sets_title": "Új prémium szettek",
  "winter2023_dotaplus_premium_sets_desc": "A Dota Plusz e szezonja három új prémium szettet leplez le, amelyek darabonként 150 000 szilánkért megvásárolhatók a Szilánkboltban.",
  "winter2023_dotaplus_seasonal_quests_title": "Szezonális küldetésfrissítés",
  "winter2023_dotaplus_seasonal_quests_desc": "További módok szilánkkészleted növelésére.",
  "winter2023_dotaplus_guild_rewards_title": "Frissített céhjutalmak",
  "winter2023_dotaplus_guild_rewards_desc": "Mint mindig, új hangulatjelek, festések és csevegőkorongok érhetők el a magas pontszámú céheknek.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Lidérces Éj",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Ezüst Fuvallat",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo és Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Orbuculum Equinox",
  "frosty_treasure_hero_name_5": "Pudge (hősavatár-feloldással együtt)",
  "frosty_treasure_treasure_name_5": "Deres, a Varrott",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Csilingelő Ököl",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "A Förtelmes Hóbestia",
  "frosty_treasure_hero_name_8": "Crystal Maiden (hősavatár-feloldással együtt)",
  "frosty_treasure_treasure_name_8": "Őr-hóangyal",
  "frosty_treasure_hero_name_9": "Wraith King (hősavatár-feloldással együtt)",
  "frosty_treasure_treasure_name_9": "Rémapó",
  "frosty_treasure_hero_name_10": "Futár",
  "frosty_treasure_treasure_name_10": "Mézeskalács Kicsi Roshan",
  "winter2023_gameplay_section_title": "Játékmenet-frissítések",
  "winter2023_patchnotes_new_items_title": "Új és frissített játékbeli tárgyak",
  "winter2023_patchnotes_new_items_introduction": "Úgy tűnik, maradt még egy ajándék Rémapó zsákjában, és ahogyan az jogában áll, megszerezheti magának egy gyerekkel vívott élet-halál harcban. Meglendíti hosszúkardját, és... Igen, harc útján megszerezte az ajándékot! Zsákmánya rengeteg átdolgozott Dota tárgy: néhány vadonatúj, néhány régi kedvenc mellett.",
  "winter2023_patchnotes_section_title": "7.35-ös frissítésjegyzék",
  "winter2023_recipe": "Recept:"
}