// 8524.js

{
  "language": "french",
  "winter2023_title": "Frostivus 2023",
  "winter2023_subtitle": "L'hiver approche ! Restez au chaud et venez découvrir des items cosmétiques festifs, la mise à jour du gameplay 7.35, trois ensembles exclusifs Dota Plus et une pléthore d'améliorations de confort",
  "winter2023_subtitle_short": "Cosmétiques festifs, mise à jour du gameplay et une pléthore d'améliorations de confort",
  "winter2023_section_introduction": "De mon temps, Frostivus c'était <i>vraiment</i> quelque chose. Ce n'était pas juste un prétexte pour se retrouver en famille et partager des moments de bonheur, non. C'était pour se voir offrir un <i>max de cadeaux</i>. Et, comme les bonnes choses ont une fin, le matérialisme a fini par laisser place à la compassion, au partage et à la générosité. Quelle honte… Cette année, nous avons décidé de revenir aux VRAIES valeurs de Frostivus : les cosmétiques.",
  "winter2023_frostivus_section_title": "Coffre au trésor de Frostivus",
  "winter2023_frostivus_section_date": "Du 14 décembre 2023 au 11 janvier 2024",
  "winter2023_frostivus_section_introduction": "Remportez des parties pour faire grimper votre compteur de magie de Frostivus et obtenir un trésor verrouillé de Frostivus ET un petit cadeau aléatoire pouvant contenir des graffitis, des émoticônes ou des autocollants.",
  "winter2023_frostivus_earn_chests": "Gagnez des coffres",
  "winter2023_frostivus_how_to_earn_chests": "Chaque fois que vous remplirez votre compteur de magie Frostivus, l'esprit de Frostivus se manifestera à vous sous la forme d'un coffre au trésor de Frostivus 2023 verrouillé.",
  "winter2023_frostivus_buy_keys": "Achetez des clés",
  "winter2023_frostivus_how_to_buy_keys": "Achetez des clés pour déverrouiller les coffres et découvrir la signification des trésors qu'ils renferment.",
  "winter2023_naughty_or_nice_section_title": "Avez-vous été plutôt…",
  "winter2023_naughty_or_nice_naughty": "Pas sage ?",
  "winter2023_naughty_or_nice_naughty_desc": "Pas la peine de mentir. Le Roi Fouettard voit tout. Il a vérifié votre note de conduite deux fois, et il s'apprête à user de son terrible marteau pour bannir les comptes des vilains smurfs et infliger des pénalités aux comptes principaux associés.",
  "winter2023_naughty_or_nice_nice": "Ou sage ?",
  "winter2023_naughty_or_nice_nice_desc": "Vous avez fait preuve d'un comportement exemplaire dans Dota cette année ? Dans ce cas, le Roi Fouettard a un <i>autre<i> marteau spécial pour vous ! Ne vous y trompez pas, il va quand même vous taper dessus avec. Mais quand vous ouvrirez les yeux sur votre lit d'hôpital, que trouverez-vous sous l'oreiller ? Un <i>cadeau de Frostivus</i> ! Que contient-il ? À vous de le découvrir…",
  "winter2023_naughty_or_nice_nice_desc2": "Votre note de comportement vous place-t-elle au rang des enfants modèles ? Dans ce cas, le Roi Fouettard a un <i>autre</i> marteau pour vous ! Ne vous y trompez pas, il va quand même vous taper dessus avec. Mais quand vous ouvrirez les yeux sur votre lit d'hôpital, que trouverez-vous sous l'oreiller ? Une clé de Frostivus <i>gratuite !</i>",
  "winter2023_frostivus_section_event_title": "Trésors de Frostivus 2023",
  "winter2023_frostivus_section_event_introduction": "Découvrez de nouveaux ensembles d'items pour vos unités héroïques préférées et retrouvez vos ensembles préférés des années passées, sans oublier les persona de Wraith King et de Crystal Maiden !",
  "winter2023_bonus_item_title": "L'heure est à la générosité (avec modération)",
  "winter2023_bonus_item_desc": "C'est le miracle de Frostivus ! Dès que vous déballerez un ensemble, vous aurez <i>également</i> une chance de débloquer une variante inhabituelle pour l'un des items contenus dans <i>cet</i> ensemble ! Mais, miracle oblige, vos chances d'obtenir ce bonus sont à peu près égales à celles de vous faire écraser par une météorite, alors n'allez pas faire de la place dans votre armurerie juste pour ça.",
  "winter2023_bonus_item_fullset": "Ensemble complet",
  "winter2023_bonus_item_unusual": "Variante inhabituelle",
  "winter2023_stocking_stuffer_title": "Petits cadeaux",
  "winter2023_stocking_stuffer_desc": "Ne vous laissez pas abattre par la dure réalité évoquée dans ce dernier paragraphe quant à la probabilité de recevoir un cadeau en prime en plus d'un cadeau standard. La joyeuse brigade de Frostivus <i>a promis</i> de descendre par votre cheminée avec l'un des superbes cadeaux ci-dessous chaque fois que vous remplirez votre compteur de magie Frostivus.",
  "winter2023_stocking_stuffer_sprays_stickers": "Graffitis et autocollants",
  "winter2023_stocking_stuffer_sprays_stickers_desc": "Ces nouveaux graffitis ne seront disponibles que pendant Frostivus, mais cette fois-ci, les autocollants seront permanents. Plus d'excuses pour ne pas recouvrir votre profil !",
  "winter2023_stocking_stuffer_emoticons": "Émoticônes",
  "winter2023_stocking_stuffer_emoticons_desc": "Avant l'invention des émoticônes par Marie Curie, personne ne savait comment communiquer ses émotions. Dota salue ses sacrifices, d'autant plus qu'ils étaient hautement radioactifs.",
  "winter2023_stocking_stuffer_ward": "Flocon, la Ward du Nord",
  "winter2023_stocking_stuffer_ward_desc": "Le saviez-vous ? Ce minuscule bonhomme de neige est à lui seul plus puissant que les deux Ancients RÉUNIS. Mais ça, personne ne le sait, et vous savez pourquoi ? Parce qu'il est <i>modeste</i>.",
  "winter2023_stocking_stuffer_courier": "Coursier phoque",
  "winter2023_stocking_stuffer_courier_desc": "Non seulement il est trop mignon, mais en plus, il est comestible ! Si vous n'avez vraiment rien à vous mettre sous la dent, ce coursier pourrait bien faire l'affaire…",
  "winter2023_frostivus_festive_items_title": "Items festifs",
  "winter2023_frostivus_party_hats": "Chapeaux de Frostivus",
  "winter2023_frostivus_party_hats_description": "Nous avons des chapeaux de Frostivus pour tout le monde ! Pas de tête ? Pas de problème ! Trop de têtes ? Quelle chance ! La joyeuse brigade de Frostivus s'apprête à décharger sur toutes les têtes plus ou moins bien faites des milliers de chapeaux.",
  "winter2023_frostivus_free_event_items": "Cadeaux gratuits",
  "winter2023_frostivus_free_event_items_description": "Lors des éditions précédentes de Frostivus, les consommables avaient un nombre d'utilisations limité. Cette année, plus de limite, alors, lâchez-vous ! C'est un cadeau après tout… enfin, disons que c'est un prêt. La joyeuse brigade de Frostivus reviendra les récupérer à la fin de l'évènement.",
  "winter2023_frostivus_high_fives": "Tope là",
  "winter2023_frostivus_high_fives_description": "Avec les « Tope là » de Frostivus, les toasts au champagne et les discours sont révolus, l'heure est au chocolat chaud ! Et puis, entre nous, vos proches n'en peuvent plus de vos allocutions à répétition…",
  "winter2023_frostivus_section_treasure_title": "Trésors de Frostivus 2023",
  "winter2023_clientupdate_section_title": "Mises à jour du client",
  "winter2023_clientupdate_introduction": "Et voilà une nouvelle tournée de distribution de cadeaux bouclée. Joyeux Frostivus, et tenez-vous à carreau jusqu'à l'an prochain ! Un instant… il reste <i>quelque chose</i> au fond de la hotte !",
  "winter2023_qol_section_title": "Améliorations de confort",
  "winter2023_qol_introduction": "De meilleures informations pour de meilleures décisions",
  "winter2023_qol_tower_range_indicator_title": "Indicateur de portée des tours",
  "winter2023_qol_tower_range_indicator_desc": "Marre de ne pas savoir quand la tour prend pour cible une unité importante (par exemple, vous) ? Grâce aux effets améliorés, il est désormais plus facile de décider si l'heure est à l'attaque ou à la fuite.",
  "winter2023_qol_teleport_time_title": "Durée de téléportation",
  "winter2023_qol_teleport_time_desc": "Peu de gens le savent, mais la durée de téléportation dans Dota peut varier. Jusqu'à présent, celle ci était invisible. Maintenant, vous disposez d'un aperçu du temps de trajet avant d'utiliser votre Town Portal Scroll.",
  "winter2023_qol_minimap_title": "Icônes de minicarte",
  "winter2023_qol_minimap_desc": "<i>« Flèches ou icône héroïques, pourquoi devrais-je choisir ? »</i>. Le génie de la minicarte (car oui, il existe bel et bien) a entendu vos prières et a exaucé votre vœu le plus cher.",
  "winter2023_qol_ability_shape_indicator_title": "De nouveaux réticules de capacités",
  "winter2023_qol_ability_shape_indicador_desc": "<i>« Ô grand génie, faites que toutes mes capacités soient dotées d'un réticule. »</i> Pouf ! Comme par magie, de nouveaux réticules ont été ajoutés et l'affichage du rayon des capacités concernées a gagné en précision.",
  "winter2023_qol_ability_icons_title": "Icônes d'état de capacités",
  "winter2023_qol_ability_icons_desc": "Votre capacité passive a été interrompue par Silver Edge ? Vous êtes sous le coup d'un enracinement et incapable de vous téléporter ? Grâce aux nouvelles icônes d'état de capacité, vous saurez en un coup d'œil si l'une de vos capacités est désactivée.",
  "winter2023_qol_item_tooltips_title": "Infobulles améliorées",
  "winter2023_qol_item_tooltips_desc": "Avant, pour se renseigner sur les cibles de tel ou tel objet, il fallait faire un long détour vers la bibliothèque, et s'ensuivait un débat sans fin avec une bibliothécaire qui n'en savait pas bien plus que vous. Maintenant, il vous suffit de consulter la description de l'objet pour connaitre son type de ciblage, son type de dégâts et si ses effets peuvent être dissipés ou non.",
  "winter2023_qol_xp_range_title": "Indicateur de plage d'XP",
  "winter2023_qol_xp_range_desc": "L'expérience, il y en a partout autour de nous ! Il faut juste savoir où la trouver. C'est maintenant plus simple que jamais : il vous suffit de survoler le niveau de votre unité héroïque. Vous pouvez jeter votre touche ALT à la poubelle !",
  "winter2023_qol_wisdom_rune_timer_title": "Chronomètre Dota+ pour les runes de Wisdom",
  "winter2023_qol_wisdom_rune_timer_desc": "Les lutins de Frostivus n'ont pas oublié les runes : la rune de Wisdom a eu un joli cadeau et se dote maintenant de son propre chronomètre. Bien pratique pour savoir exactement quand la récupérer !",
  "winter2023_qol_creep_bounties_title": "Prime pour les creeps",
  "winter2023_qol_creep_bounties_desc": "<i>« Je donnerais tout pour voir la prime que vaut chaque creep, dans les lanes et dans les camps. »</i> « Vraiment, c'est ça ton dernier vœu ? Soit, accordé. Rendez-vous au prochain Frostivus. »",
  "winter2023_qol_misc_title": "… et d'autres améliorations de l'interface",
  "winter2023_qol_misc_desc": "Tout le monde le sait, Dota regorge d'informations à assimiler. Nous avons donc apporté plusieurs améliorations à l'interface pour rendre les choses plus claires. Un clic droit sur un objet de votre inventaire met maintenant en valeur votre sélection en réduisant l'opacité des autres objets, vous ne vous mordrez plus les doigts d'avoir lâché ou vendu un objet par erreur ! En outre, les objets populaires sont maintenant ornés d'une bordure grise quand vous avez assez d'or pour les acheter. Oh ! et puis, les couts en PV et en mana des objets sont maintenant masqués quand ils se trouvent dans votre sac à dos. Et enfin (promis, c'est bientôt fini)… quand vous accédez au mode démo, vous êtes maintenant loin des tours : encore plus d'espace pour vos moindres fantaisies !",
  "winter2023_profileshowcase_section_title": "Vitrine du profil",
  "winter2023_profileshowcase_introduction": "Encore plus de façons de s'exprimer",
  "winter2023_profileshowcase_animations_title": "Animations",
  "winter2023_profileshowcase_animations_desc": "Vous en avez assez de voir vos unités héroïques qui restent plantées là ? Vous pouvez maintenant choisir une séquence d'animation pour les faire bouger.",
  "winter2023_profileshowcase_anchoring_title": "Ancrage sur les unités héroïques",
  "winter2023_profileshowcase_anchoring_desc": "Vous pouvez désormais attacher d'autres éléments de profil sur les modèles des unités héroïques qui se déplaceront avec l'animation.",
  "winter2023_profileshowcase_freezeframes_title": "Images spécifiques",
  "winter2023_profileshowcase_freezeframes_desc": "Interrompez l'animation à tout moment et capturez l'instant le plus gênant.",
  "winter2023_profileshowcase_gridsnapping_title": "Alignement automatique",
  "winter2023_profileshowcase_gridsnapping_desc": "Vous en êtes encore à aligner les éléments de votre vitrine de profil avec vos pauvres yeux d'humain ? Laissez le nouvel AlignoBot_3000™ vous faciliter le travail.",
  "winter2023_profileshowcase_improved_portraits_title": "Portraits améliorés",
  "winter2023_profileshowcase_improved_portraits_desc": "Choisissez entre un portrait en 3D ou en 2D de vos unités héroïques préférées. Arborez votre badge de niveau et vos reliques.",
  "winter2023_profileshowcase_more_items_title": "Plus de modèles",
  "winter2023_profileshowcase_more_items_desc": "Invocations, Wards, railleries, mascottes, objets… Tout ça et plus encore peut désormais être ajouté à votre profil.",
  "winter2023_armory_section_title": "Armurerie",
  "winter2023_armory_introduction": "Plus d'améliorations pour votre inventaire",
  "winter2023_armory_grouping_title": "Regroupement amélioré",
  "winter2023_armory_grouping_desc": "Tous les items peuvent désormais être regroupés par nom d'unités héroïques. ",
  "winter2023_armory_filters_tags_title": "Les filtres et les tags sont de retour",
  "winter2023_armory_filters_tags_desc": "Définissez des mots clés pour filtrer vos résultats et créez des vues avec des critères de recherche prédéfinis.",
  "winter2023_armory_stickers_title": "Recherche d'autocollants",
  "winter2023_armory_stickers_desc": "Découvrez les autocollants que vous ne possédez pas et parcourez ceux déjà disponibles.",
  "winter2023_dotaplus_section_title": "Dota Plus",
  "winter2023_dotaplus_introduction": "Nouveaux ensembles exclusifs, nouvelles quêtes et nouvelles récompenses de guilde",
  "winter2023_dotaplus_premium_sets_title": "Nouveaux ensembles exclusifs",
  "winter2023_dotaplus_premium_sets_desc": "À l'occasion de cette nouvelle saison de Dota Plus, trois nouveaux ensembles exclusifs font leur arrivée dans la boutique des fragments pour 150 000 fragments chacun.",
  "winter2023_dotaplus_seasonal_quests_title": "Nouvelles quêtes saisonnières",
  "winter2023_dotaplus_seasonal_quests_desc": "Encore plus de façons de faire le plein de fragments.",
  "winter2023_dotaplus_guild_rewards_title": "Nouvelles récompenses de guilde",
  "winter2023_dotaplus_guild_rewards_desc": "Comme toujours, de nouvelles émoticônes, de nouveaux graffitis et de nouvelles roues des dialogues sont disponibles pour les guildes les mieux classées.",
  "frosty_treasure_hero_name_1": "Ancient Apparition",
  "frosty_treasure_treasure_name_1": "Nuit lugubre",
  "frosty_treasure_hero_name_2": "Snapfire",
  "frosty_treasure_treasure_name_2": "Bourrasque d'argent",
  "frosty_treasure_hero_name_3": "Alchemist",
  "frosty_treasure_treasure_name_3": "Lumpo et Rupertus",
  "frosty_treasure_hero_name_4": "Arc Warden",
  "frosty_treasure_treasure_name_4": "Équinoxe de cristal",
  "frosty_treasure_hero_name_5": "Pudge (comprend le persona débloqué)",
  "frosty_treasure_treasure_name_5": "Bonhomme de neige raccommodé",
  "frosty_treasure_hero_name_6": "Tusk",
  "frosty_treasure_treasure_name_6": "Grelots punitifs",
  "frosty_treasure_hero_name_7": "Primal Beast",
  "frosty_treasure_treasure_name_7": "Abominable bête des neiges",
  "frosty_treasure_hero_name_8": "Crystal Maiden (comprend le persona débloqué)",
  "frosty_treasure_treasure_name_8": "Ange gardien polaire",
  "frosty_treasure_hero_name_9": "Wraith King (comprend l'Arcane débloquée)",
  "frosty_treasure_treasure_name_9": "Roi Fouettard",
  "frosty_treasure_hero_name_10": "Coursier",
  "frosty_treasure_treasure_name_10": "Bébé Roshan en pain d'épice",
  "winter2023_gameplay_section_title": "Mises à jour du gameplay",
  "winter2023_patchnotes_new_items_title": "Nouveaux objets et mises à jour",
  "winter2023_patchnotes_new_items_introduction": "Le Roi Fouettard n'a plus qu'un cadeau dans sa hotte. Comme le veut la tradition, le cadeau lui revient de droit s'il parvient à triompher d'un duel à mort contre un enfant. Le voilà qui brandit son épée longue et… il garde le cadeau. Il s'agit d'un assortiment d'objets Dota retravaillés contenant des nouveautés ainsi que des anciens objets remis au gout du jour.",
  "winter2023_patchnotes_section_title": "Notes de la mise à jour 7.35"
}