{
  "gid": "4176605502420155695",
  "clan_steamid": "103582791433224455",
  "event_name": "Gameplay-Update 7.36b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1717639680,
  "rtime32_end_time": 1717644601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198045397204",
        "rtUpdated": 1717640316
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1717639686
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1717722398
      }
    ],
    "clone_from_event_gid": "4150708808481245250",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4176605502420155696",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Gameplay-Update 7.36b",
    "posttime": 1717639688,
    "updatetime": 1717722398,
    "body": [
      "Das Gameplay-Update 7.36b ist jetzt verfügbar. Die Patchnotizen dazu finden Sie [url=https://www.dota2.com/patches/7.36b]hier[/url].",
      "Darüber hinaus wurden in den vergangenen Tagen einige weitere Probleme behoben:",
      "[list]",
      "[*] Verschiedene Probleme mit Hotkeys behoben.",
      "[*] Die Rune des Schutzes hat ein entsprechendes Symbol in der Statusleiste erhalten.",
      "[*] Roshans Angriffe zerstören die mit Shadow Shamans Fähigkeit „Mass Serpent Wards“ erschaffenen Schlangenwächter sowie den mit der Facette „Riesiger Schlangenwächter“ erschaffenen Schlangenwächter nicht mehr sofort. Stattdessen zählen Roshans Angriffe jetzt als Heldenangriffe.",
      "[*] Fehler behoben, durch den Arc Wardens Sturmillusion mehr Schaden als vorgesehen erlitt.",
      "[*] Fehler behoben, durch den Kuriere unter gewissen Umständen von Beastmasters Level-20-Talent „Aura mit +250 max. LP für Beastmaster und seine Einheiten“ profitierten.",
      "[*] Fehler behoben, durch den Broodmothers Fähigkeit „Spin Web“ eine geringere Zauberreichweite als vorgesehen hatte, wenn ein Netz ein anderes berührte.",
      "[*] Fehler behoben, durch den Death Prophets Fähigkeit „Silence“ einige unbeabsichtigte Interaktionen auslöste.",
      "[*] Fehler behoben, durch den Dragon Knights Fähigkeit „Wyrm’s Wrath“ mit der Facette „Frostdrachen“ einen Effekt auf Gebäude hatte.",
      "[*] Fehler behoben, durch den Drow Rangers Fähigkeit „Multishot“ durch die Fähigkeit „Glacier“ abgebrochen wurde.",
      "[*] Fehler behoben, durch den Faceless Voids Fähigkeit „Time Zone“ Assists nicht korrekt zuschrieb.",
      "[*] Fehler behoben, durch den Huskars Fähigkeit „Life Break“ in Verbindung mit Muertas Fähigkeit „Parting Shot“ gelegentlich dafür sorgte, dass keine Befehle mehr gegeben werden konnten.",
      "[*] Fehler behoben, durch den der Effekt von Invokers Facette „Elitär“ passiv Zauberverstärkung gewährte, ohne zuerst den Schwächungseffekt anzuwenden.",
      "[*] Fehler behoben, durch den der Effekt von Invokers Begabung „Meisterdenker“ keine Erfahrungspunkte gewährte.",
      "[*] Fehler behoben, durch den Leshracs Fähigkeit „Nihilism“ nicht von dem Effekt seiner Begabung „Entweihung“ und anderen Wirkungsbereichsboni profitierte.",
      "[*] Fehler behoben, durch den Linas Fähigkeit „Flame Cloak“ nicht die Dauer der Fähigkeit „Fiery Soul“ zurücksetzte, wenn die Fähigkeit bei max. Fiery-Soul-Instanzen gewirkt wurde.",
      "[*] Fehler behoben, durch den Linas Fähigkeit „Laguna Blade“ mit dem Level-25-Talent „Laguna Blade ignoriert Barrieren und fügt 125 % Schaden zu“ keine Barriere durch den Brandschaden gewährte.",
      "[*] Fehler behoben, durch den die mit Lycans Facette „Geisterwölfe“ beschworenen Wölfe gelegentlich kontrolliert werden konnten.",
      "[*] Fehler behoben, durch den die Attributleiste für die Fähigkeit „Attribute Shift“ falsch ausgerichtet war.",
      "[*] Fehler behoben, durch den Muertas Fähigkeit „Ofrenda“ gestohlen werden konnte.",
      "[*] Fehler behoben, durch den Shadow Demon mit der Facette „Schattendiener“ Illusionen mit endloser Lebensdauer erschaffen konnte, wenn der Effekt von Chaos Knights Begabung „Zügel des Chaos“ durch Shadow Demons Fähigkeit „Disruption“ ausgelöst wurde.",
      "[*] Fehler behoben, durch den der Effekt der Facette „Spleens Geheimrezept“ der Techies nicht die korrekte Schadensmenge zufügte.",
      "[*] Fehler behoben, durch den Undyings Begabung „Endloses Totenlied“ gelegentlich dafür sorgte, dass keine Befehle mehr erteilt werden konnten.",
      "[*] Fehler behoben, durch den der Effekt von Venomancers Facette „Patient Null“ mehr Schaden als vorgesehen zufügte.",
      "[*] Fehler behoben, durch den der von Warlocks Facette „Schwarzes Grimoire“ gewährte neutrale Gegenstand erhalten blieb, wenn Spieler ihre Helden zu Beginn der Partie tauschten.",
      "[*] Fehler behoben, durch den der von Witch Doctors Begabung „Gris-Gris“ gewährte neutrale Gegenstand erhalten blieb, wenn Spieler ihre Helden zu Beginn der Partie tauschten.",
      "[/list]"
    ],
    "commentcount": 194,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1717639903_0",
      "ModAct_1519738978_1717645460_4",
      "mod_require_rereview"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4338735089004412188",
    "event_gid": "4176605502420155695",
    "voteupcount": 1170,
    "votedowncount": 274,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4338735089004412188",
  "rtime32_last_modified": 1717722399,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1717645462,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14620260,
  "build_branch": "",
  "votes_up": 1170,
  "votes_down": 274,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4338735089004412188",
  "clan_steamid_original": "103582791433224455"
}