{
  "gid": "4176605502420155695",
  "clan_steamid": "103582791433224455",
  "event_name": "Ігроладне оновлення 7.36b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1717639680,
  "rtime32_end_time": 1717644601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198045397204",
        "rtUpdated": 1717640316
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1717639686
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1717722398
      }
    ],
    "clone_from_event_gid": "4150708808481245250",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4176605502420155696",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ігроладне оновлення 7.36b",
    "posttime": 1717639688,
    "updatetime": 1717722398,
    "body": [
      "Оновлення 7.36b вже вийшло. Про всі зміни можна дізнатися [url=https://www.dota2.com/patches/7.36b]ось тут[/url].",
      "Окрім того, за останні дні було виправлено кілька помилок:",
      "[list]",
      "[*] Виправлено різні помилки, пов’язані з гарячими клавішами.",
      "[*] Виправлено відсутню піктограму ефекту руни захисту.",
      "[*] Атаки Рошана більше не вбивають Ватагу змієвардів (Mass Serpent Wards) і Великого змієварда (Massive Serpent Ward) Шамана Тіней миттєво. Натомість атаки Рошана рахуються як атаки героїв.",
      "[*] Виправлено помилку, внаслідок якої Буремний двійник (Tempest Double) Вартового зазнавав більше шкоди, ніж треба.",
      "[*] Виправлено помилку, внаслідок якої талант 20-го рівня «+250 до аури макс. здоров’я Звіромайстра та його істот» Звіромайстра в деяких ситуаціях застосовувався до кур’єрів.",
      "[*] Виправлено помилку, внаслідок якої Павутиння (Spin Web) Павучихи мало меншу дальність чаклування, ніж треба, якщо нова павутина торкалася сплетеної раніше.",
      "[*] Виправлено помилку, внаслідок якої Тиша (Silence) Провісниці Смерті мала деякі непередбачені взаємодії.",
      "[*] Виправлено помилку, внаслідок якої ефекти Гніву дракона (Wyrm's Wrath) грані Морозний дракон Лицаря-Дракона непередбачено застосовувалися на будівлі.",
      "[*] Виправлено помилку, внаслідок якої Мультипостріл (Multishot) Дроу-Рейнджер скасовувався застосуванням Льодовика (Glacier).",
      "[*] Виправлено помилку, внаслідок якої Часовий пояс (Time Zone) Безликого неправильно зараховував підмоги.",
      "[*] Виправлено помилку, внаслідок якої застосування Переривання життя (Life Break) Хускара в поєднанні з Розлучним пострілом (Parting Shot) Муерти інколи блокувало гравцям можливість віддавати накази.",
      "[*] Виправлено помилку, внаслідок якої грань Елітист Заклинача пасивно надавала посилення чарів ще до застосування негативного ефекту.",
      "[*] Виправлено помилку, внаслідок якої Заклинач не здобував досвід за вроджену здібність Керівник (Mastermind).",
      "[*] Виправлено помилку, внаслідок якої на Нігілізм (Nihilism) Лешрака не впливало Паплюження (Defilement) й інші збільшення області дії.",
      "[*] Виправлено помилку, внаслідок якої Вогняний плащ (Flame Cloak) Ліни не оновлював тривалість дії Запальної душі (Fiery Soul), якщо на момент чаклування вже було досягнуто максимальної кількості ефектів Запальної душі.",
      "[*] Виправлено помилку, внаслідок якої Сяюче лезо (Laguna Blade) з талантом 25-го рівня «125% до шкоди Сяючого леза в бар’єр» Ліни не давало бар’єр від шкоди із гранню Повільний вогонь.",
      "[*] Виправлено помилку, внаслідок якої вовків-духів Лікантропа інколи можна було контролювати.",
      "[*] Виправлено хибне розташування смуги здоров’я, що показує перебіг Перетікання (Attribute Shift) Морфника.",
      "[*] Виправлено помилку, внаслідок якої можна було викрасти Офренду (Ofrenda) Муерти.",
      "[*] Виправлено помилку, внаслідок якої Тінистий Демон зі здібністю Служитель Тіней (Shadow Servant) міг створювати ілюзії, що існують вічно, якщо спрацьовувала вроджена здібність Нескінченний хаос (Reins of Chaos) Лицаря Хаосу після чаклування на нього Вигнання (Disruption).",
      "[*] Виправлено помилку, внаслідок якої грань Таємний соус Спліна Техніків не завдавала шкоди в правильному обсязі.",
      "[*] Виправлено помилку, внаслідок якої Неспинний похорон (Ceaseless Dirge) Невмирущого інколи блокував можливість віддавати накази.",
      "[*] Виправлено помилку, внаслідок якої грань Нульовий пацієнт Трутоманта завдавала більше шкоди, ніж треба.",
      "[*] Виправлено помилку, внаслідок якої Чорний Ґримуар (Black Grimoire) Чорнокнижника не переносився до іншого героя після обміну героями.",
      "[*] Виправлено помилку, внаслідок якої Ґрі-ґрі (Gris-Gris) Знахаря не переносився до іншого героя після обміну героями.",
      "[/list]"
    ],
    "commentcount": 194,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1717639903_0",
      "ModAct_1519738978_1717645460_4",
      "mod_require_rereview"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "4338735089004412188",
    "event_gid": "4176605502420155695",
    "voteupcount": 1170,
    "votedowncount": 274,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4338735089004412188",
  "rtime32_last_modified": 1717722399,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1717645462,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14620260,
  "build_branch": "",
  "votes_up": 1170,
  "votes_down": 274,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4338735089004412188",
  "clan_steamid_original": "103582791433224455"
}