{
  "gid": "4176605502420155695",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualizarea de joc 7.36b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1717639680,
  "rtime32_end_time": 1717644601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198045397204",
        "rtUpdated": 1717640316
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1717639686
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1717722398
      }
    ],
    "clone_from_event_gid": "4150708808481245250",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4176605502420155696",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualizarea de joc 7.36b",
    "posttime": 1717639688,
    "updatetime": 1717722398,
    "body": [
      "Actualizarea de joc 7.36b este disponibilă acum. Consultă detaliile actualizării [url=https://www.dota2.com/patches/7.36b?l=romanian]aici[/url].",
      "De asemenea, au fost remediate câteva erori în ultimele zile:",
      "[list]",
      "[*] Au fost remediate mai multe probleme aferente tastelor rapide.",
      "[*] A fost remediat faptul că efectul pozitiv oferit de runa de protecție nu avea o pictogramă.",
      "[*] Atacurile lui Roshan nu mai ucid instantaneu unitățile Serpent Ward și Massive Serpent ale lui Shadow Shaman. În schimb, atacurile lui Roshan sunt considerate ca fiind atacuri de erou.",
      "[*] A fost remediat faptul că unitatea Tempest Double a lui Arc Warden încasa mai multe daune decât trebuia.",
      "[*] A fost remediat faptul că talentul de la nivelul 20 al lui Beastmaster care oferea o aură de maxim de viață lui Beastmaster și unităților sale era aplicat în anumite circumstanțe curierilor.",
      "[*] A fost remediat faptul că abilitatea Spin Web a eroinei Broodmother avea o distanță de invocare mai mică decât trebuia dacă aceasta atingea o altă pânză de păianjen.",
      "[*] Au fost remediate interacțiunile neintenționate ale abilității Silence a eroinei Death Prophet.",
      "[*] A fost remediat faptul că abilitatea Wyrm's Wrath (Frost Dragon) a lui Dragon Knight își aplica neintenționat efectul asupra clădirilor.",
      "[*] A fost remediat faptul că abilitatea Multishot a eroinei Drow Ranger putea fi anulată de invocarea abilității Glacier.",
      "[*] A fost remediat faptul că abilitatea Time Zone a lui Faceless Void atribuia în mod incorect asistări.",
      "[*] A fost remediat faptul că abilitatea Life Break a lui Huskar în combinație cu abilitatea Parting Shot a eroinei Muerta nu le permiteau ocazional jucătorilor să realizeze acțiuni.",
      "[*] A fost remediat faptul că abilitatea Exort (Elitist) a lui Invoker oferea pasiv amplificare pentru vrăji fără a aplica mai întâi efectul negativ.",
      "[*] A fost remediat faptul că abilitatea Mastermind a lui Invoker nu oferea experiență.",
      "[*] A fost remediat faptul că abilitatea Nihilismul a lui Leshrac nu era afectată de Defilement și alte măriri pentru zona de efect.",
      "[*] A fost remediat faptul că abilitatea Flame Cloak a eroinei Lina nu reseta durata abilității Fiery Soul dacă era invocată cât timp eroina avea numărul maxim de suprapuneri de Fiery Soul.",
      "[*] A fost remediat faptul că talentul de la nivelul 25 al eroinei Lina care oferă o barieră pentru daunele cauzate de Laguna Blade nu acorda bariera pentru daunele cauzate de fațeta Slow Burn.",
      "[*] A fost remediat faptul că unitățile invocate de abilitatea Summon Wolves (Spirit Wolves) a lui Lycan puteau fi uneori controlate.",
      "[*] A fost remediat faptul că bara abilității Attribute Shift a lui Morphling nu era aliniată corect.",
      "[*] A fost remediat faptul că abilitatea Ofrenda a eroinei Muerta putea fi furată.",
      "[*] A fost remediat faptul că fațeta Shadow Servant a lui Shadow Demon îi permitea abilității Reins of Chaos a lui Chaos Knight să creeze iluzii cu o durată infinită dacă aceasta era declanșată la invocarea abilității Disruption.",
      "[*] A fost remediat faptul că abilitatea Blast Off! (Spleen's Secret Sauce) a eroilor Techies nu cauza cantitatea corectă de daune.",
      "[*] A fost remediat faptul că abilitatea Ceaseless Dirge a lui Undying îl împiedica uneori pe Undying să realizeze acțiuni.",
      "[*] A fost remediat faptul că abilitatea Noxious Plague (Patient Zero) a lui Venomancer cauza mai multe daune decât trebuia.",
      "[*] A fost remediat faptul că fațeta Black Grimoire a lui Warlock nu se schimba atunci când jucătorii schimbau eroii în joc.",
      "[*] A fost remediat faptul că abilitatea Gris-Gris a lui Witch Doctor nu se schimba atunci când jucătorii schimbau eroii în joc.",
      "[/list]"
    ],
    "commentcount": 194,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1717639903_0",
      "ModAct_1519738978_1717645460_4",
      "mod_require_rereview"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "4338735089004412188",
    "event_gid": "4176605502420155695",
    "voteupcount": 1170,
    "votedowncount": 274,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4338735089004412188",
  "rtime32_last_modified": 1717722399,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1717645462,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14620260,
  "build_branch": "",
  "votes_up": 1170,
  "votes_down": 274,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4338735089004412188",
  "clan_steamid_original": "103582791433224455"
}