{
  "gid": "4176605502420155695",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja rozgrywki 7.36b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1717639680,
  "rtime32_end_time": 1717644601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198045397204",
        "rtUpdated": 1717640316
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1717639686
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1717722398
      }
    ],
    "clone_from_event_gid": "4150708808481245250",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4176605502420155696",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aktualizacja rozgrywki 7.36b",
    "posttime": 1717639688,
    "updatetime": 1717722398,
    "body": [
      "Aktualizacja 7.36b jest już dostępna. Listę zmian możecie sprawdzić [url=https://www.dota2.com/patches/7.36b]tutaj[/url].",
      "Dodatkowo w ciągu ostatnich dni naprawiono kilka błędów:",
      "[list]",
      "[*] Rozwiązano rozmaite problemy ze skrótami klawiszowymi.",
      "[*] Naprawiono błąd powodujący, że efekt runy tarczy nie miał ikony.",
      "[*] Ataki Roshana nie będą już natychmiastowo zabijać masowych wężowych stróży ani ogromnego wężowego stróża od Shadow Shamana. Zamiast tego ataki Roshana są traktowane jak ataki bohatera.",
      "[*] Naprawiono błąd powodujący, że klon Arc Wardena z um. Tempest Double otrzymywał więcej obrażeń, niż było to zamierzone.",
      "[*] Naprawiono błąd powodujący, że aura zwiększająca maksymalne zdrowie Beastmastera i jego jednostek z jego talentu na 20. poziomie miała zastosowanie do kurierów w niektórych przypadkach.",
      "[*] Naprawiono błąd powodujący, że um. Spin Web od Broodmother miała mniejszy zasięg rzutu, niż było to zamierzone, jeśli jej efekt dotknął innej sieci.",
      "[*] Naprawiono błąd powodujący, że um. Silence od Death Prophet wchodziła w pewne niezamierzone interakcje.",
      "[*] Naprawiono błąd powodujący, że efekt um. Wyrm's Wrath od Dragon Knighta był w niezamierzony sposób nakładany na budynki, jeśli wybrano aspekt Smok Mrozu.",
      "[*] Naprawiono błąd powodujący, że um. Multishot od Drow Ranger była anulowana przy użyciu um. Glacier.",
      "[*] Naprawiono błąd powodujący, że um. Time Zone od Faceless Voida nieprawidłowo przyznawała asysty.",
      "[*] Naprawiono błąd powodujący, że um. Life Break od Huskara w połączeniu z um. Parting Shot czasami powstrzymywała graczy przed wydawaniem poleceń.",
      "[*] Naprawiono błąd powodujący, że aspekt Elitarystyczny od Invokera pasywnie przyznawał wzmocnienie czarów bez wcześniejszego stosowania negatywnego efektu um. Exort.",
      "[*] Naprawiono błąd powodujący, że um. Mastermind od Invokera nie przyznawała doświadczenia.",
      "[*] Naprawiono błąd powodujący, że um. Defilement i inne źródła zwiększenia obszaru działania nie miały wpływu na um. Nihilism od Leshraca.",
      "[*] Naprawiono błąd powodujący, że um. Flame Cloak od Liny nie odświeżała czasu działania um. Fiery Soul, jeśli została użyta przy jej maksymalnej liczbie ładunków.",
      "[*] Naprawiono błąd powodujący, że um. Laguna Blade od Liny nie przyznawała bariery od obrażeń od powolnego spalania po wybraniu talentu na 25. poziomie konwertującego część obrażeń na barierę.",
      "[*] Naprawiono błąd powodujący, że czasami można było kontrolować wilki z um. Spirit Wolves od Lycana.",
      "[*] Naprawiono błąd powodujący, że pasek um. Attribute Shift od Morphlinga był niepoprawnie ułożony.",
      "[*] Naprawiono błąd powodujący, że ołtarz Muerty dało się ukraść.",
      "[*] Naprawiono błąd powodujący, że Shadow Demon z cienistym sługą był w stanie tworzyć niewygasające iluzje, jeśli um. Reins of Chaos została aktywowana po rzuceniu um. Disruption na Chaos Knighta.",
      "[*] Naprawiono błąd powodujący, że um. Blast Off! nie zadawała poprawnych wartości obrażeń po wybraniu aspektu Sekretny Sos Spleena.",
      "[*] Naprawiono błąd powodujący, że um. Ceaseless Dirge od Undyinga czasami uniemożliwiała mu wydawanie poleceń.",
      "[*] Naprawiono błąd powodujący, że um. Noxious Plague od Venomancera zadawała więcej obrażeń, niż powinna, po wybraniu aspektu Pacjent Zero.",
      "[*] Naprawiono błąd powodujący, że um. Black Grimoire od Warlocka nie zmieniała się, gdy gracze zamienili bohaterów w grze.",
      "[*] Naprawiono błąd powodujący, że um. Gris-Gris od Witch Doctora nie zmieniała się, gdy gracze zamienili bohaterów w grze.",
      "[/list]"
    ],
    "commentcount": 194,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1717639903_0",
      "ModAct_1519738978_1717645460_4",
      "mod_require_rereview"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4338735089004412188",
    "event_gid": "4176605502420155695",
    "voteupcount": 1171,
    "votedowncount": 274,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4338735089004412188",
  "rtime32_last_modified": 1717722429,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1717645462,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14620260,
  "build_branch": "",
  "votes_up": 1170,
  "votes_down": 274,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4338735089004412188",
  "clan_steamid_original": "103582791433224455"
}