{
  "gid": "4176605502420155695",
  "clan_steamid": "103582791433224455",
  "event_name": "Aggiornamento di gioco 7.36b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1717639680,
  "rtime32_end_time": 1717644601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198045397204",
        "rtUpdated": 1717640316
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1717639686
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1717722398
      }
    ],
    "clone_from_event_gid": "4150708808481245250",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4176605502420155696",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aggiornamento di gioco 7.36b",
    "posttime": 1717639688,
    "updatetime": 1717722398,
    "body": [
      "L'aggiornamento 7.36b è ora disponibile. Puoi leggere le note [url=https://www.dota2.com/patches/7.36b]qui[/url].",
      "Inoltre, negli ultimi giorni sono stati corretti alcuni bug:",
      "[list]",
      "[*] Risolti vari problemi con i tasti delle abilità.",
      "[*] Risolto il problema per cui l'effetto positivo delle Rune della Protezione non aveva un'icona.",
      "[*] Gli attacchi di Roshan non uccidono più istantaneamente i Guardiani Serpenti e il Guardiano Serpente Enorme di Shadow Shaman. Gli attacchi di Roshan vengono invece considerati come attacchi dell'Eroe.",
      "[*] Risolto il problema per cui il clone di Tempesta doppia di Arc Warden subiva più danni del previsto.",
      "[*] Risolto il problema per cui il talento di livello 20 di Beastmaster \"salute massima per Beastmaster e Unità (aura)\" si applicava ai corrieri in determinate circostanze.",
      "[*] Risolto il problema per cui Tela filata di Broodmother aveva una gittata di lancio inferiore al previsto quando toccava un'altra ragnatela.",
      "[*] Risolto il problema per cui Silenzio di Death Prophet aveva alcune interazioni non volute.",
      "[*] Risolto il problema che causava l'applicazione involontaria degli effetti di Furia del drago per Drago del ghiaccio di Dragon Knight alle strutture.",
      "[*] Risolto il problema per cui Colpo multiplo di Drow Ranger veniva annullato lanciando Ghiacciaio.",
      "[*] Risolto il problema per cui Fuso orario di Faceless Void faceva ottenere aiuti in modo errato.",
      "[*] Risolto il problema per cui Spezzavita di Huskar in combinazione con Dipartita talvolta impediva ai giocatori di eseguire le azioni.",
      "[*] Risolto il problema per cui Elitario di Invoker faceva ottenere passivamente l'amplificazione degli incantesimi senza applicare preventivamente l'effetto negativo.",
      "[*] Risolto il problema per cui Mente geniale di Invoker non faceva ottenere esperienza.",
      "[*] Risolto il problema per cui Nichilismo di Leshrac non beneficiava di Contaminazione e altri bonus che aumentavano l'area d'effetto.",
      "[*] Risolto il problema per cui Difesa infuocata di Lina non ripristinava la durata di Animo focoso se veniva usata con il numero massimo di istanze di Animo focoso.",
      "[*] Risolto il problema per cui Lama della laguna di Lina con il talento di livello 25 \"danno da Lama della laguna come barriera\" non creava una barriera contro i danni da Combustione lenta.",
      "[*] Risolto il problema per cui in certi casi era possibile controllare i Lupi spirituali di Lycan.",
      "[*] Risolto il problema per cui la barra di Cambio di attributo di Morphling non era allineata.",
      "[*] Risolto il problema per cui Ofrenda di Muerta poteva essere rubata.",
      "[*] Risolto il problema per cui Shadow Demon con il servitore poteva creare illusioni dalla durata infinita se Redini del caos venivano attivate usando Frammentazione su Chaos Knight.",
      "[*] Risolto il problema per cui Ricetta segreta di Spleen di Techies non infliggeva la giusta quantità di danni.",
      "[*] Risolto il problema per cui Lamento incessante di Undying in certi casi impediva a Undying di eseguire le azioni.",
      "[*] Risolto il problema per cui Paziente zero di Venomancer infliggeva più danni del previsto.",
      "[*] Risolto il problema per cui Grimorio Nero di Warlock non veniva scambiato quando i giocatori si scambiavano gli Eroi in gioco.",
      "[*] Risolto il problema per cui Gris-Gris di Witch Doctor non veniva scambiato quando i giocatori si scambiavano gli Eroi in gioco.",
      "[/list]"
    ],
    "commentcount": 194,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1519738978_1717639903_0",
      "ModAct_1519738978_1717645460_4",
      "mod_require_rereview"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "4338735089004412188",
    "event_gid": "4176605502420155695",
    "voteupcount": 1171,
    "votedowncount": 274,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4338735089004412188",
  "rtime32_last_modified": 1717722429,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1717645462,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14620260,
  "build_branch": "",
  "votes_up": 1170,
  "votes_down": 274,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4338735089004412188",
  "clan_steamid_original": "103582791433224455"
}