{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Dar Smoka",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707432002
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Dar Smoka",
    "posttime": 1707432004,
    "updatetime": 1707432004,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Pracujemy w pocie czoła nad nadchodzącą aktualizacją, którą nazywamy „Utraconą Koroną” i cieszymy się na myśl o dokończeniu naszego działa, byście mogli zobaczyć owoce naszej pracy. Rzuciliśmy okiem na kalendarz i spostrzegliśmy, że od aktualizacji Mroźnego Festiwalu minęło więcej niż kilka tygodni i nie chcieliśmy, żebyście czekali aż do Utraconej Korony, nim dostaniecie jakąkolwiek nową zawartość. Na szczęście kalendarzowi bogowie nie zawiedli i w samą porę przynieśli nam kolejne święto: życzymy szczęśliwego Chińskiego Nowego Roku!",
      "Ludzie urodzeni w roku smoka słyną ze swej hojności, dostatku i szczęścia. Fajnie mają. Tym z nas, których magiczny smok nie obdarzył supermocami obdarowywania, przedstawiamy Dar Smoka z motywem czerwonej koperty, który jest dostępny od teraz do 7 marca. Działają one dokładnie tak, jak wskazuje ich nazwa: skarby, które można jedynie podarować oraz które mogą zostać otwarte jedynie przez tę osobę, którą wybierzecie jako odbiorcę.",
      "A dla tych z was, którym nie w smak czekanie na hojność innych, mamy również tradycyjne Smocze Skarby. Każdy skarb lub prezent zawiera 1 z 17 nowych zestawów przedmiotów ozdobnych z motywem Chińskiego Nowego Roku oraz dodatkową szansę na Dar Smoka lub nowy niezwykły efekt.",
      "Do tego przy otwieraniu każdego skarbu (i prezentu) macie szansę na otrzymanie Starożytnego Smoczego Króla, pierwszego w historii przedmiotu ozdobnego dla waszego starożytnego z osobnymi stylami dla Mrocznych i Świetlistych. W końcu doczekaliście się szansy na przyozdobienie waszego starożytnego mitycznym smokiem tak jak, prawdopodobnie, zawsze tego chcieliście. Dodatkowo, jeśli ktokolwiek w waszym meczu posiada ten przedmiot, każdy może go zobaczyć.",
      "Trzymając się dalej tego motywu „obdarowywania”, mamy kolejny prezent dla (prawie) każdego: wdrożyliśmy nowy kod wykrywający oszustwa. Nie no, tak na serio to wdrożyliśmy go już parę tygodni temu i spędziliśmy ten czas na zebraniu pokaźnego zbioru oszustów. Prawdopodobnie będziecie rzadziej trafiali na nich w waszych kolejnych grach w miarę kolejnych fal zautomatyzowanych banów.",
      "Zgodnie z tradycją, ta aktualizacja zawiera też wiele innych poprawek i ulepszeń:",
      "[b]Ogólne poprawki:[/b]",
      "[list]",
      "[*]Naprawiono wiele błędów uniemożliwiających wczytywanie poradników w grze. Jeśli ręcznie włączyliście pobieranie w tle na Steam, by spróbować obejść ten problem, to możecie w bezpieczny sposób z powrotem je wyłączyć.",
      "[*]Naprawiono kolejny przypadek, w którym Roshan mógł przechadzać się po mapie, czyli wtedy, gdy Night Stalker rzucający um. Dark Ascension inkantował bliźniaczą bramę.",
      "[*]Naprawiono błąd powodujący, że przejęte posterunki można było inkantować.",
      "[*]Naprawiono błąd powodujący, że selektor neutralnych przedmiotów był ukrywany po zwolnieniu przycisku w niektórych trybach szybkiego rzucania.",
      "[*]Naprawiono błąd powodujący, że przedmiot Doubloon przyznawał tylko 2 pkt. regeneracji many zamiast 2,5.",
      "[*]Naprawiono błąd powodujący stosowanie odporności na magię z przedmiotu Eternal Shroud na iluzjach.",
      "[*]Naprawiono błąd powodujący nieprawidłowe interakcje przedmiotu Eternal Shroud z um. Mana Shield od Medusy.",
      "[*]Do objaśnienia przedmiotu Safety Bubble dodano brakującą wzmiankę o pomijaniu przez barierę obrażeń zadanych samemu sobie.",
      "[*]Rozwiązano problem z efektami przedmiotu Shiva's Guard.",
      "[*]Naprawiono błąd powodujący, że um. Holy Persuasion od Chena nie brała pod uwagę mnożnika nagrody za stwory w trybie Turbo przy przyznawaniu złota po rzucie.",
      "[*]Naprawiono błąd powodujący, że Aghanim's Shard wciąż przyznawał premię do pancerza i czasu trwania um. Overwhelming Odds od Legion Commander.",
      "[*]Naprawiono błąd powodujący, że um. Unleash od Marci była aktywowana po podniesieniu i upuszczeniu przedmiotu Bloodstone.",
      "[*]Naprawiono błąd powodujący, że um. Gunslinger od Muerty dało się rozproszyć.",
      "[*]Naprawiono błąd powodujący, że skrót klawiszowy ulepszenia um. Multicast od Ogre Magi nie działał.",
      "[*]Naprawiono błąd powodujący, że nieaktywne iluzje Phantom Lancera mogły blokować neutralne obozy.",
      "[*]Naprawiono rzadko występujący błąd związany z um. Uproar od Primal Beasta powodujący nieoczekiwane zamknięcie serwera.",
      "[*]Naprawiono błąd powodujący, że układ kolumn w sklepie nie wyświetlał przedmiotów Khanda i Harpoon.",
      "[*]Do rozszerzonych objaśnień dodano wzmianki o odporności na magię za Inteligencję oraz zwiększonych obrażeniach dla bohaterów uniwersalnych.",
      "[*]Od teraz w trybie Turbo komunikat „Bohater X został wybrany przez obie drużyny!” będzie wyświetlany każdemu, a nie tylko graczowi, który próbował wybrać już wybranego bohatera.",
      "[*]Dodano ikony czaru dla um. Gale Force od Windranger dla zestawu arkanów Kompas Wzbierającego Wichru.",
      "[*]Usprawniono wydajność gry podczas wyświetlania wielu wiadomości z globalnych kanałów czatu.",
      "[*]Rozwiązano rozmaite problemy ze wskazówkami.",
      "[*]Zaktualizowano wskazówki pokazywane podczas pauzy, by były zgodne z aktualizacją rozgrywki 7.35b.",
      "[/list]",
      "[b]Poprawki trybu Ability Draft:[/b]",
      "[list]",
      "[*]Istniało wiele umiejętności przyznawanych lub ulepszanych po otrzymaniu Aghanim's Scepter/Shard, które nie były wcześniej dostępne w trybie Ability Draft. Od teraz niektóre z nich są przyznawane, a niektóre dostępne poprzez przełączenie automatycznego rzutu na czarze bazowym:",
      "[list]",
      "[*]Um. Glacier jest przyznawana wraz z um. Marksmanship.",
      "[*]Um. Crystal Clone jest przyznawana wraz z um. Frostbite.",
      "[*]Um. Parting Shot jest przyznawana wraz z um. Pierce the Veil.",
      "[*]Um. Work Horse jest przyznawana wraz z um. Stampede.",
      "[*]Um. Burning Barrage jest przyznawana wraz z um. Skeleton Walk.",
      "[*]Um. Friendly Shadow jest przyznawana wraz z um. Shadow Walk.",
      "[*]Um. Counterspell Ally jest przyznawana wraz z um. Counterspell.",
      "[*]Um. Lightning Hands jest przyznawana wraz z um. Arc Lightning.",
      "[*]Um. Burning Army jest przyznawana wraz z um. Death Pact.",
      "[*]Um. Unrefined Fireblast jest przyznawana wraz z um. Fireblast.",
      "[*]Um. Poison Nova jest przyznawana wraz z um. Noxious Plague (um. pasywna Poison Nova jest ukryta).",
      "[/list]",
      "[*]Um. Chemical Rage od teraz przyznaje um. Greevil's Greed. Będzie pojawiać się jako premia zamiast na pasku umiejętności.",
      "[*]Naprawiono błąd powodujący, że duchowy niedźwiedź nie miał żadnych umiejętności.",
      "[*]Naprawiono błąd powodujący, że um. Blinding Light nie była wyświetlana jako umiejętność możliwa do wyboru.",
      "[*]Naprawiono błąd powodujący, że Alchemist miał do wyboru 4 umiejętności bazowe, co powodowało przesunięcie pozostałych umiejętności o jedno pole.",
      "[*]Um. Cloak and Dagger po ulepszeniu przez Aghanim's Shard nie przyznaje już um. Sleeping Dart.",
      "[*]Um. Ravage po ulepszeniu przez Aghanim's Shard od teraz przyznaje um. Dead in the Water zamiast Tendrils of the Deep.",
      "[*]Zaktualizowano ulepszenie z Aghanim's Shard dla Invokera w trybie Ability Draft. Od teraz zamiast starego Meteor jest to nowe E.M.P.",
      "[*]Um. Proximity Mines od teraz dodatkowo przyznaje um. Minefield Sign.",
      "[*]Naprawiono błąd powodujący, że um. Shadow Wave i Dream Coil po ulepszeniu przez Aghanim's Scepter nie działały na bohaterach walczących wręcz.",
      "[*]Naprawiono błąd powodujący, że um. Spirits działała na iluzjach po ulepszeniu przez Aghanim's Scepter.",
      "[*]Naprawiono błąd powodujący, że Ogre Magi otrzymywał um. Multicast zamiast Dumb Luck jako wrodzoną.",
      "[*]Naprawiono błąd powodujący, że um. Primal Spring, Pulse Nova, Rot, Infernal Blade i wiele innych nie przyznawały instancji um. Fiery Soul.",
      "[*]Naprawiono błąd powodujący, że talenty nie były wyświetlane dla um. Starbreaker, Cinder Brew, Phantom Rush i Power Cogs, gdy umiejętność została wybrana dla bohatera, do którego oryginalnie należy.",
      "[*]Naprawiono błąd powodujący, że um. Death Seeker nie dało się przełączyć skrótem klawiszowym.",
      "[*]Naprawiono błąd uniemożliwiający przełączanie się między um. Call of the Wild Hawk a Call of the Wild Boar i odwrotnie.",
      "[*]Naprawiono błąd powodujący, że um. Hairball pojawiała się bez użycia skrótu klawiszowego, dopóki nie została przełączona.",
      "[*]Naprawiono błąd powodujący, że um. Chemical Rage po ulepszeniu przez Aghanim's Scepter nie przyznawała premii do obrażeń i wzmocnienia czarów.",
      "[*]Naprawiono błąd powodujący przyznawanie um. Horn Toss po zdobyciu Aghanim's Shard zamiast Aghanim's Scepter.",
      "[*]Naprawiono błąd powodujący przyznawanie um. Rain of Destiny po zdobyciu Aghanim's Scepter zamiast Aghanim's Shard.",
      "[*]Naprawiono błąd powodujący przyznawanie um. Hunter's Boomerang i Decoy po zdobyciu Aghanim's Shard lub Aghanim's Scepter.",
      "[*]Naprawiono błąd powodujący przyznawanie Timbersawowi um. Second Chakram po zdobyciu Aghanim's Scepter. Od teraz jest ona przyznawana tylko, jeśli talent Timbersawa dobiera um. Chakram.",
      "[/list]"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1707432004,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}