{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Dary roku Draka",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dary roku Draka",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Představte si, že ze všech sil makáme na nadcházející aktualizaci (které říkáme „Crownfall“ neboli „Pád moci“) a nemůžeme se dočkat, až ji uvidíte na vlastní oči, ale pak se podíváme do kalendáře a zjistíme, že od aktualizace Frostivus už uteklo pěkných pár týdnů, a jelikož Pád moci ještě není úplně ready, máme tu náběh na obsahové sucho. Kalendář naštěstí nabízí i vítanou příležitost, jak to zachránit: začátek nového lunárního roku!",
      "Nastává tedy rok Draka, přičemž lidi narozené v tomto roce charakterizuje štědrost, prosperita a štěstí. To zní hezky. Pokud ale stejně jako my nemáte kouzelného draka strážného, který by Vám propůjčoval superschopnosti, představujeme nástroj Dragon’s Gift. Ten je možné zakoupit ode dneška do 7. března a jeho fungování je docela prosté – červenou obálku nemůžete sami otevřít, ale zato ji můžete darovat někomu jinému, komu už otevřít půjde.",
      "Jestli však nechcete spoléhat pouze na štědrost ostatních, obsah obálky v podobě truhly Dragon’s Hoard lze zakoupit také samostatně. Každá z těchto truhel poté obsahuje jeden ze 17 nových, novoročně laděných setů s bonusovou šancí na získání nových Unusual efektů nebo další červené obálky.",
      "A aby toho nebylo málo, každá truhla (a tím pádem i obálka) může obsahovat předmět Ancient Dragon King, vůbec první kosmetický předmět pro Ancienta s odlišným vzhledem pro týmy Dire a Radiant. Aneb konečně můžete svého Ancienta ozdobit mytickým drakem, jak jste si určitě vždy přáli. Mimochodem, tento předmět je viditelný všem hráčům v zápasu, stačí, aby ho měl vybavený jeden z účastníků.",
      "Plus (nicméně stále v duchu rozdávání) máme ještě jeden dárek, který ocení takřka všichni hráči: spustili jsme nový kód pro detekci cheatů. Respektive, spustili jsme ho už před pár týdny, a za tu dobu jsme stihli nasbírat slušnou sbírku podvodníků. Nejspíš jich tedy potkáte o něco méně, až je spláchnou vlny banů.",
      "A závěrem nemůže chybět tradiční várka oprav a vylepšení. Přejeme příjemné počtení:",
      "[b]Obecné opravy:[/b]",
      "[list]",
      "[*]Byla opravena řada problémů, které bránily v načítání buildů ve hře (pokud jste pro vyřešení v klientu služby Steam ručně povolili stahování na pozadí při hraní, můžete ho zase zakázat)",
      "[*]Byl opraven další případ, kdy se Roshan mohl vydat na procházku, tentokrát spojený s tím, že Night Stalker použil schopnost Dark Ascension, zatímco Roshan vyvolával cestovní bránu",
      "[*]Byl opraven problém, kvůli kterému bylo možné vyvolávat již zabraná stanoviště",
      "[*]Byl opraven problém, kvůli kterému po puštění klávesy rychlého sesílání došlo k zavření výběru neutrálních předmětů",
      "[*]Byl opraven neutrální předmět Doubloon, který poskytoval pouze 2 body k regeneraci many (ačkoli měl poskytovat 2,5 bodu)",
      "[*]Byl opraven bonus k odolnosti vůči magii předmětu Eternal Shroud, který byl aplikován také na iluze",
      "[*]Byly opraveny interakce mezi předmětem Eternal Shroud a schopností Mana Shield (Medusa)",
      "[*]Byl opraven popisek neutrálního předmětu Safety Bubble, jehož pasivní schopnost Bubbled Up nezmiňovala, že štít ignoruje poškození sebe sama",
      "[*]Byl opraven problém s efekty předmětu Shiva’s Guard",
      "[*]Byla opravena schopnost Holy Persuasion (Chen), která při udělování zlaťáků po použití v módu Turbo nebrala v potaz násobič odměn creepů",
      "[*]Byl opraven předmět Aghanim’s Shard, který Legion Commander stále poskytoval bonus k brnění a trvání schopnosti Overwhelming Odds",
      "[*]Byla opravena schopnost Unleash (Marci), která se spouštěla při sebrání/upuštění předmětu Bloodstone",
      "[*]Byla opravena schopnost Gunslinger (Muerta), kterou bylo možné očistit",
      "[*]Bylo opraveno vylepšování schopnosti Multicast (Ogre Magi) prostřednictvím přiřazené klávesy",
      "[*]Byla opravena chyba, která umožňovala neaktivním iluzím Phantom Lancera blokovat kempy neutrálů",
      "[*]Byl opraven vzácný pád serveru spojený se schopností Uproar (Primal Beast)",
      "[*]Byl opraven obchod, který při rozdělení na sloupce postrádal předměty Khanda a Harpoon",
      "[*]Do rozšířených popisků byly přidány bonus k odolnosti vůči magii od inteligence a bonus k poškození pro hrdiny atributu Všestrannost",
      "[*]Zpráva „Hrdina X byl vybrán oběma týmy!“ se nově v módu Turbo zobrazuje všem, nejen hráčům, kteří se pokusili vybrat již vybraného hrdinu",
      "[*]Byly přidány speciální ikony schopnosti Gale Force (Windranger) spojené s Arcana předmětem Compass of the Rising Gale",
      "[*]Byl vylepšen výkon při zobrazování většího množství zpráv z globálních kanálů",
      "[*]Bylo opraveno několik problémů v popiscích",
      "[*]Tipy při pozastavení zápasu byly aktualizovány s ohledem na herní aktualizaci 7.35b",
      "[/list]",
      "[b]Opravy módu Výběr schopností:[/b]",
      "[list]",
      "[*]Následující schopnosti nově poskytují také dříve nedostupné schopnosti spojené se Scepterem/Shardem, přičemž na ně lze přepnout zapnutím automatického (příp. alternativního) sesílání základní schopnosti:",
      "[list]",
      "[*]Marksmanship poskytuje Glacier",
      "[*]Frostbite poskytuje Crystal Clone",
      "[*]Pierce the Veil poskytuje Parting Shot",
      "[*]Stampede poskytuje Work Horse",
      "[*]Skeleton Walk poskytuje Burning Barrage",
      "[*]Shadow Walk poskytuje Friendly Shadow",
      "[*]Counterspell poskytuje Counterspell Ally",
      "[*]Arc Lightning poskytuje Lightning Hands",
      "[*]Death Pact poskytuje Burning Army",
      "[*]Fireblast poskytuje Unrefined Fireblast",
      "[*]Noxious Plague poskytuje Poison Nova (ale protože je pasivní, je skrytá)",
      "[/list]",
      "[*]Schopnost Chemical Rage nově poskytuje schopnost Greevil's Greed (nezobrazuje se mezi schopnostmi, ale jako buff)",
      "[*]Byl opraven Spirit Bear, který neměl žádné schopnosti",
      "[*]Byla opravena nemožnost vybrat schopnost Blinding Light",
      "[*]Byl opraven Alchemist, který měl po výběru 4 základní schopnosti, což vyústilo v posunutí dalších schopností",
      "[*]Shard už nově ve spojení se schopností Cloak and Dagger neposkytuje schopnost Sleeping Dart",
      "[*]Shard nově ve spojení se schopností Ravage poskytuje schopnost Dead in the Water namísto Tendrils of the Deep",
      "[*]Shard pro Invokera byl aktualizován na vylepšení schopnosti E.M.P. (dříve vylepšení schopnosti Chaos Meteor)",
      "[*]Schopnost Proximity Mines nově poskytuje Minefield Sign jako dodatečnou schopnost",
      "[*]Byly opraveny útoky schopností Shadow Wave a Dream Coil se Scepterem, které nefungovaly pro hrdiny s útoky na blízko",
      "[*]Byla opravena schopnost Spirits, která se Scepterem fungovala i na iluzích",
      "[*]Byl opraven Ogre Magi, který měl jako vrozenou schopnost Multicast namísto Dumb Luck",
      "[*]Byly opraveny schopnosti Primal Spring, Pulse Nova, Rot, Infernal Blade a řada dalších, které neposkytovaly sečtení schopnosti Fiery Soul",
      "[*]Byly opraveny talenty spojené se schopnostmi Starbreaker, Cinder Brew, Phantom Rush a Power Cogs, které se nezobrazovaly, když byly schopnosti vybrány na původních hrdinech",
      "[*]Byla opravena schopnost Death Seeker, kterou nešlo přepnout přes klávesovou zkratku",
      "[*]Byla opravena nemožnost přepnout pomocí schopnosti Call of the Wild Hawk mezi Hawkem a Boarem",
      "[*]Byla opravena schopnost Hairball, která se do přepnutí zobrazovala bez klávesové zkratky",
      "[*]Byl opraven Scepter ve spojení se schopností Chemical Rage, který neposkytoval bonus k poškození a síle kouzel",
      "[*]Byla opravena schopnost Horn Toss, kterou poskytoval Shard namísto Scepteru",
      "[*]Byla opravena schopnost Rain of Destiny, kterou poskytoval Scepter namísto Shardu",
      "[*]Byly opraveny schopnosti Hunter’s Boomerang a Decoy, které byly obě poskytovány Shardem i Scepterem",
      "[*]Byl opraven Timbersaw, který se Scepterem získával schopnost Second Chakram. Nově je poskytována s talentem, když má Timbersaw schopnost Chakram",
      "[/list]"
    ],
    "commentcount": 1129,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 19,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 12092,
    "votedowncount": 1787,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1710287801,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12092,
  "votes_down": 1787,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}