{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Lộc Rồng",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Lộc Rồng",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Chúng tôi đang tích cực chuẩn bị cho bản cập nhật sắp tới có tên \"Phế Đế\", và rất nóng lòng hoàn thiện để khoe với mọi người. Khi nhìn vào lịch và nhận thấy đã vài tuần trôi qua kể từ bản cập nhật Frostivus, và chúng tôi không muốn bạn phải chờ đến Phế Đế để có thứ mới mà vọc. May thay, thần lịch kịp nhét một đợt lễ khác vào đó: Tết Âm lịch!",
      "Con dân sinh năm Thìn thường được biết đến với tính cách hào phóng, có của ăn của để, và vận may dồi dào. Tuyệt ghê ha. Với những ai hổng có rồng thần trao cho siêu năng lực tặng quà, chúng tôi xin giới thiệu Lộc Rồng lấy ý tưởng từ lì xì, mở bán từ nay cho đến ngày 07/03. Đúng như tên gọi: đây là kho báu chỉ dùng để tặng, và chỉ người nhận do bạn chọn mới có thể mở quà lấy lộc.",
      "Còn với những ai không muốn chờ người khác ban lộc, chúng tôi cũng có kho báu Kho tàng Rồng truyền thống luôn. Mỗi kho báu hoặc quà tặng chứa 17 vật phẩm trang trí theo chủ đề Tết Âm lịch, cũng như cơ hội nhận thưởng Lộc Rồng hoặc hiệu ứng lạ thường mới.",
      "Cuối cùng, mỗi kho báu (và quà) đều có cơ hội chứa Long Vương cổ đại, vật phẩm trang trí đầu tiên cho Ancient của bạn, với kiểu dáng độc đáo cho Dire và Radiant. Cuối cùng bạn đã có cơ hội trang hoàng Ancient của mình với linh vật rồng, y như (chúng tôi giả định thế) bạn hằng ao ước. Ngoài ra, chỉ cần một người trong trận đấu có nó, thì thiên hạ cùng hưởng.",
      "Để giữ vững \"tinh trần trao đi\", chúng tôi có một món quà khác cho (gần như) tất cả mọi người: Xin giới thiệu code phát hiện gian lận mới. Ừm, thì thật ra, chúng tôi đã cho ra mắt vài tuần trước, và cũng dành thời gian kể từ lúc ấy để ghi sổ người gian lận. Bạn sẽ thấy ít người ăn gian hơn trong trò chơi với việc các đợt cấm tự động được bung lụa.",
      "Như thường lệ, bản cập nhật này cũng gồm một số lỗi sửa và cải thiện khác:",
      "[b]Sửa lỗi chung:[/b]",
      "[list]",
      "[*]Sửa một số vấn đề ngăn quá trình nạp hướng dẫn trong trò chơi (nếu bạn phải tự bật cho phép Steam tải về dưới nền để khắc phục sự cố này, giờ có thể yên tâm tắt nó đi rồi)",
      "[*]Sửa một trường hợp khác làm Roshan đi lạc: Night Stalker dùng Dark Ascension trong khi Roshan đang vận pháp lên Cổng Đôi",
      "[*]Sửa lỗi có thể vận pháp lên tiền đồn đã được chiếm",
      "[*]Sửa lỗi làm công cụ chọn trang bị rừng sẽ bị ẩn khi thả phím trong một số chế độ dùng phép nhanh",
      "[*]Sửa Doubloon chỉ có +2 thay vì +2.5 mana hồi mỗi giây",
      "[*]Sửa kháng phép của Eternal Shroud áp dụng lên phân thân",
      "[*]Sửa tương tác của Eternal Shroud với Mana Shield của Medusa",
      "[*]Sửa mẹo công cụ của Safety Bubble không nhắc đến việc lá chắn bỏ qua sát thương tự gây ra",
      "[*]Sửa lỗi với hiệu ứng trên Shiva's Guard",
      "[*]Sửa Holy Persuasion của Chen không tính hệ số tiền thưởng quái trong chế độ Turbo khi cho vàng lúc dùng phép",
      "[*]Sửa Aghanim's Shard của Legion Commander vẫn thêm giáp và thời lượng cho Overwhelming Odds",
      "[*]Sửa Unleash của Marci kích hoạt khi nhặt và thả Bloodstone",
      "[*]Sửa Gunslinger của Muerta có thể bị hóa giải",
      "[*]Sửa gán phím không hoạt động để nâng cấp Multicast của Ogre Magi",
      "[*]Sửa lỗi cho phép phân thân không hoạt động của Phantom Lancer chặn được bãi quái rừng",
      "[*]Sửa lỗi ngắt đột ngột máy chủ hiếm gặp với Uproar của Primal Beast",
      "[*]Sửa bố cục cột dọc của cửa hàng không hiện Khanda và Harpoon",
      "[*]Thêm vào mẹo công cụ mở rộng: Trí Tuệ tăng kháng phép cho mọi tướng và tăng sát thương cho tướng Vạn Năng ",
      "[*]Trong Turbo, hiện thông điệp \"Cả hai đội cùng chọn [tướng]!\" cho tất cả mọi người, chứ không chỉ cho người chơi chọn một tướng đã được chọn",
      "[*]Thêm biểu tượng phép cho Gale Force của Windranger khi sử dụng Compass of the Rising Gale",
      "[*]Tăng hiệu năng khi hiển thị nhiều tin nhắn từ các kênh toàn cầu",
      "[*]Sửa các vấn đề khác nhau liên quan đến mẹo công cụ",
      "[*]Cập nhật mẹo hiển thị khi đang tạm dừng cho bản vá lối chơi 7.35b",
      "[/list]",
      "[b]Sửa cho Ability Draft:[/b]",
      "[list]",
      "[*]Một lượng các kỹ năng Scepter/Shard trước đây không hiện hữu giờ đã được thêm vào, một số kỹ năng có thể truy cập bằng cách bật tắt tự động dùng phép trên phép cơ bản:",
      "[list]",
      "[*]Glacier đi cùng Marksmanship",
      "[*]Crystal Clone đi cùng Frostbite",
      "[*]Parting Shot đi cùng Pierce the Veil",
      "[*]Work Horse đi cùng Stampede",
      "[*]Burning Barrage đi cùng Skeleton Walk",
      "[*]Friendly Shadow đi cùng Shadow Walk",
      "[*]Counterspell Ally đi cùng Counterspell",
      "[*]Lightning Hands đi cùng Arc Lightning",
      "[*]Burning Army đi cùng Death Pact",
      "[*]Unrefined Fireblast đi cùng Fireblast",
      "[*]Poison Nova đi cùng Noxious Plague (Ẩn kỹ năng nội tại Poison Nova)",
      "[/list]",
      "[*]Chemical Rage giờ đi cùng Greevil's Greed. Nó sẽ hiện dưới dạng bùa lợi thay vì trên thanh kỹ năng.",
      "[*]Sửa Spirit Bear không có kỹ năng nào.",
      "[*]Sửa Blinding Light không hiện dưới dạng kỹ năng có thể chọn được.",
      "[*]Sửa Alchemist có 4 kỹ năng cơ bản lúc chọn, qua đó đẩy các kỹ năng khác đi lệch một ô.",
      "[*]Cloak and Dagger (Shard) không còn cho Sleeping Dart.",
      "[*]Ravage (Shard) giờ cho Dead in the Water thay vì Tendrils of the Deep.",
      "[*]Shard của Invoker trong Ability Draft giờ cập nhật thành EMP (Shard) mới thay vì Meteor (Shard) cũ.",
      "[*]Proximity Mines giờ cho Minefield Sign làm kỹ năng bổ sung.",
      "[*]Sửa Shadow Wave và đòn tấn công từ Dream Coil (Scepter) không hoạt động trên tướng cận chiến.",
      "[*]Sửa Spirits hoạt động trên phân thân khi bạn có Scepter.",
      "[*]Sửa Ogre Magi nhận Multicast thay vì Dumb Luck làm kỹ năng sẵn có.",
      "[*]Sửa Primal Spring, Pulse Nova, Rot, Infernal Blade, và một số kỹ năng khác không cộng dồn Fiery Soul.",
      "[*]Sửa tiềm năng không hiển thị cho Starbreaker, Cinder Brew, Phantom Rush, và Power Cogs khi kỹ năng này được chọn cho tướng nguyên bản của chúng.",
      "[*]Sửa không thể bật/tắt Death Seeker bằng phím tắt.",
      "[*]Sửa không thể bật/tắt Call of the Wild Hawk để chuyển qua lại giữa lợn và chim.",
      "[*]Sửa Hairball hiển thị mà không có phím tắt cho đến khi phím được bật/tắt.",
      "[*]Sửa Chemical Rage (Scepter) không cho thêm sát thương và cường hóa phép.",
      "[*]Sửa Horn Toss được trao bởi Shard thay vì Scepter.",
      "[*]Sửa Rain of Destiny được trao bởi Scepter thay vì Shard.",
      "[*]Sửa Hunter's Boomerang và Decoy được trao bởi Shard hoặc Scepter.",
      "[*]Sửa Timbersaw nhận Second Chakram với Scepter. Giờ chỉ được trao qua tiềm năng nếu Timbersaw chọn kỹ năng Chakram.",
      "[/list]"
    ],
    "commentcount": 1128,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 28,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 12092,
    "votedowncount": 1787,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1710287715,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12092,
  "votes_down": 1787,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}