{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "O Presente do Dragão",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "O Presente do Dragão",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Estamos trabalhando arduamente em uma atualização futura chamada \"Queda Coronal\", e mal podemos esperar para terminá-la e compartilhá-la com vocês. Olhamos o calendário e percebemos que já faz mais de algumas semanas desde a atualização do Frostivus — e não queríamos que vocês esperassem até a Queda Coronal para receber algum conteúdo novo. E não é que demos sorte? Os deuses do calendário apareceram com outra comemoração bem a tempo: feliz Ano Novo Lunar!",
      "Pessoas que nasceram no Ano do Dragão são conhecidas pela sua generosidade, prosperidade e sorte. Deve ser bom. Para aqueles que não têm um dragão mágico concedendo superpoderes do presenteamento, estamos lançando o Presente do Dragão, com o tema de envelopes vermelhos, disponível até 7 de março. Eles funcionam como o nome sugere: tesouros que só podem ser presenteados e então abertos pelo destinatário.",
      "Para vocês que preferem não contar com a generosidade alheia, também temos versões tradicionais do Tesouro do Dragão. Cada tesouro ou presente contém um dos 17 novos conjuntos cosméticos temáticos do Ano Novo Lunar, além de uma chance adicional de obter itens com os novos efeitos Incomuns ou um Presente do Dragão.",
      "Por fim, cada tesouro (e presente) tem a chance de conter o Dragão Rei Ancestral, o primeiro cosmético lançado para os Ancestrais, com estilos distintos para os Temidos e Iluminados. Agora, você finalmente terá a chance de enfeitar o seu Ancestral com um dragão mítico, assim como, supostamente, você sempre quis. Além disso, basta um jogador na sua partida ter o Ancestral para que todos possam vê-lo.",
      "Seguindo na linha desse tema de \"espírito dos presentes\", temos mais um mimo para (quase) todo mundo: implementamos alguns novos algoritmos de detecção de trapaças. Bom, na verdade, a implementação ocorreu algumas semanas atrás, e desde então identificamos uma boa quantidade de trapaceiros. Você provavelmente encontrará menos deles nas suas partidas, conforme as ondas de banimentos automáticos acontecem.",
      "Como é tradição, essa atualização também inclui várias outras correções e aprimoramentos:",
      "[b]Correções gerais:[/b]",
      "[list]",
      "[*]Correção de diversos problemas que impediam que guias fossem carregadas durante partidas (caso você tenha configurado o Steam para permitir downloads enquanto joga para contornar este problema, agora você pode desativá-lo novamente).",
      "[*]Roshan: correção de outro caso que o permitia perambular incorretamente — Night Stalker usando a Ascensão Sombria enquanto Roshan canalizava um Portal Gêmeo.",
      "[*]Postos avançados: correção de problema que permitia canalizar postos já capturados.",
      "[*]Correção de problema em que o selecionador de itens neutros era fechado ao soltar teclas de atalho rápido.",
      "[*]Dobrão: correção da regeneração de mana, que estava como +2 em vez de +2,5.",
      "[*]Mortalha Eterna: correção da resistência mágica, que estava sendo aplicada a ilusões.",
      "[*]Mortalha Eterna: correção de interações com o Escudo de Mana de Medusa.",
      "[*]Bolha Protetora: correção do texto, que não mencionava que o dano causado a si mesmo pelo portador ignora a barreira.",
      "[*]Proteção de Shiva: correção de problema com os efeitos.",
      "[*]Chen: correção da Persuasão Sagrada, que não estava considerando o multiplicador de recompensas de criaturas no modo Turbo ao conceder ouro.",
      "[*]Legion Commander: correção do Fragmento de Aghanim, que ainda estava concedendo armadura e duração adicionais para Desigualdade Esmagadora.",
      "[*]Marci: correção de Libertar, que estava sendo ativada ao pegar ou largar uma Pedra de Sangue.",
      "[*]Muerta: correção de Pistoleira, que podia ser expurgada.",
      "[*]Ogre Magi: correção do atalho não funcionar para aprimorar o Multilançamento.",
      "[*]Phantom Lancer: correção de problema em que ilusões inativas podiam bloquear acampamentos de criaturas.",
      "[*]Fera Primal: correção de travamento raro do servidor relacionado ao Alvoroço.",
      "[*]Loja: correção da disposição de colunas de itens, que não exibia Khanda e Arpão.",
      "[*]Adição de resistência mágica por Inteligência e dano aumentado para heróis Universais no texto expandido.",
      "[*]Agora, no modo Turbo, a mensagem \"[Herói] foi escolhido por ambas as equipes!\" é exibida para todos, em vez de apenas para os jogadores que tentaram escolhê-lo.",
      "[*]Windranger: adição de ícones de habilidade para a Força da Ventania ao usar a Bússola da Ventania Crescente.",
      "[*]Aumento do desempenho ao exibir muitas mensagens de texto em canais globais.",
      "[*]Correção de diversos textos.",
      "[*]Atualização das dicas exibidas durante a tela de pausa para usar valores da atualização de jogabilidade 7.35b.",
      "[/list]",
      "[b]Correções do modo de Seleção de Habilidades:[/b]",
      "[list]",
      "[*]Agora, diversas habilidades de Cetro e Fragmento anteriormente indisponíveis são concedidas. Algumas habilidades são acessadas ao alternar o uso automático da habilidade base:",
      "[list]",
      "[*]Geleira concedida com Pontaria.",
      "[*]Clone Cristalino concedido com Congelamento.",
      "[*]Disparo Desalmado concedido com Além do Véu.",
      "[*]Carroça concedida com Debandada.",
      "[*]Rajada Ardente concedida com Andar do Esqueleto.",
      "[*]Sombra Aliada concedida com Andar das Sombras.",
      "[*]Contrafeitiço Aliado concedido com Contrafeitiço.",
      "[*]Mãos Eletrizantes concedida com Arco Elétrico.",
      "[*]Exército Ardente concedido com Pacto de Morte.",
      "[*]Rajada de Fogo Bruto concedida com Rajada de Fogo.",
      "[*]Onda Venenosa concedida com Praga Nociva (a habilidade passiva da Onda Venenosa é ocultada).",
      "[/list]",
      "[*]Fúria Química: agora, concede Ganância de Greevil. Será exibida como um efeito em vez de na barra de habilidades.",
      "[*]Espírito Urso: correção da ausência de habilidades.",
      "[*]Luz Cegante: correção do não aparecimento como uma habilidade selecionável.",
      "[*]Alchemist: correção da exibição de quatro habilidades básicas, \"empurrando\" as demais em uma unidade.",
      "[*]Manto e Adaga: agora, o Fragmento não concede mais Dardo Tranquilizante.",
      "[*]Devastar: agora, o Fragmento concede Mar Morto em vez de Tentáculos das Profundezas.",
      "[*]Invoker: agora, o Fragmento concede o novo aprimoramento (Pulso Eletromagnético) em vez do antigo (Meteoro do Caos).",
      "[*]Minas de Proximidade: agora, concede Placa de Campo Minado como uma habilidade adicional.",
      "[*]Espiral dos Sonhos/Onda Sombria: correção dos ataques do Cetro não funcionarem em heróis corpo a corpo.",
      "[*]Espíritos: correção do funcionamento em ilusões quando aprimorada pelo Cetro.",
      "[*]Ogre Magi: correção da obtenção de Multilançamento em vez de Sorte Besta como uma habilidade nativa.",
      "[*]Lâmina Infernal/Podridão/Pulso de Nova/Salto Primal (e diversas outras habilidades): correção da não concessão de acúmulos de Alma Ardente.",
      "[*]Água Ardente/Engrenagens Elétricas/Investida Fantasma/Quebra-Estrelas: correção do não funcionamento dos talentos quando a habilidade é selecionada no herói original.",
      "[*]Busca Mortal: correção de problema que impedia alternar o uso com atalhos.",
      "[*]Chamado da Selva: correção da impossibilidade de alternar entre Falcão e Javali.",
      "[*]Bola de Pelos: correção da exibição sem um atalho enquanto não fosse alternada.",
      "[*]Fúria Química: correção do não recebimento de dano e amplificação arcana adicionais com o Cetro.",
      "[*]Lançamento Chifrudo: agora, é corretamente concedida pelo Cetro, em vez de pelo Fragmento.",
      "[*]Chuva do Destino: agora, é corretamente concedida pelo Fragmento, em vez de pelo Cetro.",
      "[*]Bumerangue/Chamariz: agora, são concedidas pelo Fragmento/Cetro apropriado.",
      "[*]Timbersaw: correção da obtenção de Chakram Secundário com o Cetro. Agora, ele só é concedido com o talento se o Timbersaw selecionar o Chakram.",
      "[/list]"
    ],
    "commentcount": 1067,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 9610,
    "votedowncount": 1480,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1708471645,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 9610,
  "votes_down": 1480,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}