{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Дар дракона",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Дар дракона",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Ми наполегливо працюємо над майбутнім оновленням, яке назвали «Коронопад», і нам не терпиться його завершити, щоби ви побачили результат. Ми глянули на календар і помітили, що минуло вже кілька тижнів після мороздвяного оновлення, й нам не хотілося, аби ви чекали на вихід «Коронопаду» без нового ігрового вмісту. На щастя, календарні боги саме вчасно дали нам ще одне свято, тож вітаємо вас із Місячним Новим роком!",
      "Люди, що народилися в рік Дракона, відзначаються щедрістю, процвітанням і везінням. Добре їм. А тим із нас, кому чарівний дракон не дав суперсил, ми запропонуємо Дар дракона в червоному конверті, що доступний від сьогодні до 7 березня. Суть очевидна з назви: це скарбниці, які можна лише дарувати, а відкрити їх зможе лише той, кого ви оберете отримувачем.",
      "А для тих, хто воліють не чекати на чужу щедрість, ми приготували традиційні «Скарби дракона». Кожна скарбниця чи дарунок містять один із 17 нових наборів на тематику Місячного Нового року, а також шанс отримати додатковий «Дар дракона» чи новий чудний ефект.",
      "Окрім цього, кожен дарунок і скарбниця дають шанс отримати Древнього короля драконів — першу принаду для вашого Древнього, з унікальним стилем для Пітьми й Сяйва. Тепер ви нарешті матимете шанс прикрасити свого Древнього міфічним драконом, чого, імовірно, ви завжди хотіли. Також, якщо ця принада є хоча б у когось у вашому матчі, то її побачать усі.",
      "Задля підтримки духу дарування ми підготували ще один дарунок, який сподобається (майже) всім: новий код для виявлення чітів. Власне, ми випустили його кілька тижнів тому й за цей час уже виявили чимало чітерів. Після кожної хвилі автоматичних блокувань ви, імовірно, помічатимете, що нечесних гравців стає менше.",
      "Традиційно це оновлення також містить низку інших виправлень і покращень:",
      "[b]Загальні виправлення:[/b]",
      "[list]",
      "[*]Виправлено помилки, через які не завантажувалися внутрішньоігрові посібники (якщо для вирішення цієї проблеми ви вмикали в Steam завантаження під час гри, то цю опцію тепер можна вимкнути).",
      "[*]Виправлено ще одну помилку, через яку Рошан міг піти гуляти, якщо Нічний Мисливець чаклував Темне сходження (Dark Ascension) у той час, коли Рошан застосовував подвійний портал.",
      "[*]Виправлено помилку, через яку вже захоплені застави можна було спробувати захопити знову.",
      "[*]Виправлено помилку, через яку меню вибору нейтрального предмета зникало під час відпускання клавіші в деяких режимах швидкого застосування.",
      "[*]Виправлено помилку, через яку Дублон (Doubloon) давав +2 до регенерації мани замість +2,5.",
      "[*]Виправлено помилку, через яку опір до магії Вічного савана (Eternal Shroud) застосовувався до ілюзій.",
      "[*]Виправлено взаємодію Вічного савана (Eternal Shroud) зі Щитом мани (Mana Shield) Медузи.",
      "[*]Підказка Бульбашки безпеки (Safety Bubble) тепер повідомляє, що бар’єр пропускає шкоду собі.",
      "[*]Виправлено помилку ефектів Оберегу Шиви (Shiva's Guard).",
      "[*]Виправлено помилку, через яку в турбо-режимі під час застосування Святого переконання (Holy Persuasion) Чена не враховувався множник золота за кріпів.",
      "[*]Виправлено помилку, через яку Чисельна перевага (Overwhelming Odds) Командувачки Легіону з Уламком Аґаніма все ще давала бонус до броні та тривалості.",
      "[*]Виправлено помилку, через яку Вивільнення (Unleash) Марсі спрацьовувало під час отримання і втрати Кривавого каменя (Bloodstone).",
      "[*]Виправлено помилку, через яку ефект Стрільця (Gunslinger) Муерти можна було розвіяти.",
      "[*]Виправлено помилку, через яку Мультичаклування (Multicast) Огр-Мага не покращувалося гарячою клавішею.",
      "[*]Виправлено помилку, через яку неактивні ілюзії Фантомного Улана могли заблокувати табір нейтральних кріпів.",
      "[*]Виправлено рідкісний збій сервера, пов’язаний із Риком (Uproar) Первісного Звіра.",
      "[*]Виправлено помилку, через яку в стовпчиках крамниці не показувалися Ханда (Khanda) і Гарпун (Harpoon).",
      "[*]У розширені підказки додано інформацію про опір до магії від інтелекту та про збільшену шкоду універсальних героїв.",
      "[*]Тепер у турбо-режимі повідомлення про вибір героя обома командами бачать усі, а не лише гравці, які зробили вибір.",
      "[*]Додано піктограми здібностей для Сили вітрів (Gale Force) Вітряної Рейнджер під час використання Компасу висхідного вітру (Compass of the Rising Gale).",
      "[*]Підвищено швидкодію під час показу великої кількості повідомлень із глобальних каналів.",
      "[*]Виправлено різні проблеми з підказками.",
      "[*]Тексти підказок, що з’являються під час паузи, оновлено відповідно до ігроладного оновлення 7.35b.",
      "[/list]",
      "[b]Виправлення в режимі Ability Draft:[/b]",
      "[list]",
      "[*]Додано здібності, які не були доступні зі Скіпетром чи Уламком Аґаніма. Деякі з них з’являються після ввімкненння автоматичного застосування основних здібностей.",
      "[list]",
      "[*]Льодовик (Glacier) дається власнику Стрілецької підготовки (Marksmanship).",
      "[*]Кришталевий клон (Crystal Clone) дається власнику Обмороження (Frostbite).",
      "[*]Розлучний постріл (Parting Shot) дається власнику Крізь Вуаль (Pierce the Veil).",
      "[*]Робоча конячка (Work Horse) дається власнику Галопу (Stampede).",
      "[*]Палючий обстріл (Burning Barrage) дається власнику Ходи скелета (Skeleton Walk).",
      "[*]Дружня тінь (Friendly Shadow) дається власнику Тіньової ходи (Shadow Walk).",
      "[*]Союзні контрчари (Counterspell Ally) даються власнику Контрчарів (Counterspell).",
      "[*]Руки-блискавиці (Lightning Hands) даються власнику Ланцюгової блискавки (Arc Lightning).",
      "[*]Палюча армія (Burning Army) дається власнику Смертельної угоди (Death Pact).",
      "[*]Плюгавий вогняний вибух (Unrefined Fireblast) дається власнику Вогняного вибуху (Fireblast).",
      "[*]Отруйний вибух (Poison Nova) дається власнику Згубної пошесті (Noxious Plague), але буде прихований, бо є пасивною здібністю.",
      "[/list]",
      "[*]Хімічний сказ (Chemical Rage) тепер дає також Жаднюгу (Greevil's Greed). Здібність показуватиметься як ефект.",
      "[*]Виправлено помилку, через яку ведмідь-дух не мав здібностей.",
      "[*]Виправлено помилку, через яку не можна було отримати Сліпуче сяйво (Blinding Light).",
      "[*]Виправлено помилку, через яку в Алхіміка було 4 основні здібності на вибір, а інші здібності зсовувалися вбік.",
      "[*]Плащ і кинджал (Cloak and Dagger) з Уламком Аґаніма більше не дає Снодійний дротик (Sleeping Dart).",
      "[*]Руйнація (Ravage) з Уламком Аґаніма тепер дає Смерть у воді (Dead in the Water) замість Глибинних мацаків (Tendrils of the Deep).",
      "[*]В Заклинача вилучено старий ефект від Уламка Аґаніма й натомість додано новий, що посилює ЕМІ (EMP).",
      "[*]Наземні міни (Proximity Mines) тепер дають також Знак «Мінне поле» (Minefield Sign).",
      "[*]Виправлено помилку, через яку атаки Хвилі тіней (Shadow Wave) і Уявної спіралі (Dream Coil) зі Скіпетром Аґаніма не працювали на героях ближнього бою.",
      "[*]Виправлено помилку, через яку духи зі Скіпетром Аґаніма працювали на ілюзіях.",
      "[*]Виправлено помилку, через яку вродженою здібністю Огр-Мага було Мультичаклування (Multicast) замість Удачі дурня (Dumb Luck).",
      "[*]Виправлено помилку, через яку Первісна весна (Primal Spring), Пульсуюча зоря (Pulse Nova), Гниль (Rot), Пекельне лезо (Infernal Blade) та деякі інші здібності не давали зарядів Запальної душі (Fiery Soul).",
      "[*]Виправлено помилку, через яку таланти на покращення Зореламу (Starbreaker), Запального варива (Cinder Brew), Фантомного поспіху (Phantom Rush) та Силових шестерень (Power Cogs) не з’являлися в разі вибору оригінальним героєм.",
      "[*]Виправлено помилку, через яку Шукач смерті (Death Seeker) не перемикався гарячою клавішею.",
      "[*]Виправлено помилку, через яку Поклик пращурів (Call of the Wild) не перемикався між соколом і кнуром.",
      "[*]Виправлено помилку, через яку здібність Клубок голок (Hairball) з’являлася без можливості перемикання.",
      "[*]Виправлено помилку, через яку Хімічний сказ (Chemical Rage) зі Скіпетром Аґаніма не збільшував шкоду й посилення чарів.",
      "[*]Виправлено помилку, через яку Кидок рогом (Horn Toss) давався Уламком Аґаніма, а не Скіпетром.",
      "[*]Виправлено помилку, через яку Дощ долі (Rain of Destiny) давався Скіпетром Аґаніма, а не Уламком.",
      "[*]Виправлено помилку, через яку Бумеранг (Boomerang) і Приманка (Decoy) Головоріза давалися як за Скіпетр Аґаніма, так і за Уламок.",
      "[*]Виправлено помилку, через яку Лісопил отримував другий Чакрам зі Скіпетром Аґаніма. Тепер він дається лише як талант, якщо Лісопил вибрав здібність Чакрам (Chakram).",
      "[/list]"
    ],
    "commentcount": 1067,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 9610,
    "votedowncount": 1480,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1708471645,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 9610,
  "votes_down": 1480,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}