{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Драконовият дар",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Драконовият дар",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Работим усилено над предстоящо обновление, което наричаме „Crownfall“, и сме развълнувани да го довършим, за да можете да видите над какво сме се трудили. Огледахме календара и забелязахме, че са минали повече от няколко седмици откакто сме пуснали Frostivus обновлението, а не искахме да се налага да чакате чак до Crownfall, преди да получите някакво ново съдържание. За щастие, календарните богове ни озариха с поредния празник точно навреме… Честита Лунна Нова година!",
      "Хората, които са родени в годината на дракона, са известни със своята щедрост, благополучие и добър късмет. Сигурно е хубаво. За онези от нас, които си нямат магически дракон, предоставящ ни суперсили за раздаване на подаръци, представихме тематичен Dragon's Gift в червен плик, достъпен отсега до 07 март. Той до голяма степен действа така, както е наречен. Съкровища, които могат да бъдат давани и отваряни само от този, когото изберете за получател.",
      "А за онези от Вас, които предпочитат да не чакат, разчитайки на щедростта от другите, разполагаме с традиционни Dragon's Hoard съкровища. Всяко съкровище или подарък съдържа един от 17 нови козметични набора с тематика на Лунната Нова година, както и бонус шанс за Dragon's Gift или нов необичаен ефект.",
      "А за финал, всяко съкровище (и подарък) има шанс да съдържа The Ancient Dragon King. Първият козметичен артикул за Вашия Ancient с уникални стилове Dire и Radiant. Сега най-сетне ще разполагате с шанс да окичите своя Ancient с митичен дракон, точно както, вероятно, винаги сте искали. Плюс това, ако някой в мача Ви разполага с такъв козметичен артикул, всеки ще може да го вижда.",
      "В съответствие с тематиката на „дарителския дух“, имаме още един подарък за (почти) всеки. Пуснахме малко нов код за засичане на измами. Е, всъщност го пуснахме преди няколко седмици и прекарахме времето, оттогава насам натрупвайки порядъчен набор от измамници. Вероятно ще забележите по-малко от тях в игрите си, когато встъпят вълните от автоматизирани забрани.",
      "По традиция, това обновление включва и редица други поправки и подобрения:",
      "[b]Общи поправки:[/b]",
      "[list]",
      "[*]Поправени са редица проблеми, които предотвратяваха зареждането на ръководствата в играта. Ако ръчно сте включили свалянията във фонов режим от Steam, за да се опитате да заобиколите този проблем, можете спокойно отново да преустановите това;",
      "[*]Roshan — поправен е пореден случай, при който можеше да се разхожда насам-натам, ако Night Stalker изпълнява Dark Ascension, докато Roshan задейства Twin Gate;",
      "[*]Аванпост — поправен е проблем, при който вече превзетите аванпостове можеха да бъдат изпълнявани;",
      "[*]Поправен е проблем, при който изборът за неутрални артикули се скриваше с освобождаването на клавиша под някои режими на бързо изпълняване;",
      "[*]Doubloon — поправено е, че разполагаше само с +2 вместо +2,5 реген. на мана;",
      "[*]Eternal Shroud — поправено е, че магическата устойчивост се прилагаше към илюзии;",
      "[*]Eternal Shroud — поправени са взаимодействията с Mana Shield на Medusa;",
      "[*]Safety Bubble — поправено е пояснението, което не споменаваше, че бариерата пренебрегва самостоятелно нанесените щети;",
      "[*]Shiva's Guard — поправен е проблем с ефектите;",
      "[*]Chen: Holy Persuasion — поправено е, че множителят за плячката от крийпове в Turbo не се вземаше предвид, когато се даваше златото при изпълняване;",
      "[*]Legion Commander: Aghanim's Shard — поправено е, че все още даваше бонус броня и времетраене за Overwhelming Odds;",
      "[*]Marci: Unleash — попарено е, че задействаше процедура при вземането и пускането на Bloodstone;",
      "[*]Muerta: Gunslinger — поправено е, че позволяваше прочистване;",
      "[*]Ogre Magi: Multicast — поправено е, че клавишната комбинация не работеше за подобряване;",
      "[*]Phantom Lancer — поправена е грешка, която позволяваше неактивни илюзии да блокират неутралните лагери;",
      "[*]Primal Beast: Uproar — поправено е, че причиняваше рядък сървърен срив;",
      "[*]Поправено е, че изгледът с колони за разположението на магазина не изобразяваше Khanda и Harpoon;",
      "[*]Добавена е магическа устойчивост от интелекта и са увеличени щетите за универсалните герои към разширените пояснения;",
      "[*]В Turbo съобщението „[Име на герой] беше избран и от двата отбора!“ вече се показва на всички, а не само на играча, който опитва да избере вече зает герой;",
      "[*]Windranger: Gale Force — добавени са икони на заклинанията, когато се използва Compass of the Rising Gale;",
      "[*]Повишена е производителността при изобразяване на много чат съобщения от глобални канали;",
      "[*]Поправени са разнообразни проблеми с поясненията;",
      "[*]Обновени са поясненията, показани по време на паузата за игрално обновление 7.35b.",
      "[/list]",
      "[b]Ability Draft поправки:[/b]",
      "[list]",
      "[*]Вече се предоставят редица умения от Aghanim's Scepter/Shard, които преди това бяха недостъпни. Някои от тях стават достъпни чрез превключване на авт. изпълняване на базовото заклинание:",
      "[list]",
      "[*]Glacier — предоставя се с Marksmanship;",
      "[*]Crystal Clone — предоставя се с Frostbite;",
      "[*]Parting Shot — предоставя се с Pierce the Veil;",
      "[*]Work Horse — предоставя се със Stampede;",
      "[*]Burning Barrage — предоставя се със Skeleton Walk;",
      "[*]Friendly Shadow — предоставя се със Shadow Walk;",
      "[*]Counterspell Ally — предоставя се с Counterspell;",
      "[*]Lightning Hands — предоставя се с Arc Lightning;",
      "[*]Burning Army — предоставя се с Death Pact;",
      "[*]Unrefined Fireblast — предоставя се с Fireblast;",
      "[*]Poison Nova — предоставя се с Noxious Plague (пасивното умение на Poison Nova е скрито).",
      "[/list]",
      "[*]Chemical Rage — вече предоставя Greevil's Greed. Ще се появява като бъф вместо в лентата с уменията;",
      "[*]Spirit Bear — поправено е, че не разполагаше с никакви умения;",
      "[*]Blinding Light — поправено е, че не се появяваше като умение за подбор;",
      "[*]Alchemist — поправено е, че разполагаше с 4 базови умения при подбор, което изместваше останалите с една позиция;",
      "[*]Cloak and Dagger с Aghanim's Shard — вече не предоставя Sleeping Dart;",
      "[*]Ravage с Aghanim's Shard — вече предоставя Dead in the Water вместо Tendrils of the Deep;",
      "[*]Invoker: Ability Draft с Aghanim's Shard — обновено е до новото E.M.P. с Aghanim's Shard вместо старото Meteor с Aghanim's Shard;",
      "[*]Proximity Mines — вече предоставя Minefield Sign като допълнително умение;",
      "[*]Shadow Wave и Dream Coil с Aghanim's Scepter — поправено е, че атаките не работеха върху ръкопашни герои;",
      "[*]Spirits — поправено е, че работеше върху илюзии, когато разполагате с Aghanim's Scepter;",
      "[*]Ogre Magi — поправено е, че получаваше Multicast вместо Dumb Luck като присъщо;",
      "[*]Primal Spring, Pulse Nova, Rot, Infernal Blade и редица други умения — поправено е, че не предоставяха натрупвания на Fiery Soul;",
      "[*]Starbreaker, Cinder Brew, Phantom Rush и Power Cogs — поправено е, че талантите не се появяваха, когато умението е подбрано на оригиналния за него герой;",
      "[*]Death Seeker — поправено е, че не можеше да бъде превключвано с бързия клавиш;",
      "[*]Call of the Wild Hawk — поправена е неспособността да се превключва между Hawk и Boar;",
      "[*]Hairball — поправено е появяването без бърз клавиш, докато не бъде превключено;",
      "[*]Chemical Rage с Aghanim's Scepter — поправено е, че не даваше бонус щети и усилване на заклинанията;",
      "[*]Horn Toss — поправено е, че се даваше от Aghanim's Shard вместо Aghanim's Scepter;",
      "[*]Rain of Destiny — поправено е, че се даваше от Aghanim's Scepter вместо Aghanim's Shard;",
      "[*]Hunter's Boomerang и Decoy — поправено е, че се даваха от Aghanim's Shard или Aghanim's Scepter;",
      "[*]Timbersaw — поправено е, че получаваше Second Chakram с Aghanim's Scepter. Вече се предоставя само с таланта, ако Timbersaw подбере Chakram.",
      "[/list]"
    ],
    "commentcount": 1067,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 9609,
    "votedowncount": 1480,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1708471508,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 9610,
  "votes_down": 1480,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}