{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Het geschenk van de draak",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Het geschenk van de draak",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "We werken momenteel hard aan een nieuwe update en kijken ernaar uit om het eindresultaat met jullie te delen. De naam kunnen we alvast verklappen: Crownfall. Een blik op de kalender vertelt ons ook dat de vorige update (Frostivus) al een tijdje geleden is uitgekomen. En omdat Crownfall nog niet helemaal klaar is, wilden we jullie niet langer laten wachten op wat nieuwe inhoud. Gelukkig zorgden de kalendergoden voor een oplossing met een feestdag precies in het midden: gelukkig nieuw maanjaar!",
      "Ben je geboren in het jaar van de draak? Dan sta je bekend om je vrijgevigheid, voorspoed en geluk. Leuk voor jou. Voor alle anderen die geen magische draak hebben die hun superkrachten geeft, introduceren we The Dragon's Gift, geïnspireerd op de welbekende rode envelopjes, beschikbaar vanaf nu tot 7 maart. Deze cadeautjes hebben een bijzondere eigenschap: het zijn schatten die je alleen kunt weggeven en die alleen geopend kunnen worden door de gelukkige ontvanger die jij hebt gekozen.",
      "Wacht je liever niet eindeloos op de vrijgevigheid van anderen? Dan zijn er ook de traditionele draakschatten. Elke schat of elk geschenk bevat een van de 17 nieuwe cosmetische sets met het nieuwe maanjaar als thema. Bovendien maak je als bonus kans op een Dragon's Gift of een nieuw bijzonder effect.",
      "Tot slot maak je met iedere schat en elk geschenk kans op de Ancient Dragon King, de eerste cosmetica ooit voor je Ancient, met unieke stijlen voor Dire en Radiant. Daarmee heb je nu de kans om te doen wat je waarschijnlijk altijd al wou: je Ancient versieren met een mythische draak. Als er ook maar één speler in je spel is die de draak heeft weten te bemachtigen, kan iedereen hem zien.",
      "Nu we toch in een vrijgevige bui zijn, hebben we nóg een cadeautje voor (bijna) iedereen. We hebben wat nieuwe code uitgebracht om valsspelen te detecteren. Dit hebben we eigenlijk een aantal weken terug al gedaan en we hebben sindsdien al een indrukwekkend aantal valsspelers weten te verzamelen. Naarmate we de automatische verbanningen uitvoeren, kom je ze nu waarschijnlijk minder vaak tegen tijdens het spelen.",
      "Zoals gebruikelijk bevat deze update ook een aantal andere oplossingen en verbeteringen:",
      "[b]Algemene opgeloste problemen:[/b]",
      "[list]",
      "[*]Aantal problemen opgelost waardoor gidsen niet konden worden geladen in het spel (als je downloads op de achtergrond had ingeschakeld in Steam om dit probleem te omzeilen, kun je deze optie weer uitschakelen).",
      "[*]Probleem opgelost waarbij Roshan weer over de map kon lopen. Dit kon gebeuren als Night Stalker Dark Ascension gebruikte op Roshan terwijl hij een Twin Gate had opgeroepen.",
      "[*]Probleem opgelost waarbij buitenposten die al veroverd waren, nog opgeroepen konden worden.",
      "[*]Probleem opgelost waarbij het keuzevenster voor neutrale items soms verborgen werd als de toets werd losgelaten bij het gebruik van sneltoetsen voor snel gebruik.",
      "[*]Probleem opgelost waarbij Doubloon een manaherstel van +2 had in plaats van +2,5.",
      "[*]Probleem opgelost waarbij de magieweerstand van Eternal Shroud werd toegepast op illusies.",
      "[*]Probleem opgelost met de interactie tussen Eternal Shroud en het Mana Shield van Medusa.",
      "[*]Tooltip van Safety Bubble aangepast zodat er wordt vermeld dat schade die een speler aan zichzelf toebrengt, niet door de barrière wordt geblokkeerd.",
      "[*]Probleem opgelost met de effecten op Shiva's Guard.",
      "[*]Probleem opgelost waarbij Holy Persuasion van Chen bij het verdelen van goudpremies geen rekening hield met de premievermenigvuldiger voor creeps in de Turbo-modus.",
      "[*]Probleem opgelost waarbij er nog steeds bonuspantser en -duur werden toegekend bij Overwhelming Odds van Legion Commander met Aghanim's Shard.",
      "[*]Probleem opgelost waarbij Unleash van Marci werd geactiveerd bij het oppakken en laten vallen van Bloodstone.",
      "[*]Probleem opgelost waarbij Gunslinger van Muerta gezuiverd kon worden.",
      "[*]Probleem opgelost waarbij de gekoppelde sneltoets voor het upgraden van Multicast van Ogre Magi niet werkte.",
      "[*]Probleem opgelost waarbij inactieve illusies van Phantom Lancer neutrale kampen konden blokkeren.",
      "[*]Zeldzame servervrash opgelost die zich kon voordoen bij Uproar van Primal Beast.",
      "[*]Probleem opgelost waarbij Khanda en Harpoen niet werden weergegeven in de kolomlay-out voor de winkel.",
      "[*]Magieweerstand, verkregen door intelligentie, en verhoogde schade toegevoegd aan de uitgebreide tooltips voor universele helden.",
      "[*]In Turbo-modus wordt het bericht dat een held door beide teams werd gekozen vanaf nu getoond aan iedereen en niet enkel aan de speler die de reeds gekozen held probeert te kiezen.",
      "[*]Spreukpictogrammen toegevoegd voor Gale Force van Windranger wanneer Compass of the Rising Gale wordt gebruikt.",
      "[*]Verbeterde prestaties bij het weergeven van veel chatberichten uit internationale kanalen.",
      "[*]Verschillende problemen met tooltips opgelost.",
      "[*]De tips die worden getoond tijdens een gepauzeerd spel, zijn bijgewerkt voor gameplayupdate 7.35b.",
      "[/list]",
      "[b]Opgeloste problemen in de modus Vaardigheidstrekking:[/b]",
      "[list]",
      "[*]Een aantal vaardigheden van Aghanim's Scepter/Shard die eerder niet beschikbaar waren, kunnen nu worden toegekend. Sommige vaardigheden zijn toegankelijk door automatisch uitvoeren in te schakelen voor de basisvaardigheid:",
      "[list]",
      "[*]Glacier wordt toegekend met Marksmanship.",
      "[*]Crystal Clone wordt toegekend met Frostbite.",
      "[*]Parting Shot wordt toegekend met Pierce the Veil.",
      "[*]Work Horse wordt toegekend met Stampede.",
      "[*]Burning Barrage wordt toegekend met Skeleton Walk.",
      "[*]Friendly Shadow wordt toegekend met Shadow Walk.",
      "[*]Counterspell Ally wordt toegekend met Counterspell.",
      "[*]Lightning Hands wordt toegekend met Arc Lightning.",
      "[*]Burning Army wordt toegekend met Death Pact.",
      "[*]Unrefined Fireblast wordt toegekend met Fireblast.",
      "[*]Poison Nova wordt nu toegekend met Noxious Plague (de passieve vaardigheid van Poison Nova wordt niet getoond).",
      "[/list]",
      "[*]Greevil's Greed wordt nu toegekend door Chemical Rage. Het verschijnt nu als buff en niet meer op de balk met vaardigheden.",
      "[*]Probleem opgelost waarbij Spirit Bear geen vaardigheden had.",
      "[*]Probleem opgelost waarbij Blinding Light niet verscheen als vaardigheid die je kunt kiezen.",
      "[*]Probleem opgelost waarbij Alchemist uit vier basisvaardigheden kon kiezen, waardoor de andere vaardigheden een plaats opschoven.",
      "[*]Sleeping Dart wordt niet langer toegekend door Cloak and Dagger met Aghanim's Shard.",
      "[*]In plaats van Tendrils of the Deep, wordt nu Dead in the Water toegekend door Ravage met Aghanim's Shard.",
      "[*]De vaardigheid voor Invoker met Aghanim's Shard in Vaardigheidstrekking, is vanaf nu de nieuwe E.M.P. in plaats van de oude Chaos Meteor.",
      "[*]Minefield Sign wordt nu toegekend door Proximity Mines als extra vaardigheid.",
      "[*]Probleem opgelost waarbij aanvallen met Shadow Wave en Dream Coil met Aghanim's Scepter niet werkten op meleehelden.",
      "[*]Probleem opgelost waarbij Spirits werkten op illusies als je in het bezit was van Aghanim's Scepter.",
      "[*]Probleem opgelost waarbij Ogre Magi Multicast kreeg in plaats van Dumb Luck als eigen vaardigheid.",
      "[*]Probleem opgelost waarbij Primal Spring, Pulse Nova, Rot, Infernal Blade en een aantal andere vaardigheden geen ladingen voor Fiery Soul meer toekenden.",
      "[*]Probleem opgelost waarbij talenten niet verschenen voor Starbreaker, Cinder Brew, Phantom Rush en Power Cogs als de vaardigheid was gekozen voor hun oorspronkelijke held.",
      "[*]Probleem opgelost waarbij Death Seeker niet met een sneltoets kon worden gebruikt.",
      "[*]Probleem opgelost waarbij er niet kon worden gewisseld tussen Hawk en Boar met een sneltoets voor Call of the Wild Hawk.",
      "[*]Probleem opgelost waarbij Hairball verscheen zonder sneltoets totdat de vaardigheid werd in- en uitgeschakeld.",
      "[*]Probleem opgelost waarbij Chemical Rage met Aghanim's Scepter geen bonusschade en spreukversterking gaf.",
      "[*]Probleem opgelost waarbij Horn Toss werd toegekend door Aghanim's Shard in plaats van door Aghanim's Scepter.",
      "[*]Probleem opgelost waarbij Rain of Destiny werd toegekend door Aghanim's Scepter in plaats van door Aghanim's Shard.",
      "[*]Probleem opgelost waarbij Hunter's Boomerang en Decoy werden toegekend door zowel Aghanim's Shard als Aghanim's Scepter.",
      "[*]Probleem opgelost waarbij Timbershaw Second Chakram kreeg door Aghanim's Scepter. Vanaf nu wordt deze vaardigheid alleen toegekend met het talent als Timbershaw Chakram kiest.",
      "[/list]"
    ],
    "commentcount": 1127,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 12092,
    "votedowncount": 1787,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1710287651,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12092,
  "votes_down": 1787,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}