{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Lohikäärmeen lahja",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Lohikäärmeen lahja",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Työn alla on Kruununkaappaus-päivitys, jonka haluaisimme jo kovasti päästä esittelemään teille. Frostivus-päivityksestä on jo muutama viikko aikaa, emmekä halua, että joudut odottamaan uutta sisältöä Kruununkaappaukseen saakka. Onneksi kalenteriin osuu juuri sopivasti kiinalainen uusi vuosi!",
      "Lohikäärmeen vuonna syntyneet tunnetaan anteliaina, vauraina ja onnekkaina. Mahtaa olla mukavaa. Meille muille, joita maaginen lahjoja antava lohikäärme ei ole siunannut supervoimilla, tarjolla on 7.3. saakka Lohikäärmeen lahja. Lahjat toimivat, kuten nimi antaa olettaa. Niitä annetaan lahjaksi, ja vain lahjansaaja voi avata ne.",
      "Jos ei malta odotella, että saisi lahjoja muilta, voi turvautua perinteisiin Lohikäärmeen kätkö -aarteisiin. Jokainen aarre ja lahja sisältää yhden 17 uudesta kiinalaisen uuden vuoden esinekokoelmasta. Lisäksi tarjolla on mahdollisuus saada Lohikäärmeen lahja tai uusi epätavallinen tehoste.",
      "Jokaisesta aarteesta ja lahjasta on myös mahdollista löytää Muinainen lohikäärmekuningas, kaikkien aikojen ensimmäinen muinaislinnoituksen kosmeettinen esine, joka sisältää ainutlaatuiset tyylit Radiantille ja Direlle. Toiveesi toteutuu ja voit viimeinkin koristella muinaislinnoituksen myyttisellä lohikäärmeellä. Jos pelissä jollain on sellainen, kaikki näkevät sen myös.",
      "Samassa hengessä tarjolla on myös melkein jokaiselle toinenkin lahja: huijausohjelmat tunnistava koodi. Itse asiassa se otettiin käyttöön jo muutama viikko sitten, minkä jälkeen verkkoon on tarttunut jo iso liuta huijareita. Huijareita tulee näkymään peleissä harvemmin, kun automaattiset pelikiellot otetaan käyttöön.",
      "Lisäksi tämä päivitys sisältää tuttuun tapaan lukuisia korjauksia ja parannuksia:",
      "[b]Yleiskorjaukset[/b]",
      "[list]",
      "[*]Korjattiin lukuisia ongelmia, jotka estivät pelinsisäisten oppaiden latautumisen. (Jos otit pelinaikaiset lataukset käyttöön Steamistä korjataksesi tämän ongelman, voit nyt huoletta kytkeä ne pois päältä.)",
      "[*]Korjattiin jälleen tapaus, jonka vuoksi Roshan saattoi lähteä kävelylle: Night Stalkerin Dark Ascensionin aktivointi Roshanin kanavoidessa kaksoisporttia.",
      "[*]Korjattiin virhe, jonka vuoksi jo vallattua vartiopistettä pystyi kanavoimaan.",
      "[*]Korjattiin virhe, jonka vuoksi neutraaliesinevalikko saattoi kadota, kun esinenäppäin vapautettiin joissakin pikakäyttötiloissa.",
      "[*]Korjattiin virhe, jonka vuoksi Doubloon antoi vain +2 mananpalautumista +2,5 mananpalautumisen sijaan.",
      "[*]Korjattiin virhe, jonka vuoksi Eternal Shroudin loitsunvastustus vaikutti harhoihin.",
      "[*]Korjattiin Eternal Shroudin virheelliset vuorovaikutukset Medusan Mana Shieldin kanssa.",
      "[*]Korjattiin Safety Bubblen kuvausteksti kertomaan, että sankarin itseensä tekemä vahinko ohittaa suojan.",
      "[*]Korjattiin Shiva's Guardin visuaaliset tehosteet.",
      "[*]Korjattiin virhe, jonka vuoksi Chenin Holy Persuasionin kultapalkkio ei ottanut Turbo-tilan kätyripalkkiokerrointa huomioon.",
      "[*]Korjattiin virhe, jonka vuoksi Legion Commanderin Aghanim's Shard -päivitys antoi Overwhelming Oddsille yhä lisäpanssaria ja -kestoa.",
      "[*]Korjattiin virhe, jonka vuoksi Marcin Unleash laukaisi paineaallon Bloodstonen poimimisesta ja pudottamisesta.",
      "[*]Korjattiin virhe, jonka vuoksi Muertan Gunslingerin pystyi puhdistamaan.",
      "[*]Korjattiin virhe, jonka vuoksi Ogre Magin Multicastin päivitysnäppäin ei toiminut.",
      "[*]Korjattiin virhe, jonka vuoksi Phantom Lancerin kuolleet harhat pystyivät estämään neutraalileirien syntymisen.",
      "[*]Korjattiin Primal Beastin Uproariin liittynyt harvinainen palvelimen kaatuminen.",
      "[*]Lisättiin kaupan sarakelajittelusta puuttuneet Khanda ja Harpoon.",
      "[*]Lisättiin älykkyydestä saatava loitsunvastustus ja yleissankarien piirteistään saama vahinko laajennettuihin esinekuvausteksteihin.",
      "[*]Turbo-tilan sankarivalinta näyttää nyt Molemmat tiimit valitsivat -tekstin kaikille eikä vain sankarin valintaa yrittäneelle pelaajalle.",
      "[*]Lisättiin uusi kykykuvake Windrangerin Gale Forcelle Nousevan tuulen kompassia käytettäessä.",
      "[*]Parannettiin suorituskykyä lukuisien chatkanavien viestejä näytettäessä.",
      "[*]Korjattiin useita kykykuvausvirheitä.",
      "[*]Päivitettiin pysäytetyn pelin vihjetekstit vastaamaan 7.35b-pelipäivitystä.",
      "[/list]",
      "[b]Kykyvalintakorjaukset[/b]",
      "[list]",
      "[*]Lukuisat aikaisemmin käyttämättömissä olleet Scepter- ja Shard-kyvyt ovat nyt käytettävissä. Osa kyvyistä valitaan pohjakyvyn erityiskäytöllä:",
      "[list]",
      "[*]Marksmanship antaa nyt Glacierin.",
      "[*]Frostbite antaa nyt Crystal Clonen.",
      "[*]Pierce the Veil antaa nyt Parting Shotin.",
      "[*]Stampede antaa nyt Work Horsen.",
      "[*]Skeleton Walk antaa nyt Burning Barragen.",
      "[*]Shadow Walk antaa nyt Friendly Shadowin.",
      "[*]Counterspell antaa nyt Counterspell Allyn.",
      "[*]Arc Lightning antaa nyt Lightning Handsin.",
      "[*]Death Pact antaa nyt Burning Armyn.",
      "[*]Fireblast antaa nyt Unrefined Fireblastin.",
      "[*]Noxious Plague antaa nyt Poison Novan (Poison Novan passiivinen kyky pysyy piilossa).",
      "[/list]",
      "[*]Chemical Rage antaa nyt Greevil's Greedin. Se näkyy sankarivahvistuksena passiivisen kyvyn sijaan.",
      "[*]Korjattiin virhe, jonka vuoksi Spirit Bearilla ei ollut kykyjä.",
      "[*]Korjattiin virhe, jonka vuoksi Blinding Light ei esiintynyt valittavana kykynä.",
      "[*]Korjattiin virhe, jonka vuoksi Alchemistilla oli neljä valittavaa peruskykyä, jonka vuoksi kaikki sen jälkeiset rivit olivat epätasaisia.",
      "[*]Cloak and Daggerin Shard-päivitys ei enää anna Sleeping Dartia.",
      "[*]Ravagen Shard-päivitys antaa nyt Dead in the Waterin Tendrils of the Deepin sijaan.",
      "[*]Päivitettiin Invokerin kykyvalinnan Shard-päivitys uuteen EMP:n Shard-päivitykseen vanhan Chaos Meteor -päivityksen sijaan.",
      "[*]Proximity Minesit antavat nyt myös Minefield Signin.",
      "[*]Korjattiin virhe, jonka vuoksi Shadow Waven ja Dream Coilin Scepter-päivitysten lisähyökkäykset eivät toimineet lähitaistelusankareilla.",
      "[*]Korjattiin virhe, jonka vuoksi Spiritsin Scepter-päivitys toimi harhoilla.",
      "[*]Korjattiin virhe, jonka vuoksi Ogre Magi sai Multicastin lisäkyvykseen Dumb Luckin sijaan.",
      "[*]Korjattiin virhe, jonka vuoksi Primal Spring, Pulse Nova, Rot, Infernal Blade ja lukuisat muut kyvyt eivät antaneet Fiery Soul -kertymiä.",
      "[*]Korjattiin virhe, jonka vuoksi Starbreaker, Cinder Brew, Phantom Rush ja Power Cogs eivät antaneet niille kuuluneita taitopäivityksiä, kun taidon omistavat sankarit valitsivat kyvyn.",
      "[*]Korjattiin virhe, jonka vuoksi Death Seekeriä ei voinut valita näppäinkomennolla.",
      "[*]Korjattiin virhe, jonka vuoksi Call of the Wild ei pystynyt vaihtamaan haukan ja villisian välillä.",
      "[*]Korjattiin virhe, jonka vuoksi Hairball ei saanut pikanäppäintä, ennen kuin sen kytki päälle.",
      "[*]Korjattiin virhe, jonka vuoksi Chemical Ragen Scepter-päivitys ei antanut hyökkäys- ja kykyvahinkolisää.",
      "[*]Korjattiin virhe, jonka vuoksi Horn Tossin sai Reverse Polarityn Shard-päivityksellä Scepterin sijaan.",
      "[*]Korjattiin virhe, jonka vuoksi Rain of Destinyn sai False Promisen Scepter-päivityksellä Shardin sijaan.",
      "[*]Korjattiin virhe, jonka vuoksi Hunter's Boomerangin ja Decoyn sai Sharpshooterin Shard- ja Scepter-päivityksillä Scepterin ja Shardin sijaan.",
      "[*]Korjattiin virhe, jonka vuoksi Timbersaw sai toisen Chakramin Scepter-päivityksellään. Nyt sen voi saada vain, jos Timbersaw valitsee Chakramin ja tason 25 taitopäivityksen.",
      "[/list]"
    ],
    "commentcount": 727,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "mod_require_rereview"
    ],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 3632,
    "votedowncount": 648,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1707511502,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707433100,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 3632,
  "votes_down": 648,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}