{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "อั่งเปาปีมะโรง",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707432002
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "อั่งเปาปีมะโรง",
    "posttime": 1707432004,
    "updatetime": 1707432004,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "เรากำลังมุ่งมั่นพัฒนาอัปเดตที่กำลังจะมาถึง ซึ่งจะมีชื่อเรียกว่า \"ศึกบัลลังก์วิบัติ\" และเรารู้สึกตื่นเต้นที่จะพัฒนาให้เสร็จสิ้นเพื่อให้คุณได้สัมผัสผลงานของเรา โดยเราได้ดูปฏิทินและสังเกตเห็นว่าเวลาก็ได้ผ่านไปหลายสัปดาห์แล้วนับตั้งแต่อัปเดต Frostivus และไม่อยากให้คุณต้องรอนานจนกว่าจะได้รับเนื้อหาใหม่เมื่ออัปเดตศึกบัลลังก์วิบัติพร้อมเผยแพร่ ซึ่งก็โชคดีที่เทพเจ้าผู้กำหนดปฏิทินมาช่วยเพิ่มวันหยุดไว้อีกวันพอดี สุขสันต์วันตรุษจีน!",
      "เค้าว่ากันว่าคนปีมะโรงจะมาพร้อมกับความเอื้ออาทร ความมั่งคั่ง และโชคลาภ จะเฮงไปไหน แต่สำหรับชาวเราผู้ที่ไม่มีมังกรมาประทานพรให้ เราขอนำเสนออั่งเปาปีมะโรงด้วยธีมซองสีแดง เริ่มแจกกันได้ตั้งแต่ตอนนี้จนถึง 7 มีนาคม เวลาแปซิฟิก อั่งเปาเหล่านี้เป็นไปตามชื่อที่ถูกตั้งไว้: สมบัติล้ำค่าที่สามารถมอบให้ และเปิดได้โดยใครก็ตามที่คุณเลือกให้เป็นผู้รับเท่านั้น",
      "และสำหรับคนที่ไม่อยากรอรับทรัพย์จากผู้อื่น เรายังมีสมบัติขุมทรัพย์มะโรงด้วยเช่นกัน สมบัติหรืออั่งเปาแต่ละชิ้นจะบรรจุหนึ่งในชุดเซ็ตแต่งกายธีมตรุษจีนจากทั้งหมด 17 ชุด พร้อมกับโอกาสพิเศษที่จะได้รับอั่งเปาปีมะโรงหรือเอฟเฟกต์ Unusual แบบใหม่",
      "สุดท้ายนี้ สมบัติ (และของขวัญ) ทุกชิ้นจะมีโอกาสบรรจุ Ancient Dragon King ซึ่งเป็นของตกแต่งชิ้นแรกสำหรับ Ancient ของคุณ มาพร้อมรูปแบบ Dire และ Radiant พิเศษเฉพาะ ตอนนี้ในที่สุดคุณก็มีโอกาสได้ตกแต่ง Ancient ของคุณด้วยมังกรในตำนาน เหมือนกับที่คุณคงต้องการเสมอมา (ใช่ไหม) นอกจากนี้ หากใครก็ตามที่อยู่ในแมตช์ของคุณมีไอเท็มนี้ ทุกคนก็จะสามารถเห็นได้",
      "เพื่อเป็นการเฉลิมฉลองเทศกาลแห่งการให้นี้ เรายังมีของขวัญอีกชิ้นสำหรับ (เกือบ) ทุกคน: เราได้เริ่มใช้งานโค้ดตรวจจับการโกงใหม่ ซึ่งที่จริงแล้ว เราได้เริ่มใช้งานไปตั้งแต่หลายสัปดาห์ก่อนแล้ว และเราได้ใช้เวลาตั้งแต่ตอนนั้นในการเก็บรายชื่อคนโกงมากมาย คุณอาจพบคนโกงในเกมของคุณน้อยลงเมื่อระบบการแบนอัตโนมัติเริ่มทำงาน",
      "ตามธรรมเนียม อัปเดตนี้ยังรวมถึงการแก้ไขและการปรับปรุงอื่น ๆ อีกหลายรายการ:",
      "[b]การแก้ไขทั่วไป:[/b]",
      "[list]",
      "[*]แก้ไขปัญหาหลายประการที่ทำให้ไม่สามารถโหลดคู่มือในเกมได้ (หากคุณเปิดใช้งานดาวน์โหลดเบื้องหลังบน Steam ด้วยตนเองเพื่อพยายามแก้ไขปัญหานี้ คุณสามารถกลับไปปิดตัวเลือกนี้ได้อย่างปลอดภัย)",
      "[*]แก้ไขอีกกรณีที่ทำให้ Roshan สามารถเดินท่องแผนที่: Night Stalker ร่าย Dark Ascension ขณะ Roshan กำลังยืนร่าย Twin Gate",
      "[*]แก้ไขปัญหา Outpost ที่ยึดครองแล้วยังคงสามารถยืนร่ายใส่ได้",
      "[*]แก้ไขปัญหาที่ตัวเลือกไอเท็มครีปป่าจะซ่อนตัวเมื่อปล่อยปุ่มขณะอยู่โหมดร่ายทันทีบางประเภท",
      "[*]แก้ไข Doubloon มีอัตราฟื้นฟูมานาเพียง +2 หน่วยแทนที่จะเป็น +2.5 หน่วย",
      "[*]แก้ไขความต้านทานเวทมนตร์ของ Eternal Shroud ที่มีผลต่อร่างเงา",
      "[*]แก้ไขการทำงานของ Eternal Shroud กับ Mana Shield ของ Medusa",
      "[*]แก้ไขคำอธิบายของ Safety Bubble ไม่ระบุว่าบาเรียจะไม่ป้องกันความเสียหายต่อตนเอง",
      "[*]แก้ไขปัญหาเกี่ยวกับเอฟเฟกต์ของ Shiva's Guard",
      "[*]แก้ไข Holy Persuasion ของ Chen ไม่คำนวณอัตราคูณค่าหัวครีปในโหมด Turbo ในการมอบโกลด์เมื่อร่าย",
      "[*]แก้ไข Aghanim's Shard ของ Legion Commander ยังคงเพิ่มเกราะป้องกันและระยะเวลาสำหรับ Overwhelming Odds",
      "[*]แก้ไข Unleash ของ Marci ทำงานเมื่อเก็บและดรอป Bloodstone",
      "[*]แก้ไข Gunslinger ของ Muerta สามารถลบล้างได้",
      "[*]แก้ไขการกำหนดปุ่มไม่สามารถใช้งานเพื่ออัปเกรด Multicast ของ Ogre Magi ได้",
      "[*]แก้ไขข้อบกพร่องที่ทำให้ร่างเงาของ Phantom Lancer ที่ไม่ได้ใช้งานแล้วยังคงบล็อคแคมป์ครีปป่า",
      "[*]แก้ไขปัญหาการแครชของเซิร์ฟเวอร์ซึ่งเกิดขึ้นไม่บ่อยนักที่เกี่ยวข้องกับ Uproar ของ Primal Beast",
      "[*]แก้ไขร้านค้าแบบคอลัมน์ไม่แสดง Khanda และ Harpoon",
      "[*]เพิ่มความต้านทานเวทมนตร์จาก Intelligence และพลังโจมตีที่เพิ่มขึ้นสำหรับฮีโร่ Universal ในคำอธิบายแบบละเอียด",
      "[*]ใน Turbo จะแสดงข้อความ \"[ฮีโร่] ได้ถูกเลือกโดยทั้งสองทีม!\" ให้เห็นทุกคน ไม่ใช่แค่ผู้เล่นที่พยายามเลือกฮีโร่ที่ถูกเลือกไปแล้ว",
      "[*]เพิ่มไอคอนสกิลสำหรับ Gale Force ของ Windranger เมื่อใช้ Compass of the Rising Gale",
      "[*]เพิ่มประสิทธิภาพเมื่อแสดงข้อความแช็ตจำนวนมากจากช่องทั่วโลก",
      "[*]แก้ไขปัญหาต่าง ๆ เกี่ยวกับคำอธิบาย",
      "[*]อัปเดตเคล็ดลับที่แสดงระหว่างการหยุดเกมชั่วคราวให้เป็นไปตามแพตช์เกมเพลย์ 7.35b",
      "[/list]",
      "[b]การแก้ไข Ability Draft:[/b]",
      "[list]",
      "[*]สกิลจาก Scepter/Shard หลายอย่างที่ก่อนหน้านี้ไม่สามารถใช้ได้ ต่อจากนี้จะมอบสกิลให้เมื่อดราฟต์สกิลพื้นฐาน สามารถเข้าถึงสกิลเหล่านี้ได้โดยการเปิด/ปิดการร่ายอัตโนมัติของสกิลพื้นฐาน:",
      "[list]",
      "[*]Glacier มอบให้เมื่อมี Marksmanship",
      "[*]Crystal Clone มอบให้เมื่อมี Frostbite",
      "[*]Parting Shot มอบให้เมื่อมี Pierce the Veil",
      "[*]Work Horse มอบให้เมื่อมี Stampede",
      "[*]Burning Barrage มอบให้เมื่อมี Skeleton Walk",
      "[*]Friendly Shadow มอบให้เมื่อมี Shadow Walk",
      "[*]Counterspell Ally มอบให้เมื่อมี Counterspell",
      "[*]Lightning Hands มอบให้เมื่อมี Arc Lightning",
      "[*]Burning Army มอบให้เมื่อมี Death Pact",
      "[*]Unrefined Fireblast มอบให้เมื่อมี Fireblast",
      "[*]Poison Nova มอบให้เมื่อมี Noxious Plague (สกิลติดตัว Poison Nova จะถูกซ่อนไว้)",
      "[/list]",
      "[*]Chemical Rage ต่อจากนี้มอบ Greevil's Greed โดยจะแสดงเป็นบัฟแทนไอคอนในแถบสกิล",
      "[*]แก้ไข Spirit Bear ไม่มีสกิลใด ๆ",
      "[*]แก้ไข Blinding Light ไม่แสดงเป็นสกิลที่ดราฟต์ได้",
      "[*]แก้ไข Alchemist มีสกิลพื้นฐาน 4 สกิลในหน้าดราฟต์ ซึ่งจะผลักสกิลอื่น ๆ ออกไปหนึ่งช่อง",
      "[*]Cloak and Dagger ที่อัปเกรดโดย Aghanim's Shard ไม่มอบ Sleeping Dart อีกต่อไป",
      "[*]Ravage อัปเกรดโดย Aghanim's Shard ต่อจากนี้จะมอบ Dead in the Water แทน Tendrils of the Deep",
      "[*]Aghanim's Shard ของ Invoker ใน Ability Draft อัปเดตเป็น EMP ที่อัปเกรดโดย Shard แบบใหม่แทน Meteor ที่อัปเกรดโดย Shard แบบเดิม",
      "[*]Proximity Mines ต่อจากนี้จะมอบ Minefield Sign เป็นสกิลเพิ่มเติม",
      "[*]แก้ไขการโจมตี Shadow Wave และ Dream Coil ที่อัปเกรดโดย Aghanim's Scepter ไม่ทำงานกับฮีโร่โจมตีระยะประชิด",
      "[*]แก้ไข Spirits มีผลกับร่างเงาเมื่อคุณมี Aghanim's Scepter",
      "[*]แก้ไข Ogre Magi ได้รับ Multicast เป็นสกิลที่มาพร้อมฮีโร่แทน Dumb Luck",
      "[*]แก้ไข Primal Spring, Pulse Nova, Rot, Infernal Blade และสกิลอื่น ๆ อีกหลายสกิลไม่มอบการซ้อนทับ Fiery Soul",
      "[*]แก้ไขทักษะพิเศษไม่แสดงสำหรับ Starbreaker, Cinder Brew, Phantom Rush และ Power Cogs เมื่อดราฟต์สกิลให้กับฮีโร่ดั้งเดิม",
      "[*]แก้ไข Death Seeker ไม่สามารถเปิด/ปิดได้โดยปุ่มลัด",
      "[*]แก้ไข Call of the Wild Hawk ไม่สามารถเปิด/ปิดได้เพื่อสลับระหว่างเหยี่ยวและหมูป่า",
      "[*]แก้ไข Hairball แสดงขึ้นมาโดยไม่มีปุ่มลัดจนกว่าจะเปิด/ปิด",
      "[*]แก้ไข Chemical Rage ที่อัปเกรดโดย Aghanim's Scepter ไม่เพิ่มพลังโจมตีหรือความเสียหายสกิล",
      "[*]แก้ไข Horn Toss ที่ได้รับจาก Aghanim's Shard แทน Aghanim's Scepter",
      "[*]แก้ไข Rain of Destiny ที่ได้รับจาก Aghanim's Scepter แทน Aghanim's Shard",
      "[*]แก้ไข Hunter's Boomerang และ Decoy ที่ได้รับจาก Aghanim's Shard หรือ Scepter",
      "[*]แก้ไข Timbersaw ที่ได้รับ Second Chakram จาก Aghanim's Scepter ต่อจากนี้จะได้รับจากทักษะพิเศษเมื่อ Timbersaw ดราฟต์ Chakram เท่านั้น",
      "[/list]"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1707432004,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}