{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Dragens gave",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dragens gave",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Vi jobber jevnt og trutt med en kommende oppdatering vi kaller «Crownfall», og gleder oss til å få den ferdig, så dere kan se det vi har jobbet med. Vi så på kalenderen og la merke til at det hadde vært en god del uker siden Frostivus-oppdateringen, og vi ville unngå at dere måtte vente helt til Crownfall før dere får nytt innhold. Heldigvis kom kalendergudene tilbake til oss med en annen helligdag akkurat i tide: Gledelig kinesisk nyttår!",
      "Folk som er fødte i dragens år, er kjente for raushet, velstand og godt hell. Må føles bra. For de av oss som ikke har en magisk drage som gir oss gavmilde superkrefter, har vi presentert Dragens gave – tilgjengelig fra nå og frem til 7. mars. Disse fungerer akkurat slik som navnet tilsier: skatter som kun kan gis bort, og som må åpnes av den bestemte mottakeren.",
      "Og for dere som foretrekker å ikke vente på andres gavmildhet, har vi også tradisjonelle gjenstander fra Dragens skatt også. Hver skatt eller gave inneholder ett av 17 unike pyntesett med tema fra kinesisk nyttår, og en ekstra sjanse for en Dragens gave eller en ny uvanlig effekt.",
      "Til slutt har hver skatt (og gave) en sjanse til å inneholde The Ancient Dragon King – den første pyntegjenstanden noensinne for Ancient-er, med unike stiler for Dire og Radiant. Nå har du endelig en sjanse til å pynte ancient-en med en mytisk drage, akkurat som du alltid har hatt lyst til (sannsynligvis). Og bare én spiller trenger å ha en for at alle skal kunne se den.",
      "I tråd med dette gavetemaet har vi også en annen gave til (nesten) alle: Vi har implementert en del ny kode for å oppdage juks. Faktisk gav vi dette ut for noen uker siden, og siden da har vi brukt tiden til å samle inn et stort utvalg med juksepaver. Du kommer sannsynligvis til å legge merke til færre av dem i kampene etter hvert som automatiske utestengelser utstedes.",
      "Tradisjonen tro inneholder også denne oppdateringen noen andre feilrettinger og forbedringer:",
      "[b]Generelle feilrettinger:[/b]",
      "[list]",
      "[*]Fikset flere problemer som kunne forhindre at veiledninger ble lastet i spillet (de som manuelt slo på bakgrunnsnedlastinger på Steam for å prøve å omgå dette problemet, kan trygt slå dette av igjen).",
      "[*]Fikset et annet tilfelle der Roshan kunne bestemme seg for å gå tur: Hvis Night Stalker brukte Dark Ascension mens Roshan kanaliserte en tvillingport.",
      "[*]Fikset et problem med at man kunne kanalisere utposter som allerede var blitt erobret.",
      "[*]Fikset et problem som gjorde at velgeren for nøytrale gjenstander ble skjult når man slapp tasten ved bruk av enkelte hurtigbrukmoduser.",
      "[*]Fikset at Doubloon kun hadde +2 istedenfor +2,5 manaregenerasjon.",
      "[*]Fikset at magiresistensen til Eternal Shroud ble påført illusjoner.",
      "[*]Fikset Eternal Shrouds interaksjoner med Medusas Mana Shield.",
      "[*]Fikset at verktøytipset til Safety Bubble ikke nevnte at barrieren omgår selvpåført skade.",
      "[*]Fikset et problem med effektene på Shiva's Guard.",
      "[*]Fikset at Chens Holy Persuasion ikke tok høyde for krypdusørmultiplikatoren i turbomodus når den gav gull ved bruk.",
      "[*]Fikset at Aghanim's Shard med Legion Commander fremdeles gav ekstra rustning og varighet til Overwhelming Odds.",
      "[*]Fikset at Marcis Unleash ble utløst når Bloodstone ble plukket opp og sluppet.",
      "[*]Fikset at Muertas Gunslinger kunne fordrives.",
      "[*]Fikset at tastebinding ikke fungerte for oppgradering av Ogre Magis Multicast.",
      "[*]Fikset en feil som gjorde at inaktive illusjoner av Phantom Lancer kunne blokker nøytrale leirer.",
      "[*]Fikset et sjelden tjenerkrasj med Primal Beasts Uproar.",
      "[*]Fikset at kolonneoppsett i butikken ikke viste Khanda og Harpoon.",
      "[*]La til magiresistens fra intelligens og økt skade for allsidige helter i utvidede verktøytips.",
      "[*]I turbomodus vises meldingen «[Helt] ble valgt av begge lag!» til alle, og ikke bare spilleren som prøvde å velge den allerede valgte helten.",
      "[*]La til formelikoner for Windrangers Gale Force ved bruk av Compass of the Rising Gale.",
      "[*]Forbedret ytelse ved visning av mange samtalemeldinger fra globale kanaler.",
      "[*]Fikset forskjellige problemer med verktøytips.",
      "[*]Oppdaterte tips ved pause i samsvar med spilloppdatering 7.35b.",
      "[/list]",
      "[b]Feilrettinger i Ability Draft:[/b]",
      "[list]",
      "[*]En rekke tidligere utilgjengelige Scepter-/Shard-evner tildeles nå, noen av dem kan du få tilgang til ved å veksle autobruk på grunnevnen:",
      "[list]",
      "[*]Glacier gis med Marksmanship.",
      "[*]Crystal Clone gis med Frostbite.",
      "[*]Parting Shot gis med Pierce the Veil.",
      "[*]Work Horse gis med Stampede.",
      "[*]Burning Barrage gis med Skeleton Walk.",
      "[*]Friendly Shadow gis med Shadow Walk.",
      "[*]Counterspell Ally gis med Counterspell.",
      "[*]Lightning Hands gis med Arc Lightning.",
      "[*]Burning Army gis med Death Pact.",
      "[*]Unrefined Fireblast gis med Fireblast.",
      "[*]Poison Nova gis med Noxious Plague (den passive evnen til Poison Nova er skjult).",
      "[/list]",
      "[*]Chemical Rage gir nå Greevil's Greed. Evnen vises som en styrkelse istedenfor i evnefeltet.",
      "[*]Fikset at Spirit Bear ikke hadde noen evner.",
      "[*]Fikset at Blinding Light ikke dukket opp som en valgmulighet.",
      "[*]Fikset at Alchemist hadde 4 grunnevner ved valg, som kunne skyve andre evner én til siden.",
      "[*]Cloak and Dagger med Shard gir ikke lenger Sleeping Dart.",
      "[*]Ravage med Shard gir nå Dead in the Water istedenfor Tendrils of the Deep.",
      "[*]Invoker med Shard i Ability Draft oppdatert til ny Shard for EMP istedenfor gammel Shard for Meteor.",
      "[*]Proximity Mines gir nå Minefield Sign som en ytterligere evne.",
      "[*]Fikset at Scepter-angrep med Shadow Wave og Dream Coil ikke fungerte på nærkamphelter.",
      "[*]Fikset at Spirits fungerte på illusjoner når man har Scepter.",
      "[*]Fikset at Ogre Magi fikk Multicast istedenfor Dumb Luck som medfødt evne.",
      "[*]Fikset at Primal Spring, Pulse Nova, Rot, Infernal Blade og en rekke andre evner ikke gav stabler med Fiery Soul.",
      "[*]Fikset at talenter for Starbreaker, Cinder Brew, Phantom Rush og Power Cogs ikke dukket opp når evnen velges på den opprinnelige helten.",
      "[*]Fikset at Death Seeker ikke kunne veksles med hurtigtast.",
      "[*]Fikset at man ikke kunne veksle Call of the Wild Hawk for å bytte mellom hauk og villsvin.",
      "[*]Fikset at Hairball ble vist uten en hurtigtast inntil den veksles.",
      "[*]Fikset at Chemical Rage med Scepter ikke gav ekstra skade og formelstyrkelse.",
      "[*]Fikset at Horn Toss ble gitt av Shard istedenfor Scepter.",
      "[*]Fikset at Rain of Destiny ble gitt av Scepter istedenfor Shard.",
      "[*]Fikset at Hunter's Boomerang og Decoy ble gitt av enten Shard eller Scepter.",
      "[*]Fikset at Timbersaw fikk Second Chakram med Scepter. Den gis nå kun med talentet hvis Timbersaw velger Chakram.",
      "[/list]"
    ],
    "commentcount": 1127,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 12092,
    "votedowncount": 1787,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1710287651,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12092,
  "votes_down": 1787,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}