{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Dragens gave",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dragens gave",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Vi arbejder ihærdigt på en kommende opdatering, som vi kalder for \"Crownfall\", og vi glæder os til at få den færdig, så du kan se, hvad vi har haft travlt med. Vi kiggede på en kalender og så, at det efterhånden er længe siden, vi udgav Frostivus-opdateringen, og vi ville ikke lade dig vente indtil Crownfall med at få nyt indhold. Heldigvis reddede kalenderguderne os lige i tide med en anden festlig lejlighed: Godt kinesisk nytår!",
      "Folk, som er født i dragens år, er kendetegnet ved deres generøsitet, fremgang og held. Det må være dejligt. For dem af os, som ikke har en magisk drage, der giver os gavegivende superkræfter, præsenterer vi hermed Dragens gave med rødt kuverttema, som er tilgængelig nu og frem til d. 7. marts. Det fungerer, som navnet antyder: skatte, som kun kan gives væk, og som skal åbnes af den, du vælger som modtager.",
      "Og for dem, som helst ikke vil vente på andres generøsitet, er der også traditionelle genstande fra Dragens skat. Hver skat eller gave indeholder ét af 17 nye kosmetiske sæt med kinesisk nytårstema og en ekstra chance for at få Dragens gave eller en ny usædvanlig effekt.",
      "Endelig har hver skat (og gave) chance for at indeholde Ancient Dragon King, som er den første kosmetiske genstand nogensinde til Ancients, med unikke Dire- og Radiant-stile. Nu har du endelig en god chance for at pynte din Ancient med en sagnomspunden drage, som du (antageligt) altid har ønsket dig. Og hvis nogen i en kamp har en, kan alle se den.",
      "I tråd med dette \"gavegivningstema\" har vi en gave mere til (næsten) alle: Vi har udrullet noget ny kode til registrering af snyd. Eller faktisk udrullede vi det for nogle uger siden, og siden da har vi fået samlet en ret stor gruppe snydere. Du vil nok se færre af dem i kampene, efterhånden som de automatiske udelukkelser bliver udstedt.",
      "Traditionen tro inkluderer denne opdatering også et antal andre rettelser og forbedringer:",
      "[b]Generelle rettelser:[/b]",
      "[list]",
      "[*]Rettede et antal problemer, som ville forhindre indlæsning af guider i spillet (hvis du manuelt har aktiveret download af Steam-baggrunde for at prøve at komme udenom dette problem, kan du roligt deaktivere det igen).",
      "[*]Rettede et andet tilfælde, hvor Roshan kunne vandre omkring: Hvis Night Stalker brugte Dark Ascension, mens Roshan kanaliserede en tvillingeport.",
      "[*]Rettede et tilfælde, hvor udkigstårne, som allerede var blevet erobret, kunne kanaliseres.",
      "[*]Rettede et problem med, at den neutrale genstandsvælger blev skjult, når man slap tasten i visse hurtigkasttilstande.",
      "[*]Rettede, at Doubloon kun havde +2 i stedet for +2,5 mana-regenerering.",
      "[*]Rettede, at Eternal Shrouds magiske resistens blev påført på illusioner.",
      "[*]Rettede Eternal Shrouds interaktioner med Medusas Mana Shield.",
      "[*]Rettede, at tooltippet for Safety Bubble ikke nævnte, at selvpåført skade går gennem barrieren.",
      "[*]Rettede et problem med effekterne på Shiva's Guard.",
      "[*]Rettede, at Chens Holy Persuasion ikke tog højde for krybdusørsmultiplikatoren i Turbo-tilstand, når den gav guld ved brug.",
      "[*]Rettede, at Aghanim's Shard med Legion Commander stadig gav ekstra rustning og varighed for Overwhelming Odds.",
      "[*]Rettede, at Marcis Unleash aktiverede, når Bloodstone blev opsamlet og smidt.",
      "[*]Rettede, at Muertas Gunslinger kunne fjernes.",
      "[*]Rettede, at tastebinding ikke fungerede til opgradering af Ogre Magis Multicast.",
      "[*]Rettede en fejl, som gjorde, at inaktive illusioner fra Phantom Lancer kunne blokere neutrale lejre.",
      "[*]Rettede et sjældent servernedbrud med Primal Beasts Uproar.",
      "[*]Rettede, at kolonnelayoutet i butikken ikke viste Khanda og Harpoon.",
      "[*]Tilføjede magisk resistens fra intelligens og øgede skade for universelle helte til udvidede tooltips.",
      "[*]I Turbo-tilstand vises beskeden \"[Helt] blev valgt af begge hold!\" for alle, og ikke kun den spiller, som forsøgte at vælge en helt, som allerede var blevet valgt.",
      "[*]Tilføjede besværgelsesikon for Windrangers Gale Force ved brug af Compass of the Rising Gale.",
      "[*]Øgede ydeevnen ved visning af mange chatbeskeder fra globale kanaler.",
      "[*]Rettede diverse tooltips.",
      "[*]Opdaterede tips vises ved pause for spilopdatering 7.35b.",
      "[/list]",
      "[b]Rettelser i Ability Draft:[/b]",
      "[list]",
      "[*]Et antal tidligere utilgængelige Scepter-/Shard-evner er nu tilgængelige. Nogle evner kan tilgås ved at aktivere autokast på grundbesværgelsen:",
      "[list]",
      "[*]Glacier gives med Marksmanship.",
      "[*]Crystal Clone gives med Frostbite.",
      "[*]Parting Shot gives med Pierce the Veil.",
      "[*]Work Horse gives med Stampede.",
      "[*]Burning Barrage gives med Skeleton Walk.",
      "[*]Friendly Shadow gives med Shadow Walk.",
      "[*]Counterspell Ally gives med Counterspell.",
      "[*]Lightning Hands gives med Arc Lightning.",
      "[*]Burning Army gives med Death Pact.",
      "[*]Unrefined Fireblast gives med Fireblast.",
      "[*]Poison Nova gives med Noxious Plague (Poison Novas passive evne er skjult).",
      "[/list]",
      "[*]Chemical Rage giver nu Greevil's Greed. Den vises som en styrkelse i stedet for på evnebjælken.",
      "[*]Rettede, at Spirit Bear ikke havde nogen evner.",
      "[*]Rettede, at Blinding Light ikke blev vist som evne, der kunne vælges.",
      "[*]Rettede, at Alchemist havde 4 grundevner ved valg, hvilket skubbede andre evner én til siden.",
      "[*]Cloak and Dagger med Shard giver ikke længere Sleeping Dart.",
      "[*]Ravage med Shard giver nu Dead in the Water i stedet for Tendrils of the Deep.",
      "[*]Invoker med Shard i Ability Draft er blevet opdateret til den nye Shard for EMP i stedet for den gamle Shard for Meteor.",
      "[*]Proximity Mines giver nu Minefield Sign som en ekstra evne.",
      "[*]Rettede, at Scepter-angreb med Shadow Wave og Dream Coil ikke fungerede på nærkampshelte.",
      "[*]Rettede, at ånder ikke virkede på illusioner, når man havde Scepter.",
      "[*]Rettede, at Ogre Magi fik Multicast i stedet for Dumb Luck som medfødt evne.",
      "[*]Rettede, at Primal Spring, Pulse Nova, Rot, Infernal Blade og flere andre evner ikke gav stablinger af Fiery Soul.",
      "[*]Rettede, at talenter ikke blev vist for Starbreaker, Cinder Brew, Phantom Rush og Power Cogs, når evnen blev valgt på den oprindelige helt.",
      "[*]Rettede, at Death Seeker ikke kunne slås til/fra med genvejstast.",
      "[*]Rettede, at Call of the Wild Hawk ikke kunne skifte mellem Hawk og Boar.",
      "[*]Rettede, at Hairball blev vist uden en genvejstast, indtil den blev slået til/fra.",
      "[*]Rettede, at Chemical Rage med Scepter ikke gav bonusskade og evneamplifikation.",
      "[*]Rettede, at Horn Toss blev givet af Shard i stedet for Scepter.",
      "[*]Rettede, at Rain of Destiny blev givet af Scepter i stedet for Shard.",
      "[*]Rettede, at Hunter's Boomerang og Decoy blev givet af enten Shard eller Scepter.",
      "[*]Rettede, at Timbersaw fik Second Chakram med Scepter. Den gives nu kun med talentet, hvis Timbersaw vælger Chakram.",
      "[/list]"
    ],
    "commentcount": 1067,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 9609,
    "votedowncount": 1480,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1708471508,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 9610,
  "votes_down": 1480,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}