{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "El Regalo del Dragón",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707432002
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "El Regalo del Dragón",
    "posttime": 1707432004,
    "updatetime": 1707432004,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Nos pusimos a trabajar duro en la próxima actualización que llamamos \"La caída de la corona\", y nos emociona terminarla para que veas en lo que hemos estado trabajando. Vimos un calendario y nos dimos cuenta de que ya habían pasado algunas semanas desde la actualización de Frostivus, y no quisimos hacerte esperar hasta \"La caída de la corona\" para recibir contenido nuevo. Afortunadamente, los dioses del calendario enviaron otro feriado justo a tiempo: ¡Feliz Año Nuevo Lunar!",
      "La gente que nace en el año del Dragón es conocida por su generosidad, prosperidad y buena suerte. Eso es tener buena fortuna. Para quienes no tenemos un dragón mágico que nos conceda superpoderes de generosidad, presentamos: \"El regalo del dragón\", ya disponible hasta el 7 de marzo. Estos funcionan tal como lo dice su nombre: son tesoros que solo pueden ser regalados y ser abiertos por quien tú elijas como destinatario.",
      "Para aquellos desesperados que prefieren no esperar a recibir nada por la generosidad de otros, también tenemos riquezas tradicionales del Tesoro del dragón. Cada tesoro o regalo incluye uno de los 17 sets de aspectos nuevos con el tema del Año Nuevo Lunar y una oportunidad adicional para conseguir un regalo del dragón o nuevos efectos inusuales.",
      "Por último, cada uno de los tesoros (y regalos) tiene la posibilidad de incluir el Rey Dragón del Ancestro, que es el primer elemento cosmético disponible para tu Ancestro, con estilos únicos para el equipo Dire y Radiant. Finalmente, tendrás la oportunidad de adornar tu Ancestro con un dragón mitológico, justo y como (presumiblemente) siempre lo has querido. Además, si alguien tiene uno en tu partida, todos lo podrán ver.",
      "Siguiendo con el tema del \"espíritu de generosidad\", tenemos otro regalo para (casi) todo el mundo: Implementamos un código nuevo para la detección de trampas. Bueno, de hecho, lo lanzamos hace unas semanas, y desde entonces hemos estado recopilando un buen número de tramposos. Probablemente ya te hayas dado cuenta de que ahora el número de tramposos en tus partidas se redujo gracias a la implementación de oleadas de bloqueos automáticos.",
      "Como lo dicta la tradición, esta actualización incluye un número de correcciones y mejoras:",
      "[b]Correcciones generales:[/b]",
      "[list]",
      "[*]Se corrigieron una serie de problemas que impedían la carga de guías al cargarse la partida (si activaste manualmente las descargas de Steam en segundo plano para tratar de solucionar este problema, ya puedes volver a desactivarlas de nuevo).",
      "[*]Se corrigió otro caso en el que Roshan podía irse a dar un paseo mientras Night Stalker lanzaba Ascensión Oscura mientras Roshan estaba canalizando en un Portal Gemelo.",
      "[*]Se corrigió un problema con los puestos avanzados ya capturados que podían canalizarse.",
      "[*]Se corrigió un problema con el selector de objetos neutrales que se ocultaba al soltar la tecla cuando se usaban algunos de los modos de lanzamiento rápido.",
      "[*]Se corrigió Doblón que solamente tenía +2 de regeneración de maná en vez de +2.5.",
      "[*]Se corrigió la aplicación de resistencia mágica a las ilusiones de Manto Eterno.",
      "[*]Se corrigieron las interacciones de Manto Eterno con el Escudo de Maná de Medusa.",
      "[*]Se corrigió la descripción emergente de Burbuja de Seguridad que traspasaba el daño autoinfligido.",
      "[*]Se corrigió un problema con los efectos de Protección de Shiva.",
      "[*]Se corrigió Persuasión Sagrada de Chen ya no tomaba en cuenta el multiplicador de botín de creeps en modo Turbo cuando se otorga oro durante su lanzamiento.",
      "[*]Se corrigió que el Fragmento de Aghanim todavía le diera a Legion Commander armadura y duración adicionales con Probabilidades Adversas.",
      "[*]Se corrigió un problema con la habilidad Desatar de Marci, cuyos efectos eran activados al recoger o soltar una Piedra de Sangre.",
      "[*]Se corrigió Pistolera de Muerta que ya no es purgable.",
      "[*]Se corrigió el enlace de teclas que no funcionaba para actualizar Lanzamiento Múltiple de Ogre Magi.",
      "[*]Se corrigió un error que permitía que las ilusiones inactivas de Phantom Lancer bloquearan los campamentos neutrales.",
      "[*]Se corrigió bloqueo inusual de servidor con Rugido de Primal Beast.",
      "[*]Se corrigió el diseño de las columnas de la tienda que no mostraba Khanda y Arpón.",
      "[*]Se agregó resistencia mágica por inteligencia y se aumentó el daño para héroes universales a la información en descripciones emergentes.",
      "[*]En modo Turbo, se mostraba el mensaje: “¡[Héroe] fue elegido por ambos equipos!” para todos, no solo para el jugador que intentó elegir al héroe que ya había sido elegido.",
      "[*]Se agregaron íconos de hechizos para Fuerza del Vendaval de Windranger cuando se usa Brújula del Vendaval en Ascenso.",
      "[*]Se incrementó el rendimiento al desplegar muchos mensajes de chat de canales globales.",
      "[*]Se corrigieron varios errores con las descripciones emergentes.",
      "[*]Ahora aparecen los consejos actualizados al hacer una pausa en la partida con el parche de juego 7.35b.",
      "[/list]",
      "[b]Correcciones con el modo de selección de habilidades:[/b]",
      "[list]",
      "[*]Ahora se otorgan varias habilidades con el Cetro o Fragmento de Aghanim que antes no estaban disponibles. Es posible acceder a algunas habilidades al alternar el uso de autolanzamiento en el hechizo base:",
      "[list]",
      "[*]Glaciar otorgado con Puntería.",
      "[*]Clon de Crystal otorgado con Congelación.",
      "[*]Tiro de Despedida otorgado con Perforar el Velo.",
      "[*]Caballo de Trabajo otorgado con Estampida.",
      "[*]Aluvión Llameante otorgado con Movimiento Esquelético.",
      "[*]Sombra Amistosa otorgado con Movimiento Sombrío.",
      "[*]Contrahechizo para Aliado otorgado con Contrahechizo.",
      "[*]Manos Relámpago otorgado con Arco Eléctrico.",
      "[*]Ejército Ardiente otorgado con Pacto Mortal.",
      "[*]Explosión de Fuego Bruta otorgado con Explosión de Fuego.",
      "[*]Oleada Venenosa otorgada con Plaga Nociva (la habilidad pasiva de Oleada Venenosa está oculta).",
      "[/list]",
      "[*]Furia Química ahora otorga Avaricia de Greevil. Aparecerá como un efecto positivo en vez de estar en la barra de habilidades.",
      "[*]Se corrigió que Espíritu Oso no tuviera ninguna habilidad.",
      "[*]Se corrigió que Luz Cegadora no apareciera como habilidad seleccionable.",
      "[*]Se corrigió que Alchemist tuviera 4 habilidades básicas para seleccionar, con lo que se ocultaba una de las habilidades restantes.",
      "[*]Puñalada desde las Sombras ya no otorga Dardo Adormecedor con el Fragmento de Aghanim.",
      "[*]Ahora Devastar con Fragmento de Aghanim otorga Muerte entre las aguas en vez de Tentáculos de las Profundidades.",
      "[*]Al seleccionar habilidades, el Fragmento se aplica ahora a la habilidad P.E.M. de Invoker en lugar de a Meteorito.",
      "[*]Minas de Proximidad ahora otorga Señal de Campo de Minas como habilidad adicional.",
      "[*]Los ataques del Cetro de Aghanim con Onda Sombría y Espiral de Sueños ya funcionan sobre héroes cuerpo a cuerpo.",
      "[*]Se corrigieron los espíritus que funcionaban con las ilusiones cuando tenías el Cetro de Aghanim.",
      "[*]Se corrigió un problema por el cual Ogre Magi obtenía Lanzamiento Múltiple en lugar de Pura Suerte como habilidad innata.",
      "[*]Se corrigió Brinco Primordial, Pulso Nova, Pudrir, Hoja Infernal y otras habilidades que no otorgaban acumulaciones de Alma Ígnea.",
      "[*]Se corrigió la aparición de talentos para Quebrantaestrellas, Borrachera Abrasadora, Carrera Fantasma y Engranajes Electrificados cuando la habilidad se selecciona en su héroe original.",
      "[*]Se corrigió que Buscador de la Muerte no se pudiera alternar usando una tecla rápida.",
      "[*]Se corrigió un problema por el cual no se podía alternar Llamada del Halcón Salvaje para cambiar entre el halcón y el jabalí.",
      "[*]Se corrigió Bola de Pelo que aparecía sin una tecla de acceso directo hasta que se alternaba.",
      "[*]Se corrigió Furia Química que no otorgaba daño adicional ni amplificación de hechizos.",
      "[*]Se corrigió que Embestida fuera otorgado por el Fragmento de Aghanim en vez del Cetro de Aghanim.",
      "[*]Se corrigió que Lluvia del Destino fuera otorgada por el Cetro de Aghanim en vez del Fragmento de Aghanim.",
      "[*]Se corrigió que Búmeran o Señuelo fueran otorgados, ya sea con el Fragmento o el Cetro de Aghanim.",
      "[*]Se corrigió que Timbersaw obtuviera un segundo Chakram con el Cetro. Ahora solo se concede con el talento si Timbersaw selecciona un Chakram.",
      "[/list]"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1707432004,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}