{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "O presente do dragão",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "O presente do dragão",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Estamos a trabalhar arduamente na próxima atualização, chamada \"Crownfall\", e estamos em pulgas para a terminar e revelar o que temos andado a aprontar. Olhámos para o calendário e pensámos que, como já se passaram umas boas semanas desde a atualização de Frostivus, não queríamos que tivesses de esperar até ao lançamento de Crownfall para finalmente teres algum conteúdo novo. Por sorte, os deuses do calendário abençoaram‑nos com outra ocasião festiva mesmo a tempo: Feliz Ano Novo Lunar!",
      "As pessoas nascidas no Ano do Dragão são conhecidas pela sua generosidade, prosperidade e boa sorte. Que bom. Para as pessoas que não têm um dragão mágico pessoal que concede o superpoder que é oferecer presentes, apresentamos o \"Dragon's Gift\", um tesouro ao estilo de envelope vermelho, disponível até 7 de março. Funciona tal como imaginas: é um tesouro que só pode ser oferecido. O destinatário poderá depois abri‑lo.",
      "Já para quem prefere não ter de esperar pela generosidade dos outros, também temos tesouros tradicionais \"Dragon's Hoard\". Cada Dragon's Hoard e Gift contém um de 17 novos conjuntos temáticos do Ano Novo Lunar, com uma probabilidade adicional de conceder um Dragon's Gift ou um item com um novo efeito Inusual.",
      "Por último, cada Dragon's Hoard (e Gift) tem a probabilidade de conter o \"Ancient Dragon King\", o primeiro acessório para o Ancient, com variantes exclusivas dos Dire e dos Radiant. Agora tens finalmente a oportunidade de decorar o teu Ancient com um dragão mítico, como sempre desejaste (supomos nós). Além disso, desde que alguém na partida tenha um, todos os jogadores poderão vê-lo.",
      "Na continuidade deste tema do \"espírito de oferecer\", temos outro presente para (quase) toda a gente: implementámos novo código de deteção de cheats. Bem, na verdade, implementámos este código umas semanas atrás e temos andado desde então a identificar uma boa quantidade de batoteiros. Irás provavelmente encontrar menos nas tuas partidas à medida que o processo automático de banimentos continuar.",
      "Como é tradição, esta atualização também inclui várias outras correções e melhoramentos:",
      "[b]Correções gerais:[/b]",
      "[list]",
      "[*]Foram corrigidos vários bugs que impediam guias de serem carregados durante partidas (se ativaste manualmente a opção que permite downloads durante a execução de jogos nas definições do Steam para contornar este problema, podes desativá-la outra vez).",
      "[*]Foi corrigido outro caso em que o Roshan podia vaguear pelo mapa: quando o Night Stalker usava Dark Ascension enquanto o Roshan concentrava um Portal Geminado.",
      "[*]Foi corrigido um caso onde era possível concentrar Postos Avançados já capturados.",
      "[*]Foi corrigido um bug que fazia com que o menu de seleção de itens neutros fosse ocultado ao soltar teclas de atalho rápido.",
      "[*]Doubloon: foi corrigido um problema que fazia com que este item concedesse +2 de regeneração de mana em vez de +2,5.",
      "[*]Eternal Shroud: foi corrigido um caso em que ilusões beneficiavam do bónus de resistência a magia.",
      "[*]Eternal Shroud: foram corrigidas as interações entre este item e a habilidade Mana Shield, da Medusa.",
      "[*]Safety Bubble: a descrição foi atualizada para mencionar que dano autoinfligido ignora a barreira.",
      "[*]Shiva's Guard: foi corrigido um problema com os efeitos.",
      "[*]Chen: foi corrigido um problema com a habilidade Holy Persuasion, que não considerava o multiplicador de recompensa pela morte de creeps no modo Turbo ao conceder ouro.",
      "[*]Legion Commander: foi corrigido um problema com Aghanim's Shard, que ainda fazia com que Overwhelming Odds concedesse um bónus de armadura e tivesse uma duração maior.",
      "[*]Marci: foi corrigido um problema com a habilidade Unleash, cujos efeitos eram ativados ao apanhar e largar uma Bloodstone.",
      "[*]Muerta: foi corrigido um problema com a habilidade Gunslinger, que podia ser purgada.",
      "[*]Ogre Magi: foi corrigido um problema com o atalho para melhorar Multicast, que não estava a funcionar.",
      "[*]Phantom Lancer: foi corrigido um caso onde ilusões podiam bloquear acampamentos de creeps neutros.",
      "[*]Primal Beast: foi corrigida uma falha crítica rara do servidor que ocorria durante a utilização da habilidade Uproar.",
      "[*]Foi corrigida a disposição das colunas de itens na loja, que não incluía os itens Khanda e Harpoon.",
      "[*]Descrições expandidas agora incluem a indicação de resistência a magia por Inteligência e dano aumentado para heróis Universais.",
      "[*]Agora, no modo Turbo, a mensagem \"[Herói] foi escolhido(a) por ambas as equipas!\" é exibida para todos e não apenas para o jogador que tentou escolher esse herói.",
      "[*]Windranger: foram adicionados ícones para a habilidade Gale Force durante a utilização do item cosmético \"Compass of the Rising Gale\".",
      "[*]Foi aumentado o desempenho ao apresentar muitas mensagens de chat em canais globais.",
      "[*]Foram corrigidos vários problemas relacionados com textos descritivos.",
      "[*]As dicas apresentadas durante uma pausa foram atualizadas de acordo com as mudanças da atualização 7.35b.",
      "[/list]",
      "[b]Correções do modo Seleção de Habilidades:[/b]",
      "[list]",
      "[*]Diversas habilidades concedidas por Aghanim's Scepter/Shard anteriormente indisponíveis são agora concedidas. É possível aceder a algumas habilidades ao alternar o uso automático da habilidade base:",
      "[list]",
      "[*]Glacier concedido com Marksmanship.",
      "[*]Crystal Clone concedido com Frostbite.",
      "[*]Parting Shot concedido com Pierce the Veil.",
      "[*]Work Horse concedido com Stampede.",
      "[*]Burning Barrage concedido com Skeleton Walk.",
      "[*]Friendly Shadow concedido com Shadow Walk.",
      "[*]Counterspell Ally concedido com Counterspell.",
      "[*]Lightning Hands concedido com Arc Lightning.",
      "[*]Burning Army concedido com Death Pact.",
      "[*]Unrefined Fireblast concedido com Fireblast.",
      "[*]Poison Nova concedido com Noxious Plague (a habilidade passiva de Poison Nova é ocultada).",
      "[/list]",
      "[*]Chemical Rage agora concede Greevil's Greed. Irá aparecer como um buff em vez de na barra de habilidades.",
      "[*]Foi corrigido um problema que impedia o Spirit Bear de ter habilidades.",
      "[*]Foi corrigido um problema que impedia Blinding Light de aparecer como uma habilidade selecionável.",
      "[*]Foi corrigido um problema que fazia com que o Alchemist tivesse quatro habilidades básicas à escolha, o que podia ocultar outras habilidades.",
      "[*]Agora, escolher Cloak and Dagger e adquirir Aghanim's Shard já não concede Sleeping Dart.",
      "[*]Agora, escolher Ravage e adquirir Aghanim's Shard concede Dead in the Water em vez de Tendrils of the Deep.",
      "[*]Aghanim's Shard agora tem a nova interação com E.M.P. em vez da antiga com Chaos Meteor.",
      "[*]Proximity Mines agora concede Minefield Sign como uma habilidade adicional.",
      "[*]Foi corrigido um bug que impedia os ataques de Shadow Wave e Dream Coil (com Aghanim's Scepter) de funcionarem em heróis Melee.",
      "[*]Foi corrigido um bug que permitia o funcionamento de Spirits em ilusões enquanto o utilizador tivesse um Aghanim's Scepter.",
      "[*]Ogre Magi agora tem Dumb Luck como habilidade nativa em vez de Multicast.",
      "[*]Foram corrigidos casos em que algumas habilidades (Primal Spring, Pulse Nova, Rot, Infernal Blade, entre outras) não concediam acumulações de Fiery Soul.",
      "[*]Foram corrigidos casos em que talentos referentes a Starbreaker, Cinder Brew, Phantom Rush e Power Cogs não apareciam se essas habilidades tivessem sido selecionadas no respetivo herói original.",
      "[*]Foi corrigido um caso onde não era possível alternar o uso de Death Seeker com atalhos.",
      "[*]Foi corrigido um caso onde não era possível alternar Call of the Wild Hawk para trocar entre falcão e javali.",
      "[*]Foi corrigido um caso em que a habilidade Hairball aparecia sem um atalho enquanto não fosse alternada.",
      "[*]Foi corrigido um problema com a habilidade Chemical Rage com Aghanim's Scepter, que não estava a conceder um bónus de dano e amplificação de feitiços.",
      "[*]A habilidade Horn Toss é agora concedida corretamente por Aghanim's Scepter em vez de Aghanim's Shard.",
      "[*]A habilidade Rain of Destiny é agora concedida corretamente por Aghanim's Shard em vez de Aghanim's Scepter.",
      "[*]As habilidades Hunter's Boomerang e Decoy são agora concedidas respetivamente por Aghanim's Shard e Aghanim's Scepter, em vez de qualquer um dos dois.",
      "[*]Foi corrigido um caso em que Timbersaw recebia Second Chakram ao adquirir Aghanim's Scepter. Agora, a habilidade só é concedida através do respetivo talento se Timbersaw tiver escolhido Chakram na fase de seleção de habilidades.",
      "[/list]"
    ],
    "commentcount": 727,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "mod_require_rereview"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 3632,
    "votedowncount": 648,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1707511502,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707433100,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 3632,
  "votes_down": 648,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}