{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Das Geschenk des Drachen",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707432002
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Das Geschenk des Drachen",
    "posttime": 1707432004,
    "updatetime": 1707432004,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Wir arbeiten gerade fleißig am bevorstehenden Update „Kronenfall“ und freuen uns darauf, Ihnen bald alle Neuerungen präsentieren zu können. Nach einem Blick auf den Kalender, ist uns aufgefallen, dass seit dem Frostivus-Update bereits einige Wochen vergangen sind. Wir wollten jedoch nicht, dass Sie bis zum Kronenfall auf neue Inhalte warten müssen. Glücklicherweise haben uns die Kalendergötter einen weiteren Feiertag beschert: Frohes neues Mondjahr!",
      "Menschen, die im Jahr des Drachen geboren wurden, sind für ihre Großzügigkeit, ihren Wohlstand und ihr Glück bekannt. Muss schön sein. Für diejenigen unter uns, denen kein magischer Drache die Superkraft des Schenkens verliehen hat, präsentieren wir im roten Umschlag „Das Geschenk des Drachen“, das ab sofort bis zum 7. März erhältlich ist. Nomen est omen: Diese Umschläge kann man nur als Geschenk erhalten und nur der/die Beschenkte kann sie öffnen.",
      "Und falls Sie nicht auf die Großzügigkeit anderer hoffen möchten, können Sie auch die traditionellen Schätze des Drachenhorts erwerben. Jeder Schatz bzw. jedes Geschenk enthält eines von 17 neuen kosmetischen Gegenstandssets zum neuen Mondjahr sowie eine zusätzliche Chance auf „Das Geschenk des Drachen“ oder einen neuen ungewöhnlichen Effekt.",
      "Weiterhin könnte jeder Schatz (und jedes Geschenk) den ersten kosmetischen Gegenstand „Der Uralte Drachenkönig“ für die Ancients gewähren, mit einzigartigen Varianten für die Dire und die Radiant. Damit haben Sie endlich die Möglichkeit, Ihren Ancient mit einem mythischen Drachen zu schmücken, so wie Sie es sich vermutlich schon immer gewünscht haben. Hinzu kommt, dass dieser kosmetische Gegenstand für alle Spieler in einer Partie sichtbar ist, sofern ein einziger Spieler diesen ausgerüstet hat.",
      "Um beim Thema „Geist des Gebens“ zu bleiben, machen wir fast allen Spielern ein weiteres Geschenk: Wir haben neuen Code zur Erkennung von Cheats implementiert. Eigentlich ist die Implementierung schon ein paar Wochen her, und wir haben in der Zwischenzeit eine Vielzahl von Cheatern aufgespürt. Sobald die automatischen Bannwellen beginnen, werden Sie sicherlich weniger von dieser Sorte in Ihren Partien antreffen.",
      "Wie es Tradition ist, enthält dieses Update auch eine Reihe von Fehlerbehebungen und Verbesserungen:",
      "[b]Allgemeine Fehlerbehebungen:[/b]",
      "[list]",
      "[*]Mehrere Probleme behoben, die das Laden von Guides im Spiel verhinderten. (Falls Sie die Steam-Einstellung „Downloads während des Spiels zulassen“ aktiviert haben, um dieses Problem zu umgehen, können Sie diese ohne Weiteres wieder deaktivieren.)",
      "[*]Fehler behoben, durch den Roshan zum wiederholten Mal über das Schlachtfeld spazierte: Dieser Fehler trat auf, wenn Night Stalker Dark Ascension auf Roshan wirkte, während dieser ein Zwillingstor kanalisierte.",
      "[*]Fehler behoben, durch den bereits eroberte Außenposten kanalisiert werden konnten.",
      "[*]Fehler behoben, durch den die Oberfläche zur Auswahl von neutralen Gegenständen nach dem Loslassen einer Taste bei aktiviertem Schnellzaubern in einigen Fällen verschwand.",
      "[*]Fehler behoben, durch den der neutrale Gegenstand Doubloon nur +2 statt +2,5 Manaregeneration gewährte.",
      "[*]Fehler behoben, durch den auch Illusionen von der durch Eternal Shroud gewährten Magieresistenz profitierten.",
      "[*]Fehlerhafte Interaktion zwischen Eternal Shroud und Medusas Mana Shield behoben.",
      "[*]Fehlende Anmerkung im Beschreibungstext von Safety Bubble hinzugefügt, dass Eigenschaden nicht von der Barriere geblockt wird.",
      "[*]Fehler behoben, der im Zusammenhang mit den Effekten von Shiva's Guard auftrat.",
      "[*]Fehler behoben, durch den Chens Holy Persuasion beim Wirken nicht die an den Turbo-Modus angepasste Goldprämie von neutralen Einheiten gewährte.",
      "[*]Fehler behoben, durch den Legion Commanders Overwhelming Odds mit Splitterbonus nach wie vor Bonusrüstung und Bonusdauer gewährte.",
      "[*]Fehler behoben, durch den Marcis Unleash beim Aufheben und Fallenlassen von Bloodstone ausgelöst wurde.",
      "[*]Fehler behoben, durch den Muertas Gunslinger entzaubert werden konnte.",
      "[*]Fehler behoben, durch den Ogre Magis Multicast nicht durch einen Hotkey aufgelevelt werden konnte.",
      "[*]Fehler behoben, durch den inaktive Illusionen von Phantom Lancer das Erscheinen von Einheiten in neutralen Lagern blockieren konnten.",
      "[*]Seltener Serverabsturz im Zusammenhang mit Primal Beasts Uproar behoben.",
      "[*]Fehler behoben, durch den die Gegenstände Khanda und Harpoon nicht in der Spaltenansicht des Shops angezeigt wurden.",
      "[*]Magieresistenz durch Intelligenzpunkte und erhöhter Schaden zum erweiterten Beschreibungstext für Universalhelden hinzugefügt.",
      "[*]Im Turbo-Modus wird die Nachricht „[Held] wurde von beiden Teams gewählt!“ allen Spielern angezeigt und nicht nur dem Spieler, der versucht hat, den bereits gewählten Helden selbst zu wählen.",
      "[*]Angepasstes Fähigkeitssymbol von Gale Force für das Windranger-Arkana „Kompass des aufziehenden Sturmes“ hinzugefügt.",
      "[*]Leistung bei der Anzeige vieler Chatnachrichten aus globalen Kanälen verbessert.",
      "[*]Fehler in verschiedenen Beschreibungstexten behoben.",
      "[*]Tipps während einer pausierten Partie aktualisiert, um die Änderungen des Gameplay-Updates 7.35b zu berücksichtigen.",
      "[/list]",
      "[b]Fehlerbehebungen für den Ability Draft:[/b]",
      "[list]",
      "[*]Eine Reihe von zuvor nicht verfügbaren Zepter-/Splitterfähigkeiten werden nun gewährt. Einige dieser Fähigkeiten können durch das Aktivieren des Autozaubers der gewählten Fähigkeit gewirkt werden:",
      "[list]",
      "[*]Glacier wird mit Marksmanship gewährt.",
      "[*]Crystal Clone wird mit Frostbite gewährt.",
      "[*]Parting Shot wird mit Pierce the Veil gewährt.",
      "[*]Work Horse wird mit Stampede gewährt.",
      "[*]Burning Barrage wird mit Skeleton Walk gewährt.",
      "[*]Friendly Shadow wird mit Shadow Walk gewährt.",
      "[*]Counterspell Ally wird mit Counterspell gewährt.",
      "[*]Lightning Hands wird mit Arc Lightning gewährt.",
      "[*]Burning Army wird mit Death Pact gewährt.",
      "[*]Unrefined Fireblast wird mit Fireblast gewährt.",
      "[*]Poison Nova wird mit Noxious Plague gewährt. (Diese passive Fähigkeit wird nicht in der Fähigkeitsleiste angezeigt.)",
      "[/list]",
      "[*]Chemical Rage gewährt jetzt Greevil's Greed. Die Fähigkeit wird als Statuseffekt und nicht in der Fähigkeitsleiste angezeigt.",
      "[*]Fehler behoben, durch den der Geisterbär keine Fähigkeiten hatte.",
      "[*]Fehler behoben, durch den Blinding Light nicht als wählbare Fähigkeit angezeigt wurde.",
      "[*]Fehler behoben, durch den bei der Fähigkeitsauswahl vier von Alchemists Grundfähigkeiten angezeigt und Fähigkeiten anderer Helden um eine Spalte in der Rasteransicht verschoben wurden.",
      "[*]Cloak and Dagger mit Splitterbonus gewährt nicht mehr Sleeping Dart.",
      "[*]Ravage mit Splitterbonus gewährt jetzt Dead in the Water statt Tendrils of the Deep.",
      "[*]Splitterbonus im Ability Draft für Invoker aktualisiert: Jetzt wird E.M.P. statt Chaos Meteor verbessert.",
      "[*]Proximity Mines gewährt jetzt Minefield Sign als zusätzliche Fähigkeit.",
      "[*]Fehler behoben, durch den Angriffe von Shadow Wave und Dream mit Zepterbonus nicht gegen Nahkampfhelden funktionierten.",
      "[*]Fehler behoben, durch den Spirits mit Zepterbonus nicht für eigene Illusionen funktionierte.",
      "[*]Fehler behoben, durch den Ogre Magi Multicast statt Dumb Luck als eigens gewährte Fähigkeit erhielt.",
      "[*]Fehler behoben, durch den Primal Spring, Pulse Nova, Rot, Infernal Blade und eine Reihe anderer Fähigkeiten keine Aufladungen für Fiery Soul gewährten.",
      "[*]Fehler behoben, durch den die Talente für Starbreaker, Cinder Brew, Phantom Rush und Power Cogs nicht angezeigt wurden, wenn diese Fähigkeiten für den zugehörigen Helden gewählt wurden.",
      "[*]Fehler behoben, durch den Death Seeker nicht mit einem Hotkey umgeschaltet werden konnte.",
      "[*]Fehler behoben, durch den Call of the Wild: Falke nicht umgeschaltet werden konnte, um zwischen dem Falken und dem Keiler zu wechseln.",
      "[*]Fehler behoben, durch den kein Hotkey für Hairball angezeigt wurde, bis die Fähigkeit umgeschaltet wurde.",
      "[*]Fehler behoben, durch den Chemical Rage mit Zepterbonus keinen Bonusschaden und Bonuszauberverstärkung gewährte.",
      "[*]Fehler behoben, durch den Horn Toss durch den Splitterbonus statt durch den Zepterbonus gewährt wurde.",
      "[*]Fehler behoben, durch den Rain of Destiny durch den Zepterbonus statt durch den Splitterbonus gewährt wurde.",
      "[*]Fehler behoben, durch den Hunter's Boomerang und Decoy sowohl durch den Splitterbonus als auch durch den Zepterbonus gewährt wurden.",
      "[*]Fehler behoben, durch den Timbersaw Second Chakram mit dem Zepterbonus erhielt. Die Fähigkeit wird jetzt nur noch mit dem entsprechenden Talent gewährt, wenn Timbersaw Chakram wählt.",
      "[/list]"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1707432004,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}