{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Дар дракона",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707432002
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Дар дракона",
    "posttime": 1707432004,
    "updatetime": 1707432004,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Мы вовсю работаем над грядущим обновлением под названием «Павшая корона», и нам уже не терпится показать вам результаты наших трудов. Мы взглянули на календарь и заметили, что с холодрыжеского обновления прошло больше нескольких недель, так что решили не томить вас ожиданием нового контента до выхода «Павшей короны». К счастью, боги календаря как раз вовремя придумали ещё один праздник — поздравляем с Лунным Новым годом!",
      "Люди, родившиеся в год Дракона, славятся щедростью, процветанием и везением. Здорово им, наверное. Тем же из нас, кого волшебный дракон не наделил дарительными суперспособностями, мы представляем красные подарочные конверты, доступные с сегодняшнего дня по 7 марта. Их суть крайне проста: это сокровищницы, которые можно только дарить, а открыть их способен только выбранный получатель.",
      "А тех, кто предпочитает не ждать чужой щедрости, порадуют традиционные сокровищницы Dragon's Hoard. Каждая из них — как купленная, так и подаренная — содержит один из семнадцати косметических наборов на тему Лунного Нового года, а также, с некоторой вероятностью, подарочный конверт или предмет с новым необычным эффектом.",
      "И наконец, из каждой сокровищницы, в том числе из подарочной, можно получить предмет The Ancient Dragon King — первый аксессуар для Древнего с уникальными стилями для сил Света и Тьмы. У вас наконец-то появится возможность украсить своего Древнего мифическим драконом, о чём вы (наверное) всегда мечтали. Кроме того, если этот аксессуар есть хоть у кого-то в вашем матче, то его увидят все.",
      "Поддерживая дух невиданной щедрости, мы подготовили ещё один подарок, который понравится (почти) каждому, а именно — новый код для обнаружения читов. По правде говоря, мы выпустили его пару недель назад и с тех пор засекли весьма немало читеров. Вероятно, вы будете замечать, что их становится меньше с каждой новой волной автоматических блокировок.",
      "И, как повелось, это обновление также содержит ряд других исправлений и улучшений:",
      "[b]Общие исправления:[/b]",
      "[list]",
      "[*]Исправлены различные ошибки, из-за которых не загружались внутриигровые руководства (если для решения этой проблемы вы включили в Steam загрузки во время игры, теперь эту опцию можно выключить).",
      "[*]Исправлена ещё одна ошибка, из-за которой Рошан отправлялся на прогулку — когда Night Stalker активировал способность Dark Ascension, пока Рошан применял Парный портал.",
      "[*]Исправлена ошибка, из-за которой захваченные вашей командой аванпосты можно было попытаться захватить вновь.",
      "[*]Исправлена ошибка, из-за которой панель выбора нейтрального предмета пропадала при отпускании клавиши в некоторых режимах быстрого применения.",
      "[*]Исправлена ошибка, из-за которой Doubloon давал лишь 2, а не 2,5 маны в секунду.",
      "[*]Исправлена ошибка, из-за которой сопротивление магии от Eternal Shroud действовало на иллюзии.",
      "[*]Исправлено взаимодействие Eternal Shroud со способностью Mana Shield у Medusa.",
      "[*]Теперь подсказка заклинания Safety Bubble упоминает, что барьер пропускает урон, наносимый самому себе.",
      "[*]Исправлена ошибка эффектов Shiva's Guard.",
      "[*]Исправлена ошибка, из-за которой в режиме Turbo при применении способности Holy Persuasion у Chen не учитывался множитель золота за крипов.",
      "[*]Исправлена ошибка, из-за которой способность Overwhelming Odds у Legion Commander с Aghanim's Shard по-прежнему имела бонус к броне и длительности.",
      "[*]Исправлена ошибка, из-за которой способность Unleash у Marci срабатывала при получении и потере Bloodstone.",
      "[*]Исправлена ошибка, из-за которой эффект Gunslinger у Muerta можно было развеять.",
      "[*]Исправлена ошибка, из-за которой способность Multicast у Ogre Magi нельзя было улучшить горячей клавишей.",
      "[*]Исправлена ошибка, из-за которой неактивные иллюзии Phantom Lancer могли блокировать лагеря нейтральных крипов.",
      "[*]Устранена причина сбоя сервера, изредка происходившего из-за способности Uproar у Primal Beast.",
      "[*]Исправлена ошибка, из-за которой при отображении предметов в лавке колонками не отображались Khanda и Harpoon.",
      "[*]В расширенные подсказки добавлена информация о сопротивлении магии, которую даёт интеллект, и увеличенном уроне универсальных героев.",
      "[*]Теперь в режиме Turbo сообщение о том, что героя выбрали обе команды, видят все, а не только выбравшие его игроки.",
      "[*]Теперь при использовании предмета Compass of the Rising Gale отображаются верные иконки способности Gale Force у Windranger.",
      "[*]Повышена производительность при отображении большого количества сообщений из глобальных каналов.",
      "[*]Решены различные проблемы с всплывающими подсказками.",
      "[*]Текст подсказок во время паузы теперь актуален для обновления 7.35b.",
      "[/list]",
      "[b]Исправления в режиме Ability Draft:[/b]",
      "[list]",
      "[*]Добавлены способности, которые не были доступны с предметами Аганима. Некоторые из них доступны при переключении основных способностей:",
      "[list]",
      "[*]Glacier даётся владельцу Marksmanship;",
      "[*]Crystal Clone даётся владельцу Frostbite;",
      "[*]Parting Shot даётся владельцу Pierce the Veil;",
      "[*]Work Horse даётся владельцу Stampede;",
      "[*]Burning Barrage даётся владельцу Skeleton Walk;",
      "[*]Friendly Shadow даётся владельцу Shadow Walk;",
      "[*]Counterspell Ally даётся владельцу Counterspell;",
      "[*]Lightning Hands даётся владельцу Arc Lightning;",
      "[*]Burning Army даётся владельцу Death Pact;",
      "[*]Unrefined Fireblast даётся владельцу Fireblast;",
      "[*]Poison Nova даётся владельцу Noxious Plague, но будет скрыта, так как является пассивной.",
      "[/list]",
      "[*]Greevil's Greed теперь даётся вместе с Chemical Rage. Сама способность скрыта, но её эффект отображается как статус над полосой здоровья.",
      "[*]Исправлена ошибка, из-за которой у духа-медведя не было способностей.",
      "[*]Исправлена ошибка, из-за которой способность Blinding Light не была доступна в этом режиме.",
      "[*]Исправлена ошибка, из-за которой у Alchemist было 4 базовые способности на выбор, отчего остальные сдвигались вправо.",
      "[*]Способность Sleeping Dart больше не даётся владельцам Cloak and Dagger при получении Aghanim's Shard.",
      "[*]Теперь Aghanim's Shard даёт владельцам Ravage способность Dead in the Water, а не Tendrils of the Deep.",
      "[*]Удалён старый эффект Aghanim's Shard у Invoker, усиливающий Chaos Meteor, и добавлен актуальный, усиливающий E.M.P.",
      "[*]Minefield Sign теперь даётся вместе с Proximity Mines.",
      "[*]Исправлена ошибка, из-за которой герои ближнего боя не наносили урон от атак способностями Shadow Wave и Dream Coil со скипетром.",
      "[*]Исправлена ошибка, из-за которой Spirits с Aghanim's Scepter создавала духов вокруг иллюзий.",
      "[*]Исправлена ошибка, из-за которой врождённой способностью у Ogre Magi была Multicast, а не Dumb Luck.",
      "[*]Исправлена ошибка, из-за которой Fiery Soul не давала эффекты при попадании способностями Primal Spring, Pulse Nova, Rot, Infernal Blade и прочими.",
      "[*]Исправлена ошибка, из-за которой таланты на улучшение способностей Starbreaker, Cinder Brew, Phantom Rush и Power Cogs не появлялись при выборе оригинальным героем-владельцем.",
      "[*]Исправлена ошибка, из-за которой способность Death Seeker не переключалась горячей клавишей.",
      "[*]Исправлена ошибка, из-за которой способность Call of the Wild не переключалась между ястребом и кабаном.",
      "[*]Исправлена ошибка, из-за которой способность Hairball появлялась без переключения.",
      "[*]Исправлена ошибка, из-за которой способность Chemical Rage не увеличивала урон при дарении Aghanim's Scepter.",
      "[*]Исправлена ошибка, из-за которой способность Horn Toss давалась за Aghanim's Shard, а не Aghanim's Scepter.",
      "[*]Исправлена ошибка, из-за которой способность Rain of Destiny давалась за Aghanim's Scepter, а не Aghanim's Shard.",
      "[*]Исправлена ошибка, из-за которой способности Hunter's Boomerang и Decoy давались как за Aghanim's Scepter, так и за Aghanim's Shard.",
      "[*]Исправлена ошибка, из-за которой Timbersaw с Aghanim's Scepter получал Second Chakram. Теперь эта способность доступна только в виде таланта, если Timbersaw выбрал Chakram.",
      "[/list]"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1707432004,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}