{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "El Regalo del Dragón",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "El Regalo del Dragón",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Estamos trabajando duro en una próxima actualización que se va a llamar la «Caída de la Corona» y que ya tenemos ganas de terminar para que se vea qué teníamos entre manos. Después de consultar el calendario, nos dimos cuenta de que ya habían pasado bastantes semanas desde la actualización de la Fiesta de la Escarcha y no queríamos que tuvieras que esperar hasta la Caída de la Corona para recibir contenido nuevo. Afortunadamente, los dioses del calendario nos regalaron otra celebración justo a tiempo: ¡Feliz Año Nuevo lunar!",
      "Quienes nacen durante el año del Dragón son famosos por su generosidad, su prosperidad y su buena suerte. Eso debe de ser bonito. Para el resto, para quienes no contamos con un dragón mágico que nos otorgue los superpoderes de la generosidad, hemos presentado el Regalo del Dragón con una temática de sobres rojos, que estará disponible a partir de ahora hasta el 7 de marzo. Esto va a funcionar tal como su nombre indica: los tesoros son únicamente para otorgarlos al destinatario que elijas, que es la única persona que puede abrirlos.",
      "Y para quienes no quieran esperar por la generosidad de los demás, también tenemos las tradicionales riquezas del Tesoro del Dragón. Cada tesoro o regalo incluye uno de los 17 sets cosméticos nuevos con la temática del Año Nuevo lunar y una oportunidad más de conseguir un Regalo del Dragón o un nuevo efecto inusual.",
      "Por último, cada uno de los tesoros y regalos tiene la posibilidad de incluir el Rey Dragón del Ancestro, que es el primer elemento cosmético disponible para tu Ancestro, con estilos únicos para Dire y Radiant. Por fin, a partir de ahora vas a tener la oportunidad de hacer lo que, supuestamente, siempre quisiste: adornar tu Ancestro con un dragón mítico. Además, si alguien tiene uno en tu partida, todos lo verán.",
      "Siguiendo con el tema del espíritu de generosidad, tenemos otro regalo para (casi) todos: hemos ido implementando código nuevo para detectar trampas. Bueno, en realidad, lo lanzamos hace unas semanas, y desde entonces hemos ido recopilando una buena lista de tramposos. Tal vez hayas notado que hay menos tramposos en tus partidas a medida que se iban implementando las diversas fases de bloqueos automáticos.",
      "Como es tradición, esta actualización incluye un determinado número de correcciones y mejoras:",
      "[b]Correcciones generales:[/b]",
      "[list]",
      "[*]Se corrigieron una serie de problemas que impedían la carga de las guías durante la partida. Nota: Si activaste manualmente las descargas de Steam en segundo plano para sortear este problema, ya puedes volver a desactivarlas de nuevo.",
      "[*]Se corrigió otro caso en el que Roshan podía irse caminando cuando Night Stalker lanzaba Ascensión Oscura mientras Roshan estaba canalizando en un Portal Gemelo.",
      "[*]Se corrigió un problema con los puestos avanzados ya capturados que permitían la canalización.",
      "[*]Se corrigió un problema con el selector de objetos neutrales que se ocultaba al soltar la tecla cuando se usaban algunos de los modos de lanzamiento rápido.",
      "[*]Doblón ya tiene +2,5 de regeneración de maná en lugar de +2.",
      "[*]Se corrigió la aplicación a las ilusiones de la resistencia a la magia de Manto Eterno.",
      "[*]Se corrigieron las interacciones de Manto Eterno con el Escudo de Maná de Medusa.",
      "[*]La descripción emergente de Burbuja de Seguridad ya menciona que el daño autoinfligido traspasa la barrera.",
      "[*]Se corrigió un problema con los efectos de Protección de Shiva.",
      "[*]Persuasión Sagrada de Chen ya tiene en cuenta el multiplicador de botín de creeps en modo Turbo cuando se otorga oro durante el lanzamiento.",
      "[*]Se corrigió que el Fragmento de Aghanim todavía le diera a Legion Commander armadura y duración adicionales con Probabilidades Adversas.",
      "[*]Se corrigió la activación de Desatar de Marci que ocurría al añadir o quitar Piedra de Sangre.",
      "[*]Pistolera de Muerta ya no se puede purgar.",
      "[*]La asignación de teclas para subir de nivel el Multilanzamiento de Ogre Magi ya funciona correctamente.",
      "[*]Se corrigió un error que permitía bloquear los campos de neutrales a las ilusiones inactivas de Phantom Lancer.",
      "[*]Se corrigió un bloqueo poco común del servidor que se producía con la habilidad Rugido de Primal Beast.",
      "[*]Se corrigió la columna de la disposición de la tienda que no mostraba la Khanda ni el Arpón.",
      "[*]Se añadieron a las descripciones emergentes la resistencia a la magia de inteligencia y el daño adicional para los héroes universales.",
      "[*]En el modo Turbo, se muestra ahora a todos el mensaje «¡Los dos equipos han elegido a [héroe]!», no solo al segundo jugador que intentó elegir el mismo héroe.",
      "[*]Se añadieron iconos de hechizo a la Fuerza del Vendaval de Windranger al usar Brújula del Vendaval en Ascenso.",
      "[*]Se aumentó el rendimiento al mostrar muchos mensajes de chat en los canales globales.",
      "[*]Se corrigieron varios problemas relacionados con descripciones emergentes.",
      "[*]Se actualizaron los consejos mostrados durante la pausa para el parche de jugabilidad 7.35b.",
      "[/list]",
      "[b]Correcciones del modo Selección de habilidades:[/b]",
      "[list]",
      "[*]Ahora se otorga una cierta cantidad de habilidades con el Fragmento o el Cetro de Aghanim que antes no estaban disponibles; el acceso a algunas de esas habilidades se obtiene al alternar el uso de autolanzamiento en el hechizo base:",
      "[list]",
      "[*]Glaciar se otorga con Puntería.",
      "[*]Clon de Cristal se otorga con Congelación.",
      "[*]Disparo al Alma se otorga con Atravesar el Velo.",
      "[*]Caballo de Tiro se otorga con Estampida.",
      "[*]Aluvión Llameante se otorga con Movimiento Esquelético.",
      "[*]Sombra Aliada se otorga con Movimiento Sombrío.",
      "[*]Contrahechizo Aliado se otorga con Contrahechizo.",
      "[*]Manos Relámpago se otorga con Arco Eléctrico.",
      "[*]Ejército Ardiente se otorga con Pacto Mortal.",
      "[*]Explosión de Fuego Bruta se otorga con Explosión de Fuego.",
      "[*]Oleada Venenosa se otorga con Plaga Nociva (la habilidad pasiva de Oleada Venenosa está oculta).",
      "[/list]",
      "[*]Furia Química ahora otorga Avaricia de Greevil. Aparecerá como un efecto positivo en vez de estar en la barra de habilidades.",
      "[*]Se corrigió que Espíritu Oso no tuviera ninguna habilidad.",
      "[*]Se corrigió que Luz Cegadora no apareciera como una habilidad seleccionable.",
      "[*]Se corrigió que Alchemist tuviera 4 habilidades básicas para seleccionar, con lo que se ocultaba una de las habilidades restantes.",
      "[*]El Fragmento de Aghanim con Puñalada de las Sombras ya no otorga Dardo Adormecedor.",
      "[*]El Fragmento de Aghanim con Devastar ahora otorga Anclar en lugar de Tentáculos de las Profundidades.",
      "[*]En el modo Selección de habilidades, el Fragmento de Aghanim se aplica ahora a la habilidad P.E.M. de Invoker en lugar de a Meteorito del Caos.",
      "[*]Minas de Proximidad ahora otorga Señal de Campo de Minas como una habilidad adicional.",
      "[*]Los ataques del Cetro de Aghanim con Onda Sombría y Espiral de Sueños ya funcionan sobre héroes cuerpo a cuerpo.",
      "[*]Se corrigió que Espíritus funcionase sobre ilusiones cuando tenías un Cetro de Aghanim.",
      "[*]Se corrigió que Ogre Magi obtuviera Multilanzamiento en lugar de Pura Chiripa como habilidad innata.",
      "[*]Se corrigieron Brinco Primordial, Ráfaga de Pulsaciones, Pudrir, Hoja Infernal y otras habilidades que no otorgaban acumulaciones de Alma Ígnea.",
      "[*]Se corrigió la aparición de talentos para Quebrantaestrellas, Borrachera Abrasadora, Carrera Fantasma y Engranajes Electrificados cuando la habilidad se selecciona en su héroe original.",
      "[*]Se corrigió que Buscador de la Muerte no se pudiera alternar usando una tecla rápida.",
      "[*]Se corrigió no poder alternar Llamada del Halcón Salvaje para cambiar entre el halcón y el jabalí.",
      "[*]Se corrigió que Bola de Pelo apareciera sin una tecla rápida hasta que se alternaba.",
      "[*]Se corrigió que el uso del Cetro de Aghanim con Furia Química no otorgara daño adicional ni amplificación de hechizos.",
      "[*]Se corrigió que se otorgase Cogida con el Fragmento de Aghanim en lugar de con el Cetro de Aghanim.",
      "[*]Se corrigió que Lluvia del Destino se otorgase con el Cetro de Aghanim en lugar de con el Fragmento de Aghanim.",
      "[*]Se corrigió que se otorgasen Bumerán de la Cazadora y Señuelo con el Fragmento de Aghanim o con el Cetro de Aghanim.",
      "[*]Se corrigió que Timbersaw obtuviera un segundo Chakram con el Cetro de Aghanim. Ahora, solo se concede con el talento si Timbersaw selecciona Chakram.",
      "[/list]"
    ],
    "commentcount": 1067,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 9610,
    "votedowncount": 1480,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1708471645,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 9610,
  "votes_down": 1480,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}