{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Cadoul dragonului",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Cadoul dragonului",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Lucrăm din greu la o viitoare actualizare pe care o numim „Căderea coroanei” și abia așteptăm să terminăm de lucrat la ea pentru a dezvălui detaliile acesteia. Ne-am aruncat ochii peste calendar și am observat că au trecut mai mult de câteva săptămâni de la actualizarea Frostivus și nu am vrut să te lăsăm să aștepți până la lansarea actualizării „Căderea coroanei” pentru a te bucura de conținut nou. Din fericire, zeii calendarului au venit la timp cu o altă sărbătoare: La mulți ani de Anul Nou Lunar!",
      "Cei născuți în anul dragonului sunt cunoscuți pentru generozitatea, prosperitatea și norocul lor. Probabil este grozav să te afli în pielea lor. Pentru aceia dintre noi care nu avem un dragon magic care să ne acorde super-puteri pentru a oferi cadouri, am adăugat „Cadoul dragonului”, care este împachetat într-un plic roșu și este disponibil de azi până pe 7 martie. Acestea funcționează exact așa cum te-ai aștepta: sunt comori care pot fi oferite și deschise doar de destinatarul pe care l-ai ales.",
      "Și, pentru aceia dintre voi care nu-și doresc să aștepte după generozitatea altora, sunt disponibile și comori tradiționale Dragon's Hoard. Fiecare comoară sau cadou conține unul dintre cele 17 seturi de accesorii cu tematică de Anul Nou Lunar și oferă șansa de a obține un cadou al dragonului sau un efect Unusual nou.",
      "De asemenea, fiecare comoară (și cadou) este posibil să conțină The Ancient Dragon King, primul accesoriu creat vreodată pentru Ancient, care dispune de stiluri unice pentru Dire și Radiant. Acum ai în sfârșit ocazia să-ți decorezi Ancientul cu un dragon mitic, așa cum, probabil, ți-ai dorit întotdeauna. În plus, dacă un jucător din meciul tău are echipat acest accesoriu, acesta va fi vizibil pentru toți.",
      "Pentru a rămâne în spiritul generozității, mai avem un cadou (aproape) pentru toată lumea: am lansat un nou sistem de detectare a trișorilor. De fapt, acesta a devenit disponibil în urmă cu câteva săptămâni și, de atunci, am prins în fapt mai mulți trișori. Probabil vei observa că aceștia vor fi tot mai puțin prezenți în meciurile tale pe măsură ce sistemul va aplica automat și regulat interdicții asupra trișorilor.",
      "După cum te-ai obișnuit, actualizarea aceasta include și o serie de alte remedieri și îmbunătățiri:",
      "[b]Remedieri generale:[/b]",
      "[list]",
      "[*]Au fost remediate mai multe probleme care puteau împiedica încărcarea ghidurilor în joc (dacă ai activat manual funcția Steam de descărcare în fundal, pentru a încerca să remediezi temporar această problemă, o poți dezactiva din nou în siguranță).",
      "[*]A fost remediată o altă situație în care Roshan putea să se plimbe pe hartă: acest lucru se întâmpla când Night Stalker invoca Dark Ascension cât timp Roshan se concentra asupra unui portal geamăn.",
      "[*]A fost remediat faptul că jucătorii se puteau concentra asupra avanposturilor care erau deja capturate.",
      "[*]A fost remediat faptul că meniul de selecție a obiectului neutru era închis automat după eliberarea tastelor utilizate pentru câteva dintre modurile de invocare rapidă.",
      "[*]A fost remediat faptul că Doubloon oferea +2 regenerare de mana în loc de +2,5.",
      "[*]A fost remediat faptul că rezistența la magie a obiectului Eternal Shroud era aplicată iluziilor.",
      "[*]Au fost remediate interacțiunile dintre Eternal Shroud și abilitatea Mana Shield a eroinei Medusa.",
      "[*]A fost remediat faptul că descrierea efectului aplicat de Safety Bubble nu menționa faptul că bariera nu protejează unitatea împotriva daunelor pe care aceasta și le cauzează singură.",
      "[*]A fost remediată o problemă privind efectele obiectului Shiva's Guard.",
      "[*]A fost remediat faptul că abilitatea Holy Persuasion a lui Chen nu lua în considerare multiplicatorul modului Turbo pentru recompensele oferite de creepi atunci când abilitatea acorda aur la invocare.",
      "[*]A fost remediat faptul că Aghanim's Shard încă îi oferea eroinei Legion Commander bonusul de armură și durată pentru Overwhelming Odds.",
      "[*]A fost remediat faptul că abilitatea Unleash a eroinei Marci se declanșa atunci când prelua și arunca obiectul Bloodstone.",
      "[*]A fost remediat faptul că abilitatea Gunslinger a eroinei Muerta putea fi purjată.",
      "[*]A fost remediat faptul că abilitatea Multicast a eroilor Ogre Magi nu putea fi îmbunătățită prin intermediul tastei asociate.",
      "[*]A fost remediată o eroare care le permitea iluziilor inactive ale lui Phantom Lancer să blocheze taberele de creepi neutri.",
      "[*]A fost remediată o cădere de server rară care era cauzată de abilitatea Uproar a lui Primal Beast.",
      "[*]A fost remediat faptul că magazinul nu afișa obiectele Khanda și Harpoon atunci când obiectele erau dispuse pe coloane.",
      "[*]Descrierile extinse menționează rezistența la magie oferită de inteligență și mărirea de daune pentru eroii universali.",
      "[*]În modul Turbo, mesajul „[Erou] a fost ales de ambele echipe!” este afișat acum tuturor, nu doar jucătorului care încearcă să aleagă un erou care a fost ales deja.",
      "[*]A fost adăugată o pictogramă specială pentru abilitatea Gale Force a eroinei Windranger care este afișată atunci când setul de obiecte Compass of the Rising Gale este echipat.",
      "[*]A fost îmbunătățită performanța chatului privind afișarea mai multor mesaje de chat din canalele globale.",
      "[*]Au fost remediate mai multe probleme aferente descrierilor.",
      "[*]Au fost actualizate modificările afișate pentru actualizarea de joc 7.35b în timpul pauzelor.",
      "[/list]",
      "[b]Remedieri pentru modul de joc „Selecție abilități”:[/b]",
      "[list]",
      "[*]Mai multe abilități care nu erau anterior oferite de Aghanim's Sceptre/Shard sunt oferite acum eroilor, câteva dintre acestea fiind accesibile prin comutarea invocării automate a vrăjii de bază:",
      "[list]",
      "[*]Abilitatea Glacier oferită cu Marksmanship.",
      "[*]Abilitatea Crystal Clone oferită cu Frostbite.",
      "[*]Abilitatea Parting Shot oferită cu Pierce the Veil.",
      "[*]Abilitatea Work Horse oferită cu Stampede.",
      "[*]Abilitatea Burning Barrage oferită cu Skeleton Walk.",
      "[*]Abilitatea Friendly Shadow oferită cu Shadow Walk.",
      "[*]Abilitatea Counterspell Ally oferită cu Counterspell.",
      "[*]Abilitatea Lightning Hands oferită cu Arc Lightning.",
      "[*]Abilitatea Burning Army oferită cu Death Pact.",
      "[*]Abilitatea Unrefined Fireblast oferită cu Fireblast.",
      "[*]Abilitatea Poison Nova oferită cu Noxious Plague (abilitatea pasivă Poison Nova este ascunsă).",
      "[/list]",
      "[*]Chemical Rage oferă acum Greevil's Greed. O să apară ca un efect pozitiv în loc să apară în bara de abilități.",
      "[*]A fost remediat faptul că Spirit Bear nu avea nicio abilitate.",
      "[*]A fost remediat faptul că Blinding Light nu apărea ca o abilitate selectabilă.",
      "[*]A fost remediat faptul că Alchemist avea 4 abilități de bază selectabile, fapt ce împingea celelalte abilități cu un slot.",
      "[*]Aghanim's Shard nu mai oferă Sleeping Dart pentru Dagger Shard.",
      "[*]Ravage Shard oferă acum Dead in the Water în loc de Tendrils of the Deep.",
      "[*]Aghanim's Shard îi oferă lui Invoker acum E.M.P. în loc de Meteor.",
      "[*]Proximity Mines oferă acum Minefield Sign ca abilitate suplimentară.",
      "[*]A fost remediat faptul că atacurile cu versiunile îmbunătățite de Aghanim's Scepter ale abilităților Shadow Wave și Dream Coil nu funcționau pe eroii de meleu.",
      "[*]A fost remediat faptul că Spirits funcționa pe iluzii atunci când jucătorul avea Aghanim's Scepter.",
      "[*]A fost remediat faptul că Ogre Magi primeau Multicast în loc de Dumb Luck ca abilitate înnăscută.",
      "[*]A fost remediat faptul că Primal Spring, Pulse Nova, Rot, Infernal Blade și multe alte abilități nu ofereau suprapuneri de Fiery Soul.",
      "[*]A fost remediat faptul că talentele nu apăreau pentru Starbreaker, Cinder Brew, Phantom Rush și Power Cogs dacă erau selectate de eroul lor original.",
      "[*]A fost remediat faptul că abilitatea Death Seeker nu era comutabilă cu ajutorul tastei rapide.",
      "[*]A fost remediat faptul că abilitatea Call of the Wild Hawk nu era comutabilă pentru a schimba între Hawk și Boar.",
      "[*]A fost remediat faptul că Hairball apărea fără ca o tastă rapidă să fie apăsată. Acest lucru se întâmpla până când abilitatea era comutată.",
      "[*]A fost remediat faptul că Aghanim's Sceptre nu oferea pentru Chemical Rage bonusul de daune și amplificarea pentru vrăji.",
      "[*]A fost remediat faptul că abilitatea Horn Toss era oferită de Aghanim's Shard în loc să fie oferită de Aghanim's Scepter.",
      "[*]A fost remediat faptul că abilitatea Rain of Destiny era oferită de Aghanim's Scepter în loc să fie oferită de Aghanim's Shard.",
      "[*]A fost remediat faptul că abilitățile Hunter's Boomerang și Decoy erau oferite atât de Aghanim's Shard, cât și de Aghanim's Scepter.",
      "[*]A fost remediat faptul că Aghanim's Scepter îi oferea Second Chakram lui Timbersaw. Aceasta este oferită acum doar de talent dacă Timbersaw selectează Chakram.",
      "[/list]"
    ],
    "commentcount": 1129,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 12092,
    "votedowncount": 1787,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1710287801,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12092,
  "votes_down": 1787,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}