{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Il Dono del Drago",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Il Dono del Drago",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Stiamo lavorando sodo ad un prossimo aggiornamento che chiameremo \"Crownfall\" e non vediamo l'ora di terminarlo per condividere tutte le novità con i giocatori. Guardando il calendario, abbiamo notato che sono passate diverse settimane dall'aggiornamento del Frostivus, quindi non volevamo farti aspettare l'arrivo di Crownfall prima di ricevere nuovi contenuti. Per fortuna, le divinità del calendario ci hanno benedetto con un'altra festività appena in tempo: buon Capodanno lunare!",
      "Le persone nate nell'anno del drago sono note per la loro generosità, prosperità e fortuna. Beate loro. Per quelli di noi che non hanno un drago magico in grado di concederci il superpotere di fare regali, abbiamo introdotto il Dono del Drago, un tesoro a forma di busta rossa, disponibile da ora fino al 7 marzo. Questi doni funzionano esattamente come si evince dal nome: tesori che possono solo essere regalati e aperti da chiunque tu scelga come destinatario.",
      "E per coloro che preferiscono non basarsi sulla generosità altrui, abbiamo anche i tesori tradizionali \"Bottino del Drago\". Ogni tesoro o regalo contiene uno dei 17 nuovi set cosmetici a tema Capodanno lunare e offre la possibilità ulteriore di ricevere un Dono del Drago o un nuovo effetto Insolito.",
      "Infine, ciascun tesoro (e regalo) dà la possibilità di ricevere il Dragone Reale Antico, il primo oggetto cosmetico in assoluto per il tuo Antico, con stili unici per Radiant e Dire. Ora avrai finalmente la possibilità di adornare il tuo Antico con un dragone mitico, proprio come (forse) hai sempre desiderato. In più, se qualcuno in partita ne ha uno, tutti potranno vederlo.",
      "In linea con il tema dello \"spirito altruista\", abbiamo un altro regalo per (quasi) tutti: è stato implementato un nuovo codice per il rilevamento dei cheat. Beh, a dire il vero lo abbiamo implementato qualche settimana fa, accumulando un bel po' di cheater nel frattempo. Probabilmente ne noterai una quantità minore nelle tue partite man mano che il sistema automatico di ban fa il suo dovere.",
      "Come da tradizione, questo aggiornamento include anche una serie di altre correzioni e miglioramenti:",
      "[b]Correzioni generali:[/b]",
      "[list]",
      "[*]Risolti diversi problemi che impedivano il caricamento delle guide in partita (se hai abilitato manualmente i download in background su Steam per aggirare questo problema, ora puoi disabilitarli di nuovo).",
      "[*]Corretto un altro caso che consentiva a Roshan di girare liberamente per la mappa quando Night Stalker lanciava Ascesa oscura mentre Roshan canalizzava uno dei Portali gemelli.",
      "[*]Risolto il problema per cui gli Avamposti già conquistati potevano essere canalizzati.",
      "[*]Risolto il problema per cui il menu di selezione degli oggetti neutrali veniva nascosto al rilascio di alcuni tasti di lancio rapido.",
      "[*]Risolto il problema per cui il Doblone concedeva solo +2 di rigenerazione del mana anziché +2,5.",
      "[*]Risolto il problema per cui la resistenza alla magia del Velo Eterno veniva applicata alle illusioni.",
      "[*]Corrette le interazioni tra il Velo Eterno e l'abilità Scudo di mana di Medusa.",
      "[*]Risolto il problema per cui la descrizione della Bolla Protettiva non menzionava il fatto che la barriera ignorasse il danno autoinflitto.",
      "[*]Risolto il problema con gli effetti sulla Protezione di Shiva.",
      "[*]Risolto il problema per cui l'oro ottenuto con l'abilità Persuasione sacra di Chen non teneva conto del moltiplicatore della ricompensa in oro dei creep in modalità Turbo.",
      "[*]Risolto il problema per cui il miglioramento del Frammento di Aghanim per Legion Commander aumentava ancora la durata e il bonus di armatura di Probabilità schiaccianti.",
      "[*]Risolto il problema per cui l'abilità Sfogo di Marci si attivava raccogliendo e lasciando il Diaspro Sanguigno.",
      "[*]Risolto il problema per cui l'abilità Pistolera di Muerta poteva essere dissipata.",
      "[*]Risolto il problema per cui il tasto associato al miglioramento dell'abilità Multievocazione di Ogre Magi non funzionava correttamente.",
      "[*]Risolto un bug che consentiva alle illusioni non attive di Phantom Lancer di bloccare i campi neutrali.",
      "[*]Risolto un crash raro del server legato all'abilità Frastuono di Primal Beast.",
      "[*]Risolto il problema per cui la disposizione a colonne del negozio non mostrava la Khanda e l'Arpione.",
      "[*]Ora le descrizioni estese includono la resistenza alla magia dall'Intelligenza e il danno aumentato per gli Eroi Universali.",
      "[*]Nella modalità Turbo, il messaggio \"[Eroe] è stato scelto da entrambe le squadre!\" viene ora mostrato a tutti e non soltanto al giocatore che ha cercato di selezionare l'Eroe già scelto.",
      "[*]Aggiunte le icone per l'abilità Forza della burrasca di Windranger durante l'utilizzo dell'oggetto \"Guida della Burrasca Crescente\".",
      "[*]Migliorate le prestazioni durante la visualizzazione di numerosi messaggi di chat dai canali globali.",
      "[*]Risolti vari problemi con le descrizioni.",
      "[*]Modificati i suggerimenti mostrati durante le pause in accordo con l'aggiornamento 7.35b.",
      "[/list]",
      "[b]Correzioni della modalità Ability Draft:[/b]",
      "[list]",
      "[*]Diverse abilità associate al Frammento e allo Scettro di Aghanim che prima non erano disponibili vengono ora sbloccate (per accedere ad alcune abilità è necessario attivare l'opzione di lancio automatico per l'incantesimo di base):",
      "[list]",
      "[*]L'abilità Ghiacciaio si sblocca con Precisione.",
      "[*]L'abilità Clone di cristallo si sblocca con Morsa di ghiaccio.",
      "[*]L'abilità Dipartita si sblocca con Perforazione del velo.",
      "[*]L'abilità Cavallo da tiro si sblocca con Travolgimento.",
      "[*]L'abilità Fuoco di sbarramento si sblocca con Scatto scheletrico.",
      "[*]L'abilità Ombra alleata si sblocca con Furtività.",
      "[*]L'abilità Controincantesimo alleato si sblocca con Controincantesimo.",
      "[*]L'abilità Mani elettrizzanti si sblocca con Arco elettrico.",
      "[*]L'abilità Esercito ardente si sblocca con Patto di morte.",
      "[*]L'abilità Esplosione di fuoco rozza si sblocca con Esplosione di fuoco.",
      "[*]L'abilità Nova velenosa si sblocca con Pestilenza nociva (l'abilità passiva di Nova velenosa è nascosta).",
      "[/list]",
      "[*]Ora l'abilità Rabbia chimica sblocca Avidità del greevil, che comparirà come effetto positivo anziché sulla barra delle abilità.",
      "[*]Risolto il problema per cui lo Spirito Orso non aveva abilità.",
      "[*]Risolto il problema per cui Luce accecante non compariva tra le abilità selezionabili.",
      "[*]Risolto il problema per cui Alchemist aveva 4 abilità di base in fase di scelta, andando a nascondere le altre abilità.",
      "[*]La combinazione Cappa e spada + Frammento di Aghanim non sblocca più l'abilità Dardo sonnifero.",
      "[*]Ora la combinazione Devastazione + Frammento di Aghanim sblocca l'abilità Morto in acqua anziché Tentacoli delle profondità.",
      "[*]Invoker: ora il Frammento di Aghanim fa ottenere il nuovo miglioramento (Impulso elettromagnetico) anziché quello vecchio (Meteora del caos).",
      "[*]Ora Mine di prossimità sblocca anche l'abilità Occhio alle mine.",
      "[*]Risolto il problema per cui gli attacchi di Onda ombrosa e Spirale onirica con lo Scettro di Aghanim non funzionavano contro gli Eroi da mischia.",
      "[*]Risolto il problema per cui l'abilità Spiriti funzionava sulle illusioni quando l'utilizzatore possedeva uno Scettro di Aghanim.",
      "[*]Ora Ogre Magi ottiene Multievocazione come abilità innata anziché Fortuna sfacciata.",
      "[*]Risolto il problema per cui Balzo primitivo, Nova pulsante, Putrefazione, Lama infernale e diverse altre abilità non facevano ottenere istanze di Animo focoso.",
      "[*]Risolto il problema per cui non comparivano i talenti per Schianto stellare, Infusione ardente, Scatto fantasma e Ingranaggi elettrici quando l'abilità veniva selezionata per l'Eroe originale.",
      "[*]Risolto il problema per cui non era possibile attivare l'abilità Cercamorte con il tasto associato.",
      "[*]Risolto il problema per cui l'abilità Richiamo della foresta non consentiva di passare dall'Aquila al Cinghiale.",
      "[*]Risolto il problema per cui il tasto associato all'abilità Palla di pelo non compariva finché non veniva premuto.",
      "[*]Risolto il problema per cui Rabbia chimica con lo Scettro di Aghanim non faceva ottenere un bonus di danno e di amplificazione degli incantesimi.",
      "[*]Risolto il problema per cui l'abilità Lancio del corno si sbloccava con il Frammento anziché con lo Scettro di Aghanim.",
      "[*]Risolto il problema per cui l'abilità Pioggia del destino si sbloccava con il Frammento anziché con lo Scettro di Aghanim.",
      "[*]Risolto il problema per cui le abilità Boomerang del cacciatore e Diversivo si sbloccavano sia con il Frammento che con lo Scettro di Aghanim.",
      "[*]Risolto il problema per cui l'abilità Secondo chakra di Timbersaw si sbloccava con lo Scettro di Aghanim. Ora può essere sbloccata soltanto con il talento se Timbersaw seleziona l'abilità Chakram.",
      "[/list]"
    ],
    "commentcount": 1067,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 9610,
    "votedowncount": 1480,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1708471645,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 9610,
  "votes_down": 1480,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}