{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Drakens gåva",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Drakens gåva",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Vi jobbar hårt med en kommande uppdatering som vi kallar Crownfall, och vi ser fram emot att bli klara med den så att du får se vad vi har jobbat med. Vi tog en titt i kalendern och insåg att det har gått lång tid sedan Frostivus-uppdateringen. Vi ville inte att du skulle behöva vänta till Crownfall innan du fick något nytt innehåll. Som tur är har kalendergudarna i rättan tid lagt in en annan anledning till att fira: Gott kinesiskt nyår!",
      "Folk som är födda under drakens år är kända för sin generositet, tur och sitt välstånd. Låter trevligt. För de av oss som inte har en magisk drake som ger oss gåvogivande superkrafter har vi introducerat Dragon's Gift, som finns från och med nu till och med den 7 mars. Det fungerar precis som namnet antyder: skatter som bara kan ges som gåva och sedan öppnas av den som du valt som mottagare.",
      "För de av er som helst inte vill vänta på andras generositet har vi också traditionella Dragon's Hoard-skatter. Varje skatt eller gåva innehåller ett av 17 nya kosmetiska set med kinesiskt nyårstema, samt även en bonuschans till en Dragon's Gift eller en sällsynt effekt.",
      "Slutligen har varje skatt (och gåva) en chans till att innehålla Ancient Dragon King, det första kosmetiska föremålet någonsin för din ancient, med unika Dire and Radiant-stilar. Nu har du äntligen en chans att smycka din ancient med en mytologisk drake, vilket antagligen är något du alltid har önskat dig. Och om någon i matchen har en kan alla se den.",
      "I enlighet med detta tema i givandets anda har vi en annan gåva till (nästan) alla: vi har implementerat några nya fuskdetekteringskoder. Eller ja, det var för några veckor sedan, och sedan dess har vi tillbringat tiden med att samla ihop ett rejält gäng med fuskare. Du kommer förmodligen att märka färre av dem under matcherna när de automatiska avstängningarna träder i kraft.",
      "Av tradition innehåller uppdateringen även ett antal andra åtgärder och förbättringar:",
      "[b]Allmänna åtgärder:[/b]",
      "[list]",
      "[*]Åtgärdade ett antal problem som hindrade guider från att läsas in i spelet (om du manuellt aktiverade Steam-bakgrundsnedladdningar för att försöka lösa problemet är det säkert att inaktivera det igen).",
      "[*]Åtgärdade ett fall till där Roshan kunde vandra omkring: då Night Stalker använde Dark Ascension medan Roshan kanaliserade en tvillingport.",
      "[*]Åtgärdade ett problem där redan erövrade utposter kunde kanaliseras.",
      "[*]Åtgärdade ett problem där väljaren för neutrala föremål i vissa snabbanvändningslägen doldes när man släppte knappen.",
      "[*]Åtgärdade att Doubloon bara hade +2 manaregeneration istället för +2,5.",
      "[*]Åtgärdade att Eternal Shrouds magiresistens applicerades på illusioner.",
      "[*]Åtgärdade Eternal Shrouds interaktion med Medusas Mana Shield.",
      "[*]Åtgärdade att verktygstipset för Safety Bubble inte nämnde att självförvållad skada går igenom barriären.",
      "[*]Åtgärdade ett problem med effekterna för Shiva's Guard.",
      "[*]Åtgärdade att användning av Chens Holy Persuasion inte räknade med multiplikatorn för creepbelöning under utdelning av guld i turboläget.",
      "[*]Åtgärdade att Legion Commanders Aghanim's Shard fortfarande gav extra skydd och varaktighet för Overwhelming Odds.",
      "[*]Åtgärdade att Marcis Unleash aktiverades när Bloodstone blev upplockad eller släppt.",
      "[*]Åtgärdade att Muertas Gunslinger kunde tas bort.",
      "[*]Åtgärdade att knappbindning inte fungerade för att uppgradera Ogre Magis Multicast.",
      "[*]Åtgärdade en bugg som gjorde det möjligt för inaktiva illusioner från Phantom Lancer att blockera neutrala läger.",
      "[*]Åtgärdade en sällsynt serverkrasch med Primal Beasts Uproar.",
      "[*]Åtgärdade att kolumnlayouten i butiken inte visade Khanda och Harpoon.",
      "[*]Lade till magiresistens från intelligens och ökade skadan för universella hjältar till utökade verktygstips.",
      "[*]I turboläget visas nu meddelandet ”[Hjälte] valdes av båda lagen!” för alla, inte bara spelaren som försökte välja den redan valda hjälten.",
      "[*]Lade till förmågeikoner för Windrangers Gale Force vid användning av Compass of the Rising Gale.",
      "[*]Ökade prestandan vid visning av många chattmeddelanden från globala kanaler.",
      "[*]Åtgärdade flera verktygstips.",
      "[*]Uppdaterade tips som visas under pausen för speluppdatering 7.35b.",
      "[/list]",
      "[b]Korrigeringar i Ability Draft:[/b]",
      "[list]",
      "[*]Ett antal tidigare otillgängliga Scepter-/Shard-förmågor är nu tillgängliga. Vissa förmågor kan man få tillgång till genom att aktivera auto-användning på grundförmågan:",
      "[list]",
      "[*]Glacier ges med Marksmanship.",
      "[*]Crystal Clone ges med Frostbite.",
      "[*]Parting Shot ges med Pierce the Veil.",
      "[*]Work Horse ges med Stampede.",
      "[*]Burning Barrage ges med Skeleton Walk.",
      "[*]Friendly Shadow ges med Shadow Walk.",
      "[*]Counterspell Ally ges med Counterspell.",
      "[*]Lightning Hands ges med Arc Lightning.",
      "[*]Burning Army ges med Death Pact.",
      "[*]Unrefined Fireblast ges med Fireblast.",
      "[*]Poison Nova ges med Noxious Plague (den passiva förmågan till Poison Nova döljs).",
      "[/list]",
      "[*]Chemical Rage ger nu Greevil's Greed. Det visas som en buff istället för i förmågefältet.",
      "[*]Åtgärdade att Spirit Bear inte hade några förmågor.",
      "[*]Åtgärdade att Blinding Light inte visades som en valbar förmåga.",
      "[*]Åtgärdade att Alchemist hade fyra grundförmågor vid val, vilket knuffade bort andra förmågor.",
      "[*]Cloak and Dagger med Shard ger inte längre Sleeping Dart.",
      "[*]Ravage med Shard ger nu Dead in the Water istället för Tendrils of the Deep.",
      "[*]Invoker med Shard i Ability Draft uppdaterades till ny Shard för EMP istället för den tidigare Shard för Meteor.",
      "[*]Proximity Mines ger nu Minefield Sign som en extra förmåga.",
      "[*]Åtgärdade att Scepter-attacker med Shadow Wave och Dream Coil inte fungerade på närstridshjältar.",
      "[*]Åtgärdade att Spirits fungerade på illusioner när man har Scepter.",
      "[*]Åtgärdade att Ogre Magi fick Multicast istället för Dumb Luck som medfödd förmåga.",
      "[*]Åtgärdade Primal Spring, Pulse Nova, Rot, Infernal Blade och ett antal andra förmågor som inte gav stackar av Fiery Soul.",
      "[*]Åtgärdade att talanger inte dök upp för Starbreaker, Cinder Brew, Phantom Rush och Power Cogs när förmågan valdes på den ursprungliga hjälten.",
      "[*]Åtgärdade att Death Seeker inte kunde växlas med snabbtangent.",
      "[*]Åtgärdade att det inte gick att växla Call of the Wild Hawk för att byta mellan Hawk och Boar.",
      "[*]Åtgärdade att Hairball visades utan snabbtangent tills den växlades.",
      "[*]Åtgärdade att Chemical Rage med Scepter inte gav bonusskada och förmågeförstärkning.",
      "[*]Åtgärdade att Horn Toss gavs av Shard istället för Scepter.",
      "[*]Åtgärdade att Rain of Destiny gavs av Scepter istället för Shard.",
      "[*]Åtgärdade att Hunter's Boomerang och Decoy gavs av antingen Shard eller Scepter.",
      "[*]Åtgärdade att Timbersaw fick Second Chakram med Scepter. Den ges nu enbart med talangen om Timbersaw väljer Chakram.",
      "[/list]"
    ],
    "commentcount": 1127,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 12092,
    "votedowncount": 1787,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1710287651,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12092,
  "votes_down": 1787,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}