{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Το Δώρο του Δράκου",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707432002
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Το Δώρο του Δράκου",
    "posttime": 1707432004,
    "updatetime": 1707432004,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Δουλεύουμε σκληρά σε μια προσεχή ενημέρωση με το όνομα Crownfall και ανυπομονούμε να την ολοκληρώσουμε για να τη δείτε. Ρίξαμε μια ματιά στο ημερολόγιο και είδαμε ότι είχαν περάσει αρκετές εβδομάδες από την ενημέρωση Frostivus. Δεν θέλαμε να σας αφήσουμε χωρίς καθόλου νέο περιεχόμενο μέχρι την κυκλοφορία του Crownfall. Ευτυχώς, οι θεοί του ημερολογίου έφεραν άλλη μια γιορτή πάνω στην ώρα: Ευτυχισμένο το Σεληνιακό Νέο Έτος!",
      "Οι γεννημένοι τη Χρονιά του Δράκου φημίζονται για τη γενναιοδωρία, την ευημερία και την καλοτυχία τους. Ωραίο ακούγεται. Για εκείνους από εμάς που δεν έχουν έναν μαγικό δράκο να τους δώσει υπερδυνάμεις γενναιοδωρίας, παρουσιάζουμε το Δώρο του Δράκου σε στιλ κόκκινο φακελάκι, διαθέσιμο από τώρα μέχρι και τις 7 Μαρτίου. Λειτουργεί ακριβώς όπως το λέει το όνομά του: μπορείτε μόνο να χαρίσετε τους θησαυρούς, οι οποίοι ανοίγουν από το άτομο που επιλέξατε ως παραλήπτη.",
      "Και για όσους δεν μπορούν να βασιστούν στη γενναιοδωρία των άλλων, υπάρχουν επίσης οι παραδοσιακοί θησαυροί «Λάφυρα του Δράκου». Κάθε θησαυρός ή δώρο περιέχει ένα από τα 17 σετ κοσμητικών, με θέμα το Σεληνιακό Νέο Έτος, καθώς επίσης και μία επιπλέον ευκαιρία για ένα Δώρο Δράκου ή ένα νέο ασυνήθιστο εφέ.",
      "Τέλος, είναι πιθανό κάθε θησαυρός (και δώρο) να περιέχει το The Ancient Dragon King, το πρώτο κοσμητικό για το Αρχαίο σας, με μοναδικά στιλ για Dire και Radiant. Θα έχετε επιτέλους τη δυνατότητα να στολίσετε το Αρχαίο σας με έναν μυθικό δράκο, όπως, υποθέτουμε, πάντα επιθυμούσατε. Επίσης, αν τον έχει κάποιος στον αγώνα σας, θα μπορούν να τον δουν όλοι.",
      "Συνεχίζοντας με το «πνεύμα προσφοράς», έχουμε ένα δώρο ακόμα για (σχεδόν) όλους: Κυκλοφορήσαμε νέο κώδικα εντοπισμού παραβάσεων. Για να είμαστε ειλικρινείς, τον κυκλοφορήσαμε πριν μερικές εβδομάδες και έκτοτε συγκεντρώσαμε έναν αρκετά μεγάλο αριθμό παραβατών. Λογικά θα παρατηρήσετε λιγότερους στα παιχνίδια σας, καθώς θα κυκλοφορούν τα αυτοματοποιημένα κύματα αποκλεισμού.",
      "Για να μη χαλάσουμε την παράδοση, αυτή η ενημέρωση περιλαμβάνει και πολλές άλλες διορθώσεις και βελτιώσεις:",
      "[b]Γενικές διορθώσεις:[/b]",
      "[list]",
      "[*]Διορθώθηκαν πολλά προβλήματα που δεν επέτρεπαν τη φόρτωση των οδηγών εντός παιχνιδιού (αν είχατε ενεργοποιήσει τη λήψη παρασκηνίου Steam για να επιλύσετε αυτό το πρόβλημα, μπορείτε να την απενεργοποιήσετε και πάλι).",
      "[*]Διορθώθηκε μια ακόμα περίπτωση όπου ο Roshan έβγαινε βόλτα: Όταν ο Night Stalker εκτελούσε Dark Ascension ενώ ο Roshan διοχέτευε μια Δίδυμη Πύλη.",
      "[*]Διορθώθηκε πρόβλημα όπου ήταν δυνατή η διοχέτευση σε Φυλάκια που είχαν κατακτηθεί ήδη.",
      "[*]Διορθώθηκε πρόβλημα όπου το μενού επιλογής ουδέτερου αντικειμένου δεν εμφανιζόταν, όταν απελευθερωνόταν το πλήκτρο, σε μερικούς τύπους γρήγορης εκτέλεσης.",
      "[*]Διορθώθηκε πρόβλημα όπου το Doubloon είχε μόνο +2 αναπλήρωση ενέργειας αντί για +2,5.",
      "[*]Διορθώθηκε πρόβλημα όπου το Eternal Shroud παρείχε μαγική αντίσταση σε ψευδαισθήσεις.",
      "[*]Διορθώθηκαν οι αλληλεπιδράσεις του Eternal Shroud με το Mana Shield της Medusa.",
      "[*]Διορθώθηκε η επεξήγηση του Safety Bubble, που δεν ανέφερε ότι το φράγμα παρακάμπτει τη ζημιά εαυτού.",
      "[*]Διορθώθηκε πρόβλημα με τις επιδράσεις στο Shiva's Guard.",
      "[*]Διορθώθηκε πρόβλημα όπου το Holy Persuasion του Chen δεν λάμβανε υπόψη τον πολλαπλασιαστή αμοιβής χρυσού των κριπακίων σε Turbo, όταν παρείχε χρυσό κατά την εκτέλεση.",
      "[*]Διορθώθηκε πρόβλημα όπου το Aghanim's Shard της Legion Commander εξακολουθούσε να παρέχει επιπλέον άμυνα και διάρκεια για το Overwhelming Odds.",
      "[*]Διορθώθηκε πρόβλημα όπου το Unleash της Marci ενεργοποιούταν, όταν σήκωνε και όταν άφηνε το Bloodstone.",
      "[*]Διορθώθηκε πρόβλημα όπου ήταν δυνατό να καταλυθεί το Gunslinger της Muerta.",
      "[*]Διορθώθηκε πρόβλημα όπου δεν λειτουργούσε η δέσμευση πλήκτρου για την αναβάθμιση του Multicast του Ogre Magi.",
      "[*]Διορθώθηκε σφάλμα που επέτρεπε σε μη ενεργές ψευδαισθήσεις του Phantom Lancer να μπλοκάρουν ουδέτερους καταυλισμούς.",
      "[*]Διορθώθηκε σπάνιος απρόσμενος τερματισμός διακομιστή με το Uproar του Primal Beast.",
      "[*]Διορθώθηκε πρόβλημα όπου το Khanda και το Harpoon δεν εμφανίζονταν στη διάταξη στηλών της αγοράς.",
      "[*]Προστέθηκαν στατιστικά αυξημένης ζημιάς και μαγικής αντίστασης από ευφυΐα για τους επιδέξιους ήρωες, στις αναπτυσσόμενες επεξηγήσεις.",
      "[*]Σε Turbo, θα εμφανίζεται πλέον σε όλους το μήνυμα «Και οι δύο ομάδες επέλεξαν [Ήρωας]!» και όχι μόνο στον παίκτη που προσπάθησε να επιλέξει τον ήρωα.",
      "[*]Προστέθηκαν εικονίδια ξορκιού για το Gale Force της Windranger, όταν χρησιμοποιεί το Compass of the Rising Gale.",
      "[*]Βελτιώθηκαν οι επιδόσεις κατά την εμφάνιση πολλών μηνυμάτων συνομιλίας από παγκόσμια κανάλια.",
      "[*]Διορθώθηκαν διάφορα προβλήματα επεξηγήσεων.",
      "[*]Ενημερώθηκαν οι συμβουλές που εμφανίζονται κατά την παύση, για την Ενημέρωση παιχνιδιού 7.35b.",
      "[/list]",
      "[b]Διορθώσεις Ability Draft:[/b]",
      "[list]",
      "[*]Χορηγείται πλέον μια σειρά ικανοτήτων Aghanim's Scepter και Aghanim's Shard, που δεν ήταν διαθέσιμες προηγουμένως. Η πρόσβαση σε μερικές ικανότητες γίνεται με εναλλαγή της αυτόματης εκτέλεσης στο βασικό ξόρκι:",
      "[list]",
      "[*]Το Glacier χορηγείται με το Marksmanship.",
      "[*]Το Crystal Clone χορηγείται με το Frostbite.",
      "[*]Το Parting Shot χορηγείται με το Pierce the Veil.",
      "[*]Το Work Horse χορηγείται με το Stampede.",
      "[*]Το Burning Barrage χορηγείται με το Skeleton Walk.",
      "[*]Το Friendly Shadow χορηγείται με το Shadow Walk.",
      "[*]Το Counterspell Ally χορηγείται με το Counterspell.",
      "[*]Το Lightning Hands χορηγείται με το Arc Lightning.",
      "[*]Το Burning Army χορηγείται με το Death Pact.",
      "[*]Το Unrefined Fireblast χορηγείται με το Fireblast.",
      "[*]Το Poison Nova χορηγείται με το Noxious Plague (η παθητική ικανότητα του Poison Nova είναι κρυφή).",
      "[/list]",
      "[*]Το Greevil's Greed χορηγείται τώρα με το Chemical Rage. Θα εμφανίζεται ως επαύξηση αντί για πάνω στην μπάρα ικανοτήτων.",
      "[*]Διορθώθηκε η αρκούδα του Lone Druid που δεν είχε καμία ικανότητα.",
      "[*]Διορθώθηκε το Blinding Light που δεν εμφανιζόταν ως ικανότητα με δυνατότητα επιλογής.",
      "[*]Διορθώθηκε πρόβλημα που ο Alchemist είχε δυνατότητα επιλογής 4 βασικών ικανοτήτων, που προκαλούσε ώθηση των άλλων ικανοτήτων κατά μία θέση.",
      "[*]Το Cloak and Dagger δεν χορηγεί πλέον το Sleeping Dart.",
      "[*]Το Aghanim's Shard του Ravage χορηγεί τώρα το Dead in the Water αντί για το Tendrils of the Deep.",
      "[*]Η ικανότητα που χορηγεί το Aghanim's Shard στον Invoker ενημερώθηκε στο νέο EMP του Aghanim's Shard αντί για το παλιό Chaos Meteor του Aghanim's Shard.",
      "[*]Το Proximity Mines τώρα χορηγεί το Minefield Sign ως επιπλέον ικανότητα.",
      "[*]Διορθώθηκε πρόβλημα όπου οι επιθέσεις του Shadow Wave και του Dream Coil δεν λειτουργούσαν σε αγχέμαχους ήρωες.",
      "[*]Διορθώθηκε πρόβλημα όπου το Spirits λειτουργούσε σε ψευδαισθήσεις, όταν είχατε ένα Aghanim's Scepter.",
      "[*]Διορθώθηκε πρόβλημα όπου ο Ogre Magi λάμβανε το Multicast αντί για το Dumb Luck ως εγγενή ικανότητα.",
      "[*]Διορθώθηκαν τα Primal Spring, Pulse Nova, Rot, Infernal Blade και ένα σωρό άλλες ικανότητες που δεν χορηγούσαν συσσωρεύσεις Fiery Soul.",
      "[*]Διορθώθηκε πρόβλημα όπου τα ταλέντα δεν εμφανίζονταν για τα Starbreaker, Cinder Brew, Phantom Rush και Power Cogs, όταν τα επέλεγε ο αρχικός ήρωας.",
      "[*]Διορθώθηκε πρόβλημα όπου δεν ήταν δυνατή η εναλλαγή του Death Seeker με πλήκτρο συντόμευσης.",
      "[*]Διορθώθηκε πρόβλημα όπου δεν ήταν δυνατή η εναλλαγή του Call of the Wild Hawk για εναλλαγή μεταξύ γερακιού και κάπρου.",
      "[*]Διορθώθηκε πρόβλημα όπου το Hairball εμφανιζόταν χωρίς πλήκτρο συντόμευσης μέχρι να γίνει εναλλαγή του.",
      "[*]Διορθώθηκε πρόβλημα όπου το Aghanim's Scepter του Chemical Rage δεν παρείχε επιπλέον ζημιά και ενίσχυση ξορκιών.",
      "[*]Διορθώθηκε πρόβλημα όπου το Aghanim's Shard χορηγούσε το Horn Toss αντί για το Aghanim's Scepter.",
      "[*]Διορθώθηκε πρόβλημα όπου το Aghanim's Scepter χορηγούσε το Rain of Destiny αντί για το Aghanim's Shard.",
      "[*]Διορθώθηκε πρόβλημα όπου τα Hunter's Boomerang και Decoy χορηγούνταν είτε από το Aghanim's Shard είτε από το Aghanim's Scepter.",
      "[*]Διορθώθηκε πρόβλημα όπου ο Timbersaw λάμβανε το Second Chakram με το Aghanim's Scepter. Χορηγείται πλέον με το ταλέντο, αν ο Timbersaw επιλέξει το Chakram.",
      "[/list]"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1707432004,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}