{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Le cadeau du dragon",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707432002
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Le cadeau du dragon",
    "posttime": 1707432004,
    "updatetime": 1707432004,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Nous travaillons d'arrachepied sur une prochaine mise à jour appelée « La chute de la Couronne ». Nous avons hâte de boucler le projet pour que vous puissiez découvrir le fruit de nos efforts. Un coup d'œil sur le calendrier nous a suffi pour nous rendre compte que la mise à jour de Frostivus est sortie depuis déjà un bon moment. Cependant, nous ne souhaitons pas vous faire attendre jusqu'à ce que « La chute de la Couronne » soit prête pour vous présenter du nouveau contenu. Heureusement, les dieux du calendrier ont décrété une nouvelle fête pile au milieu de ce creux : le Nouvel An lunaire !",
      "Les gens qui naissent pendant l'année du dragon sont connus pour leur générosité, prospérité et bonne fortune. Il y en a qui ont de la chance ! Pour nous autres en manque d'un dragon magique qui nous permettrait d'étaler notre générosité, nous vous présentons le « cadeau du dragon », glissé dans une enveloppe rouge, il est disponible dès maintenant et jusqu'au 7 mars. Ces cadeaux fonctionnent comme leur nom l'indique : ces trésors peuvent uniquement être donnés, et seules les personnes à qui vous les avez offerts peuvent les ouvrir.",
      "Si vous préférez ne pas compter sur la générosité des autres, les traditionnels trésors du dragon sont également disponibles. Chaque trésor ou cadeau contient l'un des 17 nouveaux ensembles cosmétiques sur le thème du Nouvel An lunaire, ainsi qu'une chance de recevoir un cadeau du dragon ou un nouvel effet inhabituel.",
      "Enfin, chaque trésor (et cadeau) a une faible chance de contenir le roi dragon de l'Ancient, le tout premier cosmétique pour votre Ancient, avec des styles uniques pour le Dire et le Radiant. Vous pouvez enfin exaucer votre vœu le plus cher : parer votre Ancient avec un dragon mythique. En plus, si quelqu'un en a un dans votre match, tout le monde le verra.",
      "Pour rester dans le thème de l'esprit de générosité, nous avons un autre cadeau pour (presque) tout le monde : un tout nouveau code de détection de tricherie. Eh bien en fait, nous l'avons déployé il y a quelques semaines, et depuis, nous avons accumulé un tas de tricheurs et tricheuses assez conséquent. Vous devriez remarquer leur absence lors de vos parties à chaque nouvelle vague de bannissements automatiques.",
      "Comme le veut la tradition, cette mise à jour comporte également un certain nombre de corrections et d'améliorations.",
      "[b]Corrections générales[/b]",
      "[list]",
      "[*]Correction d'un certain nombre de problèmes qui empêchaient les guides de se charger en jeu (si vous activiez manuellement les téléchargements Steam en fond pour contourner ce problème, vous pouvez les désactiver maintenant).",
      "[*]Correction d'un autre cas où Roshan pouvait s'en aller en balade quand Night Stalker lançait Dark Ascension pendant que Roshan canalisait un portail.",
      "[*]Correction du problème suivant : il arrivait que les avant-postes déjà capturés puissent être canalisés.",
      "[*]Correction du problème suivant : l'outil de sélection d'items neutres se fermait lorsque l'on relâchait les touches avec certains modes d'utilisation rapide.",
      "[*]Correction du problème suivant : Doubloon accordait +2 de régénération de mana au lieu de +2,5.",
      "[*]Correction du problème suivant : la résistance à la magie d'Eternal Shroud s'appliquait aux illusions.",
      "[*]Correction des interactions entre Eternal Shroud et Mana Shield de Medusa.",
      "[*]Correction de la description de Safety Bubble qui omettait de mentionner que la protection contournait les dégâts auto-infligés.",
      "[*]Correction d'un problème avec les effets de Shiva's Guard.",
      "[*]Correction du problème suivant : Holy Persuasion de Chen ne prenait pas en considération le multiplicateur de primes des creeps en mode turbo lors de la distribution d'or.",
      "[*]Correction du problème suivant : avec l'Aghanim's Shard, Overwhelming Odds de Legion Commander accordait encore un bonus d'armure et de durée.",
      "[*]Correction du problème suivant : Unleash de Marci se déclenchait quand Bloodstone était ramassé ou lâché.",
      "[*]Correction du problème suivant : Gunslinger de Muerta pouvait être dissipée.",
      "[*]Correction du problème suivant : le raccourci défini pour améliorer Multicast d'Ogre Magi ne fonctionnait pas.",
      "[*]Correction du bug suivant : les illusions inactives de Phantom Lancer pouvaient bloquer les camps de creeps neutres.",
      "[*]Correction d'un plantage rare avec Uproar de Primal Beast.",
      "[*]Correction du problème suivant : la disposition des items en colonne dans l'échoppe n'affichait ni Khanda ni Harpoon.",
      "[*]Ajout dans les descriptions des unités héroïques polyvalentes de la résistance à la magie en fonction de l'intelligence et de l'augmentation des dégâts.",
      "[*]En mode Turbo, le message « [une unité héroïque] a été choisi(e) par les deux équipes ! » s'affiche pour tout le monde, pas seulement pour la personne qui a essayé de choisir une unité déjà prise.",
      "[*]Ajout d'icônes de sorts pour Gale Force de Windranger avec l'Arcane Boussole du cyclone naissant.",
      "[*]Amélioration des performances lorsqu'un grand nombre de messages de chats globaux sont affichés.",
      "[*]Correction de plusieurs problèmes avec les descriptions.",
      "[*]Les astuces affichées pendant les pauses ont été mises à jour avec la mise à jour du gameplay 7.35b.",
      "[/list]",
      "[b]Corrections apportées au mode Ability Draft[/b]",
      "[list]",
      "[*]Un certain nombre de capacités améliorées par l'Aghanim's Scepter ou l'Aghanim's Shard sont désormais disponibles. Certaines d'entre elles peuvent être lancées en activant l'auto-utilisation de la capacité de base. C'est le cas des capacités suivantes :",
      "[list]",
      "[*]Glacier accordée avec Marksmanship",
      "[*]Crystal Clone accordée avec Frostbite",
      "[*]Parting Shot accordée avec Pierce the Veil",
      "[*]Work Horse accordée avec Stampede",
      "[*]Burning Barrage accordée avec Skeleton Walk",
      "[*]Friendly Shadow accordée avec Shadow Walk",
      "[*]Counterspell Ally accordée avec Counterspell",
      "[*]Lightning Hands accordée avec Arc Lightning",
      "[*]Burning Army accordée avec Death Pact",
      "[*]Unrefined Fireblast accordée avec Fireblast",
      "[*]Poison Nova accordée avec Noxious Plague (la capacité passive de Poison Nova est masquée)",
      "[/list]",
      "[*]Chemical Rage accorde maintenant Greevil's Greed. Elle apparaitra comme un effet au lieu de s'afficher au-dessus de la capacité.",
      "[*]Correction du problème suivant : Spirit Bear n'avait aucune capacité.",
      "[*]Correction du problème suivant : Blinding Light n'apparaissait pas comme une capacité sélectionnable.",
      "[*]Correction du problème suivant : Alchemist avait 4 capacités de base sélectionnables, ce qui décalait les autres capacités d'une place.",
      "[*]Cloak and Dagger avec l'Aghanim's Shard n'accorde plus Sleeping Dart.",
      "[*]Ravage avec l'Aghanim's Shard accorde maintenant Dead in the Water au lieu de Tendrils of the Deep.",
      "[*]La capacité d'Invoker sélectionnable avec l'Aghanim's Shard est désormais E.M.P. au lieu de Chaos Meteor.",
      "[*]Proximity Mines accorde maintenant une capacité supplémentaire, Minefield Sign.",
      "[*]Correction du problème suivant : les attaques de Shadow Wave et de Dream Coil avec l'Aghanim's Scepter ne fonctionnaient pas sur les unités héroïques au corps à corps.",
      "[*]Correction du problème suivant : avec l'Aghanim's Scepter, Spirits fonctionnait sur les illusions.",
      "[*]Correction du problème suivant : Ogre Magi obtenait Multicast au lieu de Dumb Luck comme capacité innée.",
      "[*]Correction du problème suivant : Primal Spring, Pulse Nova, Rot, Infernal Blade et un certain nombre d'autres capacités n'accordaient pas de charges de Fiery Soul.",
      "[*]Correction du problème suivant : les talents n'apparaissaient pas pour Starbreaker, Cinder Brew, Phantom Rush et Power Cogs quand la capacité était sélectionnée pour l'unité héroïque originelle.",
      "[*]Correction du problème suivant : il n'était pas possible d'alterner entre Death Pulse et Death Seeker avec un raccourci.",
      "[*]Correction du problème suivant : on ne pouvait pas faire alterner Call of the Wild Hawk entre le sanglier et le faucon.",
      "[*]Correction du problème suivant : Hairball apparaissait sans raccourci jusqu'à ce que la capacité soit activée/désactivée.",
      "[*]Correction du problème suivant : Chemical Rage avec l'Aghanim's Scepter ne donnait pas de dégâts bonus ni d'amplification des sorts.",
      "[*]Correction du problème suivant : Horn Toss était accordée avec l'Aghanim's Shard au lieu de l'Aghanim's Scepter.",
      "[*]Correction du problème suivant : Rain of Destiny était accordée avec l'Aghanim's Scepter au lieu de l'Aghanim's Shard.",
      "[*]Correction du problème suivant : Boomerang et Decoy étaient accordées avec l'Aghanim's Shard ou l'Aghanim's Scepter.",
      "[*]Correction du problème suivant : Timbersaw obtenait Second Chakram avec l'Aghanim's Scepter. La capacité n'est maintenant accordée avec le talent que si Timbersaw sélectionne Chakram.",
      "[/list]"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1707432004,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}