{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "A sárkány ajándéka",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "A sárkány ajándéka",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "Keményen dolgozunk egy közelgő frissítésen, amelyet „Crownfallnak” nevezünk, és alig várjuk, hogy befejezzük és láthassátok, min dolgoztunk. Ránéztünk egy naptárra, és észrevettük, hogy már több hét telt el a Frostivus frissítés óta, és nem akartuk, hogy a Crownfallig kelljen várnotok, mielőtt valami új tartalmat kaptok. Szerencsére a naptáristenek épp időben érkeztek egy másik ünneppel: boldog holdújévet!",
      "A Sárkány évében születettek nagylelkűségükről, jólétükről és jó szerencséjükről ismertek. Kellemes lehet. Azoknak közülünk, akiknek nincs egy ajándékozó szupererőt adó mágikus sárkánya, bemutattuk a piros boríték témájú Sárkány Ajándékát, ami mostantól március 7-ig érhető el. Ezek pontosan a nevük szerint működnek: a kincsek csak ajándékozhatók, és csak azok tudják kinyitni, akiket te címzettnek választasz.",
      "Azoknak pedig, akik inkább nem várnának mások nagylelkűségére, vannak hagyományos Sárkányzsákmány Kincseink is. Mindegyik kincs vagy ajándék tartalmaz egyet a 17 új holdújév témájú díszítő szettből, és bónusz esélyt egy Sárkány Ajándékára vagy új rendkívüli effektre.",
      "Végül, minden kincs (és ajándék) tartalmazhatja az Ősi Sárkánykirályt, a legelső díszítőt az Ősödhöz, egyedi Dire és Radiant stílusokkal. Most végre lehetőséged lesz egy mitikus sárkánnyal díszíteni az Ősödet, ahogy feltehetőleg mindig is akartad. Plusz, ha valakinek van a meccsedben, mindenki láthatja.",
      "Az „ajándékozás szellemének” témájánál maradva van egy másik ajándékunk (majdnem) mindenkinek: kiadtunk némi új csalásészlelő programkódot. Nos, igazából már néhány hete kiadtuk, és az azóta eltelt időt igen szép számú csaló összegyűjtésével töltöttük. Valószínűleg kevesebbet fogsz látni belőlük a játékaidban, ahogy az automatizált kitiltási hullámok megindulnak.",
      "A hagyományoknak megfelelően ez a frissítés számos egyéb javítást és fejlesztést is tartalmaz:",
      "[b]Általános javítások:[/b]",
      "[list]",
      "[*]Javítottunk néhány hibát, amelyek megakadályozták az útmutatók játékon belüli betöltését (ha manuálisan engedélyezted a Steam háttérletöltéseit, hogy megpróbáld orvosolni ezt, nyugodtan újra letilthatod).",
      "[*]Javítottunk egy újabb esetet, amikor Roshan elkószálhatott: amikor Night Stalker Dark Ascensiont varázsolt, miközben Roshan fenntartásban volt egy Ikerkapun.",
      "[*]Javítottunk egy hibát, aminél már elfoglalt helyőrségeken is lehetett fenntartást végezni.",
      "[*]Javítottunk egy hibát, aminél a semleges tárgyválasztó egyes gyorsvarázslási módokban billentyűfelengedéskor eltűnt.",
      "[*]Javítottuk, hogy a Doubloonnak +2,5 helyett csak +2 manatöltődése volt.",
      "[*]Javítottuk, hogy az Eternal Shroud mágiaellenállása alkalmazódott illúziókra.",
      "[*]Javítottuk az Eternal Shroud és Medusa Mana Shieldje közötti kölcsönhatást.",
      "[*]Javítottuk, hogy a Safety Bubble elemleírása nem említette, hogy a védőpajzs az önsebzést átengedi.",
      "[*]Javítottunk egy hibát a Shiva's Guard effektjeinél.",
      "[*]Javítottuk, hogy Chen Holy Persuasionje nem vette figyelembe a Turbó creepjutalom-szorzóját, amikor varázsláskor aranyat adott.",
      "[*]Javítottuk, hogy Legion Commander Aghanim's Shardja továbbra is adott páncél- és időtartambónuszt az Overwhelming Oddsnak.",
      "[*]Javítottuk, hogy a Bloodstone felvétele és eldobása aktiválta Marci Unleash képességét.",
      "[*]Javítottuk, hogy Muerta Gunslinger képessége megszüntethető volt.",
      "[*]Javítottuk, hogy Ogre Magi Multicastjának fejlesztéséhez nem működött a billentyű-hozzárendelés.",
      "[*]Javítottunk egy hibát, amely lehetővé tette az inaktív Phantom Lancer illúzióknak semleges táborok blokkolását.",
      "[*]Javítottunk egy ritka szerverösszeomlást Primal Beast Uproar képességénél.",
      "[*]Javítottuk, hogy a bolt „oszlopok” elrendezésben nem jelenítette meg a Khandát és a Harpoont.",
      "[*]Hozzáadtuk az intelligenciából kapott mágiaellenállást és megnövelt sebzést az Univerzális hősök kibővített elemleírásához.",
      "[*]Turbóban az „x hőst mindkét csapat választotta!” üzenetet mindenkinek megmutatjuk, nem csak annak a játékosnak, aki egy már választott hőst próbált választani.",
      "[*]Varázslatikonokat adtunk Windranger's Gale Force-ához a Compass of the Rising Gale használatakor.",
      "[*]Növeltük a teljesítményt sok üzenet mutatásakor a globális csatornákról.",
      "[*]Javítottunk különféle képességleírási hibákat.",
      "[*]Frissítettük a szünet közben mutatott javaslatokat a 7.35b játékmenet-frissítéshez.",
      "[/list]",
      "[b]Ability Draft javítások:[/b]",
      "[list]",
      "[*]Mostantól egy sor korábban nem elérhető Scepteres/Shardos képesség meg van adva. Egyes képességek az alapképesség auto-varázslásának átváltásával érhetők el:",
      "[list]",
      "[*]A Marksmanship megadja a Glaciert.",
      "[*]A Frostbite megadja a Crystal Clone-t.",
      "[*]A Pierce the Veil megadja a Parting Shotot.",
      "[*]A Stampede megadja a Work Horse-t.",
      "[*]A Skeleton Walk megadja a Burning Barrage-t.",
      "[*]A Shadow Walk megadja a Friendly Shadow-t.",
      "[*]A Counterspell megadja a Counterspell Allyt.",
      "[*]Az Arc Lightning megadja a Lightning Handset.",
      "[*]A Death Pact megadja a Burning Armyt.",
      "[*]A Fireblast megadja az Unrefined Fireblastot.",
      "[*]A Noxious Plague megadja a Poison Novát (a Poison Nova passzív képessége el van rejtve).",
      "[/list]",
      "[*]A Chemical Rage mostantól megadja a Greevil's Greedet. Erősítésként jelenik meg, nem a képességsávon.",
      "[*]Javítottuk, hogy a Spirit Bearnek nem voltak képességei.",
      "[*]Javítottuk, hogy a Blinding Light nem jelent meg választható képességként.",
      "[*]Javítottuk, hogy Alchemistnek négy alapképessége volt választáskor, ami eggyel odébb tolta a többi képességet.",
      "[*]A Shard a Cloak and Daggernél mostantól nem adja meg a Sleeping Dartot.",
      "[*]A Shard a Ravage-nél mostantól Dead in the Watert ad Tendrils of the Deep helyett.",
      "[*]Invoker Ability Draft Shardja az új Shardos E.M.P.-re lett frissítve a régi Shardos Meteor helyett.",
      "[*]A Proximity Mines mostantól további képességként megadja a Minefield Signt.",
      "[*]Javítottuk, hogy a Shadow Wave és a Dream Coil Scepteres támadásai nem működtek közelharci hősökön.",
      "[*]Javítottuk, hogy a Spirits működött illúziókon, amikor van Sceptered.",
      "[*]Javítottuk, hogy Ogre Magi Multicastot kapott vele született képességként Dumb Luck helyett.",
      "[*]Javítottuk, hogy a Primal Spring, Pulse Nova, Rot, Infernal Blade és számos más képesség nem adott Fiery Soul példányokat.",
      "[*]Javítottuk, hogy az Adottságok nem jelentek meg a Starbreaker, Cinder Brew, Phantom Rush és Power Cogs esetében, amikor az eredeti hősük választja a képességeket.",
      "[*]Javítottuk, hogy a Death Seeker nem váltható át gyorsbillentyűvel.",
      "[*]Javítottuk, hogy nem lehetett átváltani a Call of the Wild sólymot a sólyom és a vadkan közötti váltáshoz.",
      "[*]Javítottuk, hogy az átváltásáig a Hairball gyorsbillentyű nélkül látszott.",
      "[*]Javítottuk, hogy a Scepteres Chemical Rage nem adott többletsebzést és varázslaterősítést.",
      "[*]Javítottuk, hogy a Scepter helyett a Shard adta a Horn Tosst.",
      "[*]Javítottuk, hogy a Scepter helyett a Shard adta a Rain of Destinyt.",
      "[*]Javítottuk, hogy a Scepter és a Shard is megadta a Hunter's Boomerangot és a Decoyt.",
      "[*]Javítottuk, hogy Timbersaw a Scepterrel megkapta a Second Chakramot. Mostantól csak akkor van megadva az Adottsággal, ha Timbersaw kiválasztja a Chakramot.",
      "[/list]"
    ],
    "commentcount": 727,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "mod_require_rereview"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 3632,
    "votedowncount": 648,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1707511502,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707433100,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 3632,
  "votes_down": 648,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}