{
  "gid": "4018968739232966310",
  "clan_steamid": "103582791433224455",
  "event_name": "Ejderhanın Hediyesi",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1707432000,
  "rtime32_end_time": 1707436801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "bf8677f142d7185726d462842d1fc9f7a4e70ecb.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1707419595
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1707345633
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1707511502
      }
    ]
  },
  "announcement_body": {
    "gid": "4018968739232966311",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ejderhanın Hediyesi",
    "posttime": 1707432004,
    "updatetime": 1707511502,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/bf8677f142d7185726d462842d1fc9f7a4e70ecb.png[/img]",
      "\"Tacın Düşüşü\" adını verdiğimiz yaklaşan güncelleme üzerinde yoğun bir şekilde çalışıyoruz. Bu güncellemeyi tamamlamak ve sizinle paylaşmak için heyecanla çalışmalarımıza devam ediyoruz. Takvime bir göz attık ve Frostivus güncellemesini yayınladığımızdan bu yana birkaç haftadan fazla zaman geçtiğini fark ettik. Bu yüzden yeni içerik için Tacın Düşüşü güncellemesine kadar beklemenizi istemedik. Neyse ki takvim tanrıları başka bir tatil ile tam zamanında yetişti: Ay Yeni Yılınız Kutlu Olsun!",
      "Ejderha yılında doğan insanlar cömertlik, refah ve iyi şansa sahip olmalarıyla bilinirler. Çok şanslılar. Biz de süper güçler veren büyülü bir ejderhası olmayanlar için bugünden itibaren 7 Mart'a kadar kullanabilecekleri kırmızı zarflarda verilen Ejderhanın Hediyesi özelliğini sunuyoruz. Bu hediyeler yalnızca hediyeyi verdiğiniz kişi tarafından açılabilir.",
      "Başkalarının cömertliğine kalmak istemiyorsanız Ejderhanın Zulası hazinelerimiz de var. Her hazine veya hediye, 17 yeni Ay Yeni Yılı temalı kozmetik setinden birini ve ayrıca bir Ejderhanın Hediyesi veya yeni bir sıra dışı efekt için bonus şansı içerir.",
      "Üstelik her hazine veya hediyenin, Dire ve Radiant takımları için farklı görünüme sahip ilk Kadim Kale kozmetik öğesi olan Antik Ejderha Kralı öğesini içerme şansı vardır. Artık sonunda Kadim Kale'nizi her zaman istediğiniz gibi efsanevi bir ejderhayla süsleyebilirsiniz. Ayrıca, maçınızdaki herhangi biri bu öğeyi kuşanmışsa herkes tarafından görülebilir.",
      "Bu “hediye verme ruhu” temasına uygun olarak, (neredeyse) herkes için başka bir hediyemiz daha var: Yeni bir hile algılama kodu yayınladık. Yani aslında birkaç hafta önce uygulamaya başladık ve o zamandan bu yana çok sayıda hileciyi yakaladık. Otomatik yasaklama dalgaları uygulandıkça oyunlarınızda muhtemelen daha az hileci olduğunu fark edeceksiniz.",
      "Her zamanki gibi bu güncelleme aynı zamanda bir dizi başka düzeltme ve iyileştirme de içeriyor:",
      "[b]Genel Düzeltmeler:[/b]",
      "[list]",
      "[*]Rehberlerin oyun içinde yüklenmesini engelleyen bir dizi sorun düzeltildi (Bu sorunu çözmeye çalışmak için Steam arka plan indirmelerini manuel olarak etkinleştirdiyseniz, tekrar güvenle devre dışı bırakabilirsiniz).",
      "[*]Roshan'ın yanlış yolda gezinmesine izin veren başka bir sorun düzeltildi: Roshan bir İkiz Geçit'ten geçerken Night Stalker'ın Dark Ascension'ı kullanması buna neden olmaktaydı.",
      "[*]Zaten ele geçirilen ileri karakollara yönlendirilme yapılabilmesi sorunu düzeltildi.",
      "[*]Bazı hızlı kullan modlarında tuş bırakıldığında tarafsız eşya seçicinin gizlenmesine neden olan sorun çözüldü.",
      "[*]Doubloon'un +2,5 yerine +2 mana yenilenmesi vermesi düzeltildi.",
      "[*]Eternal Shroud'un büyü direncinin illüzyonlara uygulanması düzeltildi.",
      "[*]Eternal Shroud'un Medusa'nın Mana Shield yeteneği ile etkileşimleri düzeltildi.",
      "[*]Safety Bubble'ın eşya açıklamasında, bariyerin kendi kendine verilen hasarı yok saydığından bahsetmemesi düzeltildi.",
      "[*]Shiva's Guard'ın efektleriyle ilgili bir sorun düzeltildi.",
      "[*]Chen'in Holy Persuasion yeteneğinin Turbo modunda yaratıkların ödül çarpanını hesaba katmadan altın vermesi düzeltildi.",
      "[*]Legion Commander'ın Aghanim's Shard'ının, Overwhelming Odds için fazladan zırh ve süre vermeye devam etmesine neden olan bir hata düzeltildi.",
      "[*]Bloodstone'un yere bırakılıp alınmasının Marci'nin Unleash yeteneğini tetiklemesi düzeltildi.",
      "[*]Muerta'nın Gunslinger yeteneğinin etkisinin geçirilebilir olması düzeltildi.",
      "[*]Tuş atamasının Ogre Magi'ın Multicast yeteneğinde kullanılamaması düzeltildi.",
      "[*]Etkin olmayan Phantom Lancer illüzyonlarının tarafsız yaratık kamplarını engellemesine neden olan bir hata düzeltildi.",
      "[*]Primal Beast'in Uproar yeteneğinin nadir görülen bir sunucu çökmesine neden olması düzeltildi.",
      "[*]Dükkânın sütun düzeninde Khanda ve Harpoon'un görünmemesi düzeltildi.",
      "[*]Genişletilmiş özellik açıklamalarına, Evrensel kahramanlar için zekâ özelliğinden büyü direnci ve hasar bonusu verildiği eklendi.",
      "[*]Turbo modunda \"[Kahraman] her iki takım tarafından seçildi!\" mesajının sadece kahramanı seçmeye çalışan oyuncu yerine herkese gösterilmesi sağlandı.",
      "[*]Yükselen Fırtınanın Pusulası öğesini kuşanıldığında Windranger'ın Gale Force yeteneğine büyü simgeleri eklendi.",
      "[*]Küresel kanallardan birçok sohbet mesajı görüntülenmesinin performansı iyileştirildi.",
      "[*]Çeşitli eşya ve yetenek açıklaması sorunları düzeltildi.",
      "[*]Maç duraklatma ipuçları, 7.35b oynanış yaması dikkate alınarak güncellendi.",
      "[/list]",
      "[b]Yetenek Çekilişi Düzeltmeleri:[/b]",
      "[list]",
      "[*]Daha önce kullanılamayan bir dizi Scepter/Shard yeteneği artık eklendi. Bazı yeteneklere temel yetenek üzerinde otomatik kullanma özelliği kullanılarak erişilebilir:",
      "[list]",
      "[*]Marksmanship yeteneği Glacier verir.",
      "[*]Frostbite yeteneği Crystal Clone verir.",
      "[*]Pierce the Veil yeteneği Parting Shot verir.",
      "[*]Stampede yeteneği Work Horse verir.",
      "[*]Skeleton Walk yeteneği Burning Barrage verir.",
      "[*]Shadow Walk yeteneği Friendly Shadow verir.",
      "[*]Counterspell yeteneği Counterspell Ally verir.",
      "[*]Arc Lightning yeteneği Lightning Hands verir.",
      "[*]Death Pact yeteneği Burning Army verir.",
      "[*]Fireblast yeteneği Unrefined Fireblast verir.",
      "[*]Noxious Plague yeteneği Poison Nova verir (Poison Nova pasif yeteneği gizlidir).",
      "[/list]",
      "[*]Chemical Rage yeteneği Greevil's Greed verir. Yetenek yuvasında görünmek yerine bir güçlendirme olarak görünür.",
      "[*]Spirit Bear'ın herhangi bir yeteneğe sahip olmaması düzeltildi.",
      "[*]Blinding Light'ın seçilebilir yetenek olarak görünmemesi düzeltildi.",
      "[*]Alchemist'in seçildiğinde 4 temel yeteneğe sahip olması nedeniyle diğer yeteneklerin değişmesine neden olması düzeltildi.",
      "[*]Shard ile Cloak and Dagger artık Sleeping Dart vermiyor.",
      "[*]Shard ile Ravage artık Tendrils of the Deep yerine Dead in the Water yeteneğini verir.",
      "[*]Invoker'ın Shard'ı Chaos Meteor yerine EMP yeteneğini yükseltmek için güncellendi.",
      "[*]Proximity Mines artık ek bir yetenek olarak Minefield Sign verir.",
      "[*]Shadow Wave ve Scepter'lı Dream Coil yeteneklerinin yakın dövüşçü kahramanlarda çalışmaması düzeltildi.",
      "[*]Spirits yeteneğinin Scepter ile illüzyonlar üzerinde çalışması düzeltildi.",
      "[*]Ogre Magi'nin Dumb Luck yerine Multicast'e sahip olması düzeltildi.",
      "[*]Primal Spring, Pulse Nova, Rot, Infernal Blade ve diğer pek çok yeteneğin Fiery Soul istifi vermemesi düzeltildi.",
      "[*]Starbreaker, Cinder Brew, Phantom Rush ve Power Cog yetenek hünerlerinin orijinal kahramanda seçildiğinde görünmemesi düzeltildi.",
      "[*]Death Seeker'ın kısayol tuşuyla açılıp kapatılmaması düzeltildi.",
      "[*]Call of the Wild yeteneğinin Hawk ve Boar arasında geçiş yapamaması düzeltildi.",
      "[*]Hairball yeteneğinin tuşunun açılıp kapatılana kadar görünmemesi düzeltildi.",
      "[*]Scepter'lı Chemical Rage yeteneğinin fazladan hasar ve büyü artırımı vermemesi düzeltildi.",
      "[*]Horn Toss yeteneğinin Scepter yerine Shard ile verilmesi düzeltildi.",
      "[*]Rain of Destiny yeteneğinin Shard yerine Scepter ile verilmesi düzeltildi.",
      "[*]Hunter's Boomerang ve Decoy yeteneklerinin hem Scepter hem de Shard ile verilmesi düzeltildi.",
      "[*]Timbersaw'ın Scepter ile Second Chakram alması düzeltildi. Artık sadece Timbersaw Chakram'ı seçerse hüner ile alabilir.",
      "[/list]"
    ],
    "commentcount": 1129,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1707433099_0",
      "ModAct_873083815_1707511768_4"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "4209245823540554298",
    "event_gid": "4018968739232966310",
    "voteupcount": 12092,
    "votedowncount": 1787,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4209245823540554298",
  "rtime32_last_modified": 1710287801,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1707511769,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12092,
  "votes_down": 1787,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4209245823540554298",
  "clan_steamid_original": "103582791433224455"
}