{
  "gid": "544472700657074597",
  "clan_steamid": "103582791433224455",
  "event_name": "Η τελευταία υπόκλιση του Crownfall",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1736979180,
  "rtime32_end_time": 1736983801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4d7625b8d423a09223b02308f39f8b56e96130a1.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1736979124
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1736979215
      }
    ]
  },
  "announcement_body": {
    "gid": "544472700657074598",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Η τελευταία υπόκλιση του Crownfall",
    "posttime": 1736979218,
    "updatetime": 1736979218,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7625b8d423a09223b02308f39f8b56e96130a1.png[/img]",
      "Τον Δεκέμβριο, φαινόταν απολύτως λογικό να ολοκληρωθεί στα μέσα Ιανουαρίου το Crownfall. Στην τελική, σκεφτήκαμε, ποιος στο καλό θα χρειαζόταν παραπάνω χρόνο από [i]αυτόν[/i] για να ολοκληρώσει την εξερεύνηση τεσσάρων τεράστιων χαρτών γεμάτων με νέους χαρακτήρες, κόμικ και μίνι παιχνίδια;",
      "Λοιπόν, αν είναι αλήθεια όσα ακούμε από φίλους, συγγενείς, αφοσιωμένους φαν, συναδέλφους, οδηγούς λεωφορείων, φύλακες και… κάποιες ιντερνετικές γάτες, φαίνεται ότι πολύς κόσμος θα χρειαζόταν παραπάνω χρόνο για να τελειώσει τα πάντα. Οπότε παρατείνουμε την ημερομηνία λήξης του Crownfall για μία τελευταία φορά (αλήθεια αυτήν τη φορά) μέχρι την [b]Πέμπτη 6 Φεβρουαρίου[/b]. Αν έχετε ακόμα πρόοδο να κάνετε, βάλτε μπρος, γιατί η αυλαία αυτής της παράστασης πρόκειται επιτέλους να πέσει και αυτό είναι υπόσχεση.",
      "[h2]Ένα παγωμένο αντίο[/h2]",
      "Ελπίζουμε να την κάνατε όλοι ταράτσα με καρδιά Γκραντς και να σας βγάλει για το υπόλοιπο της χρονιάς, καθώς άλλο ένα Frostivus έφτασε στο τέλος του και όλα τα περιτυλίγματα, τα στολίδια, οι χιονόμπαλες και τα κλεμμένα καπέλα ξαναχώθηκαν με φροντίδα στην αποθήκη των γιορτινών θησαυρών.",
      "[h2]Λήξη Χειμερινών Εκπτώσεων[/h2]",
      "Δυστυχώς, δεν μας παρακάλεσε κανείς εκ μέρους των κατοικιδίων του για περισσότερες προσφορές από τις Χειμερινές Εκπτώσεις μας και, εφόσον πάει ο παλιός ο χρόνος (για την ακρίβεια πάει εδώ και δυο βδομάδες), όλα τα είδη του Καταστήματος Crownfall επιστρέφουν πλέον (επιτέλους) στις κανονικές τιμές τους.",
      "Μπορείτε ακόμα να ξεκλειδώσετε νέα σημεία της ιστορίας στα Πακέτα Ιχνηλάτη Μεσοθυρίου, Ντρουούντ και Icewrack, να εξοπλίσετε τους ήρωές σας με τα σετ από τη Skywrath από τους Θησαυρούς Crownfall I–III ή να ολοκληρώσετε τη μεταμόρφωση της Σεν και του Ντραγκόνους με τα Arcana για τη Vengeful Spirit και τον Skywrath Mage. Ωστόσο, τα αντικείμενα έχουν πλέον τις κανονικές τιμές τους εκτός αν έχετε Νομίσματα Crownfall που μπορείτε να χρησιμοποιήσετε.",
      "[h2]Τίτλοι τέλους[/h2]",
      "Το Crownfall μπορεί να μην τελειώνει επίσημα σήμερα, αλλά η σημερινή ενημέρωση περιλαμβάνει κάτι ακόμα για να γιορτάσουμε το τέλος του ταξιδιού. Όλα τα μέλη της ομάδας αφιέρωσαν πολύ χρόνο για να γίνει αυτό πραγματικότητα: από τα παζαρέματα με τους Άπτηνους στις πολυσύχναστες αγορές του Μεσοθυρίου έως την επιστροφή των νομάδων Ογκλόντι μέσα από τους κατακόκκινους αμμόλοφους του Ντρουούντ στη Barzum, την πατρίδα που τους ανήκει δικαιωματικά. Από την παροχή βοήθειας στην εξουθενωμένη φύλακα της Icewrack για την επίλυση μιας εσωτερικής διαφοράς μεταξύ των κατοίκων της Χιονολίμνης και ενός λυσσάρη δράκου έως την ανάβαση στους πύργους της Skywrath, μέσα στα σύννεφα, για τη διάπραξη μιας βασιλοκτονίας, που έπρεπε να είχε γίνει από καιρό, και την ανάδειξη ενός πραγματικού χαρακτήρα του Dota σε ηγέτη των πάντων. Το ταξίδι ήταν μεγάλο και η ολοκλήρωσή του είναι γλυκόπικρη. Οπότε, ελάτε μαζί μας για μια τελευταία αναδρομή, όπου θα δούμε τους συντελεστές με νέα μουσική και μερικές διασκεδαστικές εκπλήξεις. (Κάντε απλώς κλικ στο «Συντελεστές» στο κύριο μενού για να τη δείτε.)"
    ],
    "commentcount": 351,
    "tags": [
      "mod_reviewed",
      "ModAct_1519738978_1736980365_0"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "604145395718741313",
    "event_gid": "544472700657074597",
    "voteupcount": 1675,
    "votedowncount": 488,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "604145395718741313",
  "rtime32_last_modified": 1737046490,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1736980366,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 1674,
  "votes_down": 488,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "604145395718741313",
  "clan_steamid_original": "103582791433224455"
}