{
  "gid": "544472700657074597",
  "clan_steamid": "103582791433224455",
  "event_name": "Het laatste afscheid van Crownfall",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1736979180,
  "rtime32_end_time": 1736983801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4d7625b8d423a09223b02308f39f8b56e96130a1.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1736979124
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1736979215
      }
    ]
  },
  "announcement_body": {
    "gid": "544472700657074598",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Het laatste afscheid van Crownfall",
    "posttime": 1736979218,
    "updatetime": 1736979218,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7625b8d423a09223b02308f39f8b56e96130a1.png[/img]",
      "In december leek het nog een heel redelijk plan om Crownfall half januari af te sluiten. Want wie zou er nou [i]nog[/i] meer tijd nodig kunnen hebben om vier gigantische Overworld-maps te verkennen met tientallen personages, allerlei strips en meeslepende minigames?",
      "Maar als we onze vrienden, familie, trouwe fans, collega's, buschauffeurs, beveiligingsmedewerkers en zelfs een kat op het internet moeten geloven, zijn er toch aardig wat mensen die nog iets meer tijd nodig hebben om alles te beleven. Daarom stellen we de einddatum van Crownfall nog één keertje uit (maar nu echt voor het laatst): jullie hebben nog tot [b]donderdag 6 februari[/b] om Crownfall af te ronden. Als je nog wat voortgang in het spel moet maken, dan is dit de laatste kans om in actie te komen, want het doek van deze show zal nu eindelijk definitief vallen. Beloofd.",
      "[h2]Een bevroren vaarwel[/h2]",
      "We hopen dat iedereen zijn buikje flink rond heeft gegeten en genoeg grunch-harten heeft verorberd om de rest van het jaar goed door te komen, want ook dit seizoen van Frostivus is weer voorbij. Ja, je hoort het goed. Al het cadeaupapier, de frostivusversieringen, sneeuwballen en gestolen mutsen zijn weer zorgvuldig ingepakt en in de seizoensschatopslag gemikt.",
      "[h2]Einde van de winteruitverkoop[/h2]",
      "Helaas hebben we geen smeekbedes van katten gekregen om de eindejaarskortingen van onze winteruitverkoop iets langer te laten duren. En omdat het jaar toch echt al twee weken is afgelopen, zijn alle prijzen in de Crownfall-winkel (eindelijk) weer teruggezet naar de standaardprijzen.",
      "Je kunt nog steeds allerlei nieuwe ontwikkelingen in het verhaal ontgrendelen met de Pathfinder-pakketten van Midgate, Druud en Icewrack, je helden een nieuwe look geven met de Skywrath-sets uit de Crownfall-schatten I t/m III of de transformatie van Shen en Dragonus voltooien met de Arcana's voor Vengeful Spirit en Skywrath Mage, maar tenzij je nog Crownfall-munten hebt, kosten ze nu weer het volle pond.",
      "[h2]Tijd voor de aftiteling[/h2]",
      "Crownfall komt vandaag misschien niet officieel ten einde, maar in de update van vandaag zit ook een kleinigheidje om het einde van de reis te vieren. Iedereen in het team heeft keihard gewerkt om dit mogelijk te maken: van het onderhandelen met de Grondvasten op de bruisende bazaars van Midgate, tot de terugtocht van de nomadische Oglodi over de dieprode zandvlakten van Druud naar hun rechtmatige thuis in Barzum, of die volledig overwerkte wachter uit Icewrack die wel wat hulp kon gebruiken bij het oplossen van een huiselijk conflict tussen de burgers van Snowcap Lake en een losgeslagen draak, en uiteindelijk de beklimming van de spitsen van Skywrath tot boven de wolken, om de langverwachte koningsmoord te plegen waardoor een van onze eigen Dota-personages eindelijk aan de macht kwam. Het was een lange reis en het doet pijn in ons hart om het verhaal nu echt helemaal af te sluiten. Dus laten we met deze titelrol nog één keer samen terugkijken op alles wat we met elkaar hebben beleefd en geniet van de nieuwe muziek en een paar leuke verrassingen. (Je kunt de aftiteling afspelen door in het hoofdmenu op 'Play Credits' te klikken.)"
    ],
    "commentcount": 393,
    "tags": [
      "mod_reviewed",
      "ModAct_1519738978_1736980365_0"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "604145395718741313",
    "event_gid": "544472700657074597",
    "voteupcount": 1975,
    "votedowncount": 574,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "604145395718741313",
  "rtime32_last_modified": 1737064319,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1736980366,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 1972,
  "votes_down": 573,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "604145395718741313",
  "clan_steamid_original": "103582791433224455"
}