{
  "gid": "544472700657074597",
  "clan_steamid": "103582791433224455",
  "event_name": "Финалният поклон на Crownfall",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1736979180,
  "rtime32_end_time": 1736983801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4d7625b8d423a09223b02308f39f8b56e96130a1.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1736979124
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1736979215
      }
    ]
  },
  "announcement_body": {
    "gid": "544472700657074598",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Финалният поклон на Crownfall",
    "posttime": 1736979218,
    "updatetime": 1736979218,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7625b8d423a09223b02308f39f8b56e96130a1.png[/img]",
      "Още през декември изглеждаше напълно разумно да доведем Crownfall до завършек през средата на януари. Обосновката беше, че в крайна сметка кой би могъл да има нужда от повече време от [i]това[/i], за да завърши проучването на четири огромни световни карти, изпълнени със срещи с тонове персонажи, комикси за четене и мини игри за покоряване?",
      "Е, ако това, което чуваме от приятели, роднини, отдадени почитатели, колеги, шофьори на автобуси, охранители и дори някои котки в интернет, е вярно… Оказва се, че много хора всъщност биха могли да се възползват от още време, за да завършат всичко. Ето защо удължаваме крайния срок на Crownfall за последен път (този път наистина) до [b]четвъртък, 06 февруари[/b]. Ако все още имате да осъществявате напредък, раздвижете се, защото, обещаваме Ви, че завесите за това представление най-сетне са на път да се затворят.",
      "[h2]Мразовито сбогуване[/h2]",
      "Надяваме се, че всички са натъпкали търбусите си с достатъчно мърморковщина, така че да се насладите на остатъка от годината, защото поредният сезон на Frostivus е в архивите и всички обвивки, капани, снежни топки и откраднати шапки бяха грижливо опаковани и натъпкани обратно в сезонния съкровищен сандък.",
      "[h2]Зимната разпродажба приключва[/h2]",
      "За жалост нямаше хора, които да умоляват от името на своите питомци за още спестявания в края на годината от нашата зимна разпродажба. И така… Тъй като годината всъщност приключи и това действително стана преди две седмици, всичко в Crownfall магазина вече (най-сетне) се връща към редовната си цена.",
      "Все още можете да отключвате нови сюжетни възли с пакетите за пътеводители на Средната порта, Друуд и Ледоостанково. Издокарайте героите си в Небогнявовските набори от Crownfall съкровища I — III. Или пък завършете трансформациите на Шен и Драгонус с Arcanas артикулите за Vengeful Spirit и Skywrath Mage, но освен ако имате Crownfall монети, които да използвате — артикулите пак са на пълна цена.",
      "[h2]Време е за финалните надписи[/h2]",
      "Crownfall може и да не приключва официално днес, но настоящото обновление също включва нещо малко, за да ознаменуваме края на пътешествието. Всеки от екипа отдели много време, за да се реализира това. От пазарлъци с нелетящите в оживените чаршии на Средната порта. През завръщането на номада Оглоди през пурпурните пясъци на пустините Друуд в техния законен дом Барзум. До помагане на преуморения надзирател от Ледоостанковода да уреди домашното безредие между гражданите на Снежнопокривково езеро и мародерстващ дракон. А накрая и покоряване на обградените с облаци шпилове на Небогнявово, за да се извърши дългоочаквано цареубийство, поставяйки действителен Dota 2 персонаж начело, който да отговаря за всичко. Беше дълго пътуване, както и малко примесена с горчивина сладост, когато събитието най-сетне влиза в историята. Така че, моля, присъединете се към нас за един последен поглед назад под формата на поредица от надписи, включваща нова музика и няколко забавни изненади. (Просто кликнете върху „Пускане на надписите“ в главното меню, за да ги прегледате.)"
    ],
    "commentcount": 578,
    "tags": [
      "mod_reviewed",
      "ModAct_1519738978_1736980365_0"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "604145395718741313",
    "event_gid": "544472700657074597",
    "voteupcount": 4629,
    "votedowncount": 1111,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "604145395718741313",
  "rtime32_last_modified": 1738143077,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1736980366,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4628,
  "votes_down": 1111,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "604145395718741313",
  "clan_steamid_original": "103582791433224455"
}