{
  "gid": "544472700657074597",
  "clan_steamid": "103582791433224455",
  "event_name": "Der Vorhang fällt für die Thronsturz-Saga",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1736979180,
  "rtime32_end_time": 1736983801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4d7625b8d423a09223b02308f39f8b56e96130a1.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1736979124
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1736979215
      }
    ]
  },
  "announcement_body": {
    "gid": "544472700657074598",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Der Vorhang fällt für die Thronsturz-Saga",
    "posttime": 1736979218,
    "updatetime": 1736979218,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7625b8d423a09223b02308f39f8b56e96130a1.png[/img]",
      "Was für einen Unterschied ein paar Wochen ausmachen können. Im Dezember schien es uns eine gute Idee, das Thronsturz-Event im neuen Jahr ausklingen zu lassen. Wir wählten den 15. Januar, um den Vorhang für den letzten Akt fallen zu lassen. Das würde allen Fans mehr als genug Zeit geben, um alle vier Gebietskarten auszukundschaften, die unzähligen beteiligten Charaktere kennenzulernen, die fantastischen Comics zu lesen und alle Minispiele zu meistern. Oder etwa nicht?",
      "Nun, wenn es stimmt, was wir von Freunden, Familien, Kollegen, Busfahrern, Wachleuten und sogar einigen Katzen im Internet hören, dann gibt es eine Menge Spieler da draußen, die tatsächlich mehr Zeit benötigen. Deshalb verlängern wir das Thronsturz-Event ein allerletztes Mal (versprochen!) bis [b]Donnerstag, den 6. Februar 2025[/b]. Wenn Sie also noch Fortschritte machen müssen, dann beeilen Sie sich, denn an diesem Datum fällt der Vorhang endgültig.",
      "[h2]Ein frostiger Abschied[/h2]",
      "Wir hoffen außerdem, dass Sie sich ordentlich die Bäuche mit Grunchherzen vollgeschlagen haben, denn bis diese Delikatesse wieder serviert wird, werden Sie sich bis zum nächsten Frostivus gedulden müssen. Sie haben richtig gehört! Zum Ende des Jahres ist ein erneutes Frostivus-Event geplant, allerdings verschwinden bis dahin das Geschenkpapier, alle Dekorationen und die gestohlenen Hüte auf dem Dachboden.",
      "[h2]Ende der Winteraktion[/h2]",
      "Im Gegensatz zum Thronsturz-Event gab es jedoch niemanden, der im Namen seiner Haustiere um eine Verlängerung unserer Rabattaktion zum Jahresende bat. Da das Kalenderjahr in der Tat vor zwei Wochen zu Ende ging, gelten im Thronsturz-Laden wieder die regulären Preise.",
      "Sie können weiterhin mithilfe der Pfadfinderpakete „Mittlere Pforte“, „Druud“, „Eismarsch“ und „Himmelszorn“ alle Pfade auf den jeweiligen Gebietskarten freischalten, sich für Ihre Lieblingshelden die Himmelszorn-Sets aus den Thronsturz-Schätzen I bis III holen oder mit den Arkanas für Vengeful Spirit und Skywrath Mage die Verwandlung von Shen und Dragonus abschließen. Allerdings kosten alle Gegenstände den vollen Preis, es sei denn, Sie verfügen noch über Münzen für den Thronsturz-Laden.",
      "[h2]Zum Abspann[/h2]",
      "Noch ist das Thronsturz-Event nicht offiziell beendet, aber das heutige Update enthält eine kleine Überraschung, um das Ende der Reise zu feiern. Jeder im Team hat viel Zeit investiert, um dieses Event zu ermöglichen. Wir erlebten das Feilschen mit den Fluglosen auf den Märkten der Mittleren Pforte. Freuten uns über das Ende der Wanderschaft der Oglodi durch die Roten Sande von Druud und den Wiederaufbau ihrer alten Heimat Barzum. Feuerten die überarbeitete Hüterin des Nordens bei der Schlichtung eines Streits zwischen den Bewohnern von Schneekrone und einem plündernden Drachen an. Und zu guter Letzt holten wir das Popcorn für die Schlacht um die wolkenumhüllten Spitzen von Himmelszorn heraus, um Zeuge eines längst überfälligen Königsmords zu werden. Höchste Zeit, dass eine echte Dota-Heldin ihren rechtmäßigen Thron besteigt. Es war eine mitreißende Saga und nach all den Monaten des Mitfieberns fällt der Abschied nicht leicht. Wir möchten Ihnen daher die Gelegenheit geben, das Event in Form eines Abspanns mit neuer Musik und einigen lustigen Überraschungen noch einmal Revue passieren zu lassen. Schalten Sie das Licht aus, lehnen Sie sich zurück und klicken Sie dann im Dota-Hauptmenü auf „Zum Abspann“!"
    ],
    "commentcount": 367,
    "tags": [
      "mod_reviewed",
      "ModAct_1519738978_1736980365_0"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "604145395718741313",
    "event_gid": "544472700657074597",
    "voteupcount": 1809,
    "votedowncount": 522,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "604145395718741313",
  "rtime32_last_modified": 1737052882,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1736980366,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 1803,
  "votes_down": 522,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "604145395718741313",
  "clan_steamid_original": "103582791433224455"
}