{
  "gid": "544472700657074597",
  "clan_steamid": "103582791433224455",
  "event_name": "Ostatni bis Utraconej Korony",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1736979180,
  "rtime32_end_time": 1736983801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4d7625b8d423a09223b02308f39f8b56e96130a1.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1736979124
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1736979215
      }
    ]
  },
  "announcement_body": {
    "gid": "544472700657074598",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ostatni bis Utraconej Korony",
    "posttime": 1736979218,
    "updatetime": 1736979218,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7625b8d423a09223b02308f39f8b56e96130a1.png[/img]",
      "W grudniu całlkowicie rozsądnym wydawało się zakończenie Utraconej Korony w połowie stycznia. Wszakże (wyjaśnialiśmy sobie) kto taki mógłby potrzebować [i]jeszcze[/i] więcej czasu do ukończenia odkrywania 4 ogromnych map świata gry wypełnionych bezlikiem postaci do poznania, komiksów do przeczytania oraz minigier do pokonania?",
      "No cóż, jeśli docierające do nas głosy przyjaciół, rodzin, oddanych fanów, współpracowników, kierowców autobusów, ochroniarzy obiektów, a nawet niektórych kotów w internecie mówią prawdę, to okazuje się, że więcej czasu na dokończenie tego wszystkiego tak naprawdę przydałoby się całej kupie ludzi. Z tego powodu przekładamy datę zakończenia Utraconej Korony po raz ostatni (tym razem na serio) na [b]czwartek 6 lutego[/b]. Jeśli wciąż macie postępy do zdobycia, to ruchy, bo przysięgamy, że kurtyna na zakończenie tej sztuki naprawdę w końcu zaraz opadnie.",
      "[h2]Mroźne pożegnanie[/h2]",
      "Mamy nadzieję, że wszyscy zapełnili swoje brzuszki dostateczną ilością grunchowego serca, żeby napchać się na całą resztę roku, bo kolejny sezon Mroźnego Festiwalu przechodzi do historii – a cały papier prezentowy, elementy garderoby, kule śnieżne i czapki nienależne zostały z należytą troską spakowane i wpakowane do skrzynki z sezonowym skarbem.",
      "[h2]Zimowa wyprzedaż dobiega końca[/h2]",
      "Niestety nie znalazł się nikt błagający w imieniu swoich zwierzaków o więcej końcoworocznych oszczędności z naszej zimowej wyprzedaży, a z uwagi na to, że rok faktycznie się skończył – do tego faktycznie skończył się 2 tygodnie temu – wszystko w sklepie Utraconej Korony (w końcu na serio) od teraz wraca do swojej regularnej ceny.",
      "Wciąż możecie odblokować nowe odgałęzienia historii dzięki Pakietom Zwiadowcy Śródbramia, Druud, Lodowej Ruiny oraz Niebogniewia, przyozdobić swoich bohaterów w pakiety z Niebogniewia ze skarbów Utraconej Korony I – III lub ukończyć przemiany Shen i Dragonusa za pomocą arkanów dla Vengeful Spirit oraz Skywrath Mage'a. Jednak jeśli nie macie monet Utraconej Korony do wykorzystania, to przedmioty z powrotem są w pełnej cenie.",
      "[h2]Napisy końcowe[/h2]",
      "Może i Utracona Korona oficjalnie nie dobiega końca dzisiaj, jednak dzisiejsza aktualizacje obejmuje także małe co nieco, by uczcić kres tej wędrówki. Wszyscy w zespole włożyli mnóstwo czasu w urzeczywistnienie tego wszystkiego – od targowania się z Uziemionymi na wypełnionych zgiełkiem bazarach Śródbramia, przez powrót wędrownych Oglodich przez szkarłatne piaski Druud do ich prawowitego domu, którym jest Barzum, pomocy przepracowanej strażniczce Lodowej Ruiny w załagodzeniu sąsiedzkich awantur między mieszkańcami Jeziora Śnieżnej Czapy a grasującym w tamtych okolicach smokiem, aż po ostateczne wdrapywanie się na otulone przez chmury iglice Niebogniewia, by popełnić zbyt długo wyczekiwane królobójstwo i powierzyć przywództwo nad wszystkim faktycznej postaci z gry. To była długa przejażdżka, a zamknięcie tego rozdziału napawa nas niepozbawioną nutki goryczy radością. Dołączcie więc do nas po ostatnie spojrzenie wstecz w formie sekwencji z napisami zawierającej nową muzykę i pewne ciekawe niespodzianki. Po prostu kliknijcie „Odtwórz napisy” w menu głównym, by je odpalić."
    ],
    "commentcount": 381,
    "tags": [
      "mod_reviewed",
      "ModAct_1519738978_1736980365_0"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "604145395718741313",
    "event_gid": "544472700657074597",
    "voteupcount": 1909,
    "votedowncount": 554,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "604145395718741313",
  "rtime32_last_modified": 1737058978,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1736980366,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 1909,
  "votes_down": 554,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "604145395718741313",
  "clan_steamid_original": "103582791433224455"
}