{
  "gid": "544472700657074597",
  "clan_steamid": "103582791433224455",
  "event_name": "El último adiós a la Caída de la Corona",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1736979180,
  "rtime32_end_time": 1736983801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4d7625b8d423a09223b02308f39f8b56e96130a1.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1736979124
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1736979215
      }
    ]
  },
  "announcement_body": {
    "gid": "544472700657074598",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "El último adiós a la Caída de la Corona",
    "posttime": 1736979218,
    "updatetime": 1736979218,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7625b8d423a09223b02308f39f8b56e96130a1.png[/img]",
      "Por allá del mes de diciembre, parecía completamente razonable terminar la serie de la Caída de la Corona en enero. Después de todo, pensamos, ¿quién podría necesitar más tiempo que [i]eso[/i] para terminar de explorar los cuatro mapas principales enormes y repletos de cientos de personajes, cómics que leer y minijuegos que conquistar?",
      "Bueno, si lo que dicen nuestros amigos, fanáticos dedicados, compañeros de trabajo, choferes de autobús, guardias de seguridad, e incluso a algunos gatos en el internet es cierto, resulta que muchas personas sí necesitan más tiempo para terminar todo. Por este motivo, estamos extendiendo la fecha de finalización de la Caída de la Corona por última vez (ahora sí es en serio) hasta el [b]6 de febrero[/b]. Si todavía te quedan secciones por terminar, ponte a jugar porque las cortinas de este espectáculo están a punto de bajar, lo prometemos.",
      "[h2]Una despedida helada[/h2]",
      "Esperamos que a todos se les hayan llenado sus pancitas con el espíritu de Grunch para lo que resta del año, porque tenemos otra temporada de Frostivus para la posteridad porque todos los regalos envueltos, trampas, bolas de nieve y sombreros robados ya fueron empacados y almacenados en la choza del tesoro estacional.",
      "[h2]Terminan las rebajas de invierno[/h2]",
      "Tristemente, no hubo personas suplicando a nombre de sus mascotas para extender nuestras rebajas de invierno de fin de año, y como el año de hecho ya terminó (hace dos semanas, para ser precisos), todo en la tienda de la Caída de la Corona (finalmente) regresa a su precio regular.",
      "Todavía puedes desbloquear nuevos nodos en la historia con los paquetes del Barrio Medio, Druud y del Paquete del explorador de Icewrack, decorar a tus héroes con los sets de Skywrath de los Tesoros de la Caída de la Corona del I al III o completar las transformaciones de Shen y Dragonus con los arcanos de Vengeful Spirit y Skywrath Mage, pero a menos que tengas monedas de la Caída de la Corona que gastar, estos objetos están de nuevo a su precio regular.",
      "[h2]Créditos[/h2]",
      "Tal vez la Caída de la Corona no finalice oficialmente hoy, pero la actualización de hoy también incluye algo para celebrar el final del viaje. Todos en el equipo invirtieron mucho tiempo en hacer esto posible — desde regatear con los desalados en los bulliciosos bazares del Barrio Medio; regresar a los nómadas Oglodi a través de las arenas carmesí de Druud hasta su hogar por derecho en Barzum; ayudar a la guardiana de Icewrack sobreexplotada a reconciliar diferencias domésticas entre los ciudadanos del Lago del Pico Nevado y un dragón merodeador; y finalmente, a escalar las agujas cubiertas de nubes de Skywrath para cometer un regicidio pendiente de tiempo atrás y poner a un personaje de Dota a cargo de todo. Ha sido un largo viaje y también un poco agridulce para, finalmente, cerrar el libro. Así que, por favor, acompáñanos a echar un último vistazo al pasado con una secuencia de créditos que presentan música nueva y algunas divertidas sorpresas. (Solo haz clic en \"Reproducir créditos\" en el menú principal para reproducirlos)."
    ],
    "commentcount": 333,
    "tags": [
      "mod_reviewed",
      "ModAct_1519738978_1736980365_0"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "604145395718741313",
    "event_gid": "544472700657074597",
    "voteupcount": 1609,
    "votedowncount": 470,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "604145395718741313",
  "rtime32_last_modified": 1737043933,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1736980366,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 1610,
  "votes_down": 472,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "604145395718741313",
  "clan_steamid_original": "103582791433224455"
}