{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Mise à jour du gameplay 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mise à jour du gameplay 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "La mise à jour 7.39b a été publiée. Cliquez [url=https://www.dota2.com/patches/7.39b]ici[/url] pour accéder aux notes de cette mise à jour.",
      "Nous avons également corrigé les problèmes suivants au cours de ces derniers jours.",
      "[list]",
      "[*] Correction de plusieurs plantages divers du client et du serveur.",
      "[*] Correction de plusieurs plantages qui survenaient avec le nouveau menu des paramètres.",
      "[*] Correction d'un problème lors du déplacement d'objets complets vers l'achat rapide.",
      "[*] Correction du problème suivant : le menu déroulant d'utilisation rapide ne s'affichait pas dans les raccourcis d'incantation et dans l'outil de sélection d'utilisation rapide.",
      "[*] Correction du problème suivant : les unités autres que l'unité héroïque, le Spirit Bear ou le coursier pouvaient acheter des objets avec l'achat rapide.",
      "[*] Correction du problème suivant : le coursier pouvait récupérer des objets de la réserve depuis l'échoppe secrète.",
      "[*] Correction du problème suivant : les touches associées au raccourci ALT déclenchaient des actions involontaires.",
      "[*] Correction du problème suivant : le paramètre de qualité du réseau ne s'appliquait pas.",
      "[*] Ajout d'anciens paramètres manquants tels que l'activation du panel d'informations, l'activation de la file d'ordres sur le HUD et l'activation des vidéos de capacités dans les infobulles.",
      "[*] Ajout d'un nouveau paramètre permettant de désactiver les touches de raccourci par unité lors des parties personnalisées.",
      "[*] Correction du problème suivant : il était impossible d'associer les parchemins de téléportation et les objets neutres aux raccourcis d'incantation.",
      "[*] Correction du problème suivant : la capacité de transfert d'objets du coursier récupérait les objets de la réserve s'il était à portée de la boutique.",
      "[*] Correction du problème suivant : le coursier ne respectait pas la file d'ordres après le transfert.",
      "[*] Correction du problème suivant : faire glisser un objet de votre inventaire vers votre guide d'objets actuel alors qu'il était réglé en mode édition faisait planter le jeu.",
      "[*] Correction du problème suivant : le curseur de luminosité en mode plein écran était inversé.",
      "[*] Correction du problème suivant : le bouton de recalibrage du MMR ne fonctionnait pas.",
      "[*] Correction du problème suivant : les unités héroïques pouvaient parfois se retrouver définitivement dans un état de transition de mort si elles mouraient alors qu'elles étaient affectées par l'effet négatif de Vhoul Assassin et par d'autres effets négatifs sur la restauration de PV.",
      "[*] Correction du problème suivant : le menu de configuration des raccourcis empêchait toute association si le menu des paramètres était fermé au moment d'associer une action à une touche.",
      "[*] Correction du problème suivant : le coursier ne récupérait pas les objets de la réserve lorsqu'il quittait la fontaine s'il lui avait été ordonné de transférer des objets.",
      "[*] Le paramètre « Interactions avec les structures » s'appelle désormais « Capture des structures ».",
      "[*] Le paramètre « Capture des structures » n'affecte plus que les vigiles et les avant-postes. L'option d'annulation de la canalisation des portails et de Fiend's Gate d'Underlord est à retrouver dans les paramètres « Téléportations ».",
      "[*] Désormais, le coursier finira sa dernière livraison en cours lors du passage en mode de livraison automatique.",
      "[*] La fenêtre du HUD du coursier permet désormais également de distinguer les périodes d'attente à l'échoppe secrète de celles de déplacements génériques (plutôt que celles de déplacements vers l'échoppe ou de livraison à une unité héroïque). Correction du problème suivant : un point d'interrogation s'affichait quand le coursier se déplaçait pour rejoindre une destination autre qu'une unité héroïque.",
      "[*] Correction du problème suivant : les parties personnalisées plantaient si une équipe comptait plus de 7 personnes.",
      "[*] Correction du problème suivant : l'activation de l'affichage des objets de l'équipe dans le magasin ne persistait pas.",
      "[*] Correction du problème qui faisait que les capacités suivantes ne pouvaient pas être associées :",
      "[list]",
      "[*] Work Horse de Centaur Warrunner ;",
      "[*] Electromagnetic Repulsion de Disruptor ;",
      "[*] Solar Guardian de Dawnbreaker ;",
      "[*] Twisted Chakram de Timbersaw ;",
      "[*] le déplacement d'Astral Spirit d'Elder Titan ;",
      "[*] Spirits In et Spirits Out d'Io ;",
      "[*] Roll Up de Pangolier ;",
      "[*] Keen Conveyance de Tinker ;",
      "[*] Solar Bind/Recall de Keeper of the Light.",
      "[/list]",
      "[*] Correction du problème suivant : l'animation et les effets visuels du rugissement de Roshan ne se déclenchaient pas.",
      "[*] Correction du problème suivant : Helm of the Undying appliquait le bonus de durée à plusieurs reprises si des attaques supplémentaires ciblaient une cible déjà morte.",
      "[*] Correction du problème : les dégâts presque mortels avec Helm of the Undying étaient considérés comme ayant fait une victime héroïque, ce qui accordait un délai de survie supplémentaire après la mort.",
      "[*] Correction du problème suivant : l'effet de particules de Serrated Shiv se déclenchait au début de l'attaque plutôt qu'à l'impact.",
      "[*] Correction du problème suivant : Book of the Dead ne déclenchait pas d'effet sonore au lancement.",
      "[*] Correction du problème suivant : Bloodrage de Bloodseeker outrepassait Linken's Sphere quand la capacité ciblait une unité ennemie.",
      "[*] Correction du problème suivant : la réduction au silence de Bloodrage de Bloodseeker outrepassait l'immunité contre les effets négatifs.",
      "[*] Correction du problème suivant : le raccourci de sélection d'unité héroïque pendant Nothl Projection de Dazzle sélectionnait Dazzle au lieu de sa projection.",
      "[*] Correction du problème suivant : Electromagnetic Repulsion de Disruptor avec Transferrence n'était pas affectée par la réduction des temps de recharge quand la capacité était lancée manuellement.",
      "[*] Correction du problème suivant : l'esprit d'Elder Titan ne revenait pas automatiquement en cas d'utilisation d'Echo Stomp quand ce dernier avait l'Aghanim's Shard.",
      "[*] Correction du problème suivant : les capacités ultimes d'Hoodwink et d'Ogre Magi ne pouvaient pas être améliorées via le raccourci.",
      "[*] Correction du problème suivant : Ice Wall avec le ciblage vectoriel d'Invoker ne se lançait pas perpendiculairement à Invoker lorsque la distance du point final du vecteur était inférieure à un certain seuil.",
      "[*] Correction du problème suivant : les unités sous l'effet de Tether liées à Io étaient visibles dans le brouillard de guerre si elles étaient équipées d'un item cosmétique avec des effets de particules d'ambiance.",
      "[*] Correction du problème suivant : Flutter (Katana) de Kez n'infligeait pas tous ses dégâts.",
      "[*] Correction du problème suivant : parfois, les dégâts de Flutter (Katana) de Kez étaient consommés, mais n'avaient aucun effet.",
      "[*] Correction du problème suivant : l'interruption de Raptor Dance de Kez déclenchait le temps de recharge de Raven's Veil.",
      "[*] Correction du problème suivant : le ralentissement de Grappling Claw de Kez était supprimé à l'impact.",
      "[*] Correction du problème suivant : le ralentissement de Grappling Claw de Kez était trop court.",
      "[*] Correction du problème suivant : l'interruption de Raptor Dance de Kez déclenchait le temps de recharge de Raven's Veil.",
      "[*] Correction du problème suivant : Flutter de Kez était consommée par Talon Toss, Falcon Rush et les attaques d'empalement factices de Katana.",
      "[*] Correction du problème suivant : le Spirit Bear de Lone Druid ne pouvait pas utiliser l'achat rapide pour acheter des objets dans l'échoppe secrète.",
      "[*] Correction du problème suivant : la réserve ne s'affichait pas quand le Spirit Bear de Lone Druid était sélectionné.",
      "[*] Correction du problème suivant : Reverse Polarity de Magnus ne déclenchait pas les animations d'étourdissement sur les unités ennemies.",
      "[*] Correction du problème suivant : la sous-capacité Changing of the Guard de Monkey King pouvait être dérobée.",
      "[*] Correction de problèmes avec les items cosmétiques de l'ensemble « fripon trompe-démons » à l'incantation de Changing of the Guard.",
      "[*] Correction du problème suivant : Quickdraw de Muerta pouvait augmenter la fréquence de déclenchement de Gunslinger de manière erronée.",
      "[*] Correction du problème suivant : Muerta ne lançait pas la bonne réplique en cas d'impact de Dead Shot avec l'Aghanim's Scepter.",
      "[*] Correction du problème suivant : Ghost Shroud de Necrophos n'augmentait pas les soins reçus.",
      "[*] Les chronomètres de rune pour Prognosticate d'Oracle dans l'environnement peuvent être pingués avec ALT.",
      "[*] Correction du problème suivant : la portée d'attaque de Stinger aved l'Aghanim's Scepter de Sand King était plus basse que prévu.",
      "[*] Correction du problème suivant : Requiem of Souls de Shadow Fiend n'effrayait pas les adversaires si Shadow Fiend mourait juste après le lancement.",
      "[*] Correction du problème suivant : Whirling Death de Timbersaw soignait les unités héroïques de type force et polyvalentes plus que prévu.",
      "[*] Correction du problème suivant : Sanctuary de Void Spirit n'augmentait pas le montant de protection.",
      "[*] Ability Draft : l'activation de l'auto-utilisation de Quill Spray ne permettait pas de passer à Hairball à moins d'avoir l'Aghanim's Shard.",
      "[*] Ability Draft : la facette Learning Curve d'Ogre Magi fonctionne désormais avec toutes les capacités (à condition d'avoir sélectionné Ogre Magi).",
      "[*] Ability Draft : ajout de nombreux talents manquants et suppression de talents incorrects.",
      "[*] Correction d'un problème avec les paramètres d'échange et de don des trésors du butin héroïque de l'été 2025.",
      "[*] Il est désormais moins probable que l'outil de recommandations d'objets Dota Plus soit à court d'objets en fin de partie.",
      "[*] Correction du problème suivant : l'achat rapide d'objets suggérés par Dota Plus ne déclenche plus des achats en double en cas de clics rapides.",
      "[/list]"
    ],
    "commentcount": 26,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 65,
    "votedowncount": 7,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748563832,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 68,
  "votes_down": 7,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}