{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja rozgrywki 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aktualizacja rozgrywki 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "Aktualizacja 7.39b jest już dostępna. Listę zmian możecie sprawdzić [url=https://www.dota2.com/patches/7.39b]tutaj[/url].",
      "Dodatkowo w ciągu ostatnich kilku dni zajęliśmy się następującymi problemami:",
      "[list]",
      "[*] Naprawiono wiele rozmaitych błędów związanych z nieoczekiwanymi zamknięciami klienta i serwera.",
      "[*] Naprawiono rozmaite błędy powodujące nieoczekiwane zamknięcia związane z nowym menu ustawień.",
      "[*] Rozwiązano problem z przemieszczaniem kompletnych przedmiotów w polu szybkiego zakupu.",
      "[*] Naprawiono błąd powodujący, że menu rozwijane szybkiego rzutu nie wyświetlało się, jeśli włączone były przypisania bezpośredniego rzutu oraz w wyborze szybkiego rzutu.",
      "[*] Naprawiono błąd powodujący, że jednostki inne niż bohaterowie, duchowy niedźwiedź czy kurier, mogły kupić przedmioty w szybkim zakupie.",
      "[*] Naprawiono błąd umożliwiający kurierowi zabranie przedmiotów ze schowka, gdy znajdował się on w ukrytym sklepie.",
      "[*] Naprawiono błąd powodujący, że klawisze przypisane do modyfikatora klawisza Alt aktywowały inne, niezamierzone działania.",
      "[*] Naprawiono błąd powodujący, że ustawienie jakości sieci nie było stosowane.",
      "[*] Przywrócono brakujące ustawienia takie jak możliwość włączenia zastępowania bohatera w konsolecie wybraną jednostką, włączenia kolejkowania rozkazów na interfejsie oraz wyświetlania filmików z umiejętnościami w objaśnieniach.",
      "[*] Wprowadzono nowe ustawienie do wyłączenia skrótów klawiszowych dla poszczególnych jednostek w grach niestandardowych.",
      "[*] Naprawiono błąd uniemożliwiający przypisanie przedmiotu Town Portal Scroll i przedmiotu neutralnego do przypisań bezpośredniego rzutu.",
      "[*] Naprawiono błąd powodujący, że umiejętność przekazywania przedmiotów kuriera zabierała przedmioty ze schowka, jeśli kurier znajdował się w zasięgu sklepu.",
      "[*] Naprawiono błąd powodujący, że kurier nie przestrzegał zakolejkowanych rozkazów po przekazaniu przedmiotów.",
      "[*] Naprawiono błąd powodujący nieoczekiwane zamykanie się klienta gry, gdy przedmiot z ekwipunku był przeciągany do waszego aktualnego poradnika przedmiotu w trybie edycji.",
      "[*] Naprawiono błąd powodujący, że suwak jasności w pełnym ekranie był odwrócony.",
      "[*] Naprawiono błąd powodujący, że przycisk ponownej kalibracji MMR nie działał.",
      "[*] Naprawiono błąd powodujący, że bohaterowie mogli czasami trwale utknąć w stanie umierania, jeśli śmierć miała miejsce podczas bycia pod wpływem efektu Envenomed Weapon od Vhoul Assassin i innych źródeł negatywnego przywracania zdrowia.",
      "[*] Naprawiono błąd powodujący, że przypisywanie klawiszy w ustawieniach blokowało wprowadzanie danych, jeśli ustawienia zostały zamknięte w trakcie przypisywania klawisza.",
      "[*] Naprawiono błąd powodujący, że kurier nie przenosił zawartości schowka, kiedy zlecono przeniesienie przedmiotów podczas opuszczania fontanny.",
      "[*] Zmieniono nazwę ustawienia „Budynki wymagają przerwania/zatrzymania do anulowania” na „Przechwytywanie budynków wymaga przerwania/zatrzymania do anulowania”.",
      "[*] Od teraz ustawienie „Budynki wymagają przerwania/zatrzymania do anulowania” może działać tylko na przechwytywanie obserwatorów i posterunków. Przywrócono zachowanie anulowania inkantacji bliźniaczych bram oraz portali z um. Fiend's Gate od Underlorda do „Teleportacje wymagają przerwania/zatrzymania do anulowania”.",
      "[*] Od teraz kurier będzie kontynuował ostatni rozkaz przy zmianie do trybu automatycznego dostarczania.",
      "[*] Od teraz panel interfejsu kuriera ma osobne stany dla czekania w ukrytym sklepie i dla ogólnego poruszania się (zamiast pójścia do sklepu lub dostarczania do bohatera). Naprawiono błąd powodujący wyświetlanie znaku zapytania, kiedy kurier poruszał się bez obranego za cel bohatera.",
      "[*] Naprawiono błąd powodujący nieoczekiwane zamykanie niestandardowych gier, jeśli drużyna miała więcej niż 7 graczy.",
      "[*] Naprawiono błąd powodujący, że stan przełączania opcji pokazywania przedmiotów drużyny w sklepie nie był podtrzymywany.",
      "[*] Naprawiono błąd uniemożliwiający przypisanie następujących umiejętności:",
      "[list]",
      "[*] Work Horse od Centaur Warrunnera",
      "[*] Electromagnetic Repulsion od Disruptora",
      "[*] Solar Guardian od Dawnbreaker",
      "[*] Twisted Chakram od Timbersawa",
      "[*] przemieszczenia z Astral Spirit od Elder Titana",
      "[*] Spirits in oraz Spirits out od Io",
      "[*] Roll Up od Pangoliera",
      "[*] Keen Conveyance od Tinkera",
      "[*] Solar Bind/Recall od Keeper of the Lighta.",
      "[/list]",
      "[*] Naprawiono błąd powodujący, że efekty i animacja ryku Roshana nie były odtwarzane.",
      "[*] Naprawiono błąd powodujący, że premia do czasu trwania Helm of the Undying była nakładana wielokrotnie, jeśli więcej ataków trafiło w już martwy cel.",
      "[*] Naprawiono błąd powodujący, że przedmiot Helm of the Undying zliczał obrażenia bliskie śmiertelnym jako zabójstwo bohatera, co skutkowało przyznawaniem zbyt dużej ilości dodatkowego czasu.",
      "[*] Naprawiono błąd powodujący, że efekt cząsteczkowy uderzenia od Serrated Shiv był odtwarzany na początku, zamiast przy uderzeniu.",
      "[*] Naprawiono błąd powodujący, że dźwięk przy użyciu przedmiotu Book of the Dead nie był odtwarzany.",
      "[*] Nprawiono błąd powodujący, że um. Bloodrage od Bloodseekera pomijała przedmiot Linken's Sphere, jeśli została rzucona na wrogów.",
      "[*] Nprawiono błąd powodujący, że wyciszenie z um. Bloodrage od Bloodseekera pomijało niewrażliwość na negatywne efekty u wrogów.",
      "[*] Naprawiono błąd powodujący, że opcja „Wybierz bohatera” podczas um. Nothl Projection od Dazzle'a wybierała jego, zamiast jego formy w projekcji.",
      "[*] Naprawiono błąd powodujący, że na um. Electromagnetic Repulsion od Disruptora z aspektem Transferencja nie miało wpływu skrócenie czasu oczekiwania po ręcznym rzuceniu umiejętności.",
      "[*] Naprawiono błąd powodujący, że duch Elder Titana nie powracał automatycznie, jeśli użyto um. Echo Stomp, gdy Elder Titan miał Aghanim's Shard.",
      "[*] Naprawiono błąd powodujący, że poziomów umiejętności ostatecznych Hoodwink i Ogre Magi nie dało się podwyższyć za pomocą skrótu klawiszowego.",
      "[*] Naprawiono błąd powodujący, że wektorowo celowana um. Ice Wall nie była rzucana bezpośrednio propstopadle do Invokera, gdy dystans punktu końcowego wektora znajdował się poniżej pewnego progu.",
      "[*] Naprawiono błąd powodujący, że jednostki przywiązane do Io były widoczne we mgle wojny, jeśli miały przy sobie przedmiot ozdobny z efektem cząsteczkowym otoczenia.",
      "[*] Naprawiono błąd powodujący, że ataki kataną Keza mającego aspekt Trzepot zadawały mniej obrażeń, niż zamierzono.",
      "[*] Naprawiono błąd powodujący, że obrażenia od ataku kataną Keza mającego aspekt Trzepot, były pochłaniane z zerowym skutkiem w niektórych przypadkach.",
      "[*] Naprawiono błąd powodujący, że um. Raven's Veil od Keza przechodziła w stan oczekiwania, jeśli um. Raptor Dance została przerwana.",
      "[*] Naprawiono błąd powodujący, że spowolnienie z um. Grappling Claw od Keza wciąż było usuwane, gdy atak trafił.",
      "[*] Naprawiono błąd powodujący, że um. Grappling Claw od Keza nie spowalniała na wystarczająco długo.",
      "[*] Naprawiono błąd powodujący, że um. Raven's Veil od Keza przechodziła w stan oczekiwania, jeśli um. Raptor Dance została przerwana.",
      "[*] Naprawiono błąd powodujący, że dodatkowe obrażenia z aspektu Trzepot od Keza były pochłaniane przez fałszywy atak z um. Talon Toss, Falcon Rush oraz przebicia z um. Kazurai Katana.",
      "[*] Naprawiono błąd uniemożliwiający duchowemu niedźwiedziowi Lone Druida szybki zakup przedmiotów z ukrytego sklepu.",
      "[*] Naprawiono błąd powodujący, że schowek nie był wyświetlany po zaznaczeniu duchowego niedźwiedzia od Lone Druida.",
      "[*] Naprawiono błąd powodujący, że um. Reverse Polarity od Magnusa nie odtwarzała animacji ogłuszenia na wrogach.",
      "[*] Naprawiono błąd umożliwiający kradzież podumiejętności aspektu Zmiana Warty od Monkey Kinga.",
      "[*] Naprawiono błąd powodujący problemy z przedmiotami ozdobnymi z zestawu Kult Demona-Szachraja dla Monkey Kinga przy rzucaniu umiejętności z aspektu Zmiana Warty.",
      "[*] Naprawiono błąd powodujący, że po wybraniu aspektu Szybka Ręka um. Gunslinger od Muerty czasami aktywowała się częściej, niż zamierzono.",
      "[*] Naprawiono błąd powodujący odtwarzanie nieprawidłowych kwestii dialogowych dla Muerty po trafieniu um. Deadshot po ulepszeniu przez Aghanim's Scepter.",
      "[*] Naprawiono błąd powodujący, że um. Ghost Shroud od Necrophosa nie zwiększała otrzymywanego leczenia.",
      "[*] Od teraz liczniki czasu run z um. Prognosticate od Oracle'a można pingować z klawiszem Alt.",
      "[*] Naprawiono błąd powodujący, że ataki um. Stinger od Sand Kinga po ulepszeniu przez Aghanim's Scepter miały mniejszy promień, niż zamierzono.",
      "[*] Naprawiono błąd powodujący, że um. Requiem of Souls od Shadow Fienda nie przerażała wrogów, jeśli zginął on zaraz po ukończeniu rzutu.",
      "[*] Naprawiono błąd powodujący, że um. Whirling Death od Timbersawa przywracała więcej zdrowia bohaterom uniwersalnym oraz tym, których bazowym atrybutem jest Siła.",
      "[*] Naprawiono błąd powodujący, że aspekt Sanktuarium od Void Spirita nie zwiększał wartości bariery.",
      "[*] Tryb Ability Draft: naprawiono błąd powodujący, że przełączenia na automatyczny rzut um. Quill Spray w tym trybie nie spowoduje zamiany na um. Hairball, dopóki nie zdobędziecie Aghanim's Shard.",
      "[*] Tryb Ability Draft: naprawiono błąd powodujący, że aspekt Learning Curve od Ogre Magi działał ze wszystkimi umiejętnościami (wymaga wyboru modelu bohatera Ogre Magi).",
      "[*] Tryb Ability Draft: naprawiono wiele przypadków brakujących lub niewłaściwie dodanych talentów.",
      "[*] Naprawiono błąd powodujący, że Bogactwa Bohaterów 2025 początkowo miały nieprawidłowe ustawienia wymiany i wysyłania w prezencie.",
      "[*] Zmniejszono prawdopodobieństwo, że narzędziu sugerowania przedmiotów Dota+ wyczerpią się sugestie przedmiotów dla póżnej fazy gry.",
      "[*] Rozwiązano problem z szybkim zakupem sugerowanych przedmiotów Dota+, aby nie kupować ich wielokrotnie przy szybkim klikaniu.",
      "[/list]"
    ],
    "commentcount": 158,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 2806,
    "votedowncount": 307,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748903943,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2806,
  "votes_down": 307,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}