{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualizarea de joc 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualizarea de joc 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "Actualizarea de joc 7.39b este acum disponibilă și poți consulta jurnalul actualizării [url=https://www.dota2.com/patches/7.39b]aici[/url].",
      "În plus, pe parcursul ultimelor zile am remediat următoarele probleme:",
      "[list]",
      "[*] Au fost remediate diverse căderi suferite de client și server.",
      "[*] Au fost remediate mai multe căderi cauzate de noul meniu de setări.",
      "[*] A fost remediată o problemă privind mutarea obiectelor finalizate în secțiunea „Cumpărare rapidă”.",
      "[*] A fost remediată problema în care meniul vertical „Invocare rapidă” nu era afișat dacă jucătorul se afla în modul „Asocieri cu invocare directă” și avea selectată opțiunea „Invocare rapidă”.",
      "[*] A fost remediată o problemă în care unitățile non-eroice, Spirit Bear sau curierul puteau cumpăra obiecte aflate în secțiunea „Cumpărare rapidă”.",
      "[*] A fost remediată o problemă în care curierul putea prelua obiectele din depozit atunci când se afla la magazinul secret.",
      "[*] A fost remediată problema în care tastele asociate cu „Modificatorul Alt” declanșau alte acțiuni neintenționate.",
      "[*] A fost remediată problema în care setarea „Calitatea rețelei” nu era aplicată.",
      "[*] Au fost readăugate setările care lipseau, precum „Afișează informațiile unității în interfața de erou”, „Afișează coada de comenzi în interfața de joc” și „Afișează videoclipuri cu abilități în descrieri”.",
      "[*] A fost adăugată o setare nouă care permite dezactivarea tastelor rapide specifice unităților în meciurile personalizate.",
      "[*] A fost remediată problema în care Town Portal Scroll și obiectul neutru nu puteau fi asociate cu setarea „Asocieri cu invocare directă”.",
      "[*] A fost remediată o problemă în care abilitatea „Transferă obiectele” a curierului putea prelua obiecte din depozit atunci când curierul se afla în raza magazinului.",
      "[*] A fost remediată problema în care curierul nu respecta ordinea comenzilor după transfer.",
      "[*] A fost remediată o cădere a jocului care avea loc atunci când un obiect din inventar era tras în ghidul curent de obiecte atunci când jucătorul se afla în modul de editare.",
      "[*] A fost remediată problema în care glisorul de luminozitate pentru modul ecran complet era inversat.",
      "[*] A fost remediată problema în care butonul pentru recalibrarea MMR-ului nu funcționa.",
      "[*] A fost remediată o problemă în care eroii puteau rămâne uneori blocați permanent într-o stare de tranziție la moarte dacă aceștia mureau în timp ce erau afectați de efectul negativ al abilității Envenomed Weapon a unității Vhoul Assassin sau alte surse negative de refacere a vieții.",
      "[*] A fost remediată problema în care fereastra din setări pentru asocierea tastelor bloca inputul dacă setările erau închise în timpul unei asocieri de taste.",
      "[*] A fost remediată problema în care curierul nu prelua obiectele din depozit atunci când primea comanda de a transfera obiecte în timp ce părăsea zona fântânii.",
      "[*] Setarea „Structurile necesită menținerea poziției/oprirea pentru anulare” a fost redenumită în „Capturarea structurilor poate fi oprită doar prin comanda de menținere a poziției/anulare”.",
      "[*] Setarea „Capturarea structurilor poate fi oprită doar prin comanda de menținere a poziției/anulare” se aplică acum doar observatoarelor și avanposturilor. Comportamentul de anulare a concentrării pentru portalurile gemene și abilitatea Fiend's Gate a lui Underlord este asociat din nou cu setarea „Teleportarea poate fi oprită doar prin comanda de menținere a poziției/anulare”.",
      "[*] Acum curierul va continua să execute ultima comandă la trecerea în modul de livrare automată.",
      "[*] Panoul curierului din interfața de joc are acum stări distincte pentru așteptarea la magazinul secret și deplasarea generică (în comparație cu deplasarea la un magazin sau livrarea de obiecte către un erou). A fost remediată problema în care un semn de întrebare era afișat atunci când curierul se deplasa către o altă destinație decât un erou.",
      "[*] A fost remediată căderea care avea loc în cazul meciurilor personalizate dacă o echipă avea mai mult de 7 jucători.",
      "[*] A fost remediată problema în care starea opțiunii de afișare a obiectelor echipei în magazin nu era persistentă.",
      "[*] A fost remediată problema în care următoarele abilități nu puteau fi asociate:",
      "[list]",
      "[*] Centaur Warrunner – Work Horse",
      "[*] Disruptor – Electromagnetic Repulsion",
      "[*] Dawnbreaker – Solar Guardian",
      "[*] Timbersaw – Twisted Chakram",
      "[*] Elder Titan – Move Astral Spirit",
      "[*] Io – abilitățile Spirits In și Spirits Out",
      "[*] Pangolier – Roll Up",
      "[*] Tinker – Keen Conveyance",
      "[*] Keeper of the Light – Solar Bind/Recall",
      "[/list]",
      "[*] A fost remediată problema în care abilitatea Roar of Retribution a lui Roshan nu reda efectele/animația.",
      "[*] A fost remediată problema în care obiectul Helm of the Undying aplica bonusul său de durată de mai multe ori dacă mai multe atacuri loveau o țintă deja moartă.",
      "[*] A fost remediată problema în care obiectul Helm of the Undying contoriza daunele aproape letale ca o ucidere de erou, fapt ce determina acordarea de prea mult timp suplimentar.",
      "[*] A fost remediată problema în care particulele de lovire ale obiectului Serrated Shiv erau redate atunci când atacul era inițiat în loc să fie redate atunci când atacul lovea ținta.",
      "[*] A fost remediată problema în care obiectul Book of the Dead nu reda un sunet la invocare.",
      "[*] A fost remediată problema în care abilitatea Bloodrage a lui Bloodseeker ignora Linken's Sphere atunci când era invocată pe inamici.",
      "[*] A fost remediată problema în care amuțirea aferentă abilității Bloodrage a lui Bloodseeker ignora imunitatea la efecte negative a inamicilor.",
      "[*] A fost remediată problema în care, cât timp abilitatea Nothl Projection a lui Dazzle era activă, acțiunea „Selectează eroul” îl selecta pe Dazzle în loc să selecteze proiecția.",
      "[*] A fost remediată problema în care abilitatea Electromagnetic Repulsion a lui Disruptor cu fațeta Transferrence nu beneficia de reducerile de repaus atunci când era invocată manual.",
      "[*] A fost remediată problema în care spiritul lui Elder Titan nu se întorcea automat dacă utiliza Echo Stomp în timp ce Elder Titan avea Aghanim's Shard.",
      "[*] A fost remediată problema în care nivelurile abilităților supreme ale eroilor Ogre Magi și Hoodwink nu putea fi mărite cu ajutorul tastei rapide.",
      "[*] A fost remediată problema în care abilitatea Ice Wall cu țintire vectorială a lui Invoker nu era invocată direct perpendicular cu Invoker atunci când distanța punctului final al vectorului era sub un anumit prag.",
      "[*] A fost remediată problema în care unitățile aflate sub efectul abilității Tether a lui Io apăreau în ceața războiului dacă aveau echipat un accesoriu cu particule ambientale.",
      "[*] A fost remediată problema în care Kez cu fațeta Flutter cauza mai puține daune cu Katana decât trebuia.",
      "[*] A fost remediată problema în care bonusul de daune pentru Katana aferent fațetei Flutter a lui Kez era consumat fără efect în unele scenarii.",
      "[*] A fost remediată problema în care abilitatea Raven's Veil a lui Kez era supusă repausului dacă abilitatea Raptor Dance era întreruptă.",
      "[*] A fost remediată problema în care încetinirea aplicată de abilitatea Grappling Claw a lui Kez încă era eliminată atunci când atacul lovea ținta.",
      "[*] A fost remediată problema în care abilitatea Grappling Claw a lui Kez nu încetinea suficient.",
      "[*] A fost remediată problema în care abilitatea Raven's Veil a lui Kez era supusă repausului dacă abilitatea Raptor Dance era întreruptă.",
      "[*] A fost remediată problema în care bonusurile fațetei Flutter a lui Kez erau consumate de activările false ale abilităților Talon Toss, Falcon Rush și Kazurai Katana.",
      "[*] A fost remediată problema în care unitatea Spirit Bear a lui Lone Druid nu putea cumpăra obiecte specifice magazinului secret din secțiunea de cumpărare rapidă.",
      "[*] A fost remediată problema în care depozitul nu era afișat atunci când unitatea Spirit Bear a lui Lone Druid era selectată.",
      "[*] A fost remediată problema în care abilitatea Reverse Polarity a lui Magnus nu reda animațiile de năucire pe inamici.",
      "[*] A fost remediată problema în care subabilitatea Changing of the Guard a lui Monkey King putea fi furată.",
      "[*] Au fost remediate problemele obiectelor din setul Cult of the Demon Trickster pentru Monkey King care aveau loc la invocarea abilității Changing of the Guard.",
      "[*] A fost remediată problema în care abilitatea Quick Draw a eroinei Muerta determina abilitatea Gunslinger să fie declanșată mai des decât trebuia.",
      "[*] A fost remediată problema în care Muerta reda replici incorecte atunci când lovea un inamic cu versiunea îmbunătățită de Aghanim's Scepter a abilității Deadshot.",
      "[*] A fost remediată problema în care abilitatea Ghost Shroud a lui Necrophos nu mărea vindecarea primită.",
      "[*] Jucătorii pot face acum Alt-clic pe temporizatoarele pentru rune aferente abilității Prognosticate a lui Oracle pentru a trimite un mesaj echipei.",
      "[*] A fost remediată problema în care raza de atac a versiunii îmbunătățită de Aghanim's Scepter a abilității Stinger a lui Sand King era mai mică decât trebuia.",
      "[*] A fost remediată problema în care abilitatea Requiem of Souls a lui Shadow Fiend nu înfricoșa inamicii dacă Shadow Fiend murea imediat după terminarea invocării.",
      "[*] A fost remediată problema în care abilitatea Whirling Death a lui Timbersaw oferea mai multă vindecare decât trebuia pentru eroii de forță și cei universali.",
      "[*] A fost remediată problema în care fațeta Sanctuary a lui Void Spirit nu mărea capacitatea barierei.",
      "[*] Selecție abilități: a fost remediată problema în care comutarea invocării automate pentru abilitatea Quill Spray nu înlocuia abilitatea cu Hairball dacă jucătorul nu avea Aghanim's Shard.",
      "[*] Selecție abilități: a fost remediată problema în care fațeta Learning Curve a eroilor Ogre Magi nu funcționa cu toate abilitățile (necesită alegerea eroilor Ogre Magi).",
      "[*] Selecție abilități: au fost remediate mai multe situații în care talentele lipseau sau erau adăugate incorect.",
      "[*] A fost remediată problema în care seturile de obiecte din comoara Spring 2025 Heroes' Hoard aveau setări incorecte pentru schimburi și oferirea drept cadou.",
      "[*] Acum este mai puțin probabil ca asistentul Dota+ să rămână fără sugestii de obiecte în faza târzie a meciului.",
      "[*] A fost remediată acțiunea de cumpărare rapidă a obiectelor sugerate de Dota+ astfel încât să nu mai fie cumpărate obiecte multiple în cazul clicurilor rapide.",
      "[/list]"
    ],
    "commentcount": 100,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 966,
    "votedowncount": 79,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748632347,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 964,
  "votes_down": 79,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}