{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Gameplay-Update 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Gameplay-Update 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "Das Gameplay-Update 7.39b ist jetzt verfügbar. Die Patchnotizen dazu finden Sie [url=https://www.dota2.com/patches/7.39b]hier[/url].",
      "In den vergangenen Tagen haben wir die folgenden Probleme behoben:",
      "[list]",
      "[*] Eine Vielzahl verschiedener Client- und Server-Abstürze behoben.",
      "[*] Verschiedene Abstürze im Zusammenhang mit dem überarbeiteten Einstellungsmenü behoben.",
      "[*] Fehler behoben, der auftrat, wenn aus mehreren Komponenten bestehende Gegenstände in den Schnellkauf-Bereich gezogen wurden.",
      "[*] Fehler behoben, durch den die Schaltfläche „Individuell konfigurieren“ nicht angezeigt wurde, wenn die Optionen „Alle Zaubermodi einbeziehen“ und „Schnellzauber“ ausgewählt wurden.",
      "[*] Fehler behoben, durch den kontrollierte Einheiten Gegenstände über den Schnellkauf erwerben konnten (nur erlaubt für Helden, Kuriere und Lone Druids Geisterbär).",
      "[*] Fehler behoben, durch den der Kurier über den Geheimladen auf das Lager zugreifen konnte.",
      "[*] Fehler behoben, durch die Taste, die für die „Funktionen der ALT-Taste“ festgelegt wurde, andere unbeabsichtigte Aktionen auslöste.",
      "[*] Fehler behoben, durch den Einstellungen der Netzwerkqualität nicht übernommen wurden.",
      "[*] Fehlende Einstellungen „Einheitenauswahl überschreibt Heldenkonsole“, „Neues Einheitenfenster“, „Eingereihte Befehle anzeigen“ und „Fähigkeitsvideos in Kurzinfos anzeigen“ wieder hinzugefügt.",
      "[*] Einstellung „Heldenspezifische Hotkeys während angepassten Partien deaktivieren“ hinzugefügt.",
      "[*] Fehler behoben, durch den der Town Portal Scroll und dem neutralen Gegenstand kein Hotkey zugewiesen werden konnte, wenn die Optionen „Alle Zaubermodi einbeziehen“ ausgewählt war.",
      "[*] Fehler behoben, durch den der Kurier mit der Fähigkeit „Gegenstände liefern“ in Reichweite des Shops trotzdem auf das Lager zugriff.",
      "[*] Fehler behoben, durch den der Kurier eingereihte Befehle nach einer Gegenstandslieferung ignoriere.",
      "[*] Absturz behoben, der auftrat, wenn im Spiel während der Bearbeitung der aktuellen Gegenstandauswahl ein Gegenstand aus dem Inventar hineingezogen wurde.",
      "[*] Fehler behoben, durch den der Schieberegler für die Helligkeit im Vollbildmodus den umgekehrten Effekt hatte.",
      "[*] Fehler behoben, durch den in Einstellungen > Account > MMW-Rekalibrierung die Schaltfläche „Rekalibrierung aktivieren“ nicht funktionierte.",
      "[*] Problem behoben, durch das Helden gelegentlich dauerhaft in einer Todesübergangsanimation feststeckten, wenn sie bei ihrem Tod vom Schwächungseffekt der Fähigkeit „Vergiftete Waffe“ des Vhoul-Assassinen und anderen Effekten negativer LP-Wiederherstellung betroffen waren.",
      "[*] Fehler behoben, durch den das Dialogfenster beim Zuweisen eines Hotkeys die Eingabe blockierte, wenn die Einstellungen während des Vorgangs vorzeitig geschlossen wurden.",
      "[*] Fehler behoben, durch den der Kurier beim Verlassen des Brunnens die Gegenstände im Lager nicht aufnahm, wenn der Befehl „Gegenstände liefern“ gegeben wurde.",
      "[*] Einstellung „Gebäude-Kanalisierungen […]“ in „Eroberung von Gebäuden kann nur mit Position halten / Aktion abbrechen gestoppt werden“ umbenannt.",
      "[*] Einstellung „Eroberung von Gebäuden kann nur mit Position halten / Aktion abbrechen gestoppt werden“ betrifft jetzt nur noch die Eroberung von Wächtern und Außenposten. Das Kanalisierungsverhalten der Zwillingstore und Underlords Teufelspforte mit der Fähigkeit „Fiend’s Gate“ wird jetzt wieder durch „Teleportationen können nur mit Position halten / Aktion abbrechen gestoppt werden“ festgelegt.",
      "[*] Der Kurier führt jetzt weiterhin seinen letzten Befehl aus, wenn die automatische Lieferung aktiviert wird.",
      "[*] In der HUD-Leiste für den Kurier werden jetzt unterschiedliche Statussymbole bzw. Statusanimationen für das Warten am Geheimladen und für die Bewegung ohne konkreten Befehl angezeigt (diese unterscheiden sich von der Bewegung zu einem Shop oder der Lieferung von Gegenständen an einen Helden). Fehler behoben, durch den ein „?“ angezeigt wurde, wenn sich der Kurier ohne Heldenziel über die Karte bewegte.",
      "[*] Absturz behoben, der in angepassten Partien auftrat, wenn ein Team aus mehr als sieben Spielern bestand.",
      "[*] Fehler behoben, durch den die Einstellung „Teamgegenstände anzeigen oder verbergen“ im Shop nicht beibehalten wurde.",
      "[*] Fehler behoben, durch den für die folgenden Fähigkeiten kein Hotkey festgelegt werden konnte:",
      "[list]",
      "[*] Centaur Warrunners Work Horse",
      "[*] Disruptors Electromagnetic Repulsion",
      "[*] Dawnbreakers Solar Guardian",
      "[*] Timbersaws Twisted Chakram",
      "[*] Elder Titans Move Astral Spirit",
      "[*] Ios Spirits In und Spirits Out",
      "[*] Pangoliers Roll Up",
      "[*] Tinkers Keen Conveyance",
      "[*] Keeper of the Lights Solar Bind und Recall",
      "[/list]",
      "[*] Fehler behoben, durch den die Effekte und die Animation von Roshans Brüllen der Vergeltung nicht abgespielt wurden.",
      "[*] Fehler behoben, durch den der Todesverzögerungseffekt des neutralen Gegenstands „Helm of the Undying“ durch Angriffe auf ein bereits totes Ziel vielfach verlängert wurde.",
      "[*] Fehler behoben, durch den der neutrale Gegenstand „Helm of the Undying“ beinahe tödlichen Schaden als Heldenkill zählte, wodurch der Todesverzögerungseffekt zu lange verlängert wurde.",
      "[*] Fehler behoben, durch den der Partikeleffekt des neutralen Gegenstands „Serrated Shiv“ beim Auslösen statt beim Treffen angezeigt wurde.",
      "[*] Fehler behoben, durch den beim Wirken des neutralen Gegenstands „Book of the Dead“ kein Sound abgespielt wurde.",
      "[*] Fehler behoben, durch den Bloodseekers Fähigkeit „Bloodrage“ beim Wirken auf einen Gegner den Effekt des Gegenstands „Linken’s Sphere“ ignorierte.",
      "[*] Fehler behoben, durch den die Verstummung von Bloodseekers Fähigkeit „Bloodrage“ trotz Schwächungsimmunität auf Gegner wirkte.",
      "[*] Fehler behoben, durch den der Befehl „Held auswählen“ Dazzle statt Dazzles Seele während der Fähigkeit „Nothl Projection“ auswählte.",
      "[*] Fehler behoben, durch den Disruptors Begabung „Elektromagnetische Abstoßung“ mit der Facette „Übertragung“ beim manuellen Wirken nicht von Abklingzeitreduzierung profitierte.",
      "[*] Fehler behoben, durch den Elder Titans Astralgeist nicht automatisch zurückkehrte, wenn er die Fähigkeit „Echo Stomp“ mit Verbesserung durch Aghanims Splitter wirkte.",
      "[*] Fehler behoben, durch den Hoodwinks und Ogre Magis ultimative Fähigkeiten nicht über einen Hotkey aufgewertet werden konnten.",
      "[*] Fehler behoben, durch den der Vektorzielmodus von Invokers Fähigkeit „Ice Wall“ mit Verbesserung durch Aghanims Zepter nicht direkt lotrecht eingesetzt werden konnte, wenn die Distanz zum Endpunkt des Vektors unter einem bestimmten Schwellenwert lag.",
      "[*] Fehler behoben, durch den mit Io verbundene Einheiten im Nebel des Krieges sichtbar waren, wenn sie einen kosmetischen Gegenstand mit Umgebungseffekten ausgerüstet hatten.",
      "[*] Fehler behoben, durch den Kez’ Facette „Flattern“ dafür sorgte, dass er weniger Bonusschaden als vorgesehen zufügte.",
      "[*] Fehler behoben, durch den der Bonusschaden mit Kez’ Facette „Flattern“ in einigen Fällen nicht zugefügt wurde.",
      "[*] Fehler behoben, durch den Kez’ Fähigkeit „Raven’s Veil“ eine Abklingzeit erhielt, wenn die Fähigkeit „Raptor Dance“ unterbrochen wurde.",
      "[*] Fehler behoben, durch den die Verlangsamung von Kez’ Fähigkeit „Grappling Claw“ entfernt wurde, wenn der Angriff traf.",
      "[*] Fehler behoben, durch den das Ziel von Kez’ Fähigkeit „Grappling Claw“ nicht lange genug verlangsamt wurde.",
      "[*] Fehler behoben, durch den Kez’ Fähigkeit „Raven’s Veil“ eine Abklingzeit erhielt, wenn die Fähigkeit „Raptor Dance“ unterbrochen wurde.",
      "[*] Fehler behoben, durch den der Bonusschaden mit Kez’ Facette „Flattern“ beim Wirken der Fähigkeiten „Talon Toss“, „Falcon Rush“ und „Kazurai Katana“ nicht zugefügt wurde.",
      "[*] Fehler behoben, durch den Lone Druids Geisterbär keine Gegenstände des Geheimladens über den Schnellkauf erwerben konnte.",
      "[*] Fehler behoben, durch den das Lager für Lone Druids Geisterbären nicht angezeigt wurde.",
      "[*] Fehler behoben, durch den die Betäubungsanimation von Magnus’ Fähigkeit „Reverse Polarity“ für Gegner nicht abgespielt wurde.",
      "[*] Fehler behoben, durch den Monkey Kings Unterfähigkeit „Wachablösung“ gestohlen werden konnte.",
      "[*] Problem mit dem kosmetischen Gegenstandsset „Kult des dämonischen Schwindlers“ beim Wirken der Unterfähigkeit „Wachablösung“ von „Wukong’s Command“ behoben.",
      "[*] Fehler behoben, durch den Muertas Facette „Schnelles Ziehen“ dafür sorgte, dass die Fähigkeit „Gunslinger“ häufiger als vorgesehen ausgelöst wurde.",
      "[*] Fehler behoben, durch den Muerta den falschen Kommentar abgab, wenn sie ein Ziel mit der Fähigkeit „Deadshot“ mit Verbesserung durch Aghanims Zepter traf.",
      "[*] Fehler behoben, durch den die eingehende Heilung während Necrophos’ Fähigkeit „Ghost Shroud“ nicht verstärkt wurde.",
      "[*] Oracle kann jetzt mit seiner Begabung „Hellsichtigkeit“ sein Team mittels ALT-Ping über die Runen-Zeitpunkte informieren.",
      "[*] Fehler behoben, durch den der Radius des Angriffs von Sand Kings Fähigkeit „Stinger“ mit Verbesserung durch Aghanims Zepter kürzer als vorgesehen war.",
      "[*] Fehler behoben, durch den Shadow Fiends Fähigkeit „Requiem of Souls“ Gegner nicht in Furcht versetzte, wenn er direkt nach Abschluss des Wirkens starb.",
      "[*] Fehler behoben, durch den Stärke- und Universalhelden, die von Timbersaws Fähigkeit „Whirling Death“ betroffen waren, stärker als vorgesehen geheilt wurden.",
      "[*] Fehler behoben, durch den Void Spirits Facette „Zuflucht“ die Barrierenpunkte nicht erhöhte.",
      "[*] Ability Draft: Fehler behoben, durch den mittels Autozauber die Fähigkeit „Quill Spray“ zu „Hairball“ gewechselt werden konnte, jedoch ein Zurückwechseln ohne Aghanims Splitter nicht möglich war.",
      "[*] Ability Draft: Fehler behoben, durch den Ogre Magis Facette „Lernkurve“ nicht mit allen Fähigkeiten funktionierte (Ogre Magi muss als Grundheld ausgewählt werden).",
      "[*] Ability Draft: Fehler behoben, durch den in einigen Fällen Talente fehlten oder fälschlicherweise angezeigt wurden.",
      "[*] Fehler behoben, durch den der Frühlings-Heldenschatz 2025 die falschen Einstellungen zum Handeln und Verschenken aufwies.",
      "[*] Problem behoben, durch den der Dota-Plus-Assistent bei langen Partien keine Gegenstände mehr vorschlug.",
      "[*] Fehler behoben, durch den vom Dota-Plus-Assistenten vorgeschlagene Gegenstände nicht mehrfach gekauft wurden, wenn ein Spieler schnell auf diese klickte.",
      "[/list]"
    ],
    "commentcount": 98,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 923,
    "votedowncount": 75,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748628685,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 922,
  "votes_down": 75,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}