{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Ενημέρωση παιχνιδιού 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ενημέρωση παιχνιδιού 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "H ενημέρωση 7.39b κυκλοφόρησε και μπορείτε να δείτε τις σημειώσεις ενημέρωσης [url=https://www.dota2.com/patches/7.39b]εδώ[/url].",
      "Επίσης, τις τελευταίες ημέρες διορθώσαμε τα ακόλουθα προβλήματα:",
      "[list]",
      "[*] Διορθώθηκαν διάφοροι απρόσμενοι τερματισμοί παιχνιδιού και διακομιστή.",
      "[*] Διορθώθηκαν διάφοροι απρόσμενοι τερματισμοί που σχετίζονταν με το νέο μενού ρυθμίσεων.",
      "[*] Διορθώθηκε πρόβλημα με τη μετακίνηση ολόκληρων αντικειμένων στην άμεση αγορά.",
      "[*] Διορθώθηκε πρόβλημα όπου το αναπτυσσόμενο μενού γρήγορης εκτέλεσης δεν εμφανιζόταν στις απευθείας δεσμεύσεις εκτέλεσης και στην επιλογή γρήγορης εκτέλεσης.",
      "[*] Διορθώθηκε πρόβλημα όπου ήταν δυνατό να αγοράσουν αντικείμενα στην άμεση αγορά μονάδες πέρα από τον ήρωα, την αρκούδα και τον μεταφορέα.",
      "[*] Διορθώθηκε πρόβλημα όπου ο μεταφορέας μπορούσε να πάρει αντικείμενα από τη φύλαξη, όταν βρισκόταν στο Μυστικό Μαγαζί.",
      "[*] Διορθώθηκε πρόβλημα όπου τα πλήκτρα που ήταν δεσμευμένα στο πλήκτρο Alt ενεργοποιούσαν ακούσια άλλες ενέργειες.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν εφαρμοζόταν η ρύθμιση για την ποιότητα δικτύου.",
      "[*] Προστέθηκαν ξανά ρυθμίσεις που έλειπαν, όπως η ενεργοποίηση του πάνελ ελέγχου, των εντολών σε ουρά στη διεπαφή και των βίντεο ικανοτήτων στις επεξηγήσεις.",
      "[*] Προστέθηκε νέα ρύθμιση για την απενεργοποίηση πλήκτρων συντόμευσης ανά μονάδα σε προσαρμοσμένα παιχνίδια.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν ήταν δυνατή η δέσμευση του Town Portal Scroll και του ουδέτερου αντικειμένου με απευθείας δεσμεύσεις εκτέλεσης.",
      "[*] Διορθώθηκε πρόβλημα όπου η ικανότητα «Μεταφορά Αντικειμένων» του μεταφορέα μπορούσε να πάρει αντικείμενα από τη φύλαξη, αν ο μεταφορέας βρισκόταν εντός εμβέλειας του Μυστικού Μαγαζιού.",
      "[*] Διορθώθηκε πρόβλημα όπου ο μεταφορέας δεν τηρούσε τις εντολές σε ουρά μετά τη μεταφορά.",
      "[*] Διορθώθηκε απρόσμενος τερματισμός του παιχνιδιού κατά τη μεταφορά ενός αντικειμένου από τη λίστα αντικειμένων σας στον τρέχοντα οδηγό αντικειμένων σας, όταν αυτός είχε τεθεί σε λειτουργία προσαρμογής.",
      "[*] Διορθώθηκε πρόβλημα όπου ο δείκτης της φωτεινότητας σε πλήρη οθόνη ήταν ανεστραμμένος.",
      "[*] Διορθώθηκε το κουμπί «Επανυπολογισμός MMR» που δεν λειτουργούσε.",
      "[*] Διορθώθηκε πρόβλημα όπου μερικές φορές οι ήρωες μπορούσαν να «κολλήσουν» οριστικά σε κατάσταση μετάβασης από θάνατο, αν ο θάνατος συνέβαινε ενώ ήταν επηρεασμένοι από την απομείωση Envenomed Weapon του Vhoul Assassin, καθώς και από άλλες πηγές αρνητικής επαναφοράς ζωής.",
      "[*] Διορθώθηκε πρόβλημα στις ρυθμίσεις όπου η δέσμευση πλήκτρων εμπόδιζε την είσοδο, αν οι ρυθμίσεις ήταν κλειστές κατά τη διάρκεια της δέσμευσης ενός πλήκτρου.",
      "[*] Διορθώθηκε πρόβλημα όπου ο μεταφορέας δεν έπαιρνε τα αντικείμενα από τη φύλαξη, όταν του δινόταν εντολή να μεταφέρει αντικείμενα ενώ έφευγε από το σιντριβάνι.",
      "[*] Έγινε μετονομασία της ρύθμισης «Τα κτήρια απαιτούν στάση/ακύρωση για διακοπή» σε «Η κατάκτηση κτηρίων απαιτεί στάση/ακύρωση για διακοπή».",
      "[*] Η ρύθμιση «Η κατάκτηση κτηρίων απαιτεί στάση/ακύρωση για διακοπή» τώρα επηρεάζει μόνο την κατάκτηση των Παρατηρητών και των Φυλακίων. Η συμπεριφορά ακύρωσης της διοχέτευσης των Δίδυμων Πυλών και του Fiend's Gate του Underlord επέστρεψε στη ρύθμιση «Η τηλεμεταφορά απαιτεί στάση/ακύρωση για διακοπή».",
      "[*] Ο μεταφορέας θα συνεχίζει πλέον να εκτελεί την τελευταία του εντολή, όταν γίνεται αλλαγή στη λειτουργία αυτόματης παράδοσης.",
      "[*] Η διεπαφή του μεταφορέα πλέον έχει ξεχωριστές καταστάσεις για την αναμονή στο Μαγικό Μαγαζί και την κίνηση γενικά (αντί για τη μετάβαση σε ένα μαγαζί ή την παράδοση σε έναν ήρωα). Διορθώθηκε πρόβλημα όπου εμφανιζόταν ένα «?» όταν ο μεταφορέας μετακινούνταν χωρίς να έχει ως προορισμό κάποιον ήρωα.",
      "[*] Διορθώθηκε πρόβλημα όπου τα προσαρμοσμένα παιχνίδια τερματίζονταν απρόσμενα, αν μια ομάδα είχε περισσότερους από 7 παίκτες.",
      "[*] Διορθώθηκε πρόβλημα όπου η κατάσταση της ρύθμισης «Εναλλαγή προβολής αντικειμένων ομάδας» δεν παρέμενε αποθηκευμένη.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν ήταν δυνατή η δέσμευση των ακόλουθων ικανοτήτων:",
      "[list]",
      "[*] Το Work Horse του Centaur Warrunner",
      "[*] Το Electromagnetic Repulsion του Disruptor",
      "[*] Το Solar Guardian της Dawnbreaker",
      "[*] Το Twisted Chakram του Timbersaw",
      "[*] Το Move Astral Spirit του Elder Titan",
      "[*] Τα Spirits In και Spirits Out του Io",
      "[*] Το Roll Up του Pangolier",
      "[*] Το Keen Conveyance του Tinker",
      "[*] Τα Solar Bind και Recall του Keeper of the Light",
      "[/list]",
      "[*] Διορθώθηκε πρόβλημα όπου δεν γινόταν αναπαραγωγή του εφέ/της κίνησης του Roar of Retribution του Roshan.",
      "[*] Διορθώθηκε πρόβλημα όπου το Helm of the Undying εφάρμοζε την επιπλέον διάρκειά του πολλές φορές, αν γίνονταν περισσότερα επιτυχή χτυπήματα σε έναν ήδη νεκρό στόχο.",
      "[*] Διορθώθηκε πρόβλημα όπου το Helm of the Undying προσμετρούσε τη σχεδόν θανάσιμη ζημιά ως σκοτωμό ήρωα, με αποτέλεσμα να παρέχει υπερβολικά πολύ επιπλέον χρόνο.",
      "[*] Διορθώθηκε πρόβλημα όπου γινόταν αναπαραγωγή του εφέ σωματιδίων του χτυπήματος του Serrated Shiv όταν η επίθεση ξεκινούσε και όχι όταν πετύχαινε τον στόχο.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν γινόταν αναπαραγωγή ήχου κατά την εκτέλεση του Book of the Dead.",
      "[*] Διορθώθηκε πρόβλημα όπου το Bloodrage του Bloodseeker διαπερνούσε το Linken's Sphere κατά την εκτέλεση του Bloodrage σε εχθρούς.",
      "[*] Διορθώθηκε πρόβλημα όπου η σιγή του Bloodrage του Bloodseeker διαπερνούσε την ατρωσία απομειώσεων σε εχθρούς.",
      "[*] Διορθώθηκε πρόβλημα κατά τη διάρκεια του Nothl Projection του Dazzle, όπου το πλήκτρο συντόμευσης «Επιλογή ήρωα» επέλεγε τον Dazzle αντί για το πνεύμα.",
      "[*] Διορθώθηκε πρόβλημα όπου το Electromagnetic Repulsion του Disruptor με Transference δεν επηρεαζόταν από μείωση επαναφορτίσεων, όταν εκτελούνταν με μη αυτόματο τρόπο.",
      "[*] Διορθώθηκε πρόβλημα όπου το Astral Spirit του Elder Titan δεν επέστρεφε αυτόματα, αν γινόταν χρήση του Echo Stomp ενώ ο Elder Titan είχε Aghanim's Shard.",
      "[*] Διορθώθηκε πρόβλημα όπου οι απόλυτες ικανότητες της Hoodwink και του Ogre Magi δεν μπορούσαν να αναβαθμιστούν μέσω πλήκτρου συντόμευσης.",
      "[*] Διορθώθηκε πρόβλημα όπου η ικανότητα στόχευσης διανύσματος Ice Wall του Invoker δεν εκτελούνταν τελείως κάθετα στον Invoker, όταν η απόσταση του τελικού σημείου του διανύσματος ήταν κάτω από ένα συγκεκριμένο όριο.",
      "[*] Διορθώθηκε πρόβλημα όπου οι μονάδες που ήταν ενωμένες με το Io εμφανίζονταν στη σκιά του πολέμου, αν είχαν εξοπλισμένο ένα κοσμητικό αντικείμενο με σωματίδια περιβάλλοντος.",
      "[*] Διορθώθηκε πρόβλημα όπου το Flutter (Κατάνα) του Kez προκαλούσε λιγότερη ζημιά από το προβλεπόμενο.",
      "[*] Διορθώθηκε πρόβλημα όπου η ζημιά του Flutter (Κατάνα) του Kez καταναλωνόταν χωρίς καμία επίδραση σε μερικές περιπτώσεις.",
      "[*] Διορθώθηκε πρόβλημα όπου το Raven's Veil του Kez έμπαινε σε επαναφόρτιση, αν γινόταν διακοπή του Raptor Dance.",
      "[*] Διορθώθηκε πρόβλημα όπου η επιβράδυνση του Grappling Claw του Kez εξακολουθούσε να αφαιρείται, όταν η επίθεση πετύχαινε.",
      "[*] Διορθώθηκε πρόβλημα όπου η επιβράδυνση του Grappling Claw του Kez δεν διαρκούσε για αρκετό χρονικό διάστημα.",
      "[*] Διορθώθηκε πρόβλημα όπου το Raven's Veil του Kez έμπαινε σε επαναφόρτιση, αν γινόταν διακοπή του Raptor Dance.",
      "[*] Διορθώθηκε πρόβλημα όπου το Flutter (Κατάνα) του Kez καταναλωνόταν από τα Talon Toss, Falcon Rush και την προσποίηση του καρφώματος Katana.",
      "[*] Διορθώθηκε πρόβλημα όπου η αρκούδα του Lone Druid δεν μπορούσε να αγοράσει αντικείμενα του Μυστικού Μαγαζιού από την άμεση αγορά.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν εμφανιζόταν η φύλαξη όταν επιλεγόταν η αρκούδα του Lone Druid.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν γινόταν αναπαραγωγή των κινήσεων σαστίσματος σε εχθρούς από το Reverse Polarity του Magnus.",
      "[*] Διορθώθηκε πρόβλημα όπου ήταν δυνατό να κλαπεί η υποϊκανότητα Changing of the Guard του Monkey King.",
      "[*] Διορθώθηκαν κοσμητικά προβλήματα με το Cult of the Demon Trickster του Monkey King κατά την εκτέλεση του Changing of the Guard.",
      "[*] Διορθώθηκε πρόβλημα όπου το Quickdraw της Muerta προκαλούσε μερικές φορές περισσότερες ενεργοποιήσεις του Gunslinger από το προβλεπόμενο.",
      "[*] Διορθώθηκε πρόβλημα όπου γινόταν αναπαραγωγή λανθασμένων ηχητικών από τη Muerta όταν προκαλούσε χτυπήματα με το Dead Shot που είχε ενισχυθεί από το Aghanim's Scepter.",
      "[*] Διορθώθηκε πρόβλημα όπου το Ghost Shroud του Necrophos δεν αύξανε την εισερχόμενη θεραπεία.",
      "[*] Είναι πλέον δυνατό να γίνει ping με Alt + κλικ στους χρόνους των ρούνων εντός κόσμου του Prognosticate του Oracle.",
      "[*] Διορθώθηκε πρόβλημα όπου η εμβέλεια επίθεσης του Stinger του Sand King με Aghanim's Scepter ήταν χαμηλότερη από το προβλεπόμενο.",
      "[*] Διορθώθηκε πρόβλημα όπου το Requiem of Souls του Shadow Fiend δεν προκαλούσε φόβο σε εχθρούς, αν ο Shadow Fiend πέθαινε ακριβώς μετά την ολοκλήρωση της εκτέλεσης.",
      "[*] Διορθώθηκε πρόβλημα όπου το Whirling Death του Timbersaw προκαλούσε περισσότερη θεραπεία από την προβλεπόμενη σε ήρωες δύναμης και σε επιδέξιους ήρωες.",
      "[*] Διορθώθηκε πρόβλημα όπου το Sanctuary του Void Spirit δεν αύξανε το ποσό του φράγματος.",
      "[*] Ability Draft: Διορθώθηκε πρόβλημα όπου η εναλλαγή της αυτόματης εκτέλεσης στο Quill Spray δεν έκανε την αλλαγή στο Hairball μέχρι να αποκτούσατε Aghanim's Shard.",
      "[*] Ability Draft: Διορθώθηκε η όψη Learning Curve του Ogre Magi για να λειτουργεί με όλες τις ικανότητες (απαιτεί να έχει επιλεχθεί το μοντέλο ήρωα του Ogre Magi).",
      "[*] Ability Draft: Διορθώθηκαν πολλές περιπτώσεις ταλέντων που έλειπαν ή που είχαν προστεθεί λανθασμένα.",
      "[*] Διορθώθηκε πρόβλημα όπου το Heroes' Hoard για την Άνοιξη 2025 είχε αρχικά λανθασμένες ρυθμίσεις για τις ανταλλαγές και τα δώρα.",
      "[*] Έγινε λιγότερο πιθανό το να μην έχει το σύστημα προτάσεων αντικειμένων Dota+ αντικείμενα για να προτείνει στο τέλος του παιχνιδιού.",
      "[*] Διορθώθηκε πρόβλημα με την άμεση αγορά προτεινόμενων αντικειμένων από το Dota+, ώστε να μην γίνεται αγορά πολλαπλών αντικειμένων όταν γίνεται κλικ γρήγορα.",
      "[/list]"
    ],
    "commentcount": 101,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 1013,
    "votedowncount": 85,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748637075,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 1012,
  "votes_down": 85,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}