{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Speluppdatering 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Speluppdatering 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "Uppdatering 7.39b är ute nu. Kolla in uppdateringsanteckningarna [url=https://www.dota2.com/patches/7.39b]här[/url].",
      "Under de senaste dagarna har vi dessutom tagit itu med följande problem:",
      "[list]",
      "[*] Åtgärdade ett antal klient- och serverkrascher.",
      "[*] Åtgärdade olika krascher relaterade till den nya inställningsmenyn.",
      "[*] Åtgärdade ett problem med att flytta föremål bestående av flera komponenter i snabbköp.",
      "[*] Åtgärdade att rullgardinsmenyn för snabbanvändning inte visades om man var inne i direktbindningar och snabbanvändningsvalen.",
      "[*] Åtgärdade ett problem med att andra enheter än hjälten, Spirit Bear eller kuriren kunde köpa föremål med snabbköp.",
      "[*] Åtgärdade ett problem med att kuriren kunde hämta föremål från förrådet i den hemliga butiken.",
      "[*] Åtgärdade att nycklar som var bundna till Alt-modifieraren utlöste andra oavsiktliga handlingar.",
      "[*] Åtgärdade att inställningen för nätverkskvalitet inte aktiverades.",
      "[*] Lade till saknade inställningar på nytt, t.ex. aktivering av informationspanelen i HUD:n och förmågevideor i verktygstipsen.",
      "[*] Introducerade en ny inställning för att inaktivera snabbtangenter per enhet i anpassade spel.",
      "[*] Åtgärdade att det inte gick att binda Town Portal Scroll och neutrala föremål med direkta bindningar.",
      "[*] Åtgärdade ett problem där kurirförmågan Överför föremål hämtade från förrådet om kuriren var i närheten av en butik.",
      "[*] Åtgärdade att kuriren inte tog hänsyn till köordrar efter överföring.",
      "[*] Åtgärdade att spelklienten kraschade när ett föremål från ryggsäcken drogs till den nuvarande föremålsguiden när den var i redigeringsläge.",
      "[*] Åtgärdade att reglaget för ljusstyrka i helskärm inverterades.",
      "[*] Åtgärdade att knappen för MMR-omkalibrering inte fungerade.",
      "[*] Åtgärdade ett problem där döda hjältar ibland kunde fastna permanent i övergångstillståndet om döden inträffade medan de påverkades av Vhoul Assassins debuff Envenomed Weapon och andra källor till negativ HP-återställning.",
      "[*] Åtgärdade att tangentbindning i inställningarna blockerade inmatning om inställningarna stängdes medan man var i färd med att binda en tangent.",
      "[*] Åtgärdade att kuriren inte hämtade föremål från förrådet när den fick order om att överföra föremål samtidigt som den lämnade fontänen.",
      "[*] Bytte namn på inställningen Byggnader kräver håll/avbryt för att stoppa till Erövring av byggnader kräver håll/avbryt för att stoppa.",
      "[*] Inställningen Erövring av byggnader kräver håll/avbryt för att stoppa påverkar nu bara erövring av Watchers och utposter. Beteende för att avbryta kanalisering för tvillingportar och Underlords Fiend's Gate har flyttats tillbaka till Teleportering kräver håll/avbryt för att stoppa.",
      "[*] Kuriren fortsätter nu med sin senaste order när man växlar till automatisk leverans.",
      "[*] HUD-panelen för kurirer har nu olika lägen för när kuriren väntar vid den hemliga butiken och för generisk förflyttning (istället för när den går till en butik eller levererar till en hjälte). Åtgärdade att ett ? visades när kuriren förflyttade sig utan en hjältedestination.",
      "[*] Åtgärdade ett problem med att anpassade matcher kraschade om ett lag hade fler än sju spelare.",
      "[*] Åtgärdade att läget för visning av lagföremål inte kvarstod i butiken.",
      "[*] Åtgärdade att man inte kunde binda följande förmågor:",
      "[list]",
      "[*] Centaur Warrunners Work Horse",
      "[*] Disruptors Electromagnetic Repulsion",
      "[*] Dawnbreakers Solar Guardian",
      "[*] Timbersaws Twisted Chakram",
      "[*] Elder Titans Move Astral Spirit",
      "[*] Ios Spirits in och Spirits out",
      "[*] Pangoliers Roll Up",
      "[*] Tinkers Keen Conveyance",
      "[*] Keeper of the Lights Solar Bind/Recall.",
      "[/list]",
      "[*] Åtgärdade att Roshans Roar inte spelade upp effekten/animationen.",
      "[*] Åtgärdade att Helm of the Undead applicerade varaktighetsbonusen flera gånger om fler attacker träffade ett redan dött mål.",
      "[*] Åtgärdade att Helm of the Undying räknade nästan dödlig skada som hjältekill, vilket resulterade i att för mycket extra tid gavs.",
      "[*] Åtgärdade att Serrated Shivs partikeleffekt visades när attacken startade istället för när den träffade.",
      "[*] Åtgärdade att Book of the Dead inte spelade upp ljud vid användning.",
      "[*] Åtgärdade att Bloodseekers Bloodrage ignorerade Linkens Sphere när den användes på fiender.",
      "[*] Åtgärdade att tystnad från Bloodseekers Bloodrage gick igenom fienders debuffimmunitet.",
      "[*] Åtgärdade att Dazzle valdes istället för projektionen när man tryckte på Välj hjälte under Dazzles Nothl Projection.",
      "[*] Åtgärdade att Disruptors Electromagnetic Repulsion med Transferrence inte påverkades av cooldownreducering vid manuell användning.",
      "[*] Åtgärdade att Elder Titans ande inte återvände automatiskt vid användning av Echo Stomp när Titan har Aghanim's Shard.",
      "[*] Åtgärdade att Hoodwinks och Ogre Magis ultimata förmågor inte kunde öka i nivå via snabbtangent.",
      "[*] Åtgärdade att Invokers förmåga Ice Wall inte användes direkt vinkelrätt från Invoker när vektorns slutpunktsavstånd var under ett visst tröskelvärde.",
      "[*] Åtgärdade att enheter bundna till Io dök upp i Fog of War om ett kosmetiskt föremål med omgivande partiklar var utrustat.",
      "[*] Åtgärdade att Kez fasett Flutter (Katana) gjorde mindre skada än avsett.",
      "[*] Åtgärdade att skada från Kez fasett Flutter (Katana) förbrukades utan effekt i vissa scenarier.",
      "[*] Åtgärdade att Kez förmåga Raven's Veil sattes på cooldown om Raptor Dance avbröts.",
      "[*] Åtgärdade att nedsaktningen från Kez förmåga Grippling Claws togs bort när attacken träffade.",
      "[*] Åtgärdade att Kez förmåga Grappling Claw inte visades tillräckligt länge.",
      "[*] Åtgärdade att Kez förmåga Raven's Veil sattes på cooldown om Raptor Dance avbröts.",
      "[*] Åtgärdade att Kez Flutter förbrukades av Talon Toss, Falcon Rush och Kazurai Katanas falska attack.",
      "[*] Åtgärdade att Lone Druids Spirit Bear inte kunde köpa föremål från hemliga butiken i snappköp.",
      "[*] Åtgärdade att förrådet inte dök upp när Lone Druids Spirit Bear valdes.",
      "[*] Åtgärdade att Magnus Reverse Polarity inte spelade upp bedövningsanimationer på fiender.",
      "[*] Åtgärdade att Monkey Kings underförmåga Changing of the Guard kunde stjälas.",
      "[*] Åtgärdade kosmetiska problem med Monkey Kings Demon Trickster vid användning av Changing of the Guard.",
      "[*] Åtgärdade att Muertas Quick Draw ibland fick Gunslinger att utlösas oftare än avsett.",
      "[*] Åtgärdade att Muerta sa fel replik när hon träffade med Deadshot förstärkt av Aghanim's Scepter.",
      "[*] Åtgärdade att Necrophos Ghost Shroud inte ökade inkommande helande.",
      "[*] Oracles runtimer från Prognosticate kan nu alt-pingas.",
      "[*] Åtgärdade att Sand Kings attackradie med Stinger med Aghanim's Scepter var kortare än avsett.",
      "[*] Åtgärdade att Shadow Fiends Requiem of Souls inte skrämde fiender om Shadow Fiend dog direkt efter att förmågan hade använts.",
      "[*] Åtgärdade att Timbersaws förmåga Whirling Death helade styrkehjältar och universella hjältar mer än förväntat.",
      "[*] Åtgärdade att Void Spirits fasett Sanctuary inte ökade barriärmängden.",
      "[*] Ability Draft: Åtgärdade att autoanvändning av Quill Spray inte bytte till Hairball förrän man hade Aghanim's Shard.",
      "[*] Ability Draft: Åtgärdade Ogre Magis fasett Learning Curve så att den fungerar med alla förmågor (kräver att man har valt Ogre Magis hjältemodell).",
      "[*] Ability Draft: Åtgärdade många fall av saknade eller felaktigt tillagda talanger.",
      "[*] Åtgärdade att Heroes' Hoard för våren 2025 hade fel inställningar för byteshandel och gåvor.",
      "[*] Gjorde det mindre troligt att föremålsförslag i Dota Plus skulle få slut på föremål att föreslå i slutet av matchen.",
      "[*] Åtgärdade att snabbköp av föreslagna Dota Plus-föremål köpte dubbletter när man klickade snabbt.",
      "[/list]"
    ],
    "commentcount": 101,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 1052,
    "votedowncount": 88,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748642224,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 1052,
  "votes_down": 88,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}