{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Parche de jugabilidad 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Parche de jugabilidad 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "Lanzamos el parche de jugabilidad 7.39b y puedes consultar las notas del parche [url=https://www.dota2.com/patches/7.39b]aquí[/url].",
      "Además, en los últimos días abordamos los siguientes problemas:",
      "[list]",
      "[*] Se corrigieron varios bloqueos distintos del cliente y del servidor.",
      "[*] Se corrigieron varios errores relacionados con el nuevo menú de Configuraciones.",
      "[*] Se corrigió un problema al mover un conjunto de objetos durante la compra rápida.",
      "[*] Se corrigió el menú desplegable de lanzamiento rápido que no aparecía en las asignaciones de lanzamiento directo ni en la selección de lanzamiento rápido.",
      "[*] Se corrigió un problema con las unidades distintas a los héroes, Espíritu Oso o el Mensajero que podían comprar objetos en la compra rápida.",
      "[*] Se corrigió un problema con el Mensajero que podía tomar objetos de la reserva al estar en la Tienda Secreta.",
      "[*] Se corrigieron las teclas vinculadas a la tecla modificadora \"Alt\" que activaban otras acciones no intencionales.",
      "[*] Se corrigió un problema con la definición de la calidad de la red que no funcionaba correctamente.",
      "[*] Se agregaron de nuevo los ajustes faltantes, como la activación del panel de consulta, la activación de las órdenes en cola en el HUD y la activación de videos en los detalles de habilidades.",
      "[*] Se agregó un nuevo ajuste para desactivar las teclas rápidas de unidades en partidas personalizadas.",
      "[*] Se corrigió un problema por el cual los Pergaminos de Teletransporte y los objetos neutrales no se podían vincular a asignaciones de lanzamiento directo.",
      "[*] Se corrigió un problema donde la habilidad del mensajero \"Transferir Objetos\" tomaba objetos de la reserva si el Mensajero estaba cerca de la tienda.",
      "[*] El Mensajero ya toma en cuenta los pedidos en cola después de la transferencia.",
      "[*] Se corrigió un problema al arrastrar un objeto desde el inventario a la guía de objetos actual al estar en modo de edición de la guía, lo que provocaba que el juego se bloqueara.",
      "[*] Se corrigió un problema con el deslizante de brillo en pantalla completa que estaba invertido.",
      "[*] Se corrigió el botón \"Recalibración de MMR\" que no funcionaba.",
      "[*] Se corrigió un problema con los héroes que a veces quedaban atrapados en un estado de transición durante la muerte si esta ocurría cuando estaban afectados por el efecto negativo Arma Envenenada de Vhoul Asesino y por otras fuentes de restauración negativa de vida.",
      "[*] Se corrigió la asignación de teclas que bloqueaba la entrada si se cerraba la configuración cuando se estaba asignando una tecla.",
      "[*] Se corrigió un problema por el cual el Mensajero no recogía objetos de la reserva cuando se le pedía que transfiriera objetos al salir de la fuente.",
      "[*] Se cambió el nombre de \"Las estructuras requieren mantener presionado/detener para cancelar\" a \"Capturar estructuras requiere mantener presionado/cancelar para detener\".",
      "[*] \"Capturar estructuras requiere mantener presionado/cancelar para detener\" ahora solo afecta al capturar vigilantes y puestos avanzados. Ahora para cancelar una canalización de los Portales Gemelos y Portal Demoníaco de Underlord se cambió a \"Teletransporte requiere mantener presionado/detener para cancelar\".",
      "[*] Ahora el Mensajero continuará llevando a cabo su última orden al cambiar al modo de entrega automática.",
      "[*] El panel del HUD del Mensajero ahora tiene estados separados para la espera en la Tienda Secreta y para moverse normalmente (para distinguirlo de ir a la tienda o hacer una entrega a un héroe). Se corrigió un signo de pregunta (?) que aparecía cuando el mensajero se movía sin que su destino fuera un héroe.",
      "[*] Se corrigió que las partidas personalizadas se bloquearan si un equipo tenía más de 7 jugadores.",
      "[*] Se solucionó un problema por el cual la habilitación de la visualización de objetos del equipo en la tienda no duraba.",
      "[*] Ahora ya se pueden vincular las siguientes habilidades:",
      "[list]",
      "[*] Caballo de Trabajo de Centaur Warrunner",
      "[*] Repulsión Electromagnética de Disruptor",
      "[*] Guardiana Solar de Dawnbreaker",
      "[*] Chakram Retorcido de Timbersaw",
      "[*] Mover Espíritu Astral de Elder Titan",
      "[*] Acercar Espíritus y Alejar Espíritus de Io",
      "[*] Enrollar de Pangolier",
      "[*] Transporte Ingenioso de Tinker",
      "[*] Vínculo Solar/Llamada de Keeper of the Light",
      "[/list]",
      "[*] Se corrigió el sonido y el efecto de animación de Roshan que no se reproducían.",
      "[*] Se corrigió un problema con Yelmo de los Inmortales que aplicaba su duración adicional varias veces si más ataques llegaban a un objetivo ya muerto.",
      "[*] Se corrigió que Yelmo de los Inmortales contara el daño casi letal como una muerte de héroe, lo que resultaba en otorgar demasiado tiempo adicional.",
      "[*] Se corrigieron los efectos de partículas de Cuchilla Dentada que se reproducían al iniciar el ataque en vez de al impactar.",
      "[*] Se corrigió el sonido que no se reproducía al lanzar Libro de los Muertos.",
      "[*] Se corrigió Furia Sangrienta de Bloodseeker que traspasaba la Esfera de Linken al lanzarse en enemigos.",
      "[*] Se corrigió que el silencio de Furia Sangrienta de Bloodseeker ignorara la inmunidad de los enemigos a efectos negativos.",
      "[*] Se corrigió \"Seleccionar héroe\" durante Proyección de Nothl de Dazzle que seleccionaba a Dazzle en vez de a la proyección.",
      "[*] Se corrigió que Transferencia en Repulsión Electromagnética de Disruptor no se viera afectada por la reducción de tiempo de recarga al lanzarse manualmente.",
      "[*] Se corrigió el Espíritu de Elder Titan que no regresaba automáticamente al usar Pisotón Resonante cuando Elder Titan tenía el Fragmento de Aghanim.",
      "[*] Se corrigieron las habilidades definitivas de Hoodwink y Ogre Magi que no subían de nivel mediante las teclas rápidas.",
      "[*] Se corrigió el Muro de Hielo Vectorizado que no se lanzaba directamente perpendicular a Invoker cuando la distancia del punto final del vector estaba por debajo de un cierto umbral.",
      "[*] Se corrigieron las unidades vinculadas a Io que aparecían en Niebla de Guerra si contaban con un aspecto con partículas ambientales equipadas.",
      "[*] Se corrigió Aleteo (katana) de Kez que infligía menos daño de lo previsto.",
      "[*] Se corrigió Aleteo (katana) de Kez que se consumía sin ningún efecto en algunos casos.",
      "[*] Se corrigió Velo del Cuervo de Kez que entraba en tiempo de recarga si Danza del Raptor se interrumpía.",
      "[*] Se corrigió la ralentización de Garra Arrojadiza de Kez que se eliminaba al lanzar un ataque.",
      "[*] Se corrigió Garra Arrojadiza de Kez que no ralentizaba lo suficiente.",
      "[*] Se corrigió Velo del Cuervo de Kez que entraba en tiempo de recarga si Danza del Raptor se interrumpía.",
      "[*] Se corrigió Aleteo de Kez que era consumido por el ataque falso de Lanzamiento de Garra, Embate del Halcón y Empalamiento por Katana.",
      "[*] Se corrigió Espíritu Oso de Lone Druid que no podía hacer compras en la Tienda Secreta desde la compra rápida.",
      "[*] Se corrigió la reserva que no se mostraba al seleccionar a Espíritu Oso de Lone Druid.",
      "[*] Se corrigió Polaridad Inversa de Magnus que no reproducía las animaciones de aturdimiento en enemigos.",
      "[*] Se corrigió la subhabilidad Cambio de Guardia de Monkey King que se podía robar.",
      "[*] Se corrigieron los problemas de aspecto de Demonio Embaucador de Monkey King al lanzar Cambio de Guardia.",
      "[*] Se corrigió Mano Rápida de Muerta que algunas veces causaba que Pistolera tuviera una probabilidad de activación más frecuente de lo previsto.",
      "[*] Se corrigió que Muerta reprodujera la línea de voz incorrecta al lanzar Disparo Mortal mejorado por el Cetro de Aghanim.",
      "[*] Se corrigió Velo Fantasmal de Necrophos que no aumentaba la curación entrante.",
      "[*] Ahora es posible hacer una indicación con \"Alt\" sobre los temporizadores de runas en el mapa con Pronosticar de Oracle.",
      "[*] Se corrigieron los ataques de Aguijón con Cetro de Aghanim de Sand King cuyo radio era menor al previsto.",
      "[*] Se corrigió Réquiem de Almas de Shadow Fiend que no atemorizaba a los enemigos si Shadow Fiend moría justo después de que el lanzamiento se completara.",
      "[*] Se corrigió Muerte Radial de Timbersaw que curaba más de lo previsto a los héroes con atributos universales y de fuerza.",
      "[*] Se corrigió Santuario de Void Spirit que no aumentaba la cantidad de barrera.",
      "[*] Selección de habilidades: se corrigió la activación/desactivación del lanzamiento automático de Lluvia de Espinas en la selección de habilidades que no alternaba con Bola de Pelo hasta obtener el Fragmento de Aghanim.",
      "[*] Selección de habilidades: la faceta Curva de Aprendizaje de Ogre Magi ahora funciona con todas las habilidades (siempre que Ogre Magi esté seleccionado).",
      "[*] Selección de habilidades: se corrigieron muchos casos de talentos faltantes o agregados incorrectamente.",
      "[*] Se corrigió el Tesoro de la Horda de Héroes de Primavera de 2025 que al principio incluía algunos ajustes incorrectos para intercambios y regalos.",
      "[*] Se hizo menos probable que el sugeridor de objetos de Dota Plus se quedara sin objetos para recomendar hacia el final de la partida.",
      "[*] Se corrigió la compra rápida de los objetos recomendados por Dota Plus para no comprar objetos repetidos si se hacía clic muy rápido.",
      "[/list]"
    ],
    "commentcount": 87,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 791,
    "votedowncount": 63,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748617282,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 789,
  "votes_down": 62,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}