{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "แพตช์เกมเพลย์ 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "แพตช์เกมเพลย์ 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "แพตช์ 7.39b ออกเผยแพร่แล้ว และคุณสามารถอ่านรายละเอียดแพตช์ได้[url=https://www.dota2.com/patches/7.39b]ที่นี่[/url]",
      "นอกจากนี้ ในช่วงสองสามวันที่ผ่านมาเราได้แก้ไขปัญหาต่าง ๆ ดังต่อไปนี้:",
      "[list]",
      "[*] แก้ไขปัญหาการแครชหลายประการของไคลเอนต์และเซิร์ฟเวอร์",
      "[*] แก้ไขปัญหาการแครชหลายประการที่เกี่ยวข้องกับเมนูการตั้งค่าใหม่",
      "[*] แก้ไขปัญหาการย้ายไอเท็มทั้งหมดในช่องซื้อเร่งด่วน",
      "[*] แก้ไขปัญหาดรอปดาวน์การร่ายทันทีไม่แสดงเมื่ออยู่ในเมนูกำหนดปุ่มร่ายโดยตรงและเลือกการร่ายทันที",
      "[*] แก้ไขปัญหาที่ยูนิตอื่นนอกเหนือจากฮีโร่, Spirit Bear หรือ Courier สามารถซื้อไอเท็มในช่องซื้อเร่งด่วนได้",
      "[*] แก้ไขปัญหาที่ Courier สามารถหยิบไอเท็มจากคลังได้เมื่ออยู่ที่ร้านค้าลับ",
      "[*] แก้ไขปัญหาปุ่มที่ผูกไว้กับปุ่มปรับเปลี่ยน Alt ทำให้เกิดการกระทำอื่นที่ไม่ตั้งใจ",
      "[*] แก้ไขการตั้งค่าคุณภาพเครือข่ายที่ไม่ถูกนำไปใช้งาน",
      "[*] เพิ่มการตั้งค่าที่หายไป เช่น การเปิดใช้งานหน้าต่างตรวจดูยูนิต การเปิดใช้งานคำสั่งที่เข้าคิวบน HUD และการเปิดใช้งานวิดีโอสกิลในคำอธิบาย",
      "[*] เพิ่มการตั้งค่าใหม่เพื่อปิดใช้งานปุ่มลัดของแต่ละยูนิต ขณะอยู่ในเกมแบบกำหนดเอง",
      "[*] แก้ไขการไม่สามารถตั้งค่าปุ่ม Town Portal Scroll และไอเท็มครีปป่าด้วยกำหนดปุ่มร่ายโดยตรงได้",
      "[*] แก้ไขปัญหาที่สกิล \"ส่งไอเท็ม\" ของ Courier จะหยิบไอเท็มจากคลังหาก Courier อยู่ในระยะร้านค้า",
      "[*] แก้ไข Courier ไม่ทำตามคำสั่งที่อยู่ในคิวหลังจากการส่งไอเท็ม",
      "[*] แก้ไขปัญหาการแครชของไคลเอนต์เกมเมื่อลากไอเท็มจากช่องเก็บของไปยังคู่มือไอเท็มปัจจุบันเมื่ออยู่ในโหมดแก้ไข",
      "[*] แก้ไขแถบเลื่อนปรับความสว่างแบบเต็มหน้าจอที่ทำงานตรงกันข้าม",
      "[*] แก้ไขปุ่มการปรับเทียบ MMR ใหม่ที่ไม่ทำงาน",
      "[*] แก้ไขปัญหาที่บางครั้งฮีโร่อาจติดอยู่ในสถานะกำลังจะตายอย่างถาวร หากการตายเกิดขึ้นขณะได้รับผลจากดีบัฟ Envenomed Weapon ของ Vhoul Assassin และแหล่งที่มาอื่น ๆ ของการลดอัตราเติมคืนพลังชีวิต",
      "[*] แก้ไขการตั้งค่ากำหนดปุ่มที่บล็อกอินพุตหากหน้าต่างการตั้งค่าถูกปิดขณะกำลังกำหนดปุ่ม",
      "[*] แก้ไขปัญหาที่ Courier ไม่หยิบไอเท็มจากคลังเมื่อสั่งให้ \"ส่งไอเท็ม\" ขณะออกจากบ่อน้ำพุ",
      "[*] เปลี่ยนชื่อ \"สิ่งก่อสร้างต้องหยุดด้วยปุ่มยกเลิก/ประจำตำแหน่ง\" เป็น \"การยึดครองสิ่งก่อสร้างต้องใช้ปุ่มยกเลิก/ประจำตำแหน่งเพื่อหยุด\"",
      "[*] \"การยึดครองสิ่งก่อสร้างต้องใช้ปุ่มยกเลิก/ประจำตำแหน่งเพื่อหยุด\" ต่อจากนี้จะมีผลต่อการยึดครอง Watcher และ Outpost เท่านั้น พฤติกรรมการยกเลิกการยืนร่ายสำหรับ Twin Gate และ Fiend's Gate ของ Underlord ถูกเปลี่ยนกลับไปเป็น \"เทเลพอร์ตต้องหยุดด้วยปุ่มยกเลิก/ประจำตำแหน่ง\"",
      "[*] ต่อจากนี้ Courier จะดำเนินการคำสั่งล่าสุดต่อไปเมื่อเปลี่ยนเป็นโหมด \"ส่งไอเท็มอัตโนมัติ\"",
      "[*] HUD ของ Courier ต่อจากนี้มีสถานะที่แตกต่างกันสำหรับการรอที่ร้านค้าลับ และสำหรับการเคลื่อนที่ทั่วไป (เมื่อเปรียบเทียบกับการไปยังร้านค้าหรือส่งไอเท็มให้ฮีโร่) แก้ไขที่เครื่องหมาย ?  ปรากฏขึ้นเมื่อ Courier กำลังเคลื่อนที่โดยไม่ได้มีจุดหมายเป็นฮีโร่",
      "[*] แก้ไขการแครชของเกมแบบกำหนดเอง หากมีทีมใดทีมหนึ่งมีผู้เล่นมากกว่า 7 คน",
      "[*] แก้ไขปัญหาที่สถานะการเปิด/ปิด \"แสดงไอเท็มทีม\" ไม่คงอยู่ในร้านค้า",
      "[*] แก้ไขปัญหาที่ไม่สามารถกำหนดปุ่มสกิลดังต่อไปนี้",
      "[list]",
      "[*] Work Horse ของ Centaur Warrunner",
      "[*] Electromagnetic Repulsion ของ Disruptor",
      "[*] Solar Guardian ของ Dawnbreaker",
      "[*] Twisted Chakram ของ Timbersaw",
      "[*] Move Astral Spirit ของ Elder Titan",
      "[*] สกิล Spirits In และ Spirits Out ของ Io",
      "[*] Roll Up ของ Pangolier",
      "[*] Keen Conveyance ของ Tinker",
      "[*] Solar Bind และ Recall ของ Keeper of the Light",
      "[/list]",
      "[*] แก้ไขที่เสียงคำรามของ Roshan ไม่แสดงเอฟเฟกต์และแอนิเมชัน",
      "[*] แก้ไขที่ Helm of the Undying เพิ่มระยะเวลาหลายครั้งหากมีการโจมตีโดนเป้าหมายที่ตายไปแล้วเพิ่มเติมอีก",
      "[*] แก้ไขที่ Helm of the Undying นับความเสียหายที่เกือบถึงตายว่าเป็นการฆ่าฮีโร่ ส่งผลทำให้มอบระยะเวลาเพิ่มเติมมากเกินไป",
      "[*] แก้ไขเอฟเฟกต์อนุภาคของ Serrated Shiv ให้แสดงผลเมื่อโจมตีโดนเป้าหมาย แทนที่จะแสดงเมื่อเริ่มโจมตี",
      "[*] แก้ไขที่ Book of the Dead ไม่เล่นเสียงเมื่อร่าย",
      "[*] แก้ไขที่ Bloodrage ของ Bloodseeker ทะลุ Linken's Sphere เมื่อร่ายใส่ศัตรู",
      "[*] แก้ไขที่การใบ้ด้วย Bloodrage ของ Bloodseeker ทะลุการป้องกันดีบัฟของศัตรู",
      "[*] แก้ไขที่การ \"เลือกฮีโร่\" ระหว่างใช้สกิล Nothl Projection ของ Dazzle กลายเป็นการเลือก Dazzle แทนที่จะเป็นร่าง Nothl Projection",
      "[*] แก้ไขที่ Electromagnetic Repulsion ของ Disruptor ในมิติ Transferrence ไม่ได้รับผลจากการลดคูลดาวน์เมื่อร่ายเอง",
      "[*] แก้ไขที่วิญญาณของ Elder Titan ไม่กลับมาโดยอัตโนมัติ หากใช้ Echo Stomp เมื่อ Elder Titan มี Aghanim's Shard",
      "[*] แก้ไขที่ไม่สามารถเพิ่มเลเวลสกิลอัลติเมทของ Hoodwink และ Ogre Magi ผ่านปุ่มลัดได้",
      "[*] แก้ไขที่ Ice Wall แบบกำหนดทิศทางของ Invoker ไม่สร้างกำแพงตั้งฉากกับ Invoker โดยตรง เมื่อระยะของจุดสิ้นสุดเวกเตอร์ต่ำกว่าค่าที่กำหนด",
      "[*] แก้ไขยูนิตที่เชื่อมโยงกับ Io ปรากฏในหมอกมืดหากยูนิตนั้นมีไอเท็มตกแต่งที่มีเอฟเฟกต์อนุภาคแสง",
      "[*] แก้ไขที่ Flutter (คาตานะ) ของ Kez สร้างความเสียหายน้อยกว่าที่ควรจะเป็น",
      "[*] แก้ไขที่ความเสียหายของ Flutter (คาตานะ) ของ Kez ถูกใช้ไปโดยไม่มีผลในบางสถานการณ์",
      "[*] แก้ไขที่ Raven's Veil ของ Kez ติดคูลดาวน์หาก Raptor Dance ถูกขัดจังหวะ",
      "[*] แก้ไขที่การทำให้ช้าลงโดย Grappling Claw ของ Kez ยังคงถูกลบออกเมื่อโจมตีโดนเป้าหมาย",
      "[*] แก้ไขที่ Grappling Claw ของ Kez ไม่ทำให้ช้าลงได้นานเพียงพอ",
      "[*] แก้ไขที่ Raven's Veil ของ Kez ติดคูลดาวน์หาก Raptor Dance ถูกขัดจังหวะ",
      "[*] แก้ไขที่ Flutter ของ Kez ถูกใช้ไปกับเอฟเฟกต์การโจมตีจาก Talon Toss, Falcon Rush และการแทงด้วย Kazurai Katana",
      "[*] แก้ไขที่ Spirit Bear ของ Lone Druid ไม่สามารถซื้อไอเท็มร้านค้าลับจากช่องซื้อเร่งด่วนได้",
      "[*] แก้ไขที่คลังไม่แสดงเมื่อเลือก Spirit Bear ของ Lone Druid",
      "[*] แก้ไขที่ Reverse Polarity ของ Magnus ไม่แสดงแอนิเมชันการสตันศัตรู",
      "[*] แก้ไขที่ Changing of the Guard ซึ่งเป็นสกิลย่อยของ Monkey King สามารถถูกขโมยได้",
      "[*] แก้ไขปัญหาเครื่องแต่งกาย Cult of the Demon Trickster ของ Monkey King เมื่อร่าย Changing of the Guard",
      "[*] แก้ไขที่ Quick Draw ของ Muerta บางครั้งทำให้ Gunslinger ทำงานบ่อยกว่าที่ควรจะเป็น",
      "[*] แก้ไขที่ Muerta เล่นเสียงพูดที่ไม่ถูกต้องเมื่อโจมตีด้วย Deadshot ที่ได้รับการอัปเกรดโดย Aghanim's Scepter",
      "[*] แก้ไขที่ Ghost Shroud ของ Necrophos ไม่เพิ่มการรักษาพลังชีวิตที่ได้รับ",
      "[*] Prognosticate ของ Oracle ต่อจากนี้สามารถกดปุ่ม Alt ค้างไว้และคลิกซ้ายที่ตัวบอกเวลารูนในแผนที่ได้แล้ว",
      "[*] แก้ไขที่ Stinger อัปเกรดโดย Aghanim's Scepter ของ Sand King มีรัศมีการโจมตีต่ำกว่าที่ควรจะเป็น",
      "[*] แก้ไขที่ Requiem of Souls ของ Shadow Fiend ไม่ทำให้ศัตรูติดสถานะหวาดกลัว หาก Shadow Fiend ตายทันทีหลังจากการร่ายเสร็จสิ้น",
      "[*] แก้ไขที่ Whirling Death ของ Timbersaw ฟื้นฟูพลังชีวิตของฮีโร่ Strength และ Universal มากกว่าที่ควรจะเป็น",
      "[*] แก้ไขที่ Sanctuary ของ Void Spirit ไม่เพิ่มจำนวนบาเรีย",
      "[*] Ability Draft: แก้ไขการเปิด/ปิดการร่ายอัตโนมัติ Quill Spray ใน Ability Draft จะไม่เปลี่ยนเป็น Hairball จนกว่าคุณจะมี Aghanim's Shard",
      "[*] Ability Draft: แก้ไขมิติ Learning Curve ของ Ogre Magi ให้ทำงานกับทุกสกิล (จำเป็นต้องเลือกฮีโร่ Ogre Magi)",
      "[*] Ability Draft: แก้ไขหลายกรณีที่ทักษะพิเศษหายไปหรือถูกเพิ่มเข้ามาอย่างไม่ถูกต้อง",
      "[*] แก้ไขที่ Heroes' Hoard ฤดูใบไม้ผลิ 2025 มีการตั้งค่าการแลกเปลี่ยนและการให้ของขวัญเริ่มต้นไม่ถูกต้อง",
      "[*] ทำให้มีโอกาสน้อยลงที่ระบบแนะนำไอเท็มของ Dota Plus จะหมดไอเท็มแนะนำในช่วงท้ายเกม",
      "[*] แก้ไขการซื้อเร่งด่วนไอเท็มที่ Dota Plus แนะนำไม่ให้ซื้อไอเท็มหลายชิ้นเมื่อคลิกอย่างรวดเร็ว",
      "[/list]"
    ],
    "commentcount": 90,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 830,
    "votedowncount": 66,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748620417,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 828,
  "votes_down": 66,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}