{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "7.39b Oynanış Güncellemesi",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "7.39b Oynanış Güncellemesi",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "7.39b güncellemesi çıktı. Güncelleme notlarını [url=https://www.dota2.com/patches/7.39b]buradan[/url] inceleyebilirsiniz.",
      "Ek olarak, son birkaç gün içinde aşağıdaki sorunları çözdük:",
      "[list]",
      "[*] Çeşitli istemci ve sunucu çökmeleri düzeltildi.",
      "[*] Yeni Ayarlar menüsüyle ilişkili çeşitli çökmeler düzeltildi.",
      "[*] Hızlı satın almada tüm eşyaların taşınmasıyla ilgili bir sorun düzeltildi.",
      "[*] Doğrudan Kullanma Atamaları'nda ve hızlı kullanma seçiminde hızlı kullan açılır menüsünün görünmemesi düzeltildi.",
      "[*] Kahraman, Spirit Bear veya kurye dışındaki birimlerin hızlı satın almada eşya satın alabilmesi sorunu düzeltildi.",
      "[*] Kuryenin gizli dükkândayken zuladan bir şeyler alabilmesine neden olan sorun düzeltildi.",
      "[*] Alt Tuşu Değiştiricisine atanan tuşların istenmeyen eylemleri tetiklemesi düzeltildi.",
      "[*] Ağ Kalitesi ayarının uygulanmaması düzeltildi.",
      "[*] Sorgu paneli, sıraya alınmış emirlerin arayüzde görünümü ve yetenek açıklamalarının örnek videoları gibi eksik ayarlar geri eklendi.",
      "[*] Özel oyunlarda birimlere özel kısayol tuşlarını devre dışı bırakma özelliği eklendi.",
      "[*] TP Scroll ve Tarafsız Eşyaları, Doğrudan Kullanma Atamaları seçeneğine atayamama sorunu düzeltildi.",
      "[*] Eşyaları Naklet kurye yeteneğinin, kurye dükkân menzilindeyse zuladan eşya almasına neden olan sorun düzeltildi.",
      "[*] Kuryenin eşyaları aktardıktan sonra kuyruktaki siparişlere uymaması düzeltildi.",
      "[*] Envanterinizdeki bir eşyayı, düzenleme modundaki eşya rehberinize sürüklediğinizde oyunun çökmesine neden olan sorun düzeltildi.",
      "[*] Tam ekran modunda parlaklık kaydırıcısının ters çalışması düzeltildi.",
      "[*] ED Kalibrasyonu butonunun çalışmaması düzeltildi.",
      "[*] Vhoul Assassin'in Envenomed Weapon zayıflatması ve diğer olumsuz sağlık yenileme etkileri altındayken ölen kahramanların bazen kalıcı olarak ölü duruma geçişte takılıp kalabildiği bir sorun düzeltildi.",
      "[*] Tuş atama sırasında Ayarlar kapatılmışsa, tuş atama ayarlarının girdileri engellemesi düzeltildi.",
      "[*] Kuryenin kaynaktan ayrılırken eşyaları teslim etmesi emredildiğinde zuladaki eşyaları almaması düzeltildi.",
      "[*] \"Binalara Yönlendirmeyi Durdurmayla/İptal Etmeyle Yarıda Kes\" ayarı \"Binaları Ele Geçirmeyi Durdurmayla/İptal Etmeyle Yarıda Kes\" olarak değiştirildi.",
      "[*] \"Binaları Ele Geçirmeyi Durdurmayla/İptal Etmeyle Yarıda Kes\" ayarı artık yalnızca gözetleyicileri ve ileri karakolları ele geçirmeyi etkileyecek. İkiz Geçit ve Underlord'un Fiend's Gate'in yönlendirme iptali davranışı \"Işınlanmayı Durdurmayla/İptal Etmeyle Yarıda Kes\" ayarına geri taşındı.",
      "[*] Kurye otomatik teslim moduna geçtiğinde mevcut son siparişini yerine getirmeye devam edecek.",
      "[*] Kurye gösterge paneli artık Gizli Dükkân'da bekleme ve genel hareket etme (dükkâna gitme veya kahramana teslimat yapma gibi) için farklı durumlara sahip. Kurye bir kahraman hedefi olmadan hareket ettiğinde bir soru işaretinin görünmesi düzeltildi.",
      "[*] Bir takımda 7'den fazla oyuncu olduğunda özel oyunların çökmesi sorunu düzeltildi.",
      "[*] Dükkândaki takım eşyalarının görüntülenmesi ayarının kalıcı olarak uygulanmaması düzeltildi.",
      "[*] Aşağıdaki yeteneklere tuş atanamaması sorunu düzeltildi:",
      "[list]",
      "[*] Centaur Warrunner - Work Horse",
      "[*] Disruptor - Electromagnetic Repulsion",
      "[*] Dawnbreaker - Solar Guardian",
      "[*] Timbersaw - Twisted Chakram",
      "[*] Elder Titan - Move Astral Spirit",
      "[*] Io - Spirits In ve Spirits Out",
      "[*] Pangolier - Roll Up",
      "[*] Tinker - Keen Conveyance",
      "[*] Keeper of the Light - Solar Bind ve Recall",
      "[/list]",
      "[*] Roshan'ın kükremesinin efekt ve animasyonun oynatılmaması düzeltildi.",
      "[*] Ölmüş bir hedefe daha fazla saldırı isabet etmesi durumunda Helm of the Undying süre bonusunun birden fazla kez uygulanması düzeltildi.",
      "[*] Helm of the Undying'in ölümcül hasarla bir kahraman leşi gibi sayılması ve bu yüzden çok fazla ek süre vermesi düzeltildi.",
      "[*] Serrated Shiv'in vuruş sırasındaki parçacık efektinin saldırı isabet ettiğinde değil, başladığında oynatılması düzeltildi.",
      "[*] Book of the Dead kullanım sesinin çalmaması düzeltildi.",
      "[*] Bloodseeker'ın Bloodrage yeteneğinin düşmanlara uygulandığında Linken's Sphere'i yok sayması düzeltildi.",
      "[*] Bloodseeker'ın Bloodrage yeteneğinin düşmanların zayıflatma bağışıklığını delmesi düzeltildi.",
      "[*] Nothl Projection sırasında \"Kahraman Seç\" seçeneğinin Dazzle'ın ruhu yerine bedenini seçmesi düzeltildi.",
      "[*] Disruptor'ın Transferrence yükselticisiyle Electromagnetic Repulsion yeteneğinin manuel olarak kullanıldığında dolum süresi azaltımından etkilenmemesi düzeltildi.",
      "[*] Aghanim's Shard sahibiyken Echo Stomp kullandığında Elder Titan'ın ruhunun otomatik olarak geri dönmemesi düzeltildi.",
      "[*] Hoodwink ve Ogre Magi'nin son yeteneklerinin kısayol tuşuyla seviye atlamaması düzeltildi.",
      "[*] Invoker'ın Vektör Hedefli Ice Wall yeteneğinde, vektörün uç nokta mesafesi belirli bir eşiğin altındayken, buz kütlesinin Invoker'a göre doğrudan dik olarak oluşmaması düzeltildi.",
      "[*] Io'ya bağlı birimlerin, çevresel parçacık efektleri içeren bir kozmetikleri varsa, savaş sisinde görünmesi düzeltildi.",
      "[*] Kez'in Flutter yükselticisine sahip katanasının amaçlanandan daha az hasar vermesi düzeltildi.",
      "[*] Kez'in Flutter yükselticisine sahip katanasının bazı durumlarda tüketildiğinde etki yaratmaması düzeltildi.",
      "[*] Raptor Dance kesintiye uğradığında Kez'in Raven's Veil yeteneğinin dolum süresine girmesi düzeltildi.",
      "[*] Kez'in Grappling Claw yavaşlatmasının saldırı gerçekleştiği hâlde kaldırılması düzeltildi.",
      "[*] Kez'in Grappling Claw yeteneğinin yeterince uzun süre yavaşlatmaması düzeltildi.",
      "[*] Raptor Dance kesintiye uğradığında Kez'in Raven's Veil yeteneğinin dolum süresine girmesi düzeltildi.",
      "[*] Kez'in Flutter yükselticisinin Talon Toss, Falcon Rush ve Katana Impale'in sahte saldırısı tarafından tüketilmesi düzeltildi.",
      "[*] Lone Druid'in Spirit Bear'inin hızlı satın alma için Gizli Dükkân'dan eşya alamaması düzeltildi.",
      "[*] Lone Druid'in Spirit Bear'i seçiliyken zulanın görünmemesi düzeltildi.",
      "[*] Magnus'un Reverse Polarity yeteneğinin düşmanların üzerinde sersemletme animasyonlarını uygulamaması düzeltildi.",
      "[*] Monkey King'in Changing of the Guard alt yeteneğinin çalınabilmesi sorunu düzeltildi.",
      "[*] Monkey King Changing of the Guard'ı kullandığında oluşan Demon Trickster kozmetik sorunları düzeltildi.",
      "[*] Muerta'nın Quick Draw yükselticisinin bazen Gunslinger'ın istenenden daha sık tetiklenmesine neden olması düzeltildi.",
      "[*] Muerta, Aghanim's Scepter ile güçlendirilmiş Deadshot ile vurduğunda yanlış repliğin duyulması düzeltildi.",
      "[*] Necrophos'un Ghost Shroud yeteneğinin alınan iyileştirmeyi artırmaması düzeltildi.",
      "[*] Oracle'ın haritadaki Prognosticate rün zamanlayıcıları artık Alt ile pinglenebilecek.",
      "[*] Sand King Aghanim's Scepter'lı Stinger saldırılarının yarıçapının istenenden daha az olması düzeltildi.",
      "[*] Shadow Fiend'in Requiem of Souls yeteneğinin, Shadow Fiend'in yeteneği kullandıktan hemen sonra ölmesi durumunda düşmanları korkutmaması düzeltildi.",
      "[*] Timbersaw'un Whirling Death yeteneğinin Kuvvet ve Evrensel kahramanları beklenenden fazla iyileştirmesi düzeltildi.",
      "[*] Void Spirit'in Sanctuary yükselticisinin bariyer miktarını artırmaması düzeltildi.",
      "[*] Yetenek Çekilişi: Yetenek Çekilişi'nde Quill Spray'in otomatik kullanımı açıldığında, Aghanim's Shard olmadan Hairball'a geçilebilmesi düzeltildi.",
      "[*] Yetenek Çekilişi: Ogre Magi'nin Learning Curve yükselticisi artık tüm yeteneklerle çalışıyor (Ogre Magi, kahraman olarak seçilmelidir).",
      "[*] Yetenek Çekilişi: Birçok eksik yetenek eklendi ve hatalı yetenekler kaldırıldı.",
      "[*] 2025 İlkbahar Kahraman Ganimeti'nin yanlış takas ve hediye ayarlarına sahip olması düzeltildi.",
      "[*] Dota Plus eşya önerme sisteminin, oyunun ilerleyen safhalarında eşya önermeyi bırakmasına neden olan sorun düzeltildi.",
      "[*] Dota Plus'ta hızlı satın alma için önerilen eşyaların, hızlıca tıklandığında birden fazla sayıda satın alınamaması düzeltildi.",
      "[/list]"
    ],
    "commentcount": 101,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 1047,
    "votedowncount": 88,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748641328,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 1046,
  "votes_down": 88,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}