{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Pelipäivitys 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Pelipäivitys 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "Katso päivitystiedot [url=https://www.dota2.com/patches/7.39b]täältä[/url].",
      "Tuore päivitys korjaa lisäksi useita pelaamiseen vaikuttaneita ongelmia.",
      "[list]",
      "[*] Korjattiin lukuisia ohjelma- ja palvelinkaatumisia.",
      "[*] Korjattiin uuteen asetusvalikkoon liittyneitä kaatumisia.",
      "[*] Korjattiin kokonaisen esineen pikaostokseksi lisäämiseen liittynyt ongelma.",
      "[*] Korjattiin virhe, jonka vuoksi pikakäytön toimintovalikko ei näkynyt yksityiskohtaisia näppäinmäärityksiä käytettäessä.",
      "[*] Korjattiin virhe, jonka vuoksi muut kuin sankari, Spirit Bear tai kuriiri pystyivät tekemään pikaostoksia.",
      "[*] Korjattiin virhe, jonka vuoksi kuriiri poimi esineitä säilöstä salakaupassa ollessaan.",
      "[*] Korjattiin virhe, jonka vuoksi Alt-muuttujaksi määritetyt näppäimet saattoivat vahingossa tehdä muita toimintoja.",
      "[*] Korjattiin virhe, jonka vuoksi verkon laatuasetusta ei voinut muuttaa.",
      "[*] Palautettiin puuttuvia asetuksia, kuten hahmon tietopaneeli, käskyjononäkymä ja kykykuvausten esimerkkivideot.",
      "[*] Lisättiin uusi asetus, jolla hahmokohtaiset pikanäppäimet voi ottaa pois päältä yhteisöpeleissä.",
      "[*] Korjattiin virhe, joka esti Town Portal Scrollin ja neutraaliesineen pikanäppäinten määrityksen yksityiskohtaisissa näppäinmäärityksissä.",
      "[*] Korjattiin virhe, jonka vuoksi esineitä toimittava kuriiri poimi säilön esineet, jos se oli lähellä kauppaa.",
      "[*] Korjattiin virhe, jonka vuoksi kuriiri ei noudattanut käskyjonoaan esineiden toimittamisen jälkeen.",
      "[*] Korjattiin kaatuminen, joka tapahtui, kun tavaraluettelossa oleva esine raahattiin muokkaustilassa olevaan esineoppaaseen.",
      "[*] Korjattiin virhe, jonka vuoksi koko ruudun kirkkaussäädin toimi käänteisesti.",
      "[*] Korjattiin virhe, jonka vuoksi rankingin uudelleenkalibrointipainike ei toiminut.",
      "[*] Korjattiin virhe, jonka vuoksi sankarit saattoivat jäädä pysyvästi kuolemaa edeltävään tilaan, jos kuolema koitti Vhoul Assassinin Envenomed Weapon -heikennyksen ja muun palautumisvahvistusvähennyksen vaikutuksen alaisena.",
      "[*] Korjattiin virhe, jonka vuoksi aktiivinen pikanäppäimen määritysikkuna esti pikanäppäinten käytön, vaikka asetusvalikko olisi pienennetty.",
      "[*] Korjattiin virhe, jonka vuoksi toimituskomennon saanut kuriiri ei poiminut säilössä olevia esineitä lähteeltä poistuessaan.",
      "[*] Nimettiin Rakennusten käyttö päättyy vain keskeytysnäppäimellä -asetus uudelleen Rakennusten valtaaminen päättyy vain keskeytysnäppäimellä -asetukseksi.",
      "[*] Rakennusten valtaaminen päättyy vain keskeytysnäppäimellä -asetus vaikuttaa nyt vain Tarkkailijoihin ja vartiopisteisiin. Kaksoisporttien ja Underlordin Fiend Gaten kanavointien keskeytys ovat taas osana Teleporttaus päättyy vain keskeytysnäppäimellä -asetusta.",
      "[*] Kuriiri jatkaa nyt viimeisintä komentoaan automaattisen toimituksen aktivoimisen jälkeen.",
      "[*] Kuriiripaneeli sisältää nyt kuvakkeet salakaupassa odottamiselle ja kohdesijaintiin liikkumiselle (joka kattaa muut kuin kauppaan siirtymiset ja sankarille toimittamiset). Korjattiin virhe, jonka vuoksi kuriiripaneeli näytti kysymysmerkin, kun se liikkui sankarittomaan määränpäähän. ",
      "[*] Korjattiin yli seitsemän pelaajan joukkueiden aiheuttama yhteisöpelien kaatuminen.",
      "[*] Korjattiin virhe, jonka vuoksi tiimiesineiden näyttämisen valinta ei säilynyt pelien välillä.",
      "[*] Korjattiin virhe, jonka vuoksi seuraavien kykyjen pikanäppäimiä ei voitu määrittää:",
      "[list]",
      "[*] Centaur Warrunnerin Work Horse",
      "[*] Disruptorin Electromagnetic Repulsion",
      "[*] Dawnbreakerin Solar Guardian",
      "[*] Timbersawin Twisted Chakram",
      "[*] Elder Titanin Astral Spirit -liikutus",
      "[*] Ion Spiritsin työntö- ja vetokyvyt",
      "[*] Pangolierin Roll Up",
      "[*] Tinkerin Keen Conveyance",
      "[*] Keeper of the Lightin Solar Bind/Recall.",
      "[/list]",
      "[*] Korjattiin virhe, jonka vuoksi Roshanin karjaisun animaatio ja tehosteet eivät toimineet.",
      "[*] Korjattiin virhe, jonka vuoksi Helm of the Undyingin kestolisä tapahtui useaan otteeseen, jos hyökkäysammukset osuivat jo kuolleeseen viholliseen.",
      "[*] Korjattiin virhe, jonka vuoksi Helm of the Undying laski lähes tappavan vahingon sankaritapoksi, jonka vuoksi se antoi liian paljon lisäaikaa.",
      "[*] Korjattiin virhe, jonka vuoksi Serrated Shivin osumatehosteet näkyivät hyökkäyksen alkaessa osumisen sijaan.",
      "[*] Korjattiin virhe, jonka vuoksi äänitehoste ei toistunut Book of the Deadiä käytettäessä.",
      "[*] Korjattiin virhe, jonka vuoksi Bloodseekerin Bloodrage ohitti vihollisen Linken's Spheren.",
      "[*] Korjattiin virhe, jonka vuoksi Bloodseekerin Bloodragen hiljennys läpäisi vihollisten heikennysimmuniteetin.",
      "[*] Korjattiin virhe, jonka vuoksi Valitse sankari -komento valitsi Nothl Projectionin aikana Dazzlen kehon sielunsa sijaan.",
      "[*] Korjattiin virhe, jonka vuoksi latausaikojen lyhennys ei vaikuttanut Disruptorin Electromagnetic Repulsionin Transference-kulmakiven aktiivisen vaikutuksen latausaikaan.",
      "[*] Korjattiin virhe, jonka vuoksi Elder Titanin henki ei palannut automaattisesti Echo Stompin jälkeen Aghanim's Shard -päivityksen kanssa.",
      "[*] Korjattiin virhe, jonka vuoksi Hoodwinkin ja Ogre Magin ultimate-kykyjä ei voinut päivittää pikanäppäimellä.",
      "[*] Korjattiin virhe, jonka vuoksi Invokerin vektorikohdistettu Ice Wall ei kohdistunut kohtisuoraan Invokeriin, kun vektorin päätepiste oli liian lyhyen matkan päässä.",
      "[*] Korjattiin virhe, jonka vuoksi Ion Tetherissä kiinni olevat hahmot näkyivät sotasumun lävitse, jos heillä oli tunnelmatehosteita sisältäviä kosmeettisia esineitä.",
      "[*] Korjattiin virhe, jonka vuoksi Kezin Flutter-kulmakiven Katana-vaikutus teki tarkoitettua vähemmän vahinkoa.",
      "[*] Korjattiin virhe, jonka vuoksi Kezin Flutter-kulmakiven Katana-vaikutus ei tehnyt mitään tietyissä tilanteissa.",
      "[*] Korjattiin virhe, jonka vuoksi Kezin Raven's Veil meni jäähylle, jos Raptor Dancen käyttö keskeytettiin.",
      "[*] Korjattiin virhe, jonka vuoksi Kezin Grappling Claw'n hidastus poistui hyökkäyksen osuman jälkeen.",
      "[*] Korjattiin virhe, jonka vuoksi Kezin Grappling Claw'n hidastus ei kestänyt tarpeeksi kauan.",
      "[*] Korjattiin virhe, jonka vuoksi Kezin Raven's Veil meni jäähylle, jos Raptor Dancen käyttö keskeytettiin.",
      "[*] Korjattiin virhe, jonka vuoksi Kezin Flutter-kulmakiven vaikutus katosi Talon Tossista, Falcon Rushista ja Katanan piston valehyökkäyksestä.",
      "[*] Korjattiin virhe, jonka vuoksi Lone Druidin Spirit Bear ei pystynyt ostamaan salakaupan esineitä pikaostolla.",
      "[*] Korjattiin virhe, jonka vuoksi Lone Druidin säilö ei näkynyt Spirit Bearin ollessa valittuna.",
      "[*] Korjattiin virhe, jonka vuoksi Magnuksen Reverse Polarity ei näyttänyt vihollisten tainnutusanimaatiota.",
      "[*] Korjattiin virhe, jonka vuoksi Monkey Kingin Changing of the Guard -lisäkyvyn pystyi varastamaan.",
      "[*] Korjattiin Monkey Kingin Demonikujeilijan kultti -esinekokoelman aiheuttamat visuaaliset ongelmat Changing of the Guardia käytettäessä.",
      "[*] Korjattiin virhe, jonka vuoksi Muertan Quickdraw-kulmakivi saattoi antaa Gunslingerille liikaa lisämahdollisuutta.",
      "[*] Korjattiin virhe, jonka vuoksi Muerta sanoi väärän äänirepliikin osuessaan vihollisiin Aghanim's Scepterillä päivitetyllä Dead Shotilla.",
      "[*] Korjattiin virhe, jonka vuoksi Necrophosin Ghost Shroud ei nostanut saatavaa parantumista.",
      "[*] Oraclen Prognosticate-luontaiskyvyn pelikentällä näkyvät riimuajastimet ovat nyt alt-klikattavissa.",
      "[*] Korjattiin virhe, jonka vuoksi Sand Kingin Aghanim's Scepter -päivityksen Stinger-hyökkäysten vaikutusalueet olivat tarkoitettua pienempiä.",
      "[*] Korjattiin virhe, jonka vuoksi Shadow Fiendin Requiem of Souls ei pelottanut vihollisia, jos Shadow Fiend kuoli välittömästi käytön jälkeen.",
      "[*] Korjattiin virhe, jonka vuoksi Timbersaw'n Whirling Death palautti liikaa terveyttä voimaa menettäneille voima- ja yleissankareille.",
      "[*] Korjattiin virhe, jonka vuoksi Void Spiritin Sanctuary-kulmakivi ei nostanut suojan määrää.",
      "[*] Kykyvalinta: korjattiin virhe, jonka vuoksi Quill Sprayn erityiskäyttö antoi Hairballin ilman Aghanim's Shard -päivitystä.",
      "[*] Kykyvalinta: korjattiin Ogre Magin Learning Curve -kulmakivi toimimaan kaikkien kykyjen kanssa (vaatii Ogre Magin valituksi sankariksi).",
      "[*] Kykyvalinta: korjattiin lukuisia puuttuneita tai vääriä taitopäivityksiä.",
      "[*] Korjattiin virhe, jonka vuoksi Kevään 2025 sotasaalis -aarteella oli aluksi väärät vaihto- ja lahjarajoitukset.",
      "[*] Harvennettiin tilanteita, joissa Dota Plus -esinesuositukset saattoivat loppua kesken.",
      "[*] Korjattiin virhe, jonka vuoksi Dota Plus -esinesuosituksia pikaostamalla saatettiin ostaa useampi kappale kerralla.",
      "[/list]"
    ],
    "commentcount": 95,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 883,
    "votedowncount": 71,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748625008,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 879,
  "votes_down": 70,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}