{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Spilloppdatering 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Spilloppdatering 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "Oppdatering 7.39b er ute nå, og du kan se endringsloggen [url=https://www.dota2.com/patches/7.39b]her[/url].",
      "I tillegg har vi i løpet av de siste dagene ordnet opp i følgende problemer:",
      "[list]",
      "[*] Fikset en rekke forskjellige klient- og tjenerkrasj.",
      "[*] Fikset forskjellige krasj relatert til den nye innstillingsmenyen.",
      "[*] Fikset et problem med å flytte gjenstander bestående av flere komponenter til hurtigkjøp.",
      "[*] Fikset at nedtrekksmenyen for hurtigbruk ikke viste hvis man var inne i «Direktebruksbindinger» og i hurtigbruksvalget.",
      "[*] Fikset et problem med at andre enheter enn helten, åndebjørnen, eller kureren kunne kjøpe gjenstander i hurtigkjøp.",
      "[*] Fikset et problem med at kureren kunne hente gjenstander fra forrådet når den befant seg i den hemmelige butikken.",
      "[*] Fikset at taster som var bundet til Alt-endringstasten, utførte andre utilsiktede handlinger.",
      "[*] Fikset at innstillingen for «Nettverkskvalitet» ikke ble tatt i bruk.",
      "[*] La til igjen manglende innstillinger, som å slå på enhetsforespørsler i heltepanelet, køen med ordre i grensesnittet og evnevideoer i verktøytips.",
      "[*] La til en ny innstilling for å slå av hurtigtaster per enhet i tilpassede spill.",
      "[*] Fikset at man ikke kunne binde TP Scroll og nøytrale gjenstander med direktebruksbindinger.",
      "[*] Fikset et problem der «Overfør gjenstander» i kurerens evner hentet gjenstander fra forrådet hvis kureren var i nærheten av en butikk.",
      "[*] Fikset at kureren ikke overholdt ordrekøen etter overføring.",
      "[*] Fikset at spillklienten krasjet når en gjenstand fra oppakningen ble dratt inn i gjeldende gjenstandsveiledning når den var i redigeringsmodus.",
      "[*] Fikset at glidebryteren for lystyrke med fullskjerm var invertert.",
      "[*] Fikset at knappen for MMR-kalibrering ikke fungerte.",
      "[*] Fikset et problem med at helter noen ganger ble sittende fast permanent i en dødsovergangstilstand hvis døden inntraff under påvirkning av Vhoul Assassins svekkelse «Envenomed Weapon» og andre kilder til negativ helsebedring.",
      "[*] Fikset at tastebinding i innstillinger blokkerte inndata hvis innstillinger ble lukket mens man skulle binde en tast.",
      "[*] Fikset at kureren ikke hentet gjenstander fra forrådet når den fikk ordre om å overføre gjenstander mens den forlater fontenen.",
      "[*] Omdøpte «Bygninger krever hold/avbryt for å stoppe» til «Erobring av bygninger krever hold/avbryt for å stoppe».",
      "[*] «Erobring av bygninger krever hold/avbryt for å stoppe» påvirker nå kun erobring av våkelys og utposter. Atferden for å avbryte kanalisering på tvillingportene og Underlords Fiend's Gate er blitt flyttet tilbake til «Teleportering krever hold/avbryt for å avbryte».",
      "[*] Nå fortsetter kureren å utføre sin siste ordre når den bytter til automatisk leveringsmodus.",
      "[*] Kurerens grensesnittpanel har nå ulike tilstander for venting ved den hemmelige butikken og for generell bevegelse (i motsetning til å være på vei til en butikk eller levere til en helt). Fikset et ? som dukker opp når kureren beveger seg uten en heltedestinasjon.",
      "[*] Fikset at et tilpasset spill krasjet hvis et lag hadde flere enn 7 spillere.",
      "[*] Fikset at vekslingstilstanden for visning av laggjenstander ikke vedvarte i butikken.",
      "[*] Fikset at det ikke var mulig å binde følgende evner:",
      "[list]",
      "[*] Centaur Warrunner: Work Horse",
      "[*] Disruptor: Electromagnetic Repulsion",
      "[*] Dawnbreaker: Solar Guardian",
      "[*] Timbersaw: Twisted Chakram",
      "[*] Elder Titan: Move Astral Spirit",
      "[*] Io: Spirits In og Spirits Out",
      "[*] Pangolier: Roll Up",
      "[*] Tinker: Keen Conveyance",
      "[*] Keeper of the Light: Solar Bind og Recall",
      "[/list]",
      "[*] Fikset at Roshans Roar ikke spilte av effekten/animasjonen.",
      "[*] Fikset at Helm of the Undying utførte sin ekstra varighet flere ganger hvis flere angrep rammet et mål som allerede var dødt.",
      "[*] Fikset at Helm of the Undying telte skade som nesten var dødelig som et heltedrap, som førte til tildeling av altfor mye ekstra tid.",
      "[*] Fikset at Serrated Shivs partikkeleffekt for treff spilte av når angrepet startet istedenfor når det rammet.",
      "[*] Fikset at Book of the Dead ikke spilte av en lyd ved bruk.",
      "[*] Fikset at Bloodseekers Bloodrage omgikk Linken's Sphere ved bruk på fiender.",
      "[*] Fikset at stilningen fra Bloodseekers Bloodrage trengte gjennom svekkelsesimmunitet på fiender.",
      "[*] Fikset at «Velg helt» under Dazzles Nothl Projection valgte Dazzle i stedet for projeksjonen.",
      "[*] Fikset at Disruptors Electromagnetic Repulsion med Transferrence ikke ble påvirket av nedkjølingsreduksjon ved manuelt bruk.",
      "[*] Fikset at Elder Titans ånd ikke automatisk vendte tilbake hvis Echo Stomp ble brukt når Titan har Aghanim's Shard.",
      "[*] Fikset at Hoodwink og Ogre Magis ultimate evner ikke kunne gå opp i nivå via hurtigtast.",
      "[*] Fikset at Invokers Ice Wall som vektor ikke ble brukt direkte vinkelrett fra Invoker når vektorens avstand til sluttpunktet var under en viss terskel.",
      "[*] Fikset at enheter forbundet til Io ble vist i krigståken hvis de hadde utstyrt en pyntegjenstand med omgivelsespartikler.",
      "[*] Fikset at Kez' Flutter Katana gjorde mindre skade enn tilsiktet.",
      "[*] Fikset at Kez' Flutter Katana ble brukt opp uten virkning i visse tilfeller.",
      "[*] Fikset at Kez' Raven's Veil fikk nedkjøling hvis Raptor Dance ble avbrutt.",
      "[*] Fikset at hemmingen fra Kez' Grappling Claw fremdeles ble fjernet når angrepet treffer.",
      "[*] Fikset at hemmingen fra Kez' Grappling Claws ikke varte lenge nok.",
      "[*] Fikset at Kez' Raven's Veil fikk nedkjøling hvis Raptor Dance ble avbrutt.",
      "[*] Fikset at Kez' Flutter ble brukt opp av Talon Toss, Falcon Rush og spiddeangrepet fra Kazurai Katana.",
      "[*] Fikset at Lone Druids åndebjørn ikke kunne kjøpe gjenstander fra den hemmelige butikken med hurtigkjøp.",
      "[*] Fikset at forrådet ikke dukket opp når Lone Druids åndebjørn var valgt.",
      "[*] Fikset at Magnus' Reverse Polarity ikke spilte av lammelsesanimasjoner på fiender.",
      "[*] Fikset at Monkey Kings underevne Changing of the Guard kunne stjeles.",
      "[*] Fikset utseendeproblemer med Monkey Kings Demon Trickster ved bruk av Changing of the Guard.",
      "[*] Fikset at Muertas Quick Draw noen ganger førte til at Gunslinger ble utløst oftere enn tilsiktet.",
      "[*] Fikset at Muerta spilte av feil replikk ved treff med Deadshot forbedret med Aghanim's Scepter.",
      "[*] Fikset at Necrophos' Ghost Shroud ikke økte innkommende helbredelse.",
      "[*] Oracles runetider fra Prognosticate kan nå alt-plinges.",
      "[*] Fikset at Sand Kings angrepsradius med Stinger med Aghanim's Scepter var lavere enn tilsiktet.",
      "[*] Fikset at Shadow Fiends Requiem of Souls ikke påførte frykt på fiender hvis Shadow Fiend døde like etter at evnen ble brukt.",
      "[*] Fikset at Timbersaws Whirling Death helbredet mer på styrke- og allsidighetshelter enn forventet.",
      "[*] Fikset at Void Spirits Sanctuary ikke økte barrieremengden.",
      "[*] Ability Draft: Fikset at veksling av autobruk på Quill Spray i Ability Draft ikke utførte Hairball-bytte før spillere har Aghanim's Shard.",
      "[*] Ability Draft: Fikset Ogre Magis fasett Learning Curve så den fungerer med alle evner (krever valg av heltemodellen Ogre Magi).",
      "[*] Ability Draft: Fikset mange tilfeller av manglende eller uriktige tillagte talenter.",
      "[*] Fikset at heltegods for våren 2025 opprinnelig hadde feil bytte- og gaveinnstillinger.",
      "[*] Gjorde det mindre sannsynlig at gjenstandsforslag i Dota Plus går tom for gjenstander å foreslå sent i spillet.",
      "[*] Fikset at hurtigkjøp av foreslåtte gjenstander i Dota Plus kjøpte flere eksemplarer ved raske trykk.",
      "[/list]"
    ],
    "commentcount": 90,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 828,
    "votedowncount": 66,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748620267,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 828,
  "votes_down": 66,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}