{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Ігроладне оновлення 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ігроладне оновлення 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "Оновлення 7.39b вийшло, і про всі зміни можна дізнатися [url=https://www.dota2.com/patches/7.39b]ось тут[/url].",
      "Також за останні дні ми виправили такі проблеми:",
      "[list]",
      "[*] Виправлено різні помилки, що спричиняли аварійні завершення роботи клієнта та збої сервера.",
      "[*] Виправлено різні аварійні завершення роботи, пов’язані з новим меню налаштувань.",
      "[*] Виправлено помилку, яка не дозволяла переміщувати цілі предмети в меню швидкої купівлі.",
      "[*] Виправлено помилку, через яку розкривне меню швидкого застосування не показувалося з увімкненим налаштуванням «Розкладка застосування».",
      "[*] Виправлено помилку, через яку швидку купівлю могли здійснювати істоти, які не були героєм, ведмедем-духом чи кур’єром.",
      "[*] Виправлено помилку, через яку кур’єр міг забрати предмети зі сховку, коли перебував біля таємної крамниці.",
      "[*] Виправлено помилку, через яку клавіша заміни ALT могла активувати інші дії.",
      "[*] Виправлено помилку, через яку налаштування якості мережі не застосовувалося.",
      "[*] Знову додано пропущені налаштування, як-от «Панель істоти замінює панель героя», «Нова панель істот», «Показувати чергу наказів в інтерфейсі» та «Показувати відео в підказках здібностей».",
      "[*] Додано нове налаштування, що дозволяє відключати гарячі клавіші для окремих істот у нестандартних іграх.",
      "[*] Виправлено помилку, через яку налаштування «Розкладка застосування» заважало призначити клавіші для сувою телепортації й нейтрального предмета.",
      "[*] Виправлено помилку, через яку команда «Доставити предмети» змушувала кур’єра, що був поруч із крамницею, забирати предмети зі сховку.",
      "[*] Виправлено помилку, через яку кур’єр ігнорував чергу команд після доставки предметів.",
      "[*] Виправлено аварійне завершення клієнта гри, що відбувалося під час перетягування вже купленого предмета до посібника в режимі редагування.",
      "[*] Виправлено помилку, через яку повзунок яскравості було інвертовано.",
      "[*] Виправлено помилку, через яку не працювала кнопка повторного калібрування рейтингу.",
      "[*] Виправлено помилку, через яку герої могли назавжди застрягти в стані переходу до смерті, якщо смерть настала під дією Отруєної зброї (Envenomed Weapon) вовкуна-душогуба та ефекту, що зменшує відновлення здоров’я.",
      "[*] Виправлено помилку, через яку не приймалося жодне введення, якщо під час призначення нової клавіші гравець повністю закрив меню налаштувань.",
      "[*] Виправлено помилку, через яку кур’єр не забирав предмети зі сховку, коли отримував наказ доставити предмети під час залишення фонтану.",
      "[*] Налаштування «Скасування взаємодії зі спорудами клавішею» перейменовано на «Скасування захоплення споруд клавішею».",
      "[*] «Скасування захоплення споруд клавішею» тепер стосується лише захоплення споглядачів та застав. Скасування чаклування Подвійних порталів та Потойбічних врат (Fiend's Gate) Підземного Лорда тепер відбувається згідно з налаштуванням «Скасування телепортації клавішею».",
      "[*] Тепер кур’єр продовжує виконувати останній наказ після ввімкнення режиму автодоставки.",
      "[*] Тепер панель кур’єра має окремі показники стану очікування біля таємної крамниці та довільного руху, які відрізняються від руху до звичайної крамниці чи доставки до героя. Знак питання більше не з’являється, коли кур’єр рухається не до героя.",
      "[*] Виправлено аварійні завершення, що виникали під час запуску нестандартних ігор, де команди мали понад 7 гравців.",
      "[*] Виправлено помилку, через яку гра не запам’ятовувала ваші налаштування для показу панелі командних предметів.",
      "[*] Виправлено помилку, через яку не можна було призначити клавіші для таких здібностей:",
      "[list]",
      "[*] Робоча конячка (Work Horse) Кентавра-Воєводи;",
      "[*] Електромагнітний поштовх (Electromagnetic Repulsion) Буревісника;",
      "[*] Сонячна варта (Solar Guardian) Світанкової;",
      "[*] Кручений чакрам (Twisted Chakram) Лісопила;",
      "[*] Пересування астрального духа (Move Astral Spirit) Древнього Титана;",
      "[*] Духи поблизу (Spirits In) та Духи на відстані (Spirits Out) Іо;",
      "[*] Підкот (Roll Up) Панґольєра;",
      "[*] Мастацьке перевезення (Keen Conveyance) Механіка;",
      "[*] Сонячний зв’язок (Solar Bind) та Відкликання (Recall) Хранителя Світла.",
      "[/list]",
      "[*] Виправлено помилку, через яку Рик реваншу (Roar of Retribution) Рошана не відтворював візуальні ефекти й анімацію.",
      "[*] Виправлено помилку, через яку Шолом невмирущого (Helm of the Undying) збільшував тривалість форми привида з кожною атакою по вже вбитій цілі.",
      "[*] Виправлено помилку, через яку Шолом невмирущого (Helm of the Undying) збільшував тривалість форми привида з кожним завдаванням шкоди, наближеної до смертельної.",
      "[*] Виправлено помилку, через яку візуальний ефект Зубчатого леза (Serrated Shiv) відтворювався під час замаху, а не під час завдавання шкоди.",
      "[*] Виправлено помилку, через яку Книга мертвих (Book of the Dead) застосовувалася беззвучно.",
      "[*] Виправлено помилку, через яку Кривава лють (Bloodrage) Кривавого Жерця ігнорувала ворожу сферу Лінкена (Linken's Sphere).",
      "[*] Виправлено помилку, через яку Кривава лють (Bloodrage) Кривавого Жерця застосовувала на ворогів знемовлення навіть попри імунітет до негативних ефектів.",
      "[*] Виправлено помилку, через яку команда «Вибрати героя» під час Нотльської проекції (Nothl Projection) Дазла вибирала його тіло, а не душу.",
      "[*] Виправлено помилку, через яку на збільшену зарядку від Електромагнітного поштовху (Electromagnetic Repulsion) з гранню Передача в Буревісника не діяло зменшення зарядок.",
      "[*] Виправлено помилку, через яку астральний дух Древнього Титана не повертався після застосування Лункого тупоту (Echo Stomp) з Уламком Аґаніма.",
      "[*] Виправлено помилку, через яку ультимативні здібності Каптурниці та Огра-Мага не можна було вивчити за допомогою гарячих клавіш.",
      "[*] Виправлено помилку, через яку посилена Крижана стіна (Ice Wall) Заклинача не створювала потік перпендикулярно до огляду героя, якщо за векторного застосування він обирав надто близьку до себе точку.",
      "[*] Виправлено помилку, через яку прив’язані до Іо істоти могли з’явитися в тумані війни, якщо мали косметичні візуальні ефекти.",
      "[*] Виправлено помилку, через яку Боривітер із гранню Помах крил завдавав катаною менше шкоди, ніж потрібно.",
      "[*] Виправлено помилку, через яку Боривітер із гранню Помах крил міг взагалі не завдати додаткової шкоди катаною.",
      "[*] Виправлено помилку, через яку Завіса ворона (Raven's Veil) в Боривітра починала заряджатися, якщо було перервано Танок хижака (Raptor Dance).",
      "[*] Виправлено помилку, через яку сповільнення від Чіпкого кігтя (Grappling Claw) Боривітра все ще вилучалося після завершення атаки.",
      "[*] Виправлено помилку, через яку сповільнення від Чіпкого кігтя (Grappling Claw) Боривітра було занадто коротким.",
      "[*] Виправлено помилку, через яку Завіса ворона (Raven's Veil) в Боривітра починала заряджатися, якщо було перервано Танок хижака (Raptor Dance).",
      "[*] Виправлено помилку, через яку додаткова шкода від грані Помах крил не спрацьовувала та зникала в разі застосування Кидка пазура (Talon Toss), Натиску сокола (Falcon Rush) та Казурайської катани (Kazurai Katana).",
      "[*] Виправлено помилку, через яку ведмідь-дух Самітного Друїда не міг здійснювати швидку купівлю предметів у таємній крамниці.",
      "[*] Виправлено помилку, через яку в Самітного Друїда не показувався сховок у разі виділення ведмедя-духа.",
      "[*] Виправлено помилку, через яку Обернена полярність (Reverse Polarity) Маґнуса не спричиняла анімацію приголомшення для ворогів.",
      "[*] Виправлено помилку, через яку Рубік міг викрасти Зміну варти (Changing of the Guard) в Мавпячого Короля.",
      "[*] Виправлено помилки, пов’язані з ефектами набору Demon Trickster для Мавпячого короля під час застосування здібності Зміна варти (Changing of the Guard).",
      "[*] Виправлено помилку, через яку Стрілець (Gunslinger) із гранню Швидка рука в Муерти спрацьовував частіше, ніж потрібно.",
      "[*] Виправлено помилку, через яку Муерта говорила хибну фразу після влучання Пострілом Смерті (Dead Shot) зі Скіпетром Аґаніма.",
      "[*] Виправлено помилку, через яку Примарний саван (Ghost Shroud) Некрофоса не збільшував отримуване лікування.",
      "[*] Тепер Оракул може надіслати в чат повідомлення про майбутню руну, якщо клацне на внутрішньоігровий таймер із затисненою клавішею ALT.",
      "[*] Виправлено помилку, через яку радіус ефектів Жала (Stinger) Царя Пісків зі Скіпетром Аґаніма був меншим, ніж потрібно.",
      "[*] Виправлено помилку, через яку Реквієм душ (Requiem of Souls) Тінистого Нелюда не накладав страх, якщо власник помирав одразу після завершення застосування.",
      "[*] Виправлено помилку, через яку повернення характеристик після завершення ефекту від Смертельної циркулярки (Whirling Death) Лісопила лікувало героїв сили та універсальних героїв сильніше, ніж потрібно.",
      "[*] Виправлено помилку, через яку Святилище (Sanctuary) Порожнечого Духа не збільшувало здоров’я бар’єра.",
      "[*] Режим відбору здібностей: виправлено помилку, через яку перемикання автозастосування Хмари голок (Quill Spray) не змінювало її на Клубок голок (Hairball), якщо герой не мав Уламка Аґаніма.",
      "[*] Режим відбору здібностей: виправлено помилку, через яку грань Крива навчання Огра-Мага працювала не з усіма здібностями (для цього потрібно вибрати й самого героя).",
      "[*] Режим відбору здібностей: виправлено багато випадків, коли таланти були відсутні чи додані помилково.",
      "[*] Виправлено дозволи обміну й дарування для весняної скарбниці 2025 року. ",
      "[*] Зменшено ймовірність того, що в пізній грі у порадах від Dota Plus закінчаться предмети, які можна запропонувати.",
      "[*] Виправлено помилку, через яку швидка купівля запропонованих Dota Plus предметів відбувалася кілька разів, якщо клацати швидко.",
      "[/list]"
    ],
    "commentcount": 164,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 3553,
    "votedowncount": 400,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1749058267,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 3552,
  "votes_down": 400,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}