{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização de jogabilidade 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748561761
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Atualização de jogabilidade 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748561762,
    "body": [
      "A atualização 7.39b já está disponível e podes ler as notas [url=https://www.dota2.com/patches/7.39b]aqui[/url].",
      "Ao longo dos últimos dias, também corrigimos os seguintes problemas:",
      "[list]",
      "[*] Foram corrigidas diversas falhas críticas do lado do cliente e do servidor.",
      "[*] Foram corrigidas várias falhas críticas relacionadas com o novo menu de definições.",
      "[*] Foi corrigido um problema que ocorria ao mover itens completos na Compra Rápida.",
      "[*] Foi corrigido um problema em que o menu pendente para opções de uso rápido não aparecia na secção de atalhos para tipos de uso e na configuração individual de uso rápido.",
      "[*] Foi corrigido um problema em que unidades além do herói, o Spirit Bear ou o estafeta podiam comprar itens na Compra Rápida.",
      "[*] Foi corrigido um problema em que o estafeta podia apanhar itens da arca enquanto estivesse na Loja Secreta.",
      "[*] Foi corrigido um problema em que teclas designadas ao modificador de Alt ativavam outras ações não intencionais.",
      "[*] Foi corrigido um problema com a definição de qualidade da rede, que não entrava em efeito.",
      "[*] Foram readicionadas definições em falta, como \"Mostrar dados de unidade no lugar da consola\", \"Mostrar fila de ordens na interface\" e \"Mostrar vídeos das descrições das habilidades\".",
      "[*] Foi adicionada uma definição nova para desativar atalhos de unidades em modos customizados.",
      "[*] Foi corrigido um problema em que não era possível designar atalhos para Town Portal Scrolls e itens neutros na secção de atalhos para tipos de uso.",
      "[*] Foi corrigido um problema onde a habilidade de estafeta \"Entregar Itens\" apanhava itens da arca se o estafeta estivesse perto da loja.",
      "[*] Foi corrigido um problema em que o estafeta não respeitava ordens na fila depois de transferir itens para entrega.",
      "[*] Foi corrigida uma falha crítica que ocorria quando um item do inventário era arrastado para o guia de itens atual quando estivesse no modo de editar.",
      "[*] Foi corrigido um problema em que a opção de brilho no modo de ecrã completo exclusivo aparecia invertida.",
      "[*] Foi corrigido um problema com o botão de recalibração de MMR, que não estava a funcionar.",
      "[*] Foi corrigido um problema em que heróis podiam ficar presos permanentemente num estado de transição de morte se a morte tivesse ocorrido enquanto o herói estivesse afetado pelo debuff de Envenomed Weapon (do creep Vhoul Assassin) e outras fontes de restauro de vida com valores negativos.",
      "[*] Foi corrigido um problema no menu de definições em que input era ignorado se o menu fosse fechado no menu usado para designar especificamente uma tecla.",
      "[*] Foi corrigido um problema em que o estafeta não apanhava itens da arca quando recebia uma ordem para entregar itens ao sair da Fonte.",
      "[*] O nome da opção \"Parar concentração em estruturas só com ordem\" foi mudado para \"Parar captura de estruturas só com ordem para cancelar\".",
      "[*] \"Parar captura de estruturas só com ordem para cancelar\" agora só afeta a captura de Vigias e Postos Avançados. O comportamento de cancelamento de concentrações de Portais Geminados e do Fiend's Gate do Underlord foi movido para \"Parar teletransporte só com ordem para cancelar\".",
      "[*] Agora, o estafeta irá continuar a última ordem que recebeu ao mudar para o modo de entrega automática.",
      "[*] O painel da interface do estafeta agora tem estados distintos para esperar na Loja Secreta e para locomoção genérica (em vez de ir a uma loja ou entregar itens a um herói). Foi corrigido um problema em que um ponto de interrogação (?) aparecia quando o estafeta estava a deslocar-se sem um herói como destino.",
      "[*] Foi corrigida uma falha crítica em partidas de modos customizados que ocorria se uma equipa tivesse mais de sete jogadores.",
      "[*] Foi corrigido um problema com o ícone para mostrar itens da equipa, cujo estado não era memorizado na loja.",
      "[*] Foi corrigido um problema em que não era possível designar atalhos às seguintes habilidades:",
      "[list]",
      "[*] Centaur Warrunner: Work Horse",
      "[*] Disruptor: Electromagnetic Repulsion",
      "[*] Dawnbreaker: Solar Guardian",
      "[*] Timbersaw: Twisted Chakram",
      "[*] Elder Titan: Astral Spirit - Mover",
      "[*] Io: Spirits - Aproximar/Afastar",
      "[*] Pangolier: Roll Up",
      "[*] Tinker: Keen Conveyance",
      "[*] Keeper of the Light: Solar Bind/Recall",
      "[/list]",
      "[*] Foi corrigido um problema em que o rugido do Roshan (Roar of Retribution) não reproduzia os efeitos visuais nem a animação.",
      "[*] Helm of the Undying: foi corrigido um problema em que a morte era adiada continuamente se mais ataques atingissem um alvo já morto.",
      "[*] Helm of the Undying: foi corrigido um caso em que dano quase letal era considerado uma morte de um herói, resultando num aumento excessivo do adiamento da morte do portador do item.",
      "[*] Serrated Shiv: foi corrigido um problema em que o efeito de partículas era reproduzido quando o ataque começava e não quando atingia o alvo.",
      "[*] Book of the Dead: foi corrigido um problema em que nenhum som era reproduzido quando o item era usado.",
      "[*] Bloodseeker: foi corrigido um problema com a habilidade Bloodrage, que ignorava Linken's Sphere quando a habilidade era usada em inimigos.",
      "[*]Bloodseeker: foi corrigido outro problema com a habilidade Bloodrage, cujo efeito de silêncio ignorava a imunidade de inimigos a debuffs.",
      "[*] Dazzle: foi corrigido um problema em que a ação \"Selecionar herói\" durante o uso da habilidade Nothl Projection selecionava o Dazzle em vez do seu espírito.",
      "[*] Disruptor: foi corrigido um problema em que a habilidade Electromagnetic Repulsion com a Faceta \"Transference\" não era afetada pela redução do cooldown quando era usada manualmente.",
      "[*] Elder Titan: foi corrigido um caso em que o Astral Spirit não regressava automaticamente ao usar Echo Stomp enquanto o Elder Titan tivesse um Aghanim's Shard.",
      "[*] Hoodwink/Ogre Magi: foi corrigido um problema com as habilidades Ultimate destes heróis, que ignoravam o atalho para subir de nível.",
      "[*] Invoker: foi corrigido um problema com a habilidade Ice Wall melhorada por Aghanim's Scepter, que não se materializava de forma diretamente perpendicular ao Invoker quando a distância do ponto final da conjuração estava abaixo de um certo limite.",
      "[*] Io: foi corrigido um caso em que unidades conectadas ao Io apareciam na névoa de guerra estivessem a usar um acessório com partículas de ambiente.",
      "[*] Kez: foi corrigido um problema com a Faceta \"Flutter\", que resultava em menos dano do que o pretendido.",
      "[*] Kez: foi corrigido um problema com a Faceta \"Flutter\", cujo bónus era consumido sem ter efeito em certos casos.",
      "[*] Kez: foi corrigido um bug que fazia com que Raven's Veil entrasse em cooldown se a habilidade Raptor Dance fosse interrompida.",
      "[*] Kez: foi corrigido um problema em que o abrandamento de Grappling Claw ainda era removido quando o ataque atingisse o alvo.",
      "[*] Kez: foi corrigido um problema em que o abrandamento de Grappling Claw não era longo o suficiente.",
      "[*] Kez: foi corrigido um bug que fazia com que Raven's Veil entrasse em cooldown se a habilidade Raptor Dance fosse interrompida.",
      "[*] Kez: foi corrigido um problema com a Faceta \"Flutter\", cujo bónus era consumido por Talon Toss, Falcon Rush e o ataque \"falso\" do empalamento de Kazurai Katana.",
      "[*] Lone Druid: foi corrigido um problema com o Spirit Bear, que não podia comprar itens da Loja Secreta a partir da Compra Rápida.",
      "[*] Lone Druid: foi corrigido um caso em que a arca não aparecia quando o Spirit Bear estava selecionado.",
      "[*] Magnus: foi corrigido um problema com a habilidade Reverse Polarity, que não reproduzia animações de atordoamento em inimigos.",
      "[*] Monkey King: foi corrigido um problema em que a sub-habilidade Changing of the Guard podia ser roubada por Spell Steal.",
      "[*] Monkey King: foram corrigidos problemas visuais com a habilidade Changing of the Guard causados pelo conjunto \"Cult of the Demon Trickster\".",
      "[*] Muerta: foi corrigido um problema ocasional com a Faceta \"Quickdraw\", que podia fazer com que o efeito de Gunslinger se ativasse com mais frequência do que o pretendido.",
      "[*] Muerta: foi corrigido um caso em que eram reproduzidas as falas incorretas ao atingir um inimigo com Dead Shot melhorado por Aghanim's Scepter.",
      "[*] Necrophos: foi corrigido um problema em que Ghost Shroud não aumentava a cura recebida.",
      "[*] Oracle: agora, é possível fazer ping com Alt nos temporizadores de runas de Prognosticate.",
      "[*] Sand King: foi corrigido um problema com a habilidade Epicenter melhorada por Aghanim's Scepter, cujo raio de ataque de Stinger era mais baixo do que o pretendido.",
      "[*] Shadow Fiend: foi corrigido um problema com a habilidade Requiem of Souls, que não aterrorizava inimigos se o Shadow Fiend morresse logo depois de terminar a conjuração.",
      "[*] Timbersaw: foi corrigido um problema em que a habilidade Whirling Death curava heróis de Força e Universais mais do que o esperado.",
      "[*] Void Spirit: foi corrigido um problema com a Faceta \"Sanctuary\", que não aumentava a vida da barreira.",
      "[*] Seleção de Habilidades: foi corrigido um problema em que ativar o uso automático da habilidade Quill Spray mudava-a para Hairball, sendo apenas possível mudar novamente para Quill Spray depois de se comprar um Aghanim's Shard.",
      "[*] Seleção de Habilidades: foi corrigido um problema com a Faceta \"Learning Curve\", do Ogre Magi, que funcionava com todas as habilidades (requer que o herói selecionado seja o Ogre Magi).",
      "[*] Seleção de Habilidades: foram corrigidos muitos casos de talentos em falta ou adicionados incorretamente.",
      "[*] Foi corrigido um problema dos primeiros Spring 2025 Heroes' Hoard vendidos, que tinham definições incorretas para trocar e para presentear.",
      "[/list]"
    ],
    "commentcount": 4,
    "tags": [
      "patchnotes"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748561770,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}