{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Parche de jugabilidad 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Parche de jugabilidad 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "Ya está disponible el parche 7.39b, y puedes consultar las notas [url=https://www.dota2.com/patches/7.39b]aquí[/url].",
      "Además, en los últimos días, hemos solucionado los siguientes problemas:",
      "[list]",
      "[*] Se corrigieron varios bloqueos distintos del cliente y del servidor.",
      "[*] Se corrigieron varios bloqueos relacionados con el nuevo menú de configuración.",
      "[*] Se corrigió un problema relacionado con mover un conjunto de objetos durante la compra rápida.",
      "[*] Se corrigió el menú desplegable del lanzamiento rápido que no aparecía en las asignaciones de lanzamiento directo ni en la selección de lanzamiento rápido.",
      "[*] Se corrigió un problema que permitía que unidades distintas de héroes, Espíritu Oso o el mensajero adquiriesen objetos en la compra rápida.",
      "[*] Se corrigió un problema por el cual el mensajero podía coger objetos de la reserva cuando estaba en la Tienda Secreta.",
      "[*] Se corrigió que las teclas que se asociaban al modificador «Alt» provocasen acciones distintas de lo esperado.",
      "[*] El ajuste de calidad de red ahora se aplica correctamente.",
      "[*] Se añadieron de nuevo los ajustes que faltaban, como la activación del panel de consulta, la activación de las órdenes en cola en el HUD y la activación de vídeos en los detalles de habilidades.",
      "[*] Se añadió un ajuste nuevo para desactivar las teclas rápidas por unidad durante el modo de juego personalizado.",
      "[*] Se corrigió que no se pudiese asignar teclas de lanzamiento directo al Pergamino de Teletransporte y al objeto neutral.",
      "[*] Se corrigió un problema por el cual la habilidad del mensajero Transferir Objetos podía coger objetos de la reserva cuando este estaba cerca de la tienda.",
      "[*] El mensajero ya tiene en cuenta las órdenes en cola después de la transferencia.",
      "[*] Se corrigió un bloqueo del cliente del juego que ocurría cuando se arrastraba un objeto del inventario a la guía del objeto actual cuando estaba en el modo de edición.",
      "[*] Se corrigió el control deslizante del brillo en pantalla completa que estaba invertido.",
      "[*] Se corrigió el botón de recalibración de MMR, que no funcionaba.",
      "[*] Se corrigió un problema por el que los héroes a veces quedaban atrapados en un estado de transición durante la muerte si esta ocurría cuando estaban afectados por el efecto negativo Arma Envenenada de Vhoul Asesino y por otras fuentes de restauración negativa de vida.",
      "[*] Se corrigió la asignación de teclas de la configuración que bloqueaba la entrada si se cerraba la configuración cuando se estaba asignando una tecla.",
      "[*] Se corrigió que el mensajero no cogiese objetos de la reserva cuando se le pedía que transfiriese objetos al salir de la fuente.",
      "[*] Se cambió el nombre de «Las estructuras requieren seguir pulsando o Cancelar para parar» a «Capturar las estructuras requiere seguir pulsando o Cancelar para parar».",
      "[*] «Capturar las estructuras requiere seguir pulsando o Cancelar para parar» ahora solo afecta a la captura de vigilantes y puestos avanzados. El comportamiento de cancelar la canalización de los Portales Gemelos y del Portal Demoníaco de Underlord se volvió a establecer como «Teletransporte requiere seguir pulsando o Cancelar para parar».",
      "[*] Ahora el mensajero sigue haciendo lo que se le pidió cuando se cambia al modo de entrega automática.",
      "[*] El panel del HUD del mensajero ahora tiene estados separados para la espera en la Tienda Secreta y para moverse normalmente (para distinguirlo de ir a la tienda o hacer una entrega a un héroe). Se corrigió un signo de interrogación (?) que aparecía cuando el mensajero se movía sin que su destino fuera un héroe.",
      "[*] Se corrigieron los bloqueos del modo de juego personalizado que ocurrían cuando un equipo tenía más de 7 jugadores.",
      "[*] Se corrigió que no persistiera en la tienda el estado de Alternar la vista de objetos del equipo.",
      "[*] Ya es posible asignar teclas a las siguientes habilidades:",
      "[list]",
      "[*] Caballo de Tiro de Centaur Warrunner.",
      "[*] Repulsión Electromagnética de Disruptor.",
      "[*] Guardiana Solar de Dawnbreaker.",
      "[*] Chakram Retorcido de Timbersaw.",
      "[*] Mover Espíritu Astral de Elder Titan.",
      "[*] Las habilidades de Acercar y Alejar Espíritus de Io.",
      "[*] Enrollar de Pangolier.",
      "[*] Transporte Ingenioso de Tinker.",
      "[*] Llamada y Vínculo Solar de Keeper of the Light.",
      "[/list]",
      "[*] Ya se reproducen la animación y los efectos de Rugido de Venganza de Roshan.",
      "[*] Se corrigió que Yelmo de los Inmortales aplicase la bonificación de duración varias veces cuando un objetivo ya muerto recibía más ataques.",
      "[*] Se corrigió que Yelmo de los Inmortales considerase el daño casi letal como una muerte de héroe, con lo que otorgaba más tiempo de lo esperado.",
      "[*] Se corrigió que los efectos de partículas de Cuchilla Dentada se reprodujeran al iniciar el ataque en lugar de al impactar.",
      "[*] Se corrigió que Libro de los Muertos no reproducía un sonido al lanzarse.",
      "[*] Se corrigió que, al lanzar Furia Sangrienta de Bloodseeker sobre los enemigos, no quedase bloqueada por Esfera de Linken.",
      "[*] Se corrigió que el silencio de Furia Sangrienta de Bloodseeker ignorase la inmunidad de los enemigos a efectos negativos.",
      "[*] Se corrigió que la opción «Seleccionar héroe» durante Proyección de Nothl de Dazzle seleccionase a Dazzle en lugar de a su proyección.",
      "[*] Se corrigió que Transferencia en Repulsión Electromagnética de Disruptor no se viera afectada por la reducción del tiempo de recarga si se lanzaba manualmente.",
      "[*] Se corrigió que el espíritu de Elder Titan no volviera automáticamente si se usaba Pisotón Resonante cuando Elder Titan tenía el Fragmento.",
      "[*] Se corrigió que las habilidades definitivas de Hoodwink y Ogre Magi no se pudieran subir de nivel con la tecla rápida.",
      "[*] Se corrigió que la habilidad vectorizada Muro de Hielo de Invoker no se lanzase directamente perpendicular a Invoker cuando la distancia del punto final del vector estaba por debajo de un umbral determinado.",
      "[*] Se corrigió que las unidades vinculadas a Io se podían ver en la niebla de guerra si tenían un artículo cosmético con partículas ambientales.",
      "[*] Se corrigió que Aleteo (katana) de Kez infligiera menos daño de lo esperado.",
      "[*] Se corrigió que el daño de Aleteo (katana) de Kez no tuviese ningún efecto en algunos casos.",
      "[*] Se corrigió que Velo del Cuervo de Kez entrase en tiempo de recarga si se interrumpía Danza del Ave Rapaz.",
      "[*] Se corrigió que la ralentización de Garra Garfio de Kez se eliminase cuando ocurría el ataque.",
      "[*] Se corrigió que Garra Garfio de Kez no ralentizase el tiempo suficiente.",
      "[*] Se corrigió que Velo del Cuervo de Kez entrase en tiempo de recarga si se interrumpía Danza del Ave Rapaz.",
      "[*] Se corrigió que Lanzamiento de Garra, Embate de Halcón y el ataque fingido de Empalamiento por Katana consumiesen Aleteo de Kez.",
      "[*] Se corrigió que el Espíritu Oso de Lone Druid no pudiera adquirir objetos en la Tienda Secreta usando la compra rápida.",
      "[*] La reserva ya está visible cuando se selecciona al Espíritu Oso de Lone Druid.",
      "[*] Se corrigió que Polaridad Inversa de Magnus no reprodujera las animaciones de aturdimiento en los enemigos.",
      "[*] Se corrigió que se pudiera robar la subhabilidad Cambio de Guardia de Monkey King.",
      "[*] Se corrigieron los problemas provocados por el set de cosméticos del Demonio Embaucador de Monkey King al lanzar Cambio de Guardia.",
      "[*] Se corrigió que Mano Rápida de Muerta hiciera a veces que Pistolera se activase más de lo esperado.",
      "[*] Se corrigió que Muerta reprodujera la línea de voz incorrecta en los impactos de Disparo Mortal con el Cetro de Aghanim.",
      "[*] Se corrigió que Velo Fantasmal de Necrophos no aumentase la curación recibida.",
      "[*] Pronosticar de Oracle ahora permite ver los temporizadores de runas en el mapa al pulsar «Alt».",
      "[*] Se corrigió el radio de los ataques de Aguijón de Sand King con el Cetro de Aghanim que era menor de lo esperado.",
      "[*] Se corrigió que Réquiem de las Almas de Shadow Fiend no atemorizase a los enemigos si Shadow Fiend moría justo después de completar el lanzamiento.",
      "[*] Se corrigió que Muerte Radial de Timbersaw curase más de lo esperado a héroes de fuerza y universales.",
      "[*] Se corrigió que Santuario de Void Spirit no aumentase la cantidad de la barrera.",
      "[*] Selección de habilidades: se corrigió que, al alternar el lanzamiento automático para Lluvia de Espinas en el modo Selección de habilidades, no se cambiaba a Bola de Pelo hasta que se conseguía el Fragmento.",
      "[*] Selección de habilidades: se corrigió la faceta Curva de Aprendizaje de Ogre Magi para que funcione con todas las habilidades (es necesario haber seleccionado a Ogre Magi).",
      "[*] Selección de habilidades: se corrigieron muchos casos de talentos que faltaban o se habían añadido incorrectamente.",
      "[*] Se corrigió el Tesoro Heroico de Primavera 2025 que al principio incluía algunos ajustes incorrectos para intercambios y regalos.",
      "[*] Se hizo menos probable que el sugeridor de objetos de Dota Plus se quedase sin objetos para recomendar hacia el final de la partida.",
      "[*] Se corrigió la compra rápida de los objetos recomendados por Dota Plus para que no adquiriese objetos repetidos si se hacía clic muy rápido.",
      "[/list]"
    ],
    "commentcount": 96,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 918,
    "votedowncount": 75,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748627704,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 918,
  "votes_down": 75,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}