{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Aggiornamento di gioco 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aggiornamento di gioco 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "La patch 7.39b è ora disponibile e puoi consultarne le note [url=https://www.dota2.com/patches/7.39b]qui[/url].",
      "Inoltre, nel corso degli ultimi giorni abbiamo risolto i seguenti problemi:",
      "[list]",
      "[*] Risolti diversi crash di client e server.",
      "[*] Risolti vari crash relativi al nuovo menu Impostazioni.",
      "[*] Risolto un problema di spostamento di interi oggetti nell'acquisto rapido.",
      "[*] Risolto il problema per cui il menu a tendina Lancio rapido non veniva visualizzato nelle associazioni di lancio rapido e nello strumento di selezione per il lancio rapido.",
      "[*] Risolto il problema per cui Unità diverse dall'Eroe, da Spirito Orso o dal corriere potevano acquistare oggetti con l'acquisto rapido.",
      "[*] Risolto il problema per cui il corriere poteva prelevare oggetti dall'inventario quando si trovava nel negozio segreto.",
      "[*] Risolto il problema per cui i tasti associati al modificatore di ALT attivavano altre azioni involontarie.",
      "[*] Risolto il problema per cui l'impostazione della qualità di rete non veniva applicata.",
      "[*] Aggiunte nuovamente alcune impostazioni mancanti, come l'attivazione del pannello per le Unità, l'attivazione degli ordini in coda sull'interfaccia e l'abilitazione dei video delle abilità nelle descrizioni.",
      "[*] Introdotta una nuova impostazione per disabilitare i tasti rapidi per Unità durante le partite personalizzate.",
      "[*] Risolto il problema per cui non era possibile associare la Pergamena del Portale Cittadino e gli oggetti neutrali al lancio rapido.",
      "[*] Risolto il problema per cui l'abilità Consegna oggetti del corriere prelevava gli oggetti dall'inventario se il corriere si trovava nel raggio d'azione del negozio.",
      "[*] Risolto il problema per cui il corriere non rispettava gli ordini in coda dopo la consegna.",
      "[*] Risolto un crash del client di gioco che si verificava quando un oggetto del tuo inventario veniva trascinato nella tua attuale Guida all'oggetto quando era impostata la modalità di modifica.",
      "[*] Risolto il problema per cui la barra di scorrimento della luminosità a schermo intero era invertita.",
      "[*] Risolto il problema per cui il pulsante Ricalibrazione MMR non funzionava.",
      "[*] Risolto il problema per cui gli Eroi a volte potevano rimanere permanentemente bloccati in uno stato di transizione di morte se questa si verificava mentre erano colpiti dall'effetto negativo Arma avvelenata di Vhoul Assassino e da altre fonti di Rigenerazione della salute negativa.",
      "[*] Risolto il problema per cui il tasto associato a Impostazioni bloccava l'input se le Impostazioni venivano chiuse durante l'associazione di un tasto.",
      "[*] Risolto il problema per cui il corriere non prendeva gli oggetti dall'inventario quando gli veniva ordinato di consegnare gli oggetti all'uscita dalla fontana.",
      "[*] L'impostazione \"Puoi annullare le strutture solo col tasto Ferma\" è stata rinominata \"Puoi annullare la cattura delle strutture solo col tasto Ferma\".",
      "[*] Ora l'impostazione \"Puoi annullare la cattura delle strutture solo col tasto Ferma\" ha effetto solo sulla cattura di Vedette e Avamposti. L'annullamento della canalizzazione di Portali gemelli e di Passaggio demoniaco di Underlord è stato spostato nuovamente su \"Puoi interrompere il teletrasporto solo col tasto Ferma\".",
      "[*] Ora il corriere continuerà a eseguire il suo ultimo ordine quando si passa alla modalità di consegna automatica.",
      "[*] Ora il pannello dell'interfaccia utente del corriere mostra degli stati distinti per l'attesa al negozio segreto e per lo spostamento generico (invece di andare in un negozio o consegnare oggetti a un Eroe). Corretto il problema per cui veniva mostrato un punto interrogativo quando il corriere si muoveva senza un Eroe di destinazione.",
      "[*] Risolto il problema per cui le partite personalizzate si bloccavano se una squadra aveva più di 7 giocatori.",
      "[*] Risolto il problema per cui lo stato dell'interruttore Attiva/disattiva la visualizzazione degli oggetti della squadra non persisteva.",
      "[*] Risolto il problema per cui era impossibile associare le seguenti abilità:",
      "[list]",
      "[*] Cavallo da tiro di Centaur Warrunner",
      "[*] Repulsione elettromagnetica di Disruptor",
      "[*] Guardiano solare di Dawnbreaker",
      "[*] Chakram contorto di Timbersaw",
      "[*] Muovi Spirito astrale di Elder Titan",
      "[*] Avvicina gli Spiriti e Allontana gli Spiriti di Io",
      "[*] Appallottolamento di Pangolier",
      "[*] Trasferimento degli Smilzi di Tinker",
      "[*] Blocco solare/Richiamo di Keeper of the Light",
      "[/list]",
      "[*] Risolto il problema per cui il Ruggito di Rappresaglia di Roshan non riproduceva l'effetto/l'animazione.",
      "[*] Risolto il problema per cui Elmo degli Immortali applicava il suo bonus di durata più volte se venivano sferrati più attacchi su un bersaglio già morto.",
      "[*] Risolto il problema per cui Elmo degli Immortali contava i danni quasi letali come uccisione di un Eroe, concedendo quindi un tempo aggiuntivo eccessivo.",
      "[*] Risolto il problema per cui l'effetto particellare del colpo di Lama dentellata veniva riprodotto all'inizio dell'attacco anziché quando colpiva.",
      "[*] Risolto il problema per cui Libro dei Morti non riproduceva alcun suono all'utilizzo.",
      "[*] Risolto il problema per cui Rabbia sanguinaria di Bloodseeker aggirava la Sfera di Linken quando veniva utilizzata sui nemici.",
      "[*] Risolto il problema per cui il silenziamento di Rabbia sanguinaria di Bloodseeker ignorava l'immunità agli effetti negativi dei nemici.",
      "[*] Risolto il problema per cui \"Seleziona Eroe\" durante Proiezione Nothl di Dazzle selezionava Dazzle al posto della Proiezione.",
      "[*] Risolto il problema per cui Repulsione elettromagnetica con Trasfert di Disruptor non veniva influenzata dalla riduzione del tempo di ricarica quando veniva utilizzata manualmente.",
      "[*] Risolto il problema per cui lo Spirito di Elder Titan non tornava automaticamente se si utilizzava Pestone ecosismico quando Titan aveva il Frammento di Aghanim.",
      "[*] Risolto il problema per cui le abilità ultimate di Hoodwink e Ogre Magi non erano migliorabili tramite un tasto rapido.",
      "[*] Risolto il problema per cui clicca e trascina per Muro di ghiaccio di Invoker non era perpendicolare a Invoker quando la distanza del punto finale del vettore era inferiore a una certa soglia.",
      "[*] Risolto il problema per cui le Unità legate a Io apparivano in Nebbia di guerra se avevano un oggetto cosmetico dotato di effetti particellari ambientali.",
      "[*] Risolto il problema per cui Sfarfallio di Kez (Katana) provocava meno danni del previsto.",
      "[*] Risolto il problema per cui i danni di Sfarfallio di Kez (Katana) in certi casi venivano consumati senza alcun effetto.",
      "[*] Risolto il problema per cui Velo del corvo di Kez andava in ricarica se Danza del rapace veniva interrotta.",
      "[*] Risolto il problema per cui il rallentamento di Artiglio a rampino di Kez veniva rimosso quando si sferrava l'attacco.",
      "[*] Risolto il problema per cui il rallentamento di Artiglio a rampino di Kez non era sufficientemente lungo.",
      "[*] Risolto il problema per cui Velo del corvo di Kez andava in ricarica se Danza del rapace veniva interrotta.",
      "[*] Risolto il problema per cui Sfarfallio di Kez veniva consumato con Lancio dell'artiglio, Scatto del falco e con il falso attacco di Impalamento (Katana).",
      "[*] Risolto il problema per cui Spirito Orso di Lone Druid non era in grado di acquistare gli oggetti del negozio segreto con l'acquisto rapido.",
      "[*] Risolto il problema per cui l'inventario non veniva visualizzato quando si selezionava Spirito Orso di Lone Druid.",
      "[*] Risolto il problema per cui Polarità inversa di Magnus non riproduceva le animazioni di stordimento sui nemici.",
      "[*] Risolto il problema per cui l'abilità secondaria Cambio della Guardia di Monkey King poteva essere rubata.",
      "[*] Risolti i problemi relativi all'oggetto cosmetico Demone Burlone di Monkey King durante l'utilizzo di Cambio della Guardia.",
      "[*] Risolto il problema per cui \"Estrai, bifolco!\" di Muerta a volte faceva sì che Pistolera si attivasse più spesso del previsto.",
      "[*] Risolto il problema per cui Muerta riproduceva le frasi errate quando colpiva con Proiettile mortale migliorato con lo Scettro di Aghanim.",
      "[*] Risolto il problema per cui Velo fantasma di Necrophos non aumentava gli effetti di guarigione.",
      "[*] I timer della runa Pronosticare di Oracle ora possono essere attivati nel mondo con ALT.",
      "[*] Risolto il problema per cui gli attacchi di Aculeo con lo Scettro di Aghanim di Sand King erano meno del previsto.",
      "[*] Risolto il problema per cui Requiem delle anime di Shadow Fiend non terrorizzava i nemici se Shadow Fiend moriva subito dopo l'utilizzo.",
      "[*] Risolto il problema per cui Morte rotante di Timbersaw guariva gli Eroi di Forza e Universali più del previsto.",
      "[*] Risolto il problema per cui Santuario di Void Spirit non aumentava il valore della barriera.",
      "[*] Ability Draft: risolto il problema per cui l'attivazione del lancio automatico di Getto di aculei nella modalità Ability Draft non consentiva la sostituzione con Palla di pelo finché non si possedeva il Frammento di Aghanim.",
      "[*] Ability Draft: corretta la faccetta Curva di apprendimento di Ogre Magi, in modo che possa funzionare con tutte le abilità (a condizione che sia stato scelto Ogre Magi come Eroe).",
      "[*] Ability Draft: corretti molti casi in cui i talenti risultavano mancanti o venivano aggiunti erroneamente.",
      "[*] Risolto un problema per cui il Bottino degli Eroi - Primavera 2025 aveva inizialmente impostazioni errate per lo scambio e i doni.",
      "[*] Ridotte le probabilità che il suggeritore degli oggetti di Dota+ esaurisca gli oggetti da suggerire nella parte finale della partita.",
      "[*] Risolto il problema con l'acquisto rapido degli oggetti suggeriti da Dota+ per evitare acquisti duplicati quando si clicca troppo velocemente.",
      "[/list]"
    ],
    "commentcount": 22,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 46,
    "votedowncount": 5,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748563216,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 36,
  "votes_down": 2,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}