{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização de jogabilidade 7.39b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Atualização de jogabilidade 7.39b",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "A atualização 7.39b foi lançada, e você pode conferir os detalhes [url=https://www.dota2.com/patches/7.39b]aqui[/url].",
      "Além disso, nos últimos dias, corrigimos os seguintes problemas:",
      "[list]",
      "[*] Correção de diversos travamentos do cliente e servidor.",
      "[*] Correção de diversos travamentos relacionados ao novo menu de configurações.",
      "[*] Correção de problema ao mover itens completos na compra rápida.",
      "[*] Correção do menu do uso rápido, que não era exibido com o modo \"Atalhos específicos de uso\" e na seleção de uso rápido.",
      "[*] Correção de problema que permitia que unidades além do herói, Espírito Urso ou entregador comprassem itens na compra rápida.",
      "[*] Correção de problema que permitia que o entregador pegasse itens do armário enquanto estivesse na loja secreta.",
      "[*] Correção de problema com as teclas vinculadas ao \"Modificador Alt\", que podiam ativar outras ações não intencionais.",
      "[*] Correção da opção de qualidade de rede nas configurações, que não era aplicada.",
      "[*] Readição de configurações que não foram implementadas, como o painel de consulta de unidade, a exibição da fila de ordens na interface e a exibição de vídeos nas descrições de habilidades.",
      "[*] Adição de nova configuração para desativar atalhos específicos de unidades ao jogar modos alternativos.",
      "[*] Correção de problema que impedia vincular o Pergaminho de Teletransporte e o item neutro aos atalhos específicos de uso.",
      "[*] Correção de problema em que a habilidade \"Transferir Itens\" do entregador podia pegar itens do armário caso ele estivesse dentro do alcance da loja.",
      "[*] Correção de problema com o entregador, que não respeitava ordens enfileiradas após a transferência.",
      "[*] Correção de travamento do cliente do jogo quando um item do seu inventário era arrastado para o guia atual no modo de edição.",
      "[*] Correção do seletor deslizante do brilho em tela cheia, cujos valores estavam invertidos.",
      "[*] Correção do botão de recalibração de MMR, que não estava funcionando.",
      "[*] Correção de problema que podia prender heróis permanentemente em um estado de transição de morte caso ela ocorresse enquanto o herói estivesse sob efeito da Arma Envenenada do Vhoul Assassino e outras fontes de restauração de vida negativa.",
      "[*] Correção dos seletores de atalhos nas configurações, que podiam bloquear a entrada do teclado caso a janela fosse fechada durante a vinculação de uma tecla.",
      "[*] Correção do entregador, que não pegava itens no armário quando recebia uma ordem para transferir itens ao sair da fonte.",
      "[*] Renomeação da opção de estruturas nas configurações de canalizações que exigem \"manter\" ou \"cancelar\" (Estruturas → Estruturas capturáveis).",
      "[*] Agora, a opção \"Estruturas capturáveis\" nas configurações de canalizações que exigem \"manter\" ou \"cancelar\" só afetam vigias e postos avançados. Além disso, a opção \"Teletransportes\" nas configurações de canalizações que exigem \"manter\" ou \"cancelar\" voltou a abrigar os Portais Gêmeos e o Portal do Demônio do Underlord.",
      "[*] Agora, o entregador continuará a executar a última ordem ao alternar para o modo de entrega automática.",
      "[*] Agora, o painel do entregador na interface tem estados distintos para enquanto ele estiver aguardando na loja secreta e vagando pelo mapa (sem estar indo para uma loja ou realizando uma entrega). Correção da exibição de \"?\" quando o entregador está em movimento sem um herói como destino.",
      "[*] Correção de travamento em partidas de modos alternativos caso uma equipe tivesse mais de sete jogadores.",
      "[*] Correção da não persistência da exibição (ou não) dos itens da equipe.",
      "[*] Correção de problema que impedia definir atalhos para as seguintes habilidades:",
      "[list]",
      "[*] Centaur Warrunner: Carroça.",
      "[*] Disruptor: Repulsão Eletromagnética.",
      "[*] Dawnbreaker: Guardiã Solar.",
      "[*] Timbersaw: Chakram Bumerangue.",
      "[*] Elder Titan: Mover Espírito Astral.",
      "[*] Io: Aproximar/Afastar Espíritos.",
      "[*] Pangolier: Enrolar.",
      "[*] Tinker: Transporte Keen.",
      "[*] Keeper of the Light: Vínculo Solar e Revocar.",
      "[/list]",
      "[*] Correção do Rugido de Roshan, que não reproduzia o efeito e nem a animação.",
      "[*] Correção do Elmo do Morto-Vivo, cuja duração adicional era aplicada múltiplas vezes caso novos ataques atingissem um alvo já morto.",
      "[*] Correção do Elmo do Morto-Vivo, que contabilizava dano quase letal como uma morte, resultando em tempo adicional além do esperado.",
      "[*] Correção da Faca de Serra, cujos efeitos de partícula eram exibidos no início do ataque, e não ao atingir.",
      "[*] Correção do Livro dos Mortos, cuja ativação não reproduzia som.",
      "[*] Bloodseeker: correção da Fúria por Sangue, que ignorava a Esfera de Linken quando usada em inimigos.",
      "[*] Bloodseeker: correção do silenciamento da Fúria por Sangue, que ignorava imunidades a efeitos de inimigos.",
      "[*] Dazzle: correção do comando \"Selecionar herói\" durante a Projeção de Nothl, que selecionava Dazzle em vez da Projeção.",
      "[*] Disruptor: correção da Repulsão Eletromagnética com a faceta Transferência, que não era afetada por reduções de intervalos entre usos quando usada manualmente.",
      "[*] Elder Titan: correção do espírito, que não retornava automaticamente ao usar o Pisão Ecoante com o Fragmento.",
      "[*] Hoodwink e Ogre Magi: correção das habilidades Ultimate, que não podiam ser aprimoradas por comandos.",
      "[*] Invoker: correção da Parede de Gelo vetorizada, que não era usada diretamente perpendicular ao Invoker caso o a distância entre os pontos inicial e final fosse inferior a um determinado limiar.",
      "[*] Io: correção de problema em que unidades Conectadas eram exibidas na névoa de guerra caso tivessem um item cosmético com partículas de ambiente.",
      "[*] Kez: correção da Katana com a faceta Agitação, que causava dano aquém do esperado.",
      "[*] Kez: correção da Katana com a faceta Agitação, cujo dano era ocasionalmente consumido sem nenhum efeito.",
      "[*] Kez: correção do Véu do Corvo, que entrava em intervalo entre usos caso a Dança do Raptor fosse interrompida.",
      "[*] Kez: correção da Garra de Rapina, cujo retardo ainda era removido ao acertar o ataque.",
      "[*] Kez: correção da Garra de Rapina, cuja duração do retardo era inferior à esperada.",
      "[*] Kez: correção do Véu do Corvo, que entrava em intervalo entre usos caso a Dança do Raptor fosse interrompida.",
      "[*] Kez: correção do efeito da Agitação, que era consumido por cancelamentos de Desgarrar, Avanço Falcoado e empalamento da Katana dos Kazurai.",
      "[*] Lone Druid: correção do Espírito Urso, que não podia comprar itens da loja secreta com a compra rápida.",
      "[*] Lone Druid: correção de problema que impedia a exibição do armário ao selecionar o Espírito Urso.",
      "[*] Magnus: correção da Inversão de Polaridade, que não reproduzia animações de atordoamento em inimigos.",
      "[*] Monkey King: correção da sub-habilidade Troca de Guarda, que podia ser roubada.",
      "[*] Monkey King: correção de problemas visuais com o conjunto Demônio Trapaceiro ao usar a Troca de Guarda.",
      "[*] Muerta: correção do Saque Rápido, que ocasionalmente causava ativações de Pistoleira além do esperado.",
      "[*] Muerta: correção de reprodução de fala incorreta ao atingir um Rebatiro aprimorado pelo Cetro de Aghanim.",
      "[*] Necrophos: correção da Mortalha Fantasmagórica, que não aumentava curas recebidas.",
      "[*] Agora, o Prognóstico de runas do Oracle pode ser clicado segurando Alt. ",
      "[*] Sand King: correção do Cetro de Aghanim, cujos ataques da Ferroada tinham um raio inferior ao esperado.",
      "[*] Shadow Fiend: correção do Réquiem das Almas, que não amedrontava inimigos caso o Shadow Fiend morresse logo após o término da ativação.",
      "[*] Timbersaw: correção do Vórtice Mortal, que causava cura além do esperado por heróis de Força ou Universais.",
      "[*] Void Spirit: correção do Santuário, que não estava aumentando a vida da barreira.",
      "[*] Seleção de Habilidades: correção do uso automático da Rajada de Espinhos, que mudava para a Bola de Pelos mesmo sem o Fragmento.",
      "[*] Seleção de Habilidades: correção da faceta Curva de Aprendizagem do Ogre Magi, para funcionar com todas as habilidades (requer a seleção do próprio Ogre Magi como herói).",
      "[*] Seleção de Habilidades: correção de diversos casos de talentos faltantes ou adicionados incorretamente.",
      "[*] Tesouro Heroico Primaveril de 2025: correção das configurações de troca e presenteamento.",
      "[*] Redução da possibilidade do sugestor de itens do Dota+ ficar sem itens de minutos finais na lista.",
      "[*] Correção da compra de múltiplos itens sugeridos pelo Dota+ ao clicar rápido neles na compra rápida.",
      "[/list]"
    ],
    "commentcount": 98,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 922,
    "votedowncount": 75,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1748628321,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 922,
  "votes_down": 75,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}