{
  "gid": "536603447519085191",
  "clan_steamid": "103582791433224455",
  "event_name": "7.39b játékmenet-frissítés",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1748561760,
  "rtime32_end_time": 1748566801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6e53d7927d69d5f86dd05f8fd155c0956efd43aa.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1748537036
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1748543252
      },
      {
        "strSteamID": "76561198028025765",
        "rtUpdated": 1748471891
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1748548365
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1748551763
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1748562000
      },
      {
        "strSteamID": "76561197969266938",
        "rtUpdated": 1748559764
      }
    ],
    "clone_from_event_gid": "536597739399545003",
    "clone_from_sale_enabled": false,
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "536603447519085192",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "7.39b játékmenet-frissítés",
    "posttime": 1748561762,
    "updatetime": 1748562000,
    "body": [
      "Megjelent a 7.39b frissítés, és a frissítésjegyzéket [url=https://www.dota2.com/patches/7.38c]itt tudod megnézni[/url].",
      "Emellett, az elmúlt néhány napban orvosoltuk a következő problémákat:",
      "[list]",
      "[*] Javítottunk több különféle kliens- és szerverösszeomlást.",
      "[*] Javítottunk különféle összeomlásokat az új Beállítások menü kapcsán.",
      "[*] Javítottunk egy problémát egész tárgyak mozgatásakor a Gyorsvételben.",
      "[*] Javítottuk, hogy a Gyors-varázslás legördülő menü nem jelent meg, amikor a Közvetlen varázslási kiosztásokban a Gyors-varázslás kiválasztásnál voltál.",
      "[*] Javítottuk, egy hibát, aminél a hősön, Spirit Bearen vagy a futáron kívül más egységek is tudtak tárgyakat vásárolni a Gyorsvételben.",
      "[*] Javítottunk egy hibát, aminél a futár tárgyakat tudott kivenni a talonból, amikor a Titkos boltnál volt.",
      "[*] Javítottuk, hogy az Alt módosítóhoz rendelt billentyűk más műveleteket is aktiváltak.",
      "[*] Javítottuk, hogy a Hálózat minősége beállítás nem alkalmazódott.",
      "[*] Újra hozzáadtuk a hiányzó beállításokat, mint például az egységvizsgáló panel engedélyezését, a Besorolt rendelések mutatását a HUD-on és a képességvideók engedélyezését a képességleírásokban.",
      "[*] Bevezettünk egy új beállítást az egységenkénti gyorsbillentyűk kikapcsolására egyedi játékokban.",
      "[*] Javítottuk, hogy a Town Portal Scrollt és a semleges tárgyat nem lehetett a közvetlen varázslási kiosztásokhoz rendelni.",
      "[*] Javítottunk egy hibát, aminél a Tárgyak átadása futárképesség a talonból vette fel a tárgyakat, amikor a futár egy bolt hatósugarában volt.",
      "[*] Javítottuk, hogy átvétel után a futár nem vette figyelembe a besorolt rendeléseket.",
      "[*] Javítottuk a játékkliens összeomlását, amikor áthúztál egy tárgyat a felszerelésedből a jelenlegi tárgyútmutatódba, miközben az szerkesztés módba volt állítva.",
      "[*] Javítottuk, hogy a Teljes képernyős fényerőcsúszka fordítva volt.",
      "[*] Kijavítottuk, hogy a JáR újrakalibrálása gomb nem működött.",
      "[*] Javítottunk egy hibát, aminél a hősök néha végleg halálátmeneti állapotban ragadhattak, ha a haláluk a Vhoul Assassin Envenomed Weapon gyengítése, vagy más negatív életerő-helyreállítási forrás hatása alatt következett be.",
      "[*] Javítottuk, hogy a Beállítások billentyű-hozzárendelője blokkolta a bevitelt, ha Beállításokat billentyű-hozzárendelés közben bezárták.",
      "[*] Javítottuk, hogy a futár nem vette fel a talont, amikor a Forrás elhagyásakor utasították szállításra.",
      "[*] Az „Az épületek tartást/visszavonást igényelnek” beállítást átneveztük „Az épületek elfoglalásának leállítása tartást/visszavonást igényelre”.",
      "[*] \"Az épületek elfoglalásának leállítása tartást/visszavonást igényel” mostantól csak a Figyelők és Helyőrségek elfoglalására vonatkozik. Az Ikertornyok és Underlord Fiend's Gate-jének fenntartásmegszakítási viselkedése vissza lett állítva az „A teleportálás tartást/megállást igényel a megszakításhoz” viselkedésre.",
      "[*] A futár mostantól folytatja az utolsó parancs végrehajtását, amikor automatikus szállításra kapcsolják.",
      "[*] A futár HUD-panelje mostantól külön állapotokat mutat a Titkos boltnál várakozáshoz és az általános mozgáshoz (a bolthoz menés vagy egy hősnek való kiszállítás helyett). Javítottuk, hogy egy ? jelent meg, amikor a futár hőshöz érkezési hely nélkül mozgott.",
      "[*] Javítottuk az egyedi játékok összeomlását, ha egy csapatnak hétnél több játékosa volt.",
      "[*] Javítottuk, hogy a Csapattárgyak megjelenítése kapcsoló állapota a boltban nem maradt meg.",
      "[*] Javítottuk, hogy nem lehetett kiosztani az alábbi képességeket:",
      "[list]",
      "[*] Centaur Warrunner: Work Horse",
      "[*] Disruptor: Electromagnetic Repulsion",
      "[*] Dawnbreaker: Solar Guardian",
      "[*] Timbersaw: Twisted Chakram",
      "[*] Elder Titan: Move Astral Spirit",
      "[*] Io: Spirits In és Spirits Out",
      "[*] Pangolier: Roll Up",
      "[*] Tinker: Keen Conveyance",
      "[*] Keeper of the Light: Solar Bind és Recall",
      "[/list]",
      "[*] Javítottuk, hogy Roshan Roar of Retribution képessége nem játszotta le az effektet/animációt.",
      "[*] Javítottuk, hogy a Helm of the Undying többször alkalmazta az időtartambónuszát, ha egy már halott célpontot további találatok értek.",
      "[*] Javítottuk, hogy a Helm of the Undying a közel halálos sebzést hősölésnek számolta, ami miatt túl sok további időt adott.",
      "[*] Javítottuk, hogy a Serrated Shiv találati részecskeeffektje a támadás kezdetén, nem pedig találatkor játszódott le.",
      "[*] Javítottuk, hogy a Book of the Dead nem játszott le hangot varázsláskor.",
      "[*] Javítottuk, hogy Bloodseeker Bloodrage képessége ellenségre varázsolva áthatolt a Linken's Sphere-en.",
      "[*] Javítottuk, hogy Bloodseeker Bloodrage elhallgattatása áthatolt az ellenségek gyengítésimmunitásán.",
      "[*] Javítottuk, hogy a „Hős kiválasztása” Dazzle Nothl Projection képessége során Dazzle-t választotta ki a kivetülés helyett.",
      "[*] Javítottuk, hogy Disruptor Electromagnetic Repulsion képességére a Transference vetületnél kézi varázsláskor nem hatott az újratöltődés-csökkentés.",
      "[*] Javítottuk, hogy Elder Titan lelke nem tért vissza automatikusan az Echo Stomp használatakor, amikor Elder Titannek van Shardja.",
      "[*] Javítottuk, hogy Hoodwink és Ogre Magi ultimate képességének szintje nem volt fejleszthető gyorsbillentyűvel.",
      "[*] Javítottuk, hogy Invoker irányítottan célzott Ice Wall képessége nem Invokerre merőlegesen varázsolódott, amikor az irány végpontja egy bizonyos küszöb alatt volt.",
      "[*] Javítottuk, hogy az Ióhoz kötött egységek megjelentek a háború ködében, ha részecskeeffektekkel rendelkező díszítő tárgyuk volt felszerelve.",
      "[*] Javítottuk, hogy Kez Flutter vetületének Katanája a tervezettnél kevesebb sebzést okozott.",
      "[*] Javítottuk, hogy Kez Flutter vetületének Katana sebzése egyes esetekben hatástalanul használódott el.",
      "[*] Javítottuk, hogy Kez Raven's Veil képessége újratöltődésre került, ha a Raptor Dance megszakadt.",
      "[*] Javítottuk, hogy Kez Grappling Claw lassítása akkor is el lett távolítva, amikor a támadás talált.",
      "[*] Javítottuk, hogy Kez Grappling Claw képessége nem lassított elég hosszú ideig.",
      "[*] Javítottuk, hogy Kez Raven's Veil képessége újratöltődésre került, ha a Raptor Dance megszakadt.",
      "[*] Javítottuk, hogy a Talon Toss, a Falcon Rush és a Katana felnyársalása elhasználta Kez Flutterjét.",
      "[*] Javítottuk, hogy Lone Druid Spirit Bearje nem tudott titkos boltbeli tárgyakat vásárolni a gyorsvételből.",
      "[*] Javítottuk, hogy Lone Druid Spirit Bearjének kiválasztásakor nem jelent meg a talon.",
      "[*] Javítottuk, hogy Magnus Reverse Polarity képessége nem játszotta le a bénítási animációt az ellenségeken.",
      "[*] Javítottuk, hogy Monkey King Changing of the Guard vetületének alképessége ellopható volt.",
      "[*] Javítottuk Monkey King Démoni Szélhámos díszítőjének problémáit Changing of the Guard varázslásakor.",
      "[*] Javítottuk, hogy Muerta's Quick Draw vetületének hatására a Gunslinger a kelleténél gyakrabban aktiválódott.",
      "[*] Javítottuk, hogy Muerta rossz hangot játszott le az Aghanim's Scepterrel fejlesztett Deadshot találatakor.",
      "[*] Javítottuk, hogy Necrophos Ghost Shroud képessége nem növelte a kapott gyógyítást.",
      "[*] Oracle Prognosticate világbeli rúnaidőmérői mostantól Alt-pingelhetők.",
      "[*] Javítottuk, hogy Sand King Aghanim's Scepteres Stinger képességének támadási sugara kisebb volt a tervezettnél.",
      "[*] Javítottuk, hogy Shadow Fiend Requiem of Souls képessége nem félemlítette meg az ellenségeket, ha Shadow Fiend rögtön a varázslás befejezése után meghalt.",
      "[*] Javítottuk, hogy Timbersaw Whirling Death képessége erő és univerzális hősökön a vártnál többet gyógyított.",
      "[*] Javítottuk, hogy Void Spirit Sanctuary vetülete nem növelte a védőpajzs mennyiségét.",
      "[*] Ability Draft: javítottuk, hogy az auto-varázslás átváltása a Quill Sprayen a Shard megszerzéséig ne hajtsa végre a Hairballra cserélést.",
      "[*] Ability Draft: javítottuk, hogy Ogre Magi Learning Curve vetülete mindegyik képességgel működjön (az Ogre Magi hősmodellt kell választani hozzá).",
      "[*] Ability Draft: javítottunk sok hiányzó vagy helytelenül hozzáadott Adottságot.",
      "[*] Javítottuk, hogy a 2025. tavasz – Hősök Zsákmányában először helytelen csere- és ajándékozási beállítások voltak.",
      "[*] Kevésbé valószínűvé tettük, hogy a Dota Plusz tárgyjavaslóban elfogyjanak a késői játékra javaslandó tárgyak.",
      "[*] Javítottuk, hogy a Dota Pluszban javasolt tárgyak gyorsvételénél ne legyenek duplán vásárolva tárgyak gyors kattintáskor.",
      "[/list]"
    ],
    "commentcount": 281,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1598046824_1748562266_0"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "598528021200188688",
    "event_gid": "536603447519085191",
    "voteupcount": 14268,
    "votedowncount": 1721,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598528021200188688",
  "rtime32_last_modified": 1753894925,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1748562266,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 14268,
  "votes_down": 1721,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598528021200188688",
  "clan_steamid_original": "103582791433224455"
}