{
  "gid": "4280194635677213837",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualizarea de joc 7.37b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1723662540,
  "rtime32_end_time": 1723667401,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1723591097
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723829157
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1723662558
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1723820353
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1724282289
      }
    ],
    "clone_from_event_gid": "4175480871061328922",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4280194635677213838",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualizarea de joc 7.37b",
    "posttime": 1723662559,
    "updatetime": 1724282289,
    "body": [
      "Actualizarea de joc 7.37b este disponibilă acum. Consultă detaliile actualizării [url=https://www.dota2.com/patches/7.37b?l=romanian]aici[/url].",
      "De asemenea, au fost remediate câteva erori în ultimele zile:",
      "[list]",
      "[*] A fost remediată problema în care obiectul Iron Talon putea fi afectat de amplificarea pentru vrăji și rezistența la daune.",
      "[*] A fost remediată problema în care Khanda funcționa pe iluzii (acum se comportă la fel ca Phylactery).",
      "[*] A fost remediată problema în care vederea veritabilă nu funcționa corespunzător cu fațeta Seeing Red a lui Bristleback.",
      "[*] A fost remediată problema în care abilitatea Arcane Aura a eroinei Crystal Maiden nu avea un indicator de distanță care să indice bonusul de 1.200 de unități.",
      "[*] A fost remediată problema în care Dark Willow nu putea fi țintită de către coechipieri cât timp folosea Shadow Realm.",
      "[*] A fost remediată problema în care fațeta Devil's Bargain nu funcționa dacă acesta își vindea obiectele prin intermediul curierului.",
      "[*] A fost remediată problema în care fațeta Sidestep a eroinei Drow Ranger putea fi anulată prin emiterea un ordin de atac.",
      "[*] A fost remediată problema în care fațeta Slugger a lui Earthshaker împingea inamicii aflați în viață în câteva circumstanțe rare.",
      "[*] A fost remediată o cădere care era cauzată de abilitatea Little Friends a eroinei Enchantres și oprimator.",
      "[*] A fost remediată problema în care talentul de la nivelul 10 al lui Juggernaut care îi oferă +4% daune pentru Duelist era aplicat doar după ce Juggernaut murea.",
      "[*] A fost remediată o cădere care era cauzată atunci când Lone Druid transfera obiecte unității Spirit Bear.",
      "[*] A fost remediată problema în care înlocuirile oferite de abilitatea înnăscută Gift Bearer a lui Lone Druid nu funcționau corect.",
      "[*] A fost remediată problema în care abilitatea Spear of Mars a lui Mars nu reușea uneori să ațintească una dintre ținte dacă mai multe ținte erau străpunse cu ajutorul îmbunătățirii oferite de Aghanim's Shard.",
      "[*] A fost remediată problema în care daunele abilității Gorgon's Grasp a eroinei Medusa erau reduse de blocarea daunelor fizice.",
      "[*] A fost remediată problema în care restricția de rotire aferentă abilității Gorgon's Grasp a eroinei Medusa ignora imunitatea la efecte negative.",
      "[*] A fost remediată problema în care abilitatea Morph a lui Morphling determina declanșarea obiectului Phylactery/Khanda pe eroul actual atunci când Morph era invocat pe o iluzie.",
      "[*] A fost remediată problema în care abilitatea Morph a lui Morphling declanșa blocarea vrăjilor asupra eroului actual atunci când era invocată pe o iluzie.",
      "[*] A fost remediată problema în care abilitatea Mind Flare a lui Nyx Assassin afecta mai mulți inamici dacă aceștia erau prea apropiați unul de celălalt, chiar și fără talentul de la nivelul 25.",
      "[*] A fost remediată problema în care Pugna primea suprapuneri ale unui efect misterios, care nu făcea nimic, atunci când ucidea un inamic cu Life Drain.",
      "[*] A fost remediată problema în care efectele pozitive ale abilității Take Aim a lui Sniper puteau fi descântate de aliați.",
      "[*] A fost remediată problema în care Visage și unitățile Familiar nu obțineau bonusul de daune sau reducerea de armură oferită de talentele de la nivelul 10/20.",
      "[*] A fost remediat problema în care abilitatea Gravekeeper's Cloak a lui Visage nu obținea uneori suprapuneri noi atunci când Visage nu mai era afectat de perturbare.",
      "[*] A fost remediată problema în care dacă Weaver creștea nivelul abilității Geminate Attack după ce cauza daune inamicilor cu versiunea îmbunătățită de Aghanim's Shard a abilității Shukuchi, acesta cauza atacuri multiple.",
      "[*] A fost remediată problema în care viteza de mișcare oferită de abilitatea înnăscută Easy Breezy a eroinei Windranger nu funcționa corect atunci când eroina folosea Force Boots.",
      "[/list]"
    ],
    "commentcount": 220,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_487176015_1723664376_0",
      "ModAct_873083815_1723821884_4",
      "ModAct_873083815_1723833121_4",
      "ModAct_1519738978_1724282733_4"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "4429939323288235353",
    "event_gid": "4280194635677213837",
    "voteupcount": 5149,
    "votedowncount": 758,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4429939323288235353",
  "rtime32_last_modified": 1730847160,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724282733,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "votes_up": 5149,
  "votes_down": 758,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4429939323288235353",
  "clan_steamid_original": "103582791433224455"
}