{
  "gid": "4280194635677213837",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja rozgrywki 7.37b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1723662540,
  "rtime32_end_time": 1723667401,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1723591097
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723829157
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1723662558
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1723820353
      },
      {
        "strSteamID": "76561199690380138",
        "rtUpdated": 1724282289
      }
    ],
    "clone_from_event_gid": "4175480871061328922",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4280194635677213838",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aktualizacja rozgrywki 7.37b",
    "posttime": 1723662559,
    "updatetime": 1724282289,
    "body": [
      "Aktualizacja 7.37b jest już dostępna. Listę zmian możecie sprawdzić [url=https://www.dota2.com/patches/7.37b]tutaj[/url].",
      "Dodatkowo w ciągu ostatnich dni naprawiono kilka błędów:",
      "[list]",
      "[*] Naprawiono błąd powodujący, że na przedmiot Iron Talon miały wpływ wzmocnienie zaklęć oraz odporność na obrażenia.",
      "[*] Naprawiono błąd powodujący, że przedmiot Khanda działał na iluzjach (od teraz zachowuje się tak samo jak Phylactery).",
      "[*] Naprawiono błąd powodujący, że efekt True Sight nie działał z aspektem Widzę Czerwień od Bristlebacka.",
      "[*] Naprawiono błąd powodujący, że um. Arcane Aura od Crystal Maiden nie miała wskaźnika zasięgu dla premii do regeneracji za przebywanie w odległości 1200 jednostek.",
      "[*] Naprawiono błąd powodujący, że Dark Willow po użyciu um. Shadow Realm nie mogła być obierana za cel przez sojuszników.",
      "[*] Naprawiono błąd powodujący, że aspekt Diabelska Oferta nie działał, jeśli Doom sprzedawał przedmioty przez kuriera.",
      "[*] Naprawiono błąd powodujący, że aspekt Zwód od Drow Ranger można było anulować poprzez wydanie rozkazu ataku.",
      "[*] Naprawiono błąd powodujący, że w niektórych rzadkich przypadkach aspekt Siłacz od Earthshakera nakładał efekt odepchnięcia na wrogów, którzy żyli.",
      "[*] Naprawiono błąd powodujący nieoczekiwane zamknięcie klienta związany z um. Little Friends od Enchantress i dręczycielami.",
      "[*] Naprawiono błąd powodujący, że talent Juggernauta na 10. poziomie nie nakładał dodatkowych obrażeń od um. Duelist do czasu, aż Juggernaut nie zginął.",
      "[*] Naprawiono błąd powodujący nieoczekiwane zamknięcie, gdy Lone Druid przekazywał przedmioty neutralne duchowemu niedźwiedziowi.",
      "[*] Naprawiono błąd powodujący, że um. Gift Bearer od Lone Druida nie przelosowywała neutralnych żetonów w prawidłowy sposób.",
      "[*] Naprawiono błąd powodujący, że um. Spear of Mars od Marsa czasami nie nadziewała jednego z celów, jeśli była ulepszona przez Aghanim's Shard i trafiła wiele celów.",
      "[*] Naprawiono błąd powodujący, że obrażenia z um. Gorgon's Grasp od Medusy były redukowane przez blokowanie obrażeń fizycznych.",
      "[*] Naprawiono błąd powodujący, że ograniczenie możliwości obracania się z um. Gorgon's Grasp od Medusy pomijało niewrażliwość na negatywne efekty.",
      "[*] Naprawiono błąd powodujący, że um. Morph od Morphlinga potrafiła aktywować pasywne efekty przedmiotów Phylactery i Khanda na faktycznym bohaterze, kiedy została rzucona na iluzję.",
      "[*] Naprawiono błąd powodujący, że um. Morph od Morphlinga aktywowała blokadę czarów na faktycznym bohaterze, kiedy została rzucona na iluzję.",
      "[*] Naprawiono błąd powodujący, że um. Mind Flare od Nyx Asassina czasami była nakładana na wielu wrogów, jeśli byli blisko siebie, nawet jeśli nie wybrano talentu na 25. poziomie, który by to umożliwiał.",
      "[*] Naprawiono błąd powodujący, że Pugna otrzymywał mrożącą krew w żyłach kumulującą się premię po zabiciu wroga um. Life Drain, która nie robiła niczego.",
      "[*] Naprawiono błąd powodujący, że premie przyznawane Sniperowi po użyciu um. Take Aim dało się rozproszyć przez rozproszenia rzucane przez sojuszników.",
      "[*] Naprawiono błąd powodujący, że Visage i jego chowańce nie zyskiwali premii do obrażeń ani redukcji pancerza z talentów na 10/20 poziomie.",
      "[*] Naprawiono błąd powodujący, że um. Gravekeeper's Cloak od Visage'a czasami nie zyskiwała nowych warstw, gdy Visage nie był już pod wpływem złamania.",
      "[*] Naprawiono błąd powodujący, że po tym, gdy Weaver posiadający Aghanim's Shard zadał obrażenia wrogom przez um. Shukuchi i ulepszył um. Geminate Attack, to aktywował wiele ataków z Geminate Attack.",
      "[*] Naprawiono błąd powodujący, że szybkość ruchu z um. Easy Breezy od Windranger nie działała prawidłowo, gdy miało się przedmiot Force Boots.",
      "[/list]"
    ],
    "commentcount": 220,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_487176015_1723664376_0",
      "ModAct_873083815_1723821884_4",
      "ModAct_873083815_1723833121_4",
      "ModAct_1519738978_1724282733_4"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4429939323288235353",
    "event_gid": "4280194635677213837",
    "voteupcount": 5149,
    "votedowncount": 758,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4429939323288235353",
  "rtime32_last_modified": 1730847160,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1724282733,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "unlisted": 0,
  "votes_up": 5149,
  "votes_down": 758,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4429939323288235353",
  "clan_steamid_original": "103582791433224455"
}