{
  "gid": "4280194635677213837",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização de jogabilidade 7.37b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1723662540,
  "rtime32_end_time": 1723667401,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1723591097
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723658540
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1723662558
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1723820353
      }
    ],
    "clone_from_event_gid": "4175480871061328922",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4280194635677213838",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Atualização de jogabilidade 7.37b",
    "posttime": 1723662559,
    "updatetime": 1723820353,
    "body": [
      "A atualização 7.37b já está disponível e podes ler as notas [url=https://www.dota2.com/patches/7.37b]aqui[/url].",
      "Além disso, alguns bugs foram corrigidos nos últimos dias:",
      "[list]",
      "[*] Foi corrigido um problema com o item Iron Talon, que era afetado por amplificação de feitiços e resistência a dano.",
      "[*] O item Khanda foi corrigido para deixar de funcionar em ilusões (agora tem o mesmo comportamento que Phylactery).",
      "[*] Bristleback: foi corrigido o funcionamento do efeito de visão verdadeira com a Faceta \"Seeing Red\".",
      "[*] Crystal Maiden: a habilidade Arcane Aura foi corrigida para ter um indicador de alcance para o bónus que afeta aliados dentro de um raio de 1200 unidades.",
      "[*] Dark Willow: foi corrigido um caso onde aliados podiam selecioná‑la como alvo durante o efeito de Shadow Realm.",
      "[*] Doom: foi corrigido um problema com a Faceta \"Devil's Bargain\", que não estava a funcionar se o herói vendesse itens através de um estafeta.",
      "[*] Drow Ranger: foi corrigido um caso onde era possível cancelar os efeitos da Faceta \"Sidestep\" ao dar uma ordem de ataque.",
      "[*] Earthshaker: foi corrigido um problema com a Faceta \"Slugger\", que podia arremessar inimigos vivos em situações raras.",
      "[*] Enchantress: foi corrigida uma falha crítica relacionada com a habilidade Little Friends e Tormentors.",
      "[*] Juggernaut: foi corrigido um problema com o talento de nível 10 \"Duelist: +4% de dano\", que só aplicava o dano depois de o Juggernaut morrer.",
      "[*] Lone Druid: foi corrigida uma falha crítica que ocorria ao passar itens neutros para o Spirit Bear.",
      "[*] Lone Druid: foi corrigido o funcionamento da habilidade Inata \"Gift Bearer\".",
      "[*] Mars: foi corrigido um problema com a interação entre Spear of Mars e Aghanim's Shard, onde um dos alvos não era empalado se vários alvos tivessem sido trespassados.",
      "[*] Medusa: foi corrigido um problema com a habilidade Gorgon's Grasp, cujo dano era reduzido por efeitos de bloqueio de dano físico.",
      "[*] Medusa: foi corrigido outro problema com a habilidade Gorgon's Grasp, cuja restrição de viragem estava a ignorar imunidade a debuffs.",
      "[*] Morphling: foi corrigido um problema com a habilidade Morph, que ativava os efeitos dos itens Phylactery/Khanda no herói original quando era usada numa ilusão.",
      "[*] Morphling: foi corrigido outro problema com a habilidade Morph, que ativava efeitos de bloqueio de feitiços no herói original quando era usada numa ilusão.",
      "[*] Nyx Assassin: foram corrigidos casos onde os efeitos de Mind Flare eram aplicados a vários inimigos se estivessem demasiado próximos uns dos outros, mesmo com o talento de nível 25.",
      "[*] Pugna: foi corrigido um bug que fazia com que o herói ganhasse um buff acumulável e inútil ao matar um inimigo com Life Drain.",
      "[*] Sniper: foi corrigido um bug que fazia com que os buffs de Take Aim no utilizador pudessem ser dissipados por aliados.",
      "[*] Visage: foi corrigido um problema com os talentos relevantes de nível 10 e 20, que não concediam os bónus de dano e redução de armadura ao Visage e aos Familiars.",
      "[*] Visage: foi corrigido um problema com a habilidade Gravekeeper's Cloak, que não concedia camadas novas quando o Visage deixasse de estar afetado pelo efeito Break.",
      "[*] Weaver: foi corrigido um problema onde mais ataques do que o pretendido eram desferidos se a habilidade Geminate Attack subisse de nível depois de dano ter sido causado a inimigos com Shukuchi melhorado por Aghanim's Shard.",
      "[*] Windranger: foi corrigido um problema com a habilidade Inata \"Easy Breezy\", cujo efeito de rapidez de movimento não funcionava corretamente em conjunto com o item Force Boots.",
      "[/list]"
    ],
    "commentcount": 101,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_487176015_1723664376_0",
      "mod_require_rereview"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "4429939323288235353",
    "event_gid": "4280194635677213837",
    "voteupcount": 1183,
    "votedowncount": 171,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4429939323288235353",
  "rtime32_last_modified": 1723820353,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1723664377,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 1183,
  "votes_down": 171,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4429939323288235353",
  "clan_steamid_original": "103582791433224455"
}