{
  "gid": "4280194635677213837",
  "clan_steamid": "103582791433224455",
  "event_name": "Gameplay-Update 7.37b",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1723662540,
  "rtime32_end_time": 1723667401,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "973a52b28bb0fe1073c80393cde21f6b89f75462.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1723591097
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1723658540
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1723662558
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1723820353
      }
    ],
    "clone_from_event_gid": "4175480871061328922",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4280194635677213838",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Gameplay-Update 7.37b",
    "posttime": 1723662559,
    "updatetime": 1723820353,
    "body": [
      "Das Gameplay-Update 7.37b ist jetzt verfügbar. Die Patchnotizen dazu finden Sie [url=https://www.dota2.com/patches/7.37b]hier[/url].",
      "Darüber hinaus wurden in den vergangenen Tagen einige weitere Probleme behoben:",
      "[list]",
      "[*] Fehler behoben, durch den der neutrale Gegenstand „Iron Talon“ durch Zauberverstärkung und Schadensresistenz beeinflusst werden konnte.",
      "[*] Fehler behoben, durch den der passive Effekt des Gegenstands „Khanda“ von Illusionen ausgelöst werden konnte (funktioniert jetzt wie der Gegenstand „Phylactery“).",
      "[*] Fehler behoben, durch den Klarsicht nicht ordnungsgemäß mit Bristlebacks Facette „Rotes Tuch“ funktionierte.",
      "[*] Fehler behoben, durch den für Crystal Maidens Fähigkeit „Arcane Aura“ kein Reichweitenindikator für den Bonus im Umkreis von 1200 Einheiten angezeigt wurde.",
      "[*] Fehler behoben, durch den Dark Willow nicht von Verbündeten anvisiert werden konnte, während die Fähigkeit „Shadow Realm“ aktiv war.",
      "[*] Fehler behoben, durch den der Effekt von Dooms Facette „Teufelspakt“ nicht funktionierte, wenn er Gegenstände über den Kurier verkaufte.",
      "[*] Fehler behoben, durch den der Effekt von Drow Rangers Facette „Ausweichmanöver“ durch einen Angriffsbefehl abgebrochen werden konnte.",
      "[*] Fehler behoben, durch den Gegner mit Earthshakers Facette „Schläger“ in einigen seltenen Fällen zurückgestoßen werden konnten, obwohl diese noch am Leben waren.",
      "[*] Absturz behoben, der im Zusammenhang mit Enchantress’ Fähigkeit „Little Friends“ und den Peinigern auftrat.",
      "[*] Fehler behoben, durch den Juggernauts Level-10-Talent den Schaden mit Duellant erst zufügte, wenn Juggernaut starb.",
      "[*] Absturz behoben, der auftrat, wenn Lone Druid dem Geisterbären neutrale Gegenstände übergab.",
      "[*] Fehler behoben, durch den neutrale Marken mit Lone Druids Begabung „Marken im Übärfluss“ nicht ordnungsgemäß neu gewürfelt werden konnten.",
      "[*] Fehler behoben, durch den Mars’ Fähigkeit „Spear of Mars“ gelegentlich eines der Ziele nicht an der Arenawand aufspießte, wenn Mars Aghanims Splitter besaß und mehrere Ziele getroffen wurden.",
      "[*] Fehler behoben, durch den der Schaden von Medusas Fähigkeit „Gorgon’s Grasp“ durch physischen Schadensblock reduziert wurde.",
      "[*] Fehler behoben, durch den Medusas Fähigkeit „Gorgon’s Grasp“ bewirkte, dass sich Gegner trotz Schwächungsimmunität nicht drehen konnten.",
      "[*] Fehler behoben, durch den Morphlings Fähigkeit „Morph“ den passiven Effekt der Gegenstände „Phylactery“ und „Khanda“ auf dem ursprünglichen Helden auslösten, wenn eine Illusion angegriffen wurde.",
      "[*] Fehler behoben, durch den Morphlings Fähigkeit „Morph“ Zauberblock auf dem ursprünglichen Helden auslöste, wenn eine Illusion angegriffen wurde.",
      "[*] Fehler behoben, durch den Nyx Assassins Fähigkeit „Mind Flare“ gelegentlich auch ohne das Level-25-Talent auf mehrere Gegner gewirkt werden konnte, falls diese zu nah beieinander standen.",
      "[*] Fehler behoben, durch den Pugna einen seltsamen, sich aufsummierenden Stärkungseffekt erhielt, der keinen Effekt hatte, wenn er einen Gegner mit der Fähigkeit „Life Drain“ tötete.",
      "[*] Fehler behoben, durch den Snipers eigene Stärkungseffekte seiner Fähigkeit „Take Aim“ von Verbündeten entzaubert werden konnten.",
      "[*] Fehler behoben, durch den Visage (im Gegensatz zu seinen Begleitern) den Bonusschaden und die Rüstungsreduzierung des Level-10- und Level-20-Talents nicht erhielt.",
      "[*] Fehler behoben, durch den Visages Fähigkeit „Gravekeeper’s Cloak“ gelegentlich keine neuen Schichten erhielt, wenn Visage nicht mehr unterbrochen war.",
      "[*] Fehler behoben, durch den Weavers Fähigkeit „Geminate Attack“ aufgewertet wurde, nachdem er Gegnern mit der durch Aghanims Splitter verbesserten Fähigkeit „Shukuchi“ Schaden mit dem Zwillingsangriff zugefügt hatte.",
      "[*] Fehler behoben, durch den das in Windrangers Begabung „Luftig leicht“ festgelegte min./max. Bewegungstempo nicht ordnungsgemäß mit dem Gegenstand „Force Boots“ funktionierte.",
      "[/list]"
    ],
    "commentcount": 101,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_487176015_1723664376_0",
      "mod_require_rereview"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4429939323288235353",
    "event_gid": "4280194635677213837",
    "voteupcount": 1183,
    "votedowncount": 171,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4429939323288235353",
  "rtime32_last_modified": 1723820353,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1723664377,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 1183,
  "votes_down": 171,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4429939323288235353",
  "clan_steamid_original": "103582791433224455"
}