{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Spilloppdatering 7.35d og matchmakingfunksjoner",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Spilloppdatering 7.35d og matchmakingfunksjoner",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Vi har nettopp gitt ut [url=https://www.dota2.com/patches/7.35d]spilloppdatering 7.35d[/url] (Chen fikk som fortjent), og den har også med seg noen nye funksjoner.",
      "[h2]Omarbeidet helteforbud i matchmaking[/h2]",
      "I løpet av det siste året har vi tatt [url=https://www.dota2.com/newsentry/3677788723152833273]en rekke[/url] [url=https://www.dota2.com/newsentry/3884981125532748791]synlige tiltak[/url] mot brukere av tredjepartsjuks. Etter hvert som vi undersøker hver juksemetode, har vi først og fremst fokus på å forstå hva de gjør og hvordan vi kan spore og stoppe det.  Men samtidig spør vi oss selv hvorfor noen juksere føler for å bruke disse verktøyene i utgangspunktet. Den vanligste forklaringen er «for å få en urettferdig fordel», som åpenbart strider mot ønskene til Dota-miljøet og følelsen av konkurranseånd og rettferdighet. Det er imidlertid mulig å ta lærdom av situasjonen noen ganger og bruke det til å forbedre Dota-opplevelsen for alle (eller i det minste alle som ikke er blitt utestengt for juks).",
      "Helteforbud før selve kampen er et eksempel på dette. Mange juksemetoder i fjor fokuserte på å få en fordel under forbudsfasen på ti sekunder i begynnelsen av hver kamp. Vi tok noen skritt tilbake for å se på de opprinnelige målene med denne fasen – nemlig å la spillere uttrykke hvilke helter de ikke vil spille mot, men uten å skape situasjoner der spillere med et lite helteutvalg permanent kunne bli låst ute. Vi så på noen data og spurte om det var en bedre måte å møte disse målene i tillegg til å løse andre problemer på samme tid.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Med dagens oppdatering har vi fjernet forbudsfasen i begynnelsen og erstattet den med forbudsinnstillinger lagret på kontoen. Hvis du åpner heltefanen, kan du velge fire helter du ikke vil ha i kampene. Når du blir med i en kamp i matchmaking, er det garantert at minst én av dem blir forbudt. Du kan endre liste over forbudte helter når som helst. (Hvis du lar noen plasser være tomme, er det mulige at en tom plass blir valgt som din «forbudte helt». Det er med andre ord ingen fordel å la noen plasser være tomme.)",
      "Det nye systemet løser en rekke problemer med det forrige systemet: Du kan ikke glemme å forby. Du trenger ikke finne ut at spillet noen ganger ignorerer foreslåtte forbud. Du trenger ikke stresse med å ta en rask avgjørelse som til syvende og sist vanligvis er den samme hver gang for de fleste spillere. Som en bonus gjør det også målrettede forbud umulige, enten disse forbudene er mot kjente personligheter eller tilfeldige spillere i en offentlig kamp som du har slått opp data for.",
      "Noen spillmoduser (dvs. Captains Mode, Captains Draft, Ability Draft, Turbo) hadde enten ikke forbudsfase før kampen eller hadde allerede andre forbudsregler. Disse modusene er ikke endret.",
      "[h2]Evaluering før kampen i Dota Plus[/h2]",
      "Millioner av Dota-spillere omgås matchmakingen hver dag, og hver enkelt har ulike prioriteringer når de ser etter en kamp. Noen foretrekker å komme seg inn i en kamp så raskt som mulig, og er villige til å gå med på et høyere ferdighetsavvik i kampen for å spare litt tid. Andre vil at hver kamp skal være perfekt balansert, og er villige til å vente lenger på den beste sjansen for en jevnspilt kamp. Andre spillere bryr seg mindre om ferdighetsnivået til de andre spillerne, og mye mer om personligheten og atferden i spillet.",
      "Vi har lenge hatt lyst til å lage funksjoner som lar spillere finne kamper som stemmer bedre overens med egne preferanser. Tidlige forsøk møtte på to hovedproblemer:",
      "[list]",
      "[*]For det første, selv om spillere er flinke til å beskrive preferansene sine til andre folk, er de ikke nødvendigvis så flinke til å beskrive det som inndata til en komplisert, global matchmakingalgoritme («Jeg setter ferdighetsavvik 13 % høyere enn den gjennomsnittlige Dota-spilleren!»). Hvordan kan vi lage verktøy som lar spillere uttrykke preferanser naturlig og direkte?",
      "[*]For det andre, endringer i matchmakingen påvirker alle Dota-spillere, så vi heller mot å være forsiktige. Matchmakingen prøver alltid å finne en balanse mellom enkeltspillerens preferanser og tilstanden til Dota som helhet. (Hvis kampene i Dota er dårlige, enten på grunn av for store ferdighetsspenn eller dårlig spilleratferd, er det ille for hele Dota-miljøet. Hvis hver kamp er perfekt, men tar tre timer å sette sammen, er det også ille.) Nye matchmakingfunksjoner som blir tilgjengelige for alle samtidig, risikerer å ødelegge matchmakingen, og hvis vi ødelegger den, ødelegger vi Dota. Hvordan kan vi gi ut nye matchmakingfunksjoner og finne ut hvordan de fungerer i praksis samtidig som vi ikke setter hele Dota i fare?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Innunder den nye eksperimentelle paraplyen til Dota-laben, og i første omgang begrenset til Dota Plus, gir vi ut den første utgaven av en funksjon som Dota-spillere har bedt om i lang tid: Når du finner en kamp i Dota, viser Dota Plus noen opplysninger om hvordan matchmakingen har evaluert kampen, slik som en vurdering av ferdighetsspenn og spilleres atferdspoeng. Du får sjansen til å godta den kampen eller be om å vente på en kamp som passer bedre for deg og dine preferanser.",
      "Vi var forsiktige da vi lagde denne funksjonen, slik at alle opplysningene gir spillere muligheten til å gi uttrykk for hva slags kamper de foretrekker, men uten at det skal gi et konkurransefortrinn på noen som helst måte.  Det nye vinduet kan fortelle deg om ferdighetsavviket mellom spillerne i kampen er høy eller lav, men ikke om det er laget ditt som har høyest eller lavest.",
      "Hvorfor er dette en funksjon i Dota-laben? Den eneste måten å være sikker på hvordan millioner av Dota-spillere kommer til å bruke en funksjon, er å gi den ut, så det er det vi gjør. Vi har gjort omfattende planlegging, men det er fremdeles en fare her: Vi kan ta feil om hvordan spillere kommer til å bruke funksjonen eller hvordan den påvirker den generelle matchmakingopplevelsen i Dota. Vi vil ikke la frykten for at vi [i]kan[/i] ta feil hindre oss i å gjøre noe som kan være til nytte for millioner av Dota-spillere, så vi gir ut denne funksjonen som et eksperiment. Ved å gi den ut innenfor Dota Plus begrenses tilgangen og dermed også faren for Dota generelt mens vi finner ut hvordan alle bruker den. Som med andre funksjoner i Dota-laben kommer tid og tilbakemeldinger til å avgjøre om den vokser, endres eller blir lagt på hylla.",
      "[h2]Videre[/h2]",
      "Vi vet at mange gleder seg til Kronfallet, og vi gleder oss til å få det ut til dere. Vi holder nå på med å sette kronen på verket og forventer utgivelse i midten av april. Vi sees da."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}