{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "อัปเดตเกมเพลย์ 7.35d และคุณสมบัติการค้นหาแมตช์",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060377
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711058969
      }
    ]
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "อัปเดตเกมเพลย์ 7.35d และคุณสมบัติการค้นหาแมตช์",
    "posttime": 1711060378,
    "updatetime": 1711060378,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "เราเพิ่งได้เผยแพร่[url=https://www.dota2.com/patches/7.35d]แพตช์เกมเพลย์ 7.35d[/url] (Chen สมควรโดนแล้ว) และพร้อมกับคุณสมบัติชุดใหม่",
      "[h2]ปรับการแบนฮีโร่สำหรับเกมแบบค้นหาแมตช์[/h2]",
      "ในช่วงประมาณปีที่ผ่านมา เราได้[url=https://www.dota2.com/newsentry/3677788723152833273]ดำเนินการอย่างชัดแจ้ง[/url][url=https://www.dota2.com/newsentry/3884981125532748791]หลายครั้ง[/url]ต่อผู้ใช้โปรแกรมโกงภายนอก เมื่อเราตรวจสอบแต่ละโปรแกรมโกง เราจะเน้นไปที่การทำความเข้าใจสิ่งที่โปรแกรมทำและวิธีที่เราจะติดตามและหยุดมันได้เป็นหลัก แต่ในระหว่างนั้น เรายังถามตัวเองอีกด้วยว่าทำไมคนโกงถึงรู้สึกอยากใช้เครื่องมือเหล่านี้ตั้งแต่แรก โดยคำอธิบายที่พบบ่อยที่สุดคือ \"เพื่อให้ได้เปรียบอย่างไม่ยุติธรรม\" ซึ่งเห็นได้ชัดว่าขัดแย้งกับความต้องการของชุมชน Dota รวมถึงสปิริตในการแข่งขันและความยุติธรรมโดยตรง ถึงกระนั้น บางครั้งยังมีสิ่งที่เราสามารถเรียนรู้ได้ และใช้เพื่อปรับปรุงประสบการณ์ Dota สำหรับทุกคน (หรืออย่างน้อยก็ทุกคนที่ไม่ได้โดนแบนจากการโกง)",
      "การแบนฮีโร่ก่อนเริ่มเกมถือเป็นตัวอย่างของสิ่งนี้ เครื่องมือโกงหลายตัวปีที่แล้วมุ่งเน้นไปที่การทำให้ได้เปรียบในระหว่างช่วงแบนฮีโร่ 10 วินาทีตอนเริ่มเกม เราจึงถอยกลับมาดูเป้าหมายเริ่มแรกของช่วงการแบนนี้ นั่นคือเพื่อให้ผู้เล่นแสดงความประสงค์ว่าไม่ต้องการเล่นสู้กับฮีโร่ใด แต่ต้องไม่สร้างสถานการณ์ซึ่งผู้เล่นที่มีกลุ่มฮีโร่น้อยจะถูกล็อคไม่ให้เล่นอย่างถาวร จากนั้นเราก็ดูข้อมูลบางส่วน และถามตัวเองว่าพอมีวิธีที่เราสามารถบรรลุเป้าหมายเหล่านี้ได้ดีขึ้นพร้อมกับแก้ไขปัญหาอื่นไปพร้อม ๆ กันหรือไม่",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "ในอัปเดตนี้ เราได้นำช่วงแบนฮีโร่ในตอนเริ่มแมตช์ออก และเปลี่ยนเป็นการตั้งค่าการแบนที่จัดเก็บไว้ในบัญชีของคุณ หากคุณเปิดแท็บฮีโร่ คุณจะสามารถเลือกฮีโร่ 4 ตัวที่คุณไม่อยากเจอในเกมของคุณ ระบบจะรับประกันว่าเมื่อคุณเข้าร่วมเกมแบบค้นหาแมตช์แล้ว ฮีโร่ดังกล่าวจะถูกแบนอย่างน้อย 1 ตัว คุณสามารถเปลี่ยนรายการฮีโร่ที่แบนของคุณได้ตลอดเวลาตามต้องการ (หากคุณปล่อยช่องแบนว่างไว้บางช่อง จะมีโอกาสที่ระบบเลือกช่องว่างดังกล่าวเป็น \"ฮีโร่ที่แบน\" ของคุณ กล่าวคือ การปล่อยให้มีช่องว่างไว้นั้นไม่มีข้อดีเป็นอย่างใด)",
      "ระบบใหม่นี้จะจัดการกับปัญหาหลายประการที่มีในระบบก่อนหน้านี้: คุณจะไม่มีโอกาสเผลอลืมแบน คุณไม่จำเป็นต้องมาเรียนรู้ว่าบางครั้งการแบนที่คุณเสนอนั้นเกมจะไม่นำไปแบนจริง คุณไม่ต้องมีเวลาจำกัดในการตัดสินใจที่ตึงเครียด ซึ่งท้ายที่สุดแล้ว ผู้เล่นส่วนใหญ่ก็ตัดสินใจแบบเดียวกันเกือบตลอดเวลา แถมยังมีประโยชน์เพิ่มเติม ระบบใหม่นี้ยังทำให้การแบนแบบกำหนดเป้าหมายทำไม่ได้อีกต่อไป ไม่ว่าการแบนนั้นจะเป็นการแบนต่อผู้เล่นที่เป็นที่รู้จักหรือผู้เล่นทั่วไปในแมตช์สาธารณะที่คุณสืบข้อมูลมา",
      "โหมดเกมบางโหมด (นั่นคือ Captains Mode, Captains Draft, Ability Draft, Turbo) ซึ่งไม่มีช่วงแบนตอนเริ่มเกม หรือมีระบบแบนที่ต่างจากมาตรฐานอยู่แล้วนั้น จะไม่มีการเปลี่ยนแปลง",
      "[h2]ระบบวิเคราะห์การค้นหาแมตช์ Dota Plus ก่อนเริ่มแมตช์[/h2]",
      "ผู้เล่น Dota หลายล้านคนใช้งานระบบค้นหาแมต์ในทุก ๆ วัน และทุกคนมีลำดับความสำคัญแตกต่างกันเมื่อค้นหาเกม บางคนอยากได้แมตช์เร็วที่สุดเท่าที่เป็นไปได้ และพร้อมจะยอมรับความแตกต่างในฝีมือที่มากกว่าปกติเพื่อประหยัดเวลา ส่วนบางคนอยากให้ทุกแมตช์มีความสมดุลเหมาะเหม็ง และยอมรอนานหน่อยเพื่อให้มีโอกาสได้เกมที่สูสีมากที่สุด และผู้เล่นบางคนก็ไม่ได้สนใจระดับฝีมือของผู้เล่นอื่นมากนัก แต่สนใจมารยาทและพฤติกรรมในเกมมากกว่า",
      "เรามีความต้องการมาอย่างยาวนานแล้วที่จะสร้างคุณสมบัติสำหรับให้ผู้เล่นค้นหาแมตช์ที่สอดคล้องกับความต้องการของแต่ละคนได้ดีขึ้น ความพยายามในช่วงแรกพบปัญหาหลัก 2 ประการ:",
      "[list]",
      "[*]ประการแรก แม้ว่าผู้เล่นจะอธิบายความชอบของตนให้คนอื่นฟังได้ดี แต่ก็อาจไม่สามารถอธิบายความชอบของตนเองเป็นลักษณะข้อมูลป้อนเข้าสู่อัลกอริธึมค้นหาแมตช์ทั่วโลกแสนซับซ้อนได้ (\"ฉันให้ความสำคัญกับความแปรฝันของฝีมือสูงกว่าผู้เล่น Dota ทั่วไปถึง 13%!\") เราจะสร้างเครื่องมือที่ช่วยให้ผู้เล่นปรับแต่งความชอบอย่างเป็นธรรมชาติและตรงไปตรงมาได้อย่างไร?",
      "[*]ประการที่สอง การเปลี่ยนแปลงระบบค้นหาแมตช์จะส่งผลต่อผู้เล่น Dota ทุกคน ดังนั้นเราจึงมีแนวโน้มที่จะใช้ความระมัดระวัง ระบบค้นหาแมตช์พยายามสร้างสมดุลระหว่างความชอบของผู้เล่นแต่ละคนและความสมบูรณ์ของ Dota โดยรวมอยู่เสมอ (หากแมตช์ Dota ไม่ดี ไม่ว่าจะเป็นเพราะระดับฝีมือห่างกันเกินไปหรือพฤติกรรมของผู้เล่นที่ไม่ดี ก็จะส่งผลเสียต่อ Dota ในฐานะชุมชน หากทุกแมตช์สมบูรณ์แบบ แต่ต้องใช้เวลาสร้าง 3 ชั่วโมง ก็ถือเป็นเรื่องแย่เช่นกัน) หากทุกคนสามารถใช้คุณสมบัติการค้นหาแมตช์แบบใหม่ได้พร้อมกันจะมีโอกาสเสี่ยงทำลายระบบค้นหาแมตช์ และถ้าเราทำให้ระบบพัง ก็เหมือนว่าเราทำลาย Dota เราจะจัดส่งคุณสมบัติการค้นหาแมตช์ใหม่และเรียนรู้วิธีการทำงานจริงในขณะที่คงความเสี่ยงต่อ Dota โดยรวมให้ต่ำได้อย่างไร?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "เราได้เผยแพร่คุณสมบัติเวอร์ชันแรกที่ซึ่งผู้เล่น Dota ถามเรามาตลอด โดยอยู่ภายใต้กลุ่มการทดลองใหม่ของ Dota Labs และตอนแรกจะจำกัดไว้สำหรับ Dota Plus เท่านั้น: เมื่อคุณพบแมตช์ใน Dota แล้ว Dota Plus จะนำเสนอข้อมูลบางส่วนเกี่ยวกับวิธีที่ระบบประเมินแมตช์ เช่น การประมาณช่วงฝีมือและคะแนนความประพฤติของผู้เล่น คุณจะมีโอกาสยอมรับแมตช์นั้นหรือกลับเข้าคิวเพื่อรอแมตช์ที่ดีกว่าสำหรับคุณและความชอบในปัจจุบันของคุณ",
      "เราใช้ความระมัดระวังในการสร้างคุณสมบัตินี้เพื่อให้แน่ใจว่าข้อมูลใดก็ตามที่เราแสดงจะช่วยให้ผู้เล่นสามารถแสดงความประสงค์เฉพาะตัวเกี่ยวกับประเภทของแมตช์ที่ชื่นชอบ แต่ไม่ให้ข้อได้เปรียบในการแข่งขันใด ๆ กล่องโต้ตอบใหม่จะสามารถบอกคุณว่าความแปรฝันของระดับฝีมือผู้เล่นในแมตช์นั้นสูงหรือต่ำ แต่ไม่บอกว่าคุณและทีมของคุณมีระดับสูงกว่าหรือต่ำกว่า",
      "เหตุใดจึงเป็นคุณสมบัติ Dota Labs? วิธีเดียวที่จะทราบได้อย่างแน่ชัดว่าผู้เล่น Dota หลายล้านคนจะใช้งานคุณสมบัติอย่างไร ก็คือการออกเผยแพร่คุณสมบัตินั้น จึงเป็นสิ่งที่เรากำลังทำ เราได้ทำการสร้างแบบจำลองมาอย่างมากมายแล้ว แต่ก็ยังมีความเสี่ยงที่แท้จริงอยู่: เราอาจเข้าใจผิดว่าผู้เล่นจะใช้คุณสมบัตินี้อย่างไร หรือจะส่งผลต่อประสบการณ์การค้นหาแมตช์โดยรวมใน Dota อย่างไร เราไม่อยากปล่อยให้ความกลัวที่เรา[i]อาจ[/i]ผิดพลาด มาหยุดยั้งเราไม่ให้ทำบางสิ่งที่อาจเป็นประโยชน์ต่อผู้เล่น Dota หลายล้านคนได้ ดังนั้นเราจึงจัดส่งคุณสมบัตินี้ในรูปแบบการทดลอง การเผยแพร่เฉพาะสำหรับ Dota Plus จะเป็นการจำกัดการเข้าถึง และจำกัดความเสี่ยงต่อ Dota ที่ตามมา ในระหว่างที่เราเรียนรู้ว่าทุกคนจะใช้งานกันอย่างไร เช่นเดียวกับคุณสมบัติอื่น ๆ ของ Dota Labs ข้อเสนอแนะของคุณและเวลาที่ผ่านไปจะบอกได้ว่าคุณสมบัตินี้จะเติบโต เปลี่ยนแปลง หรือต้องละทิ้งไป",
      "[h2]อนาคต[/h2]",
      "เราทราบว่าหลายคนกำลังตั้งตารอคอยอัปเดตศึกบัลลังก์วิบัติ และเราก็มุ่งตั้งใจอยากเผยแพร่สู่มือคุณ เรากำลังพัฒนาถึงในช่วงท้ายแล้ว และคาดว่าจะเผยแพร่ได้ในช่วงกลางเดือนเมษายน แล้วพบกัน"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1711060389,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}