{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Pelipäivitys 7.35d ja pelihakuominaisuudet",
  "event_type": 13,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Pelipäivitys 7.35d ja pelihakuominaisuudet",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Julkaisimme juuri [url=https://www.dota2.com/patches/7.35d]pelipäivityksen 7.35d[/url] (Chen sai, mitä tilasi). Sen mukana tulee joukko uusia ominaisuuksia.",
      "[h2]Muutoksia pelihaun sankarikieltoon[/h2]",
      "[url=https://www.dota2.com/newsentry/3884981125532748791?l=finnish]Rangaistuksia[/url] jaettiin viime vuonna [url=https://www.dota2.com/newsentry/3677788723152833273?l=finnish]useaan otteeseen[/url] kolmansien osapuolien huijauksia käyttäneille pelaajille. Jokaisen huijausohjelmiston kohdalla yritämme ensisijaisesti saada selville niiden toimintatavan ja sen, kuinka niitä voi seurata ja estää. Samalla pyrimme ymmärtämään, miksi huijarit ylipäätänsä haluavat käyttää näitä ohjelmia. Yleisin selitys on epäreilun edun saavuttaminen, joka on luonnollisesti Dota-yhteisön kilpailun ja reilun pelin periaatteiden vastaista. Aina voimme silti oppia jotain ja parantaa pelaajien Dota-kokemusta (tai ainakin niiden, jotka eivät ole saaneet pelikieltoa huijaamisesta).",
      "Strategiavaiheen sankarikiellot ovat hyvä esimerkki tästä. Viime vuonna monet huijausohjelmat keskittyivät epäreilun edun saavuttamiseen jokaista peliä edeltävässä kymmenen sekunnin sankarikieltovaiheessa. Otimme askeleen taaksepäin ja mietimme tämän vaiheen alkuperäistä tavoitetta. Tarkoitus oli tarjota pelaajille mahdollisuus valita sankarit, joita vastaan he eivät halua pelata. Emme myöskään halunneet, että pelaajat, joilla on vain vähän sankareita, jäisivät vaille pelimahdollisuuksia. Siksi tarkastelimme pelistä kerättyä dataa ja pohdimme parempia keinoja saavuttaa alkuperäiset tavoitteemme ja korjata samalla muita ongelmia.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Tämä päivitys korvaa ottelun alussa olevan kieltovaiheen tilillesi tallennettavilla kieltotoiveilla. Sankarit-välilehdeltä voit valita neljä sankaria, joita et halua nähdä otteluissasi. Jokainen pelihaun kautta pelaamasi peli kieltää automaattisesti vähintään yhden valitsemasi sankarin käytön. Voit muuttaa kieltämiäsi sankareita milloin haluat. (Jos jätät kieltopaikkoja tyhjiksi, peli saattaa kieltää tyhjän paikan. Paikkoja ei siis kannata jättää tyhjiksi.)",
      "Uusi järjestelmä ratkaisee lukuisia edellisen järjestelmän ongelmia. Enää et voi unohtaa sankareiden kieltämistä tai joudu oppimaan kantapään kautta, kuinka peli jättää kieltovalinnat joskus huomiotta. Et myöskään joudu kiirehtimään valintaasi, jota useimmat pelaajat eivät edes mieti sen tarkemmin. Lisäksi kieltoja ei voi enää kohdistaa tiettyihin pelaajiin, olipa vastassasi enemmän tai vähemmän tunnettuja vastustajia. Et saa etulyöntiasemaa tarkastelemalla toisten aiemmin käyttämiä sankareita.",
      "Joissakin pelitiloissa (kuten kapteenitilassa, kapteenin valinnassa, kykyvalinnassa tai turbopeleissä) ei joko ollut kieltovaihetta tai sankarit kiellettiin erilaisilla säännöillä. Nämä pelitilat pysyvät ennallaan.",
      "[h2]Dota Plus -pelihakuanalyysi[/h2]",
      "Dotan pelihakua käyttävät päivittäin miljoonat pelaajat, joista jokaisella on omat prioriteettinsa peliä etsiessään. Jotkut haluavat päästä peliin mahdollisimman pian ja ovat valmiita joustamaan ottelun taitotasosta aikaa säästääkseen. Toiset taas haluavat jokaisesta ottelusta täysin tasavertaisen ja ovat valmiita odottamaan pidempään. Joillekin muiden pelaajien taitotasolla ei ole väliä, vaan heille käytöksellä on enemmän merkitystä.",
      "Olemme jo kauan halunneet kehittää ominaisuuksia, joiden avulla pelaajien on helpompi löytää omiin mieltymyksiinsä sopivia otteluita. Aikaisemmin törmäsimme pääasiassa kahteen ongelmaan.",
      "[list]",
      "[*]Vaikka pelaajat osaisivat kertoa muille omista kriteereistään, niitä voi olla vaikea muuntaa monimutkaisen, dataan perustuvan pelihakualgoritmin ymmärtämään muotoon. (Esim. \"Pelaajien taitotasolla on minulle 13 % enemmän merkitystä kuin keskivertopelaajalle.\") Miten voisimme siis luoda työkaluja, joiden avulla pelaajat voisivat ilmaista mieltymyksensä luontevasti ja selvästi?",
      "[*]Toiseksi, pelihakualgoritmin muutokset vaikuttavat kaikkiin Dota-pelaajiin, joten emme toimi äkkinäisesti. Pelihakualgoritmi yrittää tasapainottaa jokaisen pelaajan mieltymykset koko Dota-yhteisön toiveiden kanssa. (Jos Dota-pelit sujuvat huonosti joko suurten tasoerojen tai huonosti käyttäytyvien pelaajien takia, se tekee hallaa koko Dota-yhteisölle. Muttei sekään ole hyväksi, jos pelit ovat täydellisiä, mutta joukkueen kokoamiseen menee kolme tuntia.) Uusien ominaisuuksien tuominen kaikkien pelaajien käytettäväksi saattaa myös rikkoa pelihakualgoritmin. Jos se hajoaa, niin hajoaa myös Dota. Miten lisätä uusia pelihakuominaisuuksia ja tarkkailla niiden toimintaa käytännössä niin, ettei koko peli kärsi?",
      "[/list]",
      "[img]{STEAM_CLAN_LOC_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Julkaisemme Dota-pajan tarjoamassa koeympäristössä (ja aluksi vain Dota Plus -tilaajille) ensimmäisen version uudesta ominaisuudesta, jota Dotan pelaajat ovat toivoneet jo vuosikausia. Kun pelihaku löytää ottelun, Dota Plus kertoo, miten joukkue muodostettiin, ja näyttää pelaajien arvioidut taitotasot ja käytöspisteet. Voit liittyä ehdotettuun peliin tai jatkaa sopivamman pelin etsimistä.",
      "Ominaisuutta kehitettiin kieli keskellä suuta, jotta mukana olevat tiedot auttaisivat pelaajia löytämään haluamansa pelit tasapuolisesti ja reilusti. Uusi ikkuna kertoo pelaajille, että taidoissa on suuri ero, muttei paljasta, onko oma vai vastustajan joukkue niskan päällä.",
      "Miksi tämä on Dota-pajan ominaisuus? Ainoa tapa selvittää, miten miljoonat Dota-pelaajat käyttävät ominaisuutta, on julkaista se. Olemme tehneet mittavia laskelmia, mutta ominaisuuteen liittyy silti riskinsä. Saatamme olla täysin väärässä siitä, miten ominaisuutta käytetään tai miten se vaikuttaa Dotan yleiseen pelihakukokemukseen. [i]Mahdollisen[/i] epäonnistumisen pelko ei saa estää meitä parantamasta miljoonien pelikokemusta. Tästä syystä ominaisuus tuodaan ensiksi koekäyttöön. Se tarjotaan vain Dota Plus -tilaajille, mikä rajoittaa riskejä, kun keräämme lisätietoa ominaisuuden toimivuudesta. Kuten muidenkin Dota-pajan ominaisuuksien kohdalla, pelaajilta saatu palaute määrittää, jatkuuko ominaisuuden kehittäminen vai kuopataanko se.",
      "[h2]Katsaus tulevaan[/h2]",
      "Tiedämme, että monet teistä odottavat jo Kruununkaappausta, joten pyrimme saamaan sen pian valmiiksi. Hiomme päivitystä paraikaa loppuun, ja tavoitteenamme on julkaista se huhtikuun puolessavälissä. Nähdään siis silloin."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}