{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Обновление 7.35d и новые функции подбора игры",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Обновление 7.35d и новые функции подбора игры",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Мы только что выпустили [url=https://www.dota2.com/patches/7.35d]обновление 7.35d[/url] (Chen получил по заслугам), а вместе с ним — новые функции.",
      "[h2]Обновлённый запрет героев при подборе игры[/h2]",
      "За прошлый год мы [url=https://www.dota2.com/newsentry/3677788723152833273]предприняли[/url] различные [url=https://www.dota2.com/newsentry/3884981125532748791]заметные меры[/url] против читеров. В расследовании читов наша основная задача — понять, что они делают и как это отследить и остановить. В то же время мы спрашиваем себя: почему кто-то в принципе считает нужным использовать такие средства? Самая частая причина — стремление заполучить нечестное преимущество, что, очевидно, противоречит желаниям нашего сообщества и лежащим в его основе чувствам соревновательности и справедливости. Тем не менее, даже из этого можно извлечь знания, которые помогут нам улучшить процесс игры для всех (не считая тех, кого заблокировали за читы).",
      "Наглядный пример — система запрета героев. В прошлом году многие читы стремились получить преимущество во время десятисекундной стадии запрета героев в начале каждой игры. Изначально эта стадия была предназначена для того, чтобы игроки могли выразить нежелание встречать определённых персонажей, а люди с малым пулом героев не оставались совсем без выбора. Взглянув на этот процесс со стороны и изучив данные, мы задались вопросом: возможно ли приблизиться к нашей цели ещё сильнее, заодно решив другие проблемы?",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "В сегодняшнем обновлении мы убрали стадию запретов в начале игры и заменили её предпочтительными запретами, привязанными к вашему аккаунту. Теперь, открыв вкладку «Герои», вы сможете выбрать до четырёх персонажей, которых не желаете видеть, и в начале подобранной игры обязательно будет запрещён хотя бы один из них. Список запретов можно менять когда угодно. (Обратите внимание, что игра может выбрать для запрета и ячейку, в которой нет героя. Следовательно, указывать меньше четырёх запретов незачем.)",
      "Новая система устраняет ряд прошлых неудобств: теперь вы не забудете запретить героя; не нужно будет знать или помнить, что иногда игра учитывает лишь некоторые запреты; не придётся второпях принимать решение, которое, как правило, почти никогда не меняется от игры к игре. Кроме того, теперь запреты нельзя направить на определённого игрока: как на известную личность, так и на рядового пользователя, чью информацию могли где-нибудь подсмотреть.",
      "В некоторых режимах игры (например, в Captains Mode, Captains Draft, Ability Draft и Turbo) либо не было стадии запрета, либо она работала по другим правилам. Эти режимы не изменились.",
      "[h2]Анализ подобранной игры от Dota Plus[/h2]",
      "Миллионы игроков в Доту каждый день взаимодействуют с системой подбора игр, и у каждого из них свои приоритеты. Одни хотят вступить в игру как можно скорее, принимая значительную разницу в мастерстве как плату за экономию времени, других же устраивают только идеально сбалансированные игры, ради которых можно и подождать. Кого-то и вовсе волнует не уровень игры, а характер и поведение союзников и соперников.",
      "Мы уже давно хотели создать функцию для подбора игр, лучше соответствующих личным предпочтениям, но на раннем этапе столкнулись с двумя основными проблемами:",
      "[list]",
      "[*]Во-первых, игроки хорошо умеют описывать свои предпочтения другим людям, но это отнюдь не значит, что они способны сформулировать вводные данные для комплексного глобального алгоритма (например, «Для меня отсутствие разброса в мастерстве на 13% ценнее, чем для среднего игрока в Доту»). Как нам создать инструменты, позволяющие игрокам выражать свои предпочтения естественно и прямолинейно?",
      "[*]Во-вторых, система подбора игры касается каждого, так что её нужно изменять с осторожностью. Она всегда стремится найти баланс между личными предпочтениями игроков и состоянием игры в целом. (Если подбираются плохие игры, будь то из-за огромного разрыва в мастерстве или плохого поведения игроков, сообщество Доты страдает. Но оно также страдает, если каждая игра идеальна, но её нужно ждать по три часа.) Новые функции подбора игры, доступные всем и сразу, могут нарушить работу системы и, как следствие, Доты. Как нам выпустить новые функции подбора и изучить их работу на практике, минимизируя риск для игры в целом?",
      "[/list]",
      "[img]{STEAM_CLAN_LOC_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "В экспериментальных рамках новой программы «Лаборатории Dota» (и пока что только для подписчиков Dota Plus) мы выпускаем первую версию функции, о которой игроки просили нас уже давно: теперь Dota Plus показывает такую информацию о только что найденной игре, как примерный разброс мастерства и порядочность игроков. У вас будет возможность как принять игру, так и начать поиск заново, чтобы дождаться более подходящих условий.",
      "При создании этой функции мы тщательно следили за тем, чтобы любая информация, которую мы передаём игрокам, позволяла выражать личные предпочтения, но не давала никаких конкурентных преимуществ. Новая функция сообщит вам о том, высока ли разница в мастерстве игроков, но не о том, какая из команд сильнее.",
      "Почему эта функция находится в «Лабораториях»? Потому что единственный способ узнать наверняка, как миллионы игроков в Доту воспримут ту или иную функцию, — это выпустить её. Мы провели масштабное моделирование, но всё же существует реальный риск: возможно, мы неверно понимаем, как игроки будут пользоваться этой функцией и как она повлияет на впечатления от подбора игры. Мы не хотим, чтобы [i]вероятность[/i] ошибиться помешала нам принести пользу миллионам игроков, так что выпустили эту функцию как эксперимент. Доступ только для подписчиков Dota Plus снижает не только число потенциальных тестировщиков, но и риски в отношении всей игры, пока мы наблюдаем за новой функцией. Как и в случае с другими функциями из «Лабораторий», время и отзывы покажут, расширится ли она, изменится или покинет игру.",
      "[h2]Что дальше?[/h2]",
      "Мы знаем, что многие из вас очень ждут «Павшую корону», да и мы сами ждём не дождёмся преподнести её вам. Остались лишь финальные штрихи, так что обновление выйдет примерно в середине апреля. А до тех пор — всего доброго."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}