{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização 7.35d e funcionalidades de matchmaking",
  "event_type": 13,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Atualização 7.35d e funcionalidades de matchmaking",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Acabámos de lançar a [url=https://www.dota2.com/patches/7.35d]atualização de jogabilidade 7.35d[/url] (o Chen estava a precisar) com algumas novas funcionalidades.",
      "[h2]Nova forma de banir heróis no matchmaking[/h2]",
      "Durante o último ano, tomámos [url=https://www.dota2.com/newsentry/3677788723152833273]algumas[/url] medidas [url=https://www.dota2.com/newsentry/3884981125532748791]publicamente[/url] contra jogadores que usaram software externo para fazer batota no Dota. Quando investigamos cheats, o nosso principal objetivo é perceber o que estes programas fazem e como podemos monitorizá‑los e impedir que funcionem. Contudo, durante o processo, também nos perguntamos \"O que motiva alguns batoteiros a usar estas ferramentas sequer?\". A explicação mais comum é \"para obter uma vantagem injusta\", o que obviamente vai contra os desejos da comunidade do Dota e o espírito de competividade e fair play que a define. Mesmo assim, todos estes incidentes são lições que podemos aprender e usar para melhorar a experiência do Dota para todos os jogadores (pelo menos aqueles que não foram banidos por usarem cheats).",
      "A nova possibilidade de banir heróis antes das partidas é um exemplo disso. Neste último ano, reparámos que muitos cheats se focavam em garantir uma vantagem durante os dez segundos da fase de banimento de heróis no início de cada partida. Refletimos sobre os objetivos originais desta fase: deixar que os jogadores indiquem os heróis contra os quais preferem não jogar, sem criar situações onde os jogadores que só costumam jogar com muito poucos heróis nunca os pudessem usar. Analisámos alguns dados e começámos a pensar numa forma de cumprir estes objetivos e solucionar outros problemas ao mesmo tempo.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Na atualização de hoje, removemos a fase de banimento de heróis no início das partidas e substituímo‑la por preferências de banimentos associadas à tua conta. No separador de heróis, podes selecionar os quatro heróis que não queres enfrentar nas tuas partidas. O sistema garante que, ao entrares numa partida criada via matchmaking, pelo menos um desses heróis será banido. Podes alterar a tua lista de heróis banidos sempre que quiseres. (Se não banires exatamente quatro heróis, é possível que as vagas vazias sejam selecionadas como os teus \"heróis banidos\". Por outras palavras, deixar vagas vazias não oferece nenhuma vantagem.)",
      "Este novo sistema tenta resolver vários problemas do sistema anterior: não te vais esquecer de banir heróis; não tens de aprender que alguns banimentos sugeridos são ignorados pelo jogo; não estás numa corrida contra o tempo para tomar uma decisão stressante que, vendo bem, é quase sempre a mesma para todos. E também tem uma vantagem adicional: impossibilita banimentos contra jogadores específicos, quer sejam eles personalidades famosas ou pessoas aleatórias numa partida pública cujos dados foste pesquisar.",
      "Alguns modos de jogo (Modo de Capitães, Seleção dos Capitães, Seleção de Habilidades, Turbo) não tinham uma fase de banimento pré‑partida ou já tinham regras separadas. Estes modos não foram alterados.",
      "[h2]Análise pré‑partida do Dota Plus[/h2]",
      "Milhões de jogadores do Dota interagem com o sistema de matchmaking diariamente e cada um tem prioridades diferentes ao procurar uma partida. Alguns preferem entrar numa partida o mais rápido possível e estão dispostos a aceitar uma maior variação na habilidade para poupar tempo. Outros desejam que cada partida seja perfeitamente equilibrada e não se importam de esperar mais tempo para terem mais chances de jogar uma partida renhida. Já outros jogadores preocupam‑se menos com o nível de habilidade e mais com a personalidade e o comportamento dos outros participantes na partida.",
      "Há muito tempo que queríamos implementar funcionalidades que permitem aos jogadores encontrar partidas mais alinhadas às respetivas preferências individuais. As nossas tentativas iniciais tinham dois grandes problemas:",
      "[list]",
      "[*]Primeiro, embora os jogadores sejam bons a descrever preferências para outras pessoas, não são necessariamente bons a descrevê‑las para um algoritmo de matchmaking global e complexo (\"A importância que dou à variação na habilidade é 13% maior do que a do jogador médio do Dota!\"). Como podemos criar ferramentas que permitem aos jogadores exprimir preferências de forma natural e direta?",
      "[*]Segundo, quaisquer alterações ao matchmaking afetam todos os jogadores do Dota e, por isso, tentamos sempre proceder com prudência. O matchmaking está sempre a tentar alcançar um equilíbrio entre as preferências individuais dos jogadores e o bem‑estar do Dota como um todo. (Se as partidas do Dota forem más, quer seja devido a grandes variações na habilidade ou ao comportamento inadequado dos jogadores, isso é mau para o Dota enquanto comunidade. E se todas as partidas forem perfeitas, mas demorarem três horas para juntarem os jogadores primeiro, isso também é mau sinal.) Disponibilizar novas funcionalidades de matchmaking para todos os jogadores de uma só vez pode estragar o sistema de matchmaking e, se isso acontecer, estragamos o Dota. Como poderemos lançar novas funcionalidades de matchmaking e analisar como funcionam na prática sem trazer grandes riscos para o Dota?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Disponível como uma experiência do Dota Labs e inicialmente exclusiva para membros do Dota Plus, a primeira versão de uma funcionalidade muito pedida pelos jogadores do Dota está agora disponível: quando o matchmaking encontra uma partida para ti, o Dota Plus irá apresentar informações sobre como o sistema de matchmaking avaliou a partida, como uma estimativa do nível de habilidade e o comportamento dos jogadores. De seguida, poderás aceitar essa partida ou voltar à fila para esperares por uma partida mais adequada às tuas preferências.",
      "Fomos rigorosos durante o desenvolvimento desta funcionalidade para garantirmos que todas as informações incluídas permitam aos jogadores exprimir preferências individuais sobre o tipo de partidas que preferem jogar, mas sem oferecer algum tipo de vantagem competitiva. A nova janela pode informar que a variação na habilidade dos jogadores da partida é alta ou baixa, mas não diz em qual das equipas estão os melhores jogadores.",
      "Porque é que esta funcionalidade é uma experiência do Dota Labs? Para sabermos com exatidão como milhões de jogadores do Dota irão interagir com uma funcionalidade, temos de a lançar primeiro. Estudámos inúmeros modelos, mas ainda existe um risco real: podemos estar enganados sobre como os jogadores irão usar esta funcionalidade ou como irá afetar a experiência geral de matchmaking do Dota. Este receio de que [i]podemos[/i] estar enganados não nos devia impedir de fazer algo vantanjoso para milhões de jogadores do Dota e, portanto, decidimos lançar esta funcionalidade como uma experiência. Lançá‑la dentro do Dota Plus limita o acesso e, como consequência, limita os riscos para o Dota enquanto avaliamos como os jogadores interagem com a funcionalidade. Tal como acontece com as outras funcionalidades do Dota Labs, o tempo e os comentários da comunidade irão ditar se irá evoluir, como será alterada ou se será removida.",
      "[h2]O futuro[/h2]",
      "Sabemos que muitos jogadores estão ansiosos pela nova atualização Crownfall e nós também estamos ansiosos para a publicar. Só precisamos de dar uns retoques finais e prevemos lançá‑la em meados de abril. Vemo‑nos daqui a umas semanas."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}