{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "7.35d játékmenet-frissítés és játékkeresési funkciók",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060377
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711058969
      }
    ]
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "7.35d játékmenet-frissítés és játékkeresési funkciók",
    "posttime": 1711060378,
    "updatetime": 1711060378,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Most adtuk ki a [url=https://www.dota2.com/patches/7.35d]7.35d játékmenet-frissítést[/url] (Chen már megérdemelte), és azzal együtt egy adag új funkciót.",
      "[h2]A játékkeresés hőstiltásának átdolgozása[/h2]",
      "Az elmúlt év során [url=https://www.dota2.com/newsentry/3677788723152833273]számos[/url] látható [url=https://www.dota2.com/newsentry/3884981125532748791]lépést[/url] tettünk a külső csalásokat használó játékosok ellen. Az egyes csalásokat vizsgálva elsősorban annak megértésére koncentrálunk, hogy mit csinálnak, és hogyan tudjuk lekövetni és megállítani őket. De miközben ezt tesszük, azt is megkérdezzük magunktól, hogy egyáltalán miért éreznek késztetést a csalók ezeknek az eszközöknek a használatára. A leggyakoribb magyarázat a „tisztességtelen előny szerzése”, ami nyilvánvalóan szembemegy a Dota közösség kívánságával, és az annak lelkét jelentő versenyszellemmel és tisztességességgel. De néha így is megtudunk belőlük dolgokat, amiket használhatunk a Dota élmény javítására mindenkinek (vagy legalábbis azoknak, akiket nem tiltottunk ki csalásért).",
      "A játék előtti hőstiltások ennek egy példája. Tavaly sok csalás koncentrált a meccsek eleji, tíz másodperces hőstiltási szakasz során való előnyszerzésre. Hátrébb léptünk, megnézni e szakasz eredeti céljait – hagyni a játékosokat jelezni preferenciáikat, hogy mely hősök ellen nem akarnak játszani, de olyan helyzetek teremtése nélkül, amelyekben a kis hőskészletű játékosok végérvényesen kizáródnak –, megnéztük az adatokat, és megkérdeztük magunktól: van-e rá mód, hogy jobban szolgáljuk e célokat, közben egyidejűleg más problémákat is megoldva.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "A mai frissítéssel eltávolítottuk a meccs eleji tiltási szakaszt, és lecseréltük a fiókodhoz társított tiltási preferenciákkal. Ha betöltöd a hősök fület, kiválaszthatod azt a négy hőst, amelyet nem szeretnél a játékaidban látni. Játékkereséses meccshez csatlakozáskor ezek közül egy garantáltan tiltva lesz. Tiltott hőseid listáját bármikor megváltoztathatod. (Ha néhány tiltási helyet üresen hagysz, elképzelhető, hogy az üres hely lesz kiválasztva „tiltott hősödként”. Más szóval, nincs előnye üresen hagyni a helyeket.)",
      "Ez az új rendszer a korábbi számos problémáját orvosolja: nem tudod elfelejteni a tiltást; nem kell megtanulnod, hogy a játék néha figyelmen kívül hagyja a javasolt tiltásokat; nem ketyeg az óra, hogy gyorsan hozz meg egy stresszes döntést, amelyben a játékosok többsége végül szinte mindig ugyanúgy dönt. Extra bónuszként, lehetetlenné teszi a célzott tiltást is, legyenek azok ismert személyiségek ellen, vagy véletlenszerű játékosokkal szemben nyilvános meccseken, melyekhez adatokat kerestél ki.",
      "Néhány játékmódban (pl. Captains Mode, Captains Draft, Ability Draft, Turbo) vagy nem volt játék eleji tiltási szakasz, vagy eleve nem hagyományos tiltási szabályai voltak. Ezek a módok nem változtak.",
      "[h2]Dota Plusz meccs előtti játékkeresési elemzés[/h2]",
      "Dota játékosok milliói lépnek interakcióba a játékkeresővel minden nap, és mindegyiküknek más prioritásai vannak játék keresésekor. Egyesek a lehető leggyorsabban szeretnek meccsbe kerülni, és hajlandóak nagyobb képességeltérést elfogadni a játékban, hogy időt spóroljanak. Mások azt akarják, hogy minden meccs tökéletesen kiegyensúlyozott legyen, és hajlandóak tovább várni a legjobb esélyért a legszorosabb meccsre. Megint másokat kevésbé izgat a többi játékosok ügyességszintje, és sokkal fontosabb nekik a személyiségük és játékbeli viselkedésük.",
      "Már rég akartunk olyan funkciókat készíteni, amelyekkel a játékosok az egyéni preferenciáikhoz jobban illő meccseket találhatnak. A korai kísérletek két fő problémába ütköztek:",
      "[list]",
      "[*]Először, bár a játékosok jól le tudják írni preferenciáikat más embereknek, nem feltétlenül írják le jól azokat bemenetként egy összetett, globális játékkereső algoritmusnak („13%-kal magasabb ügyességbeli eltérést szeretnék az átlag Dota játékos preferenciájához képest!”). Hogyan tudunk olyan eszközöket készíteni, amelyekkel a játékosok természetesen és közvetlenül tudják kifejezni preferenciáikat?",
      "[*]Másodszor, a játékkereső változtatásai minden Dota játékosra hatnak, így hajlunk az óvatosságra. A játékkereső mindig próbálja egyensúlyba hozni az egyes játékosok preferenciáit és a Dota egészének épségét. (Ha rosszak a Dota meccsek, akár a nagy ügyességeltérés, akár a rossz játékosviselkedés miatt, az árt a Dota közösségnek. Ha minden meccs tökéletes, de három órába telik összeállítani, az is rossz.) Ha az új játékkeresési funkciók mindenkinek elérhetők, azzal a játékkereső elrontását kockáztatjuk, és ha a játékkeresőt elrontjuk, a Dotát rontjuk el. Hogyan tudunk új játékkeresési funkciókat kiadni, és megtudni, hogyan működnek a gyakorlatban, közben alacsonyan tartva a kockázatot a Dota egészére nézve?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "A Dota Labor új kísérleti ernyője alatt, és kezdetben a Dota Pluszra korlátozva, kiadjuk egy olyan funkció első verzióját, amit a Dota játékosok örök idők óta kértek tőlünk: Amikor meccset keresel a Dotában, a Dota Plusz mutatni fog néhány információt arról, hogyan értékelte a játékkereső a meccset, például egy becsült ügyességtartományt és játékosviselkedési pontszámokat. Lehetőséged lesz elfogadni azt a meccset, vagy újból sorba állni és várni egy olyan meccsre, ami jobb neked és aktuális preferenciáidnak.",
      "Óvatosak voltunk e funkció készítésekor, hogy gondoskodjunk róla, minden mutatott információ lehetővé tegye a játékosoknak egyéni preferenciáik kifejezését az előnyben részesített meccsek kapcsán, de ne adjanak semmilyen versenyelőnyt. Az új párbeszédablak jelezni tudja, hogy a játékosok ügyességeltérése magas vagy alacsony-e a meccsben, de azt nem, hogy te és a csapatod a tartomány magas vagy alacsony részén vagytok-e.",
      "Miért lett ez Dota Labor funkció? Az egyetlen módja biztosan megtudni, hogyan fognak Dota játékosok millió interakcióba lépni egy funkcióval, ha kiadjuk azt, így hát ezt tesszük. Kiterjedt modellezést végeztünk, de a kockázat még mindig valós: tévedhetünk azzal kapcsolatban, hogyan fogják használni a játékosok ezt a funkciót, vagy hogyan fog hatni a Dota játékkeresési élményének egészére. Nem akarjuk, hogy az [i]esetleges[/i] tévedéstől való félelmünk meggátoljon abban, hogy valami olyat csináljunk, ami Dota játékosok millióinak lehet hasznára, így kísérletként adjunk ki ezt. A Dota Pluszon belül kiadás korlátozza a hozzáférést, és ennek megfelelően a Dotára jelentett kockázatot, miközben megtudjuk, hogyan használják a játékosok. Ahogy más Dota Labor funkcióknál, az idő és a visszajelzésetek dönti majd el, hogy továbbfejlesztjük, változtatunk rajta, vagy kivezetjük.",
      "[h2]A továbbiakban[/h2]",
      "Tudjuk, hogy sokan várjátok már a Trónfosztást, és mi is várjuk, hogy kiadhassuk nektek. Az utolsó simításokon dolgozunk, és április közepi megjelenésre számítunk. Akkor találkozunk."
    ],
    "commentcount": 1,
    "tags": [],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1711060399,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}