{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Speluppdatering 7.35d och matchningsfunktioner",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060377
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711058969
      }
    ]
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Speluppdatering 7.35d och matchningsfunktioner",
    "posttime": 1711060378,
    "updatetime": 1711060378,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Vi har precis släppt [url=https://www.dota2.com/patches/7.35d]Speluppdatering 7.35d[/url] (Chen fick vad han förtjänade), och med den en ny uppsättning funktioner.",
      "[h2]Omarbetning av hjälteförbud i matchning[/h2]",
      "Under det senaste året eller så har vi vidtagit [url=https://www.dota2.com/newsentry/3677788723152833273]ett antal[/url] [url=https://www.dota2.com/newsentry/ 3884981125532748791]synliga åtgärder[/url] mot användare av tredjepartsfusk. När vi undersöker de olika fusken försöker vi först och främst att förstå vad de gör och hur vi kan spåra och få stopp på det. Men medan vi gör det frågar vi oss även varför vissa fuskare känner sig tvungna att använda dessa verktyg överhuvudtaget. Den vanligaste förklaringen är att ”få en orättvis fördel”, vilket helt klart strider mot både Dota-gemenskapens önskemål och sund tävlingsanda. Ibland finns det dock fortfarande saker vi kan lära oss från fuskarna, vilket vi kan använda för att förbättra Dota-upplevelsen för alla (eller åtminstone alla som inte har blivit avstängda för fusk).",
      "Hjälteförbud före matchen är ett exempel på detta. Många fusk förra året fokuserade på att få en fördel under den tio sekunder långa hjälteförbudsfasen i början av varje match. Vi tog ett steg tillbaka för att titta på de ursprungliga målen för fasen: att låta spelare uttrycka en preferens för vilka hjältar de inte vill spela mot, men utan att skapa scenarier där spelare med små hjältesamlingar permanent blir utelåsta. Vi tittade på data och frågade oss om det fanns ett sätt att bättre kunna tjäna dessa syften och samtidigt lösa andra problem.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Med dagens uppdatering har vi tagit bort förbudsfasen och ersatt den med förbudsinställningar lagrade på ditt konto. Om du öppnar hjältefliken kan du välja vilka fyra hjältar som du inte vill se i dina matcher. När du går med i en matchningsmatch är du garanterad att minst en av dem är förbjuden. Du kan ändra din lista över förbjudna hjältar när du vill. (Om du lämnar vissa platser tomma är det möjligt att den tomma platsen väljs som din ”förbjudna hjälte”. Med andra ord finns det ingen fördel med att lämna platser tomma.)",
      "Detta nya system tar itu med ett antal problem som det tidigare systemet hade: du kan inte glömma att förbjuda, du behöver inte lära dig att föreslagna förbud ibland ignoreras av spelet och du är inte under tidspress för att fatta ett beslut som de flesta spelare i slutändan gör på samma sätt nästan varje gång. Som en bonus blir det omöjligt att göra riktade förbud, oavsett om förbuden är mot kända personligheter eller slumpmässiga spelare i en offentlig match som man har letat upp data för.",
      "Vissa spellägen (t.ex. Captains Mode, Captains Draft, Ability Draft, Turbo) hade antingen inte en förbudsfas före matchen eller hade redan icke-standardiserade förbudsregler. Dessa lägen är oförändrade.",
      "[h2]Analys före match för Dota Plus[/h2]",
      "Miljontals Dota-spelare interagerar med matchningsfunktionen varje dag och var och en har olika prioriteringar när de letar efter en match. Vissa föredrar att komma in i en match så snabbt som möjligt och är villiga att acceptera en större skicklighetsvariation i matchen för att spara lite tid. Andra vill att varje match ska vara perfekt balanserad, och är villiga att vänta längre på bästa chans för det. Andra spelare bryr sig mindre om andra spelares skicklighetsnivå och mycket mer om deras personlighet och beteende i spelet.",
      "Vi har länge velat bygga funktioner för att låta spelare hitta matchningar som bättre överensstämmer med deras individuella preferenser. Tidiga försök stötte på två huvudproblem:",
      "[list]",
      "[*]För det första, även om spelare är bra på att beskriva sina preferenser för andra människor, är de inte nödvändigtvis bra på att beskriva sina preferenser som indata till en komplex, global matchningsalgoritm (”Jag värdesätter skicklighetsvarians 13 % högre än den genomsnittliga Dota-spelaren!”). Hur kan vi skapa verktyg som låter spelare uttrycka sina preferenser naturligt och direkt?",
      "[*]För det andra påverkar förändringar i matchningen alla Dota-spelare, så vi tenderar att gå försiktigt till väga. Matchningsfunktionen försöker alltid att hitta en balans mellan individuella spelares preferenser och spelets kvalitet som helhet. (Om matcher i Dota är dåliga, oavsett om det är på grund av stora skicklighetsklyftor eller störande spelarbeteende, är det inte bra för Dota som en gemenskap. Det är inte heller bra om varje match är perfekt, men tar tre timmar att sätta samman.) Nya matchningsfunktioner som blir tillgängliga för alla på en gång riskerar att förstöra matchningen, vilket i sin tur riskerar att förstöra Dota. Hur kan vi leverera nya matchningsfunktioner och lära oss hur de fungerar i praktiken samtidigt som vi minimerar risken för Dota som helhet?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Inom Dota Labs nya experimentella ram, och initialt begränsat till Dota Plus, skickar vi den första utgåvan av en funktion som Dota-spelare har bett oss om: när du hittar en matchning kommer Dota Plus att presentera lite information om hur matchningsfunktionen utvärderade matchen, såsom en uppskattning av skicklighetsspann och spelares beteendepoäng. Du har en chans att acceptera den matchen eller återgå till kön för att vänta på en match som är bättre för dig och dina nuvarande preferenser.",
      "Vi var försiktiga när vi byggde den här funktionen för att se till att all information vi inkluderade skulle göra det möjligt för spelare att uttrycka individuella preferenser om vilken typ av matcher de föredrar, men inte ge någon sorts konkurrensfördel. Den nya dialogrutan kan tala om att skicklighetsspannen för spelare i en match är hög eller låg, men inte om du och ditt lag är i den högre eller den lägre delen.",
      "Varför är detta en Dota Labs-funktion? Det enda sättet att säkert veta hur miljontals Dota-spelare kommer att interagera med en funktion är att leverera den, så det är vad vi gör. Vi har gjort omfattande modellarbete, men det finns fortfarande en verklig risk här: vi kan ha fel om hur spelare kommer att använda funktionen eller hur den kommer att påverka den övergripande matchningsupplevelsen i Dota. Vi vill inte låta dessa farhågor om att vi [i]kan[/i] ha fel hindra oss från att göra något som kan gynna miljontals Dota-spelare, så vi levererar därför funktionen som ett experiment. Den levereras inuti Dota Plus, vilket begränsar åtkomsten och därmed också faran för Dota medan vi lär oss om hur alla interagerar med den. Precis som med de andra Dota Labs-funktionerna, kommer det med tiden och er feedback att visa sig om den ska växa, förändras eller läggas på hyllan.",
      "[h2]Framöver[/h2]",
      "Vi vet att många av er ser fram emot Crownfall, och vi ser fram emot att få ut den till er. Vi arbetar för närvarande med de sista detaljerna och räknar med att uppdateringen släpps i mitten av april. Vi ses då."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1711060378,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}