{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Gameplayupdate 7.35d en matchmakingfuncties",
  "event_type": 13,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Gameplayupdate 7.35d en matchmakingfuncties",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "We hebben zojuist [url=https://www.dota2.com/patches/7.35d]gameplayupdate 7.35d[/url] uitgebracht (dat had Chen moeten zien aankomen) en een aantal nieuwe functies geïntroduceerd.",
      "[h2]Wijzigingen voor heldenverbanning bij matchmaking[/h2]",
      "Het afgelopen jaar hebben we [url=https://www.dota2.com/newsentry/3677788723152833273]een aantal[/url] zichtbare [url=https://www.dota2.com/newsentry/3884981125532748791]stappen[/url] genomen tegen spelers die cheats van derden gebruiken. We onderzoeken iedere cheat en proberen daarbij vooral te begrijpen wat ze doen en hoe we de cheats kunnen opsporen en tegenhouden. We blijven ons echter ook afvragen waarom valsspelers deze hulpmiddelen überhaupt gebruiken. De meest gangbare uitleg is dat ze uit zijn op een 'oneerlijk voordeel', wat natuurlijk indruist tegen alles waar de Dota-community voor staat en de drang naar eerlijke competitie die daaraan ten grondslag ligt. Toch zijn er altijd dingen die we kunnen bijleren om de Dota-ervaring voor iedereen te verbeteren (in ieder geval voor iedereen die niet is verbannen vanwege valsspelen).",
      "Het verbannen van helden is hier een goed voorbeeld van. Veel cheats vorig jaar waren gericht op het afdwingen van een voordeel tijdens de verbanningsfase van 10 seconden voor de start van ieder spel. We hebben een stapje terug gedaan en eens goed gekeken naar de oorspronkelijke bedoeling van die fase. Deze optie was bedoeld om spelers de kans te geven bepaalde helden te verbannen waar ze liever niet tegen wilden spelen, maar het was niet de bedoeling dat spelers met een beperkte heldenselectie volledig buiten spel gezet konden worden. We hebben de gegevens geanalyseerd en zijn vervolgens op zoek gegaan naar een betere manier om deze doelen te bereiken en tegelijkertijd een paar van de bijkomende problemen op te lossen.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Na de update van vandaag is de verbanningsfase aan het begin van het spel voorgoed verleden tijd. In plaats daarvan kun je nu verbanningsvoorkeuren opgeven in je account. Als je het heldentabblad opent, kun je vier helden selecteren die je niet in je spellen wilt tegenkomen. Als je via matchmaking een spel speelt, is één van die helden gegarandeerd verbannen. Je kunt je lijst van verbannen helden op ieder gewenst moment aanpassen. (Als je minder dan vier helden selecteert, is het mogelijk dat de lege plek wordt gekozen als je 'verbannen held'. Het is dus niet in je voordeel om plekken leeg te laten.)",
      "Dit nieuwe systeem rekent af met een aantal problemen die in het oude systeem bestonden: je kunt niet vergeten een held te verbannen, je hoeft er niet achter te komen dat voorgestelde verbanningen soms door het spel worden genegeerd en het is geen race tegen de klok om een stressvolle beslissing te nemen die voor de meeste spelers eigenlijk altijd hetzelfde is. Een bijkomend voordeel is dat het gerichte verbanningen onmogelijk maakt, of het daarbij nu gaat om bekende personen of willekeurige spelers in een openbaar spel waarvoor je gegevens kunt opzoeken.",
      "Sommige spelmodi (namelijk Aanvoerdersmodus, Aanvoerderstrekking, Vaardigheidstrekking en Turbo) hadden al geen verbanningsfase voor het spel of hebben eigen verbanningsregels. Voor deze modi verandert er niets.",
      "[h2]Matchmaker-analyse voorafgaand aan spellen in Dota Plus[/h2]",
      "Iedere dag gebruiken miljoenen Dota-spelers de matchmaker en iedereen heeft zo zijn eigen prioriteiten bij het zoeken naar een spel. Sommige spelers willen zo snel mogelijk matchen en zijn bereid om een groot verschil in spelvaardigheid te accepteren. Anderen zijn bij ieder spel op zoek naar de perfecte balans en vinden het niet erg om wat langer te wachten als ze dan de beste kans maken op een gelijkwaardig spel. Weer anderen zijn niet zo bezig met het vaardigheidsniveau van hun tegenstanders, maar hechten meer waarde aan persoonlijkheid en gedrag in het spel.",
      "We willen al heel lang functies ontwikkelen die ervoor zorgen dat spelers matches krijgen die beter aansluiten bij hun persoonlijke voorkeuren. Bij onze eerdere pogingen deden zich twee problemen voor:",
      "[list]",
      "[*]Ten eerste, hoewel spelers hun voorkeuren goed kunnen uitleggen aan andere mensen, zijn ze niet altijd even goed in het omzetten van die voorkeuren naar een complex algoritme voor matchmaking ('ik hecht 13% meer waarde aan vaardigheidsverschil dan de gemiddelde Dota-speler!'). Welke hulpmiddelen kunnen we maken om spelers hun voorkeuren op een natuurlijke en rechtstreekse manier te laten uitdrukken?",
      "[*]Ten tweede moeten we niet vergeten dat wijzigingen aan de matchmaker van invloed zijn op de spelervaring van alle Dota-spelers. Daarom zijn we daar terughoudend in. De matchmaker moet altijd een balans zien te vinden tussen de voorkeuren van de individuele speler en het welzijn van Dota in zijn geheel. (Als de matches in Dota van slechte kwaliteit zijn, vanwege enorme verschillen in vaardigheid of slecht spelergedrag, dan is dat slecht voor Dota als community. Als iedere match perfect is, maar het duurt drie uur voordat je een match hebt gevonden, is dat ook niet goed.) Als we nieuwe matchmakerfuncties in één keer voor iedereen tegelijk beschikbaar maken, lopen we het risico dat de matchmaker het niet meer doet. En als dat gebeurt, doet heel Dota het niet meer. Hoe kunnen we nieuwe matchmakerfuncties uitbrengen en zien hoe ze in de praktijk werken, en toch het risico voor Dota in zijn geheel laag houden?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Onder de nieuwe experimentele paraplu van Dota Labs brengen we vandaag, in eerste instantie exclusief voor Dota Plus, de eerste versie uit van een functie waar Dota-spelers al jaren om vragen: als je een match vindt in Dota, geeft Dota Plus je nu achtergrondinformatie over hoe de matchmaker de match inschat, een schatting van het vaardigheidsbereik en de gedragsscores van de spelers. Je krijgt de keuze om die match te accepteren of om weer terug te gaan naar de wachtrij en te wachten op een andere match die beter bij jou en je huidige voorkeuren aansluit.",
      "Bij het ontwerpen van deze functie zijn we voorzichtig geweest met de hoeveelheid informatie die we beschikbaar stellen, zodat spelers wel hun individuele voorkeuren kunnen opgeven over het soort spellen dat ze willen spelen, maar dat niemand ook maar enig competitief voordeel krijgt dankzij die informatie. Het nieuwe dialoogvenster kan bijvoorbeeld aangeven dat het vaardigheidsverschil tussen spelers in een spel groot of klein is, maar niet of jij en je team aan de hoge of lage kant zitten.",
      "Waarom is dit een Dota Labs-functie? De enige manier om er echt achter te komen hoe miljoenen Dota-spelers een functie zullen gebruiken, is door die functie uit te brengen. Dus dat doen we nu. We hebben uitgebreid met modellen getest, maar er is nog steeds een reëel risico: we kunnen de manier waarop spelers deze functie zullen gebruiken of de invloed op de matchmaking in het algemeen, helemaal verkeerd ingeschat hebben. We willen de angst dat we het [i]misschien[/i] bij het verkeerde eind hebben niet in de weg laten staan van een oplossing waar miljoenen Dota-spelers profijt van kunnen hebben, dus we hebben ervoor gekozen om dit als experiment uit te brengen. Door de release te beperken tot Dota Plus wordt de toegang beperkt en daarmee ook het risico voor Dota tijdens deze eerste fase waarin we observeren hoe de functie wordt gebruikt. Net als bij alle andere Dota Labs-functies, hangt de beslissing om de functie verder uit te werken, te wijzigen of weer te verwijderen, volledig af van het gebruik en jullie feedback.",
      "[h2]Een blik vooruit[/h2]",
      "We weten dat velen van jullie met ongeduld uitkijken naar Crownfall en wij kunnen niet wachten om die update met jullie te delen. We zetten de laatste puntjes op de i en verwachten de release in midden april. Tot dan."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}