{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Ігроладне оновлення 7.35d і функції пошуку матчів",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ігроладне оновлення 7.35d і функції пошуку матчів",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Ми щойно випустили [url=https://www.dota2.com/patches/7.35d]ігроладне оновлення 7.35d[/url] (Чен отримав по заслугах), а з ним — нові функції.",
      "[h2]Перероблене блокування героїв під час пошуку матчів[/h2]",
      "Упродовж минулого року ми [url=https://www.dota2.com/newsentry/3677788723152833273]здійснили[/url] низку [url=https://www.dota2.com/newsentry/3884981125532748791]помітних дій[/url] у боротьбі з користувачами чітерського стороннього програмного забезпечення. Під час вивчення кожного чіта ми передусім прагнемо зрозуміти, що він робить і як це відстежити та зупинити. Водночас ми також запитуємо себе: звідки в чітерів виникає потреба користуватися цими інструментами? Найчастіше пояснення — задля отримання нечесної переваги. Це, очевидно, суперечить бажанням спільноти Dota й відчуттям змагальності та справедливості, які лежать у її основі. Та попри все, з цього можна отримати відомості, які допоможуть нам покращити досвід гри в Dota для всіх (окрім тих, кого ми заблокували за чітерство).",
      "Прикладом цього є завчасне блокування героїв. Минулого року багато чітів спрямовувалися на отримання переваги під час десятисекундної стадії блокувань на початку кожної гри. Ми вирішили детальніше розглянути початкову ціль цієї фази. Вона мала дозволити гравцям вказати, проти яких героїв вони не хочуть грати, але без створення ситуацій, коли гравці з малим набором героїв завжди лишатимуться без вибору. Ми подивилися на деякі дані й запитали себе, чи є спосіб, яким можна краще досягти цієї цілі й водночас вирішити інші проблеми.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "У сьогоднішньому оновленні ми прибрали стадію блокування на початку гри й замінили її на завчасні блокування, що зберігаються для вашого акаунта. На вкладці «Герої» ви можете обрати до чотирьох героїв, яких не хочете бачити у ваших іграх. На початку знайденого матчу щонайменше один із цих героїв буде гарантовано заблокований. Ви можете змінювати список героїв для блокування в будь-який момент. Якщо ви лишаєте окремі місця для блокування порожніми, то є ймовірність, що це порожнє місце буде обрано як ваш «заблокований герой». Іншими словами, ви не збільшите шанси на блокування, якщо лишите місця порожніми.",
      "Ця нова система вирішує низку проблем, які мала стара система: ви не забудете заблокувати героя; вам не потрібно знати, що пропоновані блокування іноді можуть ігноруватися грою; вам не треба поспіхом робити важливе рішення, яке в більшості гравців не надто змінюється від гри до гри. Додатково ця зміна захищає гравців від блокувань, що спрямовані безпосередньо на них. Це стосується як відомих осіб, так і пересічних користувачів, чиї ігрові дані ви змогли десь побачити.",
      "Деякі ігрові режими (капітанів, відбору капітанів, відбору здібностей і турбо) не мали стадії блокування перед грою, або ж мали нетипові правила блокування. Ці режими не змінилися.",
      "[h2]Аналіз знайденого матчу від Dota Plus[/h2]",
      "Мільйони гравців у Dota щодня взаємодіють із системою пошуку матчів і кожен має власні пріоритети. Одні хочуть долучитися якомога швидше, і для них прийнятно мати велику різницю навичок серед гравців заради економії часу. Інші ж хочуть, щоби кожен матч було ідеально збалансовано, і готові задля цього довше чекати. Когось узагалі не хвилює рівень навичок гравців, для них важливі тільки поведінка й риси характеру союзників і ворогів.",
      "Ми вже давно хотіли розвинути пошук матчів так, щоби він враховував особисті вподобання. Ранні спроби зіткнулися з двома головними проблемами:",
      "[list]",
      "[*]По-перше, гравці добре описують свої вподобання іншим, але не завжди можуть описати їх у вигляді складного глобального алгоритму пошуку матчів, як-от «Для мене різниця в навичках важить на 13% більше, ніж для середньостатистичного гравця в Dota!» Як нам створити інструменти, що дозволять гравцям виражати свої вподобання безпосередньо та природно?",
      "[*]По-друге, система пошуку матчів зачіпає всіх гравців у Dota, тож змінювати її слід дуже обережно. Вона завжди намагається збалансувати особисті вподобання гравців і загальний стан гри. Якщо знаходяться погані матчі, чи то через велику різницю в навичках, чи то через образливу поведінку гравців, то це погано для всієї спільноти Dota. Якщо знаходяться ідеальні матчі, але пошук триває три години, то це також погано. Нові функції пошуку матчів, доступні всім одразу, створюють ризик поламати всю систему пошуку, а значить і всю Dota. Як нам випустити ці нові функції й вивчити їхню роботу на практиці, мінімізуючи ризик для всієї гри?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Ми випускаємо перший варіант цієї давно запитаної гравцями функції в експериментальних рамках нещодавно запроваджених лабораторій Dota і спершу тільки для Dota Plus. Коли ви знайдете матч, Dota Plus покаже деяку інформацію з даними про нього, як-от різницю в навичках гравців чи їхні оцінки поведінки. Ви зможете прийняти матч або почати шукати заново, якщо готові почекати на варіант, який краще відповідатиме вашим уподобанням.",
      "Під час створення цієї функції ми уважно стежили за тим, щоби надана гравцям інформація дозволяла виражати власні вподобання, але не давала жодних змагальних переваг. Нове діалогове вікно покаже вам різницю в навичках гравців, але не скаже, який гравець і яка команда сильніші.",
      "Чому ця функція знаходиться в лабораторіях Dota? Бо єдиний спосіб дізнатися напевне, як мільйони гравців у Dota сприймуть зміни — це випустити їх. Ми провели масштабне моделювання, але все ж існує серйозний ризик: ми можемо неправильно розуміти, як гравці користуватимуться цією функцію і як вона вплине на досвід пошуку матчів у Dota. Ми не хочемо, щоб [i]імовірність[/i] помилки завадила нам принести користь мільйонам гравців, тож випустили цю функцію як експеримент. Випуск для підписників Dota Plus обмежує доступ, але також обмежує ризик появи проблем для всієї гри, поки ми спостерігатимемо за цією функцією. Як і у випадку з іншими функціями лабораторій Dota, час і відгуки покажуть, чи вона розшириться, зміниться або покине гру.",
      "[h2]Що далі[/h2]",
      "Ми знаємо, що багато з вас очікують на «Коронопад». Ми й самі не можемо дочекатися, коли вже випустимо його для вас. Лишилися останні штрихи й ми очікуємо випустити це оновлення в середині квітня. Тоді й побачимося."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}