{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Игрално обновление 7.35d и характеристики за търсенето на мачовете",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Игрално обновление 7.35d и характеристики за търсенето на мачовете",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Току-що издадохме [url=https://www.dota2.com/patches/7.35d]игрално обновление 7.35d[/url] (Chen си получи заслуженото), а заедно с него идва и нов набор от характеристики.",
      "[h2]Преработване на забраните за герои при търсенето на мачове[/h2]",
      "През последната година и нещо, предприехме [url=https://www.dota2.com/newsentry/3677788723152833273]редица[/url] [url=https://www.dota2.com/newsentry/3884981125532748791]видими действия[/url] срещу ползвателите на измами от трети страни. Докато проучваме всяка измама, се фокусираме основно върху това да разберем какво прави и как можем да го проследим и спрем. Но същевременно с това се питаме защо някои измамници се чувстват принудени да използват тези инструменти поначало. Най-често срещаното обяснение е, че се прави „с цел да получат нечестно предимство“, което очевидно противоречи на желанията на Dota 2 общността и чувството за справедливо съревнование, което е в същността ѝ. Въпреки това, понякога все още има неща, които можем да научим и използваме, така че да подобрим Dota 2 преживяването за всички (или поне за всички, на които не е била наложена забранена за мамене).",
      "Забраните на герои преди игра са пример за това. Много миналогодишни измами се фокусираха над придобиването на предимство по време на десетсекундната фаза за забрана на герои при старта на на всяка игра. Отстъпихме назад, за да огледаме първоначалните цели на тази фаза. Тя трябваше да позволи на играчите да изразят предпочитанията си за това срещу какви герои не искат да играят, но без да се създават сценарии, при които потребителите, чийто игрални възможности обхващат малък набор от герои, биха били перманентно изключени. Огледахме малко данни и поставихме въпроса дали има начин, чрез който бихме могли да обслужваме тези цели по по-добър начин, като същевременно с това разрешаваме и други проблеми.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "С днешното обновление премахнахме фазата за забрани в началото на мача и я заменихме с предпочитания за забрани, съхранени в акаунта Ви. Ако заредите раздела „Герои“, можете да изберете четирите героя, които не искате да виждате в игрите си. Гарантирано Ви е, че когато се присъедините към игра от търсенето на мачове, поне един от тях ще бъде забранен. Можете да промените своя списък със забранени герои, когато искате. Ако оставите празни слотове за забрани, възможно е някой от тях да бъде избран като Вашия „забранен герой“. С други думи, няма никакво предимство да оставяте празни слотове.",
      "Тази нова система адресира редица проблеми, които бяха налични в предходната. Няма как да забравите да подадете забрана. Не е нужно да научавате, че понякога предложените забрани се игнорират от играта. Не бивате притискани от времето, за да вземете стресиращо решение, което в крайна сметка повечето играчи вземат по един и същ начин през почти цялото време. Като допълнителен бонус, също така прави целенасочените забрани невъзможни, независимо дали са срещу известни личности или произволни играчи в публичен мач, за който сте потърсили данни.",
      "Някои игрални режими (т.е. Captains Mode, Captains Draft, Ability Draft, Turbo) нямаха фаза за забрани преди мача или вече разполагаха с нестандартни правила за направата им. Тези режими са непроменени.",
      "[h2]Предварителен анализ за намерените мачове от търсенето на такива в Dota Plus[/h2]",
      "Милиони Dota 2 играчи взаимодействат с търсенето на мачове всеки ден и всеки един от тях има различни приоритети, когато търси игра. Някои предпочитат да влязат в мач възможно най-бързо и са склонни да приемат по-висока вариация в игралните умения, за да спестят малко време. Други искат всеки мач да бъде перфектно балансиран и са склонни да чакат по-дълго за най-добрия шанс в игра с най-близки нива на уменията. Има дори потребители, нехаещи каква е разликата в уменията на останалите играчи, които са много повече загрижени от техния личностен характер и поведението им в играта.",
      "Отдавна искаме да изготвим характеристики, позволяващи на играчите да намират мачове, които са в по-добро съответствие с техните индивидуални предпочитания. При ранните опити се натъкнахме на два основни проблема:",
      "[list]",
      "[*]Първо, макар че играчите са добри при описването на своите предпочитанията пред други хора, не са непременно умели, когато това трябва да става под формата входящи данни за сложен, глобален алгоритъм за търсене на мачове („Ценя вариация на уменията с 13% по-висока от тази на средностатистическия Dota 2 играч!“). Как можем да създадем инструменти, които позволяват на играчите да изразяват своите предпочитания по естествен и директен начин?",
      "[*]Второ, промените по търсенето на мачовете засягат всички Dota 2 играчи. Ето защо имаме склонност да сме предпазливи. Търсенето на мачове винаги се опитва да постигне баланс между индивидуалните предпочитания на играчите и благоденствието на Dota 2 като цяло. Ако мачовете в Dota 2 са лоши, независимо дали недоброкачествеността е заради безумни различия в уменията или лошо поведение на играчите, това е вредно за Dota 2 като общност. Ако всеки мач е перфектен, но отнема три часа, за да се сформира, това също е лошо. В случай че новите характеристики за търсенето на мачове са достъпни за всекиго наведнъж, рискуваме да го повредим, а ако това стане… Dota 2 става неизправна. Как можем да издадем нови характеристики за търсенето на мачове и да научим по какъв начин работят на практика, като същевременно с това поддържаме нисък риск за Dota 2 като цяло?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "В рамките на новия експериментален чадър на Dota лабораториите и отначало ограничена до Dota Plus, издаваме първичен вариант на характеристика, която Dota 2 играчите искат от нас открай време. Когато намерите мач в Dota 2, Dota Plus ще представи известна информация относно това как е бил оценен мача при търсенето, като например: приблизителна преценка за диапазона на уменията и поведенческите оценки на играчите. Ще имате шанс да приемете този мач или пак да се вредите в опашката, за да изчакате намиране на такъв, който е по-добър за Вас и текущите Ви предпочитания.",
      "Бяхме внимателни при изготвянето на тази функция, за да се уверим, че всякаква информация, която включваме, би позволила на играчите да изразяват индивидуални предпочитания относно това какви видове мачове предпочитат, но не и да предоставя съревнователно предимство от каквато и да е разновидност. Новият диалогов прозорец може да Ви информира, че вариацията в уменията на играчите за даден мач е висока или ниска, но не и в коя крайност на диапазона се намирате Вие и Вашия отбор.",
      "Защо това е характеристика от Dota лабораториите? Единственият начин да знаем със сигурност как милиони Dota 2 играчи ще взаимодействат с дадена характеристика е да я издадем. Ето защо правим именно това. Проведохме обширно проучване на образци, но тук все още има реален риск. Възможно е да грешим относно това как играчите ще използват тази характеристика или как тя ще се отрази на цялостното преживяване при търсенето на мачове в Dota 2. Не искаме да допуснем тези страхове, че [i]може би[/i] грешим, да ни спрат при направата на нещо, което има възможност да е от полза за милиони Dota 2 играчи. Ето защо издаваме тази характеристика като експеримент. Излизането ѝ в Dota Plus ограничава достъпа и съответно налага лимит на риска за Dota 2, докато научаваме как всеки потребител взаимодейства с нея. Както при другите характеристики на Dota лабораториите, времето и Вашите отзиви ще покажат дали тя ще се разраства, променя или ще бъде оттеглена.",
      "[h2]Занапред[/h2]",
      "Знаем, че много от Вас очакват излизането на Crownfall, а ние нямаме търпение да Ви го поднесем. Привършваме някои неща и очакваме да го пуснем в средата на април. Ще се видим тогава."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}