{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Parche de jugabilidad 7.35d y características del emparejamiento",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060377
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711058969
      }
    ]
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Parche de jugabilidad 7.35d y características del emparejamiento",
    "posttime": 1711060378,
    "updatetime": 1711060378,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Acabamos de lanzar el [url=https://www.dota2.com/patches/7.35d]parche de jugabilidad 7.35d[/url] (Se lo merecía Chen), que incluye una nueva serie de características.",
      "[h2]Nuevo veto de héroes durante el emparejamiento[/h2]",
      "Durante aproximadamente un año, tomamos [url=https://www.dota2.com/newsentry/3677788723152833273]una serie[/url] de [url=https://www.dota2.com/newsentry/3884981125532748791]medidas visibles[/url] contra quienes usan trampas de terceros. A medida en que investigamos cada una de las trampas, nuestro objetivo principal es entender cómo funcionan, cómo rastrearlas y detenerlas. En lo que lo hacemos, también nos hemos preguntado por qué algunos de estos tramposos tienen la necesidad de usar estas herramientas en primera instancia. La explicación más común es que es \"para tener una ventaja injusta\", lo cual, obviamente, contradice el deseo de la comunidad de Dota, así como el sentido de competitividad y justicia. Incluso así, algunas veces podemos aprender algo y lo utilizamos para mejorar la experiencia para todos en Dota (o al menos todo el mundo que no ha sido vetado por hacer trampas).",
      "Los vetos de héroes antes de la partida son un ejemplo de esto. El año pasado, muchos de estos tramposos se enfocaron en obtener una ventaja durante la fase de veto de héroes de diez segundos al inicio de cada partida. Recapacitamos sobre las metas originales de esta fase (que son permitir que los jugadores expresen una preferencia sobre contra cuáles héroes no querían jugar, pero sin crear situaciones en las que los jugadores con pocas opciones de selección de héroes queden excluidos permanentemente), revisamos algunos datos y nos preguntamos si había alguna manera en la que pudiéramos cumplir mejor con estas metas a la vez que resolvíamos otros problemas.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Con la actualización del día de hoy, eliminamos la fase de veto al inicio de la partida y la reemplazamos con preferencias de veto almacenadas en tu cuenta. Al abrir la pestaña de héroes, puedes seleccionar cuatro héroes que no quieras ver en tus partidas. Tienes garantizado que cuando te unas al emparejamiento de una partida, al menos uno de ellos quedará vetado. Puedes cambiar tu lista de héroes vetados cuando quieras. Si dejas algunas casillas de veto vacías, es posible que esa casilla vacía sea seleccionada como tu \"héroe vetado\". En otras palabras, no hay ventaja al dejar casillas vacías).",
      "Este sistema nuevo abarca varios problemas que tenía el sistema previo: no puedes olvidarte de hacer un veto; no tienes que aprender que a veces se ignoran las fases de veto por el juego; ya no vas a tener pocos segundos para tomar una decisión estresante, que finalmente, es la misma que toman la mayoría de los jugadores todo el tiempo. Adicionalmente, también hace que los vetos específicos sean imposibles, ya sea en contra de personalidades conocidas o jugadores al azar en una partida pública para los que se hayan buscado datos.",
      "Algunos modos de juego (Modo capitán, Selección con capitán, Selección de habilidades y Turbo) no tenían fase de veto al inicio de la partida o tenían reglas de veto diferentes a las estándares. Estos modos no cambian.",
      "[h2]Análisis del emparejamiento previo a la partida con Dota Plus[/h2]",
      "Todos los días, millones de jugadores de Dota interactúan con el emparejamiento y cada uno de ellos tiene distintas prioridades al buscar una partida. Algunos prefieren entrar a la partida lo más pronto posible y tienen la disposición para aceptar una mayor variedad de habilidades durante la partida para ahorrarse algo de tiempo. Otros quieren que la partida esté perfectamente balanceada y están dispuestos a esperar más con tal de tener una mejor oportunidad para una partida mucho más reñida. A otros jugadores no les importa el nivel de habilidad de los demás jugadores, pero sí les importa más su personalidad y comportamiento durante la partida.",
      "Desde hace algún tiempo queríamos crear características para dejar que los jugadores encontraran partidas que se alinearan mejor con sus preferencias personales. Estos intentos previos tuvieron dos problemas principales:",
      "[list]",
      "[*]Primero que nada, aunque los jugadores son buenos al describir sus preferencias a los demás, no son necesariamente buenos al describir sus preferencias a un algoritmo de emparejamiento complejo y mundial (\"¡Me importa una desviación de habilidades del 13 % mayor que la del jugador promedio de Dota!). ¿Cómo podemos crear herramientas que le permitan a los jugadores expresar sus preferencias de manera natural y directa?",
      "[*]En segundo lugar, los cambios para el emparejamiento afectan a todos los jugadores de Dota, así que procuramos ser precavidos. El emparejamiento siempre tiene como objetivo que haya un balance entre las preferencias de cada jugador y la salud en general de Dota. Si las partidas de Dota son malas, ya sea por la falta de habilidades o por el mal comportamiento de los jugadores, esto es malo para Dota como comunidad. Si todas las partidas son perfectas, pero tardan tres horas en formarse, también es malo. Las nuevas características disponibles de emparejamiento para todos a la vez ponen en riesgo el emparejamiento, y si destruimos el emparejamiento, también destruimos Dota. ¿Cómo podemos lanzar características nuevas de emparejamiento y aprender cómo funcionan en el mundo real mientras mantenemos bajo el riesgo para Dota en general?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Dentro del nuevo entorno experimental de Dota Labs, e inicialmente limitado solo para Dota Plus, lanzamos la primera versión de una característica que los jugadores nos pidieron una y otra vez: al encontrar una partida de Dota, Dota Plus presentará algunos datos sobre cómo el sistema de emparejamiento evaluó la partida, así como un cálculo aproximado de rango de habilidad y de las puntuaciones de comportamiento de los jugadores. Tendrás la oportunidad de aceptar la partida o volver a la cola para esperar una partida que sea mejor para ti y tus preferencias actuales.",
      "Tuvimos cuidado al crear esta función para asegurarnos de que cualquier información que incluyéramos permitiera a los jugadores expresar sus preferencias individuales sobre qué tipo de partidas prefieren, pero no les otorgara una ventaja competitiva de ningún tipo. El diálogo nuevo puede indicarte si las desviaciones de los jugadores son altas o bajas durante el emparejamiento, pero no te indicará si tú o tu equipo tienen desviaciones altas o bajas.",
      "¿Por qué es esto una característica de Dota Labs? La única manera para asegurarnos de que millones de jugadores de Dota van a interactuar con esta característica es lanzándola, así que es lo que estamos haciendo. Hicimos un modelado exhaustivo, pero todavía existe un riesgo real: es posible que estemos equivocados sobre cómo los jugadores usarán esta función o cómo afectará la experiencia general del emparejamiento en Dota. No queremos que la [i]posibilidad[/i] de estar equivocados nos impida hacer algo que pueda beneficiar a millones de jugadores de Dota, así que lo lanzamos como un experimento. Al lanzarlo en Dota Plus, se limita el acceso y el riesgo para Dota mientras observamos cómo interactúan todos con esta característica. Al igual que con las características de Dota Labs, el tiempo y tus comentarios dirán si esto crece, se cambia o lo eliminamos.",
      "[h2]Hacia el futuro[/h2]",
      "Sabemos que muchos de ustedes esperan la llegada de \"La caída de la corona\" y nosotros también esperamos que llegue a tus manos. Estamos a punto de terminar todo y tenemos esperado hacer un lanzamiento a mediados de abril. Nos vemos pronto."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1711060378,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}