{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Herní aktualizace 7.35d a novinky ve vyhledávání zápasů",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Herní aktualizace 7.35d a novinky ve vyhledávání zápasů",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Dnešek patří [url=https://www.dota2.com/patches/7.35d]herní aktualizaci 7.35d[/url] (Chen holt potřeboval trochu usadit) a dvěma důležitým funkcím.",
      "[h2]Změna předzápasového banování hrdinů[/h2]",
      "Za uplynulý rok jsme provedli [url=https://www.dota2.com/newsentry/3677788723152833273]řadu[/url] razantních [url=https://www.dota2.com/newsentry/3884981125532748791]kroků[/url] vůči uživatelům cheatů třetích stran. Když však podobné cheaty přezkoumáváme, nezaměřujeme se jenom na to, co dělají a jak je můžeme vystopovat a finálně zastavit. Také se ptáme sami sebe, co vůbec podvodníky vede k jejich používání. Ano, nejčastěji jde samozřejmě o získání neférové výhody, což není v souladu se zájmy komunity, a už vůbec ne s vybalancovaným soutěžním srdcem samotné hry, ale existují i případy, ze kterých se můžeme poučit a na jejich základě vylepšit herní zážitek pro všechny (resp. kromě těch zabanovaných za cheatování).",
      "Banování hrdinů před zápasy je právě takovým případem. Spousta cheatů se totiž loni zaměřovala na poskytnutí výhody v rámci desetisekundové fáze banování na začátku každého zápasu, což nás přimělo vrátit se zpět k původním cílům této fáze – dát hráčům možnost vyjádřit své preference ohledně hrdinů, proti kterým nechtějí hrát, ale zároveň výrazněji neomezit hráče specializované na pár konkrétních gerojů. Podívali jsme se tedy na data a položili si otázku, zdali by těchto cílů nešlo dosáhnout elegantnější cestou, která by cheaty zabíjela hned v zárodku.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "V dnešní aktualizaci jsme proto odstranili fázi banování z jednotlivých zápasů a nahradili ji předvolbami banů uloženými na Vašem účtu. Stačí ve hře přejít do sekce „Hrdinové“ a vybrat až čtyři hrdiny, které nechcete vídat ve svých zápasech. Když se pak připojíte do oficiálního zápasu, nejméně jeden z těchto banů bude aplikován. Tento seznam zabanovaných hrdinů je dále možné kdykoli měnit a pro jistotu upozorňujeme, že pokud nějaké sloty necháte prázdné, mohou být hrou stále vybrány jako preferované bany. Jinými slovy: prázdný slot se může rovnat preferenci „nechci zabanovat žádného hrdinu“.",
      "Jak můžete vidět, nový systém řeší naráz více problémů systému předchozího – na banování nezapomenete, nebudete překvapeni, že některé navrhované bany jsou hrou ignorovány, a už se nebudete muset stresovat s rozhodnutím, které je stejně pro většinu hráčů totožné každý zápas. Plus byly odbourány „cílené bany“, a to jak vůči známým osobnostem, tak vůči náhodným hráčům, které si podvodníci rychle proklepli.",
      "Herní módy (např. Kapitánský režim, Kapitánský výběr, Výběr schopností a Turbo), které ani dříve neměly předzápasovou fázi banování, nebo se na ně vztahují nestandardní pravidla banování, zůstávají nedotčeny.",
      "[h2]Detaily vyhledaných zápasů (pro členy programu Dota Plus)[/h2]",
      "Se systémem pro vyhledávání zápasů interagují denně miliony hráčů a každý z nich má při hledání jiné priority. Někdo se chce dostat do hry co nejrychleji a v zájmu ušetření času přežije větší rozptyl dovedností, zatímco jiní chtějí mít své zápasy perfektně vybalancované a nevadí jim počkat si na ně o chvilku déle. A někomu třeba nezáleží tak moc na dovednostech ostatních, ale spíš se soustředí na jejich povahu a chování ve hře.",
      "I proto jsme už delší dobu chtěli hráčům usnadnit nacházení zápasů, které co nejblíže odpovídají jejich individuálním preferencím, nicméně rané pokusy narážely na dvě hlavní překážky:",
      "[list]",
      "[*]Zaprvé, ačkoli jsou hráči schopni popsat své preference ostatním hráčům, zadat je jako vstupní hodnoty do komplexního globálního algoritmu pro vyhledávání zápasů je něco jiného (např. „Různorodosti dovedností si vážím o 13 % více než průměrný hráč.“). Jak by měl vypadat nástroj, který nechá hráče vyjádřit své preference přirozeně a přímo?",
      "[*]Zadruhé, změny systému pro vyhledávání zápasů ovlivňují všechny hráče, takže jsme s nimi opatrnější. Co víc, systém se za každé situace snaží najít rovnováhu mezi preferencemi jednotlivých hráčů a kvalitou hry jako takové. Pokud jsou totiž zápasy špatné (a může to být vinou divokého rozptylu dovedností nebo nevhodným chováním hráčů), trpí celá komunita. A stejně tak, pokud jsou zápasy perfektní, ale jejich nalezení trvá tři hodiny, spokojený není ve výsledku nikdo. Při plošném zavádění nových funkcí systému pro vyhledávání zápasů tedy riskujeme, že tento systém rozbijeme, a tím rozbijeme celou hru. Bylo by nějak možné vyzkoušet novou funkci v praxi a přitom co nejméně riskovat?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Teď už máme naštěstí k dispozici laboratoře hry Dota 2, takže ve spojení s počátečním omezením na členy programu Dota Plus můžeme vydat první verzi funkce, o kterou nás hráči od nepaměti žádají: jakmile systém najde zápas, poskytne Vám některé z informací použitých při jeho vyhledávání (mimo jiné odhadovaný rozsah dovedností a skóre chování hráčů), načež dostanete možnost tento zápas přijmout, nebo hledání opakovat a raději si počkat na zápas bližší Vašim preferencím.",
      "Než něco namítnete, ano, dali jsme si opravdu velký pozor, aby poskytnuté informace umožnily hráčům vyjádřit své osobní preference, ale zároveň jim neposkytly žádnou kompetitivní výhodu. Takže v novém dialogovém okně se dozvíte, jestli je rozsah dovedností velký, nebo malý, ale už nezjistíte, na kterém kvalitativním konci jste Vy a Váš tým.",
      "A o zahrnutí do laboratoří jsme nemuseli dlouho dumat. Jediný způsob, jak kompletně otestovat interakci milionů hráčů s nějakou funkcí, je ji veřejně vydat. Interně jsme pochopitelně provedli rozsáhlé modelování, avšak stále existuje reálné riziko, že jsme špatně odhadli, jak budou hráči funkci využívat nebo jaký bude mít dopad na celkový zážitek ze hry. Na druhou stranu nechceme, aby nám tyto obavy, že jsme se [i]možná[/i] sekli, zabránily v provedení něčeho, co by mohlo prospět celé naší komunitě, a proto je vydání formou experimentu ideální. Ve spojení s omezením pouze na členy programu Dota Plus se riziko navíc dále snižuje a jako u všech ostatních experimentů platí, že o budoucnosti funkce rozhodne Vaše zpětná vazba.",
      "[h2]Vzestup a pád[/h2]",
      "Hledáte ještě něco? Možná Pád moci? Věřte, že už se také těšíme, až tuhle aktualizaci dostanete do rukou. Momentálně finišujeme a vydání očekáváme někdy v půlce dubna. Zatím se mějte."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 19,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}