{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização de jogabilidade 7.35d e recursos da criação de partidas",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Atualização de jogabilidade 7.35d e recursos da criação de partidas",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Acabamos de lançar a [url=https://www.dota2.com/patches/7.35d]atualização de jogabilidade 7.35d[/url] (Chen estava merecendo), junto a alguns novos recursos.",
      "[h2]Reformulação do banimento de heróis na criação de partidas[/h2]",
      "Durante o último ano, tomamos [url=https://www.dota2.com/newsentry/3677788723152833273]algumas[/url] medidas [url=https://www.dota2.com/newsentry/3884981125532748791]publicamente[/url] contra jogadores que usavam programas externos para trapacear. Conforme investigamos cada trapaça, o nosso principal objetivo é entender o que estão fazendo e como podemos monitorar e impedir o seu funcionamento. Mas também aproveitamos para nos perguntar por que alguns trapaceiros se sentem motivados a usar essas ferramentas em primeiro lugar. A explicação mais comum é \"para obter uma vantagem desleal\", o que obviamente vai contra os ideais da comunidade do Dota — e o próprio senso de competitividade e justiça. Ainda assim, às vezes ainda há situações que podemos usar de aprendizado para aprimorar a experiência do Dota para todos os jogadores (que não foram banidos por trapacear).",
      "Banimentos de heróis antes das partidas são um exemplo disso. Muitas trapaças usadas neste último ano buscavam uma vantagem durante os dez segundos da fase de banimento de heróis, no início de cada partida. Refletimos um pouco sobre os nossos objetivos originais para essa fase: deixar os jogadores expressarem uma preferência de quais heróis prefeririam não enfrentar, mas sem criar cenários onde jogadores que dominam poucos heróis acabassem ficando sem poder usá-los permanentemente. Então, analisamos alguns dados e nos perguntamos se haveria uma forma de atender a esses objetivos e ainda resolver outros problemas ao mesmo tempo.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Com a atualização de hoje, removemos a fase de banimento no início das partidas — agora, as preferências de banimento são associadas à sua conta. Ao abrir a aba de heróis, você pode selecionar os quatro heróis que não gostaria de ver nas suas partidas. Há uma garantia de que, ao entrar em uma partida, pelo menos um deles será banido. Você pode alterar a sua lista de heróis banidos sempre que quiser (caso deixe de selecionar algum banimento, pode ser que essa vaga vazia seja escolhida como o seu \"herói banido\" — ou seja, não há vantagem alguma em não usar todos os banimentos).",
      "Este novo sistema resolve vários problemas inerentes ao sistema anterior: você não pode esquecer de banir um herói; você não precisa se lembrar que alguns banimentos são ignorados pelo jogo; você não está correndo contra o tempo para tomar uma decisão estressante que, no fim das contas, é quase sempre a mesma. E, como bônus, também impossibilita o \"banimento alvejado contra jogadores\", sejam eles personalidades conhecidas ou participantes aleatórios de uma partida.",
      "Alguns modos de jogo (Modo de Capitães, Seleção dos Capitães, Seleção de Habilidades e Turbo) não tinham uma fase de banimento no início da partida, ou então já tinham regras separadas. Esses modos continuam iguais.",
      "[h2]Análise pré-partida do Dota+[/h2]",
      "Milhões de jogadores de Dota interagem com a criação de partidas diariamente, e cada um tem prioridades distintas ao buscar uma partida. Alguns preferem entrar em uma partida o mais rápido possível, e estão dispostos a aceitar uma variação de habilidade mais ampla para poupar tempo. Outros desejam que cada partida seja perfeitamente equilibrada, e estão dispostos a aguardar mais pela chance de um confronto mais acirrado. Outros jogadores se preocupam mais com a personalidade e comportamento dos demais do que com o nível de habilidade.",
      "Há muito tempo queríamos implementar recursos para permitir aos jogadores encontrarem partidas que melhor se alinhem às suas preferências individuais. As tentativas iniciais tiveram dois grandes problemas:",
      "[list]",
      "[*]Primeiro, embora os jogadores sejam bons em descrever as suas preferências para outras pessoas, eles não necessariamente são bons em descrevê-las para um algoritmo complexo (\"a importância que eu dou à variação de habilidade é 13% maior que a do jogador de Dota médio!\"). Como podemos criar ferramentas que permitam aos jogadores expressar as suas preferências de forma natural e direta?",
      "[*]Segundo, alterações no sistema de criação de partidas afetam todos os jogadores de Dota, então é algo que fazemos com cautela. A criação de partidas está sempre tentando achar um equilíbrio entre as preferências individuais dos jogadores e o bem-estar do Dota como um todo. Ou seja, caso as partidas do Dota sejam ruins, seja devido a grandes variações de habilidade entre os jogadores ou comportamento inadequado, isso é ruim para o Dota como uma comunidade. Partidas perfeitas, mas que exigem que os jogadores fiquem na fila por três horas, também são prejudiciais. Disponibilizar novos recursos da criação de partidas para todos os jogadores de uma só vez pode ser perigoso, pois, se nós quebrarmos a criação de partidas, quebramos o Dota. Como podemos lançar novos recursos da criação de partidas e observar o seu funcionamento na prática, sem trazer grandes riscos para o Dota?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Sob a alçada experimental do Laboratório do Dota, e inicialmente limitado ao Dota+, estamos lançando uma versão inicial de um recurso que os jogadores têm nos pedido desde sempre: ao encontrar uma partida, o Dota+ apresentará alguns dados sobre como o sistema de criação de partidas avaliou aquela partida, como uma estimativa da variação de habilidade e notas comportamentais dos jogadores. Você terá a chance de aceitar a partida ou voltar à fila para esperar por uma partida mais apropriada sob as suas preferências.",
      "Fomos cuidadosos ao construir este recurso, para garantir que qualquer informação inclusa somente dê aos jogadores a opção de expressar as suas preferências individuais sobre que tipo de partidas gostariam de jogar, mas sem conceder nenhum tipo de vantagem competitiva. A nova janela pode informar que a variação de habilidade entre os jogadores de uma partida é alta ou baixa, mas não de qual lado da balança a sua equipe se encontra.",
      "Por que esse recurso está no Laboratório do Dota? A única forma de saber de verdade como milhões de jogadores de Dota interagirão com o recurso é lançá-lo — e é isso que estamos fazendo. Fizemos diversas modelagens, mas ainda há um risco real em jogo: podemos estar enganados sobre como os jogadores usarão esse recurso ou como isso afetará a experiência geral de criação de partidas do Dota. Não queremos deixar esse medo de que [i]podemos[/i] estar errados nos impeça de fazer algo que pode beneficiar milhões de jogadores de Dota, então estamos lançando isso como um experimento. O lançamento dentro do Dota+ limita o acesso, e, portanto, limita os riscos para o Dota enquanto aprendemos mais sobre como os jogadores interagem com o recurso. Assim como os demais recursos do Laboratório do Dota, o tempo e os seus comentários nos dirão se isso continuará, mudará ou desaparecerá.",
      "[h2]Avante[/h2]",
      "Sabemos que muitos de vocês estão ansiosos pela Queda Coronal, e nós estamos ansiosos para trazê-la até vocês. Estamos dando os toques finais e esperamos lançá-la no meio de abril. Nos vemos lá."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}