{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualizarea de joc 7.35d și caracteristici pentru sistemul de matchmaking",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060377
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711058969
      }
    ]
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualizarea de joc 7.35d și caracteristici pentru sistemul de matchmaking",
    "posttime": 1711060378,
    "updatetime": 1711060378,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Tocmai am lansat [url=https://www.dota2.com/patches/7.35d?l=romanian]actualizarea de joc 7.35d[/url] (Chen a primit ceea ce merita), iar odată cu aceasta și o serie de noi caracteristici.",
      "[h2]Faza de excludere a eroilor a fost regândită[/h2]",
      "În urmă cu aproximativ un an, am luat [url=https://www.dota2.com/newsentry/3677788723152833273?l=romanian]o serie[/url] de [url=https://www.dota2.com/newsentry/3884981125532748791?l=romanian]măsuri concrete[/url] împotriva utilizatorilor care folosesc programe software de trișare. Pe măsură ce investigăm fiecare astfel de program, încercăm în primul rând să înțelegem cum funcționează acestea și cum le putem monitoriza și împiedica să funcționeze. Însă în timp ce realizăm acest lucru, ne întrebăm și de ce unii trișori simt nevoia de a utiliza astfel de instrumente. Cel mai adesea este vorba despre „obținerea unui avantaj”, fapt ce contravine în mod evident dorințelor comunității Dota și spiritului de competitivitate și fairplay ce stă la baza acesteia. Chiar și așa, uneori mai există lucruri pe care le putem învăța și folosi pentru a îmbunătăți experiența de joc pentru toată lumea (sau cel puțin pentru toți cei care nu au primit o interdicție pentru trișare).",
      "Un exemplu în acest sens ar fi faza de excludere a eroilor care are loc înainte de începerea meciului. Multe dintre programele software de trișare de anul trecut se concentrau pe obținerea unui avantaj în timpul fazei de zece secunde de excludere a eroilor de la începutul fiecărui meci. Am reexaminat obiectivele inițiale ale acestei faze, care urmăreau să le permită jucătorilor să își exprime preferințele cu privire la eroii împotriva cărora nu-și doreau să joace, dar în același timp să nu restrângă semnificativ eroii disponibili pentru jucătorii care sunt familiari cu un grup restrâns de eroi. Așa că am analizat câteva date și ne-am întrebat dacă aceste obiective ar putea fi atinse într-o manieră mai eficientă și care să vizeze în același timp și acțiunile de trișare.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Odată cu actualizarea de astăzi, am eliminat faza de excludere de la începutul meciului și am înlocuit-o cu preferințele de excludere care sunt salvate în contul tău. Dacă vei accesa fila „Eroi”, vei putea selecta patru eroi pe care nu-ți dorești să-i întâlnești în meciurile tale. Astfel, acum când te vei alătura unui meci folosind sistemul de matchmaking, vei știi cu siguranță că cel puțin unul dintre eroii respectivi va fi exclus. Vei putea modifica oricând dorești lista cu eroii excluși. (Dacă nu vei selecta toți cei patru eroi care-ți dorești să fie excluși, este posibil ca sloturile rămase libere să fie selectate de către joc atunci când vor fi determinați „eroii excluși” de tine. Cu alte cuvinte, nu ai niciun avantaj dacă nu selectezi toți cei patru eroi împotriva cărora nu-ți dorești să joci.)",
      "Acest nou sistem abordează o serie de probleme pe care vechiul sistem le avea: nu vei mai uita să excluzi un erou; nu va trebui să reții că, uneori, excluderile sugerate sunt ignorate de joc; nu vei mai fi presat de timp să iei o decizie stresantă pe care, în cele din urmă, majoritatea jucătorilor trebuie să o ia într-o manieră similară aproape de fiecare dată. Drept bonus, noul sistem face imposibilă excluderea unor eroi care să vizeze anumiți jucători, indiferent dacă este vorba despre jucători celebri sau jucători aleatorii pe care-i întâlnești într-un meci public, nu vei mai putea analiza istoricul acestora pentru a realiza excluderile.",
      "Unele moduri de joc (mai exact, „Modul căpitanilor”, „Selecția căpitanilor”, „Selecție abilități” și „Turbo”) fie nu aveau o fază de excludere a eroilor la începutul meciului, fie aveau reguli de excludere care nu erau standard. Aceste moduri de joc rămân neschimbate.",
      "[h2]Analiză pentru meciul potențial (Dota Plus)[/h2]",
      "Milioane de jucători de Dota interacționează zilnic cu sistemul de matchmaking, iar fiecare are priorități diferite atunci când caută un meci. Unii preferă să găsească un meci cât mai repede cu putință și sunt dispuși să accepte meciuri cu un grad mai variat de îndemânare pentru a economisi timp, în timp ce alții doresc ca fiecare meci să fie perfect echilibrat și sunt dispuși să aștepte mai mult pentru a găsi un meci cât mai echitabil. Altor jucători le pasă mai puțin de îndemânarea celorlați jucători și mai mult de personalitatea și comportamentul lor din joc.",
      "Ne-am dorit de mult timp să le permitem jucătorilor să găsească meciuri care să corespundă cât mai bine preferințelor lor individuale, însă ne-am confruntat cu două mari probleme la început:",
      "[list]",
      "[*]În primul rând, deși jucătorii își pot descrie foarte bine preferințele cu privire la ceilalți jucători, aceștia nu le pot descrie la fel de bine pentru algoritmul complex utilizat de sistemul de matchmaking (de exemplu, „Pentru mine, variația gradului de îndemânare este cu 13% mai importantă decât în cazul unui jucător obișnuit de Dota!”). Cum putem crea instrumente care să le permită jucătorilor să-și exprime preferințele direct și într-un mod natural?",
      "[*]În al doilea rând, modificările aduse sistemului de matchmaking au un impact asupra tuturor jucătorilor de Dota, așa că încercăm întotdeauna să fim atenți. Sistemul de matchmaking încearcă întotdeauna să găsească un echilibru între preferințele individuale ale jucătorilor și calitatea jocului în sine. (Dacă meciurile de Dota sunt de o calitate îndoielnică, indiferent că este vorba de diferențe mari privind îndemnarea jucătorilor sau comportamente inadecvate din partea jucătorilor, întreaga comunitate Dota are de suferit. Dacă fiecare meci este perfect, dar organizarea unui astfel de meci durează trei ore, atunci nici acest lucru nu este ideal.) Cu alte cuvinte, dacă am lansa noi caracteristici pentru sistemul de matchmaking care să fie disponibile tuturor simultan, am risca să stricăm sistemul de matchmaking, iar asta ar afecta întregul joc. Așa că întrebarea este cum am putea lansa noi caracteristici pentru sistemul de matchmaking și să aflăm cum funcționează în practică, fără a risca să afectăm întregul joc?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Cu ajutorul noului program experimental intitulat „Laboratoarele Dota” și deocamdată disponibilă doar pentru abonații Dota Plus, lansăm prima versiune a unei caracteristici pe care jucătorii de Dota ne-au solicitat-o dintotdeauna: atunci când vei găsi un meci de Dota, Dota Plus îți va prezenta câteva informații despre cum a evaluat sistemul de machmaking meciul respectiv, cu informații estimative despre distribuția aptitudinilor și scorurile comportamentale ale jucătorilor. Vei avea posibilitatea de a accepta meciul respectiv sau a căuta unul nou care să corespundă mai bine preferințelor tale actuale.",
      "Am acordat o atenție sporită acestei caracteristici pentru a ne asigura că orice informație pe care am inclus-o le va permite jucătorilor să-și exprime preferințele individuale cu privire la tipurile de meciuri pe care le preferă, dar fără a le oferi vreun avantaj competitiv. Noua fereastră de dialog îți poate comunica faptul că aptitudinile jucătorilor dintr-un meci variază foarte mult sau foarte puțin, dar nu-ți va indica dacă tu și echipa ta aveți un grad de îndemânare mai ridicat sau mai scăzut.",
      "De ce este aceasta o caracteristică disponibilă în cadrul laboratoarelor Dota? Singura modalitate de a ști cu exactitate cum vor interacționa milioane de jucători cu o caracteristică este de a o lansa, așa că asta și facem. Deși am realizat o serie de modificări complexe pentru această caracteristică, realitatea este că încă există riscuri: este posibil să ne înșelăm cu privire la modul în care jucătorii vor folosi această caracteristică sau a modului în care aceasta va afecta experiența generală oferită de sistemul de matchmaking. Nu intenționăm să lăsăm acele temeri, [i]cum că ar fi posibil[/i] să ne înșelăm, să ne împiedice să realizăm ceva ce ar putea fi benefic pentru milioanele de jucători de Dota, așa că am decis să lansăm această caracteristică sub forma unui experiment. Făcând-o disponibilă doar pentru abonații Dota Plus, limităm astfel accesul și riscul pe parcurs ce aflăm mai multe despre cum interacționează toți cu aceasta. Asemenea celorlalte caracteristici disponibile în laboratoarele Dota, timpul și feedbackul tău ne vor ajuta să determinăm dacă aceasta caracteristică va continua să fie dezvoltată, dacă va suferi modificări sau dacă va fi retrasă.",
      "[h2]Planuri de viitor[/h2]",
      "Știm că mulți dintre voi așteaptă cu nerăbdare actualizarea „Căderea coroanei”, iar cu aceeași nerăbdare așteptăm și noi să o lansăm. În momentul de față lucrăm la ultimele retușuri și plănuim să o lansăm la jumătatea lunii aprilie. Ne auzim atunci."
    ],
    "commentcount": 1,
    "tags": [],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1711060399,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}