{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Gameplay-Update 7.35d und neue Funktionen für die Spielsuche",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060377
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711058969
      }
    ]
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Gameplay-Update 7.35d und neue Funktionen für die Spielsuche",
    "posttime": 1711060378,
    "updatetime": 1711060378,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Das neue [url=https://www.dota2.com/patches/7.35d]Gameplay-Update 7.35d[/url] ist jetzt verfügbar (Chen hat es verdient). Außerdem wurde eine Reihe neuer Funktionen hinzugefügt.",
      "[h2]Überarbeitetes Bannen von Helden für die Spielsuche[/h2]",
      "Im Laufe des letzten Jahres haben wir [url=https://www.dota2.com/newsentry/3677788723152833273]eine Vielzahl[/url] von [url=https://www.dota2.com/newsentry/3884981125532748791]konkreten Maßnahmen[/url] gegen Nutzer von Drittanbieter-Cheats ergriffen. Bei der Überprüfung jedes einzelnen Cheats versuchen wir in erster Linie zu verstehen, was dieser bewirkt und wie wir den Cheat aufspüren bzw. unterbinden können. Gleichzeitig fragen wir uns aber auch, warum sich manche Betrüger überhaupt dazu veranlasst sehen, solche Werkzeuge zu benutzen. In den meisten Fällen geht es den Betrügern schlicht darum, sich einen unfairen Vorteil zu verschaffen, was natürlich den Interessen der Dota-Community und dem zugrundeliegenden Gedanken der Wettkampfintegrität und der Fairness zuwiderläuft. Nichtsdestotrotz stoßen wir manchmal auf Dinge, aus denen wir lernen und die wir dazu nutzen können, das Spielerlebnis für alle Dota-Spieler zu verbessern (oder zumindest für diejenigen, die nicht wegen Cheats ausgeschlossen wurden).",
      "Das Bannen von Helden vor dem Beginn einer Partie ist ein Beispiel dafür: Im vergangenen Jahr zielten viele Cheats darauf ab, während der zehn Sekunden der Heldenbannphase einen Vorteil zu erlangen. Wir haben uns die ursprünglichen Ziele dieser Phase vor Augen geführt; nämlich den Spielern die Möglichkeit zu geben, ihre Präferenzen bezüglich der Helden zu äußern, gegen die sie nicht spielen wollen, ohne jedoch Spieler, die nur mit wenigen Helden vertraut sind, in diesem Szenario zu benachteiligen. Unter Berücksichtigung der verfügbaren Daten haben wir uns anschließend die Frage gestellt, ob es eine Möglichkeit gibt, wie wir die genannten Ziele besser erreichen und gleichzeitig andere Probleme lösen können.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Mit dem heutigen Update haben wir die Bannphase zu Beginn einer Partie entfernt und durch die in Ihrem Dota-Account gespeicherten Bannpräferenzen ersetzt. Im Tab „Helden“ können Sie bis zu vier Helden auswählen, gegen die Sie in Ihren Partien nicht spielen wollen. Wenn Sie einer Partie über die Spielsuche beitreten, wird garantiert mindestens einer dieser Helden gebannt. Sie können die Liste der Helden mit Bannpräferenz jederzeit ändern. (Falls Sie Plätze für Heldenbanns leer lassen, ist es möglich, dass einer dieser leeren Plätze als Ihr „zu bannender Held“ ausgewählt wird. Mit anderen Worten: Wenn Sie die Plätze leer lassen, können Sie die Bannphase nicht mehr beeinflussen.)",
      "Das neue System behebt eine Reihe von Problemen: Erstens, Spieler vergessen nicht mehr zu bannen. Zweitens, vorgeschlagene Banns können nicht mehr vom Spiel ignoriert werden. Und drittens, eine zeitgebundene und somit stressige Entscheidung entfällt, denn die Wahl der Spieler fällt oft meist auf dieselben Helden. Darüber hinaus wird es nun unmöglich, Helden basierend auf den Daten einer abgeschlossenen Partie gezielt zu bannen, egal ob diese von bekannten Persönlichkeiten oder zufälligen Spielern gespielt werden.",
      "Einige Spielmodi (z. B. Captains Mode, Captains Draft, Ability Draft und Turbo) verfügen entweder wie bisher über keine Bannphase oder nutzen von diesem Standard abweichende Bannregeln. Diese Modi bleiben von den Änderungen unberührt.",
      "[h2]Spielkoordinator-Analyse vor Beginn einer Partie (für Dota Plus)[/h2]",
      "Millionen Dota-Spieler interagieren täglich mit dem Spielkoordinator und jeder Einzelne hat andere Prioritäten bei der Suche nach einer Partie. Einige Spieler ziehen es vor, Zeit zu sparen und so schnell wie möglich einer Partie beizutreten, und nehmen deshalb eine höhere Abweichung des Spielvermögens in Kauf. Andere hingegen legen Wert darauf, dass jede Partie perfekt ausbalanciert ist, und nehmen längere Wartezeiten in Kauf, um gute Chancen auf eine möglichst enge Partie zu erhalten. Wieder andere interessieren sich weniger für das Spielvermögen der anderen Spieler als vielmehr für deren Persönlichkeit und Verhalten im Spiel.",
      "Wir wollten schon lange eine Funktion entwickeln, die es den Spielern ermöglicht, Partien zu finden, die besser zu ihren individuellen Präferenzen passen. Bisherige Versuche stießen auf zwei Hauptprobleme:",
      "[list]",
      "[*]Erstens: Spieler sind vielleicht gut darin, anderen Menschen ihre Präferenzen mitzuteilen, jedoch gelingt ihnen das weniger gut, wenn der Adressat ein komplexer Algorithmus zur Spielsuche ist („Ich schätze eine Abweichung des Spielvermögens von 13 % mehr als der durchschnittliche Dota-Spieler“). Wie können wir also Werkzeuge schaffen, mit denen die Spieler ihre Präferenzen einfach und direkt ausdrücken können?",
      "[*]Zweitens: Änderungen am Spielkoordinator wirken sich auf alle Dota-Spieler aus, deshalb ist Vorsicht geboten. Der Spielkoordinator versucht stets, ein Gleichgewicht zwischen den Präferenzen der einzelnen Spieler und der generellen Spielbarkeit von Dota herzustellen. (Wenn Dota-Partien schlecht verlaufen, sei es aufgrund extremer Abweichungen des Spielvermögens oder schlechtem Spielerverhalten, dann ist das generell schlecht für die Dota-Community. Wenn alle Partien perfekt ausbalanciert verlaufen, aber es jeweils drei Stunden dauert, die passenden Spieler zu finden, wäre das ebenfalls schlecht.) Ändern wir die Funktionen für den Spielkoordinator für alle Spieler gleichzeitig, riskieren wir einen Zusammenbruch der Spielsuche. Und wenn das passiert, zerstören wir Dota. Wie können wir also neue Funktionen für den Spielkoordinator einführen und herausfinden, wie sie in der Praxis funktionieren, während wir das Risiko für Dota insgesamt gering halten?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Im Rahmen des neuen experimentellen Werkzeugs Dota Labs (wofür derzeit Dota Plus erforderlich ist) veröffentlichen wir eine Reihe neuer Funktionen, die sich Spieler schon lange gewünscht haben: Wenn eine Partie gefunden wird, zeigt Dota Plus an, welche Informationen zur Abweichung des Spielvermögens und zum Spielerverhalten der Spielkoordinator bei der Bewertung der Partie herangezogen hat. Sie haben dann die Möglichkeit, diese Partie anzunehmen oder auf eine andere Partie zu warten, die besser zu Ihnen und Ihren aktuellen Präferenzen passt.",
      "Bei der Entwicklung dieser Funktion haben wir darauf geachtet, dass alle bereitgestellten Informationen es den Spielern ermöglichen, ihre individuellen Präferenzen für die von ihnen bevorzugten Partien auszudrücken, aber keinen Wettkampfvorteil gewähren. Dota Plus zeigt Ihnen an, ob die Abweichung des Spielvermögens in einer Partie hoch oder niedrig ist, aber nicht, ob Sie und Ihr Team das obere oder das untere Ende bilden.",
      "Warum handelt es sich dabei um eine Funktion für Dota Plus? Die einzige Möglichkeit, um feststellen zu können, wie Millionen von Dota-Spieler mit einer Funktion interagieren, besteht in deren Veröffentlichung. Wir haben zwar umfangreiche Modellrechnungen durchgeführt, aber dennoch birgt die Einführung ein echtes Risiko: Wir könnten uns irren, was die Nutzung dieser Funktion durch die Spieler oder die Auswirkungen auf die Spielsuche in Dota angeht. Aber die Befürchtung, wir [i]könnten[/i] falschliegen, hält uns nicht davon ab, eine Funktion zu implementieren, von der Millionen Dota-Spieler profitieren könnten. Deshalb haben wir uns in diesem Fall für ein Experiment entschieden. Indem wir die Funktion im Rahmen von Dota Plus veröffentlichen, wird der Zugang beschränkt und damit einhergehend auch das Risiko für Dota, und wir können unbesorgt herausfinden, wie die Spieler damit interagieren. Wie bei den anderen Funktionen in Dota Labs wird die Zeit und Ihr Feedback zeigen, ob die Funktion weiterentwickelt, überarbeitet oder eingestampft wird.",
      "[h2]Blick in die Zukunft[/h2]",
      "Wir sind uns bewusst, dass sich viele von Ihnen auf das große Update „Thronsturz“ freuen. Auch wir können es kaum erwarten, es Ihnen endlich präsentieren zu dürfen. Wir arbeiten gerade an den letzten Feinheiten und planen die Veröffentlichung für Mitte April. Bis dann!"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1711060378,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}