{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Mise à jour du gameplay 7.35d et fonctionnalités de matchmaking",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060377
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711058969
      }
    ]
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mise à jour du gameplay 7.35d et fonctionnalités de matchmaking",
    "posttime": 1711060378,
    "updatetime": 1711060378,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Nous venons de publier la [url=https://www.dota2.com/patches/7.35d]mise à jour du gameplay 7.35d[/url] (Chen l'a bien mérité !), et avec elle, son lot de nouvelles fonctionnalités.",
      "[h2]Les bannissements d'unités héroïques en matchmaking repensés[/h2]",
      "L'année passée, nous avons pris de nombreuses mesures concrètes pour lutter contre les [url=https://www.dota2.com/newsentry/3677788723152833273]programmes tiers de triche[/url] et la [url=https://www.dota2.com/newsentry/3884981125532748791]prolifération des comptes smurfs[/url]. Lorsque nous étudions ces moyens de triche, nous cherchons principalement à comprendre leur fonctionnement, et à identifier la meilleure façon de les détecter pour mieux les arrêter. Mais ce faisant, nous nous demandons également pourquoi ces outils tiers sont utilisés en premier lieu. Le plus souvent, ils permettent « d'obtenir un avantage injuste », ce qui va évidemment à l'encontre des valeurs de la communauté Dota, et des principes de compétition et d'équité qui la caractérisent. Malgré tout, nous avons encore beaucoup à découvrir et à utiliser pour améliorer l'expérience Dota pour tout le monde (en tout cas pour toutes les personnes qui n'ont pas été bannies pour tricherie).",
      "Les bannissements d'unités héroïques avant le match en sont une bonne illustration. L'année dernière, de nombreuses astuces de triche visaient l'obtention d'un avantage pendant la phase de bannissement des unités héroïques de dix secondes au début de chaque partie. Cette phase poursuit certains objectifs clés : que toute personne puisse exprimer sa préférence quant aux unités héroïques qu'elle ne souhaite pas affronter, en évitant les scénarios où les joueurs et joueuses qui ne disposent que d'une collection d'unités héroïques restreinte seraient définitivement exclus. Nous les avons examinés à la lumière de certaines données, en nous demandant s'il était possible de mieux servir ces objectifs tout en résolvant d'autres problèmes en même temps.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "La mise à jour d'aujourd'hui supprime la phase de bannissement de début de match. Nous l'avons remplacée par les préférences de bannissement enregistrées sur votre compte. Si vous chargez l'onglet des unités héroïques, vous pouvez sélectionner les quatre héros et héroïnes que vous ne souhaitez pas voir dans vos parties. Lorsque vous rejoignez une partie du matchmaking, vous avez la garantie qu'au moins une de ces unités héroïques sera bannie. Vous pouvez modifier la liste des unités héroïques bannies à tout moment. (Si vous laissez des emplacements de bannissement vides, il est possible qu'ils soient sélectionnés comme votre « unité héroïque bannie ». En d'autres termes, il n'y a aucun avantage à laisser des emplacements vides.)",
      "Ce nouveau système résout un certain nombre de problèmes rencontrés par le système précédent. Pour commencer, vous ne pouvez pas oublier de bannir un héros ou une héroïne. Vous n'avez pas non plus à vous rappeler que parfois des bannissements demandés sont ignorés par le jeu. Enfin, vous n'avez plus besoin de vous dépêcher de prendre une décision stressante qui est, de toute façon, très souvent prise de la même manière par l'ensemble des joueurs et joueuses. En prime, cela rend également les bannissements ciblés impossibles, qu'ils handicapent des personnalités connues ou des personnes choisies au hasard lors d'un match lambda pour lequel vous avez fait vos recherches.",
      "Certains modes de jeu (par exemple, Captains Mode, Captains Draft, Ability Draft, Turbo) étaient déjà dépourvus de la phase de bannissement d'avant-match ou comportaient des règles de bannissement spécifiques. Ces modes restent inchangés.",
      "[h2]Statistiques du matchmaking d'avant-match de Dota Plus[/h2]",
      "Chaque jour, des millions de joueurs et joueuses de Dota interagissent avec le système de matchmaking et toutes et tous recherchent des parties avec des priorités qui leur sont propres. Certaines personnes préfèrent démarrer une partie le plus rapidement possible et tolèrent un écart de niveau assez large pour gagner du temps. D'autres préfèrent que chaque partie soit parfaitement équilibrée et acceptent d'attendre plus longtemps pour décrocher un match qui sera ardemment disputé. D'autres encore n'ont que faire des différences de niveau entre participant(e)s et se focalisent plutôt sur les personnalités et comportements en jeu.",
      "Cela fait longtemps que nous souhaitions construire des fonctionnalités permettant à quiconque de trouver des parties plus en phase avec ses préférences individuelles. Nos tentatives précédentes se sont heurtées à deux problèmes principaux.",
      "[list]",
      "[*]Pour commencer, bien que les joueurs et joueuses sachent bien décrire leurs préférences à d'autres gens, les formuler sous forme d'entrées à un algorithme de matchmaking mondial et complexe leur est souvent difficile (« L'écart de niveau qui me va le mieux se situe à 13 % au-dessus de la moyenne des joueurs et joueuses de Dota ! »). Comment créer des outils qui permettent à la communauté d'exprimer leur préférence de manière directe et naturelle ?",
      "[*]Ensuite, toute la communauté Dota est affectée par les modifications apportées au matchmaking, nous procédons donc généralement avec précaution. L'outil de matchmaking tente toujours de trouver un équilibre entre les préférences individuelles de jeu et la bonne marche de Dota dans son ensemble. (Si les parties de Dota sont de mauvaise qualité, en raison d'écarts de niveau élevés ou de comportements inacceptables, c'est toute la communauté Dota qui en souffre. Si chaque partie est parfaite, mais qu'il faut trois heures pour les organiser, c'est tout aussi préjudiciable). La mise à disposition de nouvelles fonctionnalités du matchmaking à tout le monde en même temps risque de casser le matchmaking, et par extension, Dota. Comment sortir ces nouvelles fonctionnalités et recueillir des données sur leur application, sans risquer d'endommager Dota ?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Dans le cadre de nos expériences au sein du nouveau Dota Labs, et dans un premier temps limitée aux comptes Dota Plus, nous sortons la première itération d'une fonctionnalité réclamée depuis longtemps par la communauté Dota : quand vous rechercherez une partie dans le jeu, Dota Plus vous fournira des renseignements sur la méthode d'évaluation d'un match par l'outil de matchmaking, comme une estimation de l'écart de niveau et les notes de conduite des joueurs et joueuses par exemple. Vous pourrez accepter le match ou retourner en file d'attente dans l'espoir d'une meilleure partie, plus en accord avec vos préférences.",
      "Lors de la création de cette fonctionnalité, nous avons fait attention à ce que chaque ajout d'information de notre part puisse permettre aux joueurs et joueuses d'exprimer leurs préférences personnelles sur le genre de parties recherchées sans pour autant accorder un quelconque avantage compétitif. Le nouveau panneau vous informera si l'écart entre les niveaux des participant(e)s d'une partie est grand ou pas, sans dire quelle équipe a un éventuel avantage.",
      "Pourquoi cette fonctionnalité est-elle cantonnée à Dota Labs ? Le seul moyen de vérifier comment des millions de joueurs et joueuses Dota vont réagir à cette nouvelle fonctionnalité est de la sortir, c'est donc ce que nous faisons. Nous avons construit des modèles poussés, mais tout risque n'est pas écarté : la communauté pourrait utiliser cette fonctionnalité de façon complètement inattendue pour nous ou le matchmaking de Dota pourrait être affecté dans sa globalité. Nous ne voulons pas céder aux craintes que cela constitue [i]peut-être[/i] une grosse erreur, alors que cette fonctionnalité a le potentiel d'améliorer l'expérience de millions de personnes jouant à Dota. C'est pourquoi nous la sortons sous la forme d'une expérience. Son apparition au sein de Dota Plus en limite l'accès, et corolairement réduit les risques pour Dota, tout en nous permettant d'étudier comment les joueurs et joueuses l'utilisent. Comme pour les autres fonctionnalités de Dota Labs, le temps et vos commentaires détermineront si elle sera conservée, modifiée ou supprimée.",
      "[h2]À venir[/h2]",
      "Nous savons que beaucoup d'entre vous attendent « La chute de la Couronne » avec impatience, et nous avons hâte de vous présenter cette mise à jour. Nous peaufinons ce nouveau chapitre et pensons le publier à la mi-avril. À bientôt !"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1711060378,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}