{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "7.35d Oynanış Güncellemesi ve Eşleştirme Özellikleri",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060377
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711058969
      }
    ]
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "7.35d Oynanış Güncellemesi ve Eşleştirme Özellikleri",
    "posttime": 1711060378,
    "updatetime": 1711060378,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "[url=https://www.dota2.com/patches/7.35d]7.35d Oynanış Güncellemesini[/url] (Chen bunu hak ediyor) ve bununla birlikte bir dizi yeni özelliği yayınladık.",
      "[h2]Eşleştirmelerdeki Kahraman Yasaklamaları Değiştirildi[/h2]",
      "Geçtiğimiz yıl boyunca, hile yapmak için üçüncü taraf yazılımları kullanan kullanıcılara [url=https://www.dota2.com/newsentry/3677788723152833273]birtakım[/url] [url=https://www.dota2.com/newsentry/3884981125532748791]somut yaptırımlar[/url] uyguladık. Bu hileleri incelerken, esas olarak nasıl işlediklerini anlamaya ve bunları durdurmak üzere tespit etmeye odaklanıyoruz. Ancak bunu yaparken bazı hilecilerin neden bu araçları kullanma ihtiyacı hissettiklerini de merak ediyoruz. En yaygın sebep, Dota topluluğunun isteklerine ve bu topluluğun temeli olan rekabetçilik ve adalet duygusuna açıkça aykırı olan \"haksız avantaj elde etmektir\". Durum böyle olsa bile, Dota deneyimini herkes için (en azından hile nedeniyle yasaklanmayan herkes için) geliştirmek amacıyla öğrenebileceğimiz ve yararlanabileceğimiz pek çok şey var.",
      "Maç öncesi kahraman yasaklamaları buna bir örnektir. Geçen yıl birçok hileci, her oyunun başlangıcındaki on saniyelik kahraman yasağı aşamasında avantaj elde etmeye odaklandı. Bu aşamanın asıl amacını kendimize hatırlattık: Küçük kahraman havuzlarına sahip oyuncuların kalıcı olarak oyun dışı edildiği durumlar yaratmadan, oyuncuların karşı karşıya oynamak istemedikleri kahramanları tercih etmelerine olanak sağlamak. Ardından bazı verileri inceledik ve diğer sorunları çözerken aynı zamanda bu amaca daha iyi hizmet etmenin bir yolu olup olmadığını merak ettik.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Bu güncellemeyle, maç başlangıcındaki yasaklama aşamasını kaldırdık ve bunun yerine, hesabınızda kayıtlı yasaklama tercihlerini getirdik. Kahramanlar sekmesini açıp oyunlarınızda görmek istemediğiniz dört kahramanı seçebilirsiniz. Bir eşleştirme oyununa katıldığınızda seçtiğiniz kahramanlardan en az biri yasaklanır. Yasaklanan kahramanlar listenizi istediğiniz zaman değiştirebilirsiniz. (Yasaklama yuvalarının bazılarını boş bırakırsanız, bu boş yuvalardan birinin \"yasaklanan kahraman\" olarak seçilme ihtimali vardır. Yani, yuvaları boş bırakmak herhangi bir avantaj sağlamaz.)",
      "Bu yeni sistem, önceki sistemdeki bazı sorunları gideriyor: Yasaklamayı unutamazsınız. Önerilen yasaklamaların bazen oyun tarafından göz ardı edildiğini öğrenmenize gerek yok. Stresli bir karar vermek için sınırlı bir zamanınız yok, sonuçta çoğu oyuncu neredeyse her zaman aynı seçimi yapıyor. Dahası, bu yasaklamalar ister tanınan oyunculara ister verilerini incelediğiniz halka açık maçlardaki rastgele oyunculara yönelik olsun, hedefli yasaklamaları da imkânsız hâle getirir.",
      "Bazı oyun modlarında (Kaptan Modu, Kaptan Çekilişi, Yetenek Çekilişi, Turbo) ya oyun öncesi yasaklama aşaması yoktu ya da zaten standart olmayan yasaklama kuralları vardı. Bu modlarda bir değişiklik yapılmadı.",
      "[h2]Dota Plus Maç Öncesi Eşleştirme Analizi[/h2]",
      "Milyonlarca Dota oyuncusu her gün eşleştirme sistemini kullanıyor ve her birinin maç ararken farklı öncelikleri var. Bazı oyuncular maçlara mümkün olduğunca çabuk girmeyi tercih ettiğinden, zamandan tasarruf etmek için oyunlardaki büyük yetenek farklılıklarını kabul ediyor. Diğerleri ise her maçın mükemmel bir şekilde dengeli olmasını istiyor ve bu olasılık için daha uzun süre beklemeye hazırlar. Bazı oyuncular da, diğer oyuncuların yetenek seviyelerinden ziyade oyundaki kişilik ve davranışlarını önemserler.",
      "Uzun zamandır oyuncuların bireysel tercihlerine daha uygun eşleştirmeler bulmasını sağlayacak özellikler geliştirmek istiyorduk. İlk girişimlerimizde iki temel sorunla karşılaştık:",
      "[list]",
      "[*]Birincisi, oyuncular tercihlerini başkalarına iyi bir şekilde açıklayabilseler de, bunları karmaşık, küresel bir eşleştirme algoritmasına açıklayamayabilirler (\"Ortalama bir Dota oyuncusundan %13 daha yüksek bir yetenek farklılığını tercih ediyorum!\"). Oyuncuların tercihlerini doğal bir şekilde ve doğrudan ifade etmelerine olanak tanıyan araçları nasıl oluşturabiliriz?",
      "[*]İkincisi, eşleştirmede yapılan değişiklikler tüm Dota oyuncularını etkiliyor, bu yüzden temkinli davranmaya çalışıyoruz. Eşleştirme sistemi her zaman bireysel oyuncu tercihleri ve bir bütün olarak Dota deneyiminin kalitesi arasında bir denge bulmaya çalışır. (Sonuçta, Dota maçları aşırı yetenek farklılıkları veya uygunsuz oyuncu davranışları nedeniyle iyi bir deneyim sunmuyorsa tüm Dota topluluğu bundan zarar görür. Aynı şekilde, tüm maçlar mükemmelse ama bu maçları bulmak üç saat sürüyorsa, bu da iyi bir senaryo değil.) Yeni eşleştirme özelliklerini herkese aynı anda sunarsak eşleştirme sistemini ve dolayısıyla Dota oyununu bozma riskiyle karşı karşıya kalırız. Dota'nın tamamını riske atmadan yeni eşleştirme özelliklerini nasıl kullanıma sunabilir ve bunların pratikte nasıl çalıştığını nasıl öğrenebiliriz?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Dota Laboratuvarı'nın yeni deneysel çatısı altında ve başlangıçta yalnızca Dota Plus ile sınırlı olacak şekilde Dota oyuncularının uzun zamandır istediği bir özelliğin ilk versiyonunu yayınlıyoruz. Dota'da bir maç bulduğunuzda, Dota Plus size, oyuncuların yetenek aralığı ve davranış puanları gibi sistemin eşleştirmeyi nasıl değerlendirdiğine dair bazı bilgiler sunacaktır. Daha sonra size bu eşleştirmeyi kabul etme veya mevcut tercihleriniz için daha uygun bir maçı beklemek üzere eşleştirmeye dönme seçeneği sunulacaktır.",
      "Bu özelliği oluştururken, dâhil ettiğimiz bilgilerin, oyuncuların tercih ettikleri maçlara ilişkin bireysel tercihlerini ifade etmelerine olanak tanırken herhangi bir rekabet avantajı sağlamamasına dikkat ettik. Yeni pencere, bir maçtaki oyuncuların yetenek aralığının yüksek veya düşük olduğunu belirtirken, sizin ve takımınızın yüksek veya düşük seviyede olup olmadığını belirtmeyecek.",
      "Bu neden bir Dota Laboratuvarı özelliği? Milyonlarca Dota oyuncusunun bir özellikle etkileşimini tam olarak test etmenin tek yolu, bu özelliği yayınlamaktır, biz de tam olarak bunu yapıyoruz. Kapsamlı bir modelleme yaptık ancak yine de oyuncuların bu özelliği nasıl kullanacakları veya bunun genel Dota eşleştirme deneyimini nasıl etkileyeceği konusunda yanılıyor olabiliriz ve bu ciddi bir risk. [i]Yanılıyor olabileceğimize[/i] dair korkuların bizi milyonlarca Dota oyuncusuna fayda sağlayabilecek bir şey yapmaktan alıkoymasına izin vermek istemiyoruz, bu yüzden bu özelliği bir deney olarak sunuyoruz. Bu özelliği Dota Plus'ta yayınlayarak erişimi sınırlandırıyor ve dolayısıyla oyuncuların bu özellikle nasıl etkileşime girdiğini öğrendikçe Dota'ya yönelik riski de sınırlandırmış oluyoruz. Diğer Dota Laboratuvarı özelliklerinde olduğu gibi, bu özellik de zamanla ve geri bildirimlerinizle gelişebilir, değişebilir veya tamamen kullanımdan kaldırılabilir.",
      "[h2]İleriye Doğru[/h2]",
      "Birçoğunuzun \"Tacın Düşüşü\"nü sabırsızlıkla beklediğini biliyoruz ve biz de bunu size sunmak için sabırsızlanıyoruz. Bu güncellemeyi tamamlamak üzereyiz ve nisan ortasında yayınlamayı planlıyoruz. Görüşmek üzere."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1711060378,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}