{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Parche de jugabilidad 7.35d y características de emparejamiento",
  "event_type": 13,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Parche de jugabilidad 7.35d y características de emparejamiento",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Acabamos de lanzar el [url=https://www.dota2.com/patches/7.35d]parche de jugabilidad 7.35d[/url] (Chen se lo tenía merecido), que incluye una nueva serie de características.",
      "[h2]Nuevo diseño del veto de héroes durante el emparejamiento[/h2]",
      "Durante aproximadamente el último año, hemos tomado [url=https://www.dota2.com/newsentry/3677788723152833273]una serie[/url] de [url=https://www.dota2.com/newsentry/3884981125532748791]acciones visibles[/url] contra quienes hacen trampas de terceros. A medida que investigamos cada trampa, nuestro principal objetivo es entender qué hacen, y cómo rastrearlo y detenerlo. No obstante, también nos preguntamos qué lleva a estas personas a hacer este tipo de trampas. La razón más habitual es «para tener una ventaja injusta», que, obviamente, contradice los deseos de la comunidad de Dota y el propio sentido de justicia y competitividad. Aun así, a veces podemos aprender algo, y lo utilizamos para mejorar la experiencia de Dota para todo el mundo (o, al menos, para todo el mundo que no tiene un bloqueo por hacer trampas).",
      "Los vetos de héroes antes de la partida son buen ejemplo de ello. Este último año, numerosas trampas se centraron en obtener una ventaja durante la fase de veto de héroes de diez segundos que tiene lugar al comienzo de cada partida. Reflexionamos sobre los objetivos originales de esta fase (permitir que los jugadores expresen contra qué héroes prefieren no jugar, pero sin crear situaciones en las que los jugadores sin muchas opciones para elegir héroes queden excluidos permanentemente), revisamos algunos datos, y nos planteamos si había alguna manera mejor de cumplir estos objetivos y solucionar otros problemas al mismo tiempo.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Con la actualización de hoy, sustituimos la fase de veto del inicio de la partida por preferencias de veto asociadas a tu cuenta. Al abrir la pestaña de héroes, podéis seleccionar los cuatro que no queréis que estén en vuestras partidas y tendréis la garantía de que al menos uno de ellos quedará vetado cuando entréis en un emparejamiento. Podéis cambiar la lista de héroes vetados cuando queráis. Si vetáis menos de cuatro, puede que una de las casillas que habéis dejado vacías se seleccione como vuestro «héroe vetado». Es decir, dejar casillas vacías no supone ninguna ventaja.",
      "El nuevo sistema aborda varios problemas que presentaba el anterior: ya no es posible olvidarse de vetar héroes; no hay que aprender que, a veces, el juego ignora las sugerencias de vetos; no habrá un límite de tiempo para tomar una decisión estresante que, al fin y al cabo, la mayoría de los jugadores repetían casi siempre. Una ventaja añadida es que imposibilita los vetos dirigidos en partidas públicas de las que os habéis informado, ya sean contra jugadores conocidos o aleatorios.",
      "Algunos modos de juego (Modo capitán, Selección con capitán, Selección de habilidades y Turbo) no tenían fase de veto al inicio de la partida o tenían normas de veto diferentes a las estándares. Esos modos no han cambiado.",
      "[h2]Análisis del emparejamiento previo a la partida con Dota Plus[/h2]",
      "Cada día, millones de jugadores buscan partidas en el emparejamiento de Dota, cada uno con sus propias prioridades. Algunos quieren entrar en una partida cuanto antes y aceptan una desviación mayor en cuanto al nivel de habilidad para ahorrar tiempo. Otros quieren que sus partidas estén perfectamente equilibradas y no les importa esperar más tiempo para tener partidas más reñidas. También hay jugadores que no se preocupan tanto por el nivel de habilidad de los demás, pero su personalidad y su comportamiento durante el juego les importan mucho más.",
      "Hace tiempo que queremos desarrollar características que permitan a los jugadores encontrar partidas que encajen mejor con sus preferencias. Nuestros primeros intentos se encontraron con dos problemas principales:",
      "[list]",
      "[*]En primer lugar, aunque a los jugadores se les da bien describir sus preferencias a los demás, eso no significa que se les dé bien describírselas a un algoritmo de emparejamiento mundial y complejo («¡Me importa la desviación de habilidad un 13 % más que al jugador de Dota promedio!»). ¿Cómo podemos crear herramientas para que los jugadores expresen sus preferencias de forma directa y natural?",
      "[*]En segundo lugar, como los cambios en el emparejamiento afectan a todos los jugadores de Dota, procuramos no correr demasiados riesgos. El emparejamiento siempre intenta equilibrar las preferencias de cada jugador con la salud de Dota en general. Si las partidas de Dota son malas, ya sea por unas diferencias de habilidad enormes o por el mal comportamiento de algunos jugadores, suponen un impacto negativo para toda la comunidad de Dota. Si todas las partidas son perfectas, pero tardan tres horas en formarse, también es malo. Al introducir nuevas características para todo el mundo en el emparejamiento, nos arriesgamos a estropearlo y, si estropeamos el emparejamiento, estropeamos Dota. ¿Cómo podemos lanzar nuevas características de emparejamiento y observar cómo funcionan manteniendo el nivel de riesgo bajo para Dota en general?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Dentro del nuevo entorno experimental de los Laboratorios de Dota, y en primer lugar solo para Dota Plus, lanzamos la primera versión de una característica que los jugadores nos han pedido una y otra vez: al encontrar una partida de Dota, Dota Plus presentará algunos datos sobre cómo ha evaluado la partida el sistema de emparejamiento, como un cálculo aproximado del rango de habilidad y de las puntuaciones de comportamiento de los jugadores. Podréis aceptar la partida o volver a poneros a la cola para buscar otra que se adapte mejor a vuestras preferencias.",
      "Al desarrollar esta característica, pusimos mucho cuidado para asegurarnos de que la información que incluye permita a los jugadores expresar sus preferencias respecto a las partidas, pero sin darles ningún tipo de ventaja competitiva. El nuevo cuadro de diálogo indicará si la desviación de habilidad entre los jugadores de una partida es alta o baja, pero no en qué lado de la balanza estáis tú y tu equipo.",
      "¿Por qué es una característica de los Laboratorios de Dota? Como la única forma de saber con seguridad cómo van a interactuar millones de jugadores de Dota con una característica es lanzarla, eso es lo que hemos hecho. Hemos realizado una tarea de modelado exhaustiva, pero existe el riesgo de que nos equivoquemos en cuanto a cómo se va a usar la característica o cómo va a afectar a la experiencia de emparejamiento en general. No queremos que la [i]posibilidad[/i] de equivocarnos nos impida hacer algo que puede beneficiar a millones de jugadores de Dota, así que lo ponemos en marcha como un experimento. Al lanzarlo en Dota Plus, se limita el acceso y el riesgo para Dota mientras observamos cómo interactúan los jugadores con esta característica. Igual que sucede con las demás características de los Laboratorios de Dota, el tiempo y vuestros comentarios nos dirán si crece, cambia o la retiramos.",
      "[h2]De cara al futuro[/h2]",
      "Sabemos que muchos de vosotros estáis deseando que llegue la Caída de la Corona. ¡Nosotros también! Estamos rematándolo todo y esperamos lanzarla a mediados de abril. ¡Hasta entonces!"
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}