{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Ενημέρωση παιχνιδιού 7.35d και χαρακτηριστικά εύρεσης παιχνιδιού",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ενημέρωση παιχνιδιού 7.35d και χαρακτηριστικά εύρεσης παιχνιδιού",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Κυκλοφορήσαμε μόλις την [url=https://www.dota2.com/patches/7.35d]Ενημέρωση παιχνιδιού 7.35d[/url] (ο Chen πήγαινε γυρεύοντας) και μαζί της μια νέα σειρά χαρακτηριστικών.",
      "[h2]Ανασχεδιασμός του αποκλεισμού ηρώων στην εύρεση παιχνιδιού[/h2]",
      "Τον τελευταίο χρόνο, έχουμε λάβει [url=https://www.dota2.com/newsentry/3677788723152833273]πολλά[/url] και [url=https://www.dota2.com/newsentry/3884981125532748791]ξεκάθαρα μέτρα[/url] εναντίον όσων χρησιμοποιούν δόλιο λογισμικό τρίτων. Ενώ ερευνούμε κάθε παράβαση, κύριος στόχος μας είναι να καταλάβουμε πώς τη διαπράττουν, πώς να την εντοπίσουμε και πώς να τη σταματήσουμε. Ταυτόχρονα, όμως, ερευνούμε και τους λόγους που οδηγούν τους παίκτες στη χρήση αυτών των εργαλείων. Η πιο συνηθισμένη εξήγηση είναι το «αθέμιτο πλεονέκτημα», το οποίο είναι σαφώς αντίθετο με την κοινότητα του Dota, όπως και το πνεύμα της ευγενούς άμιλλας που τη διέπει. Παρ' όλα αυτά, εξακολουθούμε να μαθαίνουμε πράγματα, τα οποία και χρησιμοποιούμε για να βελτιώσουμε την εμπειρία του Dota για όλους (ή τουλάχιστον για όλους όσοι δεν έχουν αποκλειστεί για παραβάσεις).",
      "Χαρακτηριστικό παράδειγμα αποτελούν οι αποκλεισμοί ηρώων πριν από το παιχνίδι. Πέρυσι, πολλές από τις παραβάσεις είχαν σκοπό την απόκτηση πλεονεκτήματος στη φάση αποκλεισμού ηρώων, που διαρκεί δέκα δευτερόλεπτα στην αρχή κάθε παιχνιδιού. Καθίσαμε και αναλύσαμε τον αρχικό σκοπό αυτής της φάσης, δηλαδή το να αφήνουμε τους παίκτες να δείξουν με ποιους ήρωες δεν θέλουν να αναμετρηθούν, χωρίς όμως να αποκλείονται οριστικά οι παίκτες που έχουν μικρό σύνολο ηρώων. Εξετάσαμε μερικά δεδομένα και αναρωτηθήκαμε αν υπάρχει καλύτερος τρόπος να υλοποιήσουμε αυτόν τον σκοπό, λύνοντας ταυτόχρονα και άλλα προβλήματα.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Με τη σημερινή ενημέρωση, η φάση αποκλεισμού στην αρχή του αγώνα αντικαθίσταται με προτιμήσεις αποκλεισμού που αποθηκεύονται στον λογαριασμό σας. Στην καρτέλα «Ήρωες», πλέον μπορείτε να επιλέξετε τέσσερις ήρωες που δεν θέλετε να βλέπετε στα παιχνίδια σας. Όταν μπαίνετε σε έναν αγώνα εύρεσης παιχνιδιού, είναι σίγουρο ότι τουλάχιστον ένας από αυτούς θα αποκλείεται. Μπορείτε να αλλάξετε τη λίστα αποκλεισμένων ηρώων σας όποτε θέλετε. (Αν αφήσετε κενή κάποια θέση αποκλεισμού, η κενή θέση ενδέχεται να επιλεγεί ως ο «αποκλεισμένος ήρωάς» σας. Με άλλα λόγια, δεν κερδίζετε κάτι αφήνοντας τις θέσεις κενές.)",
      "Αυτό το νέο σύστημα διευθετεί διάφορα προβλήματα του προηγούμενου συστήματος. Για παράδειγμα, δεν θα ξεχνάτε να αποκλείσετε ήρωες, δεν θα πρέπει να ξέρετε ότι το παιχνίδι ενίοτε αγνοεί τους προτεινόμενους αποκλεισμούς και δεν θα πρέπει να βιαστείτε να πάρετε μια δύσκολη απόφαση που, στο κάτω κάτω, είναι σχεδόν πάντα η ίδια για όλους τους παίκτες. Και επιπλέον, μπαίνει τέλος στους στοχευμένους αποκλεισμούς, είτε εναντίον γνωστών προσωπικοτήτων είτε εναντίον τυχαίων παικτών σε δημόσιους αγώνες, για τους οποίους αναζητήσατε τα δεδομένα.",
      "Μερικοί τύποι παιχνιδιού (Captains Mode, Captains Draft, Ability Draft, Turbo), είτε δεν είχαν φάση αποκλεισμού πριν το παιχνίδι είτε είχαν ήδη μη τυπικούς κανόνες αποκλεισμού. Αυτοί οι τύποι παιχνιδιού παραμένουν ως έχουν.",
      "[h2]Ανάλυση εύρεσης παιχνιδιού πριν τον αγώνα από Dota Plus[/h2]",
      "Εκατομμύρια παίκτες Dota χρησιμοποιούν κάθε μέρα το σύστημα εύρεσης παιχνιδιού και ο καθένας έχει διαφορετικές προτεραιότητες, όταν αναζητά ένα παιχνίδι. Μερικοί προτιμούν να μπαίνουν σε αγώνες όσο το δυνατόν πιο γρήγορα για να γλιτώσουν χρόνο, παρά τη μεγαλύτερη διαφορά ικανοτήτων στο παιχνίδι. Άλλοι θέλουν κάθε αγώνας να είναι απόλυτα ισορροπημένος και είναι διατεθειμένοι να περιμένουν περισσότερο, ώστε το παιχνίδι να έχει ομάδες παρόμοιων ικανοτήτων. Άλλοι παίκτες δεν νοιάζονται τόσο για το επίπεδο ικανοτήτων, όσο για την προσωπικότητα και τη συμπεριφορά των άλλων παικτών στο παιχνίδι.",
      "Εδώ και πολύ καιρό, θέλουμε να φτιάξουμε χαρακτηριστικά που θα επιτρέπουν στους παίκτες να βρουν αγώνες που ταιριάζουν καλύτερα με τις ατομικές τους προτιμήσεις. Στις πρώτες μας προσπάθειες, αντιμετωπίσαμε δύο μεγάλα προβλήματα:",
      "[list]",
      "[*]Πρώτον, παρότι οι παίκτες μπορούν να περιγράφουν καλά τις προτιμήσεις τους σε άλλους, δεν το κάνουν πάντα εξίσου καλά όταν τις περιγράφουν σε έναν σύνθετο, παγκόσμιο αλγόριθμο εύρεσης παιχνιδιού («Προτιμώ τη διακύμανση ικανοτήτων 13% πάνω από τον μέσο παίκτη Dota!»). Πώς μπορούμε να δημιουργήσουμε εργαλεία που θα τους επιτρέπουν να εκφράζουν τις προτιμήσεις τους απλά και άμεσα;",
      "[*]Δεύτερον, οι αλλαγές στο σύστημα εύρεσης παιχνιδιού επηρεάζουν όλους τους παίκτες Dota, οπότε προσπαθούμε να είμαστε προσεκτικοί. Το σύστημα εύρεσης παιχνιδιού έχει πάντα στόχο να εξισορροπεί τις προτιμήσεις του κάθε παίκτη και την εύρυθμη λειτουργία του Dota συνολικά. (Αν οι αγώνες στο Dota είναι κακοί, είτε λόγω μεγάλης διαφοράς ικανοτήτων είτε λόγω κακής συμπεριφοράς των παικτών, αυτό επηρεάζει αρνητικά ολόκληρη την κοινότητα. Αν κάθε αγώνας είναι τέλειος, αλλά χρειάζεται τρεις ώρες για να αρχίσει, ούτε αυτό είναι καλό.) Αν κυκλοφορήσουμε νέα χαρακτηριστικά εύρεσης παιχνιδιού ταυτόχρονα σε όλους, υπάρχει περίπτωση να χαλάσει το σύστημα εύρεσης παιχνιδιού. Και αν χαλάσει αυτό, χαλάει όλο το Dota. Πώς μπορούμε να κυκλοφορήσουμε νέα χαρακτηριστικά εύρεσης παιχνιδιού και να μάθουμε πώς λειτουργούν στην πράξη, χωρίς να διακινδυνεύσουμε τη λειτουργία του Dota συνολικά;",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Με τη νέα δυνατότητα για πειραματισμούς στο Κέντρο Έρευνας Dota, που προσωρινά περιορίζεται μόνο στο Dota Plus, κυκλοφορούμε την πρώτη έκδοση ενός χαρακτηριστικού, το οποίο οι παίκτες του Dota μας ζητούσαν ανέκαθεν. Όταν βρίσκετε έναν αγώνα στο Dota, το Dota Plus θα εμφανίζει πληροφορίες με εκτιμήσεις για τον αγώνα από το σύστημα εύρεσης παιχνιδιού, όπως μια εκτίμηση του εύρους ικανοτήτων και των βαθμολογιών συμπεριφοράς των παικτών. Θα μπορείτε να αποδεχθείτε τον αγώνα ή να μπείτε ξανά σε εύρεση παιχνιδιού, για να βρείτε έναν αγώνα που ταιριάζει καλύτερα σε εσάς και τις προτιμήσεις σας.",
      "Ενώ φτιάχναμε αυτό το χαρακτηριστικό, θέλαμε να βεβαιωθούμε ότι οι πληροφορίες που παρέχουμε θα επιτρέπουν στους παίκτες να εκφράζουν τις ατομικές τους προτιμήσεις σχετικά με τους αγώνες, χωρίς να έχουν οποιοδήποτε ανταγωνιστικό πλεονέκτημα. Το νέο παράθυρο θα σας ενημερώνει αν το εύρος ικανοτήτων των παικτών σε έναν αγώνα είναι μεγάλο ή μικρό, αλλά δεν θα σας λέει σε ποιο από τα δύο άκρα βρίσκεστε εσείς και η ομάδα σας.",
      "Γιατί είναι αυτό χαρακτηριστικό του Κέντρου Έρευνας Dota; Ο μόνος τρόπος για να μάθουμε σίγουρα πώς θα χρησιμοποιηθεί ένα χαρακτηριστικό από εκατομμύρια παίκτες Dota, είναι να το κυκλοφορήσουμε, οπότε κάνουμε ακριβώς αυτό. Παρά την εκτενή μοντελοποίηση που κάναμε, εξακολουθεί να υπάρχει ένα σημαντικό ρίσκο: Μπορεί να κάνουμε λάθος για το πώς θα χρησιμοποιήσουν οι παίκτες αυτό το χαρακτηριστικό ή για το πώς θα επηρεάσει συνολικά την εύρεση παιχνιδιού στο Dota. Δεν θέλουμε να σταθεί αυτός ο φόβος εμπόδιο σε κάτι που μπορεί να ωφελήσει εκατομμύρια παίκτες Dota, οπότε το κυκλοφορούμε ως πείραμα. Η κυκλοφορία εντός του Dota Plus περιορίζει την πρόσβαση σε αυτό και, επομένως, το ρίσκο στο Dota, καθώς μαθαίνουμε πώς το χρησιμοποιούν οι παίκτες. Όπως και με τα άλλα χαρακτηριστικά του Κέντρου Έρευνας Dota, με τον καιρό, με τα σχόλια και με τις παρατηρήσεις σας θα φανεί αν θα αναπτυχθεί, αν θα αλλάξει και αν θα αποσυρθεί.",
      "[h2]Το μέλλον[/h2]",
      "Γνωρίζουμε ότι πολλοί περιμένετε πώς και πώς το Crownfall και ανυπομονούμε να σας το φέρουμε. Ολοκληρώνουμε κάποιες τελευταίες λεπτομέρειες και αναμένουμε ότι θα κυκλοφορήσει στα μέσα του Απριλίου. Τα λέμε τότε."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}