{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Spilopdatering 7.35d og matchmakingfunktioner",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Spilopdatering 7.35d og matchmakingfunktioner",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Vi har netop udgivet [url=https://www.dota2.com/patches/7.35d]spilopdatering 7.35d[/url] (Chen var selv ude om det), og med den kommer der et nyt sæt funktioner.",
      "[h2]Ændring af helteforbud i matchmaking[/h2]",
      "I løbet af det sidste års tid har vi lavet [url=https://www.dota2.com/newsentry/3677788723152833273]flere[/url] [url=https://www.dota2.com/newsentry/3884981125532748791]synlige tiltag[/url] overfor brugere, som snyder ved hjælp af tredjepartsprogrammer. Når vi undersøger metoder til snyd, forsøger vi primært at forstå, hvad de gør, og hvordan vi kan spore og stoppe det. Men mens vi gør det, spørger vi også os selv, hvorfor nogle snydere føler, at det overhovedet er nødvendigt at bruge disse værktøjer. Den mest almindelige forklaring er \"for at få en uretfærdig fordel\", hvilket selvfølgelig strider imod Dota-miljøets ønsker og følelsen af konkurrenceånd og retfærdighed. Ikke desto mindre er der stadig ting, vi kan lære og bruge til at gøre Dota-oplevelsen bedre for alle (eller i det mindste alle, som ikke er blevet udelukket på grund af snyd).",
      "Helteforbud før kampen er et eksempel på dette. Sidste år fokuserede mange snydemetoder på at opnå en fordel i den 10 sekunder lange helteforbudsfase i begyndelsen af hver kamp. Vi tog et skridt tilbage for at se på de oprindelige mål for fasen: at lade spillere udtrykke en præference for, hvilke helte de ikke ville spille mod, men uden at skabe scenarier, hvor spillere med små heltepuljer blev låst ude permanent. Vi kiggede på data og spurgte, om der var en bedre måde at opnå målene på og samtidigt løse andre problemer.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Med opdateringen i dag har vi fjernet forbudsfasen i begyndelsen af kampen og erstattet den med forbudspræferencer, som gemmes på din konto. Hvis du åbner heltefanen, kan du vælge fire helte, du ikke vil have med i dine kampe. Når du spiller en kamp i matchmaking, er det garanteret, at mindst én af heltene er udelukket. Du kan ændre listen over forbudte helte, når som helst du vil. (Hvis du lader nogle af forbudspladserne stå tomme, er det muligt, at en tom plads bliver valgt som din \"forbudte helt\". Der er med andre ord ingen fordel ved at lade pladser stå tomme).",
      "Det nye system tackler et antal problemer, som det gamle system havde: Man kan ikke glemme at forbyde, man behøver ikke at finde ud af, at spillet nogle gange ignorerer foreslåede forbud, og man behøver ikke at stresse over at tage en hurtig beslutning, som i sidste ende er den samme for de fleste spillere hver gang. Som en ekstra bonus bliver det umuligt at målrette forbud, uanset om forbuddene er imod kendte personligheder eller tilfældige spillere i en offentlig kamp, som du har slået data op for.",
      "Nogle spiltilstande (Captains Mode, Captains Draft, Ability Draft, Turbo) havde enten ikke en forbudsfase før kampen eller havde i forvejen andre forbudsregler. Disse tilstande er uændrede.",
      "[h2]Analyse før kampen i Dota Plus[/h2]",
      "Millioner af Dota-spillere bruger matchmakeren hver dag, og de har alle forskellige prioriteringer, når de leder efter en kamp. Nogle foretrækker at komme ind i en kamp så hurtigt som muligt og er villige til at acceptere en større variation i færdighedsniveauer i kampen for at spare lidt tid. Andre vil have, at hver enkelt kamp er perfekt afbalanceret, og er villige til at vente i længere tid på den bedste chance for en tættere kamp. Andre spillere går mindre op i de andre spilleres færdighedsniveau og meget mere i deres personlighed og adfærd i spillet.",
      "Vi har længe ønsket at udvikle funktioner, så spillere kan finde kampe, der bedre stemmer overens med deres individuelle præferencer. I vores tidlige forsøg stødte vi på to primære problemer:",
      "[list]",
      "[*]For det første, selvom spillere er gode til at beskrive deres præferencer til andre mennesker, så er de ikke nødvendigvis gode til at beskrive dem som input til en kompleks global matchmakingalgoritme (eksempelvis \"jeg ønsker en variation i færdighedsniveau, som er 13% højere end den gennemsnitlige Dota-spiller\"). Hvordan kan vi lave et værktøj, som lader spillere udtrykke deres præferencer på en naturlig og direkte måde?",
      "[*]For det andet vil ændringer i matchmakeren påvirke alle Dota-spillere, så vi er meget forsigtige. Matchmakeren prøver altid på at finde en balance mellem individuelle spillerpræferencer og Dotas overordnede trivsel. (Hvis Dota-kampe er dårlige, enten på grund af stor forskel på spillernes færdighedsniveau eller dårlig spilleropførsel, skader det hele Dota-fællesskabet. Hvis hver eneste kamp er perfekt, men det tager tre timer at få den startet, så er det også skidt). Hvis nye matchmakingfunktioner er tilgængelige for alle på én gang, risikerer vi, at funktionen bryder sammen, og hvis funktionen bryder sammen, så bryder Dota sammen. Hvordan kan vi udgive nye matchmakingfunktioner og lære, hvordan de fungerer i praksis, mens vi samtidigt sørger for, at risikoen for Dota som helhed er lav?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Under Dota Labs' nye eksperimentelle paraply udgiver vi (i første omgang kun til Dota Plus) den første udgave af en funktion, som Dota-spillere har bedt om i lang tid: Når du finder en kamp i Dota, vil Dota Plus præsentere nogle oplysninger om, hvordan matchmakeren har evalueret kampen, såsom et skøn over færdighedsspændet og spillernes opførselsscore. Du kan derefter acceptere den pågældende kamp eller stille dig i kø igen for at vente på en kamp, som passer bedre til dig og dine aktuelle præferencer.",
      "Vi var forsigtige, da vi lavede denne funktion for at sikre, at alle oplysninger, vi inkluderede, ville give spillere mulighed for at udtrykke deres individuelle præferencer om, hvilke slags kampe de foretrak, men uden at give nogen form for konkurrencemæssig fordel. Den nye dialogboks kan fortælle, om variationen i spillernes færdighedsniveau i en kamp er høj eller lav, men ikke om du eller dit hold er i den høje eller lave ende.",
      "Hvorfor er dette en Dota Labs-funktion? Den eneste måde, vi kan vide med sikkerhed, hvordan millioner af Dota-spillere vil bruge en funktion, er at udgive den, så det er det, vi gør. Vi har lavet omfattende modelleringsarbejde, men det er stadigvæk risikabelt: Vi kan tage fejl om, hvordan spillere vil bruge funktionen, eller hvordan den vil påvirke den overordnede matchmakingoplevelse i Dota. Men vi vil ikke lade frygten for, at vi [i]måske[/i] tager fejl, holde os fra at gøre noget, som potentielt kan gavne millioner af Dota-spillere, så vi udgiver dette som et eksperiment. Ved at udgive funktionen inde i Dota Plus begrænses adgangen, og dermed risikoen for Dota, mens vi lærer om, hvordan spillere interagerer med den. Som med andre Dota Labs-funktioner vil tiden og jeres feedback afgøre, om funktionen skal udvides, ændres eller lægges på hylden.",
      "[h2]Fremadrettet[/h2]",
      "Vi ved, at mange af jer ser frem til Crownfall, og vi glæder os til at få det ud til jer. Vi er ved at sætte kronen på værket og forventer at udgive i midten af april. Vi ses snart."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}