{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Cập nhật lối chơi 7.35d và tính năng xếp trận",
  "event_type": 13,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Cập nhật lối chơi 7.35d và tính năng xếp trận",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Chúng tôi vừa phát hành [url=https://www.dota2.com/patches/7.35d]bản cập nhật lối chơi 7.35d[/url] (Chen cũng có ngày nhận quả báo), và kèm theo đó là bộ tính năng mới.",
      "[h2]Làm lại hệ thống cấm tướng khi xếp trận[/h2]",
      "Trong năm qua, chúng tôi đã tiến hành [url=https://www.dota2.com/newsentry/3677788723152833273]một loạt[/url] các [url=https://www.dota2.com/newsentry/3884981125532748791]hành động nổi bật[/url] chống lại những người dùng sử dụng phần mềm gian lận bên thứ ba. Trong khi điều tra từng tình huống gian lận, chúng tôi chủ yếu tập trung tìm hiểu sâu về những gì chúng đang làm và và cách chúng tôi có thể theo dõi và ngăn chặn. Nhưng trong khi làm thế, chúng tôi cũng tự hỏi tại sao người chơi gian lận cảm thấy phải bắt đầu sử dụng các công cụ đó. Cách giải thích thường thấy nhất là \"giành lấy lợi thế bất công về mình\", đương nhiên điều này đi ngược lại với mong muốn của cộng đồng Dota và ý thức cạnh tranh công bằng. Cho dù thế, đôi khi vẫn có thứ để chúng tôi học, và sử dụng để cải thiện trải nghiệm Dota cho mọi người (hoặc ít nhất những ai chưa nhận lệnh cấm vì gian lận).",
      "Cấm tướng trước trận đấu là một ví dụ cho điều này. Rất nhiều hành động gian lận trong năm qua tập trung vào việc giành ưu thế trong khoảng thời gian 10 giây cấm tướng ở đầu trận đấu. Chúng tôi lùi lại một bước để nhìn các mục tiêu ban đầu của giai đoạn này — cho người chơi thể hiện họ không muốn chọi với các tướng nào hơn, nhưng không tạo ra tình huống những ai chơi được ít tướng hơn sẽ bị chặn đường hẳn — nhìn vào những dữ liệu đó, chúng tôi tự hỏi có cách nào để thực hiện các mục tiêu này trong khi giải quyết vấn đề khác cùng lúc.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Với bản cập nhật hôm nay, chúng tôi đã gỡ bỏ giai đoạn cấm tướng ở đầu trận đấu và thay thế bằng tùy chọn cấm tướng lưu sẵn trong tài khoản của bạn. Nếu mở thẻ tướng, bạn có thể chọn bốn tướng không muốn thấy trong trận đấu. Đảm bảo khi bạn tham gia một trận qua hệ thống xếp trận, sẽ có ít nhất một trong số các tướng đó bị cấm. Bạn có thể thay đổi danh sách tướng bị cấm bất cứ lúc nào bạn muốn. (Nếu bạn để vài chỗ trống, có thể những chỗ trống đó sẽ được chọn làm \"tướng bị cấm\" của bạn. Nói cách khác, không có lợi lộc gì khi bỏ trống cả).",
      "Hệ thống mới giải quyết một loạt vấn đề của hệ thống trước đó: bạn không thể quên cấm tướng; bạn không phải ngộ ra rằng đôi khi đề nghị tướng cấm sẽ bị trò chơi phớt lờ; bạn không bị áp lực thời gian để đưa ra lựa chọn căng não, để rồi cuối cùng, hầu hết mọi người đều chọn gần như giống nhau cả. Thêm vào đó, nó cũng khiến các lệnh cấm nhằm vào ai đó không thể xảy ra nữa, cho dù đó là cấm để chống lại người chơi nổi tiếng hay người chơi ngẫu nhiên trong phòng công khai mà bạn đã tra trước thông tin.",
      "Một số chế độ (vd: Captains Mode, Captains Draft, Ability Draft, Turbo) không có giai đoạn cấm trước trận đấu, hoặc có các luật lệ cấm không theo tiêu chuẩn. Những chế độ đó sẽ không thay đổi.",
      "[h2]Phân tích hệ thống xếp trận trước trận đấu của Dota Plus[/h2]",
      "Hàng triệu người chơi Dota tương tác với hệ thống xếp trận mỗi ngày và mỗi người đều có ưu tiên khác nhau khi tìm trận. Một số muốn vào trận nhanh nhất có thể, và sẵn sàng chấp nhận độ lệch kỹ năng lớn hơn trong trận đấu để tiết kiệm thời gian. Có người thì lại muốn mỗi trận đấu phải cân bằng tới mức hoàn hảo, và sẵn sàng chờ lâu hơn cho cơ hội tối ưu để vào được trận phù hợp nhất. Vài người khác thì không quan tâm lắm đến trình độ kĩ năng của những người chơi cùng, mà tập trung vào tính cách và hành vi trong trận hơn.",
      "Chúng tôi từ lâu đã muốn xây dựng các tính năng cho phép người chơi tìm trận phù hợp với sở thích cá nhân hơn. Những lần thử nghiệm ban đầu gặp hai vấn đề chính:",
      "[list]",
      "[*]Trước tiên, dù người chơi mô tả tốt sở thích của họ cho người khác, nhưng họ không hẳn giỏi diễn giải mong muốn dưới dạng dữ liệu đầu vào cho các thuật toán xếp trận phức tạp và toàn cục (\"Tôi coi trọng độ lệch kỹ năng cao hơn 13% so với người chơi Dota khác!\"). Làm sao để chúng tôi tạo các công cụ cho phép người chơi thể hiện mong muốn theo cách tự nhiên và trực tiếp nhất?",
      "[*]Thứ hai, những thay đổi về hệ thống xếp trận ảnh hưởng tới tất cả người chơi Dota, nên chúng tôi muốn thận trọng hơn. Hệ thống xếp trận luôn cố gắng cân bằng giữa tùy chọn của mỗi cá nhân người chơi và tình trạng của cả trò chơi Dota. (Nếu trận đấu Dota diễn ra quá tệ, dù là vì khoảng cách kỹ năng quá lớn hoặc do hành vi kém từ người chơi, thì cũng đều không tốt cho cả cộng đồng Dota. Nếu mỗi trận diễn ra hoàn hảo, nhưng mất ba giờ chờ đợi, thì cũng không hay tí nào). Ra mắt tính năng xếp trận mới tới tất cả mọi người cùng một lúc có nguy cơ phá hỏng hệ thống xếp trận, và phá hỏng hệ thống xếp trận cũng đồng nghĩa với phá hỏng cả Dota. Làm sao để chúng tôi cung cấp các tính năng xếp trận mới và tìm hiểu cách hoạt động thực tế trong khi giảm thiểu rủi ro đối với Dota nói chung?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "Trong môi trường thử nghiệm mới của Dota Labs, và ban đầu chỉ giới hạn trong Dota Plus, chúng tôi đã tung ra một loạt tính năng còn sơ khai mà người chơi Dota đã yêu cầu từ rất lâu: Khi bạn tìm trận trong Dota, Dota Plus sẽ hiển thị một số thông tin về cách hệ thống xếp trận đánh giá trận đấu, như ước tính phạm vi kỹ năng và điểm hành vi. Bạn sẽ có cơ hội chấp nhận trận đấu đó hoặc tìm lại để chờ một trận đấu tốt hơn cho bạn và tùy chọn hiện tại.",
      "Chúng tôi đã cẩn thận khi xây dựng tính năng này để đảm bảo tất cả thông tin được thêm vào sẽ giúp người chơi thể hiện tùy chọn cá nhân về kiểu trận đấu mong muốn, nhưng không tạo bất kỳ ưu thế cạnh tranh nào. Hộp thoại mới sẽ cho bạn biết độ lệch kỹ năng cao hay thấp giữa những người chơi, nhưng không chỉ ra bạn và đội của bạn ở mức trên hay dưới.",
      "Tại sao đây là tính năng Dota Labs? Cách duy nhất để biết chắc hàng triệu người chơi Dota có tương tác với tính năng hay không là phát hành nó, vì thế chúng tôi đang làm đây. Dù đã thực hiện nhiều mô hình khác nhau, nhưng nó vẫn có rủi ro thực sự: Chúng tôi có thể hiểu sai về cách người chơi sẽ sử dụng tính năng này hoặc nó sẽ ảnh hưởng tới trải nghiệm xếp trận nói chung trong Dota như thế nào. Chúng tôi không muốn nỗi lo sợ [i]có thể[/i] mình làm sai ngăn chúng tôi làm điều gì đó có ích cho hàng triệu người chơi Dota, vì thế chúng tôi đã ra mắt tính năng này dưới dạng thử nghiệm. Ra mắt tính năng trong Dota Plus sẽ giới hạn quyền truy cập, vì thế, giới hạn rủi ro cho Dota trong khi chúng tôi tìm hiểu rõ hơn cách mọi người tương tác với nó. Cũng như với các tính năng Dota Labs khác, thời gian và ý kiến đóng góp của các bạn sẽ quyết định việc phát triển, thay đổi, hay dừng phát triển tính năng này.",
      "[h2]Hướng tới tương lai[/h2]",
      "Chúng tôi biết các bạn vẫn đang ngóng chờ Phế Đế, và chúng tôi cũng mong muốn đưa bản cập nhật tới tay bạn. Chúng tôi đang hoàn tất và dự tính sẽ phát hành giữa tháng tư. Hẹn gặp bạn khi đó."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 28,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}