{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja rozgrywki 7.35d i funkcje wyszukiwania gier",
  "event_type": 13,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aktualizacja rozgrywki 7.35d i funkcje wyszukiwania gier",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Właśnie wydaliśmy [url=https://www.dota2.com/patches/7.35d]aktualizację rozgrywki 7.35d[/url] (Chenowi się należało), a towarzyszy jej nowy zestaw funkcji.",
      "[h2]Przerobiony proces banowania bohaterów w wyszukiwanych grach[/h2]",
      "W ciągu ostatniego roku (czy jakoś tak) podjęliśmy [url=https://www.dota2.com/newsentry/3677788723152833273]wiele[/url] [url=https://www.dota2.com/newsentry/3884981125532748791]widocznych działań[/url] przeciwko użytkownikom zewnętrznych usług do oszukiwania. Przy badaniu każdego oszustwa skupiamy się głównie na zrozumieniu sposobu ich działania oraz jak możemy je śledzić i powstrzymywać. Jednak gdy to robimy, zadajemy sobie również pytanie, co w ogóle skłania oszustów do użycia tych narzędzi. Najczęstszym wyjaśnieniem jest „uzyskanie nieuczciwej przewagi”, co oczywiście jest sprzeczne z wolą społeczności Dota oraz poczuciem rywalizacji i czystej gry będącej w jej sercu. Mimo to wciąż czasami trafiają się rzeczy, których możemy się dowiedzieć i użyć wynikającej z nich wiedzy do poprawy komfortu grania w Dota 2 dla wszystkich (a przynajmniej dla tych, którzy nie otrzymali blokady za oszukiwanie).",
      "Banowanie bohaterów przed grą stanowi tego przykład. Wiele oszustw w zeszłym roku skupiało się na zdobyciu przewagi podczas trwającej 10 sekund fazy banowania bohaterów na początku każdej gry. Zrobiliśmy krok wstecz, by przyjrzeć się pierwotnym założeniom tej fazy, czyli pozwoleniu graczom na wyrażenie preferencji dotyczących bohaterów, przeciwko którym nie chcą grać, jednak bez tworzenia scenariuszy, gdzie gracze z niewielką pulą postaci zostają trwale wykluczeni. Rzuciliśmy okiem na pewne dane i zadaliśmy pytanie, czy istnieje sposób, dzięki któremu lepiej służylibyśmy tym celom i jednocześnie rozwiązywali inne problemy.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "W dzisiejszej aktualizacji usunęliśmy fazę banowania przed rozpoczęciem meczu i zastąpiliśmy ją preferencjami dotyczącymi banów przechowywanymi na waszych kontach. Po wczytaniu zakładki bohaterów możecie wybrać 4 postacie, których nie chcielibyście zobaczyć w swoich grach. Macie gwarancję, że po dołączeniu do wyszukanego meczu co najmniej jedna z tych postaci zostanie zbanowana. Możecie zmienić listę zbanowanych bohaterów w dowolnym momencie. Jeśli pozostawicie niektóre miejsca na bany puste, to możliwe, że puste miejsce zostanie wybrane jako wasz „zbanowany bohater”. Innymi słowy, pozostawienie pustych miejsc nie przyniesie wam żadnych korzyści.",
      "Ten nowy system odnosi się do zbioru problemów obecnych w poprzednim systemie: nie zapomnicie o banowaniu, nie dowiecie się, że czasami sugerowane bany są ignorowane przez grę, ani nie będziecie pod presją czasu na dokonanie stresującej decyzji, którą ostatecznie większość graczy prawie zawsze podejmuje w taki sam sposób. Dodatkowo system ten uniemożliwia bany celujące w konkretne osoby, niezależnie od tego, czy są to bany przeciwko znanym osobistościom, czy też przypadkowym graczom w meczu publicznym, o którym podejrzeliście dane.",
      "Niektóre tryby gry (np. Captains Mode, Captains Draft, Ability Draft i Turbo) albo nie miały fazy banowania przed grą, albo miały już swoje niestandardowe zasady dla tego działania. Te tryby pozostały niezmienione.",
      "[h2]Dane analityczne systemu wyszukiwania gier przed meczem (Dota Plus)[/h2]",
      "Miliony graczy Dota 2 codziennie wchodzą w interakcje z systemem wyszukiwania gier, a priorytety każdego z nich w zakresie poszukiwania meczów są inne. Niektórzy wolą dostać się do meczu tak szybko, jak to możliwe, i są gotowi zaakceptować większą rozbieżność umiejętności w grze, aby zaoszczędzić trochę czasu. Inni chcą, aby każdy mecz był idealnie zrównoważony i są gotowi zaczekać dłużej na najlepszą szansę w najbliższej grze. Jeszcze inni nie przejmują się za bardzo poziomem umiejętności innych graczy, a znacznie bardziej ich osobowością i zachowaniem w grze.",
      "Od dawna chcieliśmy stworzyć funkcje umożliwiające graczom znajdowanie meczów, które lepiej pasują do ich indywidualnych preferencji. We wczesnych próbach napotkaliśmy 2 główne problemy:",
      "[list]",
      "[*]Po pierwsze, mimo że gracze są dobrzy w opisywaniu swoich preferencji innym ludziom, to niekoniecznie idzie im tak dobrze w tej kwestii, gdy trzeba zrobić to samo w postaci danych wprowadzanych do złożonego, nadrzędnego algorytmu wyszukiwania gier („Cenię rozbieżność w umiejętnościach o 13% wyższą niż przeciętny gracz Dota!”). Jak możemy stworzyć narzędzia, które pozwolą graczom wyrazić ich preferencje w naturalny i bezpośredni sposób?",
      "[*]Po drugie, zmiany w systemie wyszukiwania gier wpływają na wszystkich graczy Dota, więc mamy skłonności do bycia ostrożnymi. System wyszukiwania meczów zawsze poszukuje złotego środka między indywidualnymi preferencjami graczy a całościową stabilnością/jakością gry, jaką jest Dota 2. Jeśli mecze są kiepskie, czy to z powodu niemiłosiernych luk w umiejętnościach, czy też niewłaściwego zachowania graczy, to jest to jednocześnie niezdrowe dla Dota jako społeczności. Jeśli każdy mecz jest idealny, ale do jego utworzenia potrzeba 3 godzin, to też jest niedobrze. Nowe funkcje systemu wyszukiwania gier dostępne dla wszystkich w tym samym momencie tworzą ryzyko popsucia systemu, a jeśli on się popsuje, to Dota wraz z nim. Jak możemy udostępniać nowe funkcje wyszukiwania gier i uczyć się, jak działają w praktyce, a jednocześnie utrzymywać ryzyko dla Dota 2 jako całości na niskim poziomie?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "W ramach nowego eksperymentalnego szyldu laboratoriów Dota (i początkowego ograniczenia do Dota Plus) udostępniamy pierwszą wersję funkcji, o którą gracze prosili nas od zawsze – gdy wyszukacie mecz, Dota Plus zaprezentuje was pewne informacje dotyczące tego, jak system wyszukiwania gier ocenił mecz, np. oszacowanie zakresu umiejętności i ocen zachowania graczy. Będziecie mieli szansę zaakceptować dany mecz albo wrócić do kolejki i poczekać na mecz, który jest lepszy według was i waszych obecnych preferencji.",
      "Podczas tworzenia tej funkcji kierowaliśmy się ostrożnością, by upewnić się, że wszelkie zamieszczone w niej przez nas informacje pozwolą graczom wyrazić ich indywidualne preferencje dotyczące rodzaju meczów, ale nie przyznają im żadnej przewagi w zakresie rywalizacji. Nowe okno może poinformować was, że rozbieżność poziomu umiejętności graczy w danym meczu jest wysoka lub niska, ale nie zdradzi wam, czy wasza drużyna jest na wyższym, czy niższym krańcu.",
      "Dlaczego zdecydowaliśmy się na umieszczenie tej funkcji w ramach laboratoriów Dota? Jedynym sposobem na poznanie, jak miliony graczy Dota 2 będą korzystać z danej funkcji jest jej udostępnienie, więc czynimy właśnie to. Przeprowadziliśmy obszerne modelowanie, ale nadal istnieje realne ryzyko – możemy mylić się co do sposobu, w jaki gracze będą korzystać z tej funkcji lub jak wpłynie ona na ogólny proces korzystania z wyszukiwania gier w Dota 2. Nie chcemy pozwolić tym obawom, że [i]możemy[/i] się mylić, powstrzymać nas przed zrobieniem czegoś, co może przynieść korzyści milionom graczy Dota 2, więc udostępniamy funkcję jako eksperyment. Udostępnienie jej w ramach Dota Plus ogranicza dostęp i odpowiednio amortyzuje ryzyko dla gry, a my w tym czasie zdobywamy wiedzę na temat tego, jak wszyscy z niej korzystają. Podobnie jak w przypadku innych funkcji laboratoriów Dota, to czas i wasze opinie pokażą nam, czy funkcja się rozwinie, zmieni, czy może zostanie wycofana.",
      "[h2]Co dalej[/h2]",
      "Zdajemy sobie sprawę, że wielu z was oczekuje z niecierpliwością na Utraconą Koronę, a my nie możemy doczekać się przekazania jej w wasze ręce. Kończymy właśnie prace nad nią i spodziewamy się wydania jej w połowie kwietnia. Wtedy zobaczymy się ponownie."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}