{
  "gid": "6127782523022178336",
  "clan_steamid": "103582791433224455",
  "event_name": "Aggiornamento di gioco 7.35d e funzionalità di ricerca delle partite",
  "event_type": 13,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1711060320,
  "rtime32_end_time": 1711065601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1711054255
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1711060576
      },
      {
        "strSteamID": "76561198099775662",
        "rtUpdated": 1711060855
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1711063068
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1711411172
      }
    ],
    "rt_migrated_time": 1711063057.788
  },
  "announcement_body": {
    "gid": "6127782523022178337",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aggiornamento di gioco 7.35d e funzionalità di ricerca delle partite",
    "posttime": 1711060378,
    "updatetime": 1711411172,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]",
      "Abbiamo appena rilasciato l'[url=https://www.dota2.com/patches/7.35d]Aggiornamento di gioco 7.35d [/url] (Chen se l'è cercato), e con esso una nuova serie di funzionalità.",
      "[h2]Modificati i ban degli Eroi durante la ricerca delle partite[/h2]",
      "Nel corso dell'ultimo anno circa, abbiamo intrapreso [url=https://www.dota2.com/newsentry/3677788723152833273]svariate[/url] [url=https://www.dota2.com/newsentry/3884981125532748791]azioni visibili[/url] contro gli utenti che fanno uso di cheat di terze parti. Quando analizziamo ogni cheat, cerchiamo sopratutto di capire come agisce e come possiamo rintracciarlo e fermarlo. Ma, nel contempo, ci chiediamo anche perché alcuni cheater si sentano in dovere di usare questi strumenti. La spiegazione più semplice è \"ottenere un vantaggio ingiusto\", che ovviamente va contro i desideri della Comunità di Dota e il senso di competitività ed equità che ne rappresenta le fondamenta. Ciononostante, possiamo ancora imparare tante cose che possiamo usare per migliorare l'esperienza di Dota per tutti (o almeno per tutti coloro che non sono stati banditi per aver barato).",
      "I ban degli Eroi pre-partita ne sono un esempio. Molti cheat dell'anno scorso si concentravano sull'ottenere un vantaggio durante la fase di dieci secondi di ban degli Eroi all'inizio di ogni partita. Abbiamo fatto un passo indietro per esaminare gli obiettivi originali di questa fase, ovvero consentire ai giocatori di esprimere una preferenza per gli Eroi contro cui non volevano giocare, ma senza creare scenari in cui i giocatori con gruppi di Eroi ridotti venissero esclusi a tempo indefinito. Abbiamo esaminato alcuni dati e ci siamo chiesti se esistesse un modo per raggiungere meglio questi obiettivi risolvendo contemporaneamente altri problemi.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]",
      "Con l'aggiornamento di oggi abbiamo rimosso la fase di ban all'inizio della partita e l'abbiamo sostituita con le preferenze di ban memorizzate nell'account. Se carichi la scheda degli Eroi, puoi selezionare i quattro Eroi che non vuoi vedere nelle tue partite. Quando ti unisci a una ricerca delle partite, avrai la garanzia che almeno uno di essi sarà bandito. Puoi modificare l'elenco degli Eroi banditi ogni volta che vuoi. (Se lasci vuoti alcuni slot per i ban, è possibile che lo slot vuoto venga selezionato come \"Eroe bandito\". In altre parole, non c'è alcun vantaggio nel lasciare slot vuoti.)",
      "Questo nuovo sistema risolve una serie di problemi del sistema precedente: non puoi dimenticarti di bandire; non devi imparare che a volte i ban suggeriti vengono ignorati dal gioco; non hai un tempo limitato per prendere una decisione stressante che, alla fine, la maggior parte dei giocatori prende quasi sempre allo stesso modo. In più, rende anche impossibili i ban mirati, sia che si tratti di ban contro personaggi noti o giocatori casuali in una partita pubblica per la quale hai cercato i dati.",
      "Alcune modalità di gioco (ad esempio, Captains Mode, Captains Draft, Ability Draft, Turbo) non avevano una fase di ban pre-partita o avevano già regole di ban non standard. Queste modalità sono rimaste invariate.",
      "[h2]Analisi della ricerca delle partite pre-partita di Dota Plus[/h2]",
      "Milioni di giocatori di Dota interagiscono ogni giorno con la ricerca delle partite e ognuno di loro ha priorità diverse quando cerca una partita. Alcuni preferiscono iniziare una partita il più rapidamente possibile e sono disposti ad accettare una maggiore varietà di abilità nella partita per risparmiare tempo. Altri vogliono che ogni partita sia perfettamente bilanciata e sono disposti ad aspettare più a lungo per aumentare le probabilità di trovare la partita perfetta. Altri giocatori sono meno interessati al livello di abilità degli altri giocatori e molto di più alla loro personalità e comportamento in gioco.",
      "Da tempo desideravamo creare delle funzionalità che consentissero ai giocatori di trovare le partite più adatte alle loro preferenze individuali. I primi tentativi hanno incontrato due problemi principali:",
      "[list]",
      "[*]Innanzitutto, mentre i giocatori sono bravi a descrivere le proprie preferenze agli altri, non sono necessariamente bravi a descrivere le proprie preferenze come input per un algoritmo di ricerca delle partite complesso e globale (\"Preferisco una varietà delle abilità del 13% superiore alla media dei giocatori di Dota!\"). Come possiamo creare strumenti che consentano ai giocatori di esprimere le proprie preferenze in modo naturale e diretto?",
      "[*]In secondo luogo, le modifiche alla ricerca delle partite riguardano tutti i giocatori di Dota, quindi tendiamo a essere cauti. La ricerca delle partite cerca sempre di trovare un equilibrio tra le preferenze dei singoli giocatori e il benessere di Dota nel suo insieme. (Se le partite di Dota sono sgradevoli, a causa di enormi differenze nelle abilità o di un cattivo comportamento dei giocatori, è un male per tutta la Comunità di Dota. Se tutte le partite sono perfette, ma impiegano tre ore per formarsi, anche questo è negativo.) Le nuove funzionalità di ricerca delle partite disponibili per tutti contemporaneamente rischiano di danneggiare la ricerca delle partite, e se questo succede si danneggia anche Dota. Come possiamo fornire nuove funzionalità di ricerca delle partite e vedere se funzionano nella pratica limitando i rischi per Dota nel suo complesso?",
      "[/list]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]",
      "All'interno del nuovo modello sperimentale dei Dota Labs, e inizialmente limitata a Dota Plus, stiamo rilasciando la prima fase di una funzionalità che i giocatori di Dota ci chiedono da sempre: quando trovi una partita in Dota, Dota Plus presenterà alcune informazioni sul modo in cui la ricerca delle partite ha valutato la partita, sotto forma di stima del livello di abilità e dei punteggi di comportamento dei giocatori. Avrai la possibilità di accettare quella partita o metterti in coda per aspettare una partita migliore per te e per le tue preferenze attuali.",
      "Abbiamo creato questa funzionalità con attenzione per assicurarci che tutte le informazioni che abbiamo incluso consentissero ai giocatori di esprimere le preferenze individuali sui tipi di partite che preferiscono, ma senza garantire vantaggi competitivi di alcun tipo. La nuova finestra di dialogo può dirti se la varietà di abilità dei giocatori in una partita è alta o bassa, ma non se tu e la tua squadra siete nella fascia alta o in quella bassa.",
      "Perché è una funzionalità dei Dota Labs? L'unico modo per sapere con certezza in che modo milioni di giocatori di Dota interagiranno con una funzionalità è distribuirla, quindi è quello che stiamo facendo. Abbiamo effettuato una modellazione approfondita, ma corriamo realmente il rischio di sbagliarci sul modo in cui i giocatori utilizzeranno questa funzionalità o su come influirà sull'esperienza complessiva di ricerca delle partite in Dota. Non vogliamo lasciare che il timore di [i]sbagliare[/i] ci impedisca di fare qualcosa che possa giovare a milioni di giocatori di Dota, quindi lo presentiamo come un esperimento. La distribuzione all'interno di Dota Plus limita l'accesso e di conseguenza il rischio per Dota man mano che scopriamo in che modo tutti i giocatori interagiscono con questa funzionalità. Come per le altre funzionalità dei Dota Labs, il tempo e i vostri feedback contribuiranno a stabilire se crescerà, verrà modificata oppure ritirata del tutto.",
      "[h2]Il futuro[/h2]",
      "Sappiamo che molti di voi sono impazienti di vedere Crownfall e non vediamo l'ora di metterlo a vostra disposizione. Stiamo concludendo il progetto e prevediamo di rilasciarlo a metà aprile. Ci vediamo allora."
    ],
    "commentcount": 961,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1711061244_0",
      "ModAct_1426387032_1711065265_4",
      "ModAct_871423085_1711412357_4"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "4286936717525598070",
    "event_gid": "6127782523022178336",
    "voteupcount": 11786,
    "votedowncount": 2236,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4286936717525598070",
  "rtime32_last_modified": 1715117974,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1711412358,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11786,
  "votes_down": 2236,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4286936717525598070",
  "clan_steamid_original": "103582791433224455"
}