{
  "events": [
    {
      "gid": "6127782523022178336",
      "clan_steamid": "103582791433224455",
      "event_name": "Gameplay Patch 7.35d And Matchmaking Features",
      "event_type": 13,
      "appid": 570,
      "server_address": null,
      "server_password": null,
      "rtime32_start_time": 1711060320,
      "rtime32_end_time": 1711065601,
      "comment_count": 0,
      "creator_steamid": "0",
      "last_update_steamid": "0",
      "event_notes": "see announcement body",
      "jsondata": {
        "localized_subtitle": [],
        "localized_summary": [],
        "localized_title_image": [],
        "localized_capsule_image": [
          "8256a7d97ebed00f8e77c4834f9306d08976e15c.png"
        ],
        "bSaleEnabled": false,
        "sale_show_creator": false,
        "sale_sections": [],
        "sale_browsemore_text": "",
        "sale_browsemore_url": "",
        "sale_browsemore_color": "",
        "sale_browsemore_bgcolor": "",
        "localized_sale_header": [],
        "localized_sale_overlay": [],
        "localized_sale_product_banner": [],
        "localized_sale_product_mobile_banner": [],
        "localized_sale_logo": [],
        "sale_font": "",
        "sale_background_color": "",
        "sale_header_offset": 530,
        "referenced_appids": [],
        "bBroadcastEnabled": false,
        "broadcastChatSetting": "hide",
        "default_broadcast_title": "#Broadcast_default_title_dev",
        "localized_broadcast_title": [],
        "localized_broadcast_left_image": [],
        "localized_broadcast_right_image": [],
        "broadcast_whitelist": [],
        "bScheduleEnabled": false,
        "scheduleEntries": [],
        "valve_access_log": [
          {
            "strSteamID": "76561199113010392",
            "rtUpdated": 1711054255
          },
          {
            "strSteamID": "76561198166130601",
            "rtUpdated": 1711060377
          },
          {
            "strSteamID": "76561198099775662",
            "rtUpdated": 1711058969
          }
        ]
      },
      "announcement_body": {
        "gid": "6127782523022178337",
        "clanid": "3703047",
        "posterid": "0",
        "headline": "Gameplay Patch 7.35d And Matchmaking Features",
        "posttime": 1711060378,
        "updatetime": 1711060378,
        "body": "[img]{STEAM_CLAN_IMAGE}/3703047/168f2b245354ff66177462580a6f29d2e007bca4.jpg[/img]\n\nWe've just released [url=https://www.dota2.com/patches/7.35d]Gameplay Patch 7.35d[/url] (Chen had it coming), and with it a new set of features.\n\n[h2]Matchmaking Hero Ban Rework[/h2]\n\nOver the last year or so, we've taken [url=https://www.dota2.com/newsentry/3677788723152833273]a number[/url] of [url=https://www.dota2.com/newsentry/3884981125532748791]visible actions[/url] against users of third-party cheats. As we investigate each cheat, we're primarily focused on understanding what they're doing and how we can track and stop it. But while we're doing that, we also ask ourselves why some cheaters feel compelled to use these tools in the first place. The most common explanation is \"to get an unfair advantage\", which obviously runs counter to the desires of the Dota community and the sense of competitiveness and fairness at its heart. Even so, sometimes there are still things we can learn, and use to improve the Dota experience for everyone (or at least everyone who hasn't been banned for cheating).\n\nPre-game hero bans are an example of this. Many cheats last year focused on gaining an advantage during the ten-second hero ban phase at the start of each game. We stepped back to look at the original goals of this phase — letting players express a preference for what heroes they didn't want to play against, but without creating scenarios where players with small hero pools get permanently locked out — looked at some data, and asked if there was a way we could better serve these goals while solving other problems at the same time.\n\n[img]{STEAM_CLAN_IMAGE}/3703047/9176222f2c8de1b62450dd341e79cfa22b98afd3.png[/img]\nWith today's update, we've removed the start-of-match ban phase and replaced it with ban preferences stored with your account. If you load the heroes tab, you can select the four heroes you don't want to see in your games. You're guaranteed when you join a matchmaking game that at least one of them will be banned. You can change your list of banned heroes whenever you want. (If you leave some ban slots empty, it's possible the empty slot will be selected as your \"banned hero\". In other words, there's no advantage to leaving slots empty.)\n\nThis new system addresses a number of problems the previous system had: you can't forget to ban; you don't have to learn that sometimes suggested bans are ignored by the game; you're not on a tight clock to make a stressful decision that, in the end, most players make the same way almost all the time. As an added bonus, it also makes targeted bans impossible, whether those bans are against known personalities or random players in a pub match for which you've looked up data.\n\nSome game modes (ie., Captains Mode, Captains Draft, Ability Draft, Turbo) either didn't have a pre-game ban phase, or already had non-standard ban rules. These modes are are unchanged.\n\n[h2]Dota Plus Pre-Match Matchmaker Analytics[/h2]\n\nMillions of Dota players interact with the matchmaker every day and every single one has different priorities when looking for a game. Some prefer to get into a match as quickly as possible, and are willing to accept a higher skill variance in the game to save some time. Others want every match to be perfectly balanced, and are willing to wait longer for the best chance at the closest game. Other players care less about the skill level of the other players, and much more about their personality and behavior in-game.\n\nWe've long wanted to build features to let players find matches that better align with their individual preferences. Early attempts ran into two main problems:\n[list]\n[*]First, while players are good at describing their preferences to other people, they aren't necessarily good at describing their preferences as inputs to a complex, global matchmaking algorithm (\"I value skill variance 13% higher than the average Dota player!\"). How can we create tools that let players express their preferences naturally and directly?\n[*]Second, changes to the matchmaker affect all Dota players, so we tend toward caution. The matchmaker is always trying to strike a balance between individual player preferences and the health of Dota as a whole. (If matches of Dota are bad, whether because of wild skill gaps or poor player behavior, that's bad for Dota as a community. If every match is perfect, but takes three hours to form, that's bad, too.) New matchmaker features available to everyone at once risk breaking the matchmaker, and if we break the matchmaker, we break Dota. How can we ship new matchmaking features and learn how they work in practice while keeping risk to Dota as a whole low?\n[/list]\n[img]{STEAM_CLAN_LOC_IMAGE}/3703047/2022855a7a8833edace44c7f0ab8fa27c6a474c3.png[/img]\nWithin the new experimental umbrella of Dota Labs, and initially limited to Dota Plus, we're shipping a first pass of a feature that Dota players have been asking us for forever: When you find a match in Dota, Dota Plus will present some information about how the matchmaker evaluated the match, like an estimate of skill range and player behavior scores. You'll have a chance to accept that match or requeue to wait for a match that's better for you and your current preferences.\n\nWe were careful when building this feature to make sure that any information we included would enable players to express individual preferences about what kinds of matches they prefer, but not grant a competitive advantage of any kind. The new dialog can tell you that the skill variance of players in a match is high or low, but not whether you and your team are on the high end or the low end.\n\nWhy is this a Dota Labs feature? The only way to know for sure how millions of Dota players are going to interact with a feature is to ship it, so that's what we're doing. We've done extensive modeling, but there's still real risk here: We may be wrong about how players will use this feature or how it will affect the overall matchmaking experience in Dota. We don't want to let those fears that we [i]might[/i] be wrong stop us from doing something that may benefit millions of Dota players, so we're shipping this as an experiment. Shipping it inside Dota Plus limits access, and accordingly limits the risk to Dota as we learn about how everyone interacts with it. As with the other Dota Labs features, time and your feedback will tell whether it grows, or changes, or gets retired.\n\n[h2]Onward[/h2]\n\nWe know many of you are looking forward to Crownfall, and we're looking forward to getting it into your hands. We're wrapping things up and expect to release in mid-April. We'll see you then.",
        "commentcount": 0,
        "tags": [],
        "language": 0,
        "hidden": 0,
        "forum_topic_id": "4286936717525598070",
        "event_gid": "6127782523022178336",
        "voteupcount": 0,
        "votedowncount": 0,
        "ban_check_result": 0,
        "banned": 0
      },
      "published": 1,
      "hidden": 0,
      "rtime32_visibility_start": 0,
      "rtime32_visibility_end": 0,
      "broadcaster_accountid": 0,
      "follower_count": 0,
      "ignore_count": 0,
      "forum_topic_id": "4286936717525598070",
      "rtime32_last_modified": 1711060378,
      "news_post_gid": "0",
      "rtime_mod_reviewed": 0,
      "featured_app_tagid": 0,
      "referenced_appids": [],
      "build_id": 0,
      "build_branch": "",
      "votes_up": 0,
      "votes_down": 0,
      "comment_type": "ForumTopic",
      "gidfeature": "1636418037459185108",
      "gidfeature2": "4286936717525598070",
      "clan_steamid_original": "103582791433224455"
    },
    {
      "gid": "4115798034511524384",
      "clan_steamid": "103582791433224455",
      "event_name": "The International 2024",
      "event_type": 28,
      "appid": 570,
      "server_address": null,
      "server_password": null,
      "rtime32_start_time": 1709934960,
      "rtime32_end_time": 1709938560,
      "comment_count": 0,
      "creator_steamid": "0",
      "last_update_steamid": "0",
      "event_notes": "see announcement body",
      "jsondata": {
        "localized_subtitle": [],
        "localized_summary": [],
        "localized_title_image": [],
        "localized_capsule_image": [
          "040f3cd7b283452e7939cf075284647905cbb900.png"
        ],
        "bSaleEnabled": false,
        "sale_show_creator": false,
        "sale_sections": [],
        "sale_browsemore_text": "",
        "sale_browsemore_url": "",
        "sale_browsemore_color": "",
        "sale_browsemore_bgcolor": "",
        "localized_sale_header": [],
        "localized_sale_overlay": [],
        "localized_sale_product_banner": [],
        "localized_sale_product_mobile_banner": [],
        "localized_sale_logo": [],
        "sale_font": "",
        "sale_background_color": "",
        "sale_header_offset": 530,
        "referenced_appids": [],
        "bBroadcastEnabled": false,
        "broadcastChatSetting": "hide",
        "default_broadcast_title": "#Broadcast_default_title_dev",
        "localized_broadcast_title": [],
        "localized_broadcast_left_image": [],
        "localized_broadcast_right_image": [],
        "broadcast_whitelist": [],
        "bScheduleEnabled": false,
        "scheduleEntries": [],
        "valve_access_log": [
          {
            "strSteamID": "76561199113010392",
            "rtUpdated": 1709857114
          },
          {
            "strSteamID": "76561198166130601",
            "rtUpdated": 1710300561
          },
          {
            "strSteamID": "76561199116514547",
            "rtUpdated": 1709941311
          }
        ]
      },
      "announcement_body": {
        "gid": "4115798034511524385",
        "clanid": "3703047",
        "posterid": "0",
        "headline": "The International 2024",
        "posttime": 1709935005,
        "updatetime": 1710300561,
        "body": "[img]{STEAM_CLAN_IMAGE}/3703047/040f3cd7b283452e7939cf075284647905cbb900.png[/img]\nWar banners are being washed clean of blood stains and scorch marks. Trumpets are being tested for their ability to sound the imminent approach of battle. Lanes are getting swept clean of body parts, and the Ancients are getting a good crack replastering and surface buffing. The forest air itself crackles with anticipation, because we had new forest air shipped in at considerable cost that crackles on command. \n\nThe stage is being set, is the point we’re trying to get across here. And why? For The International, returning this September to Europe, where the best Dota teams from around the world will clash for the Aegis in Copenhagen's Royal Arena.\n\nThe sixteen participating teams will be a mix of open qualifiers, regional qualifiers, and direct invitations, similar to how invitations worked for the first few years of The International. The invited teams will be announced leading up to the event, and chosen based on team performance during the year.\n\nAnd there's a lot of performance to consider. This year's calendar is packed, with half a dozen major tournaments already announced and more on the way, including studio and arena tournaments in Europe, Asia, South America, and the Middle East. We even hear rumors Midas Mode might be making a grand return. (The more teams that are eligible to participate in a tournament, the higher our consideration: Cross-regional tournaments generate more useful data than intra-regional tournaments, tournaments with qualifiers generate more useful information than invitation-only tournaments, etc.)\n \nWe'll be announcing ticketing and scheduling information for The International 2024 in the next few months. Until then, why not [url=https://liquipedia.net/dota2/Portal:Tournaments]go watch a game of pro Dota[/url] to get back in the competitive spirit?",
        "commentcount": 1058,
        "tags": [
          "mod_reviewed",
          "ModAct_1434573178_1709936678_0",
          "ModAct_1434573178_1709941905_4",
          "ModAct_1415588329_1710300966_4"
        ],
        "language": 0,
        "hidden": 0,
        "forum_topic_id": "4288061352815469268",
        "event_gid": "4115798034511524384",
        "voteupcount": 12096,
        "votedowncount": 2992,
        "ban_check_result": 0,
        "banned": 0
      },
      "published": 1,
      "hidden": 0,
      "rtime32_visibility_start": 1709934960,
      "rtime32_visibility_end": 0,
      "broadcaster_accountid": 0,
      "follower_count": 0,
      "ignore_count": 0,
      "forum_topic_id": "4288061352815469268",
      "rtime32_last_modified": 1711059877,
      "news_post_gid": "0",
      "rtime_mod_reviewed": 1710300967,
      "featured_app_tagid": 0,
      "referenced_appids": [],
      "build_id": 0,
      "build_branch": "",
      "votes_up": 12098,
      "votes_down": 2992,
      "comment_type": "ForumTopic",
      "gidfeature": "1636418037459185108",
      "gidfeature2": "4288061352815469268",
      "clan_steamid_original": "103582791433224455"
    },
    {
      "gid": "4169840594114934858",
      "clan_steamid": "103582791433224455",
      "event_name": "Dota Plus Update — Spring 2024 (And Dota Labs)",
      "event_type": 13,
      "appid": 570,
      "server_address": null,
      "server_password": null,
      "rtime32_start_time": 1709684520,
      "rtime32_end_time": 1709688601,
      "comment_count": 0,
      "creator_steamid": "0",
      "last_update_steamid": "0",
      "event_notes": "see announcement body",
      "jsondata": {
        "localized_subtitle": [],
        "localized_summary": [],
        "localized_title_image": [],
        "localized_capsule_image": [
          "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
        ],
        "bSaleEnabled": false,
        "sale_show_creator": false,
        "sale_sections": [],
        "sale_browsemore_text": "",
        "sale_browsemore_url": "",
        "sale_browsemore_color": "",
        "sale_browsemore_bgcolor": "",
        "localized_sale_header": [],
        "localized_sale_overlay": [],
        "localized_sale_product_banner": [],
        "localized_sale_product_mobile_banner": [],
        "localized_sale_logo": [],
        "sale_font": "",
        "sale_background_color": "",
        "sale_header_offset": 530,
        "referenced_appids": [],
        "bBroadcastEnabled": false,
        "broadcastChatSetting": "hide",
        "default_broadcast_title": "#Broadcast_default_title_dev",
        "localized_broadcast_title": [],
        "localized_broadcast_left_image": [],
        "localized_broadcast_right_image": [],
        "broadcast_whitelist": [],
        "bScheduleEnabled": false,
        "scheduleEntries": [],
        "valve_access_log": [
          {
            "strSteamID": "76561199113010392",
            "rtUpdated": 1709684551
          },
          {
            "strSteamID": "76561199119053960",
            "rtUpdated": 1709324653
          },
          {
            "strSteamID": "76561198093408953",
            "rtUpdated": 1709922508
          },
          {
            "strSteamID": "76561198166130601",
            "rtUpdated": 1709751133
          },
          {
            "strSteamID": "76561198239571404",
            "rtUpdated": 1709759103
          }
        ],
        "rt_migrated_time": 1709759079.849
      },
      "announcement_body": {
        "gid": "4169840594114934859",
        "clanid": "3703047",
        "posterid": "0",
        "headline": "Dota Plus Update — Spring 2024 (And Dota Labs)",
        "posttime": 1709684551,
        "updatetime": 1709922508,
        "body": "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]\n\n[h2]Dota Plus Seasonal Update[/h2]\nAs Spring blooms to life around us, it transports us here on the Dota team to the springs of yore, when the world was new and vibrant. Who could forget climbing that old oak tree by the bridge? Or stealing carrots and turnips from cranky old Farmer Maggot? Or taking that ring to Mordor, and casting it into the fiery pits of Mount Doom where it was forged? \n\n[h3]Dota Plus Seasonal Treasure[/h3]\nThat last part of our spring memory trilogy is especially relevant today, since we’ve uncovered another priceless treasure. And this time it’s too good to throw into a volcano. \n\nThe Spring 2024 Seasonal Treasure is here and available for purchase with shards. This treasure features all new sets for Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord, and Nyx Assassin. There's also a chance to unlock the Sir Molestach Irondrill courier, who arrives in the lanes bearing random prismatic and ethereal gems.\n\nWe've also taken sets that were available in the Summer Treasure 2022 and made them available for direct purchase for 15,000 shards each as part of the collection of legacy sets in the Shard Shop.\n\n[h3]Updated Seasonal Quests & Guild Rewards[/h3]\nToday’s update also comes with a new set of Dota Plus quests to shore up your shard stash for new relics and the Seasonal Treasure — offering up to 115,200 shards over the course of the season. Guild rewards have also been updated, making new emoticons, sprays, and chat wheels available to high-scoring guilds.\n\n[table]\n  [tr]\n    [th]Guild Tier[/th]\n    [th]Rewards[/th]\n  [/tr]\n  [tr]\n    [td]Silver[/td]\n    [td][list]\n      [*]Emoticon - lion_bounce\n      [*]Emoticon - rainbow_phoenix\n      [*]Emoticon - riki_peaceout\n    [/list][/td]\n  [/tr]\n  [tr]\n     [td]Gold[/td]\n    [td][list]\n      [*]Spray - Aghanim - Push\n      [*]Spray - Bounty Hunter - Riches\n      [*]Spray - Hoodwink - Acorn\n    [/list][/td]\n  [/tr]\n  [tr]\n    [td]Platinum[/td]\n    [td][list]\n      [*]Chat Wheel - \"Что это?! Какая жесть!\"\n      [*]Chat Wheel - \"Ooooh, por dios!\"\n      [*]Chat Wheel - \"你行你行，你上你上\"\n    [/list][/td]\n  [/tr]\n[/table]\n\n[h2]Introducing Dota Labs[/h2]\n\nIn addition to the Dota+ content, today's update introduces a set of experimental features available to all Dota players, and a new way for us to ship experiments like them: Dota Labs. (We had fun coming with names like \"Unstable Concoctions\" and \"Tinker's Tinkerings\" but ultimately decided we'd rather have the name be boring and clear and the features themselves be interesting.)\n\nIf you load up your options menu, you'll see a new tab with the Dota Labs label. Features here are experimental, and less polished than many other features we ship, so they're all in a special menu and disabled by default. These are features where our playtesting has produced mixed or ambiguous data. We can't really know if they're good or how to make them better without seeing real Dota players using them, so we're shipping them in an earlier form on purpose so you can tell us whether they're worth continuing to invest in.\n\nThe initial set of Dota Labs features includes:\n[list]\n[*][b]Overlay Map[/b]. It's sort of just like the minimap, but it's large instead of small, and transparent instead of solid, and is full-screen instead of being isolated to the corner. We have a bunch of questions, including but not limited to: Is it helpful for your playstyle? How do you interact with it? What do you wish it did?\n\n[*][b]Modifier Key Filter Bindings[/b]. Targeting commands in chaotic environments can be challenging, and misclicks can be devastating. Dota does the best it can with your inputs, but sometimes it really does look like you wanted to Laguna Blade that creep. This new feature allows you bind modifier keys that, when held, will force your target selection to enemies, allies, creeps or heroes. Which targeting methods are the most and least useful in practice? What are we missing?\n\n[*][b]High-Visibility Local Hero Healthbar[/b]. Dota teamfights can be hectic, and sometimes in the chaos it's hard to keep track of your hero. This option significantly changes the styling and readability of only your hero's nameplate. Does this help, or does it introduce even more visual chaos?\n[/list]\nWe fully expect that some of these features (or future Dota Labs ideas) will mature and graduate out, while others may be retired. Which are which depends on you.\n\nSome of you reading this are probably excited about trying these features out, but worried about whether we'll continue to use them moving forward. \"The last time you introduced a new named Dota thing, you called it Between the Lanes, and it's been some months since you last posted one of those.\" You're right! We figure the best way to make the point that we're planning to continue to invest long-term here is to continue to invest long-term there as well, so: Enjoy [url=https://www.dota2.com/newsentry/4115798034511159059]today's Between the Lanes[/url] as well.",
        "commentcount": 358,
        "tags": [
          "mod_reviewed",
          "ModAct_1415588329_1709686046_0",
          "ModAct_487176015_1709751546_4",
          "ModAct_487176015_1709760814_4",
          "ModAct_1428110219_1709923906_4"
        ],
        "language": 0,
        "hidden": 0,
        "forum_topic_id": "4288061352804809343",
        "event_gid": "4169840594114934858",
        "voteupcount": 5136,
        "votedowncount": 859,
        "ban_check_result": 0,
        "banned": 0
      },
      "published": 1,
      "hidden": 0,
      "rtime32_visibility_start": 0,
      "rtime32_visibility_end": 0,
      "broadcaster_accountid": 0,
      "follower_count": 0,
      "ignore_count": 0,
      "forum_topic_id": "4288061352804809343",
      "rtime32_last_modified": 1711056688,
      "news_post_gid": "0",
      "rtime_mod_reviewed": 1709923906,
      "featured_app_tagid": 0,
      "referenced_appids": [],
      "build_id": 0,
      "build_branch": "",
      "votes_up": 5136,
      "votes_down": 859,
      "comment_type": "ForumTopic",
      "gidfeature": "1636418037459185108",
      "gidfeature2": "4288061352804809343",
      "clan_steamid_original": "103582791433224455"
    }
  ],
  "success": 1
}