{
  "events": [
    {
      "gid": "544472700657074597",
      "clan_steamid": "103582791433224455",
      "event_name": "Crownfall's Final Bow",
      "event_type": 13,
      "appid": 570,
      "server_address": null,
      "server_password": null,
      "rtime32_start_time": 1736979180,
      "rtime32_end_time": 1736983801,
      "comment_count": 0,
      "creator_steamid": "0",
      "last_update_steamid": "0",
      "event_notes": "see announcement body",
      "jsondata": {
        "localized_subtitle": [],
        "localized_summary": [],
        "localized_title_image": [],
        "localized_capsule_image": [
          "4d7625b8d423a09223b02308f39f8b56e96130a1.png"
        ],
        "bSaleEnabled": false,
        "sale_show_creator": false,
        "sale_sections": [],
        "sale_browsemore_text": "",
        "sale_browsemore_url": "",
        "sale_browsemore_color": "",
        "sale_browsemore_bgcolor": "",
        "localized_sale_header": [],
        "localized_sale_overlay": [],
        "localized_sale_product_banner": [],
        "localized_sale_product_mobile_banner": [],
        "localized_sale_logo": [],
        "sale_font": "",
        "sale_background_color": "",
        "sale_header_offset": 530,
        "referenced_appids": [],
        "bBroadcastEnabled": false,
        "broadcastChatSetting": "hide",
        "default_broadcast_title": "#Broadcast_default_title_dev",
        "localized_broadcast_title": [],
        "localized_broadcast_left_image": [],
        "localized_broadcast_right_image": [],
        "broadcast_whitelist": [],
        "bScheduleEnabled": false,
        "scheduleEntries": [],
        "automatically_push_updated_source": true,
        "valve_access_log": [
          {
            "strSteamID": "76561198042665686",
            "rtUpdated": 1736979124
          },
          {
            "strSteamID": "76561197978027217",
            "rtUpdated": 1736979215
          }
        ]
      },
      "announcement_body": {
        "gid": "544472700657074598",
        "clanid": "3703047",
        "posterid": "0",
        "headline": "Crownfall's Final Bow",
        "posttime": 1736979218,
        "updatetime": 1736979218,
        "body": "[img]{STEAM_CLAN_IMAGE}/3703047/4d7625b8d423a09223b02308f39f8b56e96130a1.png[/img]\nBack in December, it seemed entirely reasonable to bring Crownfall to a close halfway through January. After all, we reasoned, who could possibly need more time than [i]that[/i] to finish exploring four huge overworld maps filled with tons of characters to meet, comics to read, and minigames to conquer?\n\nWell, if what we're hearing from friends, family, dedicated fans, coworkers, bus drivers, security guards, and even some cats on the internet is true, it turns out a lot of people could actually use more time to finish everything. So we're extending Crownfall's end date one last time (for real this time) to [b]Thursday, February 6[/b]. If you've still got progress to make, get moving, because the curtains for this show are finally actually about to, we promise, close.\n\n[h2]A Frosty Farewell[/h2]\nWe hope everyone stuffed their bellies full of enough grunch heart to tide yourselves over for the rest of the year, because another season of Frostivus is in the books — and all of the wrappings, trappings, snowballs, and stolen hats have been lovingly packed up and crammed back into the seasonal treasure hutch.\n\n[h2]Winter Sale Ends[/h2]\nSadly, there were no people begging on behalf of their pets for more end-of-year savings from our winter sale, and since the year did in fact end, and in fact ended two weeks ago, everything in the Crownfall Store is now (finally actually) going back to its regular price.\n\nYou can still unlock new story nodes with the Midgate, Druud, and Icewrack Pathfinder Packs, deck your heroes out in the sets from Skywrath from Crownfall Treasures I-III, or complete the transformations of Shen and Dragonus with the Vengeful Spirit and Skywrath Mage Arcanas, but unless you've got Crownfall Coins to use, items are back to full price.\n\n[h2]Roll Credits[/h2]\nCrownfall might not be officially ending today, but today's update also includes a little something to celebrate the end of the journey. Everyone on the team put a lot of time into making this happen — from haggling with the Flightless in the bustling bazaars of Midgate; to returning the nomad Oglodi through the crimson sands of Druud to their rightful home of Barzum; to helping the overworked warden of Icewrack settle a domestic disturbance between the citizens of Snowcap Lake and a marauding dragon; and finally scaling the cloud-rimmed spires of Skywrath to commit a long-overdue regicide and put an actual Dota character in charge of everything. It's been a long ride, and a little bittersweet to finally close the book on it. So please join us for one last look back, in the form of a credits sequence featuring new music and some fun surprises. (Just click \"Play Credits\" on the main menu to roll them.)\n",
        "commentcount": 0,
        "tags": [],
        "language": 0,
        "hidden": 0,
        "forum_topic_id": "604145395718741313",
        "event_gid": "544472700657074597",
        "voteupcount": 0,
        "votedowncount": 0,
        "ban_check_result": 0,
        "banned": 0
      },
      "published": 1,
      "hidden": 0,
      "rtime32_visibility_start": 0,
      "rtime32_visibility_end": 0,
      "broadcaster_accountid": 0,
      "follower_count": 0,
      "ignore_count": 0,
      "forum_topic_id": "604145395718741313",
      "rtime32_last_modified": 1736979218,
      "news_post_gid": "0",
      "rtime_mod_reviewed": 0,
      "featured_app_tagid": 0,
      "referenced_appids": [],
      "build_id": 0,
      "build_branch": "",
      "unlisted": 0,
      "votes_up": 0,
      "votes_down": 0,
      "comment_type": "ForumTopic",
      "gidfeature": "1636418037459185108",
      "gidfeature2": "604145395718741313",
      "clan_steamid_original": "103582791433224455"
    },
    {
      "gid": "596261024722585016",
      "clan_steamid": "103582791433224455",
      "event_name": "Frostivus is Upon Us",
      "event_type": 13,
      "appid": 570,
      "server_address": null,
      "server_password": null,
      "rtime32_start_time": 1734574440,
      "rtime32_end_time": 1734579001,
      "comment_count": 0,
      "creator_steamid": "0",
      "last_update_steamid": "0",
      "event_notes": "see announcement body",
      "jsondata": {
        "localized_subtitle": [],
        "localized_summary": [],
        "localized_title_image": [],
        "localized_capsule_image": [
          "2bf8a24917d425169d6c9b541482de91c28f5290.png"
        ],
        "bSaleEnabled": false,
        "sale_show_creator": false,
        "sale_sections": [],
        "sale_browsemore_text": "",
        "sale_browsemore_url": "",
        "sale_browsemore_color": "",
        "sale_browsemore_bgcolor": "",
        "localized_sale_header": [],
        "localized_sale_overlay": [],
        "localized_sale_product_banner": [],
        "localized_sale_product_mobile_banner": [],
        "localized_sale_logo": [],
        "sale_font": "",
        "sale_background_color": "",
        "sale_header_offset": 530,
        "referenced_appids": [],
        "bBroadcastEnabled": false,
        "broadcastChatSetting": "hide",
        "default_broadcast_title": "#Broadcast_default_title_dev",
        "localized_broadcast_title": [],
        "localized_broadcast_left_image": [],
        "localized_broadcast_right_image": [],
        "broadcast_whitelist": [],
        "bScheduleEnabled": false,
        "scheduleEntries": [],
        "library_spotlight": true,
        "automatically_push_updated_source": true,
        "valve_access_log": [
          {
            "strSteamID": "76561199113010392",
            "rtUpdated": 1734547310
          },
          {
            "strSteamID": "76561198166130601",
            "rtUpdated": 1734549339
          },
          {
            "strSteamID": "76561199119053960",
            "rtUpdated": 1734572694
          },
          {
            "strSteamID": "76561197978027217",
            "rtUpdated": 1734574490
          }
        ]
      },
      "announcement_body": {
        "gid": "596261024722585017",
        "clanid": "3703047",
        "posterid": "0",
        "headline": "Frostivus is Upon Us",
        "posttime": 1734574491,
        "updatetime": 1734574491,
        "body": "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]\n\nIt's been a busy year for Dota. We welcomed a new hero into our ranks (and a long-awaited one finally made his debut); we crowned another team of world champions at this year's TI in Copenhagen; we reworked every hero with new game-changing innates and facets; and we even managed to cram in a four-act multi-month narrative epic about talking birds.\n\nAnd so, as the year winds to a close, we find ourselves filled once again to the absolute brim with the spirit of Frostivus. And that means a sackful of festive gifts for everyone for the duration of the [b]Frostivus event, from now until January 15th. [/b]\n\n[h2]The True Meaning of Frostivus Revealed (Hats)[/h2]\n“What kind of gifts?” one might festively wonder. Well, for starters: For the rest of the season, your hero will begin each game wearing a stylish [b]Frostivus hat.[/b] \n\nBut don't think of it as a fashion statement. Think of it as a trophy case. Because you can also steal hats from enemy heroes and get them as gifts from your allies with the new [b]Spirit of Frostivus [/b]ability. You can also get them the old fashioned way (murder/larceny), by stealing them off the skulls of heroes you've just killed, off the Tormentors, or if you really know what you're doing, even off Roshan's craggy dead head. \n\nAnd every single hat you take, you can wear on top of all the others in a majestic, murderous hat-stack of glory. Plus since the post-game MVP screen now includes hat tallies, you'll have definitive proof of your hat superiority in the days to come. \n\n[h2]A Frostivus Story[/h2]\nSo now you've got a tower of Frostivus hats on your head. But can you truly enjoy them without knowing their exhaustive backstory? The answer, as we discovered, is yes. \"They're just colored hats,\" you say. \"Who cares where they came from?\" \n\nWell, six months ago would have been a great time to mention that, because we wrote a six hundred thousand word legendarium about it called The Hatmarillion. But everybody refused to read it, so we wrote a ten-page kid's book version of The Hatmarillion that takes about a minute to read, and everyone seemed to like that one better.[b] Launch Dota and enjoy the story[/b] for yourself! (Frostivus trivia: You'll be able to read it THIRTY TIMES in the time it takes you to get through this blog post!)\n\n[h2]Frostivus Forge[/h2]\nBut wait! There's still more Frostivus spirit in the air! Unfortunately, it has been broken down into its chemical components and needs to be reconstituted into a seasonal compound. We've gathered up a pile of all the supplies you'll need to craft rewards in the new [b]Frostivus Forge[/b]. The next step? The actual crafting part. \n\nAll you'll need to do is accomplish a variety of in-game hijinks like “snowball an enemy before you kill them”, “steal a hat”, or “high five an enemy” to earn unique supplies that feed your forge and craft new rewards. Each item requires a different recipe to craft, and you can unlock higher tiers by completing rewards in the lower tiers first. Seasonal Chat Wheels? Check. A new bell-shaped tormentor that you lets you play music? Obviously it has one of those. A drunken wizard riding a suspiciously-donkey-shaped reindeer courier? Why, it wouldn’t be a holiday without them!\n\n[h2]Winter 2024 Heroes' Hoard[/h2]\nYou know what else it wouldn’t be a holiday without? A box full of surprises! So we’re also unveiling the [b]Winter 2024 Heroes’ Hoard[/b], an all-new treasure featuring 17 item sets for a host of heroes. \n\nBut that's not all. To ensure this treasure's brims were truly tested, we stuffed in some new Immortal items amongst the sets. Then we added some new taunts. And a pet wolf for everyone's favorite pint-sized brawler. And when we realized the new Windranger set looked great when equipped with her Arcana, we included that, too. This treasure is available in the Crownfall store, so you can use your Crownfall Coins towards the purchase.\n\n[h2]End-of-Year Ban Wave[/h2]\nKing Kringle broke his ban hammer off in some well-deserving asses last year. He's spent the year constantly reforging and testing it on various smurfs and in-game baddies, and now he's ready to rechristen it with the blood of the naughty.\n\nWhile we usually do most of our bans and penalties behind the scenes, it's become something of a Frostivus tradition for us to pull back the curtain a little bit and talk about this ongoing work. And so: This holiday season, we hope you look forward to some cleaner, friendlier, fairer games, free of the [b]65,594 smurf accounts[/b] we've taken action against this week. \n\nBesides the smurfs, we've also dropped the hammer on a significant number of high-MMR griefers, players who try to have fun at the expense of others, exploiting bugs, trading wins, and otherwise undermining the competitive challenge that is at the heart of every game of Dota.\n\nAs always, we'd like to thank everyone that submitted a report over the year. All that data helps us find the players that are making games of Dota worse and take action. Dota is a better game because of you.\n\n[h2]End-of-Year Sale[/h2]\nA Dota blog post is much like a towering stack of Frostivus hats, in that it always has something at the bottom. This time, that something is Dota's very own [b]winter sale[/b] on Crownfall content, running now through January 3rd. \n\nUnlock new story nodes with discounts on the Midgate, Druud, and Icewrack Pathfinder Packs, deck your heroes out in the sets from Skywrath from Crownfall Treasures I-III, or complete the transformations of Shen and Dragonus with the Vengeful Spirit and Skywrath Mage Arcanas. (If you still have a bunch of Crownfall Coins, you can use them to discount most Crownfall Store items further, even if the items are already discounted as part of the sale!)\n\nYou’ve still got time to dig into all that Crownfall has to offer as we ring in a new year, but the saga of Skywrath will finally come to a close on January 15th, so if you’ve still got more of the four acts to explore, best get cracking.",
        "commentcount": 644,
        "tags": [
          "mod_reviewed",
          "ModAct_871423085_1734575947_0"
        ],
        "language": 0,
        "hidden": 0,
        "forum_topic_id": "598513360098626905",
        "event_gid": "596261024722585016",
        "voteupcount": 27181,
        "votedowncount": 2873,
        "ban_check_result": 0,
        "banned": 0
      },
      "published": 1,
      "hidden": 0,
      "rtime32_visibility_start": 0,
      "rtime32_visibility_end": 0,
      "broadcaster_accountid": 0,
      "follower_count": 0,
      "ignore_count": 0,
      "forum_topic_id": "598513360098626905",
      "rtime32_last_modified": 1736978592,
      "news_post_gid": "0",
      "rtime_mod_reviewed": 1734575947,
      "featured_app_tagid": 0,
      "referenced_appids": [],
      "build_id": 0,
      "build_branch": "",
      "unlisted": 0,
      "votes_up": 27181,
      "votes_down": 2873,
      "comment_type": "ForumTopic",
      "gidfeature": "1636418037459185108",
      "gidfeature2": "598513360098626905",
      "clan_steamid_original": "103582791433224455"
    },
    {
      "gid": "4442333890575598739",
      "clan_steamid": "103582791433224455",
      "event_name": "Dota 2 Update - 12/5/2024",
      "event_type": 12,
      "appid": 570,
      "server_address": null,
      "server_password": null,
      "rtime32_start_time": 1733445840,
      "rtime32_end_time": 1733450401,
      "comment_count": 0,
      "creator_steamid": "0",
      "last_update_steamid": "0",
      "event_notes": "see announcement body",
      "jsondata": {
        "localized_subtitle": [],
        "localized_summary": [],
        "localized_title_image": [],
        "localized_capsule_image": [],
        "bSaleEnabled": false,
        "sale_show_creator": false,
        "sale_sections": [],
        "sale_browsemore_text": "",
        "sale_browsemore_url": "",
        "sale_browsemore_color": "",
        "sale_browsemore_bgcolor": "",
        "localized_sale_header": [],
        "localized_sale_overlay": [],
        "localized_sale_product_banner": [],
        "localized_sale_product_mobile_banner": [],
        "localized_sale_logo": [],
        "sale_font": "",
        "sale_background_color": "",
        "sale_header_offset": 530,
        "referenced_appids": [],
        "bBroadcastEnabled": false,
        "broadcastChatSetting": "hide",
        "default_broadcast_title": "#Broadcast_default_title_dev",
        "localized_broadcast_title": [],
        "localized_broadcast_left_image": [],
        "localized_broadcast_right_image": [],
        "broadcast_whitelist": [],
        "bScheduleEnabled": false,
        "scheduleEntries": [],
        "library_spotlight": true,
        "automatically_push_updated_source": true,
        "valve_access_log": [
          {
            "strSteamID": "76561198012148855",
            "rtUpdated": 1733442571
          },
          {
            "strSteamID": "76561198166130601",
            "rtUpdated": 1733435064
          },
          {
            "strSteamID": "76561197978027217",
            "rtUpdated": 1733445863
          }
        ]
      },
      "announcement_body": {
        "gid": "4442333890575598740",
        "clanid": "3703047",
        "posterid": "0",
        "headline": "Dota 2 Update - 12/5/2024",
        "posttime": 1733445867,
        "updatetime": 1733445867,
        "body": "Over the last few days we've made the following changes:\n\n[list]\n[*] Fixed being unable to configure Quickcast behavior on Observer and Sentry wards in the Settings menu.\n[*] Fixed Razor's Voidstorm Asylum Arcana using the incorrect icon for Storm Surge.\n[*] Fixed Shadow Fiend Presence of the Dark Lord not losing stacks correctly on death.\n[*] Fixed lighting issue on seasonal winter terrain.\n[*] Fixed loading spinners not spinning correctly.\n[*] Fixed Force Staff's tooltip description ending with 2 periods.\n[*] Fixed sprays from events which have ended not properly rendering.\n[*] Fixed various client and server crashes.\n[*] Fixed Watcher colors not matching their team under some circumstances.\n[*] Enabled Kez's Sai abilities in Ability Draft. The draft screen will show a random combination of Kez's Katana and Sai abilities.\n[*] Crownfall: Heroes whose reward tokens associated with meta-progression upgrades now show up under the Crownfall Act IV filter in the Hero pick screen.\n[*] Crownfall: Fixed Nest of Thorns Loading Screen not being visible.\n[*] Nest of Thorns: Voiceline rewards for difficulties 3, 5, and 7 are now permanent.\n[*] Nest of Thorns: Improved visibility of the Reaper, which spawns on difficulties 5 and above.\n[*] Nest of Thorns: Spirits now ignore range modifiers and always spawn at a set distance away from the player.\n[*] Nest of Thorns: Fixed score sometimes not updating properly.\n[*] Nest of Thorns: Fixed incorrect text being displayed if launching the client with an invalid language.\n[*] Nest of Thorns: Fixed Rot's Scepter obscuring various visual elements in the game.\n[*] Nest of Thorns: Fixed Echo Slash and Swashbuckle not working correctly on Linux\n[/list]\n\n",
        "commentcount": 383,
        "tags": [
          "patchnotes",
          "mod_reviewed",
          "ModAct_1426387032_1733446614_0"
        ],
        "language": 0,
        "hidden": 0,
        "forum_topic_id": "594008672803229440",
        "event_gid": "4442333890575598739",
        "voteupcount": 14484,
        "votedowncount": 3591,
        "ban_check_result": 0,
        "banned": 0
      },
      "published": 1,
      "hidden": 0,
      "rtime32_visibility_start": 0,
      "rtime32_visibility_end": 0,
      "broadcaster_accountid": 0,
      "follower_count": 0,
      "ignore_count": 0,
      "forum_topic_id": "594008672803229440",
      "rtime32_last_modified": 1736978850,
      "news_post_gid": "0",
      "rtime_mod_reviewed": 1733446614,
      "featured_app_tagid": 0,
      "referenced_appids": [],
      "build_id": 0,
      "build_branch": "",
      "unlisted": 0,
      "votes_up": 14484,
      "votes_down": 3591,
      "comment_type": "ForumTopic",
      "gidfeature": "1636418037459185108",
      "gidfeature2": "594008672803229440",
      "clan_steamid_original": "103582791433224455"
    }
  ],
  "success": 1
}