{
  "events": [
    {
      "gid": "4169840594114934858",
      "clan_steamid": "103582791433224455",
      "event_name": "Dota Plus Update — Spring 2024 (And Dota Labs)",
      "event_type": 13,
      "appid": 570,
      "server_address": "",
      "server_password": "",
      "rtime32_start_time": 1709684520,
      "rtime32_end_time": 1709688601,
      "comment_count": 0,
      "creator_steamid": "0",
      "last_update_steamid": "0",
      "event_notes": "see announcement body",
      "jsondata": {
        "localized_subtitle": [],
        "localized_summary": [],
        "localized_title_image": [],
        "localized_capsule_image": [
          "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
        ],
        "bSaleEnabled": false,
        "sale_show_creator": false,
        "sale_sections": [],
        "sale_browsemore_text": "",
        "sale_browsemore_url": "",
        "sale_browsemore_color": "",
        "sale_browsemore_bgcolor": "",
        "localized_sale_header": [],
        "localized_sale_overlay": [],
        "localized_sale_product_banner": [],
        "localized_sale_product_mobile_banner": [],
        "localized_sale_logo": [],
        "sale_font": "",
        "sale_background_color": "",
        "sale_header_offset": 530,
        "referenced_appids": [],
        "bBroadcastEnabled": false,
        "broadcastChatSetting": "hide",
        "default_broadcast_title": "#Broadcast_default_title_dev",
        "localized_broadcast_title": [],
        "localized_broadcast_left_image": [],
        "localized_broadcast_right_image": [],
        "broadcast_whitelist": [],
        "bScheduleEnabled": false,
        "scheduleEntries": [],
        "valve_access_log": [
          {
            "strSteamID": "76561199113010392",
            "rtUpdated": 1709684551
          },
          {
            "strSteamID": "76561199119053960",
            "rtUpdated": 1709324653
          },
          {
            "strSteamID": "76561198093408953",
            "rtUpdated": 1709675424
          }
        ]
      },
      "announcement_body": {
        "gid": "4169840594114934859",
        "clanid": "3703047",
        "posterid": "0",
        "headline": "Dota Plus Update — Spring 2024 (And Dota Labs)",
        "posttime": 1709684551,
        "updatetime": 1709684551,
        "body": "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]\n\n[h2]Dota Plus Seasonal Update[/h2]\nAs Spring blooms to life around us, it transports us here on the Dota team to the springs of yore, when the world was new and vibrant. Who could forget climbing that old oak tree by the bridge? Or stealing carrots and turnips from cranky old Farmer Maggot? Or taking that ring to Mordor, and casting it into the fiery pits of Mount Doom where it was forged? \n\n[h3]Dota Plus Seasonal Treasure[/h3]\nThat last part of our spring memory trilogy is especially relevant today, since we’ve uncovered another priceless treasure. And this time it’s too good to throw into a volcano. \n\nThe Spring 2024 Seasonal Treasure is here and available for purchase with shards. This treasure features all new sets for Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord, and Nyx Assassin. There's also a chance to unlock the Sir Molestach Irondrill courier, who arrives in the lanes bearing random prismatic and ethereal gems.\n\nWe've also taken sets that were available in the Summer Treasure 2022 and made them available for direct purchase for 15,000 shards each as part of the collection of legacy sets in the Shard Shop.\n\n[h3]Updated Seasonal Quests & Guild Rewards[/h3]\nToday’s update also comes with a new set of Dota Plus quests to shore up your shard stash for new relics and the Seasonal Treasure — offering up to 115,200 shards over the course of the season. Guild rewards have also been updated, making new emoticons, sprays, and chat wheels available to high-scoring guilds.\n\n[table]\n  [tr]\n    [th]Guild Tier[/th]\n    [th]Rewards[/th]\n  [/tr]\n  [tr]\n    [td]Silver[/td]\n    [td][list]\n      [*]Emoticon - lion_bounce\n      [*]Emoticon - rainbow_phoenix\n      [*]Emoticon - riki_peaceout\n    [/list][/td]\n  [/tr]\n  [tr]\n     [td]Gold[/td]\n    [td][list]\n      [*]Spray - Aghanim - Push\n      [*]Spray - Bounty Hunter - Riches\n      [*]Spray - Hoodwink - Acorn\n    [/list][/td]\n  [/tr]\n  [tr]\n    [td]Platinum[/td]\n    [td][list]\n      [*]Chat Wheel - \"Что это?! Какая жесть!\"\n      [*]Chat Wheel - \"Ooooh, por dios!\"\n      [*]Chat Wheel - \"你行你行，你上你上\"\n    [/list][/td]\n  [/tr]\n[/table]\n\n[h2]Introducing Dota Labs[/h2]\n\nIn addition to the Dota+ content, today's update introduces a set of experimental features available to all Dota players, and a new way for us to ship experiments like them: Dota Labs. (We had fun coming with names like \"Unstable Concoctions\" and \"Tinker's Tinkerings\" but ultimately decided we'd rather have the name be boring and clear and the features themselves be interesting.)\n\nIf you load up your options menu, you'll see a new tab with the Dota Labs label. Features here are experimental, and less polished than many other features we ship, so they're all in a special menu and disabled by default. These are features where our playtesting has produced mixed or ambiguous data. We can't really know if they're good or how to make them better without seeing real Dota players using them, so we're shipping them in an earlier form on purpose so you can tell us whether they're worth continuing to invest in.\n\nThe initial set of Dota Labs features includes:\n[list]\n[*][b]Overlay Map[/b]. It's sort of just like the minimap, but it's large instead of small, and transparent instead of solid, and is full-screen instead of being isolated to the corner. We have a bunch of questions, including but not limited to: Is it helpful for your playstyle? How do you interact with it? What do you wish it did?\n\n[*][b]Modifier Key Filter Bindings[/b]. Targeting commands in chaotic environments can be challenging, and misclicks can be devastating. Dota does the best it can with your inputs, but sometimes it really does look like you wanted to Laguna Blade that creep. This new feature allows you bind modifier keys that, when held, will force your target selection to enemies, allies, creeps or heroes. Which targeting methods are the most and least useful in practice? What are we missing?\n\n[*][b]High-Visibility Local Hero Healthbar[/b]. Dota teamfights can be hectic, and sometimes in the chaos it's hard to keep track of your hero. This option significantly changes the styling and readability of only your hero's nameplate. Does this help, or does it introduce even more visual chaos?\n[/list]\nWe fully expect that some of these features (or future Dota Labs ideas) will mature and graduate out, while others may be retired. Which are which depends on you.\n\nSome of you reading this are probably excited about trying these features out, but worried about whether we'll continue to use them moving forward. \"The last time you introduced a new named Dota thing, you called it Between the Lanes, and it's been some months since you last posted one of those.\" You're right! We figure the best way to make the point that we're planning to continue to invest long-term here is to continue to invest long-term there as well, so: Enjoy [url=https://www.dota2.com/newsentry/4115798034511159059]today's Between the Lanes[/url] as well.",
        "commentcount": 0,
        "tags": [],
        "language": 0,
        "hidden": 0,
        "forum_topic_id": "4288061352804809343",
        "event_gid": "4169840594114934858",
        "voteupcount": 0,
        "votedowncount": 0,
        "ban_check_result": 0,
        "banned": 0
      },
      "published": 1,
      "hidden": 0,
      "rtime32_visibility_start": 0,
      "rtime32_visibility_end": 0,
      "broadcaster_accountid": 0,
      "follower_count": 0,
      "ignore_count": 0,
      "forum_topic_id": "4288061352804809343",
      "rtime32_last_modified": 1709684552,
      "news_post_gid": "0",
      "rtime_mod_reviewed": 0,
      "featured_app_tagid": 0,
      "referenced_appids": [],
      "build_id": 0,
      "build_branch": "",
      "votes_up": 0,
      "votes_down": 0,
      "comment_type": "ForumTopic",
      "gidfeature": "1636418037459185108",
      "gidfeature2": "4288061352804809343",
      "clan_steamid_original": "103582791433224455"
    },
    {
      "gid": "4115798034511159059",
      "clan_steamid": "103582791433224455",
      "event_name": "Between the Lanes: Denying Denial of Service",
      "event_type": 28,
      "appid": 570,
      "server_address": "",
      "server_password": "",
      "rtime32_start_time": 1709684460,
      "rtime32_end_time": 1709684820,
      "comment_count": 0,
      "creator_steamid": "0",
      "last_update_steamid": "0",
      "event_notes": "see announcement body",
      "jsondata": {
        "localized_subtitle": [],
        "localized_summary": [],
        "localized_title_image": [],
        "localized_capsule_image": [
          "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
        ],
        "bSaleEnabled": false,
        "sale_show_creator": false,
        "sale_sections": [],
        "sale_browsemore_text": "",
        "sale_browsemore_url": "",
        "sale_browsemore_color": "",
        "sale_browsemore_bgcolor": "",
        "localized_sale_header": [],
        "localized_sale_overlay": [],
        "localized_sale_product_banner": [],
        "localized_sale_product_mobile_banner": [],
        "localized_sale_logo": [],
        "sale_font": "",
        "sale_background_color": "",
        "sale_header_offset": 530,
        "referenced_appids": [],
        "bBroadcastEnabled": false,
        "broadcastChatSetting": "hide",
        "default_broadcast_title": "#Broadcast_default_title_dev",
        "localized_broadcast_title": [],
        "localized_broadcast_left_image": [],
        "localized_broadcast_right_image": [],
        "broadcast_whitelist": [],
        "bScheduleEnabled": false,
        "scheduleEntries": [],
        "valve_access_log": [
          {
            "strSteamID": "76561199113010392",
            "rtUpdated": 1709684505
          },
          {
            "strSteamID": "76561198042665686",
            "rtUpdated": 1709583176
          },
          {
            "strSteamID": "76561198093408953",
            "rtUpdated": 1709675626
          },
          {
            "strSteamID": "76561198166130601",
            "rtUpdated": 1709677787
          }
        ]
      },
      "announcement_body": {
        "gid": "4115798034511159060",
        "clanid": "3703047",
        "posterid": "0",
        "headline": "Between the Lanes: Denying Denial of Service",
        "posttime": 1709684506,
        "updatetime": 1709684506,
        "body": "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]\n[i]Welcome back to Between the Lanes, a blog feature where members of our development team walk through some of the challenges, bugfixes, and occasional happy accidents we encounter while working on a game as unique as Dota.[/i]\n\nThis is a story about the internet, and how it doesn’t work like it should, when it works at all, except when it doesn’t. It’s a story about how the internet stopped working for our customers, and how we fixed it.\n\nThe internet is more of a wild frontier than we give it credit for being. Stray from the safe confines of your two-factor identification and trusted cookies, and it can be a bit of a wilderness out there, full of random trolls with the maliciousness—and, increasingly, the ability—to make your life pretty miserable for no other reason than because they can.\n\nBack in 2014, the method those trolls were using was distributed denial-of-service (DDoS) attacks. “Distributed” refers to a large number of internet hosts maliciously flooding a particular target IP with traffic in an effort to overwhelm the network stack. This is called a volumetric attack, and the intent isn’t to try to get into the network. It’s just trying to deny service. A distributed denial of service means that legitimate people who want legitimate service are crowded out by the bad traffic.\n\nThe problem with DDoS attacks was that, by late 2014, they weren’t being committed by data-exfiltrating super-hackers with advanced computer science degrees. They were being committed by just about anybody who wanted to pay a service or a bot to do it for them. And it’s pretty obvious why. Although some people were happy to do it purely for vandalism’s sake, others had a motive: A DDoS attack was a surefire way to shut down a match that either you or someone you were rooting for were losing. This wasn’t just an occasional irritation anymore. It was turning into an outright assault on any game where players competed.\n\nBy the opening months of 2015, we were seeing a huge uptick in DDoS attacks on Dota and CS:GO, with other companies reporting a huge jump as well. Someone had, very suddenly, made it very easy for anyone to do this.\n\nIn August 2015, The International was disrupted with DDoS attacks. Although the pros playing the match weren’t affected, for more than two hours, the broadcasters couldn’t get into the matches to give play-by-play and color commentary. Sending out the stream as a TV broadcast became an issue. The players were suddenly playing in a void. This was a professional gaming event with millions watching and millions of dollars on the line, and it was being disrupted by random people with five-dollar software. It was a problem Valve couldn’t ignore.\n\n[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]\nWe tried several solutions to deal with DDoS attacks before we arrived at one that worked. Initially, we attempted to filter the traffic with a powerful network switch. Unfortunately, this type of filtering is inherently difficult to do with game traffic. It is the nature of game servers to receive unsolicited UDP (User Datagram Protocol) traffic from arbitrary IP addresses. Imagine you had a post office that weeded out unwanted junk mail for you. But now imagine your job is as an advice columnist, and you receive tons of legitimate mail from random strangers all the time. For you, the post office doesn't know what's junk mail and what isn't. That's how traffic to game servers tends to look. Furthermore, the source IP in UDP packets is not secured, and can be easily spoofed. Our post office cannot even look at the return address on the envelope for clues, because the senders of junk mail forge that.\n\nSteam delivers a lot of bits for game content, and has built up a large network for doing so.  We were already taking advantage of this network to deliver game traffic over dedicated links, obtaining good peering, ensuring that networking engineering best practices were used, etc. This kept player ping times low, but did not protect against DDoS attack. The problem is that UDP protocols are not secure, so while we had our own network, it wasn't private.\n\nTo prevent attackers from using own own network to attack our servers, we needed to control all the entrances and secure them. We accomplished this by creating proxies for game traffic, routing every single packet of data transmitted across the network through relays. Now when a client wanted to talk to a game server, it had to do so through a relay that both authenticated it and proxied that traffic to the game server. This meant the IP address of the server was always hidden—the attacker simply had no idea where to attack.\n\nTo re-use our antiquated post office metaphor from earlier, our spammer no longer had an address to send junk mail to. They could send it to every post office in the area and ask them to mail it, but without authorization, that post office isn’t going to. (Moreover, that post office would find it a little suspicious that someone was trying to send a single person 100,000 letters.)\n\n[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]\nBut couldn’t you just attack the relay? Technically, you could. But we have an essentially limitless number of them, and we built them to be attacked. A “relay” is just another word for a computer running software. You can attack it or take it offline, but the protocol was designed with that assumption in mind. If a client is trying to play a game and loses contact with a relay, it just switches to another. Relays are like hundreds of pawns scattered around the world with the singular purpose of guarding the game server. (Incidentally, taking out a relay is harder than it sounds. They’re engineered pretty well and positioned in a specific part of the network, so although they were built to be taken offline, we haven’t lost one yet.)\n\nThe solution was straightforward but effective. Before, if someone wanted to disrupt a game, they could just overpower a single game server (a very low bar to clear). Now they had to overpower essentially the entire data center—a much, much, much higher bar. Are there attacks that could still accomplish this? Of course. Are there attacks that can do this that anyone online could buy for five dollars? No. An attack this sophisticated was officially out of the price range of most people.\n\nWith this new system up and running, we had an epiphany: If we controlled our own private network, we wouldn’t be beholden to how the normal internet works. We could use it to make the customer experience even better. With the normal internet, when you send a packet from one IP address to another, the route you use is determined by Border Gateway Protocol (BGP). This is a routing algorithm that decides how your packet will travel across a network, and you have no choice in the route it picks.\n\nBut with a virtual private network composed of hundreds of global relays and data centers, we could essentially choose our own route from the client to the game server—often a faster shortcut than the default route. If you’re using Steam Datagram Relay (SDR), the Steam overlay will show your ping time and what route we’re giving you, so you can see for yourself how it gets optimized.\n\n[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]\nA feature that started as a way to protect Dota game servers has grown past what anyone could have expected. The SDR network routinely delivers as much as 140M packets and 550GBit per second. We have relays in 31 data centers with a capacity of over 5TBit. What we now call the Steam Datagram Relay not only protects against DDoS attacks, but also increases connectivity and lowers ping for every Dota customer. And it doesn’t just do this for Dota, but for any game on Steam that wants to take advantage of it.\n\nWe hope you enjoyed another peek between the lanes of Dota. This was a pretty technical one, thanks for hanging in there for it! And feel free to let us know what you’d like us to cover next.",
        "commentcount": 0,
        "tags": [],
        "language": 0,
        "hidden": 0,
        "forum_topic_id": "0",
        "event_gid": "4115798034511159059",
        "voteupcount": 0,
        "votedowncount": 0,
        "ban_check_result": 0,
        "banned": 0
      },
      "published": 0,
      "hidden": 1,
      "rtime32_visibility_start": 1709684460,
      "rtime32_visibility_end": 0,
      "broadcaster_accountid": 0,
      "follower_count": 0,
      "ignore_count": 0,
      "forum_topic_id": "0",
      "rtime32_last_modified": 1709684505,
      "news_post_gid": "0",
      "rtime_mod_reviewed": 0,
      "featured_app_tagid": 0,
      "referenced_appids": [],
      "build_id": 0,
      "build_branch": "",
      "votes_up": 0,
      "votes_down": 0,
      "comment_type": "ForumTopic",
      "gidfeature": "1636418037459185108",
      "gidfeature2": "0",
      "clan_steamid_original": "103582791433224455"
    },
    {
      "gid": "4169840594110787959",
      "clan_steamid": "103582791433224455",
      "event_name": "7.35c Gameplay Patch",
      "event_type": 12,
      "appid": 570,
      "server_address": "",
      "server_password": "",
      "rtime32_start_time": 1708560360,
      "rtime32_end_time": 1708565401,
      "comment_count": 0,
      "creator_steamid": "0",
      "last_update_steamid": "0",
      "event_notes": "see announcement body",
      "jsondata": {
        "localized_subtitle": [],
        "localized_summary": [],
        "localized_title_image": [],
        "localized_capsule_image": [
          "493ad4813b6d1447f6a4210351f3d3ef6fd80b2e.jpg"
        ],
        "bSaleEnabled": false,
        "sale_show_creator": false,
        "sale_sections": [],
        "sale_browsemore_text": "",
        "sale_browsemore_url": "",
        "sale_browsemore_color": "",
        "sale_browsemore_bgcolor": "",
        "localized_sale_header": [],
        "localized_sale_overlay": [],
        "localized_sale_product_banner": [],
        "localized_sale_product_mobile_banner": [],
        "localized_sale_logo": [],
        "sale_font": "",
        "sale_background_color": "",
        "sale_header_offset": 530,
        "referenced_appids": [],
        "bBroadcastEnabled": false,
        "broadcastChatSetting": "hide",
        "default_broadcast_title": "#Broadcast_default_title_dev",
        "localized_broadcast_title": [],
        "localized_broadcast_left_image": [],
        "localized_broadcast_right_image": [],
        "broadcast_whitelist": [],
        "bScheduleEnabled": false,
        "scheduleEntries": [],
        "valve_access_log": [
          {
            "strSteamID": "76561198166130601",
            "rtUpdated": 1708553077
          },
          {
            "strSteamID": "76561197983103913",
            "rtUpdated": 1708560380
          },
          {
            "strSteamID": "76561198093408953",
            "rtUpdated": 1709161946
          }
        ]
      },
      "announcement_body": {
        "gid": "4169840594110787960",
        "clanid": "3703047",
        "posterid": "0",
        "headline": "7.35c Gameplay Patch",
        "posttime": 1708560381,
        "updatetime": 1709161946,
        "body": "Patch 7.35c is out now. You can check out the patchnotes [url=https://www.dota2.com/patches/7.35c]here[/url]. \n\nAdditionally, a few updates were made to the Ancient Dragon King cosmetic.\n\n[list]\n[*] You can now High Five the Ancient Dragon King, featuring a custom high five effect.\n[*] Ancient Dragon King now performs a global celebratory roar every time your team makes a rampage.\n[*] Ancient Dragon King will now be usable permanently and not only during the Year of the Dragon.\n[/list]",
        "commentcount": 399,
        "tags": [
          "patchnotes",
          "mod_reviewed",
          "ModAct_1434573178_1708562833_0",
          "ModAct_487176015_1709165256_4"
        ],
        "language": 0,
        "hidden": 0,
        "forum_topic_id": "4347732779392992177",
        "event_gid": "4169840594110787959",
        "voteupcount": 8177,
        "votedowncount": 1486,
        "ban_check_result": 0,
        "banned": 0
      },
      "published": 1,
      "hidden": 0,
      "rtime32_visibility_start": 0,
      "rtime32_visibility_end": 0,
      "broadcaster_accountid": 0,
      "follower_count": 0,
      "ignore_count": 0,
      "forum_topic_id": "4347732779392992177",
      "rtime32_last_modified": 1709684190,
      "news_post_gid": "0",
      "rtime_mod_reviewed": 1709165256,
      "featured_app_tagid": 0,
      "referenced_appids": [],
      "build_id": 0,
      "build_branch": "",
      "votes_up": 8177,
      "votes_down": 1486,
      "comment_type": "ForumTopic",
      "gidfeature": "1636418037459185108",
      "gidfeature2": "4347732779392992177",
      "clan_steamid_original": "103582791433224455"
    }
  ],
  "success": 1
}