{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus наближава",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus наближава",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Беше натоварена година за Dota 2. Приветствахме нов герой в редиците си, а един друг дългоочакван такъв най-сетне направи своя дебют. Коронясахме поредния отбор от световни шампиони на тазгодишния TI в Копенхаген. Преработихме всеки герой с нови, променящи играта, присъщи умения и фасети. А дори успяхме да натикаме и многомесечно епично повествование с четири акта относно говорещи птици.",
      "И тъй, докато краят на годината приближава, отново се оказваме изпълнени до краен предел с духа на Frostivus. А това означава пълен чувал с празнични подаръци за всички по време на [b]Frostivus събитието, отсега до 15 януари[/b]. ",
      "[h2]Разкрито е истинското значение на Frostivus — шапки[/h2]",
      "„Какви видове подаръци?“ би могъл някой празнично да се зачуди. Е, като за начало — до края на сезона героят Ви ще започва всяка игра, носейки стилна [b]Frostivus шапка[/b]. ",
      "Но не я възприемайте като модна изява. Приемете я като сандък за трофеи. Защото можете да крадете шапки от вражески герои и да се сдобивате с тях като подаръци от Вашите съюзници с новото умение [b]Spirit of Frostivus[/b]. Също така можете да се сдобивате с тях и по старомодния начин… При убийство с цел грабеж, като ги открадвате от черепите на герои, които току-що сте убили, от мъчителите или, ако наистина знаете какво правите, дори от дебелата мъртва чутура на Roshan. ",
      "И всяка едничка шапка, която вземате, може да се носи върху всички останали в прославено величествена, убийствена купчина от шапки. Плюс това, тъй като екранът за НЦИ след игра вече включва пресмятане на шапките, ще разполагате с окончателно доказателство за шапното Ви превъзходството през идните дни. ",
      "[h2]Frostivus история[/h2]",
      "И тъй, вече имате кула от Frostivus шапки на главата си. Но дали можете наистина да им се насладите, без да знаете тяхната изчерпателна предистория? Както установихме, отговорът е да. „Това са просто цветни шапки“, ще речете Вие. „На кого му пука откъде са дошли?“ ",
      "Е, щеше да е страхотно време да споменете това преди шест месеца, защото написахме легендарен справочник от шестстотин хиляди думи за това, наречен „Шапкомарилионът“. Но всички отказаха да го прочетат… Ето защо написахме „Шапкомарилионът“ като интерпретация за детско книжле от десетина страници, която отнема около минута за четене, и изглежда, че всички харесаха тази версия повече. [b]Пуснете Dota 2 и се насладете на историята[/b] сами! Любопитен факт за Frostivus — ще бъдете способни да прочетете детското книжле „Шапкомарилионът“ ТРИДЕСЕТ ПЪТИ за времето, което би Ви било необходимо, така че да прегледате тази публикация в блога!",
      "[h2]Frostivus ковачница[/h2]",
      "Но почакайте! Във въздуха се носи още от духа на Frostivus! За съжаление, той е разбит на химическите си компоненти и трябва да бъде преустроен в сезонно сложно съставно съединение. Събрахме купища от всички провизии, които ще са Ви нужни, за да изработвате награди в новата [b]Frostivus ковачница[/b]. Каква е следващата стъпка? Действителната част с изработването. ",
      "Всичко, което е нужно да сторите, е да изпълните разнообразни щуротии в играта, като например „хвърлете снежна топка по враг, преди да го убиете“, „откраднете шапка“ или „дай гепи на враг“, за да печелите уникални провизии, които захранват Вашата ковачница и изработвайте нови награди. Всеки артикул изисква различна рецепта за изработване и можете да отключите по-високи поредици, като първо завършите наградите в по-ниските такива. Сезонни чат рулетки? Налични са. Нов камбановиден мъчител, който Ви позволява да свирите музика? Очевидно има такъв. Пиян магьосник, яздещ куриер под формата на северен елен, подозрително приличащ на магаре? Ама разбира се, що за празник би било без такова нещо!",
      "[h2]Съкровището Winter 2024 Heroes' Hoard[/h2]",
      "А знаете ли без какво друго нещо не би било празник? Кутия, пълна с изненади! Ето защо също разкриваме [b]Winter 2024 Heroes' Hoard[/b], съвсем ново съкровище, включващо 17 набора с артикули за множество герои. ",
      "Но това не е всичко. С цел да се уверим, че пределите на това съкровище са наистина изпитани до край, натъпкахме няколко нови Immortal артикула измежду наборите. След това добавихме няколко нови присмеха. И вълче кутре за домашен любимец на кавгаджийската ни фаворитка от леката категория. А когато осъзнахме, че новият набор за Windranger изглежда страхотно, когато е екипиран с нейния Arcana артикул, включихме и това. Това съкровище е достъпно в Crownfall магазина, така че можете да използвате своите Crownfall монети за покупката.",
      "[h2]Вълна от забрани за края на годината[/h2]",
      "King Kringle си потроши чука, налагайки забрани на някои повече от заслужили ги магарета през изминалата година. Той прекара годината, като непрекъснато го преправяше и изпитваше върху различни „смърф“ акаунти и непрокопсаници в играта, а сега вече е готов пак да го покръсти с кръвта на непослушните.",
      "Макар че обикновено правим повечето вълни от забрани и наказания зад кулисите, взе да става нещо като традиция по Frostivus мъничко да поиздърпваме завесата и да проговорваме относно тази протичащата работа. И така… Надяваме се, че през този празничен сезон очаквате с нетърпение малко по-спретнати, по-дружелюбни и по-справедливи игри, окрилени от липсата на [b]65 594 „смърф“ акаунта[/b], срещу които предприехме действия тази седмица. ",
      "Освен „смърф“ акаунтите, също така треснахме чука върху значителен брой злонамерени потребители с висок рейтинг за търсене на мачове (РТМ); играчи, които са опитвали да се забавляват за сметка на останалите; лица, експлоатиращи неизправности; акаунти, замесени в търгуване за победи и иначе казано такива, които са подкопавали съревнователното предизвикателство, което е в основата на всеки мач от Dota 2.",
      "Както винаги, бихме искали да благодарим на всички, които са подавали доклади през годината. Всички тези данни ни помагат да намерим и предприемем действия срещу играчите, които влошават Dota 2 игрите. Заради онези от Вас, които ни помагат, Dota 2 е по-добра игра.",
      "[h2]Разпродажба за края на годината[/h2]",
      "Дадена публикация в Dota 2 блог много прилича на извисяваща се купчина от Frostivus шапки, тъй като нещо винаги се таи на дъното. Този път това нещо е собствената [b]зимна разпродажба[/b] на Dota 2 за Crownfall съдържание, провеждана отсега до 03 януари. ",
      "Отключвайте нови сюжетни възли с отстъпки на пакетите за пътеводители на Средната порта, Друуд и Ледоостанково. Издокарайте героите си в Небогнявовските набори от Crownfall съкровища I — III. Или пък завършете трансформациите на Шен и Драгонус с Arcanas артикулите за Vengeful Spirit и Skywrath Mage. В случай че все още имате куп Crownfall монети, можете да ги използвате за допълнителни отстъпки на повечето артикули от Crownfall магазина, дори ако те вече са намалени като част от разпродажбата!",
      "Все още имате време да се задълбочите във всичко, което Crownfall може да предложи, докато навлизаме в новата година, но сагата за Небогнявово най-сетне ще приключи на 15 януари. Ето защо, ако все пак имате да проучвате още от четирите акта, най-добре се залавяйте за работа."
    ],
    "commentcount": 688,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 34865,
    "votedowncount": 3982,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1738143318,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 34863,
  "votes_down": 3982,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}