{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Joyeux Frostivus !",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Joyeux Frostivus !",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Dota a eu une année chargée. Nous avons accueilli un nouveau héros dans nos rangs (et un autre extrêmement attendu a enfin fait ses débuts), et nous avons couronné une nouvelle équipe de champions du monde au TI de Copenhague. Toutes les unités héroïques ont été retravaillées avec des capacités innées et des facettes qui ont profondément modifié le jeu, et une épopée narrative de plusieurs mois en quatre actes sur des oiseaux qui parlent a captivé la communauté.",
      "L'année touche à sa fin, et comme le veut la tradition, l'esprit de Frostivus s'invite aux festivités. Il a déposé une hotte remplie à ras bord de superbes cadeaux pour l'ensemble de la communauté, à découvrir pendant tout l'[b]évènement Frostivus, dès maintenant et jusqu'au 15 janvier. [/b]",
      "[h2]L'essence même de Frostivus enfin révélée (les chapeaux)[/h2]",
      "« Quel genre de cadeaux ? », vous demandez-vous, trépignant d'impatience. Eh bien, pour commencer : votre unité héroïque commencera chaque partie avec un [b]chapeau chic de Frostivus[/b] sur la tête pendant le reste de la saison. ",
      "Attention, ce n'est pas un accessoire de mode. Mais plutôt une vitrine de trophées. Parce que vous pouvez voler les chapeaux de vos adversaires et les offrir à vos partenaires avec la nouvelle capacité [b]Spirit of Frostivus[/b]. Vous pouvez également mettre la main dessus en commettant des meurtres et larcins tout ce qu'il y a de plus classique : récupérez-les sur des crânes de vos victimes, dans les ruines des fossoyeurs, ou si vous savez ce que vous faites, de la vilaine caboche de Roshan. ",
      "Chaque nouveau chapeau que vous prenez sera empilé au-dessus des autres sur votre tête pour former une colonne glorieuse de chapeaux. Et si ça ne suffisait pas, l'écran des louanges post-match inclut désormais votre nombre de chapeaux accumulés. De quoi faire trembler vos adversaires à la tête découverte ! ",
      "[h2]Un conte de Frostivus[/h2]",
      "Vous voilà donc avec une tour de chapeaux de Frostivus sur la tête. Soyez honnête, pourrez-vous en profiter pleinement sans tout savoir sur leur histoire ? On sait ce que vous vous dites. « Ce ne sont que des bonnets colorés ». « On n'en a rien à faire d'où ils viennent. » ",
      "Ah, il aurait fallu nous le dire il y a six mois avant que nous n'entamions la rédaction de notre saga épique, « Le Seigneur des Chapeaux ». Personne n'a accepté de le lire, alors nous en avons fait un condensé de dix pages pour les enfants qui se lit en une minute, et tout le monde a préféré cette version. [b]Lancez Dota, et découvrez-la par vous-même[/b] ! (Anecdote Frostivus : vous pourriez lire l'histoire TRENTE FOIS dans le temps qu'il vous faudra pour lire ce billet.)",
      "[h2]Forge de Frostivus[/h2]",
      "Et ce n'est pas fini ! Il reste encore de l'esprit de Frostivus dans l'air ! Malheureusement, il a été désintégré dans ses éléments chimiques les plus basiques et il faut le reconstituer en un composé de saison. Nous avons rassemblé tout le matériel nécessaire à la fabrication de récompenses dans la nouvelle [b]Forge de Frostivus[/b]. La prochaine étape ? La fabrication en tant que telle. ",
      "Il vous suffira d'accomplir une variété de pitreries en jeu, comme lancer une boule de neige sur une unité ennemie avant de la tuer, voler un chapeau ou taper dans la main d'un adversaire. Vous obtiendrez ainsi des composants uniques qui alimenteront votre forge et vous permettront de fabriquer de nouvelles récompenses. Chaque récompense requiert une formule de fabrication différente, et vous pourrez déverrouiller les niveaux plus élevés en réalisant d'abord les récompenses des niveaux plus bas. Des roues des dialogues saisonnières ? C'est prévu ! Un nouveau fossoyeur en forme de cloche qui permet de jouer de la musique ? Ça aussi. Un sorcier éméché chevauchant un renne qui ressemble à s'y méprendre à un âne en guise de coursier ? Bien sûr, ce ne serait pas Frostivus sans eux !",
      "[h2]Butin héroïque de l'hiver 2024[/h2]",
      "Il ne manquait qu'une seule chose pour des fêtes réussies. Une caisse pleine de surprises ! C'est pourquoi nous dévoilons le [b]butin héroïque de l'hiver 2024[/b], un tout nouveau trésor avec 17 ensembles d'items pour une ribambelle de héros et d'héroïnes. ",
      "Mais ce n'est pas tout ! Afin de nous assurer que ce butin soit bien rempli à ras bord, nous y avons aussi déposé des items immortels parmi les ensembles. Ensuite, nous avons ajouté de nouvelles railleries. Et un petit animal de compagnie pour la plus loyale des boxeuses. Enfin, on a tellement aimé le nouvel ensemble de Windranger avec l'Arcane qu'on se devait de le glisser dans le coffre. Ce trésor est disponible dans l'échoppe de La Chute de la couronne, vous pouvez donc mettre à contribution vos pièces de La Chute de la couronne pour cet achat.",
      "[h2]Vague de bannissements de fin d'année[/h2]",
      "Le roi Fouettard avait cassé son marteau sur des andouilles qui l'avaient bien mérité l'année dernière. Il a passé l'année à le forger et le reforger et l'a testé sur divers comptes de smurfs et autres canailles au comportement toxique, si bien qu'il est fin prêt à le rebaptiser avec le sang des crapules.",
      "Bien que nous appliquions généralement la plupart de nos bannissements et pénalités en douce, une sorte de tradition de Frostivus est en train de s'établir : le lever de rideau sur les efforts entrepris dans ce domaine. Nous espérons donc que ces fêtes de fin d'année vous apporteront des parties plus propres, plus amicales et plus justes, loin des [b]65 594 comptes smurfs[/b] contre lesquels nous avons sévi cette semaine. ",
      "Les smurfs ne sont pas les seules victimes du marteau : il est aussi tombé sur les comptes au MMR élevé qui se livrent à l'antijeu, les joueurs et joueuses qui s'amusent aux dépens des autres, qui profitent de failles du jeu, qui faussent les résultats, ou qui vont à l'encontre de l'esprit compétitif qui est au cœur de chaque partie de Dota.",
      "Comme toujours, nous remercions toutes celles et ceux qui ont effectué un signalement au cours de cette année. Toutes ces données nous permettent de déceler les joueurs ou joueuses qui gâchent le plaisir de jouer à Dota et d'agir en conséquence. C'est grâce à vous que Dota s'améliore.",
      "[h2]Soldes de fin d'année[/h2]",
      "Un billet de Dota est comme une tour de chapeaux Frostivus empilés : il y a toujours quelque chose tout en bas. Cette fois-ci, il s'agit des [b]soldes d'hiver[/b] exclusifs à Dota sur le contenu de La Chute de la couronne, dès maintenant, et jusqu'au 3 janvier. ",
      "Profitez de remises sur les packs d'expédition de la Patte-d'Oie, de Druud et des landes de Glace pour faire progresser l'histoire, relookez vos héros et héroïnes avec les ensembles de Skywrath des trésors I à III, ou débloquez la forme finale de Shen et de Dragonus avec les Arcanes de Vengeful Spirit et de Skywrath Mage. (S'il vous reste encore des pièces de La Chute de la couronne, vous pouvez les utiliser pour réduire encore davantage le prix des items de l'échoppe, même s'ils sont déjà soldés !)",
      "Vous aurez encore un peu de temps pour continuer d'explorer le contenu de La Chute de la couronne en début d'année prochaine, mais la saga de Skywrath sera définitivement clôturée le 15 janvier, alors s'il vous reste encore des recoins de la carte des quatre actes à explorer, c'est maintenant ou jamais !"
    ],
    "commentcount": 264,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 3782,
    "votedowncount": 308,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734626592,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 3773,
  "votes_down": 305,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}