{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Elérkezett a Frostivus",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Elérkezett a Frostivus",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Mozgalmas év volt ez a Dotában. Új hőst üdvözölhettünk sorainkban (egy várva várt hős pedig végre debütált); újabb csapatnyi világbajnokot koronáztunk meg az idei The Internationalen Koppenhágában; átdolgoztunk minden hőst új, a játékot radikálisan megváltoztató ösztönös képességekkel és vetületekkel; és még egy beszélő madarakról szóló, négyfelvonásos elbeszélő eposzt is sikerült belezsúfolnunk.",
      "És ahogy az év a végéhez közeledik, újra csordultig telt a szívünk a Frostivus szellemével. Ez pedig egy zsák ünnepi ajándékot jelent mindenkinek a [b]Frostivus esemény idejére, mostantól január 15-ig. [/b]",
      "[h2]Felfedtük a Frostivus lényegét (sapkák)[/h2]",
      "„Miféle ajándékok?” – gondolhatja ünnepi hangulatában az ember. Nos, kezdetnek: a szezon hátralévő részére a hősöd minden játékot egy stílusos [b]Frostivus sapkával[/b] fog kezdeni. ",
      "De ne gondold, hogy ez divatteremtés. Sokkal inkább trófeagyűjtemény! Mert az ellenséges hősöktől el is lophatod a sapkákat, vagy kaphatsz ajándékba is szövetségeseidtől az új [b]Spirit of Frostivus[/b] képességgel. A jó öreg, hagyományos módszerrel (gyilkosság és fosztogatás) is szerezhetsz sapkákat, lelopva azokat az általad épp megölt hősök koponyájáról, illetve a Gyötrőktől, vagy ha igazán jól érted a dolgodat, akár Roshan pikkelyes, halott fejéről is. ",
      "És minden egyes megszerzett sapkát a többi tetejére helyezve tudsz viselni, a dicsőség fenséges, véráztatta sapkakupacaként. Ráadásul, mivel a játékvégi MVP-képernyő mostantól sapkaösszesítést is tartalmaz, az elkövetkezendő napokban döntő bizonyítékod lesz sapka-felsőbbrendűségedről. ",
      "[h2]Frostivusi történet[/h2]",
      "Szóval, már van egy toronnyi Frostivus sapka a fejeden. De tudsz valóban örülni nekik anélkül, hogy ismernéd részletes háttértörténetüket? Mint kiderült, a válasz: igen. „Csak színes sapkák.” – mondhatnád. „Kit érdekel, honnan származnak?” ",
      "Nos, remek lett volna ezt hat hónappal ezelőtt megemlíteni, mert írtunk róla egy hatszázezer szavas, „A sapkarilok” című, legendagyűjteményt. De azt senki sem volt hajlandó elolvasni, ezért megírtuk „A sapkarilok” tízoldalas gyermekkönyv változatát, amit körülbelül egy perc elolvasni, és úgy tűnt, ez mindenkinek jobban tetszik. [b]Indítsd el a Dotát, és élvezd te is a történetet![/b] (Frostivusi érdekesség: HARMINCSZOR el fogod tudni olvasni annyi idő alatt, amennyi időbe e blogbejegyzés elolvasása telik!)",
      "[h2]Frostivusi Műhely[/h2]",
      "De várj csak! Van még ám spiritusz ebben a Frostivusi ünnepben. Szó szerint. Méghozzá a levegőben! És a spiritusz sajnos kémiai összetevőire bomlott, és újra kell képezni szezonális vegyületté. Összegyűjtöttünk egy halom felszerelést, amire szükséged lesz a jutalmak elkészítéséhez az új [b]Frostivusi Műhelyben[/b]. És a következő lépés? Maga az elkészítés. ",
      "Csak annyit kell tenned, hogy teljesítesz különféle játékbeli mulatságokat; például „találj el egy hőst hógolyóval, mielőtt megölöd”, „lopj sapkákat” vagy „pacsizz ellenségekkel” egyedi felszerelések szerzéséhez, melyek táplálják kovácsműhelyed, hogy új jutalmakat készíthess. Az egyes elemek elkészítéséhez más-más receptek szükségesek, és a magasabb szinteket úgy oldhatod fel, ha először elkészíted a jutalmakat az alacsonyabb szinteken. Szezonális Csevegőkorongok? Pipa. Egy új harang alakú Gyötrő, amivel zenét játszhatsz le? Még szép, hogy van! Egy részeg varázsló, aki egy gyanúsan szamárszerű rénszarvas futáron ül? Nélkülük nem is lenne ünnep az ünnep!",
      "[h2]2024. Téli Hősök Zsákmánya[/h2]",
      "Tudod még mi nélkül nincs ünnep? Egy meglepetésekkel teli doboz nélkül! Ezért felfedjük a [b]2024. Téli Hősök Zsákmányát[/b] is, egy vadonatúj kincset, benne 17 tárgyszettel egy sor hőshöz. ",
      "És ez még nem minden. Hogy tényleg leteszteljük a kincsesláda strapabírását, a szettek közé betömtünk még néhány új Halhatatlan tárgyat. Meg hozzáadtunk néhány új gúnyolódást.  És egy farkas kisállatot mindenki kedvenc apró bunyósának. És amikor rájöttünk, hogy az új Windranger szett remekül néz ki a Titokzatosával felszerelve, azt is beleraktuk. Ez a kincs megvásárolható a Trónfosztás Boltban, így felhasználhatod a Trónfosztás érméidet a vásárláshoz.",
      "[h2]Év végi kitiltóhullám[/h2]",
      "Rémapó tavaly eltörte kitiltókalapácsát néhány, azt jól megérdemlő hátsón. Az egész évet annak folyamatos újraformálásával, valamint különféle smurfökön és játékbeli rosszfiúkon tesztelésével töltötte, most pedig készen áll újraszentelésére a rosszaságok vérével.",
      "Bár a legtöbb kitiltást és büntetést általában a színfalak mögött hajtjuk végre, egyfajta frostivusi hagyománnyá vált, hogy egy kicsit félrehúzzuk a függönyt, és beszélünk erről a folyamatos munkáról. Tehát reméljük, hogy készen álltok az ünnepi szezonban a tisztább, barátságosabb és igazságosabb meccsekre, amelyek mentesek a [b]65 594 smurf fióktól[/b], amelyekkel szemben e héten léptünk fel. ",
      "A smurfök mellett jelentős számú, magas JáR-ral rendelkező szemétkedőre is rácsaptunk a kalapáccsal, olyan játékosokra, akik mások rovására próbálnak szórakozni, kihasználva a hibákat, győzelmekkel üzletelve, és más módon aláásva azt a versengő kihívást, ami minden Dota játék lényege.",
      "Mint mindig, szeretnénk köszönetet mondani mindenkinek, aki az év során jelentést küldött. Mindezen adatok segítenek megtalálni a Dota játékokat tovább rontó játékosokat, és fellépni ellenük. A Dota nektek köszönhetően lett jobb játék.",
      "[h2]Év végi vásár[/h2]",
      "Egy Dota blogbejegyzés olyan, mint egy tornyosuló frostivusi sapkahalom, mivel mindig van valami az alján. Ezúttal ez valami a Dota saját [b]téli vására[/b] a Trónfosztás-tartalmakra, amely mostantól január 3-ig tart. ",
      "Oldj fel új történetállomásokat a kedvezményes Kapuköz, Druud és Jégtönk Útkereső Csomagokkal, díszítsd fel hőseidet Égharagja szettekkel a Trónfosztás Kincs I-III csomagokból, vagy fejezd be Shen és Dragonus átalakulását a Vengeful Spirit és Skywrath Mage Titokzatosok segítségével. (Ha még mindig van egy csomó Trónfosztás érméd, felhasználhatod azokat a Trónfosztás Bolt legtöbb termékének további leárazására, még akkor is, ha a termékek a vásár részeként már kedvezményesek!)",
      "Még mindig van időd beleásnod magad a Trónfosztás teljes kínálatába, ahogy az új évet köszöntjük, de az égharagjai történet január 15-én végleg véget ér, szóval ha van még mit felfedezned a négy felvonásból, a legjobb, ha most nekiállsz."
    ],
    "commentcount": 688,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 34865,
    "votedowncount": 3982,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1738143318,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 34863,
  "votes_down": 3982,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}