{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus står for døra",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus står for døra",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Det har vært et travelt år for Dota. Vi ønsket en ny helt velkommen i rekkene våre (og en etterlengtet fikk endelig sin debut). Vi kronet enda et lag med verdensmestere på årets TI i København. Vi omarbeidet hver helt med nye spillskiftende medfødte evner og fasetter, og vi klarte til og med over flere måneder å stappe inn et fireakters narrativt epos om snakkende fugler.",
      "Og så, i det året nærmer seg slutten, er vi atter fylt helt til randen med frostivusstemning. Og det betyr sekkevis med høytidsstemte gaver for alle gjennom hele [b]Frostivus-begivenheten, fra nå til 15. januar. [/b]",
      "[h2]Den virkelige meningen med frostivus åpenbares (hatter)[/h2]",
      "«Hva slags gaver?» kan man festlig undre seg. For det første, resten av sesongen begynner heltene hver kamp iført en stilig [b]frostivushatt.[/b] ",
      "Men ikke tenk på det som mote. Tenk på det som et troféskap. Fordi du kan også stjele hatter fra fiendtlige helter og få dem som gaver fra allierte med den nye evnen [b]Frostivusstemning[/b]. Du kan også få dem på gamlemåten (mord/tyveri) ved å stjele dem fra skallene til heltene du nettopp tok av dage, fra plageåndene, eller hvis du virkelig vet hva du gjør, til og med fra Roshans værbitte skolt. ",
      "Og hver eneste hatt du tar, kan du bære oppå alle de andre i en majestetisk, morderisk hattestabel av ære. Dessuten siden MVP-skjermen nå inneholder hatteopptellinger, har du skikkelig bevis på hatteoverlegenheten din i dagene som kommer. ",
      "[h2]En frostivusfortelling[/h2]",
      "Så nå har du et tårn av frostivushatter på hodet. Men kan du egentlig glede deg over dem uten å vite om deres dyptgående bakgrunnshistorie? Svaret er tydeligvis ja. «Det er bare fargede hatter», sier du. «Hvem bryr seg om hvor de kommer fra?» ",
      "Vel, det hadde vært greit å vite dette for et halvår siden, for vi har skrevet et legendarium på 600 000 ord om dette som heter Hattemarillion. Men alle nektet å lese den, så vi skrev en barnebokversjon på ti sider som tar omtrent et minutt å lese, og det virker som at alle likte den bedre. [b]Start Dota og nyt fortellingen[/b] selv! (Du kan lese den TRETTI GANGER i løpet av tiden det tar deg å komme gjennom dette blogginnlegget!)",
      "[h2]Frostivussmia[/h2]",
      "Men vent! Det er fortsatt mer frostivusstemning i lufta! Dessverre har den blitt brutt ned til sine kjemiske komponenter og må gjenoppbygges til en sesongbasert forbindelse. Vi har samlet en haug med alle forsyningene du trenger for å lage belønninger i den nye [b]Frostivussmia[/b]. Neste steg? Selve håndverksdelen. ",
      "Alt du trenger å gjøre, er å utføre en rekke påfunn i spillet som «kast snøball på en fiende før du dreper dem», «stjel en hatt» eller «high five en fiende» for å tjene unike forsyninger å bruke i smia og lage nye belønninger. Hver gjenstand krever en ulik oppskrift for å lage, og du kan låse opp høyere kategorier ved å gjennomføre belønninger i de lavere kategoriene først. Sesongbaserte samtalehjul? Jepp. En ny klokkeformet plageånd som lar deg spille musikk? Må jo ha det. En beruset trollmann som rir på en mistenkelig eselformet reinkurer? Det hadde jo ikke vært en høytid uten dem!",
      "[h2]Vinteren 2024 – Heroes' Hoard[/h2]",
      "Vet du hva annet det heller ikke hadde vært en høytid uten? En boks full av overraskelser! Så vi avslører også [b]Vinteren 2024 – Heroes’ Hoard[/b], en helt ny skatt som inneholder 17 gjenstandssett for en rekke helter. ",
      "Men det er ikke alt. Vi ville teste hvor mye vi hadde plass til i denne skatten, så vi stappet inn noen nye udødelige gjenstander blant settene. Så la vi til noen nye hån. Og en kjæledyrulv til alles yndlingsbråkmaker. Og da vi innså at det nye Windranger-settet så skikkelig bra ut sammen med arkanaen hennes, tok vi med den også. Denne skatten er tilgjengelig i Kronfallbutikken, slik at du kan bruke Kronfallmynter til kjøpet.",
      "[h2]Utestengelsesbølge ved årsslutt[/h2]",
      "Nissekongen slo til med utestengelseshammeren på noen velfortjente bakender i fjor. Han har brukt året på å stadig omforme og teste den på ulike smurfer og slemminger i spillet, og nå er han klar til å innvie den med de slemmes blod.",
      "Vi pleier vanligvis å gjøre de fleste utestengelser og straffer bak kulissene, men det har blitt en slags frostivustradisjon for oss å sette teppet litt på gløtt og snakke om dette pågående arbeidet. Så dermed: Denne høytiden håper vi du gleder deg til noen renere, vennligere, mer rettferdige kamper, uten de [b]65 594 smurfekontoene[/b] vi har tatt grep mot denne uken. ",
      "Foruten smurfene har vi også sluppet hammeren på et betydelig antall plagsomme personer med høy MMR, spillere som prøver å ha det gøy på bekostning av andre, utnytter spillfeil, bytter seiere og på annen måte undergraver konkurranseånden som er kjernen av hver kamp i Dota.",
      "Vi vil som alltid takke alle som har sendt inn en rapport i løpet av året. All dataen hjelper oss med å finne spillerne som gjør kamper i Dota verre, og iverksette tiltak. Dota er et bedre spill på grunn av dere.",
      "[h2]Salg ved årsslutt[/h2]",
      "Et Dota-blogginnlegg er omtrent som en ruvende stabel med frostivushatter, det har alltid noe på bunn. Denne gangen er det Dotas helt egne [b]vintersalg[/b] på innhold i Kronfallet, som varer frem til 3. januar. ",
      "Lås opp nye historienoder med rabatter på Midportens, Druuds og Isbrakks stifinnerpakker, pynt heltene med sett fra Skyvilden fra Kronfallets skatter I–III, eller fullfør forvandlingene til Skjendel og Dragonus med arkanaene til Vengeful Spirit og Skywrath Mage. (Hvis du fortsatt har en haug med Kronfallmynter, kan du bruke dem til å få større rabatt på de fleste gjenstandene i Kronfallbutikken, selv om gjenstandene allerede er på tilbud som en del av salget!)",
      "Du har fortsatt tid til å sjekke ut alt Kronfallet har å by på når vi går inn i et nytt år, men sagaen om Skyvilden rundes av den 15. januar, så hvis du fortsatt har igjen mer å utforske av de fire aktene, er det bare å komme i gang."
    ],
    "commentcount": 688,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 34864,
    "votedowncount": 3982,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1738143165,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 34863,
  "votes_down": 3982,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}