{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Mroźny Festiwal już się zbliża",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mroźny Festiwal już się zbliża",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "To był pracowity rok dla Dota 2. W naszych szeregach powitaliśmy nowego bohatera (a ten długo oczekiwany w końcu doczekał się swojego debiutu), ukoronowaliśmy kolejną drużynę mistrzów świata tegorocznego TI w Kopenhadze i przerobiliśmy każdego bohatera, dodając mu zmieniające oblicze rozgrywki umiejętności wrodzone oraz aspekty. Udało nam się nawet wcisnąć między to wszystko składającą się z 4 aktów epopeję o gadających ptakach rozciągającą się na wiele miesięcy.",
      "I tak właśnie ten rok dobiega końca, a my po raz kolejny zostajemy napełnieni po korek duchem Mroźnego Festiwalu. A to oznacza wór świątecznych prezentów dla wszystkich na czas trwania [b]festiwalowego wydarzenia od teraz do 15 stycznia. [/b]",
      "[h2]Objawienie prawdziwego znaczenia Mroźnego Festiwalu (nakrycia głowy)[/h2]",
      "Możecie się świątecznie zastanawiać, jakie to prezenty. Cóż, na początek: przez resztę sezonu wasi bohaterowie rozpoczną grę ze stylowym [b]nakryciem głowy Mroźnego Festiwalu[/b]. ",
      "Ale nie bierzcie tego za modowy kaprys. Myślcie o tym w kategorii skrzyni z nagrodami, ponieważ możecie także podwędzać nakrycia głowy wrogim bohaterom i otrzymywać je w prezencie od waszych sojuszników dzięki nowej umiejętności [b]Ducha Mroźnego Festiwalu[/b]. Możecie je zdobyć również w tradycyjny sposób (morderstwo/zawłaszczenie), zdzierając je z czaszek świeżo zabitych przez was bohaterów, z dręczycieli, albo o ile naprawdę wiecie, co robicie, nawet z chropowatego, nieżywego łba Roshana. ",
      "Każde ze zdobytych przez was nakryć głowy możecie zakładać na wierzch pozostałych w majestatyczno-morderczej stercie czapek chwały. Do tego z uwagi na fakt, że ekran MVP po grze obejmuje teraz zestawienia nakryć głowy, będziecie mieć niezbity dowód waszej czapkowej supremacji w nadchodzących dniach. ",
      "[h2]Opowieść Mroźnego Festiwalu[/h2]",
      "A więc macie teraz na głowach wieżę z czapek Mroźnego Festiwalu. Ale czy możecie naprawdę się nimi cieszyć bez znajomości ich wyczerpującej historii? Odpowiedź, jak udało nam się ustalić, brzmi tak. Gadacie, że to tylko kolorowe czapki. I że wszystkim lata, skąd się wzięły. ",
      "Cóż, pół roku temu mogła być odpowiednia pora, żeby o tym wspomnieć, bo napisaliśmy na ten temat złożony z sześciuset tysięcy słów legendarz zatytułowany „Czapkomarillion”. Jednak nikt nie chciał go przeczytać, więc napisaliśmy dziesięciostronicowy „Czapkomarillion” w wersji dla dzieci, której przeczytanie zajmuje jakąś minutę i zdaje się, że wszystkim ta wersja spodobała się bardziej. [b]Odpalcie grę i sami przekonajcie się o świetności tej opowieści[/b]! Ciekawostka na temat Mroźnego Festiwalu: będziecie w stanie przeczytać to 30 RAZY w czasie, jaki zajęłoby wam dokończenie lektury tego wpisu.",
      "[h2]Kuźnia Mroźnego Festiwalu[/h2]",
      "Ale chwileczkę! W powietrzu wciąż czuć jeszcze więcej ducha Mroźnego Festiwalu! Niestety rozpadł się na związki chemiczne, z których jest złożony i musi zostać odtworzony do związku sezonowego. Zebraliśmy kupę wszystkich zasobów, których będziecie potrzebować do wytwarzania nagród w nowej [b]kuźni Mroźnego Festiwalu[/b]. Kolejny krok? Właściwa część z wytwarzaniem. ",
      "Wystarczy, że spłatacie rozmaite figle w grze takie jak rzucenie wroga śnieżką przed zabiciem go, kradzież czapki czy zbicie piątaka z wrogiem, by zdobyć unikalne zasoby, którymi napędzicie swoje kuźnie i wytworzycie nowe nagrody. Każdy przedmiot wymaga innego schematu do wytworzenia go. Możecie także odblokować wyższe poziomy, kończąc najpierw nagrody pierwszego poziomu. Sezonowe koła czatu? Są. Nowy dręczyciel w kształcie dzwoneczka, który pozwala wam zagrać melodyjkę? Na pewno coś takiego jest. Pijany czarodziej ujeżdżający reniferzego kuriera w podejrzany sposób przypominającego osła? No co wy, bez tego nie byłoby świąt!",
      "[h2]Bogactwa Bohaterów (zima 2024)[/h2]",
      "Wiecie, bez czego jeszcze nie byłoby świąt? Pudła pełnego niespodzianek! Z tego powodu przedstawiamy też [b]Bogactwa Bohaterów (zima 2024)[/b], czyli zupełnie nowy skarb zawierający 17 zestawów przedmiotów dla wielu bohaterów. ",
      "Ale na tym nie koniec. Aby upewnić się, że brzegi skrzyni ze skarbami zostaną poddane prawdziwej próbie, dopakowaliśmy nieco nowych wiekopomnych przedmiotów wśród zestawów. A potem dodaliśmy trochę nowych drwin. I wilczego pupilka dla waszej ulubionej drobnej awanturniczki. A kiedy zorientowaliśmy się, że nowy zestaw dla Windranger wygląda świetnie, gdy założy się go wraz z jej arkanami, też go dodaliśmy. Ten skarb jest dostępny w sklepie Utraconej Korony, więc na poczet zakupu możecie użyć swoich żetonów.",
      "[h2]Końcoworoczna fala banów[/h2]",
      "Mikołajowy Król połamał w zeszłym roku swój młot do banów na pewnych niegrzecznych graczach, którym absolutnie należało się nim oberwać. Mijający rok upłynął mu na ciągłym przekuwaniu i wypróbowywaniu go na rozmaitych smerfach i łobuzach w grze, a teraz jest gotowy, by ponownie ochrzcić go krwią niegrzecznych.",
      "Choć zazwyczaj większość naszych banów i kar odbywa się za kulisami, to nieznaczne uchylanie rąbka tajemnicy i rozmawianie na temat toczących się prac stały się czymś w rodzaju naszej festiwalowej tradycji. A więc tak: mamy nadzieję, że w tym świątecznym okresie oczekujecie czystszych, przyjaźniejszych i sprawiedliwszych gier wolnych od [b]65 594 kont do smerfowania[/b], wobec których podjęliśmy działania w tym tygodniu. ",
      "Prócz smerfów spuściliśmy młot także na znaczącą liczbę graczy o wysokim MMR umyślnie przeszkadzających innym, graczy, którzy próbują bawić się kosztem innych, dopuszczających się nadużyć związanych z błędami, wymieniających się wygranymi i w inne sposoby podważających rywalizacyjne wyzwania będące sercem każdego meczu w Dota 2.",
      "Jak zawsze, chcielibyśmy podziękować każdej osobie, która wysłała zgłoszenie w ciągu tego roku. Wszystkie te dane pomagają nam odnaleźć graczy czyniących mecze w Dota 2 gorszymi i podjąć wobec nich działania. Dota 2 jest lepszą grą dzięki wam.",
      "[h2]Końcoworoczna wyprzedaż [/h2]",
      "Wpis na blogu przypomina strzelisty stos festiwalowych czapek w tym, że zawsze ma coś na samym dole. Tym razem to coś to nasza własna [b]zimowa wyprzedaż[/b] treści Utraconej Korony, która już się rozpoczęła i potrwa do 3 stycznia. ",
      "Odblokujcie nowe tryby fabularne ze zniżkami na Pakiety Zwiadowcy Śródbramia, Pustyń Druud oraz Lodowej Ruiny, przystrójcie swoich bohaterów w zestawy z Niebogniewia ze Skarbów Utraconej Korony I-III lub ukończcie transformacje Shen i Dragonusa dzięki arkanom dla Vengeful Spirit oraz Skywrath Mage'a. Jeśli nadal macie garść żetonów Utraconej Korony, to możecie ich użyć do zastosowania jeszcze większej zniżki na większości przedmiotów ze sklepu Utraconej Korony, nawet wtedy, gdy zostały już one objęte zniżką w ramach wyprzedaży!",
      "Wraz z powitaniem nowego roku wciąż macie czas na zagłębienie się we wszystko, co ma do zaoferowania Utracona Korona, ale saga o Niebogniewiu dobiegnie końca 15 stycznia, więc jeśli nadal macie jeszcze sporo do odkrycia ze wszystkich 4 aktów, to lepiej bierzcie się do roboty."
    ],
    "commentcount": 293,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 4692,
    "votedowncount": 368,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734651280,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4692,
  "votes_down": 368,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}