{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus è alle porte",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus è alle porte",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "È stato un anno impegnativo per Dota. Abbiamo accolto un nuovo Eroe tra le nostre fila (e uno tanto atteso ha finalmente fatto il suo debutto); abbiamo incoronato una nuova squadra di campioni del mondo al TI di Copenaghen; abbiamo rielaborato tutti gli Eroi e le Eroine dotandoli di abilità innate e faccette che hanno cambiato profondamente il gioco; e siamo persino riusciti a infilare un'epopea narrativa durata mesi e formata da quattro atti su degli uccelli parlanti.",
      "E così, mentre l'anno volge al termine, ci ritroviamo ancora una volta pervasi fino alle orecchie dallo spirito del Frostivus. E questo ha solo un significato: un sacco strapieno di regali per tutta la Comunità, da scoprire durante l'evento del [b]Frostivus[/b], da oggi al 15 gennaio. [/b]",
      "[h2]Il vero significato del Frostivus è stato rivelato (i cappelli)[/h2]",
      "“Che tipo di doni?” Ti potresti domandare con trepidante emozione. Tanto per cominciare, il tuo Eroe inizierà ogni partita con un [b]elegante cappello del Frostivus[/b] in testa, per il resto della stagione. ",
      "Sì, ma non pensare che sia una mera questione di moda. Consideralo, piuttosto, una sorta di trofeo. Perché puoi rubare i cappelli dei tuoi avversari e offrirli ai tuoi compagni con la nuova abilità [b]Spirito del Frostivus[/b]. Puoi ottenerli anche commettendo i soliti omicidi e piccoli furti: ricavandoli dai teschi delle tue vittime, dagli Oppressori o, se sai davvero cosa stai facendo, dal cranio ruvido di Roshan, dopo che gliel'hai fracassato. ",
      "Ogni nuovo cappello che prenderai sarà impilato sopra gli altri sulla tua testa, per formare una maestosa e criminale pila di cappelli che ti condurrà alla gloria. E se non ti basta, la schermata MVP post-partita ora include il numero di cappelli accumulati. Abbastanza da far tremare i tuoi avversari! ",
      "[h2]Un racconto del Frostivus[/h2]",
      "Eccoti qui con una pila di cappelli del Frostivus in testa! Sii sincero, saresti in grado di goderteli appieno senza conoscere i retroscena della loro storia? Sappiamo già cosa stai pensando. \"Sono solo cappelli colorati\". \"A chi interessa da dove provengono?\". ",
      "Ah, avresti dovuto dircelo sei mesi fa, prima che iniziassimo a scrivere la nostra epica saga di seicentomila parole \"De Cappellibus\". Si sono rifiutati tutti di leggerlo, così lo abbiamo trasformato in un libricino per bimbi di 10 pagine che si legge in un minuto. Pare che questa versione sia andata alla grande. [b]Avvia Dota e scopri di cosa si tratta[/b]! (Aneddoto del Frostivus: il tempo di lettura di questo post del blog equivale a una TRENTINA di lette del racconto!).",
      "[h2]Fucina del Frostivus[/h2]",
      "Aspetta! C'è ancora più spirito del Frostivus che aleggia nell'aria! Purtroppo i suoi elementi chimici di base si sono disintegrati e dev'essere ricostituito in un composto stagionale. Abbiamo raccolto un po' di materiale che ti servirà per creare le ricompense nella nuova [b]Fucina del Frostivus[/b]. Il passo successivo? La parte di creazione vera e propria. ",
      "Tutto ciò che devi fare è portare a termine una serie di peripezie “come lanciare una palla di neve contro un'Unità nemica prima di ucciderla”, “rubare un cappello” o “battere il cinque con un avversario”. In questo modo otterrai componenti unici per alimentare la tua fucina e per creare nuove ricompense. Ogni oggetto richiede una ricetta diversa per essere realizzato e puoi sbloccare i livelli superiori completando prima le ricompense nei livelli inferiori. Chat radiali stagionali? Ci sono! Un nuovo Oppressore a forma di campana che ti permette di suonare? Certo che ce n'è uno! Un mago ubriaco che cavalca una renna corriere dalla sospetta forma d'asino? Perché no!? Non sarebbe una festa senza di loro!",
      "[h2]Bottino degli Eroi - Inverno 2024[/h2]",
      "Sai cos'altro non poteva mancare? Una scatola piena di sorprese! Ecco perché presentiamo il [b]Bottino degli Eroi - Inverno 2024[/b], un nuovissimo tesoro con 17 set di oggetti per un'ampia gamma di Eroi. ",
      "Ma non è tutto. Rischiando di avere un bottino stracolmo, abbiamo riempito i set con altri nuovi oggetti Immortali. E aggiunto alcune nuove provocazioni. C'è anche un lupetto domestico per il nostro piccolo attaccabrighe preferito. E quando ci siamo resi conto che il nuovo set di Windranger era fantastico se equipaggiato con il suo Arcano, abbiamo incluso anche quello. Questo tesoro è disponibile nel negozio di Crownfall, quindi puoi acquistarlo con le monete di quel negozio.",
      "[h2]Ondata di ban di fine anno[/h2]",
      "L'anno scorso, Babbo Spettrale aveva distrutto il suo martello su alcuni idioti che se lo erano meritato. Ha trascorso l'anno a riforgiarlo e testarlo costantemente su vari smurf e altre canaglie dal comportamento tossico; ora è pronto a ribattezzarlo con il sangue dei cattivi.",
      "Normalmente applichiamo la maggior parte dei ban e delle penalità dietro le quinte, ma sta diventando una tradizione del Frostivus aprire il sipario e rivelare ciò che abbiamo fatto. In questa stagione natalizia, ti auguriamo di poter giocare in modo più pulito, amichevole e corretto, ben lontano dai [b]65.594 smurf[/b] contro cui abbiamo preso provvedimenti questa settimana. ",
      "Gli smurf non sono le uniche vittime del martello: esso si è abbattuto anche sugli account ad alto MMR che si dedicano a rovinare le partite, sui giocatori che si divertono a spese degli altri, che approfittano dei bug del gioco, che falsano i risultati o che vanno contro lo spirito competitivo che è alla base di ogni partita di Dota.",
      "Come sempre, vorremmo ringraziare tutti coloro che hanno inviato una segnalazione nel corso dell'anno. Tutti questi dati ci permettono d'identificare i giocatori che rovinano il divertimento di giocare a Dota e di agire di conseguenza. Dota è un gioco migliore grazie a te.",
      "[h2]Saldi di fine anno[/h2]",
      "Un post sul blog di Dota assomiglia molto a un'enorme torre di cappelli del Frostivus: c'è sempre qualcosa in fondo. Questa volta, si tratta dei [b]Saldi invernali[/b] di Dota sui contenuti di Crownfall, che dureranno fino al 3 gennaio. ",
      "Sblocca nuovi nodi narrativi con sconti sui Pacchetti \"Cancelli di mezzo\", \"Druud\" e \"Pioniere del Deserto di Ghiaccio\", addobba i tuoi Eroi con i set di Skywrath e del Tesoro di Crownfall I-III o completa le trasformazioni di Shen e Dragonus con gli Arcani di Skywrath Mage e Vengeful Spirit. (Se hai ancora un po' di monete di Crownfall, puoi usarle per ridurre ulteriormente il prezzo sulla maggior parte degli oggetti del negozio di Crownfall, anche se sono già scontati!).",
      "Hai ancora tempo per scoprire tutto ciò che Crownfall ha da offrirti mentre salutiamo l'arrivo del nuovo anno, ma la saga di Skywrath giungerà finalmente al termine il 15 gennaio, quindi se hai altri quattro atti da esplorare, dacci dentro!"
    ],
    "commentcount": 290,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 4539,
    "votedowncount": 360,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734643175,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4539,
  "votes_down": 360,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}