{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus er over os",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus er over os",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Det har været et travlt år for Dota. Vi bød velkommen til en ny helt i rækkerne (og en længe ventet helt gjorde endelig sin debut), vi kronede endnu et hold af verdensmestre i årets TI i København, vi omarbejdede alle helte med nye spilforandrende medfødte evner og facetter, og det lykkedes os endda at klemme et narrativt epos ind i fire dele over flere måneder om talende fugle.",
      "Og nu, hvor året nærmer sig sin afslutning, er vi igen ved at strømme over med Frostivus-humør. Og det betyder en sækfuld af festlige gaver til alle under [b]Frostivus-begivenheden fra nu og indtil d. 15. januar. [/b]",
      "[h2]Den sande mening med Frostivus afsløres (hatte)[/h2]",
      "“Hvilken slags gaver?” kan man festligt undre sig. Okay, for det første, så begynder din helt hver kamp i resten af sæsonen med en flot [b]Frostivus-hat[/b] på. ",
      "Men det er ikke for at se godt ud. Se det som en montre til trofæer. For du kan også stjæle hatte fra fjendtlige helte og få dem i gave af dine allierede med den nye evne [b]Frostivus-stemning[/b]. Du kan også få dem på gammeldags manér (mord og tyveri) ved at stjæle dem fra helte, du lige har dræbt, fra plageånder, eller hvis du rigtig vil vise dig, fra selveste Roshans knoglede hoved. ",
      "Alle de hatte, du får \"samlet\", kan du sætte ovenpå hinanden i et majestætisk og morderisk hattetårn af hæder. Og fordi MVP-skærmen efter kampen nu også optæller hatte, vil du have definitivt bevis for din hatteoverlegenhed i de kommende dage. ",
      "[h2]En Frostivus-historie[/h2]",
      "Så nu har du et tårn af Frostivus-hatte på hovedet. Men kan du rigtig nyde dem uden at kende den omfattende forhistorie? Svaret er, som vi har erfaret, ja. \"Det er bare farvede hatte,\" siger du. \"Hvem går op i, hvor de kommer fra?\" ",
      "Okay, det ville have været godt at vide for seks måneder siden, fordi vi skrev et legendarium på seks hundrede tusinde ord om det kaldet Hatmarillion. Men ingen ville læse det, så vi lavede en tisiders børneudgave af Hatmarillion, som tager cirka ét minut at læse, og det lod til, at alle bedre kunne lide den.[b] Start Dota og læs historien[/b]! (Frostivus-trivia: Du kan læse den TREDIVE GANGE på den tid, det tager dig at komme igennem det her lange blogindlæg!)",
      "[h2]Frostivus-smedje[/h2]",
      "Men vent! Der er mere Frostivus-stemning i luften! Desværre er den blevet brudt ned til sine kemiske komponenter og skal genopbygges til en sæsonbaseret forbindelse. Vi har samlet en bunke af de ting, du skal bruge for at smede belønninger i den nye [b]Frostivus-smedje[/b]. Det næste skridt? Selve smedningen. ",
      "Alt, du skal gøre, er at lave forskellige løjer i spillet, f.eks. “ramme en fjende med en snebold, før du dræber den”, “stjæle en hat” eller “give en fjende en highfive” for at optjene unikke forsyninger til din smedje, så du kan smede nye belønninger. Hver genstand kræver en forskellig smedeopskrift, og du kan låse op for højere niveauer ved at gennemføre belønninger i de lavere niveauer først. Sæsonbestemte chathjul? Tjek. En ny klokkeformet plageånd, som lader dig spille musik? Selvfølgelig er der sådan en. En beruset troldmand, som rider på en mistænkelig æsellignende rensdyrskurér? Jamen, det ville da ikke være en højtid uden dem!",
      "[h2]Heltenes skat vinter 2024[/h2]",
      "Ved du, hvad man heller ikke kan undvære i højtiden? En kasse fyldt med overraskelser! Vi løfter også sløret for [b]Heltenes skat vinter 2024[/b] – en hel ny skat med 17 genstandssæt til forskellige helte. ",
      "Men det er ikke alt. For at sikre, at skatten virkelig var fyldt til randen, proppede vi nogle nye udødelige genstande ned mellem sættene også. Så lagde vi nogle nye hån oveni. Og en kæledyrsulv til alles yndlingsslagssøster. Og da vi indså, at det nye Windranger-sæt så rigtig godt ud sammen med hendes Arcana, tog vi det med også. Denne skat er tilgængelig i Crownfall-butikken, så du kan bruge Crownfall-mønter til at købe den.",
      "[h2]Udelukkelsesbølge ved årets afslutning[/h2]",
      "Sidste år uddelte julemanden smæk med sin udelukkelseshammer til nogle rumper, som virkelig fortjente det. Han har brugt hele året på at smede den om og teste den på forskellige smurfer og skurke i spillet, og nu er han klar til at indvie den med de uartiges blod.",
      "Vi plejer at håndtere de fleste udelukkelser og straffe bag kulisserne, men det er blevet lidt af en Frostivus-tradition at åbne op og tale om dette løbende arbejde. Og med det håber vi, at du i den kommende højtid ser frem til nogle renere, venligere og mere retfærdige kampe uden de [b]65.594 smurfkontoer[/b], vi har skredet ind overfor i denne uge. ",
      "Foruden smurferne brugte vi også hammeren på et betydeligt antal griefere med høj MMR – spillere, som forsøger at have det sjovt på bekostning af andre, og som udnytter spilfejl, bytter sejre og på anden vis undergraver konkurrenceånden, som er kernen i enhver Dota-kamp.",
      "Som altid takker vi alle, der har indsendt en rapport i årets løb. Alle disse data hjælper os med at finde spillere, som gør kampe i Dota værre, og gør det muligt for os at skride ind. Dota er et bedre spil på grund af jer.",
      "[h2]Årsafslutningsudsalg[/h2]",
      "Et Dota-blogindlæg minder om en tårnhøj stak Frostivus-hatte: Der er altid noget i bunden. Denne gang er det Dotas helt eget [b]vinterudsalg[/b] på Crownfall-indhold, som kører nu og frem til d. 3. januar. ",
      "Lås op for nye historienoder med rabatter på stifinderpakkerne til Midport, Druud og Icewrack, pynt dine helte med sættene fra Skywrath fra Crownfall-skat I-III, eller fuldfør forvandlingen af Shen og Dragonus med Arcanaen til Vengeful Spirit og Skywrath Mage. (Hvis du stadig har en masse Crownfall-mønter, kan du bruge dem til at få endnu større rabat på de fleste genstande i Crownfall-butikken, også selvom genstandene i forvejen er sat ned som en del af udsalget!)",
      "Du kan stadig dykke ned i alt det, Crownfall har at byde på, når vi ringer det nye år ind, men sagaen om Skywrath slutter d. 15. januar, så hvis du har mere tilbage at udforske i de fire dele, er det med at komme i gang."
    ],
    "commentcount": 288,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 4428,
    "votedowncount": 353,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734639175,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4423,
  "votes_down": 353,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}