{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Het is tijd voor Frostivus",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Het is tijd voor Frostivus",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Het was me het jaartje wel voor Dota. Er kwam een nieuwe held bij (en een langverwachte held maakte eindelijk zijn debuut), we hebben bij de TI in Kopenhagen weer een team van wereldkampioenen mogen kronen, alle helden zijn bijgewerkt met nieuwe aangeboren eigenschappen en facets waardoor het spel nooit meer hetzelfde zal zijn en we hebben jullie aandacht maandenlang vast weten te houden met een episch avontuur van vier acts met pratende vogels in de hoofdrol.",
      "En nu, nu het jaar op zijn eind loopt, worden we weer overspoeld door een overweldigende behoefte aan alles wat met Frostivus te maken heeft. En dat betekent dat er voor iedereen een zak vol feestelijke cadeautjes klaarstaat tijdens de [b]Frostivus-periode die tot 15 januari duurt. [/b]",
      "[h2]De echte betekenis van Frostivus (mutsen)[/h2]",
      "\"Wat voor cadeautjes dan?\", zul je je misschien feestelijk afvragen. Nou, om te beginnen heeft je held de rest van het seizoen bij het begin van elk spel een prachtige [b]Frostivus-muts[/b] op. ",
      "Maar dat is niet om er op je kerstbest uit te zien. Zo'n muts is eerder een soort trofee. Je kunt ze namelijk ook stelen van je tegenstanders of cadeau krijgen van je bondgenoten, dankzij de nieuwe vaardigheid [b]Spirit of Frostivus[/b]. Natuurlijk kun je ze ook op de alom bekende manier (moord/ontvreemding) in je bezit krijgen en ze van de hoofden grissen van de helden die je vermoordt, van de Tormentors of als je heel goed bent, zelfs van het verweerde, dode hoofd van Roshan. ",
      "Het leukste is dat je alle mutsen over elkaar heen kunt dragen, als een soort majestueuze, moordlustige mutsenstapel der overwinning. Bovendien beschik je dankzij het mutsenoverzicht op het MVP-scherm na elk spel nu altijd over hard bewijs van je superioriteit op het gebied van mutsen. ",
      "[h2]Een Frostivus-verhaal[/h2]",
      "Oké, dus nu heb je een stapel Frostivus-mutsen op je hoofd. Maar kun je daar echt van genieten als je het eindeloze achtergrondverhaal niet kent? Het antwoord op die vraag, zo blijkt, is ja. \"Het zijn gewoon gekleurde mutsen\", zeg je misschien. \"Wat kan mij het schelen waar ze vandaan komen?\" ",
      "Het zou handig zijn als je zulke dingen de volgende keer ietsje eerder liet weten, want nu zijn we voor niets zes maanden bezig geweest met het schrijven van een legendarium van zeshonderdduizend woorden met de titel 'De Mutsmarillion'. Het zal je niet verbazen dat niemand het wilde lezen, dus nu hebben we een tien pagina's tellende kinderboekversie van De Mutsmarillion gemaakt, waar je in een minuutje doorheen bent. Dat viel beter in de smaak. [b]Start Dota nu en lees het verhaal zelf![/b] (Leuk weetje voor Frostivus-trivia: je kunt het verhaal DERTIG KEER lezen in de tijd die het kost om deze blog te lezen!)",
      "[h2]Frostivus Forge[/h2]",
      "Maar dat is nog niet alles! Er hangt nog veel meer Frostivus-vrolijkheid in de lucht! Helaas zijn al die dingen wel afgebroken en in chemische elementen gescheiden, dus je moet er zelf nog even iets feestelijks van maken. We hebben een heleboel materialen voor je verzameld om zelf beloningen te maken in het nieuwe [b]Frostivus Forge[/b]. De volgende stap? Het maken, natuurlijk. ",
      "Je hoeft alleen maar een paar koude kunstjes in het spel te klaren, zoals een held met een sneeuwbal raken voordat je hem of haar omlegt, een muts stelen of een vijand een high five geven. Je krijgt dan unieke materialen waarmee je je nieuwe beloningen kunt smeden en ontwerpen. Voor elk item heb je een uniek recept nodig en je kunt hogere levels ontgrendelen als je eerst de lagere beloningen voltooit. Seizoensgebonden chatwieluitspraken? Check. Een nieuwe Tormentor in de vorm van een klok waarmee je muziek kunt maken? Natuurlijk hebben we die ook. Een dronken tovenaar op een rendierkoerier die verdacht veel op een ezel lijkt? Ik kan me de feestdagen niet zonder voorstellen!",
      "[h2]Heroes' Hoard voor de winter van 2024[/h2]",
      "Weet je wat je ook echt niet kunt missen tijdens de feestdagen? Een kist vol verrassingen! Daarom introduceren we ook de [b]Heroes’ Hoard voor de winter van 2024[/b], een splinternieuwe schat met 17 itemsets voor een heleboel helden. ",
      "Maar er is meer. Omdat we er zeker van wilden zijn dat er geen hoekje onbenut werd gelaten, hebben we naast de sets ook nog een paar onsterfelijke items in de schat gepropt. En een paar bespottingen. En een wolf als huisdier voor onze favoriete kleine vechter. En toen we ons realiseerden dat de Windranger-set er wel heel goed uitzag in combinatie met haar Arcana, hebben we die ook toegevoegd. Deze schat is verkrijgbaar in de Crownfall-winkel en je kunt je Crownfall-munten gebruiken om ervoor te betalen.",
      "[h2]Eindejaarsvloedgolf van verbanningen[/h2]",
      "King Kringle is vorig jaar helemaal losgegaan met zijn verbanningshamer. (Maar geen zorgen, dat hadden al zijn slachtoffers helemaal verdiend!) Dit afgelopen jaar is hij bezig geweest om zijn geliefde hamer verder aan te passen en te testen op verschillende smurfen en stoute kindertjes in het spel, en nu staat hij te trappelen voor de tweede ronde.",
      "Hoewel we de meeste verbanningen en straffen achter gesloten deuren uitdelen, is het een Frostivus-traditie geworden om een tipje van de sluier op te lichten en wat meer te vertellen over onze inspanningen op dit gebied. Daarom zijn we trots om te kunnen vertellen dat we jullie deze feestdagen een eerlijkere, vriendelijkere en gelijkwaardigere spelervaring kunnen bieden, omdat we alleen al deze week tegen [b]65.594 smurfaccounts[/b] zijn opgetreden. ",
      "Naast het aanpakken van smurfen, hebben we de verbanningshamer ook van stal gehaald om een groot aantal spelverstoorders met hoge matchmakingbeoordelingen (MMR) een halt toe te roepen. Deze storende spelers doen wat ze willen ten koste van anderen, maken misbruik van bugs, maken afspraken over wie er mag winnen of ondermijnen op een andere manier het competitieve karakter dat ten grondslag ligt aan elk Dota-spel.",
      "Zoals altijd willen we iedereen bedanken die dit jaar een rapport heeft ingediend. Al deze gegevens helpen ons de spelers te identificeren die Dota negatief beïnvloeden, waarna we ze kunnen aanpakken. Dota is beter dankzij jullie.",
      "[h2]Eindejaarsuitverkoop[/h2]",
      "Een Dota-blog lijkt een beetje op een enorme toren Frostivus-mutsen: er zit namelijk altijd iets onder verborgen. Deze keer is dat onze eigen [b]Dota-winteruitverkoop[/b] op Crownfall-inhoud. De uitverkoop loopt nog tot 3 januari. ",
      "Ontgrendel allerlei nieuwe ontwikkelingen in het verhaal met korting op de Pathfinder-pakketten van Midgate, Druud en Icewrack, geef je helden een nieuwe look met de Skywrath-sets uit de Crownfall-schatten I t/m III of voltooi de transformatie van Shen en Dragonus met de Arcana's voor Vengeful Spirit en Skywrath Mage. (Als je nog een paar Crownfall-munten hebt liggen, kun je die gebruiken om nog meer korting te krijgen op de items in de Crownfall-winkel, zelfs als die items al in de aanbieding zijn vanwege de uitverkoop!)",
      "Er is ook na oud en nieuw nog genoeg tijd om alles wat Crownfall te bieden heeft te ontdekken, maar de saga van Skywrath komt op 15 januari echt ten einde, dus als je de vier acts nog niet allemaal hebt uitgespeeld, kun je maar beter opschieten."
    ],
    "commentcount": 688,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 34864,
    "votedowncount": 3982,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1738143165,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 34863,
  "votes_down": 3982,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}