{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus är här",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus är här",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Det har varit ett hektiskt år för Dota. Vi välkomnade en ny hjälte i våra led (och en efterlängtad gjorde äntligen debut). Vi krönte ytterligare ett lag till världsmästare vid årets TI i Köpenhamn. Vi omarbetade varje hjälte med nya spelförändrande medfödda förmågor och fasetter, och under flera månader lyckades vi till och med att klämma in ett narrativt epos i fyra akter om talande fåglar.",
      "Och nu när året närmar sig sitt slut är vi återigen fyllda till bredden av Frostivus-andan. Det innebär en säck full av festliga gåvor för alla under [b]Frostivus-eventet, från och med nu och fram till den 15 januari. [/b]",
      "[h2]Den sanna innebörden av Frostivus avslöjas (hattar)[/h2]",
      "”Vilken typ av gåvor?” kanske man festligt undrar. Nå, till att börja med: Under resten av säsongen kommer din hjälte att börja varje match med en snygg [b]Frostivus-hatt.[/b] ",
      "Men det är inte en modeaccessoar. Det är ett troféskåp. För du kan också stjäla hattar från fiendens hjältar och få dem som gåvor från dina allierade med den nya förmågan [b]Spirit of Frostivus[/b]. Det går också att få dem på traditionellt vis (mord/stöld), genom att stjäla dem från skallen på hjältar du just har dödat, från tormentors, eller om du verkligen vet vad du gör, till och med från Roshans skrovliga, döda huvud. ",
      "Och varenda hatt du tar kan du bära ovanpå alla andra i en majestätisk, mordisk, ärofylld hattstapel. Eftersom MVP-skärmen nu inkluderar hattantal, får du definitivt bevis på din hattöverlägsenhet under de kommande dagarna. ",
      "[h2]En Frostivus-berättelse[/h2]",
      "Så nu har du ett torn av Frostivus-hattar på huvudet. Men kan du verkligen glädja dig över dem utan att känna till den djupgående bakgrundshistorien? Svaret är tydligen ja, upptäckte vi. ”De är bara färgglada hattar”, säger du. ”Vem bryr sig om var de kom ifrån?” ",
      "Det skulle du ha nämnt för sex månader sedan, när vi skrev ett legendarium på sexhundratusen ord om det: Hattmarillion. Men det var ingen som ville läsa det, så vi skrev en tiosidig barnboksversion av Hattmarillion som tar ungefär en minut att läsa, och alla verkade gilla den bättre.[b] Starta upp Dota och ta del av historien[/b]! (Frostivus-trivia: Du skulle kunna läsa den TRETTIO GÅNGER under den tid det tar dig att ta dig igenom det här blogginlägget!)",
      "[h2]Frostivus-smedjan[/h2]",
      "Men vänta! Det finns mer Frostivus-anda i luften! Tyvärr har den brutits ned till sina kemiska komponenter och måste ombildas till en säsongsbetonad förening. Vi har samlat ihop en hög med allt material du behöver för att tillverka belöningar i den nya [b]Frostivus-smedjan[/b]. Nästa steg? Själva tillverkandet. ",
      "Allt du behöver göra för att tjäna unika material till smedjan för tillverkning av nya belöningar är att utföra olika upptåg i spelet: kasta en snöboll på en fiende innan du dödar hen, stjäl en hatt eller ge en fiende en highfive. Varje föremål kräver ett eget recept för tillverkning, och du kan låsa upp högre nivåer genom att slutföra belöningar på de lägre nivåerna först. Säsongschattljud? Japp! En ny klockformad tormentor som du kan skapa musik med? Självklart finns en sådan. En berusad trollkarl som rider på en renkurir som är misstänkt lik en åsna? Det skulle inte vara Frostivus utan dem!",
      "[h2]Vintern 2024 – Heroes' Hoard[/h2]",
      "Vet du vad mer som behövs för en riktig Frostivus? En låda full av överraskningar! Därför presenterar vi också [b]Heroes' Hord, vintern 2024[/b], en helt ny skatt med 17 föremålsset för olika hjältar. ",
      "Men det är inte allt. För att se till att skatten verkligen är fylld till bredden stoppade vi i några odödliga föremål bland seten. Sedan lade vi till några nya hån. Och en husdjursvarg till allas lilla favoritbråkstake. Och när vi insåg att det nya Windranger-setet såg bra ut när det var utrustat med hennes arcana inkluderade vi även det. Skatten finns i Crownfall-butiken, så det går bra att använda Crownfall-mynt för köpet.",
      "[h2]Avstängningsvåg vid årsslutet[/h2]",
      "Julsnubben klappade till rejält med sin avstängningshammare på några bakdelar som verkligen förtjänade det förra året. Han har ägnat året åt att omforma och testa den på olika smurfar och elakingar i spelet, och nu är han redo att döpa om den i blodet från de stygga.",
      "Vanligtvis hanterar vi avstängningar och påföljder bakom kulisserna, men det har blivit något av en Frostivus-tradition att öppna upp lite och prata om detta pågående arbete. Under de kommande högtiderna hoppas vi att du ser fram emot renare, vänligare och mer rättvisa matcher, utan de [b]65 594 smurfkonton[/b] som vi har vidtagit åtgärder mot den här veckan. ",
      "Utöver smurfarna har vi klappat till ett betydande antal griefers med hög MMR, alltså spelare som försöker roa sig på andras bekostnad genom att utnyttja buggar, förvränga resultat och på andra sätt underminera tävlingsandan som råder i varje Dota-match.",
      "Som alltid vill vi tacka alla som lämnat in en rapport under året. All den informationen hjälper oss att hitta de spelare som försämrar Dota-matcherna så att vi kan vidta åtgärder. Dota är ett bättre spel tack vare dig.",
      "[h2]Årsslutsrea[/h2]",
      "Ett Dota-blogginlägg är ungefär som en hög stapel av Frostivus-hattar: det alltid finns något i botten. Den här gången är det Dotas alldeles egna [b]vinterrea[/b] på Crownfall-innehåll, som pågår till och med den 3 januari. ",
      "Lås upp nya storynoder med rabatter på Midportens, Druuds och Icewracks vägvisarpaket, dekorera dina hjältar i seten från Skywrath som finns i Crownfall-skatterna I–III eller slutför förvandlingarna av Shen och Dragonus med arcanan för Vengeful Spirit och Skywrath Mage. (Om du fortfarande har ett gäng Crownfall-mynt kan du använda dem för ytterligare rabatt på de flesta varorna i Crownfall-butiken, även om föremålen redan är rabatterade som en del av rean!)",
      "Du hinner fortfarande dyka ned i allt som Crownfall har att erbjuda när vi ringer in det nya året, men Skywrath-sagan når sitt slut den 15 januari. Så om du har mer kvar att utforska i de fyra akterna är det bäst du sätter i gång."
    ],
    "commentcount": 292,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 4657,
    "votedowncount": 368,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734648671,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4654,
  "votes_down": 368,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}