{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Se acerca la Fiesta de la Escarcha",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Se acerca la Fiesta de la Escarcha",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Ha sido un año ajetreado para Dota. Incorporamos a un nuevo héroe a nuestras filas —y debutó otro que llevábamos esperando mucho tiempo—, coronamos a otro equipo como campeones del mundo en el TI de Copenhague, modificamos todos los héroes para que tuvieran habilidades innatas y facetas, e incluso conseguimos encajar un conjunto de narraciones épicas sobre pájaros parlanchines divididas en cuatro actos que abarcaron varios meses.",
      "Así que, con el año a punto de terminar, nos encontramos de nuevo rebosando con el espíritu de la Fiesta de la Escarcha. Esto significa que habrá un saco lleno de regalos festivos para todo el mundo mientras dure el [b]evento de la Fiesta de la Escarcha: desde ahora hasta el 15 de enero. [/b]",
      "[h2]Se revela el verdadero significado de la Fiesta de la Escarcha: sombreros[/h2]",
      "Y uno se pregunta en plan festivo... «¿Qué tipo de regalos?». Bueno, para empezar, en lo que queda de temporada, tu héroe va a iniciar cada partida con un elegante [b]sombrero de la Fiesta de la Escarcha[/b]. ",
      "Pero no lo mires como si fuera una cuestión de moda. Considéralo más bien un trofeo. Porque, con la nueva habilidad, [b]Espíritu de la Fiesta de la Escarcha[/b], también puedes quitarles sus sombreros a los héroes enemigos y regalárselos a tus aliados. Puedes conseguirlos a la antigua usanza, combinando el asesinato y el robo. Es decir, arrebatándoselos al cráneo de los héroes que mates, a los Torturadores o, si realmente sabes lo que haces, a la rugosa cabeza de Roshan tras asesinarlo. ",
      "Te puedes poner cada uno de los sombreros que consigas uno encima del otro formando una majestuosa torre sombreril. Además, considerando que la pantalla de JMV que sale después de la partida ahora incluye el cómputo de sobreros, en los próximos días, va a quedar clara tu superioridad sombrerística. ",
      "[h2]La historia detrás de la Fiesta de la Escarcha[/h2]",
      "Ahora tienes una torre de sombreros de la Fiesta de la Escarcha en la cabeza, pero ¿puedes disfrutar de ellos sin conocer realmente su historia al detalle? Tal como hemos descubierto, la respuesta es «Sí». «Son solo sombreros de colores», dices, «¿a quién le importa de dónde vienen?» ",
      "La verdad, tendrías que haber mencionado eso hace seis meses, porque durante ese tiempo hemos escrito una recopilación legendaria de seiscientas mil palabras sobre el tema llamada «El Sombrerillion». Lamentablemente, nadie quiso leerlo, así que escribimos una versión de «El Sombrerillion» en formato de libro infantil con solo diez páginas que se puede leer en un minuto y tuvo mejor acogida. ¡[b]Abre Dota y disfruta de la historia[/b] por tu cuenta! (Curiosidades sobre la Fiesta de la Escarcha: en lo que tardes en leer esta publicación te va a dar tiempo a leer la historia abreviada unas ¡TREINTA VECES!).",
      "[h2]La Forja de la Fiesta de la Escarcha[/h2]",
      "¡Un momento! ¡Hay aún más espíritu de la Fiesta de la Escarcha flotando por el aire! Por desgracia, su esencia se ha transformado en componentes químicos separados que necesitan volver a combinarse hasta formar un compuesto estacional. Hemos reunido un montón de los suministros que vas a necesitar para fabricar las recompensas en la nueva [b]Forja de la Fiesta de la Escarcha[/b]. ¿Cuál es el siguiente paso? La parte artesanal. ",
      "Todo lo que tienes que hacer para conseguir los suministros que tu forja necesita para fabricar las nuevas recompensas es hacer distintas travesuras dentro del juego, como «arrollar un enemigo como bola de nieve antes de matarlo», «robar un sombrero» o «chocar esos cinco con un enemigo». Cada artículo necesita una receta distinta para su fabricación. Puedes desbloquear los niveles superiores si completas primero las recompensas de los niveles inferiores. ¿Ruedas de chat estacionales? ¡Las tenemos! ¿Un nuevo Torturador en forma de campana que te permita tocar música? ¡Por supuesto que hay uno de esos! ¿Un mago borracho montado en un mensajero con aspecto de reno que se parece demasiado a un burro? ¿Por qué no? ¡No habría fiestas sin alguno de esos!",
      "[h2]Tesoro de héroes Invierno 2024[/h2]",
      "¿Sabes qué más hace falta para completar las fiestas? ¡Una caja llena de sorpresas! Por eso vamos a desvelar el [b]Tesoro de héroes Invierno 2024[/b], un tesoro completamente nuevo con 17 sets de artículos para un amplio número de héroes. ",
      "Pero eso no es todo. Arriesgándonos a hacer rebosar el tesoro, atiborramos sus sets con más sets nuevos de artículos inmortales. Luego añadimos unas cuantas burlas nuevas y un lobo mascota para nuestra luchadorcilla favorita. Y cuando nos dimos cuenta de que el nuevo set de Windranger lucía genial al equiparse con su Arcano, lo incluimos también. Este tesoro está disponible en la tienda de la Caída de la Corona, así que puedes comprarlo con las monedas de esa tienda.",
      "[h2]Oleada de bloqueos de fin de año[/h2]",
      "A Kringle King se le rompió el martillo de bloqueos el año pasado al machacar a algunos que se lo habían ganado. Este año se lo pasó probando y afinándolo con algunos [i]smurfs[/i] y otros tipos de enredadores dentro del juego, y ahora está listo para rebautizarlo con la sangre de los más traviesos.",
      "Normalmente aplicamos la mayoría de los bloqueos y penalizaciones entre bastidores, pero se está convirtiendo en una tradición de la Fiesta de la Escarcha esto de abrir las cortinas y desvelar lo que hemos estado haciendo. Por eso, en esta temporada festiva, esperamos que se reciba con alegría el juego limpio, más amigable y más justo que puede ocurrir sin las [b]65 594 cuentas de [i]smurfing[/i][/b] que hemos dejado fuera de combate esta semana. ",
      "Además de los casos de [i]smurfing[/i], también nos hemos encargado de una cantidad importante de jugadores que abusan de su MMR, que tratan de divertirse a costa de otros, que sacan partido de fallos, que intercambian victorias o que socavan de otras formas el desafío competitivo que es la esencia de cada partida de Dota.",
      "Como siempre, nos gustaría dar las gracias a todos los que enviaron alguna denuncia a lo largo del año. Ese tipo de datos nos ayuda a encontrar y tomar medidas contra los jugadores que empeoran las partidas de Dota. Dota es un juego mejor gracias a ti.",
      "[h2]Rebajas de fin de año[/h2]",
      "Una publicación del blog de Dota se parece mucho a una enorme torre de sombreros de la Fiesta de la Escarcha: siempre tiene algo en la parte inferior. Esta vez, ese algo es el contenido de las [b]rebajas de invierno[/b] sobre la Caída de la Corona de Dota, que van hasta el 3 de enero. ",
      "Desbloquea los nuevos nodos de la historia con descuentos en los Paquetes de Exploración del Barrio Medio, Druud y Icewrack, engalana a tus héroes con los sets de Skywrath en los tesoros de la Caída de la Corona I-III o completa la transformación de Shen y Dragonus con los Arcanos de Vengeful Spirit y Skywrath Mage. Si todavía tienes un montón de monedas de la Caída de la Corona, las puedes usar para conseguir descuentos en muchos de los artículos de la tienda de la Caída de la Corona, ¡incluso si los artículos ya tienen un descuento como parte de las rebajas!",
      "Con la llegada del nuevo año, todavía estás a tiempo para entrar a fondo en la Caída de la Corona, pero la saga de Skywrath termina el 15 de enero, así que, si te queda mucho por explorar de los cuatro actos, date prisa."
    ],
    "commentcount": 356,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 6170,
    "votedowncount": 507,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734714901,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 6170,
  "votes_down": 507,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}