{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus Zamanı Geldi Çattı",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus Zamanı Geldi Çattı",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Dota için yoğun geçen bir yılı geride bırakıyoruz. Aramıza yeni bir kahraman katıldı (ve uzun zamandır beklenen bir kahraman sonunda ilk kez sahneye çıktı). Bu yıl Kopenhag'da düzenlenen The International'da dünya şampiyonu olan bir takımı daha taçlandırdık. Her kahraman için oyunun seyrini değiştirecek yeni doğal yetenekler ve yükseltmeler ekledik. Hatta tüm bunların arasına, konuşan kuşlar içeren, dört bölümden oluşan ve aylarca süren destansı bir öykü bile sıkıştırmayı başardık.",
      "Ve böylece yıl sonuna doğru yaklaşırken bir kez daha kendimizi Frostivus ruhuyla dolup taşmış olarak buluyoruz. Bu da, [b]Frostivus etkinliği süresince, yani 15 Ocak'a kadar[/b] herkes için bir torba dolusu yılbaşı hediyesi anlamına geliyor. ",
      "[h2]Frostivus'un Gerçek Anlamı Ortaya Çıkıyor (Şapkalar)[/h2]",
      "Şen bir meraka kapılıp “Ne tür hediyeler” olduğunu sorabilirsiniz. Öncelikle şunu belirtelim: Sezonun geri kalanında kahramanınız her oyuna şık bir [b]Frostivus şapkası[/b] takarak başlayacak. ",
      "Ancak bunu sadece şık bir aksesuar olarak düşünmeyin. Bir kupa sandığı olarak düşünün. Çünkü yeni [b]Frostivus Ruhu [/b] yeteneğiyle düşman kahramanlardan şapka çalabilir ve dostlarınızdan hediye şapka alabilirsiniz. Ayrıca bunları eski usul yöntemlerle de (cinayet/hırsızlık) elde edebilirsiniz. Öldürdüğünüz kahramanların kafataslarından, İşkencecilerden ve hatta gerçekten bir ustaysanız Roshan'ın yamuk ölü kafasından bile çalabilirsiniz. ",
      "Aldığınız şapkaları üst üste takarak tüm ihtişamıyla ölümcül ve görkemli bir şapka istifi oluşturabilirsiniz. Ayrıca oyun sonu EDO ekranında şapka sayıları da yer alacağından, önümüzdeki günlerde şapka üstünlüğünüzü kesin olarak kanıtlama şansına sahip olacaksınız. ",
      "[h2]Bir Frostivus Hikayesi[/h2]",
      "Kafanıza Frostivus şapkalarından oluşan bir kule geçirdiniz diyelim. Peki bu şapkaların ayrıntılı hikayelerini bilmeden onları takmaktan gerçekten keyif alabilecek misiniz? Cevabın evet olduğunu sayenizde fark ettik. \"Renkli şapkalar işte\", \"Nereden geldikleri kimin umurunda?\" dediğinizi duyduk. ",
      "Bunu altı ay önce dile getirseydiniz harika olurdu çünkü bu konu hakkında Şapkarillion adında altı yüz bin kelimelik bir efsane yazdık. Ancak kimse okumak istemedi, bu yüzden Şapkarillion'un bir dakikada okunabilen on sayfalık bir çocuk kitabı versiyonunu yazdık ve bu versiyonu daha çok beğenildi.[b] Dota'ya girin ve hikayenin tadını çıkarın![/b] (Frostivus bilgisi: Bu blog yazısını okuyup bitireceğiniz süre içinde hikayeyi OTUZ KEZ okuyabileceksiniz!)",
      "[h2]Frostivus Atölyesi[/h2]",
      "Bitmedi! Havada daha fazla Frostivus ruhu var! Ne yazık ki kimyasal bileşenlerine ayrılmış durumda ve yeniden mevsimsel bir bileşim hâline getirilmesi gerekiyor. Yeni [b]Frostivus Atölyesi[/b]'nde ödüller üretmek için ihtiyaç duyacağınız tüm malzemeleri bir araya topladık. Bir sonraki adım mı? İşin üretme kısmı. ",
      "Yapmanız gereken tek şey, “öldürmeden önce düşmana kartopuyla vurmak”, “şapka çalmak” veya “düşmanlara beşlik çakmak” gibi çeşitli oyun içi eğlencelerine katılmak ve atölyenizi besleyerek yeni ödüller üretmenizi sağlayacak benzersiz malzemeleri kazanmaktır. Her bir öğeyi üretmek için farklı bir tarife ihtiyacınız olacak ve alt seviye ödülleri tamamlayarak daha yüksek sevileri açabilirsiniz. Mevsimsel Sohbet Çarkı mı? Var. Müzik çalmanıza izin veren, çan şeklinde yeni bir işkenceci mi? Elbette var. Şüpheli bir şekilde eşek biçiminde bir ren geyiği kuryesinin sırtında gezen sarhoş bir büyücü mü? Onlarsız bir yılbaşı düşünülemezdi ki!",
      "[h2]2024 Kış Kahraman Ganimeti Hazinesi[/h2]",
      "Başka ne olmadan yılbaşı olmaz biliyor musunuz? Sürprizlerle dolu bir kutu! Bu nedenle, çok sayıda kahraman için 17 eşya setini içeren yepyeni bir hazine olan [b]2024 Kış Kahraman Ganimeti[/b]'ni sunuyoruz. ",
      "Ama hepsi bu kadar değil. Bu hazine sandığının ağzına kadar dolu olduğundan emin olmak için setler arasında bazı yeni Ölümsüz öğeler de ekledik. Sonra birkaç alay hareketi ile süsledik. Ve herkesin en sevdiği küçük kavgacı bir kurt evcil hayvanı bekçi olarak görevlendirdik. Ve Windranger'ın yeni setinin Gizemli Eşyası ile birlikte kullanıldığında harika göründüğünü fark ettiğimizde onu da dâhil ettik. Bu hazineye Tacın Düşüşü Mağazası'ndan erişilebilir ve Tacın Düşüşü altınlarınızı kullanarak satın alabilirsiniz.",
      "[h2]Yıl Sonu Yasaklama Dalgası[/h2]",
      "Kral Kringle geçen yıl hak eden bazı aptalların üzerine yasaklama çekicini indirmişti. Tüm yıl smurf'ler ve oyun içi kötüler üzerinde test ederek daha da geliştirdiği yasaklama çekici, yaramazların kanını tatmaya yeniden hazır.",
      "Genellikle çoğu yasaklamayı ve cezaları perde arkasında yaparız ama son yıllarda Frostivus'ta perdeyi biraz aralayıp, kötü davranışlara karşı amansız mücadelenin nasıl devam ettiğini anlatmak güzel bir gelenek hâline geldi. Ve böylece yeni yılda, bu hafta temizlenen [b]65.594 smurf hesap[/b] olmadan daha temiz, daha dostane ve daha adil oyunlar görmeyi sabırsızlıkla bekliyoruz. ",
      "Smurf'lerin yanı sıra, yüksek ED'ye sahip, başkalarının oyunlarını zorlaştırmak pahasına eğlenmeye çalışan, açıkları istismar eden, zaferlerini takas eden ve her Dota oyununun kalbinde yer alan rekabetçi mücadeleyi baltalayan çok sayıda oyuncuya da çekici indirdik.",
      "Her zaman olduğu gibi bu yıl da bize raporlarını gönderen herkese teşekkür ediyoruz. Tüm bu veriler, Dota oyunlarını kötüleştiren oyuncuları bulmamıza ve harekete geçmemize yardımcı olmaktadır. Dota sizin sayenizde daha iyi bir oyun.",
      "[h2]Yıl Sonu İndirimi[/h2]",
      "Dota blogları, yüksek Frostivus şapkası istiflerine benzer. En altta her zaman bir şey vardır. Bu seferki, Dota'nın Tacın Düşüşü içerikleri için düzenlediği ve 3 Ocak'a kadar sürecek olan [b]kış indirimi[/b]. ",
      "Henüz yapmadıysanız, hikayenin gizli kısımlarını indirimli Orta Geçit, Druud ve Icewrack keşif paketleriyle ortaya çıkarın, kahramanlarınızı Tacın Düşüşü hazinelerindeki Skywrath setleriyle kuşandırın veya Shen'in ve Dragonus'un dönüşümlerini Vengeful Spirit ve Skywrath Mage Gizemli Eşyaları ile tamamlayın. (Eğer hâlâ bir miktar Tacın Düşüşü altınınız varsa bunları Tacın Düşüşü Mağazası ürünlerinin çoğunda, öğeler hâlihazırda indirimdeyse bile, daha fazla indirim yapmak için kullanabilirsiniz!)",
      "Yeni bir yıla girerken Tacın Düşüşü'nün sunduğu her şeyi incelemek için hâlâ vaktiniz var; ancak Skywrath destanı 15 Ocak'ta sona erecek. Bu yüzden keşfetmeniz gereken hikâyeler varsa bir an önce başlamanın tam zamanı."
    ],
    "commentcount": 688,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 34863,
    "votedowncount": 3982,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1738143021,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 34863,
  "votes_down": 3982,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}