{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "O Frostivus chegou",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "O Frostivus chegou",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Foi um ano animado para o Dota. Demos as boas‑vindas a um novo herói (e outro muito aguardado fez finalmente a sua estreia); coroámos outra equipa de campeões mundiais no International deste ano em Copenhaga; atualizámos todos os heróis com as novas habilidades inatas e facetas; e até arranjámos espaço para uma narrativa épica em quatro atos ao longo de vários meses, toda ela sobre pássaros falantes.",
      "E agora, com o ano a chegar ao fim, encontrámo‑nos novamente a transbordar com o espírito de Frostivus. Isto significa que temos um monte de presentes festivos para toda a gente durante o [b]evento de Frostivus, já a decorrer até ao dia 15 de janeiro. [/b]",
      "[h2]O verdadeiro significado do Frostivus (chapéus)[/h2]",
      "\"Que tipo de presentes?\", perguntas tu. Bem, para começar: durante o evento, o teu herói irá começar cada partida com um [b]chapéu de Frostivus[/b] estiloso. ",
      "Mas estes chapéus não são só para dizeres que estás na moda. São mais um mural de troféus, porque também podes roubar chapéus de heróis inimigos e dá‑los de presente aos teus aliados com a nova habilidade [b]Espírito de Frostivus[/b]. Também podes obtê‑los à maneira tradicional (homicídio/furto), ao roubá‑los dos crânios dos heróis que acabaste de matar, dos Tormentors ou, se souberes o que estás a fazer, até da cabeça dura e morta do Roshan. ",
      "Além disso, cada chapéu que adquirires pode ser colocado em cima dos outros, criando uma torre de chapéus em toda a sua glória majestosa e sangrenta. E como agora o ecrã de MVP pós‑partida também inclui uma contagem de chapéus, terás a prova definitiva da tua superioridade chapeleira nos próximos dias. ",
      "[h2]Um Conto de Frostivus[/h2]",
      "Então, agora tens uma torre de chapéus de Frostivus na tua cabeça. Mas será que vais conseguir dormir sem saber a profunda história por detrás deles? A resposta, aparentemente, é \"sim\". \"São só chapéus coloridos\", dizes tu. \"O que é que interessa de onde vieram?\" ",
      "Bem, dava jeito saber isso seis meses atrás, porque escrevemos um épico de seis mil palavras sobre o assunto, chamado \"Os Chapéusíadas\". Mas toda a gente se recusou a ler o que escrevemos, então preparámos uma versão infantil de dez páginas dos Chapéusíadas que leva cerca de um minuto a ler e parece que esta versão é mais popular. [b]Abre o Dota e lê a história[/b] já hoje! (Curiosidade de Frostivus: no tempo que demoras a ler este post, consegues ler a história TRINTA VEZES!)",
      "[h2]Fornalha de Frostivus[/h2]",
      "Mas espera! Ainda há mais espírito de Frostivus no ar! Infelizmente, foi decomposto a nível químico e os seus componentes têm de ser transformados numa substância sazonal. Já juntámos todos os mantimentos de que precisas para fabricar recompensas na nova [b]Fornalha de Frostivus[/b]. Qual é o passo seguinte? A parte em que fabricas coisas. ",
      "Só terás de realizar diversas atividades nas tuas partidas, como atingir um inimigo com uma bola de neve antes de o matares, roubar um chapéu ou fazer o \"dá cá mais cinco\" com um inimigo para obteres mantimentos exclusivos que podem ser usados na fornalha para fabricares recompensas novas. Cada item é fabricado com base numa receita diferente e tens acesso a recompensas de níveis mais altos ao fabricares recompensas dos níveis anteriores. Frases sazonais para a Chat Wheel? Temos. Um novo Tormentor em forma de sino que te permite tocar música? Claro que temos um desses. Um feiticeiro bêbado montado numa rena estranhamente semelhante a um burro? Ora, não seria um Frostivus a sério sem eles!",
      "[h2]Winter 2024 Heroes' Hoard[/h2]",
      "Sabes o que mais não poderia faltar? Uma caixa cheia de surpresas! Então também estamos a revelar o [b]Winter 2024 Heroes' Hoard[/b], um tesouro inédito com 17 conjuntos para os mais variados heróis. ",
      "Mas há mais. Para garantirmos que o tesouro estava bem empacotado, enfiámos lá dentro alguns itens Imortais novos. Depois adicionámos umas provocações novas. E um lobo‑mascote para a Marci. Depois apercebemo‑nos de que o novo conjunto da Windranger parecia fantástico em combinação com o conjunto Arcano, então também incluímos isso. Este tesouro está disponível na Loja Crownfall, então podes usar as tuas moedas do evento para obteres um desconto na compra.",
      "[h2]Onda de banimentos de fim de ano[/h2]",
      "No ano passado, o Rei Espectral baniu muita gente que merecia. Ele passou este ano a refinar e a testar a sua técnica em vários smurfs e infratores — e agora chegou a hora da verdade para os mais marotos.",
      "Apesar de costumarmos realizar a maioria dos banimentos e penalizações em segredo, já é uma tradição de Frostivus sermos um pouco mais transparentes e falar sobre este esforço contínuo. Então: nesta temporada festiva, esperamos que estejas com vontade de jogar umas partidas mais limpas, amigáveis, justas e livres das [b]65 594 contas smurf[/b] que penalizámos nesta semana. ",
      "Além dos smurfs, também tomámos medidas quanto a um número significativo de jogadores com MMR alto que perturbavam partidas — pessoas que se tentam divertir às custas dos outros, abusando de bugs, trocando vitórias e comprometendo o desafio competitivo que está no cerne de todas as partidas de Dota.",
      "Como sempre, gostaríamos de agradecer a todos os utilizadores que enviaram uma denúncia este ano. Todos estes dados ajudam‑nos a descobrir os jogadores que estão a prejudicar as partidas de Dota e permitem‑nos tomar medidas. O Dota é um jogo melhor graças a estas denúncias.",
      "[h2]Promoção de fim de ano[/h2]",
      "Um post no blog do Dota é como uma pilha de chapéus de Frostivus: há sempre alguma coisa no fundo. Desta vez, essa coisa é a [b]promoção de inverno[/b] do próprio Dota, com descontos na Loja Crownfall até 3 de janeiro. ",
      "Desbloqueia novas partes da história com descontos nos Packs do Pioneiro de Midgate, Druud e Icewrack, enfeita os teus heróis com os conjuntos de Skywrath dos Tesouros de Crownfall I-III ou completa as transformações da Shen e do Dragonus com os conjuntos Arcanos para a Vengeful Spirit e o Skywrath Mage. (Se ainda tiveres moedas da Loja Crownfall, podes usá‑las para aumentares o desconto ainda mais, mesmo em itens que já estejam com desconto como parte da promoção!)",
      "Ainda tens tempo para desfrutar de tudo o que Crownfall tem para oferecer enquanto entramos num novo ano, mas a saga de Skywrath chegará finalmente ao fim em 15 de janeiro. Por isso, se ainda tens muito que explorar nos quatro atos, é melhor começar já!"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734574491,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}