{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Πλησιάζει το Frostivus",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Πλησιάζει το Frostivus",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Ήταν γεμάτη χρονιά για το Dota. Καλωσορίσαμε έναν νέο ήρωα ενώ έκανε επιτέλους το ντεμπούτο του και ένας πολυαναμενόμενος. Στέψαμε παγκόσμια πρωταθλήτρια άλλη μία ομάδα στο φετινό The International της Κοπεγχάγης. Επανασχεδιάσαμε όλους τους ήρωες με νέες εγγενείς ικανότητες και όψεις που έδωσαν νέο αέρα στο παιχνίδι. Καταφέραμε επίσης να στριμώξουμε ένα πολύμηνο αφηγηματικό έπος τεσσάρων πράξεων που πραγματευόταν πουλιά που μιλούσαν.",
      "Έτσι λοιπόν, καθώς η χρονιά πλησιάζει στο τέλος της, οι καρδιές μας ξεχειλίζουν και πάλι από το πνεύμα του Frostivus. Με άλλα λόγια, όλοι θα πάρουν έναν σάκο με γιορτινά δώρα κατά τη διάρκεια του [b]συμβάντος Frostivus, από τώρα μέχρι τις 15 Ιανουαρίου. [/b]",
      "[h2]Αποκαλύπτουμε το πραγματικό νόημα του Frostivus (τα καπέλα)[/h2]",
      "«Τι δώρα;» μπορεί να αναρωτηθεί κανείς με χαρμόσυνη διάθεση. Λοιπόν, πρώτα απ' όλα: Για το υπόλοιπο της εορταστικής περιόδου, ο ήρωάς σας θα ξεκινά κάθε παιχνίδι φορώντας ένα στιλάτο [b]καπέλο Frostivus[/b]. ",
      "Αλλά μην θεωρήσετε ότι πρόκειται για στιλιστική επιλογή. Σκεφτείτε το σαν ράφι επίδειξης τροπαίων. Επειδή μπορείτε επίσης να κλέψετε καπέλα από εχθρικούς ήρωες και να τα λάβετε ως δώρα από τους συμμάχους σας με τη νέα ικανότητα [b]Spirit of Frostivus[/b]. Μπορείτε και να τα αποκτήσετε με τον πατροπαράδοτο τρόπο (δολοφονία/νεκροσυλία), κλέβοντάς τα από τα κρανία των ηρώων που μόλις σκοτώσατε, από Tormentor ή, αν είστε πραγματικοί δεξιοτέχνες, μέχρι και από το βλογιοκομμένο ψόφιο κεφάλι του Roshan. ",
      "Μπορείτε να βάλετε κάθε καπέλο που σουφρώνετε πάνω από όλα τα άλλα, δημιουργώντας μια μεγαλοπρεπή, δολοφονική και ένδοξη στοίβα καπέλων. Επιπλέον, με την οθόνη MVP να περιλαμβάνει πλέον καταμέτρηση καπέλων, θα έχετε αδιαμφισβήτητες αποδείξεις για την καπελο-υπεροχή σας τις επόμενες μέρες. ",
      "[h2]Μια ιστορία του Frostivus[/h2]",
      "Έχετε, λοιπόν, πλέον έναν πύργο από καπέλα Frostivus στο κεφάλι σας. Μπορείτε, όμως, να τα απολαύσετε πραγματικά χωρίς να γνωρίζετε την ιστορία τους με κάθε λεπτομέρεια; Η απάντηση, όπως διαπιστώσαμε, είναι ναι. «Είναι απλά πολύχρωμα καπέλα», λέτε. «Τι με νοιάζει από πού προέρχονται;» ",
      "Ίσως θα ήταν καλύτερα να είχατε αναφέρει ότι δεν σας νοιάζει πριν έξι μήνες, γιατί κάτσαμε και γράψαμε ολόκληρη ανθολογία θρύλων επί του θέματος, ονόματι «Καπελειάδα». Όμως δεν ήθελε κανείς να τη διαβάσει κι έτσι γράψαμε μια δεκασέλιδη παιδική εκδοχή της Καπελειάδας, της οποίας η ανάγνωση παίρνει περίπου ένα λεπτό. Άρεσε σε όλους περισσότερο. [b]Μπείτε στο Dota και απολαύστε την ιστορία[/b]! (Άχρηστη πληροφορία Frostivus: Θα μπορέσετε να τη διαβάσετε ΤΡΙΑΝΤΑ ΦΟΡΕΣ μέχρι να τελειώσετε αυτήν την ανάρτηση ιστολογίου!)",
      "[h2]Σιδηρουργείο Frostivus[/h2]",
      "Περιμένετε! Υπάρχει κι άλλο πνεύμα Frostivus στην ατμόσφαιρα! Δυστυχώς, έχει διασπαστεί στα χημικά του στοιχεία και πρέπει να ανασυσταθεί σε γιορτινή χημική ένωση. Μαζέψαμε όλα τα υλικά που θα χρειαστείτε για να κατασκευάσετε ανταμοιβές στο νέο [b]Σιδηρουργείο Frostivus[/b]. Το επόμενο βήμα; Το πρακτικό κομμάτι της κατασκευής. ",
      "Το μόνο που πρέπει να κάνετε είναι να ολοκληρώσετε μερικές καλικαντζαριές εντός παιχνιδιού, όπως «να χτυπήσετε τον εχθρό με χιονόμπαλα πριν τον σκοτώσετε», «να κλέψετε ένα καπέλο» ή «να κάνετε κόλλα πέντε με κάποιον εχθρό», για να κερδίσετε μοναδικά υλικά για το σιδηρουργείο σας και την κατασκευή νέων ανταμοιβών. Η κατασκευή κάθε αντικειμένου απαιτεί διαφορετική συνταγή και μπορείτε να ξεκλειδώσετε υψηλότερες βαθμίδες, ολοκληρώνοντας πρώτα ανταμοιβές στις χαμηλότερες βαθμίδες. Εποχιακές ροδέλες συνομιλίας; Αμέ. Νέο Tormentor σε σχήμα καμπάνας που σας επιτρέπει να παίξετε μουσική; Προφανώς και ναι. Μεθυσμένος μάγος καβάλα σε μεταφορέα τάρανδο που θυμίζει κάπως ύποπτα γαϊδούρι; Μα, δε θα ήταν γιορτές αλλιώς!",
      "[h2]Heroes' Hoard – Χειμώνας 2024[/h2]",
      "Ξέρετε πώς αλλιώς δε θα ήταν γιορτές; Χωρίς κουτί γεμάτο εκπλήξεις! Έτσι, αποκαλύπτουμε το [b]Heroes' Hoard – Χειμώνας 2024[/b], έναν ολοκαίνουριο θησαυρό με 17 σετ αντικειμένων για διάφορους ήρωες. ",
      "Έχει κι άλλο όμως. Για να σιγουρευτούμε ότι ο θησαυρός αυτός είναι γεμάτος μέχρι τα μπούνια, τον μπουκώσαμε με μερικά νέα αντικείμενα Immortal ανάμεσα στα σετ. Προσθέσαμε έπειτα μερικούς χλευασμούς. Και έναν λύκο κατοικίδιο για την αγαπημένη μας μικροκαμωμένη καβγατζού. Και όταν συνειδητοποιήσαμε ότι το νέο σετ της Windranger φαινόταν υπέροχο μαζί με το Arcana της, το συμπεριλάβαμε και αυτό. Ο θησαυρός είναι διαθέσιμος στο κατάστημα Crownfall, οπότε μπορείτε να τον αγοράσετε με τα Νομίσματα Crownfall σας.",
      "[h2]Κύμα αποκλεισμών για το τέλος του έτους[/h2]",
      "Ο King Kringle δε λυπήθηκε το σφυρί αποκλεισμών του πέρσι και το τσάκισε σε κάποια ποπουδάκια που πραγματικά το άξιζαν. Πέρασε όλη τη χρονιά σφυρηλατώντας το και δοκιμάζοντάς το σε διάφορους που έκαναν smurfing και άλλους κακούληδες μέσα στο παιχνίδι και είναι πλέον έτοιμος να το ξαναβάψει με το αίμα των άτακτων.",
      "Παρότι συνήθως επιβάλλουμε τους αποκλεισμούς και τις τιμωρίες στα παρασκήνια, έχει γίνει πλέον παράδοση του Frostivus να σηκώνουμε λιγάκι την αυλαία και να μιλάμε για τη συνεχιζόμενη δουλειά που κάνουμε. Οπότε, ελπίζουμε να ανυπομονείτε για πιο καθαρούς, φιλικούς και δίκαιους αγώνες αυτήν την εορταστική περίοδο, χωρίς τους [b]65.594 λογαριασμούς smurfing[/b] εναντίον των οποίων λάβαμε μέτρα αυτήν την εβδομάδα. ",
      "Εκτός από εκείνους που έκαναν smurfing, τιμωρήσαμε επίσης και έναν σημαντικό αριθμό παικτών υψηλής κατάταξης με ενοχλητική συμπεριφορά, παικτών που προσπαθούσαν να σπάσουν πλάκα εις βάρος άλλων, που εκμεταλλεύονταν σφάλματα, που εμπορεύονταν νίκες και που υπονόμευαν με οποιονδήποτε τρόπο την ανταγωνιστική πρόκληση που βρίσκεται στην καρδιά κάθε αγώνα Dota.",
      "Όπως πάντα, θέλουμε να ευχαριστήσουμε όλους εκείνους που υπέβαλαν αναφορές κατά τη διάρκεια της χρονιάς. Όλα αυτά τα δεδομένα μάς βοηθούν να εντοπίσουμε τους παίκτες που χαλάνε τους αγώνες του Dota και να λάβουμε τα κατάλληλα μέτρα. Το Dota είναι καλύτερο χάρη σε εσάς.",
      "[h2]Εκπτώσεις για το τέλος του έτους[/h2]",
      "Μια ανάρτηση ιστολογίου Dota μοιάζει πολύ με ψηλή στοίβα καπέλων Frostivus, με την έννοια ότι πάντα κάτι βρίσκεται κάτω κάτω. Αυτήν τη φορά, αυτό το κάτι είναι ότι το Dota έχει τις ολοδικές του [b]χειμερινές εκπτώσεις[/b] στο περιεχόμενο Crownfall από τώρα μέχρι τις 3 Ιανουαρίου. ",
      "Ξεκλειδώστε νέα σημεία στην ιστορία με εκπτώσεις στα Πακέτα Ιχνηλάτη Μεσοθυρίου, Ντρουούντ και Icewrack, εξοπλίστε τους ήρωές σας με τα σετ από τη Skywrath από τους Θησαυρούς Crownfall I-III ή ολοκληρώστε τη μεταμόρφωση της Σεν και του Ντραγκόνους με τα Arcana για τη Vengeful Spirit και τον Skywrath Mage. (Αν έχετε ακόμα αρκετά Νομίσματα Crownfall, μπορείτε να τα χρησιμοποιήσετε για να μειωθεί κι άλλο η τιμή των περισσότερων αντικειμένων στο κατάστημα Crownfall, ακόμα κι αν τα αντικείμενα έχουν ήδη μειωμένη τιμή ως μέρος των εκπτώσεων!)",
      "Έχετε ακόμα χρόνο να εξερευνήσετε όλα όσα προσφέρει το Crownfall καθώς υποδεχόμαστε τη νέα χρονιά, αλλά το έπος της Skywrath θα φτάσει στο τέλος του στις 15 Ιανουαρίου. Έτσι, αν θέλετε να δείτε κι άλλα πράγματα από τις τέσσερις πράξεις, μην το καθυστερείτε."
    ],
    "commentcount": 273,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 4069,
    "votedowncount": 326,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734631508,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4068,
  "votes_down": 326,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}