{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus bate la ușă",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus bate la ușă",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "A fost un an plin pentru Dota. Am primit cu brațele deschise un nou erou (iar unul mult așteptat și-a făcut și el apariția); am încoronat campionii de anul acesta ai campionatului TI care s-a desfășurat în Copenhaga; toți eroii au primit abilități înnăscute și fațete; am reușit să facem loc și unei epopei narative despre păsări vorbitoare, compusă din patru acte, care s-a întins pe mai multe luni.",
      "Și, pe măsură ce anul se apropie de final, inimile noastre sunt pline din nou cu spiritul de Frostivus. Asta înseamnă că avem un sac plin de cadouri festive pentru toată lumea pe durata [b]evenimentului Frostivus care se desfășoară până pe 15 ianuarie. [/b]",
      "[h2]Adevărata semnificație a spiritului de Frostivus a fost dezvăluită (pălării)[/h2]",
      "„Despre ce fel de cadouri este vorba?” te-ai putea întreba. Ei bine, să începem: pe durata evenimentului, eroii vor începe fiecare meci cu o elegantă [b]pălărie de Frostivus[/b] pe cap. ",
      "Dar nu te gândi la pălărie ca la un articol vestimentar, ci ca la un indicator al succesului tău, deoarece vei putea, de asemenea, să furi pălăriile eroilor inamici și să le dăruiești aliaților tăi cu noua abilitate [b]Spirit of Frostivus[/b]. Dacă ești mai de modă veche, le vei putea obține și dacă-ți răpui inamicii, iar apoi le furi de pe capetele acestora, sau, de ce nu, de la oprimatoare, iar dacă ești încrezător în forțele tale, chiar de la Roshan. ",
      "Iar fiecare pălărie pe care o furi o poți purta deasupra tuturor celorlalte pălării pe care le ai pentru a forma o coloană glorioasă de pălării. Iar, dacă asta nu era suficient, ecranul MVP de la finalul meciului va include acum și numărul de pălării strânse, astfel încât să-ți poți etala superioritatea în materie de pălării în perioada următoare. ",
      "[h2]O poveste de Frostivus[/h2]",
      "Deci te-ai ales cu un turn de pălării Frostivus pe cap. Dar te poți bucura într-adevăr de ele fără a cunoaște povestea completă din spatele lor? Răspunsul, după cum ai descoperit, este da. Tu spui: „Sunt doar niște pălării colorate.  Cui îi pasă de unde au mai apărut?” ",
      "Ei bine, ar fi fost ideal dacă ne-ai fi spus asta în urmă cu șase luni, înainte să începem să scriem o cronică de șase sute de mii de cuvinte intitulată Pălărimarillionul. Din păcate, cu toții au refuzat să o citească, așa că am rezumat conținutul acesteia într-o cărticică desenată de zece pagini care necesită doar un minut pentru a fi lecturată, pe care toți par să o îndrăgească mai mult. [b]Pornește Dota[/b] și delectează-te cu această lectură! (Iată o informație interesantă despre Frostivus: timpul necesar pentru lecturarea acestei postări de blog este echivalent cu timpul necesar pentru lecturarea de TREIZECI DE ORI a cărții colorate!)",
      "[h2]Fierăria Frostivus[/h2]",
      "Dar stai! O parte din spiritul de Frostivus plutește literalmente în aer! Din păcate, asta s-a întâmplat ca urmare a faptului că acesta a fost descompus în componentele sale chimice și trebuie reconstituit într-un compus sezonier. Am adunat o grămadă cu materialele de care ai nevoie pentru a crea recompense în noua [b]Fierărie Frostivus[/b]. Care-i următorul pas? Meșteșugirea în sine. ",
      "Tot ce trebuie să faci este să îndeplinești diverse sarcini în joc, precum „lovește un inamic cu un bulgăre de zăpadă înainte să-l ucizi”; „fură o pălărie” sau „bate cinci cu un inamic” pentru a obține materiale unice pe care să le folosești în fierărie pentru a crea noi recompense. Fiecare obiect necesită o rețetă diferită pentru a fi creat, iar, pentru a debloca obiectele de nivel superior, va trebui să obții mai întâi recompensele de nivel inferior. Rotițe de chat sezoniere? Bifat. Un nou oprimator în formă de clopoțel care-ți permite să cânți? Bifat și acesta. Un vrăjitor turmentat care călărește un curier ren care pare să se asemene unui măgar? Bifat, altfel ce sărbătoare ar fi fost aceasta fără ei?",
      "[h2]Winter 2024 Heroes' Hoard[/h2]",
      "Știi ce altceva nu poate lipsi de la o sărbătoare? O cutie plină de surprize! Așadar, dezvăluim și [b]Winter 2024 Heroes' Hoard[/b], o comoară nou-nouță cu 17 seturi de obiecte pentru o mulțime de eroi. ",
      "Dar asta nu-i tot. Pentru a ne asigura că această comoară este plină până la refuz, am îndesat și câteva obiecte Immortal noi printre seturi. Apoi am adăugat niște batjocori noi. Și un lup de companie pentru luptătoarea în miniatură îndrăgită de toți. Iar apoi, când ne-am dat seama că noul set al eroinei Windranger se asortează cu obiectul ei Arcana, am decis să-l includem și pe acesta. Comoara aceasta este disponibilă în magazinul Căderea Coroanei, așa că-ți poți folosi monedele evenimentului Căderea Coroanei pentru această achiziție.",
      "[h2]Un val de interdicții de final de an[/h2]",
      "King Kringle și-a stricat ciocanul anul trecut în timp ce aplica niște interdicții binemeritate. În anul ce a urmat, l-a refăurit și testat în mod constant pe diverse conturi de smurf și ticăloși din joc, iar acum e pregătit să-l boteze în sângele celor obraznici.",
      "Deși de regulă aplicăm majoritatea interdicțiilor și penalităților în liniște, a devenit un fel de tradiție de Frostivus pentru noi să dezvăluim câteva informații despre această activitate continuă. Acestea fiind spuse, în această perioadă de sărbători, sperăm că te aștepți la niște meciuri mai curate, mai prietenoase, mai corecte și lipsite de cele [b]65.594 de conturi de smurf[/b] împotriva cărora am luat măsuri în această săptămână. ",
      "Pe lângă conturile de smurf, am aplicat o lovitură de ciocan și unui număr semnificativ de conturi cu MMR mare care perturbau meciul pentru ceilalți, jucătorilor care încercau să se distreze pe seama altora, să se folosească de diverse erori pentru a obține avantaje, să facă schimburi de victorii, dar și celor care erau implicați în diverse activități menite să submineze spiritul competitiv care se află la baza fiecărui meci de Dota.",
      "Ca de obicei, le mulțumim celor care au transmis raportări de-a lungul anului. Toate acele informații ne ajută să identificăm jucătorii care strică experiența de joc pentru ceilalți și să luăm măsuri. Dota este un joc mai bun mulțumită ție.",
      "[h2]Reduceri de final de an[/h2]",
      "O postare de blog pentru Dota e ca un turn de pălării de Frostivus: există întotdeauna ceva nou de descoperit. De data asta, Dota găzduiește propriile [b]reduceri de iarnă[/b] și oferă reduceri la conținutul asociat evenimentului Căderea Coroanei până pe 3 ianuarie. ",
      "Deblochează noi noduri cu poveste cu ajutorul reducerilor aplicate pachetelor de expediție pentru Târgul de Mijloc, Druud și Ținuturile Înghețate, echipează-ți eroii cu seturile din comorile Skywrath și Crownfall I-III sau finalizează transformările pentru Shen și Dragonus cu obiectele Arcana pentru Vengeful Spirit și Skywrath Mage. (Dacă mai ai câteva monede ale evenimentului Căderea Coroanei, le poți folosi pentru a obține o reducere la majoritatea obiectelor din magazinul Căderea Coroanei, chiar dacă obiectele au primit o reducere de preț cu ocazia reducerilor de iarnă!)",
      "Încă mai ai timp să parcurgi în profunzime conținutul din Căderea Coroanei în timp ce ne pregătim de noul an, însă reține că saga din Skywrath ia sfârșit pe 15 ianuarie, așa că dacă mai ai de explorat căile cu misiuni din cele patru acte, dă-i bătaie."
    ],
    "commentcount": 292,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 4613,
    "votedowncount": 364,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734646144,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4610,
  "votes_down": 364,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}