{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Час Мороздва",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Час Мороздва",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Цей рік виявився дійсно насиченим для Dota: з’явився один новий герой (а також, нарешті, ще один довгоочікуваний); на цьогорічному TI в Копенгагені світ побачив нових чемпіонів; усі герої були перероблені й тепер мають нові вроджені здібності та грані, що суттєво змінюють гру; ми навіть спромоглися створити багатомісячну епічну сагу з чотирьох дій про птахів, що говорять.",
      "І ось тепер, коли рік добігає кінця, ми знову перейнялись духом Мороздва. А це означає, що на всіх чекають мішки, переповнені святковими подарунками — до [b]завершення цієї події (15 січня)[/b].",
      "[h2]Ось у чому справжня суть Мороздва (у капелюхах)[/h2]",
      "Якщо вас уже охопив святковий настрій і вам кортить дізнатися, що ж це за подарунки, відповідаємо: на початку кожної гри цього сезону ваш герой матиме на голові стильний [b]мороздвяний капелюх[/b]. ",
      "Однак не слід вважати ці капелюхи лише модними аксесуарами — вони також є трофеями, адже їх можна викрадати у ворожих героїв та отримувати у подарунок від союзників за допомогою [b]духу Мороздва[/b] (нова здібність). А ще ви можете отримати їх старомодним способом, викравши з довбешок героїв, яких щойно вбили, мучителів або — якщо дійсно знаєте, що робите, — навіть із потворної голови мертвого Рошана. ",
      "Кожен новий капелюх вдягатиметься поверх усіх інших, утворюючи на голові вашого героя величну вбивчу капелюхову вежу. А оскільки до післяматчевого екрана найкращих гравців було додано підрахунок капелюхів, ви матимете беззаперечний доказ своєї капелюхової переваги цього святкового сезону. ",
      "[h2]Мороздвяна історія[/h2]",
      "Отже, ви вже маєте мороздвяну капелюхову вежу на голові свого героя. Та хіба можна по-справжньому насолоджуватися цим здобутком, не знаючи його вичерпної історії? Як виявилось, можна. Люди кажуть, що це просто кольорові капелюхи. Нікому немає діла до того, звідки вони взялися. ",
      "Що ж, варто було згадати про це шість місяців тому, коли ми написали на цю тему легендаріум під назвою «Капелюхомариліон» обсягом шістсот тисяч слів. Однак усі відмовилися читати його, тож ми натомість написали десятисторінкову дитячу версію «Капелюхомариліона», яку можна прочитати за одну хвилину, і, здається, така версія сподобалася всім більше. [b]Настав час запустити Dota та прочитати цю історію[/b]! (Цікавий мороздвяний факт: поки ви дочитуєте цей допис, могли б вже ЦІЛИХ ТРИДЦЯТЬ РАЗІВ прочитати коротку версію історії про капелюхи!)",
      "[h2]Кузня Мороздва[/h2]",
      "Але стривайте! Саме повітря насичене духом Мороздва, однак він, на жаль, розклався на свої хімічні компоненти, тож ви маєте відновити його сезонну сполуку. Ми підготували для вас особливе місце, де ви матимете все необхідне для виготовлення нагород, — нова [b]кузня Мороздва[/b]. Що далі? Власне процес виготовлення нагород. ",
      "Усе, що потрібно робити, — це виконувати різноманітні веселі дії в грі, як-от кинути сніжку у ворожого героя та вбити його, вкрасти капелюх або дати п’ять ворогу. За ці дії ви отримуватимете унікальні компоненти для своєї кузні, необхідні для виготовлення нових нагород. Кожна нагорода має оригінальний рецепт, а для розблокування нагород вищого ступеня потрібно спочатку розблокувати нагороди нижчого ступеня. Чи є серед нагород сезонні колеса чату? Звісно. А новий мучитель у формі дзвіночка, з якого лунає музика? Ще б пак. І навіть п’яний чарівник верхи на кур’єрі, що підозріло нагадує північного оленя? Та що ж це за свято без нього!",
      "[h2]Скарбниця героїв (Мороздво 2024)[/h2]",
      "А знаєте, без чого ще не може бути свята? Без коробки, повної сюрпризів! Тож ми також представляємо новісіньку [b]скарбницю героїв (Мороздво 2024)[/b] із 17 наборами предметів для купи різних героїв. ",
      "Але це ще не все. А щоб скарбниці були наповнені по самі вінця, до деяких наборів ми додали кілька нових нетлінних предметів. А ще ми додали нові кепкування. І вовка — супутника для всіма улюбленої забіяки. А коли ми зрозуміли, що новий набір для Вітряної Рейнджер виглядає чудово разом з її таємним предметом, ми включили і його. Ця скарбниця доступна в крамниці Коронопаду, тож для її покупки можна використати монети Коронопаду.",
      "[h2]Хвиля блокувань наприкінці року[/h2]",
      "Минулого року Король Мороз так інтенсивно працював своїм блокувальним молотом, що той аж зламався, поки трощив усіх порушників. Протягом усього року він постійно перековував цей молот і випробовував його на різних смурф-акаунтах та негідниках, що зустрічаються в іграх Dota, і тепер Король Мороз готовий провести чергове бойове хрещення, сповнене кров'ю неслухняних.",
      "Хоча зазвичай ми здійснюємо більшість блокувань і покарань за лаштунками, невеличке підняття завіси над цією постійною роботою стало для нас чимось на зразок традиції Мороздва. Тож сподіваємось, що цього святкового сезону ваші ігри будуть чистішими, дружнішими та справедливішими, адже в них не буде [b]65 594 смурф-акаунтів[/b], проти яких ми вжили заходів цього тижня. ",
      "Під молот також потрапила значна кількість акаунтів із високим рейтингом, які належать зловмисникам, що намагаються розважатися за рахунок інших, убиваючи напарників, використовуючи вразливості, влаштовуючи підставні матчі та іншим чином підриваючи змагальний дух, який лежить в основі кожної гри в Dota.",
      "Як і завжди, ми вдячні всім, хто протягом року надсилав скарги. Завдяки отриманим від вас даним ми знаходимо гравців, які погіршують ігри, і вживаємо заходів. Dota стає кращою саме завдяки вам.",
      "[h2]Зимовий розпродаж[/h2]",
      "Цей допис дуже схожий на величезну мороздвяну капелюхову вежу — в тому сенсі, що під нею обов’язково має щось ховатися. Цього разу це не що інше, як власний [b]зимовий розпродаж[/b] у крамниці Коронопаду, який триватиме до 3 січня. ",
      "Розблокуйте нові сюжетні лінії, придбавши зі знижкою спорядження дослідника Міжбрам’я, Друуда й Льодоверті. Прикрасьте своїх героїв, відкривши скарбниці I-III Коронопаду з наборами Небогнівства. Довершіть перетворення Шен і Драґонуса за допомогою таємних предметів для Мстивої Душі та Небогнівного Мага. А якщо ви й досі маєте купу монет Коронопаду, можете використовувати їх для отримання ще більших знижок на більшість предметів у крамниці Коронопаду, навіть якщо на них уже діють знижки зимового розпродажу!",
      "У вас ще є час до Нового року на дослідження всього вмісту Коронопаду, однак не забудьте: сага Небогнівства нарешті завершиться 15 січня, тож краще не баріться, якщо все ще плануєте проходити мапи Коронопаду!"
    ],
    "commentcount": 688,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 34864,
    "votedowncount": 3982,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1738143165,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 34863,
  "votes_down": 3982,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}