{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "O Frostivus chegou",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "O Frostivus chegou",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "2024 foi um ano movimentado para o Dota. Nós recebemos um novo herói nas nossas trilhas (e outro há muito esperado também fez a sua estreia), coroamos outra equipe de campeões mundiais no TI deste ano em Copenhague, reformulamos todos os heróis com as novas habilidades nativas e facetas e ainda encontramos espaço para uma narrativa épica em quatro atos ao longo de vários meses... sobre pássaros falantes.",
      "Então, conforme o ano se aproxima do fim, estamos novamente transbordando com o espírito de Frostivus. Isso significa que todos poderão receber presentes festivos durante a [b]temporada de Frostivus, disponível até o dia 15 de janeiro[/b]. ",
      "[h2]Revelando o verdadeiro significado do Frostivus (gorros)[/h2]",
      "\"Que tipo de presentes?\" alguém pode indagar, festivamente. Bom, para começar: durante o resto da temporada, o seu herói começará cada partida com um [b]gorro de Frostivus[/b] estiloso. ",
      "Mas não pense no gorro como um acessório. Pense nele como um mural de troféus. Porque você também pode roubar gorros de heróis inimigos e presenteá-los para os seus aliados com a nova habilidade [b]Espírito de Frostivus[/b]. Você também pode obtê-los da forma tradicional (homicídio/latrocínio), roubando-os do crânio dos heróis que você acabou de matar, das Tormentas ou, se souber o que está fazendo, da cabeça dura e morta de Roshan. ",
      "E cada gorro que você pegar pode ser empilhado em cima dos outros, em toda a sua majestosa e sangrenta glória. Também adicionamos uma contagem de gorros à tela de destaque pós-partida, para que tenha a prova definitiva da sua superioridade nos dias vindouros. ",
      "[h2]Um Conto de Frostivus[/h2]",
      "Você tem uma pilha de gorros de Frostivus na sua cabeça. Mas é possível desfrutá-los ao máximo sem conhecer a profunda história por trás deles? A resposta, conforme descobrimos, é \"sim\". \"Eles são apenas gorros coloridos\", você pensa. \"Quem se importa de onde eles vieram?\" ",
      "Bom, seis meses atrás seria um bom momento para mencionar isso — porque já traduzimos um legendário com um milhão de palavras sobre eles, chamado O Gorrorillion. Mas todo mundo se recusou a ler, então preparamos uma versão infantil em dez páginas d'O Gorrorillion que leva mais ou menos um minuto para ser lida, e ela foi bem melhor recebida. [b]Abra o Dota e aproveite a história[/b] hoje mesmo! (Curiosidade de Frostivus: você pode ler o conto TRINTA VEZES no tempo que levará para ler esta publicação!)",
      "[h2]Forja de Frostivus[/h2]",
      "Mas espere aí! Ainda há mais espírito de Frostivus no ar! Infelizmente, ele foi fragmentado a nível químico e os seus componentes precisam ser reconstituídos em um composto sazonal. Nós já rastreamos todos os suprimentos que você precisará para fabricar recompensas na nova [b]Forja de Frostivus[/b]. O próximo passo? A tal da fabricação. ",
      "Você só precisará fazer uma variedade de travessuras dentro das partidas, como \"atingir um inimigo com uma bola de neve antes de matá-lo\", \"roubar um gorro\" ou \"fazer um 'toca aqui!' com inimigos\" para obter suprimentos distintos que podem ser usados na forja para fabricar novas recompensas. Cada item é fabricado seguindo uma receita diferente, e você pode destravar níveis mais altos ao fabricar as recompensas dos níveis anteriores. Mensagens sonoras sazonais? Temos. Uma nova Tormenta em forma de sino que pode ser usada para tocar música? Claro que temos. Um feiticeiro bêbado montado em uma rena entregadora misteriosamente semelhante a um burrinho? Bom, não seria um Frostivus sem eles!",
      "[h2]Tesouro Heroico do Frostivus 2024[/h2]",
      "Sabe o que também não poderia faltar? Uma caixa repleta de surpresas! Então, também estamos revelando o [b]Tesouro Heroico do Frostivus 2024[/b], apresentando 17 conjuntos de itens para alguns heróis. ",
      "Mas isso não é tudo. Para garantir a festividade do tesouro, colocamos alguns novos itens Imortais dentre os conjuntos. Depois, adicionamos algumas provocações novas. Além de um lobo mascote para a lutadorazinha favorita de todos. Aí percebemos que o novo conjunto da Windranger ficava ótimo quando combinado com o Arcano dela, então o enfiamos no tesouro também. Esse tesouro está disponível na loja da Queda Coronal, então você pode usar as suas moedas do evento para obter um desconto na compra.",
      "[h2]Onda de banimento de fim de ano[/h2]",
      "O Papai Cruel desceu o martelo do banimento contra alguns indivíduos levados no ano passado. Ele passou o ano em um constante processo de reforja e testes em vários [i]smurfs[/i] e malfeitores, e agora está pronto para rebatizá-lo com o sangue dos infratores.",
      "Embora nós costumemos realizar a maioria dos banimentos e penalizações por trás dos panos, virou um tipo de tradição de Frostivus levantar um pouco das cortinas e conversar sobre esse trabalho contínuo. Sendo assim: nesta temporada festiva, esperamos que você esteja a fim de partidas mais limpas, amigáveis, justas e livres das [b]65.594 contas [i]smurfs[/i][/b] que penalizamos nesta semana. ",
      "Além deles, também usamos o martelo contra uma grande quantidade de jogadores com alto MMR que atrapalhavam partidas — pessoas que tentam se divertir às custas dos outros, abusando de brechas, trocando vitórias e comprometendo o desafio competitivo onde reside o coração de cada partida de Dota.",
      "Como sempre, gostaríamos de agradecer a todos que enviaram uma denúncia ao longo do ano. Todos esses dados nos ajudam a encontrar os jogadores que estão prejudicando as partidas de Dota, e agir contra eles. O Dota é um jogo melhor por sua causa.",
      "[h2]Promoção de fim de ano[/h2]",
      "Uma publicação no blog do Dota é como uma pilha de gorros de Frostivus: sempre há algo lá embaixo. Desta vez, esse algo é a [b]promoção de fim de ano[/b] do próprio Dota, com descontos na loja da Queda Coronal até o dia 3 de janeiro. ",
      "Destrave novos caminhos da história com descontos nos pacotes de exploração do Tronco Velho, Druud e Geleiras Devastadas, vista os seus heróis com os conjuntos de Celestifúria contidos nos tesouros I, II e III da Queda Coronal ou complete as transformações de Shen e Dragonus com os Arcanos para a Vengeful Spirit e o Skywrath Mage. (Se você ainda tem moedas da Queda Coronal, pode usá-las para aumentar o desconto ainda mais, mesmo em itens que já estejam em promoção!)",
      "Você ainda tem tempo para curtir tudo o que a Queda Coronal tem a oferecer enquanto adentramos um novo ano, mas a saga de Celestifúria finalmente chegará ao fim no dia 15 de janeiro, então se você ainda não concluiu a exploração dos quatro atos, é melhor correr."
    ],
    "commentcount": 688,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 34863,
    "votedowncount": 3982,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1738143021,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 34863,
  "votes_down": 3982,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}