{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Холодрыжество к нам приходит",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Холодрыжество к нам приходит",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Этот год для Доты выдался крайне насыщенным. Мы поприветствовали совершенно нового героя и наконец встретили давно ожидаемого; узрели ещё одно заслуженное чемпионство на The International в Копенгагене; изменили абсолютно всех героев врождёнными способностями и аспектами; вдобавок ко всему, мы умудрились даже выпустить многомесячный нарративный эпик про говорящих птиц в четырёх актах.",
      "А к концу года мы обнаружили, что наши сердца и души заполнило духом Холодрыжества. И это значит, что на протяжении Холодрыжества [b](то есть до 15 января) [/b]всем положен мешок с праздничными подарками!",
      "[h2]Найден истинный смысл Холодрыжества (это шапки)[/h2]",
      "«И какие нас ждут подарки?» — радостно спросите вы. А вот такие! Начнём с того, что до конца сезона ваш герой будет начинать каждую игру в стильной [b]холодрыжеской шапочке.[/b] ",
      "Но не стоит воспринимать её как модный аксессуар. Считайте её показателем своего успеха, ведь сезонные шапочки можно воровать у врагов и дарить их союзникам при помощи новой способности [b]«Дух Холодрыжества»![/b] Также вы можете зарабатывать эти шапки проверенным временем методом — убийством. Так вы можете принарядиться со свежего черепа только что убитого врага, Терзателя или даже Рошана — если вы по-настоящему уверены в своих силах. ",
      "Каждая новая шапочка надевается поверх старой, позволяя вам построить великолепную убийственную башню тщеславия. Кстати говоря, мы добавили счётчик шапок на послеигровой экран лучших игроков, так что теперь у вас всегда будет железобетонное доказательство вашего шапочного превосходства. ",
      "[h2]Холодрыжеская история[/h2]",
      "Итак, вы выстроили на своей голове башню из холодрыжеских шапок. Но получите ли вы от неё истинное наслаждение, не зная ИСТОРИЮ этих шапок? Как мы выяснили, на самом деле да. «Это ведь просто разноцветные шапки. Какая нам разница, откуда они взялись?» — скажете вы. ",
      "Что ж, вам стоило сказать это нам шесть месяцев назад, когда мы приступили к работе над легендариуме о шапках размером в шестьсот тысяч слов, который мы назвали Шапкориллионом. Увы, все отказались его читать, так что мы вынужденно написали детскую десятистраничную версию Шапкориллиона, которая читается за минуту, и она понравилась публике гораздо больше. [b]Запускайте Доту и ознакомьтесь с ней[/b] сами! (Забавный холодрыжеский факт: за то время, что вы читаете этот пост, вы могли бы прочесть упомянутую сказку целых ТРИДЦАТЬ РАЗ!)",
      "[h2]Кузница Холодрыжества[/h2]",
      "Погодите-ка! В воздухе всё ещё витает дух Холодрыжества! К сожалению, он распался на различные химические составляющие, которые нужно вновь собрать воедино. И у нас как раз подготовлена новая площадка, где вы найдёте всё для этого необходимое, — [b]Кузница Холодрыжества[/b]. Что требуется от вас? Создавать награды, конечно. ",
      "Вам нужно будет совершать в игре различные праздничные действия — например, кинуть во врага снежок перед тем, как убить его. Или украсть его шапочку. Или дать ему пять. Всё это принесёт вам ингредиенты для создания новых наград. Они отличаются по количеству нужных ресурсов, и самые ценные предметы требуют сперва получить несколько диковинок попроще, но среди наград есть из чего выбрать. Сезонные звуки для колеса чата? Есть. Терзатель в форме рождественского колокольчика, играющего музыку? Конечно же есть. Пьяный курьер-волшебник, скачущий верхом на подозрительно напоминающем осла олене? Да без него ни один праздник не обходится!",
      "[h2]Сокровищница Heroes' Hoard[/h2]",
      "А знаете, без чего ещё не обходится ни один праздник? Без коробок с сюрпризами! Раз такое дело, то мы представляем вам сокровищницу [b]Winter 2024 Heroes' Hoard[/b], которая содержит 17 новых наборов предметов для самых разных героев. ",
      "Но это ещё не всё. Чтобы сокровищница точно была полна до краёв, мы добавили к наборам новые Immortal-предметы. И новые насмешки. И питомца-волчонка для любимой всеми нами миниатюрной драчуньи. А когда мы поняли, как хорошо набор для Windranger смотрится с Arcana-предметом, то добавили и его. Кроме того, комплект таких сокровищниц доступен в магазине «Павшей короны», а значит, на него действует скидка от монет события.",
      "[h2]Предновогодняя волна блокировок[/h2]",
      "В прошлые праздники Скелет Мороз чуть не сломал свой бан-молот, пока блокировал нарушителей. Целый год после этого дух Холодрыжества закалял своё орудие, время от времени испытывая его на смурфах и других негодяях, и вот бан-молот вновь готов вкусить крови тех, кто плохо себя вёл.",
      "Обычно мы занимаемся блокировками и наказаниями втайне от всех, однако холодрыжеская волна банов стала своего рода новогодней традицией. А посему это праздничное время начнётся для всех нас с более честных, дружелюбных и интересных игр, в которых вам точно не попадутся [b]65 594 смурф-аккаунта[/b], заблокированных на этой неделе. ",
      "Также молотом досталось и внушительному числу игроков с высоким рейтингом, которые ради него были готовы унижать других, чрезмерно использовать баги, участвовать в подставных матчах или как-нибудь иначе бить в самое сердце Доты и её соревновательного духа.",
      "Как и всегда, мы хотим поблагодарить каждого, кто отправил хотя бы одну жалобу за этот год. Каждая крупица информации помогает нам определять тех, кто только портит игру, и принимать против них меры. Все вы помогаете сделать Доту лучше.",
      "[h2]Предновогодняя распродажа[/h2]",
      "Пост в блоге Доты — один в один как башня холодрыжеских шапок: внизу всегда что-то есть. На этот раз внизу оказалась [b]специальная распродажа[/b] в магазине «Павшей короны», которая продлится до 3 января. ",
      "Комплекты исследователя Межпутья, Друуда и Айсрека откроют вам новые пути, сокровищницы события помогут вам приодеть героев в наряды из Скайраса, а с Arcana-предметами для Шенделезары и Драгонуса вы сможете завершить их преображение. А если у вас остался запас монет для магазина «Павшей короны», вы сможете воспользоваться им, чтобы ещё сильнее увеличить скидки на эти предметы.",
      "И не забывайте: 15 января сага «Павшей короны» подойдёт к концу, так что поторопитесь ей насладиться, если вы ещё не исследовали всё, что могли!"
    ],
    "commentcount": 202,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 2191,
    "votedowncount": 184,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734605064,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2191,
  "votes_down": 184,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}