{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus 2024 je tady",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus 2024 je tady",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Dota 2 má za sebou rušný rok. Přivítali jsme zbrusu nového hrdinu (a jeden dlouho očekávaný se konečně dostavil na scénu), v Kodani jsme na šampionátu The International korunovali letošní vítěze, všichni hrdinové dostali vrozené schopnosti a speciality a do toho všeho jsme ještě zvládli vecpat čtyři akty epické ságy o mluvících ptácích.",
      "Není tedy divu, že jak se teď rok chýlí ke konci, překypujeme dobrou náladou, kterou (jak je zvykem) v rámci události Frostivus přetavíme v dárky pro všechny hráče. [b]Ale jen do 15. ledna! [/b]",
      "[h2]Kouzlo Frostivusu tkví v čepicích[/h2]",
      "Jaké dárky, ptáte se, taktéž už naladěni na sváteční vlnu? Tak pro začátek platí, že po celou dobu trvání Frostivusu budou hrdinové do zápasů vstupovat s [b]fešnou čepicí[/b] na kebuli. ",
      "Svoji čepici ale neberte jako módní doplněk. Vhodnější bude o ní smýšlet jako o poličce trofejí, jelikož prostřednictvím nové schopnosti [b]Spirit of Frostivus[/b] můžete krást čepice nepřátelským hrdinům, nebo je naopak darovat svým spojencům. Staromódnější z Vás však uklidníme, že vraždění funguje také – čepici můžete sebrat z mrtvoly nepřátelského hrdiny, od padlého Tormentora a případně od dočasně mrtvého Roshana (ten se jí ale nevzdá bez boje). ",
      "Co víc, každá čepice, kterou seberete, bude přidána na tu předchozí a Vám na hlavě postupně vznikne věž krvavě nabytých čepic, o jejíž výšce (a celkovém počtu ukradených čepic) se bude možná zmiňovat i obrazovka s nejlepšími hráči zápasu! ",
      "[h2]Příběh Frostivusu[/h2]",
      "Věž čepic už tedy máte na hlavě, ale můžete si je skutečně užít, aniž byste znali jejich vyčerpávající příběh? Odpověď, jak jsme zjistili, zní ano. „Jsou to přece jen barevné čepice,“ podotýkáte. „Koho zajímá jejich příběh?“ ",
      "Mno, to jste nám taky mohli říct před půl rokem, protože v té době jsme o čepicích začali psát šest set tisíc slov dlouhou kroniku s pracovním názvem „Čepicmarillion“. Dokončena byla minulý týden, ale v kanceláři jsme nenašli nikoho, kdo by ji přelouskal, a tak vznikla desetistránková dětská verze, kterou prolétnete za minutku, i když Vás čepice vůbec netankují. [b]Vždyť zapněte hru a přesvědčte se sami![/b] Mimochodem, tu zkrácenou verzi příběhu zvládnete přečíst TŘICETKRÁT rychleji než tento příspěvek.",
      "[h2]Sváteční dílna[/h2]",
      "To ale není vše! Ve vzduchu je mnohem víc sváteční nálady! Bohužel se nějakým kouzlem rozdělila na chemické prvky, které je nutné poskládat zpět dohromady. Recepty jsme vyhrabali, nicméně samotné sbírání prvků a [b]vytváření odměn[/b] zůstane na Vás. Jak na to? Jednoduše při zápasech ",
      "provádějte různé, předem dané úkoly, mezi nimiž nechybí hození sněhové koule na nepřítele a jeho následné zabití, krádež čepice nebo třeba plácnutí si se soupeřem. Za tohle získáte prvky, a ty v dílně proměníte na odměny putující přímo do Vašeho inventáře. Dodáváme, že každá odměna má jiný recept a recepty vyšších úrovní musíte nejprve odemknout používáním receptů nižší úrovně, ale odměnou Vám budou vskutku unikátní... odměny. Je libo sezónní zvuky chatovacího kolečka? Tormentor vypadající a znějící jako rolnička? Kurýr v podobě opilého čaroděje jedoucího na sobovi nápadně připomínajícím oslíka? Jak říkáme, unikátní! A sváteční k tomu!",
      "[h2]Truhla Heroes' Hoard[/h2]",
      "Samozřejmě by to však nebyl Frostivus ještě bez jedné věci. Bez truhly plné překvapení! Proto jsme dnes do hry ostatně přidali truhlu Heroes' Hoard (Frostivus 2024) ukrývající 17 setů předmětů! ",
      "Ne že bychom chtěli kazit ono překvapení, ale tahle truhla je vážně narvaná obsahem a mezi sety se proplížily nové Immortal předměty, pár nových tauntů, vlčí pet pro všemi oblíbenou bojovnici a Arcana předmět pro Windranger. Tak moment, cože? Inu, když jsme viděli, jak nový set s Arcanou skvěle ladí, dali jsme je dohromady! Jo a truhla samotná je dostupná v obchodu moci, takže pokud máte nějaké mince navíc, můžete si zajistit slevičku.",
      "[h2]Vánoční vlna banů[/h2]",
      "Zimní král (i s naší pomocí) loni banoval zlobivé hráče tak usilovně, až se mu z toho rozbilo kladivo. Celý letošek tedy strávil jeho opravováním, a dnes nám s velkou radostí oznámil, že je připraven na další kolo krveprolití.",
      "Ano, obvykle bany a penalizace řešíme za oponou, ale v posledních letech se stalo milou tradicí tuto oponu vždy na Vánoce trochu poodhrnout a říct Vám, jak neutuchající boj se zlotřilými živly pokračuje. Takže: pokud si letošní svátky budete chtít zpříjemnit Dotou, vzhledem k nedávnému zabanování 65 594 smurfů byste měli zažít přátelštější a férovější zápasy. ",
      "Kromě smurfů jsme kladivem přetáhli také značné množství zlomyslných hráčů ve vyšších sférách hodnocení a hráčů, kteří se baví na úkor druhých, zneužívají chyby, domlouvají výhry a všelijak jinak podrývají férovost v srdci naší oblíbené hry.",
      "Závěrem nám dovolte vyřídit od Zimního krále poděkování všem, kdo v průběhu roku někoho nahlásili – Vaše data nám pomáhají identifikovat nevhodné chování a bez přehánění by se dalo říct, že Dota je čím dál tím lepší díky Vám!",
      "[h2]Výprodej ke konci roku[/h2]",
      "Víte, příspěvek na blogu je svým způsobem jako věž čepic. Vždy totiž musí mít něco naspodu. A tentokrát jsou to informace o [b]výprodeji[/b] obsahu spojeného s Pádem moci, který probíhá ode dneška do 3. ledna příštího roku. ",
      "Takže pokud jste tak ještě neučinili, prozkoumejte skrytá zákoutí Kmene, Druudu a Pomrzlých plání se zlevněnými výbavami pro objevitele, navlečte své hrdiny do tematických setů z truhel Pádu moci nebo dokončete přerod Shen a Dragona s pomocí Arcana předmětů. A to nejlepší? Dokonce i na zlevněné předměty můžete použít slevu od mincí moci!",
      "Možná už naposledy připomínáme, že Pád moci zůstane aktivní do 15. ledna – využijte příležitost dokončit zbývající úkoly a posbírat odměny všech čtyř aktů!"
    ],
    "commentcount": 293,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 19,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 4692,
    "votedowncount": 368,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734651280,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4692,
  "votes_down": 368,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}