{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus on taas, Frostivus on taas",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus on taas, Frostivus on taas",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Dotalla on ollut kiireinen vuosi. Uusi sankari saapui, toinen sai kauan odotetun debyyttinsä. Uusi tiimi kruunattiin vuoden 2024 TI-voittajaksi Kööpenhaminassa. Kaikki sankarit saivat päivityksiä mahtavien lisäkykyjen ja kulmakivien muodossa. Julkaistiin myös puhuviin lintuihin keskittyvä eeppinen neliosainen saaga.",
      "Vuoden lähestyessä loppuaan lämmin Frostivuksen henki täyttää kaikkien sydämet. Se tarkoittaa säkin täydeltä lahjoja kaikille koko [b]Frostivus-tapahtuman ajan 15.1. saakka. [/b]",
      "[h2]Frostivuksen perimmäinen tarkoitus (hatut)[/h2]",
      "Millaisia lahjoja säkissä on? Ensinnäkin, loppukauden ajan sankarit aloittavat pelin päässään tyylikäs [b]Frostivus-hattu.[/b] ",
      "Mutta kyse ei olekaan muotioikusta. Hattu on ennemminkin pokaalivitriini. Niitä voi nimittäin varastaa vihollissankareilta ja saada lahjoina liittolaisilta uuden [b]Frostivuksen henki[/b] -kyvyn avulla. Niitä voi hankkia myös vanhanaikaisella tavalla eli varastamalla tapettujen sankareiden päästä tai Piinaajalta. Jos todella osaa asiansa, voi napata sellaisen jopa Roshanin jäyheästä, suomuisesta päästä. ",
      "Hattuja voi pinota päällekkäin upeaksi, majesteettiseksi vallan symboliksi. Sen lisäksi pelin jälkeinen Tähtipelaaja-näyttö sisältää hattutilaston, jolla omaa hattukokoelmaa voi mainostaa muille. ",
      "[h2]Frostivus-tarina[/h2]",
      "Päässä on juhlallinen pino Frostivus-hattuja. Olisi kiinnostavaa tietää, millainen tarina niiden taakse kätkeytyy. Mutta onko sillä väliä? Hattu vain päähän ja menoksi!  ",
      "Kuusi kuukautta sitten kirjoitettiin kuudensadan tuhannen sanan tarina, jonka nimi oli Hattukauppias. Kukaan ei halunnut lukea sitä, joten siitä tehtiin lyhyt lastenkirjaversio, jonka lukeminen kestää noin minuutin. [b]Käynnistä Dota ja lue se itse[/b]! (Frostivus-trivia: pystyt lukemaan sen kolmekymmentä kertaa ajassa, joka kuluu tämän blogin lukemiseen.)",
      "[h2]Frostivus-paja[/h2]",
      "Ai niin! Ilmassa on vieläkin enemmän Frostivuksen henkeä. Valitettavasti sen atomit ovat joutuneet erilleen, ja ne pitää sekoittaa uudelleen kauteen sopivaksi yhdistelmäksi. Kasa palkintojen valmistamiseen tarvittavia aineksia on kerätty uuteen [b]Frostivus-pajaan[/b]. Mitä niillä tehdään? Niistä kootaan palkintoja. ",
      "Sinun tarvitsee vain suorittaa erilaisia pelinsisäisiä tehtäviä, esimerkiksi heittää vihollista lumipallolla ennen tappamista, varastaa hattu tai antaa viholliselle ylävitonen ansaitaksesi ainutlaatuisia aineksia, joiden avulla luodaan uusia palkintoja Frostivus-pajassa. Jokaisella palkinnolla on erilainen resepti, ja korkeamman tason palkintoja avataan suorittamalla ensin alempien tasojen tehtäviä. Kausittaisia chatrullia? Niitä löytyy. Uusi kellon muotoinen piinaaja, jonka avulla voit soittaa musiikkia? Tietenkin. Päihtynyt velho, joka ratsastaa epäilyttävästi aasia muistuttavalla porokuriirilla? Eihän ilman sellaista voisi olla juhlan tuntua.",
      "[h2]Talven 2024 sotasaalis[/h2]",
      "Mitä muuta tarvitaan perinteiseen Frostivukseen? Laatikko täynnä yllätyksiä! On tullut aika paljastaa [b]Talven 2024 sotasaalis[/b], täysin uusi aarre, joka sisältää 17 esinekokoelmaa eri sankareille. ",
      "Eikä siinä kaikki. Sotasaaliin perinpohjaisen testaamisen varmistamiseksi lisättiin myös uusia kuolemattomia esineitä. Ja uusia pilkkoja. Lisäksi mukaan sujautettiin etenkin pienimmille sotureille mieluinen lemmikkisusi. Lopuksi lisättiin vielä Windrangerille salatieteellinen esine, koska hänen uusi sarjansa oli niin näyttävä. Aarre on saatavilla Kruununkaappaus-kaupasta, joten sen voi ostaa Kruununkaappauskolikoilla.",
      "[h2]Loppuvuoden pelikiellot[/h2]",
      "Juhlakunkku rikkoi pelikieltovasaransa viime vuonna joidenkin erityisen kovapäisten tyyppien vuoksi. Hän käytti koko vuoden jatkuvasti uudistamalla ja testaamalla vasaraa erilaisilla smurffeilla ja pelinsisäisillä pahiksilla, ja nyt se on valmis kolahtamaan uudelleen.",
      "Vaikka yleensä suurin osa pelikielloista ja seuraamuksista tapahtuu kulissien takana, on tullut jossain määrin Frostivus-perinteeksi raottaa verhoa hieman. Tänä jouluna voit toivottavasti odottaa puhtaampia, ystävällisempiä ja oikeudenmukaisempia pelejä ilman [b]65 594 smurffitiliä[/b], joita vastaan on ryhdytty toimiin tällä viikolla. ",
      "Smurffien lisäksi vasara on iskenyt myös useisiin korkeasti rankattuihin pelaajiin, jotka yrittävät pitää hauskaa muiden kustannuksella, hyödyntävät bugeja, käyvät kauppaa voitoilla ja muutoin häiriköivät reilua ja hauskaa pelaamista.",
      "Kiitos kaikille, jotka ilmoittivat pahistileistä vuoden aikana. Nämä tiedot auttavat löytämään pelaajat, jotka tekevät Dota-peleistä huonompia. Dota on parempi sen ansiosta.",
      "[h2]Loppuvuoden ale[/h2]",
      "Dota-blogikirjoitus on kuin kasvava pino Frostivus-hattuja siinä mielessä, että sen alla on aina jotain oleellista. Tällä kertaa se on Dotan oma Kruununkaappaus-sisällön [b]talviale[/b], joka päättyy 3.1. ",
      "Avaa uusia tarinapolkuja alennuksilla Keskitullin, Druudin ja Jääraunioiden tienraivaajapaketeista, nappaa Taivaanlinnan sankarisi Kruununkaappaus-aarteista I–III tai koe Shenin ja Dragonuksen muodonmuutokset Vengeful Spiritin ja Skywrack Magen salatieteellisillä esineillä. (Jos sinulla on vielä Kruununkaappauskolikoita, voit käyttää niitä alennuksiin useimmista Kruununkaappauksen kaupan tuotteista, myös jo alennetuista!)",
      "Vielä on aikaa pelata Kruununkaappausta, mutta ei loputtomiin, sillä tarina päättyy 15.1. Loppusuora häämöttää!"
    ],
    "commentcount": 285,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 4343,
    "votedowncount": 351,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734636863,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4328,
  "votes_down": 350,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}