{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus đã gõ cửa",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus đã gõ cửa",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Đây quả là một năm Dota bận rộn. Chúng ta chào mừng một tướng mới vào đội hình (và một tướng khác nữa cũng có màn ra mắt được mong chờ từ lâu); một đội vô địch thế giới mới cũng đăng quang TI tại Copenhagen năm nay; mỗi tướng đều được làm lại với kỹ năng bẩm sinh và khía cạnh thay đổi lối chơi; và chúng ta thậm chí còn dồn dập trải nghiệm bốn hồi truyện hoành tráng kéo dài trong nhiều tháng về loài chim biết nói.",
      "Và vì thế, khi năm sắp tàn, chúng ta lại thấy mình một lần nữa ngập tràn tinh thần Frostivus. Nghĩa là, một túi đầy quà tặng lễ hội cho tất cả mọi người trong thời gian diễn ra [b]sự kiện Frostivus, từ giờ đến 15/01[/b]. ",
      "[h2]Tiết lộ ý nghĩa thực sự của Frostivus (Nón)[/h2]",
      "“Loại quà gì đây?” một người đầy nhiệt huyết lễ hội hỏi. Chà, xin được mở lời: Cho đến hết mùa này, tướng của bạn sẽ bắt đầu mỗi trận đấu đội một [b]nón Frostivus[/b] sành điệu. ",
      "Nhưng chớ nghĩ đây chỉ là thời trang đơn thuần. Hãy nghĩ đó là một tủ đựng cúp. Vì bạn cũng có thể cuỗm nón từ tướng địch và nhận nón quà tặng từ đồng minh với kỹ năng mới [b]Spirit of Frostivus[/b]. Bạn cũng có thể nhận nón theo cách truyền thống (đồ sát/đạo tặc), bằng cách thửa từ hộp sọ của tướng mà bạn vừa cho lên dĩa, từ Khổ Hình, hay thậm chí nếu cả gan thì... từ cái đầu gồ ghề của Roshan luôn cũng được. ",
      "Và với mỗi nón lấy được, bạn có thể đội lên thành chồng nón hoành tráng, tràn đầy chiến tích giết chóc vĩ đại. Thêm vào đó vì màn hình MVP sau trận đấu giờ đếm cả số nón, bạn chắc chắn sẽ có bằng chứng hùng hồn về thành tích nón trong những ngày sắp tới. ",
      "[h2]Một câu chuyện Frostivus[/h2]",
      "Vậy giờ bạn đã có một chồng nón Frostivus trên đầu mình. Nhưng bạn có thể thực sự thưởng thức chúng mà không hay biết về tiền truyện li kì? Theo khám phá của chúng tôi cho thấy, câu trả lời là có. Bạn có thể phán \"Chỉ là mấy cái nón màu mè thôi mà\". \"Ai hơi đâu quan tâm chúng từ đâu đến?\". ",
      "Nè, sao từ đầu hồi sáu tháng trước không nói cho rồi, vì chúng tôi đã cất công viết thần thoại dài sáu trăm ngàn từ gọi là The Hatmarillion. Nhưng ai cũng lười đọc, chúng tôi đành viết phiên bản rút gọn dành cho trẻ lên ba của The Hatmarillion chỉ dài mười trang và một phút để đọc, và thế là bà con cô bác hết lời khen ngợi. Sao bạn không [b]khởi động ngay Dota và tự mình[/b] tận hưởng câu chuyện! (Buôn lê Frostivus: Bạn có thể đọc câu chuyện BA MƯƠI LẦN trong thời gian bạn đọc hết bài blog này!).",
      "[h2]Lò rèn Frostivus[/h2]",
      "Hãy khoan! Vẫn còn đó tinh thần Frostivus đâu đây! Nhưng không may thay đã bị phân tách thành nhiều thành phần hóa học và cần phải tổng hợp lại để ra hợp chất theo mùa. Chúng tôi đã quy tụ tất cả vật tư cần thiết để bạn chế tác phần thưởng trong [b]lò rèn Frostivus[/b] mới keng. Vậy tiếp theo là gì? Đến phần chế tác thực tế này. ",
      "Tất cả bạn cần làm là thực hiện hàng loạt trò hề trong trận đấu như “ném bóng tuyết trước khi kết liễu kẻ thù”, “cướp một nón”, hoặc “đập tay với kẻ địch” để nhận được những vật tư độc đáo cần thiết cho chế tác phần thưởng. Mỗi vật phẩm cần công chức khác nhau để chế tác, và bạn có thể mở khóa bậc cao hơn bằng cách hoàn thành phần thưởng trong các bậc thấp hơn trước đó. Vòng tán gẫu theo mùa? Có nhé. Một con Khổ Hình mới hình chuông cho phép bạn chơi nhạc? Dĩ nhiên là có rồi. Một pháp sư say xỉn cưỡi tuần lộc trông giống con lừa đến đáng ngờ? Lễ hội mà thiếu đi bọn họ thì còn gì đâu!",
      "[h2]Của báu quần hùng mùa đông 2024[/h2]",
      "Bạn biết lễ hội thì phải có gì nữa không? Một cái hộp đầy những bất ngờ! Vậy nên chúng tôi xin hé lộ [b]Của báu quần hùng mùa đông 2024[/b], một kho báu hoàn toàn mới gồm 17 bộ vật phẩm cho nhiều tướng. ",
      "Nhưng không chỉ có thế. Để đảm bảo vách thùng kho báu được thử sức tối đa, chúng tôi nhét thêm vài vật phẩm bất diệt mới chung với các bộ cho tướng. Rồi thêm thắt tí khiêu khích mới. Cùng một bé sói cưng cho tay đấm kiệm lời của chúng ta. Và khi nhận ra bộ vật phẩm Windranger mới trông hợp gu với Arcana, chúng tôi cũng tiện thể thêm vào luôn. Kho báu lần này sẽ mở bán trong cửa hàng Crownfall, vì thế bạn có thể sử dụng xu Crownfall để mua hàng.",
      "[h2]Đợt cấm chơi cuối năm[/h2]",
      "Đức vua Kringle đã đập nát chiếc búa cấm chơi vào những kẻ đáng đời năm trước. Ngài dành cả năm mòn mỏi đúc lại và thử lên những kẻ ác ý và chơi lệch trình độ. Giờ đây ngài rửa tội bằng máu của những kẻ nghịch ngợm.",
      "Mặc dù chúng tôi thường thầm lặng ban hành lệnh cấm và phạt, nhưng giờ đã trở thành truyền thống Frostivus để vén màn bí mật và nói về công việc này. Và vì thế: Trong mùa lễ hội này, chúng ta chào đón những trận đấu sạch hơn, thân thiện hơn, công bằng hơn, không còn bóng dáng của [b]65.594 tài khoản smurf chơi lệch trình[/b] mà chúng tôi đã ra tay trong tuần này. ",
      "Ngoài smurf, chúng tôi cũng gõ búa cấm lên kha khá lượng người chơi có MMR cao nhưng hay cay cú, những người chơi lấy niềm vui từ việc gây ức chế cho người khác, tận dụng lỗi, trao đổi trận thắng, và những hành động khác làm hỏng tinh thần thử thách cạnh tranh vốn là giá trị cốt lõi của Dota.",
      "Như thường lệ, chúng tôi muốn cám ơn tất cả mọi người đã gửi báo cáo trong năm qua. Tất cả dữ liệu đó đã giúp chúng tôi truy ra người chơi làm trận đấu Dota ngày một tệ hơn, và từ đấy ra tay hành động. Dota trở thành trò chơi tuyệt vời hơn là nhờ bạn.",
      "[h2]Ưu đãi cuối năm[/h2]",
      "Bài blog Dota tựa như chồng nón Frostivus, ở điểm luôn có gì đó ở dưới đáy. Dịp này, Dota có [b]ưu đãi mùa đông[/b] của riêng mình cho nội dung Crownfall, từ đây cho đến 03/01. ",
      "Mở khóa các nút chuyện mới với ưu đãi cho gói người tìm đường Cổng Giữa, Druud và Icewrack, chưng diện cho các tướng của bạn với trang phục từ Skywrath trong kho báu Crownfall từ I đến III, hoặc hoàn tất màn lột xác của Shen và Dragonus với Arcana Vengeful Spirit và Skywrath Mage. (Nếu vẫn còn nhiều xu Crownfall, bạn có thể sử dụng để nhận giảm giá cho hầu hết vật phẩm trong cửa hàng Crownfall, kể cả khi vật phẩm đó đã được giảm giá trong ưu đãi này!).",
      "Bạn vẫn còn thời gian để vọc Crownfall khi bước sang năm mới, nhưng loạt truyện Skywrath rồi cũng sẽ khép lại vào 15/01, vì vậy nếu vẫn còn nội dung trong bốn hồi truyện cần khám phá, thì bạn nên bắt đầu ngay và luôn."
    ],
    "commentcount": 269,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 28,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 3964,
    "votedowncount": 325,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734629576,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 3953,
  "votes_down": 323,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}