{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Ziehen Sie sich warm an für Frostivus",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ziehen Sie sich warm an für Frostivus",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "2024 war ein vollgepacktes Jahr für Dota. Wir begrüßten einen neuen Helden in unseren Reihen (und ein lange angekündigter Held feierte endlich sein Debüt). In Kopenhagen krönten wir einen weiteren Sieger bei The International. In einem massiven Update erhielt (fast) jeder Dota-Held zusätzlich zu seinen Fähigkeiten eine Begabung und zwei Facetten. Und zu guter Letzt haben wir noch einen Heldenepos in vier Akten mit sprechenden Vögeln unters Volk gebracht.",
      "Das hindert uns aber am Ende des Jahres nicht daran, mit Frostivus festliche Stimmung zu verbreiten. Und das bedeutet für Sie einen Sack voller Geschenke, die Sie sich ab sofort und bis zum Ende des Frostivus-Events am [b]15. Januar 2025[/b] sichern können.  ",
      "[h2]Die wahre Bedeutung von Frostivus: Hüte[/h2]",
      "Sie fragen sich sicherlich, „welche Art von Geschenken“? Nun, wir gehen davon aus, dass Sie artig waren, deshalb bekommt Ihr ausgewählter Held bis zum Ende des Winters mit dem [b]Frostivus-Hut[/b] eine schicke wärmende Kopfbedeckung. ",
      "Aber dieser Hut sieht nicht nur gut aus. Mit seiner Fähigkeit [b]Geist von Frostivus[/b] ist er auch eine Art Trophäenvitrine. So können Ihre Verbündeten ihre Hüte an Sie verschenken. Und falls diese zu geizig sind, können Sie stattdessen die Hüte von gegnerischen Helden stehlen. Und für Spieler ohne jegliche Hemmungen bleibt noch der Raubmord. Töten Sie einen gegnerischen Helden und schnappen Sie sich dessen Hut noch bevor die Leichenstarre einsetzt. Sie stehen auf größere Ziele? Kein Problem, die Peiniger und Roshan haben nach ihrem Ableben ebenfalls keine Verwendung mehr für ihre Hüte. ",
      "Jeder einzelne Hut, den Sie „einsammeln“, landet quasi auf dem Kopf Ihres Helden, damit Sie mit einem majestätischen, mörderischen Hutstapel der Herrlichkeit angeben können. Und damit keiner übersieht, wer der beste Hutträger einer Partie ist, wird während Frostivus auf dem MVP-Bildschirm die Anzahl der gesammelten Hütte angezeigt. ",
      "[h2]Eine Frostivus-Geschichte[/h2]",
      "Sie haben jetzt also einen Stapel Frostivus-Hüte auf Ihrem Kopf. Aber können Sie wirklich stolz darauf sein, ohne deren Hintergrundgeschichte zu kennen? Wir vermuten, die Antwort darauf lautet ja. „Das sind nur farbenfrohe Hüte“, sagen Sie. „Warum sollte es mich kümmern, wo sie herkommen?“ ",
      "Vor sechs Monaten wäre ein guter Zeitpunkt gewesen, diese Attitüde vorauszuahnen, als wir ein 600 000 Wörter umfassendes mythologisches Meisterwerk mit dem Titel „Das Hutmarillion“ in Angriff nahmen. Ein ambitioniertes Projekt … und wir stellten schnell fest, dass es niemand Korrektur lesen wollte. Also schrumpften wir auf den letzten Drücker den Inhalt und das Niveau auf ein Kinderbuch zusammen. Die zehn Seiten schafften unsere Korrekturleser in einer Minute und alle fanden das Ergebnis großartig. Es spricht also nichts dagegen, dass Sie [b]Dota starten und sich selbst ein Bild davon machen[/b]. (Hätten Sie’s gewusst? In der Zeit, die Sie für diesen Blogeintrag brauchen, könnten Sie die Frostivus-Geschichte DREISSIG MAL lesen.)",
      "[h2]Frostivus-Schmiede[/h2]",
      "Sie sind noch da? Wunderbar, denn die Frostivus-Feierlichkeiten bieten noch viel mehr. Jedoch haben wir alle Belohnungen in ihre einzelnen Bestandteile zerlegt und es ist Ihre Aufgabe, die zur Jahreszeit passenden Verbindungen wiederherzustellen. Entziehen Sie der in der Luft liegenden Frostivus-Stimmung alle festlichen Gaben, die Sie zur Herstellung von Belohnungen in der neuen [b]Frostivus-Schmiede[/b] benötigen. Los geht’s! Entdecken Sie Ihren „inneren Schmied“ und stellen Sie Ihre eigenen Belohnungen her. ",
      "Jetzt fragen Sie sich wahrscheinlich, wie Sie an diese festlichen Gaben herankommen. Ganz einfach! Führen Sie im Spiel bestimmte Manöver durch: Treffen Sie einen Gegner mit einem Schnellball, bevor Sie ihn töten, stehlen Sie einen Hut oder klatschen Sie einen Gegner ab. Sie stocken jedes Mal Ihren Vorrat an Gaben auf, die Sie in der Schmiede in neue Belohnungen umwandeln können. Jeder Gegenstand benötigt zur Herstellung ein anderes Rezept. Indem Sie Belohnungen in den unteren Stufen abschließen, schalten Sie gleichzeitig höhere Stufen frei. War das alles, oder gibt es saisonale Chatradsprüche? Auf jeden Fall! Ein neuer Peiniger in Glockenform, der quasi ein Musikinstrument ist? Ist auch mit dabei. Üben Sie schon mal „Kling, Glöckchen, klingelingeling“! Ein Zauberer im Glühweinrausch, der auf einem Rentierkurier reitet, der verdächtig wie ein Esel aussieht? Ohne ihn wäre Frostivus nicht dasselbe.",
      "[h2]Heldenschatz zu Frostivus 2024[/h2]",
      "Und was setzt Frostivus das Sahnehäubchen auf? Eine Schatzkiste voller Überraschungen! Deshalb präsentieren wir den [b]Heldenschatz – Frostivus 2024[/b] mit 17 brandneuen Gegenstandssets für ausgewählte Helden. ",
      "Und das ist noch nicht alles. Um sicherzustellen, dass kein bisschen Luft in der Schatzkiste ist, haben wir den Sets ein paar Immortal-Gegenstände hinzugefügt sowie einige neue Verspottungen. Außerdem haben wir für unsere stille Lieblingsschlägerin einen Wolf gezähmt (natürlich nicht zu zahm). Und zu guter Letzt haben wir Windrangers Arkana mit eingepackt, weil es einfach perfekt zu ihrem neuen Set passt. Dieser prallgefüllte Schatz ist im Thronsturz-Shop erhältlich, was natürlich bedeutet, dass Sie Ihre Thronsturz-Münzen dafür verwenden können.",
      "[h2]Bannwelle zum Jahresende[/h2]",
      "König Krampus hatte 2023 alle Hände voll zu tun und verpasste mit seinem Hammer zahlreichen Hintern eine ordentliche Abreibung. Nach getaner Arbeit hat er 2024 damit verbracht, sein Werkzeug in der Schmiede zu verbessern und an Smurfs und anderen Halunken im Spiel auszutesten. Das Ergebnis ist beeindruckend, und König Krampus ist jetzt mehr als bereit, seinen neuen Hammer mit dem Blut der Bösen zu taufen.",
      "Normalerweise verhängen wir Sperren und Strafen hinter den Kulissen, aber während Frostivus hat es sich für uns zur Tradition entwickelt, den Vorhang ein wenig zu lüften. Allein in der vergangenen Woche haben wir [b]65 594 Smurf-Accounts[/b] entfernt. Freuen Sie sich also zur Weihnachtszeit auf sauberere, freundlichere und fairere Spiele. ",
      "Außer den Smurfs haben wir auch eine beträchtliche Zahl von Störenfrieden (Griefern) mit hohen MMW-Werten zur Strecke gebracht. Das sind Spieler, die auf Kosten anderer Spaß haben wollen, indem sie Fehler im Spiel ausnutzen, Siege aushandeln und auf andere Weise den Wettkampfanspruch von Dota untergraben.",
      "Wie immer möchten wir uns bei allen Spielern bedanken, die im Laufe des Jahres Missbrauch gemeldet haben. All diese Daten helfen uns dabei, verdächtige Spieler ausfindig zu machen und entsprechende Maßnahmen zu ergreifen. Dank Ihnen ist Dota ein besseres Spiel.",
      "[h2]Winteraktion zum Jahresende[/h2]",
      "Ein Dota-Blogbeitrag ähnelt oft einem riesigen Stapel von Frostivus-Hüten. Es kann eine Weile dauern, bis man zum letzten Hut bzw. Thema gelangt. Dieses Mal dreht sich unser letzter Absatz (versprochen!) um die [b]Winteraktion[/b] für Thronsturz-Inhalte, bei der Sie sich bis zum 3. Januar 2025 tolle Angebote sichern können. ",
      "Schalten Sie mithilfe der Pfadfinderpakete „Mittlere Pforte“, „Druud“ und „Eismarsch“ alle Pfade auf den jeweiligen Gebietskarten frei, holen Sie sich für Ihre Lieblingshelden die Himmelszorn-Sets aus den Thronsturz-Schätzen I bis III oder schließen Sie mit den Arkanas für Vengeful Spirit und Skywrath Mage die Verwandlung von Shen und Dragonus ab. (Falls Sie noch Thronsturz-Münzen übrig haben, können Sie diese verwenden, um sich zusätzlich zu den Rabatten der Winteraktion einen weiteren Rabatt zu sichern. Dies funktioniert für die meisten Artikel im Thronsturz-Shop.)",
      "Apropos Thronsturz! Sie haben noch bis nächstes Jahr Zeit, Imperia aus dem Dornennest zu vertreiben, aber am 15. Januar findet die Saga von Himmelszorn ihren endgültigen Abschluss. Falls Sie noch nicht alle Comics gelesen und alle Gebietskarten in Angriff genommen haben, wird es höchste Zeit."
    ],
    "commentcount": 359,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 6207,
    "votedowncount": 514,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734716483,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 6206,
  "votes_down": 513,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}