{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "Se acerca Frostivus",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Se acerca Frostivus",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "Ha sido un año ajetreado para Dota. Le dimos la bienvenida a un héroe nuevo en las sendas (y uno muy esperado hizo su debut), coronamos a otro equipo como el campeón mundial de este año en The International en Copenhague, modificamos todos los héroes con habilidades innatas y facetas, e incluso logramos meter una épica narrativa de cuatro actos sobre pájaros parlanchines.",
      "Y así, a medida que se termina el año, estamos de nuevo rebosando de alegría gracias al espíritu de Frostivus. Y eso significa que todos recibirán un saco lleno de regalos festivos durante la celebración del [b]evento de Frostivus, desde ahora hasta el 15 de enero. [/b]",
      "[h2]Se reveló el verdadero significado de Frostivus (los sombreros)[/h2]",
      "\"¿De qué tipo de regalos estamos hablando?\", uno podría preguntarse festivamente. Bueno, para empezar, en lo que queda de la temporada, tu héroe va a iniciar cada partida con un elegante [b]sombrero de Frostivus[/b]. ",
      "Pero no lo mires como si fuera una cuestión de moda. Piensa en ello como si fuera una vitrina para presumir trofeos. Porque también podrás robar sombreros de héroes enemigos y dárselos a tus aliados con la nueva habilidad, [b]Espíritu de Frostivus [/b]. También se los podrás dar \"a la antigüita\" (mediante asesinato o hurto), al robarlos de los cráneos de los héroes que acabas de asesinar, de los Torturadores o, si realmente sabes cómo jugar, incluso de la escabrosa cabeza del cadáver de Roshan. ",
      "Y por cada sombrero que te robes, podrás apilarlo con todos los demás en una majestuosa torre de sombreros llena de gloria, gracias a tus asesinatos. Además, considerando que la pantalla de MJ que sale después de la partida, ahora incluye un conteo de sobreros, y en los próximos días, va a quedar clara tu superioridad en el tema de sombreros. ",
      "[h2]Una historia de Frostivus[/h2]",
      "Ahora tienes una torre de sombreros de Frostivus en tu cabeza,  ¿pero puedes realmente disfrutarlos sin conocer su exhaustiva historia de fondo? La respuesta, tal como lo hemos descubierto, es que sí. Dirás, \"Si solamente se trata de sombreros coloridos, ¿a quién le importa de dónde vienen?\". ",
      "Bueno, hace seis meses hubiera sido un buen momento para responder a eso, porque escribimos una colección de leyendas de seiscientas mil palabras al respecto llamada \"El Sombrerillion\". Pero todo el mundo se negó a leerla, así que escribimos una versión para niños de 10 páginas de \"El Sombrerillion\" que tarda solamente un minuto en leerse, y parece que a todo el mundo le pareció mejor esta versión. [b] ¡Juega Dota y disfruta de la historia[/b] por ti mismo! (Trivia de Frostivus: ¡Podrás leerla TREINTA VECES, en el tiempo que te toma leer esta entrada de blog!).",
      "[h2]La Fragua de Frostivus[/h2]",
      "¡Pero eso no es todo! ¡Todavía hay más espíritu de Frostivus en el aire! Desafortunadamente, se dividió en sus componentes químicos y necesita ser reconstruido en un componente de temporada. Recolectamos la información de todos los suministros que vas a necesitar para fabricar recompensas en el nuevo [b]Forjar Frostivus[/b]. ¿Cuál es el siguiente paso? La parte de la fabricación. ",
      "Todo lo que tienes que hacer para conseguir los suministros que tu fragua necesita para fabricar las nuevas recompensas es hacer distintas travesuras dentro del juego, como \"atacar con bolas de nieve a un enemigo antes de matarlo\", \"robar un sombrero\" o \"chocarlas\". Cada objeto requiere de una receta para fabricarse, y puedes desbloquear niveles más altos de categorías para completar primero las recompensas de las categorías más bajas. ¿Ruedas de chat de temporada? Las tenemos. ¿Un Torturador con forma de campana que te permite tocar música? Obviamente, tenemos uno de esos. ¿Un hechicero borracho montado sobre un burro mensajero con una sospechosa finta de reno? ¡No sería una fiesta sin uno de ellos!",
      "[h2]Tesoro de Héroes de Invierno de 2024[/h2]",
      "¿Sabes qué más es importante para considerar esto una fiesta? ¡Una caja llena de sorpresas! Así que estamos develando la [b]Horda de Héroes de Invierno de 2024[/b], un tesoro completamente nuevo con 17 objetos para ciertos héroes. ",
      "¡Pero eso no es todo! Arriesgándonos a rebosar el tesoro, atiborramos los sets con más sets nuevos de artículos inmortales. Y después, agregamos unas cuantas burlas nuevas y un lobo mascota para el malacopa (del tamaño de una cerveza) favorito de todos. Y cuando nos dimos cuenta de que el nuevo set de Windranger se veía maravilloso al equiparse con sus arcanos, también lo incluimos. Este tesoro está disponible en la tienda de la Caída de la Corona, así que usa tus monedas de la Caída de la Corona para realizar tu compra.",
      "[h2]Ola de bloqueos de fin de año[/h2]",
      "El año pasado, Santa Claus le dio una tunda con el martillo de bloqueos a algunos que se lo merecían. Pasó la mayor parte del año reforjándolo y probándolo con varios [i]smurfs[/i] y tramposos dentro de las partidas, y ahora está listo para rebautizarlo con la sangre de los malportados.",
      "Si bien generalmente aplicamos la mayoría de nuestros bloqueos y sanciones entre bastidores, se ha convertido en una especie de tradición de Frostivus abrir un poco el telón y hablar sobre este trabajo en curso. Y por eso: en esta temporada de fiestas, esperamos que disfrutes de juegos más limpios, amigables y justos, libres de las [b]65 594 cuentas [i]smurf[/i][/b] contra las que tomamos medidas esta semana. ",
      "Además de los [i]smurf[/i], también castigamos a un número significativo de jugadores con MMR alto que intentan divertirse a costa de los demás, explotando errores, intercambiando victorias y socavando de otras formas el desafío competitivo que está en el corazón de cada partida de Dota.",
      "Como siempre, nos encantaría agradecer a todos los que enviaron alguna denuncia a lo largo del año. Todos esos datos nos ayudan a encontrar a los jugadores que están empeorando las partidas de Dota y a tomar medidas. Dota es un mejor juego gracias a ti.",
      "[h2]Rebajas de fin de año[/h2]",
      "Una publicación de blog de Dota es muy similar a una enorme torre de sombreros de Frostivus, en el sentido de que siempre tiene algo hasta abajo. Esta vez, Dota va a contar con sus propias [b]rebajas de invierno[/b] en el contenido de la Caída de la Corona, desde ahora hasta el 3 de enero. ",
      "Desbloquea nuevos nodos de la historia con descuentos en los paquetes del Barrio Medio y los Paquetes de explorador de Druud y Icewrack, decora a tus héroes con los sets de Skywrath de los tesoros I-III de la Caída de la Corona o completa las transformaciones de Shen y Dragonus con los arcanos de Vengeful Spirit y Skywrath Mage, (si todavía tienes monedas de la Caída de la Corona, puedes usarlas para descontar aún más la mayoría de los objetos de la tienda de la Caída de la Corona, ¡incluso si los objetos ya tienen descuento como parte de las rebajas!).",
      "Todavía tienes tiempo para ver todo lo que la Caída de la Corona tiene por ofrecer a medida en que nos acercamos al año nuevo, pero la saga de Skywrath llegará a su fin el 15 de enero, así que si todavía tienes cosas que hacer en los cuatro actos, es hora de ponerte a jugar."
    ],
    "commentcount": 295,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 4732,
    "votedowncount": 374,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734654556,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4732,
  "votes_down": 374,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}