{
  "gid": "596261024722585016",
  "clan_steamid": "103582791433224455",
  "event_name": "เทศกาล Frostivus มาถึงแล้ว",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1734574440,
  "rtime32_end_time": 1734579001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "2bf8a24917d425169d6c9b541482de91c28f5290.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1734547310
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1734549339
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1734572694
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1734574490
      }
    ]
  },
  "announcement_body": {
    "gid": "596261024722585017",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "เทศกาล Frostivus มาถึงแล้ว",
    "posttime": 1734574491,
    "updatetime": 1734574491,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/2bf8a24917d425169d6c9b541482de91c28f5290.png[/img]",
      "ปีนี้เป็นปีแห่งความชุลมุนของ Dota เราได้ต้อนรับฮีโร่ตัวใหม่เข้าสู่โหมดจัดอันดับ (และฮีโร่ที่ทุกคนรอคอยมานานก็ได้เปิดตัวในที่สุด) เราได้สวมมงกุฎให้กับทีมแชมป์โลกหน้าใหม่ใน TI ของปีนี้ที่โคเปนเฮเกน เราได้ปรับเปลี่ยนฮีโร่ทุกตัวโดยการเพิ่มสกิลประจำตัว และมิติฮีโร่ที่สร้างความแปลกใหม่ให้กับเกม เรายังสามารถยัดมหากาพย์เรื่องราวเกี่ยวกับนกพูดได้ 4 บทที่กินเวลานานหลายเดือนเข้าไปในเกมด้วย",
      "พอเข้าใกล้ช่วงสิ้นปี รู้ตัวอีกทีเราก็เต็มไปด้วยจิตวิญญาณแห่ง Frostivus กันอีกครั้งแล้ว นั่นหมายความว่ามีของขวัญเฉลิมฉลองช่วงเทศกาลมาให้ทุกคนเต็มถุงตลอด[b]เทศกาล Frostivus ตั้งแต่วันนี้จนถึง 15 มกราคม เวลาแปซิฟิก [/b]",
      "[h2]เผยความหมายที่แท้จริงของ Frostivus (หมวก)[/h2]",
      "“ของขวัญแบบไหนกันนะ?” อาจมีคนเริ่มสงสัย เอาล่ะ เริ่มจาก: ตลอดช่วงฤดูกาลนี้ ฮีโร่ของคุณจะเริ่มเกมด้วยการสวมหมวก Frostivus สุดปัง ",
      "แต่อย่าคิดว่ามันเป็นแค่แฟชั่นทั่วไป ให้คิดซะว่ามันเป็นตู้โชว์ถ้วยรางวัล เพราะคุณสามารถขโมยหมวกจากฮีโร่ฝ่ายศัตรู และรับหมวกเป็นของขวัญจากเพื่อนร่วมทีมของคุณด้วยสกิลใหม่ [b]Spirit of Frostivus [/b] คุณยังสามารถหาหมวกได้ด้วยวิธีการแบบดั้งเดิม (ฆาตกรรม/โจรกรรม) โดยขโมยจากหัวกะโหลกของฮีโร่ที่คุณเพิ่งสังหาร จาก Tormentor หรือถ้าคุณเก่งจริงจะขโมยจากหัวแข็ง ๆ ของ Roshan ที่ตายแล้วก็ยังได้ ",
      "โดยคุณสามารถสวมหมวกทุกใบที่ฉกชิงมา ซ้อนทับกันเป็นหอคอยสูงสง่าน่าเกรงขามบนหัวของคุณได้ อีกทั้งหน้า MVP หลังจบเกมต่อจากนี้จะมีการนับจำนวนหมวกด้วย คุณจะได้พิสูจน์ความเหนือชั้นด้านหมวกในเร็ว ๆ นี้ ",
      "[h2]นิทาน Frostivus[/h2]",
      "เมื่อคุณมีหอคอยหมวก Frostivus อยู่บนหัวของคุณแล้ว แต่คุณจะสนุกได้จริง ๆ เหรอถ้าไม่รู้ที่มาที่ไปของหมวกเหล่านี้อย่างชัดเจน? คำตอบที่เราค้นพบก็คือ \"ได้ดิ\" \"ก็แค่หมวกหลากสี\" คุณกล่าว \"ใครจะสนว่ามาจากไหน?\" ",
      "เอิ่ม คือว่าหกเดือนก่อนน่าจะเป็นเวลาที่เหมาะจะพูดเรื่องนี้ เพราะเราได้เขียนตำนานที่มีความยาวกว่า 600,000 คำ โดยมีชื่อเรื่องว่า \"เดอะแฮตมาริลเลียน\" แต่ไม่มีใครยอมอ่านเลย เราก็เลยเขียน \"เดอะแฮตมาริลเลียน\" เป็นเวอร์ชันหนังสือนิทานเด็กความยาว 10 หน้าที่ใช้เวลาอ่านประมาณหนึ่งนาทีแทน และดูเหมือนว่าทุกคนจะชอบแบบนี้มากกว่า[b] เปิด Dota แล้วเพลิดเพลินกับเรื่องราวนี้[/b]ด้วยตนเอง! (เกร็ดน่ารู้ Frostivus: หากคุณอ่านนิทานเรื่องนี้ 30 รอบจะใช้เวลาเท่ากับที่คุณใช้อ่านโพสต์บล็อกนี้จนจบ!)",
      "[h2]หมวกวิเศษ Frostivus[/h2]",
      "แต่เดี๋ยวก่อน! ยังมีจิตวิญญาณแห่ง Frostivus ในอากาศอีก! น่าเสียดายที่มันแตกสลายกลายเป็นองค์ประกอบย่อยทางเคมี และต้องนำมาคืนรูปใหม่ให้เป็นสารประกอบตามฤดูกาล เราได้รวบรวมสารละลายรื่นเริงทั้งหมดที่คุณต้องใช้ในการประดิษฐ์รางวัลไว้ที่[b]หมวกวิเศษ Frostivus[/b] โฉมใหม่ ขั้นต่อไปเหรอ? ลงมือประดิษฐ์กันเลยสิ ",
      "สิ่งที่คุณต้องทำคือทำภารกิจสนุก ๆ ในเกม เช่น “ปาบอลหิมะใส่ฮีโร่ก่อนลงมือสังหาร”, “ขโมยหมวก” หรือ “ไฮไฟฟ์ศัตรู” เพื่อรับส่วนประกอบพิเศษที่จะใช้ป้อนเข้าหมวกวิเศษ Frostivus และประดิษฐ์รางวัลใหม่ แต่ละไอเท็มใช้ส่วนผสมที่แตกต่างกันในการประดิษฐ์ โดยคุณสามารถปลดล็อกระดับที่สูงกว่าได้โดยประดิษฐ์รางวัลในระดับที่ต่ำกว่าให้สำเร็จก่อน วงล้อสนทนาประจำฤดูกาลล่ะ? มีจ้า แล้ว Tormentor รูปทรงระฆังแบบใหม่ที่สามารถเล่นเป็นเพลงได้ล่ะ? แน่นอนว่าต้องมีอยู่แล้วแหละ Courier พ่อมดขี้เมาขี่กวางเรนเดียร์ที่รูปร่างคล้ายลาอย่างน่าสงสัย? ทำไมจะไม่มีล่ะ ถ้าขาดไปก็คงเหมือนไม่ใช่ช่วงเทศกาลน่ะสิ!",
      "[h2]Heroes' Hoard ฤดูหนาว 2024[/h2]",
      "คุณรู้ไหมว่ามีอะไรอีกที่จะขาดไปไม่ได้เลยในช่วงเทศกาล? กล่องที่เต็มไปด้วยเซอร์ไพรส์ยังไงล่ะ! เราจึงเปิดตัว [b]Heroes’ Hoard ฤดูหนาว 2024[/b] สมบัติใหม่ทั้งหมดที่มาพร้อมกับชุดเซ็ตไอเท็ม 17 ชุดสำหรับฮีโร่มากมาย ",
      "ยังไม่หมดเพียงเท่านี้ เพื่อเป็นการการันตีว่าสมบัติรอบนี้ทำถึงแบบจัดเต็มจริง ๆ เราได้ยัดไอเท็ม Immortal ใหม่เข้าไปร่วมวงกับชุดเซ็ต แถมยังมีท่าเยาะเย้ยใหม่ รวมทั้งสัตว์เลี้ยงหมาป่าน้อยสำหรับสาวนักสู้ที่ทุกคนชื่นชอบ พอดีเราเห็นว่าชุดเซ็ตใหม่ของ Windranger นั้นปังมากเพราะเข้ากับ Arcana ของเธอได้แบบเริ่ดที่สุด เราก็เลยแถมให้ด้วยซะเลย สมบัตินี้วางจำหน่ายในร้านค้าบัลลังก์วิบัติ ดังนั้นคุณจึงสามารถใช้เหรียญบัลลังก์วิบัติเพื่อเป็นส่วนลดในการซื้อได้",
      "[h2]การแบนเป็นชุดช่วงสิ้นปี[/h2]",
      "ราชาซานตาจิตป่วนทำค้อนแบนบัญชีหักจากการหวดก้นของพวกที่สมควรโดนแบนไปเมื่อปีที่แล้ว เขาใช้เวลาทั้งปีหลอมค้อนขึ้นมาใหม่และทดสอบกับพวกสเมิร์ฟ รวมทั้งพวกทำตัวแย่ ๆ ในเกม และตอนนี้เขาพร้อมจะอาบเลือดพวกตัวป่วนแล้ว",
      "แม้ว่าโดยปกติแล้วเราจะแบนและลงโทษส่วนใหญ่หลังฉาก แต่ตอนนี้กลายเป็นส่วนหนึ่งของประเพณี Frostivus ไปแล้วที่เราจะแหวกม่านสักเล็กน้อยและพูดถึงงานนี้ที่ต้องดำเนินต่อไป ดังนั้น: ในช่วงเทศกาลวันหยุดนี้ เราหวังว่าคุณจะได้พบกับเกมที่ขาวสะอาดมากขึ้น เป็นมิตรมากขึ้น และยุติธรรมมากขึ้น ปราศจาก[b]สเมิร์ฟ 65,594 บัญชี[/b]ที่เราเพิ่งได้ดำเนินการแบนในสัปดาห์นี้ ",
      "นอกจากพวกสเมิร์ฟแล้ว เรายังได้ลงดาบผู้เล่นจำนวนมากที่มี MMR สูงแต่ชอบก่อกวน ผู้เล่นที่หาความสนุกโดยการทำให้คนอื่นเดือดร้อน ใช้จุดบกพร่องของเกมในทางที่ผิด แลกเปลี่ยนชัยชนะ และทำลายความท้าทายในการแข่งขันที่เป็นหัวใจของทุกเกมใน Dota",
      "เช่นเคย เราขอขอบคุณทุกคนที่ส่งรายงานเข้ามาตลอดทั้งปี ข้อมูลทั้งหมดช่วยให้เราพบและจัดการกับผู้เล่นที่ทำให้เกม Dota แย่ลงได้ Dota เป็นเกมที่ดีขึ้นได้ก็เพราะคุณ",
      "[h2]เทศกาลลดราคาส่งท้ายปีเก่า[/h2]",
      "บล็อกโพสต์ Dota ก็เหมือนกับหมวก Frostivus ที่ซ้อนกันจนสูงเหมือนหอคอยตรงที่มักจะมีอะไรดี ๆ บางอย่างที่ด้านล่างสุดอยู่เสมอ มาคราวนี้ อะไรดี ๆ บางอย่างที่ว่าก็คือ[b]เทศกาลลดราคาฤดูหนาว[/b]ของ Dota เอง โดยเนื้อหาศึกบัลลังก์วิบัติจะลดราคาตั้งแต่วันนี้จนถึงวันที่ 3 มกราคม เวลาแปซิฟิก ",
      "ปลดล็อกเส้นทางเรื่องราวใหม่ด้วยส่วนลดสำหรับแพ็กนักเบิกทางแห่งมิดเกต แพ็กนักเบิกทางแห่งดรูด และแพ็กนักเบิกทางแห่งไอซ์แร็ก จับฮีโร่ของคุณแต่งตัวให้ตะลึงด้วยชุดเซ็ตไอเท็มจากสกายแรธในสมบัติศึกบัลลังก์วิบัติ I-III หรือแปลงร่างของ Shen และ Dragonus ให้สมบูรณ์ด้วย Arcana สำหรับ Vengeful Spirit และ Skywrath Mage (หากคุณยังมีเหรียญบัลลังก์วิบัติเหลืออยู่เป็นจำนวนมาก คุณสามารถใช้เหรียญเหล่านั้นเพื่อลดราคาไอเท็มในร้านค้าบัลลังก์วิบัติมากขึ้นอีกได้ แม้ว่าไอเท็มเหล่านั้นจะมีส่วนลดเป็นส่วนหนึ่งของเทศกาลลดราคาแล้วก็ตาม!)",
      "คุณยังคงมีเวลาเหลือมากพอที่จะสำรวจทุกสิ่งที่ศึกบัลลังก์วิบัตินำเสนอในช่วงที่เราก้าวเข้าสู่ปีใหม่ แต่มหากาพย์ของสกายแรธจะสิ้นสุดลงในวันที่ 15 มกราคม เวลาแปซิฟิก ดังนั้น หากคุณยังเหลือเส้นทางให้สำรวจทั้ง 4 บทก็ต้องเร่งมือหน่อยแล้ว"
    ],
    "commentcount": 284,
    "tags": [
      "mod_reviewed",
      "ModAct_871423085_1734575947_0"
    ],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "598513360098626905",
    "event_gid": "596261024722585016",
    "voteupcount": 4255,
    "votedowncount": 341,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598513360098626905",
  "rtime32_last_modified": 1734635191,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1734575947,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4250,
  "votes_down": 341,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598513360098626905",
  "clan_steamid_original": "103582791433224455"
}