{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja rozgrywki 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aktualizacja rozgrywki 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "Aktualizacja 7.38c jest już dostępna. Listę zmian możecie sprawdzić [url=https://www.dota2.com/patches/7.38c]tutaj[/url].",
      "Dodatkowo w ciągu ostatnich kilku dni zajęliśmy się następującymi problemami:",
      "[list]",
      "[*] Dodano brakującą linijkę z listy zmian aktualizacji 7.38: „Roshan nie upuszcza już przedmiotu Aghanim's Blessing”.",
      "[*] Naprawiono błąd powodujący, że dręczyciel pojawiał się nad bohaterem gracza w 15 minucie meczu przy testowaniu terenu w trybie demonstracyjnym.",
      "[*] Naprawiono błąd powodujący, że polecenie -createhero niekiedy tworzyło bohatera bez aspektu.",
      "[*] Naprawiono błąd powodujący, że w rejestrze rozgrywki była wyświetlana informacja o inkantacji bliźniaczych bram przez niewidocznego wroga.",
      "[*] Naprawiono błąd umożliwiający bohaterowi zablokowanie pozycji lub kąta modelu bohatera, jeśli animacja bycia chwytanym przez Roshana została przerwana.",
      "[*] Naprawiono błąd powodujący, że czas trwania runy przyśpieszenia nie ulepszał się wraz z cyklem runy.",
      "[*] Naprawiono błąd umożliwiający generowanie nieskończonej liczby sztuk przedmiotu Town Portal Scroll poprzez kupowanie, a następnie sprzedawanie przedmiotu Boots of Travel.",
      "[*] Naprawiono rozmaite scenariusze, w których gracze mogli dowiedzieć się, czy wróg aktywował przedmiot Smoke of Deceit, gdy znajdował się we mgle wojny.",
      "[*] Naprawiono błąd powodujący, że premia od Alchemista polegająca na przyznaniu Aghanim's Scepter zawsze wyświetlała, że 1 przedmiot dano wrogowi.",
      "[*] Naprawiono błąd powodujący, że obrażenia z um. Quill Spray od Bristlebacka po ulepszeniu przez Aghanim's Scepter były zliczane jako odbite.",
      "[*] Naprawiono błąd umożliwiający osiągnięcie ujemnej wartości netto jako Dazzle poprzez umieszczenie w schowku przedmiotu Town Portal Scroll, zakup i umieszczenie tego przedmiotu na kurierze, a następnie (nie mając go na bohaterze) wielokrotny zakup i sprzedaż przedmiotu Boots of Travel, przekazanie przedmiotu Town Portal Scroll od kuriera Dazzle'owi, po czym rzucenie um. Nothl Projection i użycie kuriera w celu dostarczenia przedmiotów Town Portal Scroll ze schowka do Dazzle'a, gdy aktywna była jego umiejętność ostateczna.",
      "[*] Naprawiono błąd powodujący, że um. Tar Bomb od Clinkza nie aktywowała przedmiotu Magic Wand, gdy ustawiono ją na autorzucanie.",
      "[*] Naprawiono błąd powodujący, że cena wykupu z aspektu Diabelska Oferta od Dooma nie była wyliczana poprawnie.",
      "[*] Talent 20 poziomu: naprawiono błąd powodujący, że efekt True Sight z um. Sharpshooter od Hoodwink miała martwy punkt w polu widzenia w swoim torze lotu.",
      "[*] Naprawiono błąd powodujący, że pierwsze trafienie um. Echo Slash od Keza nie było w stanie aktywować premii z aspektu Cienisty Jastrząb, jeżeli została użyta podczas niewidzialności.",
      "[*]  Naprawiono błąd powodujący, że talent Kunkki na 25. poziomie zwiększający obszar działania czarów nie był prawidłowo stosowany do um. Tidebringer.",
      "[*] Naprawiono błąd powodujący, że um. Howl oraz Feral Impulse od Lycana nie były poprawnie stosowane do um. Summon Wolves po ulepszeniu przez Aghanim's Shard.",
      "[*] Naprawiono błąd powodujący, że um. Skewer od Magnusa nie niszczyła drzew, jeśli Magnus nie miał Aghanim's Shard.",
      "[*] Naprawiono błąd powodujący, że um. Rebound od Marci była w nieprawidłowy sposób anulowana, gdy była pod wpływem um. Pounce od Slarka i niewrażliwości na negatywne efekty.",
      "[*] Naprawiono błąd powodujący, że celowanie wektorowe um. Rebound od Marci było niedokładne, jeśli docelowa lokalizacja znajdowała się za blisko celu um. Rebound.",
      "[*] Naprawiono błąd powodujący, że um. Venomous Valley od Medusy działała na iluzje, gdy um. Split Shot była aktywna.",
      "[*] Naprawiono błąd powodujący, że aktywna umiejętność przedmiotu Gleipnir aktywowała ogłuszenie z um. Spiked Carapace od Nyx Assassina.",
      "[*] Naprawiono błąd powodujący, że regeneracja zdrowia z talentu z 15. poziomu u Muerty nie trwała przez cały czas trwania um. The Calling, jeśli wybrany był również aspekt Taniec Umarłych.",
      "[*] Naprawiono błąd powodujący, że um. Deluge od Naga Siren ustawiała maksymalną oraz minimalną szybkość wroga na 240 jednostek.",
      "[*] Naprawiono błąd powodujący, że negatywny efekt z um. Fortune Favors the Bold od Pangoliera był widoczny na wrogach, gdy wrogowie nie widzieli Pangoliera.",
      "[*] Naprawiono błąd powodujący, że um. Phase Shift od Pucka wstrzymywała nietykalność, ale nie inkantację przy korzystaniu z pewnych przedmiotów.",
      "[*] Naprawiono błąd powodujący, że um. Puckish od Pucka nieprawidłowo uznawała wszystkie pociski rozłączone z użyciem niewidzialności jako pociski z czarów, przywracając więcej many i zdrowia, niż było to zamierzone.",
      "[*] Naprawiono błąd powodujący, że um. Static Link od Razora nieprawidłowo wyświetlała stan alternatywnego rzutu po uzyskaniu Aghanim's Shard.",
      "[*] Naprawiono błąd powodujący, że um. Tricks of the Trade od Rikiego zatrzymywała ataki oraz nietykalność, ale nie inkantację, gdy używane były pewne przedmioty.",
      "[*] Naprawiono błąd powodujący, że Slardar w niezamierzony sposób otrzymywał dodatkowe asysty z utworzonych przez siebie kałuż.",
      "[*] Naprawiono błąd powodujący, że um. Meld od Templar Assassin nie była stosowana do obu ataków, jeśli użyto jej dwukrotnie w krótkim odstępie czasu.",
      "[*] Naprawiono błąd powodujący, że um. Focus Fire od Windranger była wstrzymywana, jeśli traciła oraz odzyskiwała cel w polu widzenia, znajdując się pod wpływem efektu um. Windrun po ulepszeniu przez Aghanim's Scepter.",
      "[*] Naprawiono błąd powodujący, że um. Splinter Blast od Winter Wyvern tworzyła odłamki pocisków za niewidzialne jednostki wokół celu trafionego początkowym pociskiem.",
      "[*] Naprawiono błąd powodujący, że odłamki z pocisku um. Splinter Blast od Winter Wyvern nie odłączały się prawidłowo od niewidzialnych jednostek, jeśli cel trafiony przez początkowy pocisk widział niewidzialną jednostkę.",
      "[*] Naprawiono błąd powodujący, że um. Death Ward od Witch Doctora po ulepszeniu przez Aghanim's Scepter nieprawidłowo nakładała 50% premii do celności na odbity pocisk.",
      "[*] Naprawiono błąd powodujący, że iluzje Vengeful Spirit z um. Vengeance Aura po ulepszeniu przez Aghanim's Scepter były natychmiastowo zabijane przez dręczyciela, gdy rzucały one um. Wave of Terror z daleka.",
      "[*] Naprawiono opis um. Heavenly Jump od Zeusa, który nie odzwierciedlał prawidłowo zwiększenia obszaru widzenia, jakie Zeus zyskuje po skoku.",
      "[*] Tryb Ability Draft: naprawiono błąd powodujący, że Pangolier mógł otrzymać um. Roll Up, nie dobierając wcześniej um. Rolling Thunder.",
      "[*] Tryb Ability Draft: naprawiono błąd powodujący, że Kez mógł otrzymać umiejętności dla swojego sai bez dobierania ich.",
      "[/list]"
    ],
    "commentcount": 223,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 5399,
    "votedowncount": 621,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746774285,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5399,
  "votes_down": 621,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597739399545004",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}