{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Ігроладне оновлення 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ігроладне оновлення 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "Оновлення 7.38c вийшло, і про всі зміни можна дізнатися [url=https://www.dota2.com/patches/7.38c]ось тут[/url].",
      "Також за останні дні ми виправили такі проблеми:",
      "[list]",
      "[*] Додано пропущений рядок «З Рошана більше не випадає Благословення Аґаніма» з нотаток до оновлення 7.38.",
      "[*] Виправлено помилку, через яку Мучитель з’являвся над героєм гравця на 15-й хвилині в демоверсії ландшафту.",
      "[*] Виправлено помилку, через яку команда -createhero іноді створювала героя без грані.",
      "[*] Виправлено помилку, через яку журнал бою показував невидимих ворогів, які застосовували подвійні портали.",
      "[*] Виправлено помилку, через яку позиція героя чи кут оберту його моделі могли застрягнути, якщо анімація хапання Рошаном переривалася.",
      "[*] Виправлено помилку, через яку тривалість руни пришвидшення не змінювалася як слід під час рунного циклу.",
      "[*] Виправлено помилку, через яку можна було генерувати нескінченну кількість сувоїв телепортації шляхом купівлі та продажу Мандрівних черевиків (Boots of Travel).",
      "[*] Виправлено різні ситуації, коли гравці могли з’ясувати, чи їхні вороги використали Дим омани (Smoke of Deceit) в тумані війни.",
      "[*] Виправлено помилку, через яку ефект дарування Скіпетра Аґаніма в Алхіміка завжди показувався, ніби він давав 1 скіпетр ворогам.",
      "[*] Виправлено помилку, через яку шкода Хмари голок (Quill Spray) від Скіпетра Аґаніма в Бронеспина вважалася віддзеркаленою шкодою.",
      "[*] Виправлено можливість отримати негативний баланс на Дазлі, якщо покласти сувій телепортації в сховок, купити сувій телепортації кур'єром, не мати сувоїв телепортації на своєму герої, кількаразово купити та продати Мандрівні черевики (Boots of Travel), передати сувій телепортації від свого кур’єра Дазлу, застосувати Нотльською проекцією (Nothl Projection), а потім скористатися кур’єром для доставки сувоїв у сховку до Дазла під час дії ультимативної здібності.",
      "[*] Виправлено помилку, через яку Смоляна бомба (Tar Bomb) Клінкза з автозастосуванням не викликала спрацювання Чарівного жезла (Magic Wand).",
      "[*] Виправлено помилку, через яку викуп із Диявольською угодою (Devil's Bargain) Доленосця не працював як слід.",
      "[*] Виправлено помилку, через яку талант 20-го рівня Каптурниці давав неповну видимість на шляху істинного зору від Прицільного пострілу (Sharpshooter).",
      "[*] Виправлено помилку, через яку перший удар Лунким ривком (Echo Slash) Боривітра не викликав спрацювання бонуса від грані Тіньовий сокіл, коли здійснювався з невидимості.",
      "[*]  Виправлено помилку, через яку талант 25-го рівня в Кунки не збільшував радіус дії Погонича хвиль (Tidebringer) належним чином.",
      "[*] Виправлено помилку, через яку Завивання (Howl) та Дикий порив (Feral Impulse) Лікантропа не застосовувалися належним чином на вовків від Скіпетра Аґаніма.",
      "[*] Виправлено помилку, через яку Рожен (Skewer) Маґнуса не знищував дерева, якщо Маґнус не мав Уламка Аґаніма.",
      "[*] Виправлено помилку, через яку Перескок (Rebound) Марсі переривався під дією імунітету до негативних ефектів у разі застосування Наскоку (Slark) Сларка.",
      "[*] Виправлено помилку, через яку векторне націлювання Перескоку (Rebound) було неправильним, якщо місце приземлення містилося надто близько до цілі здібності.",
      "[*] Виправлено помилку, через яку Згубний залп (Venomous Volley) Медузи працював і на ілюзіях з активним Роздільним пострілом (Split Shot).",
      "[*] Виправлено помилку, через яку активний ефект Ґлейпніра (Gleipnir) викликав приголомшення від Шипованого карапаксу (Spiked Carapace) Нікса-Вбивці.",
      "[*] Виправлено помилку, через яку регенерація від таланту 15-го рівня в Муерти з гранню Танок мертвих не тривала весь час разом із Покликом (The Calling).",
      "[*] Виправлено помилку, через яку Повінь (Deluge) Наґи-Сирени змінювала на 240 не лише максимальну швидкість ворога, а й мінімальну.",
      "[*] Виправлено помилку, через яку ефект від здібності Фортуна посміхається зухвалому (Fortune Favors the Bold) у Панґольєра показувався на ворогах, коли сам герой перебував за межами видимості.",
      "[*] Виправлено помилку, через яку використання певних предметів переривало невразливість від Міжвимірного стрибка (Phase Shift) Пака, але не чаклування цієї здібності.",
      "[*] Виправлено помилку, через яку Пакство (Puckish) Пака помилково вважало всі снаряди, які вдалося уникнути за допомогою невидимості, снарядами від здібності, через що відновлювалося забагато здоров’я та мани.",
      "[*] Виправлено помилку, через яку Статичний зв’язок (Static Link) Леза з Уламком Аґаніма показувався в стані альтернативного застосування.",
      "[*] Виправлено помилку, через яку використання певних предметів зупиняло атаки та невразливість від Професійних хитрощів (Tricks of the Trade) Рікі, але не зупиняло чаклування.",
      "[*] Виправлено помилку, через яку Слардар хибно отримував підмоги у вбивствах, здійснених у створених ним калюжах.",
      "[*] Виправлено помилку, через яку в разі швидкого послідовного застосування Злиття (Meld) Тамплієра-Вбивці покращувалася лише одна атака.",
      "[*] Виправлено помилку, через яку Вітряна Лучниця переставала атакувати ціль Зосередженого вогню (Focus Fire), якщо тимчасово втрачала огляд цілі під дією ефекту від її Вітробігу (Windrun) зі Скіпетром Аґаніма.",
      "[*] Виправлено помилку, через яку Скалковий вибух (Splinter Blast) Зимової Віверни створював снаряди уламків для невидимих істот навколо основної цілі.",
      "[*] Виправлено помилку, через яку снаряди уламків Скалкового вибуху (Splinter Blast) Зимової Віверни летіли в невидимих істот, яких бачила основна ціль.",
      "[*] Виправлено помилку, через яку на снаряди-відскоки Смертеварда (Death Ward) Знахаря зі Скіпетром Аґаніма не діяли 50% додаткової влучності.",
      "[*] Виправлено помилку, через яку мучитель миттєво вбивав ілюзію Мстивої Душі від Скіпетра Аґаніма, якщо вона застосовувала Хвилю страху (Wave of Terror) здалеку.",
      "[*] Виправлено помилку, через яку в описі Небесного стрибка (Heavenly Jump) Зевса хибно показувалося збільшення радіуса огляду під час стрибка.",
      "[*] Ability Draft: виправлено помилку, через яку Панґольєр здобував Підкот (Roll Up) від Уламка Аґаніма, навіть якщо не брав собі Громокат (Rolling Thunder).",
      "[*] Ability Draft: виправлено помилку, через яку Боривітер здобував здібності саїв Шодо, навіть якщо не брав їх собі.",
      "[/list]"
    ],
    "commentcount": 223,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 5399,
    "votedowncount": 621,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746774285,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5399,
  "votes_down": 621,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597739399545004",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}