{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização de jogabilidade 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Atualização de jogabilidade 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "A atualização 7.38c já está disponível e podes ler as notas [url=https://www.dota2.com/patches/7.38c]aqui[/url].",
      "Ao longo dos últimos dias, também corrigimos os seguintes problemas:",
      "[list]",
      "[*] Foi adicionada uma nota ausente da atualização 7.38: \"O Roshan já não deixa para trás um Aghanim's Blessing\".",
      "[*] Foi corrigido um problema onde um Tormentor podia surgir em cima do herói do jogador aos 15 minutos da partida ao testar um terreno no modo de demonstração.",
      "[*] Foi corrigido um problema onde o comando \"-createhero\" podia criar um herói sem Facetas.",
      "[*] Foi corrigido um problema onde o histórico de combate incluía a concentração não visível de Portais Geminados por inimigos.",
      "[*] Foi corrigido um problema onde a posição ou o ângulo de um herói podiam ficar presos se a animação de agarrar do Roshan fosse interrompida.",
      "[*] Foi corrigido um problema onde a duração da runa de Aceleração não era melhorada de acordo com o ciclo de runas.",
      "[*] Foi corrigido um caso onde era possível gerar Town Portal Scrolls infinitos ao comprar e depois vender Boots of Travel.",
      "[*] Foram corrigidos vários cenários onde os jogadores podiam saber se um inimigo ativou Smoke of Deceit enquanto estivesse na área da névoa de guerra.",
      "[*] Alchemist: foi corrigido um problema visual onde o buff da interação com Aghanim's Scepter era sempre exibido como se um Scepter tivesse sido oferecido a inimigos.",
      "[*] Bristleback: foi corrigido um problema onde o dano de Quill Spray com Aghanim's Scepter era considerado dano refletido.",
      "[*] Dazzle: foi corrigido um caso onde era possível ter um valor líquido negativo ao guardar um Town Portal Scroll na arca, comprar um Town Portal Scroll no estafeta, não ter nenhum Town Portal Scroll no herói, comprar e vender Boots of Travel várias vezes, dar o Town Portal Scroll no estafeta ao Dazzle, usar Nothl Projection e depois usar o estafeta para entregar os Town Portal Scrolls na arca ao Dazzle enquanto o Ultimate estivesse ativo.",
      "[*] Clinkz: foi corrigido um problema onde Tar Bomb não ativava Magic Wand se estivesse no modo de uso automático.",
      "[*] Doom: foi corrigido um problema com a Faceta \"Devil's Bargain\", que fazia com que o preço para reentrar em jogo fosse calculado incorretamente.",
      "[*] Hoodwink: foi corrigido um problema com o talento de nível 20 \"Sharpshooter concede visão durante preparação\", que não revelava um certo ponto no campo de visão.",
      "[*] Kez: foi corrigido um problema onde o primeiro golpe de Echo Slash não ativava o bónus de Shadowhawk se ocorresse enquanto o Kez estivesse invisível.",
      "[*]  Kunkka: foi corrigido um problema com o talento de nível 25 \"+100 à área de habilidades\", cujo efeito não era aplicado corretamente à habilidade Tidebringer.",
      "[*] Lycan: foi corrigido um problema com as habilidades Howl e Feral Impulse, cujos efeitos não eram aplicados corretamente aos lobos melhorados por Aghanim's Shard.",
      "[*] Magnus: foi corrigido um problema onde a habilidade Skewer não destruía árvores se o Magnus não tivesse um Aghanim's Shard.",
      "[*] Marci: foi corrigido um caso onde Rebound era cancelado incorretamente se a Marci estivesse imune a debuffs e afetada por Pounce (do Slark).",
      "[*] Marci: foi corrigido o funcionamento da seleção de Rebound se o local do alvo estivesse demasiado próximo do alvo de Rebound.",
      "[*] Medusa: foi corrigido um problema onde ilusões eram afetadas pela Faceta \"Venomous Volley\" enquanto Split Shot estivesse ativo.",
      "[*] Nyx Assassin: foi corrigido um caso onde a habilidade ativa de Gleipnir ativava o atordoamento de Spiked Carapace.",
      "[*] Muerta: foi corrigido um problema com o talento de nível 15 \"The Calling: +3% de regeneração de vida máxima dentro da área\", que não funcionava ao longo da duração total se a Faceta \"Dance of the Dead\" tivesse sido selecionada.",
      "[*] Naga Siren: foi corrigido um problema com a Faceta \"Deluge\", que mudava a rapidez máxima e mínima de um inimigo para 240.",
      "[*] Pangolier: foi corrigido um problema com a habilidade Inata \"Fortune Favors the Bold\", cujo debuff era visível em inimigos se não tivessem visão sobre o Pangolier.",
      "[*] Puck: foi corrigido um problema onde Phase Shift interrompia a invulnerabilidade, mas não a concentração, ao usar certos itens.",
      "[*] Puck: foi corrigido um problema com a habilidade Inata \"Puckish\", onde todos os projéteis evitados enquanto invisível eram considerados projéteis de feitiços, restaurando mais mana e vida do que o pretendido.",
      "[*] Razor: foi corrigido um problema onde Static Link aparecia incorretamente com o estado de uso alternativo ao obter um Aghanim's Shard.",
      "[*] Riki: foi corrigido um problema onde Tricks of the Trade interrompia os ataques e a invulnerabilidade, mas não a concentração, ao usar certos itens.",
      "[*] Slardar: foi corrigido um problema onde eram atribuídas assistências incorretamente a este herói graças a poças de água que criou.",
      "[*] Templar Assassin: foi corrigido um problema onde o efeito de Meld não se aplicava a ambos os ataques se Meld tivesse sido usado duas vezes em rápida sucessão.",
      "[*] Windranger: foi corrigido um problema onde Focus Fire era interrompido se a Windranger perdesse um alvo de vista e voltasse a vê-lo enquanto sob o efeito de Windrun com Aghanim's Scepter.",
      "[*] Winter Wyvern: foi corrigido um problema com a habilidade Splinter Blast, que criava estilhaços para unidades invisíveis perto do alvo atingido pelo projétil inicial.",
      "[*] Winter Wyvern: foi corrigido um problema onde os estilhaços de Winter Blast não evitavam unidades invisíveis corretamente se o alvo atingido pelo projétil inicial tivesse visão sobre essas unidades invisíveis.",
      "[*] Witch Doctor: foi corrigido um problema onde projéteis ressaltados de Death Ward com Aghanim's Scepter não tinham uma probabilidade de 50% de ignorar efeitos de evasão.",
      "[*] Vengeful Spirit: foi corrigido um caso onde a ilusão de Vengeance Aura com Aghanim's Scepter era morta instantaneamente por Tormentors ao usar Wave of Terror de longe.",
      "[*] Zeus: foi corrigido um problema com a descrição de Heavenly Jump, que não refletia corretamente aumentos de áreas de efeito ao raio da visão que Zeus ganha depois de saltar.",
      "[*] Seleção de Habilidades: foi corrigido um caso onde o Pangolier tinha acesso a Roll Up (habilidade concedida por Aghanim's Shard) sem ter selecionado Rolling Thunder.",
      "[*] Seleção de Habilidades: foi corrigido um caso onde o Kez tinha acesso a habilidades de punhais Sai sem as ter selecionado.",
      "[/list]"
    ],
    "commentcount": 218,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 4878,
    "votedowncount": 561,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746064320,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4877,
  "votes_down": 562,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597739399545004",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}