{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Spilopdatering 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Spilopdatering 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "Spilopdatering 7.38c er ude nu, og du kan se ændringerne [url=https://www.dota2.com/patches/7.38c]her[/url].",
      "Derudover har vi i løbet af de sidste par dage rettet følgende problemer:",
      "[list]",
      "[*] Tilføjede manglende linje fra spilopdatering 7.38: \"Roshan smider ikke længere Aghanim's Blessing\".",
      "[*] Rettede, at plageånden dukkede op ovenpå spillerens helt på minut 15 ved afprøvning af terræn.",
      "[*] Rettede, at -createhero nogle gange skabte en helt uden en facet.",
      "[*] Rettede, at kamploggen viste ikke-synlige fjenders kanalisering af Tvillingeporte.",
      "[*] Rettede, at en helts position eller modelvinkel sad fast, hvis Roshans grebsanimation blev afbrudt.",
      "[*] Rettede, at varigheden på hasteruner ikke blev opgraderet korrekt i runecyklussen.",
      "[*] Rettede, at man kunne generere et uendeligt antal Town Portal Scrolls ved at købe og derefter sælge Boots of Travel.",
      "[*] Rettede forskellige scenarier, hvor spillere kunne finde ud af, om en fjende aktiverede Smoke of Deceit i krigstågen.",
      "[*] Rettede, at Alchemists styrkelse fra Aghanim's Scepter altid blev vist, som om fjender var blevet givet 1 Scepter.",
      "[*] Rettede, at skade fra Bristlebacks Quill Spray med Aghanim's Scepter talte som reflekteret skade.",
      "[*] Rettede, at man kunne få negativ nettoværdi på Dazzle ved at lægge en Town Portal Scroll til lageret, købe en Town Portal Scroll på sin kurér, ikke at have en Town Portal Scroll på sin helt, købe og sælge Boots of Travel flere gange, give Town Portal Scroll på kuréren til Dazzle, bruge Nothl Projection og derefter bruge kuréren til at levere ens Town Portal Scrolls fra lageret til Dazzle, mens ultimate-evnen var aktiv.",
      "[*] Rettede, at Clinkz' Tar Bomb ikke udløste Magic Wand, når den blev sat til autokast.",
      "[*] Rettede, at tilbagekøb med Dooms Devil's Bargain blev beregnet forkert.",
      "[*] Rettede, at Hoodwinks level 20-talent \"Sharpshooter giver udsyn under ladning\" havde et blindt punkt på stien.",
      "[*] Rettede, at det første angreb med Kez' Echo Slash ikke kunne udløse Shadowhawks bonus ved brug fra usynlighed.",
      "[*]  Rettede, at Kunkkas level 25-talent om effektområde ikke blev påført korrekt på Tidebringer.",
      "[*] Rettede, at Lycans Howl og Feral Impulse ikke blev påført korrekt på ulve fra Aghanim's Shard.",
      "[*] Rettede, at Magnus' Skewer ikke ødelagde træer, hvis Magnus ikke havde en Aghanim's Shard.",
      "[*] Rettede, at Marcis Rebound blev fejlagtigt afbrudt under påvirkning af Slarks Pounce og svækkelsesimmunitet.",
      "[*] Rettede, at vektorvalg med Marcis Rebound var unøjagtigt, hvis målområdet var for tæt på målet for Rebound.",
      "[*] Rettede, at Medusas Venomous Volley fungerede på illusioner, når Split Shot var aktiv.",
      "[*] Rettede, at Gleipnirs aktive evne udløste lammelse fra Nyx Assassins Spiked Carapace.",
      "[*] Rettede, at Muertas level 15-talent om HP-regenerering i The Calling ikke varede i hele varigheden, når den blev brugt sammen med facetten Dance of the Dead.",
      "[*] Rettede, at Naga Sirens Deluge satte fjenders mindste og maksimale hastighed til 240.",
      "[*] Rettede, at svækkelsen fra Pangoliers Fortune Favors the Bold var synlig på fjender, når de ikke kunne se Pangolier.",
      "[*] Rettede, at Pucks Phase Shift stoppede usårlighed, men ikke kanalisering, ved brug af visse genstande.",
      "[*] Rettede, at Pucks Puckish fejlagtigt regnede alle projektiler, som blev undveget med usynlighed, som besværgelsesprojektiler, hvilket gendannede mere mana og HP end tilsigtet.",
      "[*] Rettede, at Razors Static Link fejlagtigt viste en alternativ tilstand, når han fik Aghanim's Shard.",
      "[*] Rettede, at Rikis Tricks of the Trade stoppede angreb og usårlighed, men ikke kanalisering, ved brug af visse genstande.",
      "[*] Rettede, at Slardar utilsigtet fik yderligere assisterede drab fra vandpytter, han havde lavet.",
      "[*] Rettede, at Templar Assassins Meld ikke blev påført på begge angreb, hvis Meld blev brugt to gange hurtigt efter hinanden.",
      "[*] Rettede, at Windrangers Focus Fire stoppede, hvis hendes mål forsvandt ud af syne og kom tilbage igen, mens hun var påvirket af Windrun med Aghanim's Scepter.",
      "[*] Rettede, at Winter Wyverns Splinter Blast skabte sekundære projektiler for usynlige enheder rundt om det mål, som blev ramt af det oprindelige projektil.",
      "[*] Rettede, at sekundære projektiler fra Winter Wyverns Splinter Blast ikke undveg usynlige enheder korrekt, hvis det mål, som blev ramt af det oprindelige projektil, havde udsyn over den usynlige enhed.",
      "[*] Rettede, at Witch Doctors Death Ward med Aghanim's Scepter ikke påførte 50% ekstra nøjagtighed korrekt på det rikochetterende projektil.",
      "[*] Rettede, at illusionen fra Vengeful Spirit med Aghanim's Scepter blev dræbt med det samme af plageånder ved brug af Wave of Terror på afstand.",
      "[*] Rettede, at beskrivelsen af Zeus' Heavenly Jump ikke korrekt afspejlede forøgelser af effektområdet for den udsynsradius, Zeus fik efter hop.",
      "[*] Ability Draft: Rettede, at Pangolier fik Aghanim's Shard-opgraderingen Roll Up uden at vælge Rolling Thunder.",
      "[*] Ability Draft: Rettede, at Kez fik Shodo Sai-evner uden at vælge dem.",
      "[/list]"
    ],
    "commentcount": 223,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 5399,
    "votedowncount": 621,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746774285,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5399,
  "votes_down": 621,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597739399545004",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}