{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Mise à jour du gameplay 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mise à jour du gameplay 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "La mise à jour 7.38 a été publiée. Cliquez [url=https://www.dota2.com/patches/7.38c]ici[/url] pour accéder aux notes de cette mise à jour.",
      "Nous avons également corrigé les problèmes suivants au cours de ces derniers jours.",
      "[list]",
      "[*] Ajout de la note de mise à jour « Roshan ne lâche plus Aghanim's Blessing » qui était absente des notes de mise à jour du gameplay 7.38.",
      "[*] Correction du problème suivant : le fossoyeur apparaissait au-dessus de l'unité héroïque après 15 minutes lors d'un essai de terrain.",
      "[*] Correction du problème suivant : la commande « -createhero » créait parfois une unité héroïque sans facette.",
      "[*] Correction du problème suivant : le journal de combat affichait la canalisation avant téléportation d'un portail à l'autre pour les unités non visibles.",
      "[*] Correction du problème suivant : si l'animation de Roshan était interrompue alors qu'il venait d'attraper une unité héroïque, l'angle ou la position de cette dernière pouvaient se figer.",
      "[*] Correction du problème suivant : le bonus de durée des runes de Haste par cycle n'était pas appliqué correctement.",
      "[*] Correction de la faille suivante : il était possible de générer des Town Portal Scrolls à l'infini en achetant puis en revendant les Boots of Travel.",
      "[*] Correction du problème suivant : il était parfois possible de savoir si une unité adverse avait utilisé Smoke of Deceit au sein du brouillard de guerre.",
      "[*] Correction du problème suivant : l'effet positif de don de l'Aghanim's Scepter d'Alchemist était toujours affiché comme si un exemplaire avait été donné aux membres de l'équipe ennemie.",
      "[*] Correction du problème suivant : les dégâts infligés par Quill Spray de Bristleback avec l'Aghanim's Scepter comptaient comme des dégâts réfléchis.",
      "[*] Correction du problème suivant : Dazzle pouvait se retrouver avec une valeur d'or nette négative s'il envoyait un Town Portal Scroll vers la réserve, achetait un Town Portal Scroll pour le coursier, n'équipait pas de Town Portal Scroll, achetait et vendait des Boots of Travel plusieurs fois, se faisait livrer le Town Portal Scroll porté par le coursier, lançait Nothl Projection, puis utilisait le coursier pour se faire livrer les Town Portal Scrolls de la réserve alors que sa capacité ultime était active.",
      "[*] Correction du problème suivant : Tar Bomb de Clinkz ne déclenchait pas Magic Wand quand l'utilisation automatique était activée.",
      "[*] Correction du problème suivant : le rachat de Doom avec Devil's Bargain n'était pas calculé correctement.",
      "[*] Correction du problème suivant : la vision procurée par le talent de niveau 20 de Hoodwink « Sharpshooter accorde la vision pendant le chargement » était obstruée.",
      "[*] Correction du problème suivant : le premier coup d'Echo Slash de Kez ne déclenchait pas le bonus de Shadowhawk pendant l'invisibilité.",
      "[*]  Correction du problème suivant : le talent de niveau 25 de Kunkka « +100 de rayon pour les sorts » ne s'appliquait pas correctement à Tidebringer.",
      "[*] Correction du problème suivant : les effets de Howl et de Feral Impulse de Lycan n'étaient pas correctement appliqués aux loups de la capacité améliorée par l'Aghanim's Shard.",
      "[*] Correction du problème suivant : Skewer de Magnus ne détruisait pas les arbres si Magnus n'avait pas d'Aghanim's Shard.",
      "[*] Correction du problème suivant : Rebound de Marci était annulée de manière incorrecte lorsque la capacité était affectée par Pounce de Slark et que Marci était immunisée contre les effets négatifs.",
      "[*] Correction du problème suivant : le ciblage vectoriel de Rebound de Marci manquait de précision si l'emplacement ciblé était trop proche de la cible de Rebound.",
      "[*] Correction du problème suivant : Venomous Volley de Medusa fonctionnait sur les illusions quand Split Shot était activée.",
      "[*] Correction du problème suivant : la capacité active de Gleipnir déclenchait l'étourdissement de Spiked Carapace de Nyx Assassin.",
      "[*] Correction du problème suivant : le talent de Muerta de niveau 15 « The Calling : +3 de régén. de PV max. dans la zone » prenait fin prématurément avec la facette Dance of the Dead.",
      "[*] Correction du problème suivant : Deluge de Naga Siren fixait la vitesse min. et max. des unités ennemies à 240.",
      "[*] Correction du problème suivant : l'effet négatif de Fortune Favors the Bold de Pangolier était visible sur les unités ennemies qui n'avaient pas Pangolier dans leur champ de vision.",
      "[*] Correction du problème suivant : Phase Shift de Puck interrompait l'invisibilité, mais pas la canalisation lors de l'utilisation de certains objets.",
      "[*] Correction du problème suivant : Puckish de Puck considérait tous les projectiles évités en étant invisible comme des projectiles de sort, ce qui restaurait plus de mana et de PV que prévu.",
      "[*] Correction du problème suivant : Static Link de Razor affichait la capacité comme étant en utilisation secondaire lors de l'obtention de l'Aghanim's Shard.",
      "[*] Correction du problème suivant : Tricks of the Trade de Riki interrompait les attaques et la vulnérabilité mais pas la canalisation lors de l'utilisation de certains objets.",
      "[*] Correction du problème suivant : Slardar se voyait attribuer des coopérations supplémentaires grâce aux flaques qu'il avait créées.",
      "[*] Correction du problème suivant : Meld de Templar Assassin ne s'appliquait pas aux deux attaques si Meld était utilisée deux fois de suite.",
      "[*] Correction du problème suivant : Focus Fire de Windranger était interrompue si elle perdait de vue sa cible momentanément lorsqu'elle était sous l'effet de Windrun avec l'Aghanim's Scepter.",
      "[*] Correction du problème suivant : Splinter Blast de Winter Wyvern projetait des éclats sur les unités invisibles à proximité de la cible initiale.",
      "[*] Correction du problème suivant : les éclats de Splinter Blast de Winter Wyvern n'évitaient pas correctement les unités invisibles si celles-ci se trouvaient dans le champ de vision de la cible initiale.",
      "[*] Correction du problème suivant : Death Ward de Witch Doctor avec l'Aghanim's Scepter n'appliquait pas correctement le bonus de précision de 50 % au projectile rebondissant.",
      "[*] Correction du problème suivant : l'illusion de Vengeful Spirit créée par l'Aghanim's Scepter était tuée instantanément par le fossoyeur si elle lançait Wave of Terror alors qu'elle en était éloignée.",
      "[*] Correction du problème suivant : l'infobulle de Heavenly Jump ne reflétait pas correctement l'augmentation du rayon de la vision de Zeus après un bond.",
      "[*] Correction du problème suivant : en mode Ability Draft, Pangolier disposait de la capacité Roll Up accordée par l'Aghanim's Shard alors même qu'il n'avait pas sélectionné Rolling Thunder.",
      "[*] Correction du problème suivant : en mode Ability Draft, Kez obtenait les capacités de Shodo Sai alors même qu'il ne les avait pas sélectionnées.",
      "[/list]"
    ],
    "commentcount": 223,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 5399,
    "votedowncount": 621,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746774285,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5399,
  "votes_down": 621,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522350980353343",
  "clan_steamid_original": "103582791433224455"
}