{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Speluppdatering 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Speluppdatering 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "Uppdatering 7.38c är ute nu. Kolla in uppdateringsanteckningarna [url=https://www.dota2.com/patches/7.38c]här[/url].",
      "Under de senaste dagarna har vi dessutom tagit itu med följande problem:",
      "[list]",
      "[*] Lade till en rad som saknades i uppdateringsanteckningarna för speluppdatering 7.38: Roshan släpper inte längre Aghanim's Blessing.",
      "[*] Åtgärdade att tormentorer dök upp ovanpå spelarens hjälte i 15 minuter när man testade en terräng.",
      "[*] Åtgärdade att -createhero ibland skapade en hjälte utan fasett.",
      "[*] Åtgärdade att stridsloggen visade osynliga fienders tvillingportskanalisering.",
      "[*] Åtgärdade att en hjältes position eller hjältemodellvinkel kunde fastna om Roshans gripanimation avbröts.",
      "[*] Åtgärdade att varaktigheten på hastighetsrunor inte uppgraderades korrekt i runcykeln.",
      "[*] Åtgärdade att det gick att generera ett oändligt antal Town Portal Scroll genom att köpa och sedan sälja Boots of Travel.",
      "[*] Åtgärdade olika scenarier där spelarna kunde få reda på om en fiende aktiverade Smoke of Deceit i krigsdimman.",
      "[*] Åtgärdade att buffen som Alchemist får av Aghanim's Scepter alltid visades som om fienderna hade fått en Scepter.",
      "[*] Åtgärdade att skadan från Bristlebacks förmåga Quill Spray (med Aghanim's Scepter) räknades som reflekterad skada.",
      "[*] Åtgärdade att man kunde få negativt nettovärde på Dazzle genom att lägga till en Town Teleport Scroll i förrådet, köpa en Town Portal Scroll på kuriren, köpa och sälja Boots of Travel flera gånger, ge den Town Teleport Scroll som lagras hos kuriren till Dazzle, använda Nothl Projection och slutligen använda kuriren till att leverera alla Town Portal Scroll från förrådet till Dazzle när den ultimata förmågan är aktiv.",
      "[*] Åtgärdade att Clinkz förmåga Tar Bomb inte aktiverade Magic Wand när autoanvändande var aktiverat.",
      "[*] Åtgärdade att återköp med Dooms fasett Devil's Bargain beräknades felaktigt.",
      "[*] Åtgärdade att Hoodwinks nivå 20-talang (Sharpshooter ger sikt under kanalisering) hade en blind fläck i synfältet.",
      "[*] Åtgärdade att den första träffen från Kez förmåga Echo Slash inte utlöste fasetten Shadowhawks bonus om Kez var osynlig.",
      "[*]  Åtgärdade att Kunkkas nivå 25-talang för effektområde (AoE) inte fungerade korrekt med Tidebringer.",
      "[*] Åtgärdade att Lycans förmågor Howl och Feral Impulse inte fungerade korrekt med vargar från Aghanim's Shard.",
      "[*] Åtgärdade att Magnus förmåga Skewer inte förstörde träd om Magnus inte hade Aghanim's Shard.",
      "[*] Åtgärdade att Marcis förmåga Rebound blev felaktigt avbruten om hon var immun mot debuff eller påverkades av Slarks förmåga Pounce.",
      "[*] Åtgärdade att vektorinriktningsläget för Marcis förmåga Rebound var felaktigt justerat när målplatsen låg för nära det avsedda målet.",
      "[*] Åtgärdade att Medusas fasett Venomous Volley fungerade på illusioner om förmågan Split Shot var aktiv.",
      "[*] Åtgärdade att Glepnirs aktiva förmåga aktiverade bedövning från Nyx Assassins förmåga Spiked Carapace.",
      "[*] Åtgärdade att Muertas nivå 15-talang för regeneration inte varade under hela varaktigheten när den användes tillsammans med fasetten Dance of the Dead.",
      "[*] Åtgärdade att Naga Sirens förmåga Deluge satte fienders minimala och maximala hastighet på 240.",
      "[*] Åtgärdade att debuffen från Pangoliers förmåga Fortune Favors the Bold var synlig på fiender när fienden inte kunde se Pangolier.",
      "[*] Åtgärdade att Pucks förmåga Phase Shift stoppade osårbarheten, men inte kanaliseringen, när vissa föremål användes.",
      "[*] Åtgärdade att Pucks förmåga Puckish felaktigt räknade alla projektiler som avletts med hjälp av osynlighet som besvärjelseprojektiler, vilket återställde mer mana och HP än avsett.",
      "[*] Åtgärdade att Razors förmåga Static Link felaktigt visade alt-användningstillståndet när man först fick Aghanim's Shard.",
      "[*] Åtgärdade att Rikis förmåga Tricks of the Trade stoppade attacker och osårbarhet, men inte kanalisering, när vissa föremål användes.",
      "[*] Åtgärdade att Slardar oavsiktligt fick ytterligare assister från pölar som han hade skapat.",
      "[*] Åtgärdade att Templar Assassins förmåga Meld inte fungerade på båda attackerna om Meld användes två gånger i snabb följd.",
      "[*] Åtgärdade att Windrangers förmåga Focus Fire avbröts om hon tappade och återfick sikt på målet medan hon påverkades av effekten från Windrun med Aghanim's Scepter.",
      "[*] Åtgärdade att Winter Wyverns förmåga Splinter Blast skapade splitterprojektiler för osynliga enheter runt den målenhet som träffades av den första projektilen.",
      "[*] Åtgärdade att splitterprojektiler från Winter Wyverns förmåga Splinter Blast inte avleddes ordentligt från osynliga enheter om målet som träffades av den första projektilen hade sikt på den osynliga enheten.",
      "[*] Åtgärdade att projektiler från Witch Doctors förmåga Death Ward (med Aghanim's Scepter) inte fick 50 % extra träffsäkerhet.",
      "[*] Åtgärdade att Vengeful Spirits illusion med Aghanim's Scepter omedelbart dödades av tormentorer när man använde Wave of Terror på långt håll.",
      "[*] Åtgärdade att verktygstipset till Zeus förmåga Heavenly Jump inte beskrev ökningar av effektområdet för siktradien som Zeus får efter hopp.",
      "[*] Ability Draft: Åtgärdade att Pangolier fick Shard-uppgraderingen Roll Up utan att ha valt förmågan Rolling Thunder.",
      "[*] Ability Draft: Åtgärdade att Kez fick Shodo Shai-förmågor utan att ha valt dem.",
      "[/list]"
    ],
    "commentcount": 119,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 858,
    "votedowncount": 110,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1743185022,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 858,
  "votes_down": 110,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522350980353343",
  "clan_steamid_original": "103582791433224455"
}