{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Pelipäivitys 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Pelipäivitys 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "Katso päivitystiedot [url=https://www.dota2.com/patches/7.38c]täältä[/url].",
      "Tuore päivitys korjaa lisäksi useita pelaamiseen vaikuttaneita ongelmia.",
      "[list]",
      "[*] Lisättiin puuttunut rivi päivityksen 7.38 tiedoista: Roshan ei enää anna Aghanim's Blessingiä.",
      "[*] Korjattiin virhe, jonka vuoksi Piinaaja ilmestyi 15 minuutin kuluttua pelaajan sankarin päälle maastoa koeajettaessa.",
      "[*] Korjattiin virhe, jonka vuoksi -createhero saattoi unohtaa antaa luodulle sankarille kulmakiven.",
      "[*] Korjattiin virhe, jonka vuoksi taisteluloki kertoi sotasumussa olevien ja näkymättömien vihollisten Kaksoisporttien kanavoinnit.",
      "[*] Korjattiin virhe, jonka vuoksi sankari saattoi juuttua asemaansa tai animaatioonsa, jos Roshanin heittoanimaatio keskeytettiin.",
      "[*] Korjattiin virhe, jonka vuoksi nopeusriimun kesto ei kasvanut riimukierrosten kuluessa.",
      "[*] Korjattiin virhe, jonka vuoksi oli mahdollista luoda loputtomasti Town Portal Scrolleja ostamalla ja myymällä Boots of Traveleja.",
      "[*] Korjattiin erilaisia tilanteita, joiden avulla pelaajat saivat selville, kun heidän vihollisensa aktivoivat Smoke of Deceitin sotasumussa.",
      "[*] Korjattiin virhe, jonka vuoksi Alchemistin Aghanim's Scepter -päivitys näytti vihollisille aina liittolaisille annettujen Sceptereiden lukumääräksi yhden.",
      "[*] Korjattiin virhe, jonka vuoksi Bristlebackin Aghanim's Scepter -päivityksen Quill Sprayn vahinko laskettiin heijastetuksi vahingoksi.",
      "[*] Korjattiin virhe, jonka vuoksi oli mahdollista saada negatiivinen nettoarvo Dazzlelle laittamalla Town Portal Scroll säilöön, ostamalla toinen kuriirille samalla, kun sankarilla itsellään ei ole sellaista, ostamalla ja myymällä Boots of Traveleja useaan otteeseen, antamalla kuriirilla ollut Town Portal Scroll Dazzlelle, käyttämällä Nothl Projectionia ja sitten kuljettamalla säilössä ollut Town Portal Scroll Dazzlelle Nothl Projectionin aikana.",
      "[*] Korjattiin virhe, jonka vuoksi Clinkzin Tar Bomb ei erityiskäytöllä antanut Magic Wand -latauksia.",
      "[*] Korjattiin virhe, jonka vuoksi Doomin Devil's Bargain -kulmakiven lunastushinta laskettiin väärin.",
      "[*] Korjattiin virhe, jonka Hoodwinkin tason 20 Sharpshooterin näkökenttä -taitopäivitys sisälsi sokean pisteen lentoradalla.",
      "[*] Korjattiin virhe, jonka vuoksi Kezin Echo Slashin ensimmäinen osuma ei antanut Shadow Hawkin vaikutuksia näkymättömyydestä käytettäessä.",
      "[*]  Korjattiin virhe, jonka vuoksi Kunkan tason 25 vaikutusaluetaitopäivitys ei vaikuttanut Tidebringeriin.",
      "[*] Korjattiin virhe, jonka vuoksi Lycanin Howl ja Feral Impulse eivät vaikuttaneet Aghanim's Shard -päivityksen susiin.",
      "[*] Korjattiin virhe, jonka vuoksi Magnuksen Skewer ei tuhonnut puita, jos Magnuksella ei ollut Aghanim's Shardia.",
      "[*] Korjattiin virhe, jonka vuoksi Marcin Rebound peruuntui virheellisesti Slarkin Pouncen ja heikennysimmuniteetin samanaikaisesta vaikutuksesta.",
      "[*] Korjattiin virhe, jonka vuoksi Marcin Reboundin vektorikohdistus ei kohdistunut oikein, jos kohdesijainti oli liian lähellä Reboundin kohdetta.",
      "[*] Korjattiin virhe, jonka vuoksi Medusan Venomous Volley toimi harhoilla Split Shotin kanssa.",
      "[*] Korjattiin virhe, jonka vuoksi Gleipnirin aktiivinen kyky laukaisi Nyx Assassinin Spiked Carapacen tainnutuksen.",
      "[*] Korjattiin virhe, jonka vuoksi Muertan tason 15 Calling terveydenpalautuminen -taitopäivitys ei kestänyt tarpeeksi kauan Dance of the Dead -kulmakiven kanssa.",
      "[*] Korjattiin virhe, jonka vuoksi Naga Sirenin Deluge asetti vihollisen enimmäis- ja vähimmäisnopeudeksi 240.",
      "[*] Korjattiin virhe, jonka vuoksi viholliset näkivät Pangolierin Fortune Favors the Boldin heikennyksen, vaikka he eivät nähneet Pangolieria.",
      "[*] Korjattiin virhe, jonka vuoksi Puckin Phase Shift keskeytti tiettyjä esineitä käytettäessä haavoittumattomuuden, muttei kanavointia.",
      "[*] Korjattiin virhe, jossa Puckin Puckish huomioi kaikki näkymättömyydellä väistetyt ammukset loitsuammuksiksi, jonka vuoksi se palautti tarkoitettua enemmän terveyttä ja manaa.",
      "[*] Korjattiin virhe, jonka vuoksi Razorin Static Link näytti virheellisesti erityiskäyttötilan Aghanim's Shard -päivityksen yhteydessä.",
      "[*] Korjattiin virhe, jonka vuoksi Rikin Tricks of the Trade keskeytti tiettyjä esineitä käytettäessä hyökkäykset ja haavoittumattomuuden, muttei kanavointia.",
      "[*] Korjattiin virhe, jonka vuoksi Slardar sai tahattomasti lisäavustuksia luomistaan ​​lätäköistä.",
      "[*] Korjattiin virhe, jonka vuoksi Templar Assassinin Meld ei vaikuttanut molempiin hyökkäyksiin, jos kykyä käytettiin tarpeeksi nopeasti uudelleen.",
      "[*] Korjattiin virhe, jonka vuoksi Windrangerin Focus Fire pysähtyi, jos hän menetti näkyvyyden kohteeseensa ja sai sen takaisin ollessaan Aghanim's Scepterin päivittämän Windrunin vaikutuksen alaisena.",
      "[*] Korjattiin virhe, jonka vuoksi Winter Wyvernin Splinter Blast loi sirpaleita alkuperäisen ammuksen osumakohteen ympärillä oleviin näkymättömiin vihollisiin.",
      "[*] Korjattiin virhe, jonka vuoksi Winter Wyvernin Splinter Blastin sirpaleet osuivat yhä näkymättömiin vihollisiin, jos alkuperäisen ammuksen osumakohde näki ne.",
      "[*] Korjattiin virhe, jossa Witch Doctorin Aghanim's Scepter -päivitetty Death Ward ei antanut 50 %:n osumatarkkuutta kimmokeammuksille.",
      "[*] Korjattiin virhe, jonka vuoksi Vengeful Spiritin Aghanim's Scepter -päivityksen harha tuhoutui välittömästi, jos se käytti Wave of Terroria Piinaajaan tarpeeksi kaukaa.",
      "[*] Korjattiin Zeuksen Heavenly Jumpin kykykuvaus, joka ei kertonut vaikutusaluelisien vaikutuksesta loikasta saatavaan näkökenttään.",
      "[*] Kykyvalinta: korjattiin virhe, jonka vuoksi Pangolier sai Roll Upin Aghanim's Shardilla ilman Rolling Thunderia.",
      "[*] Kykyvalinta: korjattiin virhe, jonka vuoksi Kez sai Shodo Sai -kyvyn valitsematta sitä.",
      "[/list]"
    ],
    "commentcount": 218,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 4878,
    "votedowncount": 561,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746064320,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4877,
  "votes_down": 562,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597739399545004",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}