{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Aggiornamento di gioco 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aggiornamento di gioco 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "La patch 7.38c è ora disponibile e puoi consultarne le note [url=https://www.dota2.com/patches/7.38c]qui[/url].",
      "Inoltre, nel corso degli ultimi giorni abbiamo risolto i seguenti problemi:",
      "[list]",
      "[*] Aggiunta la riga mancante dalle note della patch 7.38 \"Roshan non lascia più cadere la Benedizione di Aghanim\".",
      "[*] Risolto il problema per cui Oppressore appariva sopra l'Eroe del giocatore dopo 15 minuti quando si testava il terreno in modalità demo.",
      "[*] Risolto il problema per cui il comando \"-createhero\" a volte creava un Eroe senza faccetta.",
      "[*] Risolto il problema per cui il registro dei combattimenti mostrava i nemici invisibili che si canalizzavano attraverso i Portali Gemelli.",
      "[*] Corretto un bug per cui un Eroe poteva rimanere bloccato in una certa posizione o il modello dell'Eroe poteva rimanere bloccato in una certa angolazione quando l'animazione del lancio di Roshan veniva interrotta.",
      "[*] Risolto il problema per cui la durata della Runa della Rapidità non si aggiornava correttamente con il ciclo delle Rune.",
      "[*] Risolto il problema per cui era possibile generare infinite Pergamene del Portale Cittadino acquistando e poi vendendo gli Stivali del Viaggiatore.",
      "[*] Risolti vari scenari in cui i giocatori potevano venire a sapere se un avversario usava Fumo del Raggiro nella nebbia di guerra.",
      "[*] Risolto il problema per cui l'effetto positivo di Alchemist, derivante dall'interazione con lo Scettro di Aghanim, veniva sempre visualizzato come se uno Scettro fosse stato conferito ai nemici.",
      "[*] Risolto il problema per cui il danno Getto di aculei di Bristleback modificato dallo Scettro di Aghanim veniva conteggiato come danno riflesso.",
      "[*] Risolto il problema per cui era possibile avere un valore netto negativo su Dazzle quando si inviava nella scorta una Pergamena del Portale Cittadino, si acquistava una Pergamena del Portale Cittadino per il corriere, l'Eroe non aveva alcuna Pergamena del Portale Cittadino, si compravano e si vendevano più volte gli Stivali del Viaggiatore, si dava la Pergamena del Portale Cittadino al corriere per Dazzle, si utilizzava la Proiezione di Nothl e poi si usava il corriere per consegnare le Pergamene del Portale Cittadino della scorta a Dazzle mentre l'abilità ultimate era attiva.",
      "[*] Risolto il problema per cui Bomba di catrame di Clinkz non attivava Bacchetta Magica quando impostata sul lancio automatico.",
      "[*] Risolto il problema per cui il rientro di Patto col diavolo di Condanna veniva calcolato in modo errato.",
      "[*] Risolto il problema per cui il talento di livello 20 Tiratrice scelta di Hoodwink causava a Vera Visione un punto cieco lungo il percorso.",
      "[*] Risolto il problema per cui il primo colpo di Eco risonante di Kez non poteva attivare il bonus di Falcombra se utilizzato durante l'invisibilità.",
      "[*]  Risolto il problema per cui il talento di livello 25 dell'incantesimo con area d'effetto di Kunkka non si applicava correttamente a Portatrice della marea.",
      "[*] Risolto il problema per cui Ululato e Impulso ferino di Lycan non si applicavano correttamente ai lupi del Frammento di Aghanim.",
      "[*] Risolto il problema per cui Infilzamento di Magnus non distruggeva gli alberi se Magnus non aveva un Frammento di Aghanim.",
      "[*] Risolto il problema per cui Rimbalzo di Marci veniva annullato erroneamente quando veniva colpito da Balzo di Slark ed era immune agli effetti negativi.",
      "[*] Risolto il problema per cui clicca e trascina di Rimbalzo di Marci era impreciso se la posizione del bersaglio era troppo vicina al bersaglio di Rimbalzo.",
      "[*] Risolto il problema per cui Raffica velenosa di Medusa funzionava sulle illusioni con Colpo diviso attivo.",
      "[*] Risolto il problema per cui Gleipnir attivava lo stordimento Carapace appuntito di Nyx Assassin.",
      "[*] Risolto il problema per cui il talento di livello 15 Rigenerazione di Muerta non durava fino alla fine se usato insieme alla faccetta Danza dei morti.",
      "[*] Risolto il problema per cui Diluvio di Naga Siren impostava la velocità massima e minima di un nemico su 240.",
      "[*] Risolto il problema per cui l'effetto negativo La fortuna aiuta gli audaci di Pangolier era visibile sui nemici quando questi non avevano la visione su Pangolier.",
      "[*] Risolto il problema per cui Spostamento di fase di Puck bloccava l'invulnerabilità ma non la canalizzazione quando si utilizzavano determinati oggetti.",
      "[*] Risolto il problema per cui Dispettoso di Puck considerava erroneamente come proiettili da incantesimo tutti quelli evitati grazie all'invisibilità, ripristinando più mana e salute di quanto previsto.",
      "[*] Risolto il problema per cui Collegamento statico di Razor mostrava erroneamente uno stato d'uso alternativo quando si otteneva il Frammento.",
      "[*] Risolto il problema per cui l'abilità Trucchi del mestiere di Riki bloccava gli attacchi e l'invulnerabilità ma non la canalizzazione quando si utilizzavano determinati oggetti.",
      "[*] Risolto il problema per cui Slardar riceveva involontariamente aiuti aggiuntivi dalle pozzanghere che aveva creato.",
      "[*] Risolto il problema per cui Mimetizzazione di Templar Assassin non si applicava a entrambi gli attacchi se Mimetizzazione veniva usata due volte in rapida successione.",
      "[*] Risolto il problema per cui Tiro focalizzato si interrompeva se Windranger perdeva e riacquistava la vista del bersaglio mentre era sotto l'effetto di Soffio di vento con lo scettro di Aghanim.",
      "[*] Risolto il problema per cui Colpo a frammenti di Winter Wyvern creava frammenti di proiettile per le Unità invisibili attorno al bersaglio colpito dal proiettile iniziale.",
      "[*] Risolto il problema per cui le Unità invisibili non evitavano come previsto i frammenti dei proiettili di Colpo a frammenti di Winter Wyvern se il bersaglio colpito dal proiettile iniziale aveva visione sull'Unità invisibile.",
      "[*] Risolto il problema per cui Guardiano della morte di Witch Doctor, quando potenziato dallo Scettro di Aghanim, non faceva aumentare del 50% la precisione del proiettile rimbalzato come previsto.",
      "[*] Risolto il problema per cui l'illusione con lo Scettro di Vengeful Spirit veniva uccisa istantaneamente da Oppressore quando si usava Onda di terrore da lontano.",
      "[*] Risolto il problema per cui la descrizione di Salto divino di Zeus non rifletteva correttamente gli incrementi dell'area d'effetto per il raggio della visione che Zeus guadagna dopo il salto.",
      "[*] Ability Draft: risolto il problema per cui Pangolier otteneva Appallottolamento tramite il miglioramento dello Scettro senza aver scelto Rombo di tuono.",
      "[*] Ability Draft: risolto il problema per cui Kez otteneva le abilità Sai Shodo senza averle scelte.",
      "[/list]"
    ],
    "commentcount": 223,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 5399,
    "votedowncount": 621,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746774285,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5399,
  "votes_down": 621,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597739399545004",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}