{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Spilloppdatering 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Spilloppdatering 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "Oppdatering 7.38c er ute nå, og du kan se endringsloggen [url=https://www.dota2.com/patches/7.38c]her[/url].",
      "I tillegg har vi i løpet av de siste dagene ordnet opp i følgende problemer:",
      "[list]",
      "[*] La til manglende linje i spilloppdatering 7.38: «Roshan slipper ikke lenger Aghanim's Blessing.»",
      "[*] Fikset at plageånder dukket opp på spillerens helt etter 15 minutter ved testing av et terreng.",
      "[*] Fikset at -createhero noen ganger opprettet en helt uten fasett.",
      "[*] Fikset at kamploggen viste ikke-synlige fienders kanalisering av tvillingporter.",
      "[*] Fikset at det var mulig for en helts posisjon eller modellvinkel å bli sittende fast hvis Roshans gripeanimasjon ble avbrutt.",
      "[*] Fikset at varigheten til hastverksrunen ikke ble oppgradert ordentlig med runesyklusen.",
      "[*] Fikset at man kunne generere uendelig med Town Portal Scroll ved å kjøpe og deretter selge Boots of Travel.",
      "[*] Fikset diverse scenarier der spillere kunne finne ut om fienden aktiverte Smoke of Deceit mens de var i krigståken.",
      "[*] Fikset at Alchemists styrkelse for tildelte Scepter alltid viste 1 for fiender.",
      "[*] Fikset at Bristlebacks skade fra Quill Spray med Aghanim's Scepter ble ansett som reflektert skade.",
      "[*] Fikset at man kunne få negativ nettoverdi på Dazzle ved å legge en Town Portal Scroll i forrådet, kjøpe en Town Portal Scroll på kureren, ikke ha en Town Portal Scroll på helten, kjøpe og selge Boots of Travel flere ganger, gi Town Portal Scroll på kuren til Dazzle, bruke Nothl Projection, og så få kureren til å levere Town Portal Scroll fra forrådet til Dazzle mens ultimaten er aktiv.",
      "[*] Fikset at Clinkz' Tar Bomb ikke utløste Magic Wand når den er satt til automatisk bruk.",
      "[*] Fikset at tilbakekjøp med Dooms Devil's Bargain ble feilberegnet.",
      "[*] Fikset at Hoodwinks talent på nivå 20, «Sharpshooter gir sikt under kanalisering», hadde en blindsone langs synsfeltet.",
      "[*] Fikset at første treff med Kez' Echo Slash ikke kunne utløse Shadowhawks bonus ved bruk fra usynlighet.",
      "[*]  Fikset at Kunkas talent for virkeområde på nivå 25 ikke ble påført riktig på Tidebringer.",
      "[*] Fikset at Lycans Howl og Feral Impulse ikke ble påført ordentlig på ulver fra Aghanim's Shard.",
      "[*] Fikset at Magnus' Skewer ikke ødelegger trær hvis Magnus ikke har en Aghanim's Shard.",
      "[*] Fikset at Marcis Rebound ble feilaktig avbrutt under påvirkning av Slarks Pounce og svekkelsesimmunitet.",
      "[*] Fikset at vektorvalg med Marcis Rebound var unøyaktig hvis målområdet var for nær målet for Rebound.",
      "[*] Fikset at Medusas Venomous Volley fungerte på illusjoner når Split Shot var aktiv.",
      "[*] Fikset at Gleipnirs aktive evnen utløste lammelse fra Nyx Assassins Spiked Carapace.",
      "[*] Fikset at Muertas talent for helseregenerasjon på nivå 15 ikke varte i hele varigheten når den ble brukt sammen med fasetten «Dance of the Dead».",
      "[*] Fikset at Naga Sirens Deluge satte fienders maks og minste bevegelseshastighet til 240.",
      "[*] Fikset at svekkelsen fra Pangoliers Fortune Favors the Bold var synlig på fiender når fienden ikke kunne se Pangolier.",
      "[*] Fikset at Pucks Phase Shift stoppet usårbarheten, men ikke kanalisering, ved bruk av enkelte gjenstander.",
      "[*] Fikset at Pucks Pukish feilaktig betraktet alle prosjektiler avledet ved bruk av usynlighet som formelprosjektiler, noe som gjenopprettet mer mana og helse enn tilsiktet.",
      "[*] Fikset at Razors Static Link feilaktig viste tilstanden for alternativt bruk når man først får Shard.",
      "[*] Fikset at Rikis Tricks of the Trade stoppet angrep og usårbarhet, men ikke kanaliseringen, ved bruk av enkelte gjenstander.",
      "[*] Fikset at Slardar utilsiktet fikk ytterligere medvirkninger fra pytter han laget.",
      "[*] Fikset at Templar Assassins Meld ikke ble påført begge angrepene hvis Meld ble brukt to ganger rett etter hverandre.",
      "[*] Fikset at Windrangers Focus Fire stoppet hvis hun mistet og så fikk sikt over målet sitt igjen under påvirkning av Windrun med Aghanim's Scepter.",
      "[*] Fikset at Winter Wyverns Splinter Blast skapte splintreprosjektiler for usynlige enheter rundt målet som ble truffet av det opprinnelige prosjektilet.",
      "[*] Fikset at splintreprosjektiler fra Winter Wyverns Splinter Blast ikke ble avledet ordentlig fra usynlige enheter hvis målet som ble truffet av det opprinnelige prosjektilet, har sikt over den usynlige enheten.",
      "[*] Fikset at Witch Doctors Death Ward med Scepter ikke ordentlig påførte 50 % ekstra treffsikkerhet på prosjektilet som spretter.",
      "[*] Fikset at Vengeful Spirits illusjon med Aghanim's Scepter ble umiddelbart drept av plageånder ved bruk av Wave of Terror fra langt unna.",
      "[*] Fikset at verktøytipset til Zeus' Heavenly Jump ikke gjenspeilte økninger av virkeområde til siktradiusen Zeus får etter hopp.",
      "[*] Ability Draft: Fikset at Pangolier fikk Shard-oppgraderingen Roll Up uten å velge Rolling Thunder.",
      "[*] Ability Draft: Fikset at Kez fikk Shodo Sai-evnene uten å velge dem.",
      "[/list]"
    ],
    "commentcount": 218,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 4878,
    "votedowncount": 561,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746064320,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4878,
  "votes_down": 561,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522350980353343",
  "clan_steamid_original": "103582791433224455"
}