{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Parche de jugabilidad 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Parche de jugabilidad 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "Lanzamos el parche de jugabilidad 7.38c y puedes consultar las notas del parche [url=https://www.dota2.com/patches/7.38c]aquí[/url].",
      "Además, en los últimos días abordamos los siguientes problemas:",
      "[list]",
      "[*] Se agregó la línea faltante en las notas del parche 7.38 \"Roshan ya no suelta Bendición de Aghanim\".",
      "[*] Se corrigió un problema que causaba que el Torturador apareciera por encima del héroe del jugador a los 15 minutos de la partida al probar un terreno.",
      "[*] Se corrigió un problema por el cual [i]-createhero[/i] algunas veces creaba un héroe sin faceta.",
      "[*] Se corrigió un problema por el cual el registro de combate mostraba la canalización invisible del enemigo de los Portales Gemelos.",
      "[*] Se corrigió un problema que hacía posible que el modelo de un héroe quedara atascado en un ángulo si se interrumpía la animación de agarre de Roshan.",
      "[*] Se corrigió un problema que impedía que la Runa de Rapidez se actualizara adecuadamente con cada ciclo de la runa.",
      "[*] Se corrigió un problema que permitía generar Pergaminos de Teletransporte infinitos al comprar y después vender las Botas de Viaje.",
      "[*] Se corrigieron varios escenarios donde los jugadores podían ver si su enemigo había activado un Humo del Engaño al estar dentro de Niebla de Guerra.",
      "[*] Se corrigió un problema que causaba que el efecto positivo del Cetro de Aghanim para Alchemist apareciera siempre como si hubiera otorgado un Cetro de Aghanim a los enemigos.",
      "[*] Se corrigió un problema por el cual el daño de Lluvia de Espinas de Bristleback con Cetro de Aghanim contaba como daño reflejado.",
      "[*] Se corrigió la posibilidad de llegar a un valor neto negativo con Dazzle al poner en la reserva un Pergamino de Teletransporte, comprar otro con tu mensajero sin que el héroe tuviera uno, comprar y vender las Botas de Viaje varias veces dándole el Pergamino de Teletransporte del mensajero a Dazzle, lanzar Proyección de Nothl y luego usar a tu mensajero para que entregara los pergaminos de la reserva a Dazzle mientras su habilidad definitiva estaba activa.",
      "[*] Se corrigió un problema que causaba que Bomba de Alquitrán de Clinkz no activara Varita Mágica en modo de lanzamiento automático.",
      "[*] Se corrigió un problema por el cual la resurrección de Pacto con el Diablo de Doom se calculara incorrectamente.",
      "[*] Se corrigió el talento de nivel 20 \"Tirador Certero proporciona Visión Verdadera de Hoodwink\" que contaba con un punto ciego en la ruta.",
      "[*] Se corrigió un problema que impedía que el golpe inicial de Corte Resonante de Kez activara la bonificación de Halcón de las Sombras cuando se usaba desde la invisibilidad.",
      "[*]  Se corrigió un problema por el cual el área de efecto de hechizos del talento de nivel 25 de Kunkka no se aplicaba correctamente a Clamamareas.",
      "[*] Se corrigió un problema por el cual Aullido e Impulso Feral de Lycan no se aplicaban correctamente a los lobos con el Fragmento de Aghanim.",
      "[*] Se corrigió un problema por el cual Ensartar de Magnus no destruía árboles si Magnus no tenía un Fragmento de Aghanim.",
      "[*] Se corrigió un problema por el cual Rebotar de Marci se cancelaba incorrectamente cuando se veía afectada por la habilidad Asalto de Slark y al estar inmune a efectos negativos.",
      "[*] Se corrigió la vectorización imprecisa Rebotar de Marci si la ubicación del objetivo estaba demasiado cerca del objetivo de Rebotar.",
      "[*] Se corrigió un problema por el cual Descarga Venenosa de Medusa afectaba a las ilusiones cuando Disparo Dividido estaba activado.",
      "[*] Se corrigió un problema por el cual la habilidad activa de Gleipnir activaba el aturdimiento de Caparazón Espinoso de Nyx Assassin.",
      "[*] Se corrigió un problema por el cual la regeneración del talento de nivel 15 dentro de La Invocación de Muerta no duraba hasta el final cuando se usaba con la faceta Danza de los Muertos.",
      "[*] Se corrigió un problema por el cual Diluvio de Naga Siren establecía la velocidad máxima y mínima de un enemigo en 240.",
      "[*] Se corrigió un problema por el cual el efecto negativo de La Fortuna Favorece a los Audaces de Pangolier era visible en los enemigos cuando el enemigo no tenía la visión de Pangolier.",
      "[*] Se corrigió un problema que causaba que Cambio de Fase de Riki detuviera los ataques y la invulnerabilidad, pero no la canalización al usar ciertos objetos.",
      "[*] Se corrigió un problema por el cual Típico de Puck de Puck consideraba incorrectamente todos los proyectiles desarticulados usando la invisibilidad como proyectiles de hechizos, restaurando más maná y vida de lo previsto.",
      "[*] Se corrigió un problema por el cual Vínculo Estático de Razor aparecía incorrectamente como un lanzamiento alternativo al obtener un Fragmento de Aghanim.",
      "[*] Se corrigió un problema por el cual Secretos del Oficio de Riki detenía los ataques y la invulnerabilidad, pero no la canalización al usar ciertos objetos.",
      "[*] Se corrigió un problema por el cual Slardar obtenía involuntariamente asistencias adicionales de los charcos que él creaba.",
      "[*] Se corrigió un problema por el cual Fusión de Templar Assassin no se aplicaba a ambos ataques si Fusión se usaba dos veces en sucesión rápida.",
      "[*] Se corrigió un problema por el cual Fuego Concentrado de Windranger se detenía si esta perdía y recuperaba la visión de su objetivo cuando estaba bajo el efecto de Correvientos con Cetro de Aghanim.",
      "[*] Se corrigió un problema por el cual Esquirla Explosiva de Winter Wyvern proyectaba fragmentos sobre unidades invisibles cerca del objetivo golpeado por el proyectil inicial.",
      "[*] Se corrigión un problema por el cual los proyectiles de Esquirla Explosiva de Winter Wyvern no evitaban correctamente a las unidades invisibles si estaban en el campo de visión del objetivo inicial.",
      "[*] Se corrigió un problema por el cual Guardián de la Muerte de Witch Doctor con Cetro de Aghanim no aplicaba correctamente el 50 % de precisión adicional al proyectil rebotado.",
      "[*] Se corrigió un problema que causaba que los Torturadores mataran instantáneamente la ilusión de Vengeful Spirit con Cetro de Aghanim cuando usaban Oleada de Terror desde lejos.",
      "[*] Se corrigió un problema con la descripción emergente de Salto Celestial de Zeus que no reflejaba correctamente los aumentos del área de efecto en el radio de visión que Zeus obtiene después de saltar.",
      "[*] Selección de habilidades: Se corrigió un problema que causaba que Pangolier tuviera acceso a Enrollar (habilidad otorgada por el Fragmento de Aghanim) sin haber seleccionado Trueno Rodante.",
      "[*] Selección de habilidades: Se corrigió un problema que causaba que Kez obtuviera las habilidades de Sai de los Shodo sin seleccionarlas.",
      "[/list]"
    ],
    "commentcount": 115,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 776,
    "votedowncount": 100,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1743175894,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 776,
  "votes_down": 99,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522350980353343",
  "clan_steamid_original": "103582791433224455"
}