{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualizarea de joc 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualizarea de joc 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "Actualizarea de joc 7.38c este acum disponibilă și poți consulta detaliile actualizării [url=https://www.dota2.com/patches/7.38c?l=romanian]aici[/url].",
      "În plus, pe parcursul ultimelor zile am remediat următoarele probleme:",
      "[list]",
      "[*] A fost adăugată pentru jurnalul actualizării 7.38 o mențiune care lipsea: „Roshan nu mai oferă Aghanim's Blessing atunci când e ucis”.",
      "[*] A fost remediată problema în care oprimatorul apărea deasupra eroului jucătorului la minutul 15 atunci când era folosit modul Demo pentru un teren.",
      "[*] A fost remediată problema în care comanda de chat „-createhero” crea uneori un erou fără fațetă.",
      "[*] A fost remediată problema în care jurnalul de luptă afișa inamicii nevizibili când foloseau portalurile gemene.",
      "[*] A fost remediată problema în care era posibil ca poziția sau unghiul de orientare al unui erou să se blocheze dacă animația lui Roshan de înșfăcare era întreruptă.",
      "[*] A fost remediată problema în care runa de iuțeală nu era îmbunătățită odată în funcție de ciclul runelor.",
      "[*] A fost remediată problema în care putea fi generat un număr infinit de obiecte Town Portal Scroll prin cumpărarea și vânzarea obiectului Boots of Travel.",
      "[*] Au fost remediate mai multe situații în care jucătorii puteau afla dacă inamicii au folosit Smoke of Deceit atunci când se aflau în ceața războiului.",
      "[*] A fost remediată problema în care efectul pozitiv primit de Alchimist pentru acordarea de obiecte Aghanim's Scepter afișa întotdeauna inamicilor faptul că eroul a acordat un singur Aghanim's Scepter.",
      "[*] A fost remediată problema în care daunele cauzate de abilitatea Quill Spray a lui Bristleback cu Aghanim's Scepter erau considerate ca fiind daune reflectate.",
      "[*] A fost remediată o problemă în care Dazzle putea ajunge la o valoare netă de aur negativă dacă acesta depozita un Town Portal Scroll, cumpără un Town Portal Scroll cu ajutorul curierului, nu avea niciun Town Portal Scroll asupra sa, cumpără și vindea de mai multe ori Boots of Travel, obiectul Town Portal Scroll aflat asupra curierului îi era transferat lui Dazzle, eroul invoca Nothl Projection, iar apoi se folosea de curier pentru a-i livra obiectele Town Portal Scroll depozitate în timp ce abilitatea supremă era activă.",
      "[*] A fost remediată problema în care Magic Wand nu genera încărcături atunci când abilitatea Tar Bomb a lui Clinkz era invocată cu ajutorul invocării automate.",
      "[*] A fost remediată problema în care fațeta Devil's Bargain a lui Doom nu calcula corect prețul de răscumpărare.",
      "[*] A fost remediată problema în care talentul de la nivelul 20 al eroinei Hoodwink care oferă vedere în timpul pregătirii pentru abilitatea Sharpshooter avea un unghi mort în câmpul său vizual.",
      "[*] A fost remediată problema în care prima lovitură cauzată de abilitatea Echo Slash a lui Kez nu putea declanșa bonusul oferit de fațeta Shadowhawk atunci când abilitatea era folosită din invizibilitate.",
      "[*]  A fost remediată problema în care talentul de la nivelul 25 al lui Kunkka care oferă zonă de efect bonus pentru vrăji nu era aplicat corect abilității Tidebringer.",
      "[*] A fost remediată problema în care efectele abilităților Howl și Feral Impulse ale lui Lycan nu erau aplicate corect lupilor creați de Aghanim's Shard.",
      "[*] A fost remediată problema în care abilitatea Skewer a lui Magnus nu putea distruge copacii dacă Magnus nu avea un Aghanim's Shard.",
      "[*] A fost remediată problema în care abilitatea Rebound a eroinei Marci era anulată în mod incorect atunci când eroina era imună la efecte negative și era afectată de abilitatea Pounce a lui Slark.",
      "[*] A fost remediată problema în care țintirea vectorială a abilității Rebound a eroinei Marci nu era precisă dacă locația țintei era prea aproape de ținta abilității.",
      "[*] A fost remediată problema în care fațeta Venomous Volley a eroinei Medusa funcționa pe iluziile care aveau Split Shot activ.",
      "[*] A fost remediată problema în care abilitatea Eternal Chains a obiectului Gleipnir declanșa năucirea cauzată de abilitatea Spiked Carapace a lui Nyx Asassin.",
      "[*] A fost remediată problema în care talentul de la nivelul 15 al eroinei Muerta care îi oferea regenerare pentru The Calling nu persista pe toată durata instanței atunci când eroina folosea fațeta Dance of the Dead.",
      "[*] A fost remediată problema în care fațeta Deluge a eroinei Naga Siren seta viteza maximă și pe cea minimă a unui inamic la 240.",
      "[*] A fost remediată problema în care efectul negativ al abilității Fortune Favors the Bold era vizibil inamicilor atunci când Pangolier nu se afla în câmpul lor vizual.",
      "[*] A fost remediată problema în care abilitatea Phase Shift a eroinei Puck oprea invulnerabilitatea, dar nu și concentrarea atunci când eroina utiliza anumite obiecte.",
      "[*] A fost remediată problema în care abilitatea Puckish a eroinei Puck considera în mod incorect toate proiectilele evitate cu ajutorul invizibilității ca fiind proiectile provenite de la vrăji, refăcându-i mai multă mana și viață decât trebuia.",
      "[*] A fost remediată problema în care abilitatea Static Link a lui Razor afișa în mod incorect o stare de invocare alternativă atunci când avea un Aghanim's Shard.",
      "[*] A fost remediată problema în care abilitatea Tricks of the Trade a lui Riki oprea atacurile și invulnerabilitatea, dar nu și concentrarea atunci când acesta utiliza anumite obiecte.",
      "[*] A fost remediată problema în care Slardar primea în mod eronat asistări suplimentare de la bălțile pe care le crea.",
      "[*] A fost remediată problema în care abilitatea Meld a eroinei Templar Assassin nu funcționa pentru ambele atacuri dacă abilitatea era utilizată de două ori într-o succesiune rapidă.",
      "[*] A fost remediată problema în care abilitatea Focus Fire a eroinei Windranger se oprea dacă eroina se afla sub efectul abilității Windrun îmbunătățită de Aghanim's Scepter și pierdea vedere asupra țintei sale, iar apoi o recăpăta.",
      "[*] A fost remediată problema în care abilitatea Splinter Blast a eroinei Winter Wyvern crea proiectile cu fragmente pentru unitățile invizibile din jurul țintei lovite de proiectilul inițial.",
      "[*] A fost remediată problema în care proiectilele cu fragmente ale abilității Splinter Blast a eroinei Winter Wyvern nu evitau corect unitățile invizibile dacă ținta lovită de proiectilul inițial avea vederea asupra unității invizibile.",
      "[*] A fost remediată problema în care abilitatea Death Ward a lui Witch Doctor îmbunătățită de Aghanim's Scepter nu aplica în mod corect bonusul de 50% precizie proiectilului ricoșat.",
      "[*] A fost remediată faptul că iluzia creată de Aghanim's Scepter a eroinei Vengeful Spirit era ucisă instantaneu de oprimator atunci când invoca Wave of Terror de la depărtare.",
      "[*] A fost remediată problema în care abilitatea Heavenly Jump a lui Zeus nu indica în mod corect bonusul de rază de vedere pe care Zeus îl primește în urma săriturii.",
      "[*] Selecție abilități: a fost remediată problema în care Pangolier primea abilitatea Roll Up oferită de Aghanim's Shard chiar dacă acesta nu alegea abilitatea Rolling Thunder.",
      "[*] Selecție abilități: a fost remediată problema în care Kez primea abilitățile Shodo Sai chiar dacă acesta nu le alegea.",
      "[/list]"
    ],
    "commentcount": 223,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 5399,
    "votedowncount": 621,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746774285,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5399,
  "votes_down": 621,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522350980353343",
  "clan_steamid_original": "103582791433224455"
}