{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "แพตช์เกมเพลย์ 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "แพตช์เกมเพลย์ 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "แพตช์ 7.38c ออกเผยแพร่แล้ว และคุณสามารถอ่านรายละเอียดแพตช์ได้[url=https://www.dota2.com/patches/7.38c]ที่นี่[/url]",
      "นอกจากนี้ ในช่วงสองสามวันที่ผ่านมาเราได้แก้ไขปัญหาต่าง ๆ ดังต่อไปนี้:",
      "[list]",
      "[*] เพิ่มประโยครายละเอียดแพตช์ที่ขาดไปจากรายละเอียดแพตช์ 7.38 \"Roshan ไม่ดรอป Aghanim's Blessing อีกต่อไป\"",
      "[*] แก้ไข Tormentor ที่ปรากฏบนฮีโร่ของผู้เล่นที่เวลา 15 นาทีเมื่อลองภูมิประเทศ",
      "[*] แก้ไข -createhero ที่บางครั้งสร้างฮีโร่ที่ไม่มีมิติ",
      "[*] แก้ไขบันทึกการต่อสู้ที่แสดงการยืนร่าย Twin Gates ของศัตรูที่มองไม่เห็น",
      "[*] แก้ไขปัญหาที่อาจเกิดขึ้นได้ที่ฮีโร่จะติดอยู่ในตำแหน่งหรือมุมของโมเดลฮีโร่ หากแอนิเมชันการคว้าของ Roshan ถูกขัดจังหวะ",
      "[*] แก้ไขระยะเวลาของรูน Haste ที่ไม่ได้รับการอัปเกรดอย่างถูกต้องเมื่อรูนหมุนเวียน",
      "[*] แก้ไขที่สามารถสร้าง Town Portal Scroll ได้อย่างไม่จำกัดจำนวนโดยการซื้อและขาย Boots of Travel",
      "[*] แก้ไขสถานการณ์ต่าง ๆ ที่ผู้เล่นสามารถล่วงรู้ได้ว่าศัตรูเปิดใช้งาน Smoke of Deceit ในขณะที่อยู่ในหมอกมืด",
      "[*] แก้ไขการแสดงผลบัฟจำนวนการมอบ Aghanim's Scepter ของ Alchemist ที่ศัตรูจะมองเห็นบัฟเป็น 1 เสมอ",
      "[*] แก้ไขความเสียหาย Quill Spray ของ Bristleback อัปเกรดโดย Aghanim's Scepter ที่ถูกนับเป็นความเสียหายที่สะท้อน",
      "[*] แก้ไขข้อบกพร่องที่ทำให้ Dazzle สามารถมีรายได้สุทธิติดลบ โดยการเก็บ Town Portal Scroll ไว้ในคลัง, ซื้อ Town Portal Scroll ด้วย Courier ของคุณ, ทำให้ฮีโร่ของคุณไม่มี Town Portal Scroll, ซื้อและขาย Boots of Travel หลายครั้ง, นำ Town Portal Scroll จาก Courier ของคุณมอบให้ Dazzle, ร่าย Nothl Projection, จากนั้นใช้ Courier ของคุณเพื่อส่ง Town Portal Scroll ที่เก็บไว้ในคลังให้กับ Dazzle ในขณะที่สกิลอัลติเมทกำลังทำงาน",
      "[*] แก้ไข Tar Bomb ของ Clinkz ที่ไม่ทำให้ Magic Wand ทำงานเมื่อตั้งค่าให้ร่ายอัตโนมัติ",
      "[*] แก้ไขการซื้อเกิดด้วย Devil's Bargain ของ Doom ที่คำนวณไม่ถูกต้อง",
      "[*] แก้ไขทักษะพิเศษเลเวล 20 ของ Hoodwink ที่ Sharpshooter มอบ True Sight มีจุดบอดตลอดเส้นทาง",
      "[*] แก้ไขการโจมตีครั้งแรกด้วย Echo Slash ของ Kez ที่ไม่สามารถทำให้ Shadowhawk ทำงานได้เมื่อใช้งานขณะล่องหน",
      "[*]  แก้ไขทักษะพิเศษเลเวล 25 ของ Kunkka ที่การเพิ่มพื้นที่สกิลไม่ถูกนำไปใช้กับ Tidebringer อย่างถูกต้อง",
      "[*] แก้ไข Howl และ Feral Impulse ของ Lycan ที่ไม่ถูกนำไปใช้กับหมาป่าจากการอัปเกรดโดย Aghanim's Shard อย่างถูกต้อง",
      "[*] แก้ไขที่ Skewer ของ Magnus ไม่ทำลายต้นไม้หาก Magnus ไม่มี Aghanim's Shard",
      "[*] แก้ไข Rebound ของ Marci ที่ถูกยกเลิกอย่างไม่ถูกต้องเมื่อได้รับผลจาก Pounce ของ Slark โดยมีป้องกันดีบัฟ",
      "[*] แก้ไขการคลิกและลากกำหนดทิศทาง Rebound ของ Marci ที่ไม่แม่นยำหากตำแหน่งของเป้าหมายอยู่ใกล้กับเป้าหมายของ Rebound มากเกินไป",
      "[*] แก้ไขการทำงานกับร่างเงาของ Venomous Volley ของ Medusa เมื่อเปิดใช้งาน Split Shot",
      "[*] แก้ไขที่การกดใช้ Gleipnir ทำให้การสตันโดย Spiked Carapace ของ Nyx Assassin ทำงาน",
      "[*] แก้ไขทักษะพิเศษเลเวล 15 อัตราการฟื้นฟูจาก The Calling ของ Muerta ที่ไม่คงอยู่จนครบระยะเวลาเมื่อใช้ร่วมกับมิติ Dance of the Dead",
      "[*] แก้ไขที่ Deluge ของ Naga Siren กำหนดความเร็วสูงสุดและต่ำสุดของศัตรูเป็น 240 หน่วย",
      "[*] แก้ไขที่ศัตรูมองเห็นดีบัฟ Fortune Favors the Bold ของ Pangolier ได้แม้ศัตรูจะมองไม่เห็น Pangolier",
      "[*] แก้ไข Phase Shift ของ Puck ที่หยุดสถานะอมตะ แต่ไม่หยุดการยืนร่ายเมื่อใช้ไอเท็มบางชิ้น",
      "[*] แก้ไข Puckish ของ Puck ที่พิจารณาการหลบกระสุนเมื่อล่องหนไม่ถูกต้องโดยนับเป็นกระสุนสกิล ทำให้ฟื้นฟูมานาและพลังชีวิตมากกว่าที่ควร",
      "[*] แก้ไข Static Link ของ Razor ที่แสดงสถานะร่ายอีกแบบไม่ถูกต้องเมื่ออัปเกรดสกิลโดย Aghanim's Shard",
      "[*] แก้ไข Tricks of the Trade ของ Riki ที่หยุดการโจมตีและสถานะอมตะ แต่ไม่หยุดการร่ายสกิลเมื่อใช้ไอเท็มบางชิ้น",
      "[*] แก้ไข Slardar ที่ได้รับแต้มการช่วยสังหารเพิ่มโดยไม่ควรจากแอ่งน้ำที่เขาสร้างขึ้น",
      "[*] แก้ไขที่ Meld ของ Templar Assassin ไม่ส่งผลต่อการโจมตีทั้งสองหากใช้ Meld ติดต่อกันสองครั้งอย่างรวดเร็ว",
      "[*] แก้ไขปัญหา Focus Fire ของ Windranger ที่หยุดทำงานหากเธอสูญเสียวิสัยทัศน์และมองเห็นเป้าหมายอีกครั้งขณะอยู่ภายใต้ผลของ Windrun ที่อัปเกรดโดย Aghanim's Scepter",
      "[*] แก้ไข Splinter Blast ของ Winter Wyvern ที่สร้างกระสุนกระจายสำหรับยูนิตล่องหนรอบเป้าหมายที่โดนกระสุนเริ่มต้น",
      "[*] แก้ไข Splinter Blast ของ Winter Wyvern ที่ยูนิตล่องหนไม่ได้หลบกระสุนกระจายอย่างถูกต้อง หากเป้าหมายที่โดนกระสุนเริ่มต้นมองเห็นยูนิตล่องหน",
      "[*] แก้ไข Death Ward ของ Witch Doctor ที่อัปเกรดโดย Aghanim's Scepter ไม่เพิ่มความแม่นยำ 50% ให้กับกระสุนที่ชิ่งอย่างถูกต้อง",
      "[*] แก้ไขที่ร่างเงา Vengeful Spirit จากการอัปเกรดโดย Aghanim's Scepter ถูกสังหารโดย Tormentor ในทันทีเมื่อใช้ Wave of Terror จากระยะไกล",
      "[*] แก้ไขที่คำอธิบาย Heavenly Jump ของ Zeus แสดงรัศมีการมองเห็นที่ Zeus ได้รับหลังจากกระโดดไม่สอดคล้องกับการเพิ่มพื้นที่",
      "[*] Ability Draft: แก้ไขที่ Pangolier ได้รับสกิล Roll Up จากการอัปเกรด Aghanim's Shard โดยที่ไม่ได้เลือกสกิล Rolling Thunder",
      "[*] Ability Draft: แก้ไขที่ Kez ได้รับสกิล Shodo Sai โดยไม่ต้องเลือก",
      "[/list]"
    ],
    "commentcount": 112,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 761,
    "votedowncount": 94,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1743174055,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 760,
  "votes_down": 93,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522350980353343",
  "clan_steamid_original": "103582791433224455"
}