{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "7.38c Oynanış Güncellemesi",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "7.38c Oynanış Güncellemesi",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "7.38c güncellemesi çıktı. Güncelleme notlarını [url=https://www.dota2.com/patches/7.38c]buradan[/url] inceleyebilirsiniz.",
      "Ek olarak, son birkaç gün içinde aşağıdaki sorunları çözdük:",
      "[list]",
      "[*] 7.38 güncellemesinde eksik olan bir madde eklendi: \"Roshan artık Aghanim's Blessing düşürmez.\"",
      "[*] Deneme modunda araziyi test ederken 15. dakikada oyuncu kahramanının üzerinde bir İşkenceci'nin belirmesi düzeltildi.",
      "[*] -createhero komutunun bazen yükselticisi olmayan bir kahraman oluşturması düzeltildi.",
      "[*] İkiz Geçit kullanan görünmez düşmanların muharebe kaydında gösterilmesi düzeltildi.",
      "[*] Roshan'ın yakalama animasyonu kesildiğinde kahramanın pozisyonunun veya yönünün takılıp kalmasına neden olan sorun düzeltildi.",
      "[*] Sürat rünü süresinin, rün döngüsüne bağlı olarak doğru şekilde artmaması düzeltildi.",
      "[*] Boots of Travel alıp satarak sınırsız Town Portal Scroll elde edilebilmesi düzeltildi.",
      "[*] Oyuncuların savaş sisi içindeyken düşmanlarının Smoke of Deceit'i kullandığını anlayabildiği durumlar düzeltildi.",
      "[*] Alchemist'in Aghanim's Scepter güçlendirmesinin düşmanlara her zaman Aghanim's Scepter vermiş gibi görünmesi düzeltildi.",
      "[*] Bristleback'in Aghanim's Scepter'lı Quill Spray hasarının yansıyan hasar sayılması düzeltildi.",
      "[*] Dazzle'da negatif değere ulaşılabilme durumu düzeltildi. Bu durum şu koşullarda gerçekleşiyordu; Dazzle zulasına bir Town Portal Scroll koyar, kuryesinde Town Portal Scroll alır, kendi üzerinde Town Portal Scroll olmaz, Boots of Travel'ı birden fazla defa alır ve satar, kuryedeki Town Portal Scroll'u teslim alır, Nothl Projection yeteneğini kullanır ve ardından son yeteneği aktifken kuryeyi kullanarak zulasındaki Town Portal Scroll'ları kendisine teslim ettirir.",
      "[*] Clinkz'in Tar Bomb yeteneğinin otomatik kullanımda Magic Wand'ı tetiklemesi düzeltildi.",
      "[*] Doom'un anında canlanma bedelinin Devil's Bargain sırasında yanlış hesaplanması düzeltildi.",
      "[*] Hoodwink'in seviye 20, Sharpshooter Gerçek Görüş Sağlar hünerinin kör noktaya sahip olması düzeltildi.",
      "[*] Kez'in Echo Slash yeteneğinin ilk vuruşunun, Kez görünmezken Shadowhawk bonusunu tetiklememesi düzeltildi.",
      "[*]  Kunkka'nın seviye 25, +100 Büyü Etki Alanı hünerinin Tidebringer yeteneğine doğru şekilde uygulanmaması düzeltildi.",
      "[*] Lycan'ın Howl ve Feral Impulse yeteneklerinin Aghanim's Shard ile çağrılan kurtlara doğru şekilde uygulanmaması düzeltildi.",
      "[*] Magnus'un Aghanim's Shard'ı olmadığında Skewer yeteneğinin ağaçları yok etmemesi düzeltildi.",
      "[*] Marci'nin Rebound yeteneğinin, Slark'ın Pounce yeteneğinden etkilendiğinde ve zayıflatmalara bağışıklığı olduğunda hatalı bir şekilde iptal olması düzeltildi.",
      "[*] Marci'nin Rebound vektör hedeflemesinin, hedef konum yeteneğin hedefine çok yakınken hatalı olması düzeltildi.",
      "[*] Medusa'nın Venomous Volley yükselticisinin Split Shot aktifken illüzyonları etkilemesi düzeltildi.",
      "[*] Gleipnir'in aktif yeteneğinin Nyx Assassin'in Spiked Carapace yeteneğinin sersemletmesini tetiklemesi düzeltildi.",
      "[*] Muerta'nın seviye 15, The Calling Sağlık Yenilenmesi hünerinin Dance of the Dead yükselticisiyle birlikte kullanıldığında yeteneğin tam süresi boyunca sürmemesi düzeltildi.",
      "[*] Naga Siren'in Deluge yükselticisinin, bir düşmanın maksimum ve minimum hızını 240'a ayarlaması düzeltildi.",
      "[*] Pangolier'in Fortune Favors the Bold zayıflatmasının, Pangolier'ı görmeyen düşmanların üzerinde görünmesi düzeltildi.",
      "[*] Puck'ın Phase Shift yeteneğinin belirli eşyalar kullanılırken dokunulmazlığı durdurması ancak yönlendirmeyi durdurmaması düzeltildi.",
      "[*] Puck'ın Puckish yeteneğinin, görünmezken kaçınılan tüm atışları büyü atışı olarak sayması ve amaçlanan miktardan daha fazla mana ve sağlık yenilemesi düzeltildi.",
      "[*] Razor'ın Static Link yeteneğinin Aghanim's Shard alındığında hatalı bir şekilde alternatif kullanım olarak görünmesi düzeltildi.",
      "[*] Riki'nin Tricks of the Trade yeteneğinin belirli eşyalar kullanılırken saldırıları ve dokunulmazlığı durdurması ancak yönlendirmeyi durdurmaması düzeltildi.",
      "[*] Slardar'ın oluşturduğu su birikintilerinden ekstra asist elde etmesi düzeltildi.",
      "[*] Templar Assassin'ın Meld yeteneğinin hızlı bir şekilde iki kez kullanılması durumunda her iki saldırıya da uygulanmaması düzeltildi.",
      "[*] Windranger'ın Aghanim's Scepter'lı Windrun etkisi altındayken bir hedefi gözden kaçırıp tekrar görmesi durumunda Focus Fire'ın kesintiye uğraması düzeltildi.",
      "[*] Winter Wyvern'ın Splinter Blast yeteneğinin, ilk atışının isabet ettiği hedefin çevresindeki görünmez birimlere parçalı atış yapması düzeltildi.",
      "[*] Winter Wyvern'ın Splinter Blast yeteneğinin parçalı atışlarının, ilk atışın isabet ettiği hedefin görüş alanında olmaları durumunda görünmez birimlerden doğru bir şekilde kaçınmaması düzeltildi.",
      "[*] Witch Doctor'ın Aghanim's Scepter'lı Death Ward yeteneğinin, seken atışlara %50 fazladan isabetliliği doğru olarak uygulamaması düzeltildi.",
      "[*] Aghanim's Scepter'ın yarattığı Vengeful Spirit illüzyonunun İşkenceci tarafından uzaktan Wave of Terror kullanıldığında anında öldürülmesi düzeltildi.",
      "[*] Zeus'un Heavenly Jump açıklamasının, Zeus'un sıçradıktan sonra kazandığı görüş yarıçapındaki etki alanı artışlarını doğru şekilde yansıtmaması düzeltildi.",
      "[*] Yetenek Çekilişi: Pangolier'in Rolling Thunder'ı seçmeden Aghanim's Shard yükseltmeli Roll Up yeteneğine sahip olması düzeltildi.",
      "[*] Yetenek Çekilişi: Kez'in Shodo Sai yeteneklerini seçmeden bu yeteneklere sahip olması düzeltildi.",
      "[/list]"
    ],
    "commentcount": 223,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 5399,
    "votedowncount": 621,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746774285,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5399,
  "votes_down": 621,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597739399545004",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}