{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Gameplay-Update 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Gameplay-Update 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "Das Gameplay-Update 7.38c ist jetzt verfügbar. Die Patchnotizen dazu finden Sie [url=https://www.dota2.com/patches/7.38c]hier[/url].",
      "In den vergangenen Tagen haben wir die folgenden Probleme behoben:",
      "[list]",
      "[*] Fehlende Patchnotiz für das Gameplay-Update 7.38 hinzugefügt: Roshan lässt nicht mehr Aghanims Segen fallen.",
      "[*] Fehler behoben, durch den beim Testen von Terrain ein Peiniger nach 15 Minuten über dem Helden eines Spielers erschien.",
      "[*] Fehler behoben, durch den der Befehl „-createhero“ gelegentlich einen Helden ohne Facette hervorbrachte.",
      "[*] Fehler behoben, durch den die Kanalisierung eines Zwillingstors durch einen nicht sichtbaren Gegner im Spielprotokoll angezeigt wurde.",
      "[*] Fehler behoben, durch den ein Held dauerhaft an einer bestimmten Position bzw. das Heldenmodell in einem bestimmten Winkel feststecken konnte, wenn die Animation von Roshans Fähigkeit „Wurf“ unterbrochen wurde.",
      "[*] Fehler behoben, durch den die Effektdauer der Rune der Hast sich nicht ordnungsgemäß mit jedem Runenzyklus verlängerte.",
      "[*] Fehler behoben, durch den endlos viele Town Portal Scrolls generiert werden konnten, indem Boots of Travel gekauft und sofort wieder verkauft wurden.",
      "[*] Verschiedene Fehler behoben, durch die Spieler erfahren konnten, ob ein Gegner Smoke of Deceit im Nebel des Krieges benutzt hat.",
      "[*] Fehler behoben, durch den der Stärkungseffekt „Verschenkte Aghanims Zepter“ immer auf eine Art angezeigt wurde, als hätte Alchemist ein Zepter an seine Gegner verschenkt.",
      "[*] Fehler behoben, durch den der Schaden von Bristlebacks Fähigkeit „Quill Spray“ mit Zepterbonus als reflektierter Schaden zählte.",
      "[*] Fehler behoben, durch den Dazzle ein negatives Vermögen erzielen konnte. Dazu waren folgende Schritte notwendig: Zuerst wurde eine Town Portal Scroll ins Lager gelegt und dann eine Town Portal Scroll mit dem Kurier gekauft (diese wurde aber nicht an den Helden geliefert). Anschließend wurden Boots of Travel mehrfach gekauft und verkauft, bevor die Town Portal Scroll vom Kurier an Dazzle geliefert wurde. Schließlich musste Nothl Projection gewirkt und die im Lager befindliche Town Portal Scroll vom Kurier an Dazzle geliefert werden, während die ultimative Fähigkeit aktiv war.",
      "[*] Fehler behoben, durch den Clinkz’ Fähigkeit „Tar Bomb“ keine Aufladungen für den Gegenstand „Magic Stick“ bzw. „Magic Wand“ gewährte, wenn der Autozauber aktiviert wurde.",
      "[*] Fehler behoben, durch den Dooms Rückkaufkosten mit der Facette „Teufelspakt“ falsch berechnet wurden.",
      "[*] Fehler behoben, durch den Hoodwinks Level-20-Talent „Sharpshooter gewährt Sicht beim Kanalisieren“ einen toten Winkel entlang der Flugbahn des Projektils aufwies.",
      "[*] Fehler behoben, durch den der erste Treffer von Kez’ Fähigkeit „Echo Slash“ nicht den Effekt der Facette „Schattenfalke“ auslöste, wenn Kez diese aus der Unsichtbarkeit wirkte.",
      "[*]  Fehler behoben, durch den Kunkkas Level-25-Talent „+100 Radius für Zauber“ nicht ordnungsgemäß mit seiner Fähigkeit „Tidebringer“ funktionierte.",
      "[*] Fehler behoben, durch den Lycans Fähigkeiten „Howl“ und „Feral Impulse“ nicht ordnungsgemäß auf die mit dem Splitterbonus erschaffenen Wölfe angewendet wurden.",
      "[*] Fehler behoben, durch den Magnus’ Fähigkeit „Skewer“ keine Bäume zerstörte, wenn Magnus den Splitterbonus nicht besaß.",
      "[*] Fehler behoben, durch den Marcis Fähigkeit „Rebound“ trotz Schwächungsimmunität abgebrochen wurde, während sie von Slarks Fähigkeit „Pounce“ betroffen war.",
      "[*] Fehler behoben, durch den der Vektorzielmodus von Marcis Fähigkeit „Rebound“ ungenau ausgerichtet wurde, wenn sich der Zielort zu nah am anvisierten Ziel befand.",
      "[*] Fehler behoben, durch den Medusas Facette „Giftpfeilsalve“ Angriffe gegen Illusionen mitzählte, wenn die Fähigkeit „Split Shot“ aktiviert war.",
      "[*] Fehler behoben, durch den die Aktivfähigkeit des Gegenstands „Gleipnir“ die Betäubung von Nyx Assassins Fähigkeit „Spiked Carapace“ auslöste.",
      "[*] Fehler behoben, durch den der Effekt von Muertas Level-15-Talent „+3 % max. LP als Regeneration im Inneren von The Calling“ nicht für die gesamte Dauer anhielt, wenn die Facette „Tanz der Toten“ ausgewählt wurde.",
      "[*] Fehler behoben, durch den Naga Sirens Fähigkeit „Deluge“ das maximale und minimale Bewegungstempo eines Gegners auf 240 setzte.",
      "[*] Fehler behoben, durch den der Schwächungseffekt von Pangoliers Begabung „Das Glück ist mit den Mutigen“ für Gegner angezeigt wurde, obwohl diese keine Sicht auf Pangolier hatten.",
      "[*] Fehler behoben, durch den beim Benutzen bestimmter Gegenstände während Pucks Fähigkeit „Phase Shift“ zwar die Unverwundbarkeit gestoppt wurde, aber die Kanalisierung weiterlief.",
      "[*] Fehler behoben, durch den Pucks Begabung „Schelmisch“ fälschlicherweise alle Projektile, denen Puck mithilfe von Unsichtbarkeit auswich, als zielgerichtete Zauberprojektile zählten, wodurch mehr Mana und Lebenspunkte als vorgesehen wiederhergestellt wurden.",
      "[*] Fehler behoben, durch den für Razors Fähigkeit „Static Link“ fälschlicherweise der Alternativzauberzustand angezeigt wurde, wenn er den Splitterbonus erhielt.",
      "[*] Fehler behoben, durch den beim Benutzen bestimmter Gegenstände während Rikis Fähigkeit „Tricks of the Trade“ zwar die Angriffe und die Unverwundbarkeit gestoppt wurden, aber die Kanalisierung weiterlief.",
      "[*] Fehler behoben, durch den Slardar durch erschaffene Pfützen unbeabsichtigt zusätzliche Assists gutgeschrieben bekam.",
      "[*] Fehler behoben, durch den der Effekt von Templar Assassins Fähigkeit „Meld“ nicht bei zwei aufeinanderfolgenden Angriffen angewendet wurde, wenn sie die Fähigkeit schnell hintereinander wirkte.",
      "[*] Fehler behoben, durch den Windrangers Fähigkeit „Focus Fire“ gestoppt wurde, wenn ihr Ziel außer und wieder in Sicht geriet, während sie unter dem Effekt ihrer Fähigkeit „Windrun“ mit Zepterbonus stand.",
      "[*] Fehler behoben, durch den Winter Wyverns Fähigkeit „Splinter Blast“ sekundäre Projektile auf unsichtbare Einheiten um die mit dem primären Projektil getroffene Einheit abfeuerte.",
      "[*] Fehler behoben, durch den die sekundären Projektile von Winter Wyverns Fähigkeit „Splinter Blast“ unsichtbare Einheiten nicht korrekterweise verfehlten, wenn das mit dem primären Projektil getroffene Ziel Sicht auf diese hatte.",
      "[*] Fehler behoben, durch den die Projektile von Witch Doctors Fähigkeit „Death Ward“ mit Zepterbonus nicht ordnungsgemäß mit um 50 % erhöhter Präzision auf Ziele übersprangen.",
      "[*] Fehler behoben, durch den die Illusion von Vengeful Spirits Fähigkeit „Vengence Aura“ mit Zepterbonus sofort von einem Peiniger getötet wurde, wenn sie ihre Fähigkeit „Wave of Terror“ aus der Ferne wirkte.",
      "[*] Fehler behoben, durch den die Kurzinfo von Zeus’ Fähigkeit „Heavenly Jump“ nicht ordnungsgemäß die erhöhte Sichtweite anzeigte, nachdem Zeus den Sprung ausgeführt hatte.",
      "[*] Ability Draft: Fehler behoben, durch den Pangolier den Splitterbonus für die Fähigkeit „Roll Up“ erhielt, ohne dass die Fähigkeit „Rolling Thunder“ ausgewählt wurde.",
      "[*] Ability Draft: Fehler behoben, durch den Kez die Fähigkeit „Shodo Sai“ erhielt, ohne dass diese ausgewählt wurde.",
      "[/list]"
    ],
    "commentcount": 223,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 5399,
    "votedowncount": 621,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746774285,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5399,
  "votes_down": 621,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597739399545004",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}