{
  "gid": "536597739399545003",
  "clan_steamid": "103582791433224455",
  "event_name": "Ενημέρωση παιχνιδιού 7.38c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743110640,
  "rtime32_end_time": 1743114601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6627033e4c0db6f3f31b0757cacb2dfea0bb0067.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1743110667
      }
    ]
  },
  "announcement_body": {
    "gid": "536597739399545004",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ενημέρωση παιχνιδιού 7.38c",
    "posttime": 1743110670,
    "updatetime": 1743110670,
    "body": [
      "H ενημέρωση 7.38c κυκλοφόρησε και μπορείτε να δείτε τις σημειώσεις ενημέρωσης [url=https://www.dota2.com/patches/7.38c]εδώ[/url].",
      "Επίσης, τις τελευταίες ημέρες διορθώσαμε τα ακόλουθα προβλήματα:",
      "[list]",
      "[*] Προστέθηκε η σημείωση «Ο Roshan δεν ρίχνει πλέον Aghanim’s Blessing», που έλειπε από τις σημειώσεις ενημέρωσης 7.38.",
      "[*] Διορθώθηκε πρόβλημα όπου το Tormentor εμφανιζόταν πάνω στον ήρωα του παίκτη στο 15ο λεπτό, όταν ήταν σε δοκιμή ενός πεδίου μάχης.",
      "[*] Διορθώθηκε πρόβλημα όπου η εντολή -createhero δημιουργούσε μερικές φορές ήρωα χωρίς όψη.",
      "[*] Διορθώθηκε πρόβλημα όπου το αρχείο μάχης εμφάνιζε τη διοχέτευση των Δίδυμων Πυλών από μη ορατό εχθρό.",
      "[*] Διορθώθηκε πρόβλημα όπου ήταν δυνατό να «κολλήσει» η θέση ή η γωνία του μοντέλου ενός ήρωα, αν διακοπτόταν η κίνηση αρπαγής του Roshan.",
      "[*] Διορθώθηκε πρόβλημα όπου η διάρκεια του ρούνου Haste δεν αναβαθμιζόταν σωστά με τον κύκλο εναλλαγής ρούνων.",
      "[*] Διορθώθηκε πρόβλημα όπου ήταν δυνατή η δημιουργία άπειρων Town Portal Scroll με αγορά και έπειτα πώληση των Boots of Travel.",
      "[*] Διορθώθηκαν διάφορες περιπτώσεις όπου οι παίκτες μπορούσαν να μάθουν αν ο εχθρός τους ενεργοποίησε ένα Smoke of Deceit όσο βρίσκονταν στη σκιά του πολέμου.",
      "[*] Διορθώθηκε πρόβλημα όπου η επαύξηση χορήγησης Aghanim's Scepter σε συμμάχους του Alchemist εμφανιζόταν πάντα σαν να είχε δοθεί 1 Aghanim's Scepter σε εχθρούς.",
      "[*] Διορθώθηκε πρόβλημα όπου η ζημιά του Quill Spray του Bristleback από το Aghanim's Scepter προσμετρούνταν ως αντανακλώμενη ζημιά.",
      "[*] Διορθώθηκε πρόβλημα όπου ήταν δυνατό ο Dazzle να έχει αρνητική συνολική αξία, όταν τοποθετούνταν στη φύλαξη ένα Town Portal Scroll, αγοραζόταν ένα Town Portal Scroll στον μεταφορέα, δεν υπήρχε Town Portal Scroll στον ήρωα, γινόταν πολλές φορές αγορά και πώληση του Boots of Travel, εκτελούνταν το Nothl Projection και, στη συνέχεια, χρησιμοποιούνταν ο μεταφορέας για να παραδώσει τα Town Portal Scroll στη φύλαξη στον Dazzle, ενώ ήταν ενεργή η απόλυτη ικανότητα.",
      "[*] Διορθώθηκε πρόβλημα όπου το Tar Bomb του Clinkz δεν ενεργοποιούσε το Magic Wand όταν είχε οριστεί σε αυτόματη εκτέλεση.",
      "[*] Διορθώθηκε πρόβλημα όπου η εξαγορά του Devil's Bargain του Doom δεν υπολογιζόταν σωστά.",
      "[*] Διορθώθηκε πρόβλημα όπου το ταλέντο επιπέδου 20 της Hoodwink για το Sharpshooter είχε ένα τυφλό σημείο.",
      "[*] Διορθώθηκε πρόβλημα όπου το πρώτο χτύπημα από το Echo Slash του Kez δεν μπορούσε να ενεργοποιήσει την επαύξηση του Shadowhawk, όταν χρησιμοποιούνταν από αορατότητα.",
      "[*]  Διορθώθηκε πρόβλημα όπου το ταλέντο επιπέδου 25 του Kunkka για την περιοχή επίδρασης δεν εφαρμοζόταν σωστά στο Tidebringer.",
      "[*] Διορθώθηκε πρόβλημα όπου τα Howl και Feral Impulse του Lycan δεν εφαρμόζονταν σωστά στους λύκους με Aghanim's Shard.",
      "[*] Διορθώθηκε πρόβλημα όπου το Skewer του Magnus δεν κατέστρεφε δέντρα, αν ο Magnus δεν είχε Aghanim's Shard.",
      "[*] Διορθώθηκε πρόβλημα όπου το Rebound της Marci ακυρωνόταν λανθασμένα όταν επηρεαζόταν από το Pounce του Slark και είχε ατρωσία απομειώσεων.",
      "[*] Διορθώθηκε πρόβλημα όπου η στόχευση με διάνυσμα του Rebound της Marci ήταν ανακριβής, αν η στοχευμένη τοποθεσία ήταν πολύ κοντά στον στόχο του Rebound.",
      "[*] Διορθώθηκε πρόβλημα όπου το Venomous Volley της Medusa λειτουργούσε σε ψευδαισθήσεις όσο το Split Shot ήταν ενεργό.",
      "[*] Διορθώθηκε πρόβλημα όπου η επίδραση ακινητοποίησης του Gleipnir ενεργοποιούσε το σάστισμα του Spiked Carapace του Nyx Assassin.",
      "[*] Διορθώθηκε πρόβλημα όπου το ταλέντο επιπέδου 15 της Muerta για την αναπλήρωση μέγιστης ζωής εντός του The Calling, δεν είχε την πλήρη διάρκεια όταν χρησιμοποιούνταν μαζί με την όψη Dance of the Dead.",
      "[*] Διορθώθηκε πρόβλημα όπου το Deluge της Naga Siren ρύθμιζε τη μέγιστη και ελάχιστη ταχύτητα του εχθρού σε 240.",
      "[*] Διορθώθηκε πρόβλημα όπου η απομείωση του Fortune Favors the Bold του Pangolier ήταν ορατή σε εχθρούς, όταν ο εχθρός δεν είχε όραση του Pangolier.",
      "[*] Διορθώθηκε πρόβλημα όπου το Phase Shift του Puck διέκοπτε την ατρωσία, αλλά όχι τη διοχέτευση, κατά τη χρήση συγκεκριμένων αντικειμένων.",
      "[*] Διορθώθηκε πρόβλημα όπου το Puckish του Puck θεωρούσε λανθασμένα ως βλήματα ξορκιών όλα τα βλήματα που διασπούσε με χρήση αορατότητας, με αποτέλεσμα να επαναφέρει περισσότερη ενέργεια και ζωή από το προβλεπόμενο.",
      "[*] Διορθώθηκε πρόβλημα όπου το Static Link του Razor εμφάνιζε εσφαλμένα μια κατάσταση εναλλακτικής εκτέλεσης όταν αποκτούσε Aghanim's Shard.",
      "[*] Διορθώθηκε πρόβλημα όπου το Tricks of the Trade του Riki διέκοπτε τις επιθέσεις και την ατρωσία, αλλά όχι τη διοχέτευση, όταν χρησιμοποιούσε συγκεκριμένα αντικείμενα.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Slardar λάμβανε κατά λάθος επιπλέον βοήθειες από τις λιμνούλες που δημιουργούσε.",
      "[*] Διορθώθηκε πρόβλημα όπου δεν γινόταν εφαρμογή του Meld της Templar Assassin και στις δύο επιθέσεις, αν το Meld χρησιμοποιούνταν γρήγορα διαδοχικά.",
      "[*] Διορθώθηκε πρόβλημα όπου το Focus Fire της Windranger σταματούσε, αν έχανε και αποκτούσε εκ νέου όραση του στόχου της, όσο ήταν υπό την επίδραση του Windrun της με Aghanim's Scepter.",
      "[*] Διορθώθηκε πρόβλημα όπου το Splinter Blast της Winter Wyvern δημιουργούσε βλήματα θραυσμάτων για αόρατες μονάδες γύρω από τον στόχο που έπληττε το αρχικό βλήμα.",
      "[*] Διορθώθηκε πρόβλημα όπου τα βλήματα θραυσμάτων από το Splinter Blast της Winter Wyvern δεν διασπόνταν σωστά από αόρατες μονάδες, αν ο στόχος που έπληττε το αρχικό βλήμα είχε όραση της αόρατης μονάδας.",
      "[*] Διορθώθηκε πρόβλημα όπου το Death Ward του Witch Doctor με Aghanim's Scepter δεν εφάρμοζε σωστά την 50% επιπλέον ευστοχία στο βλήμα που αναπήδησε.",
      "[*] Διορθώθηκε πρόβλημα όπου η ψευδαίσθηση του Aghanim's Scepter της Vengeful Spirit σκοτωνόταν άμεσα από το Tormentor, όταν εκτελούσε Wave of Terror από μακριά.",
      "[*] Διορθώθηκε η επεξήγηση του Heavenly Jump του Zeus που δεν περιέγραφε σωστά τις αυξήσεις περιοχής επίδρασης στην εμβέλεια της όρασης που αποκτά ο Zeus μετά το άλμα.",
      "[*] Ability Draft: Διορθώθηκε πρόβλημα όπου ο Pangolier λάμβανε την αναβάθμιση Aghanim's Shard του Roll Up χωρίς να έχει επιλέξει το Rolling Thunder.",
      "[*] Ability Draft: Διορθώθηκε πρόβλημα όπου ο Kez λάμβανε τις ικανότητες Shodo Sai χωρίς να τις έχει επιλέξει.",
      "[/list]"
    ],
    "commentcount": 223,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1428110219_1743112131_0"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "598522350980353343",
    "event_gid": "536597739399545003",
    "voteupcount": 5399,
    "votedowncount": 621,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522350980353343",
  "rtime32_last_modified": 1746774285,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743112131,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5399,
  "votes_down": 621,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522350980353343",
  "clan_steamid_original": "103582791433224455"
}