{
  "gid": "3902996144652327831",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualización de Dota 2 - 18/12/2023",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1702952280,
  "rtime32_end_time": 1702956601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702952339
      },
      {
        "strSteamID": "76561198187439478",
        "rtUpdated": 1702949969
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703206364
      }
    ]
  },
  "announcement_body": {
    "gid": "3902996144652327832",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualización de Dota 2 - 18/12/2023",
    "posttime": 1702952340,
    "updatetime": 1703206364,
    "body": [
      "En los últimos días, hemos solucionado varios problemas de jugabilidad:",
      "[list]",
      "[*]Se corrigió la bonificación de área de efecto de Piedra de Sangre que seguía activa en las habilidades pasivas si se dejaba caer o se vendía.",
      "[*]Se corrigió la regeneración de maná de Espina Sangrienta que era 3,0 en lugar de 3,5 según la suma de sus componentes.",
      "[*]Mariposa ya cuenta correctamente la velocidad de ataque base del héroe para las bonificaciones.",
      "[*]Hendidura ya funciona en los ataques mágicos, por ejemplo, con Broche del Renacido.",
      "[*]Se corrigió un bloqueo poco frecuente del servidor que se producía al alternar los modos de Doblón.",
      "[*]Khanda ya hace el daño letal correctamente.",
      "[*]Se corrigió un error en el que Khanda y Filacteria no compartían tiempos de recarga.",
      "[*]Lanzar Árbol, Lanzamiento, Bola de Nieve, Toma de Almas y Bomba Lapa ahora ya activan Filacteria y Khanda.",
      "[*]Se corrigió la interacción incorrecta de Filacteria y Khanda con Daga Espectral de Spectre.",
      "[*]Se corrigió el funcionamiento de Filacteria y Khanda con ilusiones.",
      "[*]Se corrigió que Martillo de Meteorito otorgase por error más agilidad que inteligencia.",
      "[*]Se corrigió que Parasma no otorgara el 1,5 de regeneración de maná de sus componentes.",
      "[*]Se corrigió que Broche del Renacido aplicase Ataque Certero por error.",
      "[*]Se corrigió un bloqueo del servidor causado por la interacción entre el fin de Escudo Afótico de Abaddon, Burbuja de Seguridad y Malla de Cuchillas.",
      "[*]Ahora Duplicado de la Tempestad de Arc Warden ya clona Jalea Real.",
      "[*]Se corrigió que Quebrantaestrellas de Dawnbreaker a veces no iba en la dirección indicada.",
      "[*]Se corrigió que las unidades que no son de ataque a distancia obtuvieran los beneficios de Ataque Certero de Glaciar de Drow Ranger.",
      "[*]Se corrigieron algunos casos en los que Drow Ranger podía quedarse atascada al intentar irse de su Glaciar.",
      "[*]Se corrigió que Penitencia de Chen otorgase alcance de ataque adicional a sus creeps cuerpo a cuerpo.",
      "[*]Se corrigió que la regeneración de Favor Divino de Chen no se aplicara a sus creeps.",
      "[*]Se corrigió que el talento de nivel 10 de Chen «-2 s de retraso de teletransporte para Favor Divino» no se aplicara correctamente.",
      "[*]Se corrigió que Invoker no pudiera recoger lotos de las Fuentes de Loto.",
      "[*]La frecuencia de ataque de Furia de la Hoja de Juggernaut ya se actualiza si cambia su velocidad de ataque.",
      "[*]Se corrigió que Omnicorte y Minicorte de Juggernaut no dañaran a las unidades etéreas incluso si tenía el Broche del Renacido.",
      "[*]Se corrigió la interacción incorrecta de Furia de la Hoja de Juggernaut con Arpón.",
      "[*]Se corrigió que Congelación en Cadena de Lich no se viera afectada por el aumento en el área de efecto.",
      "[*]Los objetos en la reserva del Oso ya no se pierden cuando Lone Druid mejora Invocar Espíritu Oso.",
      "[*]Las cargas de Ángel Guardián de Omniknight ya se actualizan correctamente al adquirir el Cetro de Aghanim y soltarlo.",
      "[*]El tipo de daño de Salto Estruendoso de Pangolier ya se cambia correctamente a daño físico.",
      "[*]Se corrigió un bloqueo poco común del servidor que se producía con la habilidad Descuartizar de Pudge.",
      "[*]Se corrigió que Última Palabra de Silencer causara menos daño de lo previsto a los creeps.",
      "[*]El ataque en área del Dragón Negro Ancestral ya funciona correctamente.",
      "[*]Se corrigieron algunos bloqueos del servidor.",
      "[*]Se corrigieron varios problemas relacionados con descripciones emergentes.",
      "[*]Se agregó de nuevo la opción de ver el nombre de los héroes en el minimapa.",
      "[*]Se corrigió un problema en la vista previa de la configuración del minimapa por el cual, al ajustar las dimensiones del icono, no se ajustaban las dimensiones de la flecha.",
      "[*]Se corrigió un error por el que la vista previa de los objetos de personajes mostraba a veces el modelo base (o viceversa) en la Armería o en el Equipamiento.",
      "[/list]"
    ],
    "commentcount": 297,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1415727794_1702954120_0",
      "ModAct_1415727794_1702957647_4",
      "ModAct_487486347_1703038333_4",
      "ModAct_1415588329_1703206498_4"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "4038104133478028419",
    "event_gid": "3902996144652327831",
    "voteupcount": 15062,
    "votedowncount": 1619,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133478028419",
  "rtime32_last_modified": 1710280823,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703206498,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 15062,
  "votes_down": 1619,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133478028419",
  "clan_steamid_original": "103582791433224455"
}