{
  "gid": "3902996144652327831",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota-2-Update – 18. Dezember 2023",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702952280,
  "rtime32_end_time": 1702956601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702952339
      },
      {
        "strSteamID": "76561198187439478",
        "rtUpdated": 1702949969
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703206364
      }
    ]
  },
  "announcement_body": {
    "gid": "3902996144652327832",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota-2-Update – 18. Dezember 2023",
    "posttime": 1702952340,
    "updatetime": 1703206364,
    "body": [
      "In den vergangenen Tagen haben wir einige Probleme behoben, die sich negativ auf das Gameplay auswirkten:",
      "[list]",
      "[*]Fehler behoben, durch den der Wirkungsbereichsbonus von Bloodstone bei passiven Fähigkeiten aktiv war, obgleich der Bloodstone fallen gelassen oder verkauft worden war.",
      "[*]Fehler behoben, durch den die Manaregeneration von Bloodthorn aufgrund der Summe seiner Komponenten 3,0 statt 3,5 betrug.",
      "[*]Fehler behoben, durch den Butterfly das Grundangriffstempo des Helden nicht seinen Boni anrechnete.",
      "[*]Fehler behoben, durch den magische Angriffe keinen Flächenschaden zufügten (z. B. mit Revenant’s Brooch).",
      "[*]Seltener Serverabsturz beim Umschalten von Doubloon behoben.",
      "[*]Fehler behoben, durch den Khanda nicht wie vorgesehen tödlichen Schaden verursachte.",
      "[*]Fehler behoben, durch den Khanda und Phylactery ihre Abklingzeiten nicht teilten.",
      "[*]Tree Throw, Toss, Snowball, Soul Assumption und Sticky Bomb lösen jetzt korrekt die Passivfähigkeit von Phylactery/Khanda aus.",
      "[*]Fehlerhafte Interaktion zwischen Phylactery/Khanda und Spectral Dagger von Spectre behoben.",
      "[*]Fehler behoben, der verhinderte, dass Phylactery/Khanda auf Illusionen wirkte.",
      "[*]Fehler behoben, durch den Meteor Hammer fälschlicherweise mehr Agilität als Intelligenz verlieh.",
      "[*]Fehler behoben, durch den Parasma nicht die 1,5-fache Manaregeneration seiner Komponenten gewährte.",
      "[*]Fehler behoben, durch den Angriffe mit Revenant’s Brooch fälschlicherweise nicht verfehlen konnten.",
      "[*]Serverabsturz behoben, der durch die Interaktion zwischen Abaddons ablaufendem Apothic Shield, Safety Bubble und Blade Mail verursacht wurde.",
      "[*]Fehler behoben, durch den Arc Wardens Doppelgänger Royal Jelly nicht ebenfalls als neutralen Gegenstand erhielt.",
      "[*]Fehler behoben, durch den Dawnbreakers Starbreaker gelegentlich die Zielrichtung verfehlte.",
      "[*]Fehler behoben, durch den Angriffe von Nahkampfeinheiten auf Drow Rangers Eishügel nicht verfehlen konnten.",
      "[*]Gelegentlichen Fehler behoben, durch den Drow Ranger beim Versuch, den Eishügel zu verlassen, stecken bleiben konnte.",
      "[*]Fehler behoben, durch den Chens Penitence seinen Nahkampfdienern zusätzliche Angriffsreichweite gewährte.",
      "[*]Fehler behoben, durch den die Regenerierung von Chens Divine Favor nicht auf seine Diener wirkte.",
      "[*]Fehler behoben, durch den Chens Level-10-Talent „−2 s Teleportationsverzögerung für Divine Favor“ nicht korrekt angewendet wurde.",
      "[*]Fehler behoben, durch den Invoker keine Lotosblumen aus den Lotosbrunnen kanalisieren konnte.",
      "[*]Fehler behoben, durch den das Angriffsintervall von Juggernauts Blade Fury bei einer Veränderung seines Angriffstempos nicht aktualisiert wurde.",
      "[*]Fehler behoben, durch den Juggernauts Omnislash/Swiftslash ätherischen Einheiten keinen Schaden zufügte, selbst wenn Revenant’s Brooch ausgerüstet war.",
      "[*]Fehlerhafte Interaktion von Juggernauts Blade Fury mit Harpoon behoben.",
      "[*]Fehler behoben, durch den Lichs Chain Frost nicht von Wirkungsbereichsboni profitierte.",
      "[*]Fehler behoben, durch den Gegenstände aus dem Lager des Geisterbären verloren gingen, wenn die Fähigkeit „Summon Spirit Bear“ aufgelevelt wurde.",
      "[*]Fehler behoben, durch den die Aufladungen von Omniknights Guardian Angel nicht korrekt aktualisiert wurden, wenn Aghanims Zepter erworben und fallen gelassen wurde.",
      "[*]Fehler behoben, durch den sich der Schadenstyp von Pangoliers Shield Crash nicht wie vorgesehen in physischen Schaden änderte.",
      "[*]Seltener Serverabsturz in Zusammenhang mit Pudges Dismember behoben.",
      "[*]Fehler behoben, durch den Silencers Last Word Dienern weniger Schaden zufügte als beabsichtigt.",
      "[*]Splash Attack von Black Dragon funktioniert jetzt wie vorgesehen.",
      "[*]Einige Serverabstürze behoben.",
      "[*]Fehler bei verschiedenen Beschreibungstexten behoben.",
      "[*]Heldennamen sind jetzt auf der Minikarte wieder als Option für Helden verfügbar.",
      "[*]Problem behoben, durch das in den Einstellungen der Minikarte beim Skalieren der Symbole die Größe der Pfeile nicht geändert wurde.",
      "[*]Fehler behoben, durch den Persona-Gegenstände in der Vorschau manchmal auf dem Basismodell (oder umgekehrt) im Arsenal oder in der Ausrüstung angezeigt wurden.",
      "[/list]"
    ],
    "commentcount": 298,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1415727794_1702954120_0",
      "ModAct_1415727794_1702957647_4",
      "ModAct_487486347_1703038333_4",
      "ModAct_1415588329_1703206498_4"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4038104133478028419",
    "event_gid": "3902996144652327831",
    "voteupcount": 14814,
    "votedowncount": 1582,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133478028419",
  "rtime32_last_modified": 1708465092,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703206498,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 14814,
  "votes_down": 1582,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133478028419",
  "clan_steamid_original": "103582791433224455"
}