{
  "gid": "3902996144652327831",
  "clan_steamid": "103582791433224455",
  "event_name": "Aggiornamento di Dota 2 del 18 dicembre 2023",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702952280,
  "rtime32_end_time": 1702956601,
  "comment_count": 0,
  "creator_steamid": "76561198187439478",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702952339
      },
      {
        "strSteamID": "76561198187439478",
        "rtUpdated": 1702949969
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703206364
      }
    ]
  },
  "announcement_body": {
    "gid": "3902996144652327832",
    "clanid": "3703047",
    "posterid": "76561198187439478",
    "headline": "Aggiornamento di Dota 2 del 18 dicembre 2023",
    "posttime": 1702952340,
    "updatetime": 1703206364,
    "body": [
      "Nel corso degli ultimi giorni abbiamo risolto diversi problemi legati al gameplay:",
      "[list]",
      "[*]Risolto il problema per cui il bonus all'area d'effetto del Diaspro Sanguigno rimaneva attivo per le abilità passive anche se l'oggetto veniva venduto o lasciato a terra.",
      "[*]Risolto il problema per cui il bonus di rigenerazione del mana della Spina Insanguinata era pari a 3,0 anziché 3,5 dalla somma dei suoi componenti.",
      "[*]Risolto il problema per cui la Farfalla non considerava la velocità d'attacco base dell'Eroe per i suoi bonus.",
      "[*]Risolto il problema per cui l'effetto di Squarcio non funzionava per gli attacchi magici (ad esempio con la Spilla del Redivivo).",
      "[*]Risolto un crash raro del server legato all'attivazione del Doblone.",
      "[*]Risolto il problema per cui la Khanda non infliggeva danno letale nel modo corretto.",
      "[*]Risolto il problema per cui la Khanda e il Filatterio non condividevano il tempo di ricarica.",
      "[*]Risolto il problema per cui Lancio dell'albero, Lancio, Assunzione dell'anima e Bomba adesiva non attivavano il Filatterio e la Khanda.",
      "[*]Corretta l'interazione tra Filatterio/Khanda e Pugnale spettrale di Spectre.",
      "[*]Risolto il problema per cui il Filatterio e la Khanda non funzionavano sulle illusioni.",
      "[*]Risolto il problema per cui Martello della tempesta faceva ottenere più Agilità che Intelligenza.",
      "[*]Risolto il problema per cui la Parasma non faceva ottenere 1,5 di rigenerazione del mana dai suoi componenti.",
      "[*]Risolto il problema per cui la Spilla del Redivivo faceva ottenere l'effetto di Attacco perfetto.",
      "[*]Risolto un crash del server provocato dall'interazione tra il termine di Scudo afotico di Abaddon, la Bolla Protettiva e la Cotta di Lame.",
      "[*]Risolto il problema per cui Tempesta doppia di Arc Warden non clonava la Pappa Reale.",
      "[*]Risolto il problema per cui talvolta il martello di Schianto stellare non viaggiava nella direzione selezionata.",
      "[*]Risolto il problema per cui le Unità che non attaccano a distanza ricevevano l'effetto di Attacco perfetto dal Ghiacciaio di Drow Ranger.",
      "[*]Risolti alcuni casi in cui Drow Ranger poteva rimanere bloccata mentre cercava di allontanarsi dal suo Ghiacciaio.",
      "[*]Risolto il problema per cui Penitenza di Chen aumentava la gittata d'attacco dei suoi creep da mischia.",
      "[*]Risolto il problema per cui il bonus di rigenerazione di Favore divino di Chen non veniva applicato ai suoi creep.",
      "[*]Risolto il problema per cui il talento di livello 10 di Chen (riduzione del ritardo del teletrasporto) non veniva applicato correttamente.",
      "[*]Risolto il problema per cui Invoker non poteva raccogliere i frutti degli Stagni di Loto.",
      "[*]Risolto il problema per cui la frequenza d'attacco di Lama furiosa di Juggernaut non si aggiornava quando la velocità d'attacco dell'Eroe veniva modificata.",
      "[*]Risolto il problema per cui Onnisquarcio/Squarcio rapido di Juggernaut non danneggiavano le Unità eteree anche con la Spilla del Redivivo.",
      "[*]Corretta l'interazione tra Lama furiosa di Juggernaut e l'Arpione.",
      "[*]Risolto il problema per cui Congelamento a catena di Lich non beneficiava dei bonus che aumentano l'area d'effetto.",
      "[*]Risolto il problema per cui gli oggetti nella scorta dello Spirito Orso scomparivano dopo aver aumentato di livello l'abilità Evocazione dello Spirito Orso.",
      "[*]Risolto il problema per cui le cariche di Angelo custode di Omniknight non si aggiornavano correttamente quando lo Scettro di Aghanim veniva ottenuto e lasciato a terra.",
      "[*]Risolto il problema per cui il tipo di danno di Schianto corazzato di Pangolier non cambiava in danno fisico come doveva.",
      "[*]Risolto un crash raro del server legato a Smembramento di Pudge.",
      "[*]Risolto il problema per cui Ultima parola di Silencer infliggeva meno danni del previsto ai creep.",
      "[*]Corretto il funzionamento di Attacco ad area dell'Antico Dragone Nero.",
      "[*]Risolti alcuni crash del server.",
      "[*]Risolti vari problemi con le descrizioni.",
      "[*]Riaggiunta l'opzione per sostituire le icone degli Eroi sulla minimappa coi rispettivi nomi.",
      "[*]Risolto il problema per cui l'anteprima della minimappa nelle impostazioni non ridimensionava le frecce quando venivano modificate le dimensioni delle icone.",
      "[*]Risolto il problema per cui talvolta i personaggi alternativi venivano visualizzati sul modello di base (o viceversa) nell'Arsenale e nel menu di equipaggiamento.",
      "[/list]"
    ],
    "commentcount": 216,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1415727794_1702954120_0",
      "ModAct_1415727794_1702957647_4",
      "ModAct_487486347_1703038333_4",
      "mod_require_rereview"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "4038104133478028419",
    "event_gid": "3902996144652327831",
    "voteupcount": 5229,
    "votedowncount": 581,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133478028419",
  "rtime32_last_modified": 1703206364,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703038334,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 5228,
  "votes_down": 581,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133478028419",
  "clan_steamid_original": "103582791433224455"
}