{
  "gid": "3902996144652327831",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualización de Dota 2 del 18 de diciembre de 2023",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702952280,
  "rtime32_end_time": 1702956601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702952339
      },
      {
        "strSteamID": "76561198187439478",
        "rtUpdated": 1702949969
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703206364
      }
    ]
  },
  "announcement_body": {
    "gid": "3902996144652327832",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualización de Dota 2 del 18 de diciembre de 2023",
    "posttime": 1702952340,
    "updatetime": 1703206364,
    "body": [
      "En los últimos días, hemos abordado varios problemas de jugabilidad:",
      "[list]",
      "[*]Se corrigió la bonificación de área de efecto de Piedra de Sangre que se mantenía activa en habilidades pasivas si se soltaba o vendía.",
      "[*]Se corrigió que la regeneración de maná de Espina Sangrienta fuera de 3.0 en lugar de 3.5 de la suma de sus componentes.",
      "[*]Se corrigió que Mariposa no contara con la velocidad de ataque base del héroe para sus bonificaciones.",
      "[*]Se corrigió que Hendidura no funcionara en ataques mágicos (p. ej., en Broche del Renacido).",
      "[*]Se corrigió una caída del servidor poco común cuando se activaba o desactivaba Doblón.",
      "[*]Se corrigió que Khanda no causara daño letal correctamente.",
      "[*]Se corrigió que Khanda y Filacteria no compartían tiempos de recarga.",
      "[*]Se corrigió que Lanzar Árbol, Lanzamiento, Bola de Nieve, Toma de Almas y Bomba Lapa no activaran Filacteria o Khanda.",
      "[*]Se corrigió la interacción incorrecta entre Filacteria o Khanda y Daga Espectral de Spectre.",
      "[*]Ahora Filacteria y Khanda no funcionan en ilusiones.",
      "[*]Se corrigió que Martillo de Meteorito otorgara incorrectamente más Agilidad que Inteligencia.",
      "[*]Se corrigió que Parasma no otorgara 1.5 de regeneración de maná de sus componentes.",
      "[*]Se corrigió que Broche del Renacido otorgara incorrectamente Ataque Certero.",
      "[*]Se corrigió una caída del servidor causada por la interacción entre el fin de Escudo Afótico, Burbuja de Seguridad y Malla de Cuchillas de Abaddon.",
      "[*]Se corrigió que Duplicado de la Tempestad de Arc Warden no clonara Jalea Real.",
      "[*]Se corrigió que Quebrantaestrellas de Dawnbreaker algunas veces no iba en la dirección del objetivo.",
      "[*]Se corrigió que las unidades que no están a distancia recibían beneficios de Ataque Certero de Glaciar de Drow Ranger.",
      "[*]Se corrigieron algunos casos en los que Drow Ranger podía quedarse atorada cuando trataba de salir de Glacial.",
      "[*]Se corrigió que Penitencia de Chen otorgaba un alcance de ataque adicional a los creeps de cuerpo a cuerpo.",
      "[*]Se corrigió que la regeneración de Favor Divino de Chen no se aplicaba a los creeps de Chen.",
      "[*]Se corrigió que el talento de nivel 10 de retraso de teletransportación para Favor Divino de Chen no se aplicaba correctamente.",
      "[*]Se corrigió que Invoker no podía recoger lotos de las Fuentes de Loto.",
      "[*]Se corrigió que la frecuencia de ataque de Furia de la Hoja de Juggernaut no se actualizaba si cambia la velocidad de ataque de Juggernaut.",
      "[*]Se corrigió que Omnilátigo/Tajo Rápido de Juggernaut no infligían daño a las unidades etéreas, incluso con Broche del Renacido.",
      "[*]Se corrigió la interacción incorrecta de Furia de la Hoja de Juggernaut con Arpón.",
      "[*]Se corrigió que Congelación en Cadena de Lich no era afectada por el aumento de área de efecto.",
      "[*]Se corrigió que los objetos en la reserva del Oso se perdían cuando Lone Druid lo actualizaba.",
      "[*]Se corrigió que las cargas de Ángel Guardián de OmniKnight no se actualizaban correctamente cuando se adquiría o soltaba el Cetro de Aghanim.",
      "[*]Se corrigió que el tipo de daño por Salto Estruendoso de Pangolier no se cambiaba correctamente a daño físico.",
      "[*]Se corrigió una caída del servidor poco común con Descuartizar de Pudge.",
      "[*]Se corrigió que Última Palabra de Silencer infligía menos daño que lo previsto a los creeps.",
      "[*]Se corrigió que Ataque en Área de Dragón Negro no funcionaba correctamente.",
      "[*]Se corrigieron algunas caídas del servidor.",
      "[*]Se corrigieron varios errores con las descripciones emergentes.",
      "[*]Se volvió a agregar Nombres de héroes como una opción para los héroes en el minimapa.",
      "[*]Se corrigió un problema por el cual la vista previa de la configuración del minimapa no escalaba la flecha cuando se escalaba el ícono.",
      "[*]Se corrigió un error por el cual la vista previa de objetos del personaje a veces no los mostraba en el modelo base (o viceversa) en Armería/Equipamiento.",
      "[/list]"
    ],
    "commentcount": 298,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1415727794_1702954120_0",
      "ModAct_1415727794_1702957647_4",
      "ModAct_487486347_1703038333_4",
      "ModAct_1415588329_1703206498_4"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "4038104133478028419",
    "event_gid": "3902996144652327831",
    "voteupcount": 14814,
    "votedowncount": 1582,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133478028419",
  "rtime32_last_modified": 1708465092,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703206498,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 14814,
  "votes_down": 1582,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133478028419",
  "clan_steamid_original": "103582791433224455"
}