{
  "gid": "3902996144652327831",
  "clan_steamid": "103582791433224455",
  "event_name": "Ενημέρωση Dota 2 – 18/12/2023",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702952280,
  "rtime32_end_time": 1702956601,
  "comment_count": 0,
  "creator_steamid": "76561198187439478",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702952339
      },
      {
        "strSteamID": "76561198187439478",
        "rtUpdated": 1702949969
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703206364
      }
    ]
  },
  "announcement_body": {
    "gid": "3902996144652327832",
    "clanid": "3703047",
    "posterid": "76561198187439478",
    "headline": "Ενημέρωση Dota 2 – 18/12/2023",
    "posttime": 1702952340,
    "updatetime": 1703206364,
    "body": [
      "Τις τελευταίες ημέρες διορθώσαμε πολλά προβλήματα παιχνιδιού:",
      "[list]",
      "[*]Διορθώθηκε πρόβλημα όπου η επαύξηση της περιοχής επίδρασης του Bloodstone παρέμενε ενεργή σε παθητικές ικανότητες, αν γινόταν πώληση ή ρίψη του αντικειμένου.",
      "[*]Διορθώθηκε πρόβλημα όπου η αναπλήρωση ενέργειας του Bloodthorn ήταν 3 αντί για 3,5 από το άθροισμα των συστατικών του.",
      "[*]Διορθώθηκε πρόβλημα όπου το Butterfly δεν προσμετρούσε τη βασική ταχύτητα επίθεσης του ήρωα για τις επαυξήσεις του.",
      "[*]Διορθώθηκε πρόβλημα όπου η παράπλευρη επίθεση δεν λειτουργούσε σε μαγικές επιθέσεις (δηλαδή από το Revenant's Brooch).",
      "[*]Διορθώθηκε σπάνιος απρόσμενος τερματισμός διακομιστή κατά την εναλλαγή του Doubloon.",
      "[*]Διορθώθηκε πρόβλημα όπου το Khanda δεν προκαλούσε σωστά θανάσιμη ζημιά.",
      "[*]Διορθώθηκε πρόβλημα όπου τα Khanda και Phylactery δεν είχαν κοινή επαναφόρτιση.",
      "[*]Διορθώθηκε πρόβλημα όπου τα Tree Throw, Toss, Snowball, Soul Assumption και Sticky Bomb δεν ενεργοποιούσαν το Phylactery ή το Khanda.",
      "[*]Διορθώθηκε λανθασμένη αλληλεπίδραση μεταξύ των Phylactery και Khanda και του Spectral Dagger της Spectre.",
      "[*]Διορθώθηκε πρόβλημα όπου τα Phylactery και Khanda λειτουργούσαν σε ψευδαισθήσεις.",
      "[*]Διορθώθηκε πρόβλημα όπου το Meteor Hammer έδινε λανθασμένα περισσότερη σβελτάδα από ευφυΐα.",
      "[*]Διορθώθηκε πρόβλημα όπου το Parasma δεν παρείχε 1,5 αναπλήρωση ενέργειας από τα συστατικά του.",
      "[*]Διορθώθηκε πρόβλημα όπου το Revenant's Brooch παρείχε λανθασμένα Σίγουρη Επίθεση.",
      "[*]Διορθώθηκε απρόσμενος τερματισμός διακομιστή που προκαλούσε η αλληλεπίδραση μεταξύ της λήξης του Apothic Shield του Abaddon, του Safety Bubble και του Blade Mail.",
      "[*]Διορθώθηκε πρόβλημα όπου το Tempest Double του Arc Warden δεν κλωνοποιούσε το Royal Jelly.",
      "[*]Διορθώθηκε το Starbreaker της Dawnbreaker που περιστασιακά δεν πήγαινε στην κατεύθυνση του στόχου.",
      "[*]Διορθώθηκε πρόβλημα όπου μη τηλέμαχες μονάδες λάμβαναν τις επαυξήσεις Σίγουρης Επίθεσης του Glacier της Drow Ranger.",
      "[*]Διορθώθηκαν μερικές περιπτώσεις όπου η Drow Ranger μπορούσε να «κολλήσει» κατά την προσπάθειά της να αποχωρήσει από το Glacier της.",
      "[*]Διορθώθηκε πρόβλημα όπου το Penitence του Chen παρείχε επιπλέον βεληνεκές επίθεσης στα αγχέμαχα κριπάκια του Chen.",
      "[*]Διορθώθηκε πρόβλημα όπου η αναπλήρωση του Divine Favor του Chen δεν εφαρμοζόταν στα κριπάκια του Chen.",
      "[*]Διορθώθηκε πρόβλημα όπου το ταλέντο επιπέδου 10 του Chen, «-2 δευτ. καθυστέρηση τηλεμεταφοράς Divine Favor», δεν εφαρμοζόταν σωστά.",
      "[*]Διορθώθηκε πρόβλημα όπου ο Invoker δεν μπορούσε να λάβει λωτούς από τα σιντριβάνια λωτών.",
      "[*]Διορθώθηκε πρόβλημα όπου δεν ενημερωνόταν ο ρυθμός επίθεσης του Blade Fury του Juggernaut, αν άλλαζε η ταχύτητα επίθεσης του Juggernaut.",
      "[*]Διορθώθηκε πρόβλημα όπου τα Omnislash και Swiftslash του Juggernaut δεν προκαλούσαν ζημιά σε αιθέριες μονάδες, ακόμα και με Revenant's Brooch.",
      "[*]Διορθώθηκε πρόβλημα όπου το Blade Fury του Juggernaut δεν αλληλεπιδρούσε σωστά με το Harpoon.",
      "[*]Διορθώθηκε πρόβλημα όπου το Chain Frost του Lich δεν επηρεαζόταν από την αύξηση περιοχής επίδρασης.",
      "[*]Διορθώθηκε πρόβλημα όπου, όταν ο Lone Druid αναβάθμιζε την αρκούδα, χάνονταν τα αντικείμενά της.",
      "[*]Διορθώθηκε πρόβλημα όπου οι φορτίσεις του Guardian Angel του Omniknight δεν ενημερώνονταν σωστά με την απόκτηση και ρίψη του Aghanim's Scepter.",
      "[*]Διορθώθηκε πρόβλημα όπου ο τύπος ζημιάς του Shield Crash του Pangolier δεν άλλαζε σωστά σε φυσική ζημιά.",
      "[*]Διορθώθηκε σπάνιος απρόσμενος τερματισμός με το Dismember του Pudge.",
      "[*]Διορθώθηκε πρόβλημα όπου το Last Word του Silencer προκαλούσε λιγότερη ζημιά σε κριπάκια από την επιθυμητή.",
      "[*]Διορθώθηκε το Splash Attack του Μαύρου Δράκου που δεν λειτουργούσε σωστά.",
      "[*]Διορθώθηκαν μερικοί σπάνιοι απρόσμενοι τερματισμοί διακομιστή.",
      "[*]Διορθώθηκαν διάφορα προβλήματα επεξηγήσεων.",
      "[*]Προστέθηκαν ξανά τα «Ονόματα ηρώων» ως επιλογή για τους ήρωες στον μικρό χάρτη.",
      "[*]Διορθώθηκε πρόβλημα όπου στην προεπισκόπηση του μικρού χάρτη στις ρυθμίσεις, δεν κλιμακωνόταν το βέλος όταν κλιμακωνόταν το εικονίδιο.",
      "[*]Διορθώθηκε σφάλμα όπου η προεπισκόπηση αντικειμένων Περσόνα μπορούσε μερικές φορές να εμφανίσει το βασικό μοντέλο (ή το ανάποδο) στο Οπλοστάσιο και την Εξόπλιση.",
      "[/list]"
    ],
    "commentcount": 265,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1415727794_1702954120_0",
      "ModAct_1415727794_1702957647_4",
      "ModAct_487486347_1703038333_4",
      "ModAct_1415588329_1703206498_4"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "4038104133478028419",
    "event_gid": "3902996144652327831",
    "voteupcount": 11318,
    "votedowncount": 1123,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4038104133478028419",
  "rtime32_last_modified": 1705341342,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703206498,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11318,
  "votes_down": 1123,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133478028419",
  "clan_steamid_original": "103582791433224455"
}