{
  "gid": "3902996144652327831",
  "clan_steamid": "103582791433224455",
  "event_name": "Оновлення Dota 2 — 18 грудня 2023 року",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702952280,
  "rtime32_end_time": 1702956601,
  "comment_count": 0,
  "creator_steamid": "76561198187439478",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702952339
      },
      {
        "strSteamID": "76561198187439478",
        "rtUpdated": 1702949969
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703206364
      }
    ]
  },
  "announcement_body": {
    "gid": "3902996144652327832",
    "clanid": "3703047",
    "posterid": "76561198187439478",
    "headline": "Оновлення Dota 2 — 18 грудня 2023 року",
    "posttime": 1702952340,
    "updatetime": 1703206364,
    "body": [
      "За останні кілька днів ми виправили кілька ігроладних проблем:",
      "[list]",
      "[*]Виправлено помилку, через яку бонус області дії від Кривавого каменя (Bloodstone) зберігався навіть після його продажу чи викидання.",
      "[*]Виправлено помилку, через яку регенерація мани Кривавого шипа (Bloodthorn) не відповідала сумі його компонентів: 3,0 → 3,5.",
      "[*]Виправлено помилку, через яку бонуси від Метелика (Butterfly) не враховували базову швидкість атаки героя.",
      "[*]Виправлено помилку, через яку периферійна шкода не працювала з магічними атаками, як-от від Брошки примари (Revenant's Brooch).",
      "[*]Виправлено рідкісний збір сервера під час перемикання Дублона (Doubloon).",
      "[*]Виправлено помилку, через яку Ханда (Khanda) не завдавала належну смертельну шкоду.",
      "[*]Виправлено помилку, через яку в Ханди (Khanda) та Філактерії (Phylactery) не діяла спільна зарядка.",
      "[*]Виправлено помилку, через яку Деревокид (Tree Throw), Кидок (Toss), Сніжна куля (Snowball), Захоплення душ (Soul Assumption) та Бомба-липучка (Sticky Bomb) не активували Філактерію (Phylactery) та Ханду (Khanda).",
      "[*]Виправлено неправильну взаємодію між Філактерією (Phylactery), Хандою (Khanda ) та Спектральним кинджалом (Spectral Dagger) Спектральної Мари.",
      "[*]Виправлено помилку, через яку Філактерія (Phylactery) і Ханда (Khanda) спрацьовували в ілюзій.",
      "[*]Виправлено помилку, через яку Метеорний молот (Meteor Hammer) давав більше спритності, ніж інтелекту.",
      "[*]Виправлено помилку, через яку Паразма (Parasma) не давала +1,5 до регенерації мани.",
      "[*]Виправлено помилку, через яку атаки з Брошкою примари (Revenant's Brooch) не могли схибити.",
      "[*]Виправлено збій сервера, який викликала взаємодія між завершенням часу дії Темного щита (Aphotic Shield) Абаддона, Бульбашкою безпеки (Safety Bubble) та Укольчугою (Blade Mail).",
      "[*]Виправлено помилку, через яку Буремний двійник (Tempest Double) Вартового не клонував Медові стільники (Royal Jelly).",
      "[*]Виправлено помилку, через яку Зорелам (Starbreaker) Світанкової іноді не влучав у цільове місце.",
      "[*]Виправлено помилку, через яку істоти ближнього бою отримували істинний удар від Льодовика (Glacier) Дроу-Рейнджер.",
      "[*]Виправлено помилки, через які Дроу-Рейнджер іноді застрягала, коли намагалася вийти зі свого Льодовика (Glacier).",
      "[*]Виправлено помилку, через яку Каяття (Penitence) Чена давало додаткову дальність атаки його кріпам ближнього бою.",
      "[*]Виправлено помилку, через яку регенерація від Божественної прихильності (Divine Favor) Чена не діяла на його кріпів.",
      "[*]Виправлено помилку, через яку Ченів талант 10-го рівня «-2 с затримки телепортації від Divine Favor» не застосовувався правильно.",
      "[*]Виправлено помилку, через яку Заклинач не міг брати лотоси зі ставка лотосів.",
      "[*]Виправлено помилку, через яку швидкість атак Люті клинка (Blade Fury) Джаґернаута не змінювалася після зміни швидкості атаки героя.",
      "[*]Виправлено помилку, через яку Точкові удари (Omnislash) та Швидкі удари (Swiftslash) Джаґернаута не завдавали шкоди ефірним істотам навіть із Брошкою примари (Revenant's Brooch).",
      "[*]Виправлено неправильну взаємодію Люті клинка (Blade Fury) Джаґернаута з Гарпуном (Harpoon).",
      "[*]Виправлено помилку, через яку на Морозний ланцюг (Chain Frost) Ліча не впливало збільшення області дії.",
      "[*]Виправлено помилку, через яку ведмідь-дух втрачав предмети в сховку після покращення Прикликання ведмедя-духа (Summon Spirit Bear) у Самітного Друїда.",
      "[*]Виправлено помилку, через яку Ангел-охоронець (Guardian Angel) Вселицаря не оновлювався належним чином після отримання і втрати Скіпетра Аґаніма.",
      "[*]Виправлено помилку, через яку тип шкоди Щитолама (Shield Crash) Панґольєра не змінювався належним чином на фізичну шкоду.",
      "[*]Виправлено рідкісний збій сервера через Розчленування (Dismember) Пузаня.",
      "[*]Виправлено помилку, через яку Останнє слово (Last Word) Знемовлювача завдавало менше шкоди кріпам, ніж належить.",
      "[*]Виправлено помилку, через яку Вибухова атака (Splash Attack) чорного дракона працювала неправильно.",
      "[*]Виправлено кілька збоїв сервера.",
      "[*]Виправлено різні проблеми з підказками.",
      "[*]Повторно додано імена героїв як опцію для героїв на мінімапі.",
      "[*]Виправлено помилку, через яку в попередньому огляді налаштувань мінімапи не змінювався розмір стрілки, коли змінювався розмір піктограми.",
      "[*]Виправлено помилку, через яку під час попереднього огляду в зброярні чи спорядженні предмети персони іноді показувалися на базовій моделі (і навпаки).",
      "[/list]"
    ],
    "commentcount": 265,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1415727794_1702954120_0",
      "ModAct_1415727794_1702957647_4",
      "ModAct_487486347_1703038333_4",
      "ModAct_1415588329_1703206498_4"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "4038104133478028419",
    "event_gid": "3902996144652327831",
    "voteupcount": 11318,
    "votedowncount": 1123,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4038104133478028419",
  "rtime32_last_modified": 1705341342,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703206498,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11318,
  "votes_down": 1123,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133478028419",
  "clan_steamid_original": "103582791433224455"
}