{
  "gid": "3902996144652327831",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2 frissítés – 2023. december 18.",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702952280,
  "rtime32_end_time": 1702956601,
  "comment_count": 0,
  "creator_steamid": "76561198187439478",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702952339
      },
      {
        "strSteamID": "76561198187439478",
        "rtUpdated": 1702949969
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703206364
      }
    ]
  },
  "announcement_body": {
    "gid": "3902996144652327832",
    "clanid": "3703047",
    "posterid": "76561198187439478",
    "headline": "Dota 2 frissítés – 2023. december 18.",
    "posttime": 1702952340,
    "updatetime": 1703206364,
    "body": [
      "Az elmúlt néhány napban számos játékmeneti problémát orvosoltunk:",
      "[list]",
      "[*]Javítottuk, hogy a Bloodstone hatóterületi bónusza továbbra is aktív volt a passzív képességeken, ha eldobták vagy eladták.",
      "[*]Javítottuk, hogy a Bloodthorn manatöltődése 3,0 volt 3,5 helyett, ami az összetevőinek az összege.",
      "[*]Javítottuk, hogy a Butterfly nem vette figyelembe a hős alap támadási sebességét a bónuszaihoz.",
      "[*]Javítottuk, hogy a területi sebzés nem működött a mágikus támadásokon (pl. Revenant's Brooch).",
      "[*]Javítottunk egy ritka szerverösszeomlást a Doubloon átváltásakor.",
      "[*]Javítottuk, hogy a Khanda nem okozott halálos sebzést megfelelően.",
      "[*]Javítottuk, hogy a Khanda és a Phylactery nem osztoztak az újratöltődési időkön.",
      "[*]Javítottuk, hogy a Tree Throw, a Toss, a Snowball, a Soul Assumption és a Sticky Bomb nem aktiválták a Phylacteryt és a Khandát.",
      "[*]Javítottuk a Phylactery és a Khanda, valamint Spectre Spectral Daggerje közti helytelen interakciót.",
      "[*]Javítottuk, hogy a Phylactery és a Khanda működött illúziókon.",
      "[*]Javítottuk, hogy a Meteor Hammer helytelenül több ügyességet adott, mint intelligenciát.",
      "[*]Javítottuk, hogy a Parasma nem adott 1,5 manatöltődést az összetevőiből.",
      "[*]Javítottuk, hogy a Revenant's Brooch helytelenül True Strike-ot adott.",
      "[*]Javítottunk egy szerverösszeomlást, amit egy interakció okozott Abaddon lejáró Aphotic Shieldje, a Safety Bubble és a Blade Mail között.",
      "[*]Javítottuk, hogy Arc Warden Tempest Double-je nem másolta le a Royal Jellyt.",
      "[*]Javítottuk, hogy Dawnbreaker Starbreakerje néha nem a célzott irányba ment.",
      "[*]Javítottuk, hogy nem távolsági egységek is True Strike hatást kaptak Drow Ranger Glacier képességétől.",
      "[*]Javítottunk néhány esetet, amiknél Drow Ranger beakadhatott, amikor megpróbálta elhagyni a Glacierjét.",
      "[*]Javítottuk, hogy Chen Penitence képessége bónusz harctávot adott Chen közelharci creepjeinek.",
      "[*]Javítottuk, hogy Chen Divine Favor képességének töltődése nem alkalmazódott Chen creepjeire.",
      "[*]Javítottuk, hogy Chen 10. szintű „Divine Favor teleportálási késleltetés” Adottsága nem alkalmazódott megfelelően.",
      "[*]Javítottuk, hogy Invoker nem tudott lótuszokat felvenni a Lótuszmedencékből.",
      "[*]Javítottuk, hogy Juggernaut Blade Fury támadási üteme nem frissült, ha megváltozott Juggernaut támadási sebessége.",
      "[*]Javítottuk, hogy Juggernaut Omnislash és Swiftslash képessége nem sebezte az éteri egységeket, még a Revenant's Brooch-sal sem.",
      "[*]Javítottuk Juggernaut Blade Fury képességének helytelen interakcióját a Harpoonnal.",
      "[*]Javítottuk, hogy Lich Chain Frostjára nem hatott a hatóterület-növelés.",
      "[*]Javítottuk, hogy a medve talonjában levő tárgyak eltűntek, amikor Lone Druid fejlesztette a Spirit Beart.",
      "[*]Javítottuk, hogy Omniknight Guardian Angel töltetei nem frissültek megfelelően Aghanim's Scepter szerzésekor és eldobásakor.",
      "[*]Javítottuk, hogy Pangolier Shield Crash képességének sebzéstípusa nem lett helyesen fizikai sebzésre váltva.",
      "[*]Javítottunk egy ritka szerverösszeomlást Pudge Dismember képességénél.",
      "[*]Javítottuk, hogy Silencer Last Word képessége a kelleténél kevesebb sebzést okozott a creepeknek.",
      "[*]Javítottuk, hogy az Ancient Black Dragon Splash Attack képessége nem működött megfelelően.",
      "[*]Javítottunk néhány szerverösszeomlást.",
      "[*]Javítottunk különféle képességleírási hibákat.",
      "[*]Újra hozzáadtuk a hősneveket a minitérképen a hősökhöz választható lehetőségként.",
      "[*]Javítottuk, hogy a minitérkép beállítási előnézete nem méretezte át a nyilat az ikon átméretezésekor.",
      "[*]Javítottunk egy hibát, aminél hősavatár tárgyak előnézetekor a Fegyvertárban, illetve a Tárgykiosztásban azok néha az alap modellen jelentek meg (és fordítva).",
      "[/list]"
    ],
    "commentcount": 216,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1415727794_1702954120_0",
      "ModAct_1415727794_1702957647_4",
      "ModAct_487486347_1703038333_4",
      "mod_require_rereview"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "4038104133478028419",
    "event_gid": "3902996144652327831",
    "voteupcount": 5229,
    "votedowncount": 581,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133478028419",
  "rtime32_last_modified": 1703206364,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703038334,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 5228,
  "votes_down": 581,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133478028419",
  "clan_steamid_original": "103582791433224455"
}