{
  "gid": "3902996144652327831",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja Dota 2 – 18 grudnia 2023",
  "event_type": 12,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702952280,
  "rtime32_end_time": 1702956601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702952339
      },
      {
        "strSteamID": "76561198187439478",
        "rtUpdated": 1702949969
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703206364
      }
    ]
  },
  "announcement_body": {
    "gid": "3902996144652327832",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aktualizacja Dota 2 – 18 grudnia 2023",
    "posttime": 1702952340,
    "updatetime": 1703206364,
    "body": [
      "W ciągu ostatnich kilku dni zajęliśmy się wieloma problemami w rozgrywce:",
      "[list]",
      "[*]Naprawiono błąd powodujący, że premia na obszarze działania przedmiotu Bloodstone pozostawała aktywna dla umiejętności pasywnych po upuszczeniu lub sprzedaniu przedmiotu.",
      "[*]Naprawiono błąd powodujący, że regeneracja many przedmiotu Bloodthorn wynosiła 3 pkt. zamiast 3,5 pkt. z sumy jego części składowych.",
      "[*]Naprawiono błąd powodujący, że przedmiot Butterfly nie wliczał bazowej szybkości ataku bohatera na potrzeby przydzielania premii.",
      "[*]Naprawiono błąd powodujący, że przedmiot Cleave nie działał na atakach magicznych (np. po aktywacji Revenant's Brooch)",
      "[*]Naprawiono rzadko występujący błąd podczas przełączania przedmiotu Doubloon, który powodował nieoczekiwane zamknięcie serwera.",
      "[*]Naprawiono błąd powodujący, że przedmiot Khanda nie zadawał śmiertelnych obrażeń w prawidłowy sposób.",
      "[*]Naprawiono błąd powodujący, że przedmioty Khanda i Phylactery nie współdzieliły czasów oczekiwania.",
      "[*]Naprawiono błąd powodujący, że umiejętności Tree Throw, Toss, Snowball, Soul Assumption i Sticky Bomb nie aktywowały przedmiotów Phylactery i Khanda.",
      "[*]Naprawiono nieprawidłową interakcję między przedmiotami Phylactery i Khanda oraz umiejętnością Spectral Dagger od Spectre.",
      "[*]Naprawiono błąd powodujący, że przedmioty Phylactery i Khanda działały na iluzjach.",
      "[*]Naprawiono błąd powodujący, że przedmiot Meteor Hammer niepoprawnie przyznawał więcej punktów Zręczności niż Inteligencji.",
      "[*]Naprawiono błąd powodujący, że przedmiot Parasma nie przyznawał 1,5 pkt. regeneracji many, które powinien z jego części składowych.",
      "[*]Naprawiono błąd powodujący, że przedmiot Revenant's Brooch niepoprawnie wywoływał ataki, które nie mogły chybić.",
      "[*]Naprawiono błąd w interakcji między wygaśnięciem umiejętności Aphotic Shield od Abaddona a przedmiotami Safety Bubble i Blade Mail, który powodował nieoczekiwane zamknięcie serwera.",
      "[*]Naprawiono błąd powodujący, że umiejętność Tempest Double od Arc Wardena nie klonowała przedmiotu Royal Jelly.",
      "[*]Naprawiono błąd powodujący, że umiejętność Starbreaker od Dawnbreaker czasami nie podążała w określonym kierunku.",
      "[*]Naprawiono błąd powodujący, że jednostki niezasięgowe otrzymywały premię idealnej celności od umiejętności Glacier od Drow Ranger.",
      "[*]Naprawiono pewne przypadki, w których Drow Ranger mogła zablokować się podczas opuszczenia swojego wzgórza z umiejętności Glacier.",
      "[*]Naprawiono błąd powodujący, że umiejętność Penitence od Chena przyznawała premię do zasięgu ataku stworom pod kontrolą Chena walczącym wręcz.",
      "[*]Naprawiono błąd powodujący, że regeneracja z umiejętności Divine Favor od Chena nie była nakładana na stwory pod jego kontrolą.",
      "[*]Naprawiono błąd powodujący, że talent Chena na 10. poziomie zmniejszający opóźnienie teleportacji nie był stosowany poprawnie.",
      "[*]Naprawiono błąd powodujący, że Invoker nie był w stanie podnosić lotosów z basenów lotosu.",
      "[*]Naprawiono błąd powodujący, że częstotliwość ataku po użyciu umiejętności Blade Fury od Juggernauta nie była aktualizowana, jeśli zmieniła się jego szybkość ataku.",
      "[*]Naprawiono błąd powodujący, że umiejętności Omnislash i Swiftslash od Juggernauta nie zadawały obrażeń jednostkom eterycznym, nawet gdy miał on przedmiot Revenant's Brooch.",
      "[*]Naprawiono nieprawidłową interakcję umiejętności Blade Fury od Juggernauta z przedmiotem Harpoon.",
      "[*]Naprawiono błąd powodujący, że zwiększenie obszaru działania nie miało wpływu na umiejętność Chain Frost od Licha.",
      "[*]Naprawiono błąd powodujący, że przedmioty w schowku duchowego niedźwiedzia bywały tracone, gdy Lone Druid zwiększał poziom umiejętności Summon Spirit Bear.",
      "[*]Naprawiono błąd powodujący, że ładunki umiejętności Guardian Angel od Omniknighta nie były poprawnie aktualizowane po zdobyciu i upuszczeniu przedmiotu Aghanim's Scepter.",
      "[*]Naprawiono błąd powodujący, że typ obrażeń umiejętności Shield Crash od Pangoliera nie był prawidłowo zmieniany na obrażenia fizyczne.",
      "[*]Naprawiono rzadko występujący błąd z umiejętnością Dismember od Pudge'a, który powodował nieoczekiwane zamknięcie serwera.",
      "[*]Naprawiono błąd powodujący, że umiejętność Last Word od Silencera zadawała mniejsze obrażenia stworom, niż było to zamierzone.",
      "[*]Naprawiono błąd powodujący, że atak rozpryskowy czarnego smoka nie działał poprawnie.",
      "[*]Naprawiono kilka błędów powodujących nieoczekiwane zamknięcie serwera.",
      "[*]Rozwiązano rozmaite problemy ze wskazówkami.",
      "[*]Ponownie dodano opcję wyświetlania imion bohaterów na minimapie.",
      "[*]Naprawiono błąd powodujący, że podgląd ustawień na minimapie nie skalował strzałki przy skalowaniu ikon.",
      "[*]Naprawiono błąd powodujący, że podgląd przedmiotów persony czasami wyświetlał je na podstawowym modelu postaci (lub odwrotnie) w zbrojowni lub w wyposażeniu.",
      "[/list]"
    ],
    "commentcount": 298,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1415727794_1702954120_0",
      "ModAct_1415727794_1702957647_4",
      "ModAct_487486347_1703038333_4",
      "ModAct_1415588329_1703206498_4"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4038104133478028419",
    "event_gid": "3902996144652327831",
    "voteupcount": 14814,
    "votedowncount": 1582,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133478028419",
  "rtime32_last_modified": 1708465092,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703206498,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 14814,
  "votes_down": 1582,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133478028419",
  "clan_steamid_original": "103582791433224455"
}