{
  "gid": "3902996144652327831",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota 2 – Atualização de 18 de dezembro de 2023",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1702952280,
  "rtime32_end_time": 1702956601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702952339
      },
      {
        "strSteamID": "76561198187439478",
        "rtUpdated": 1702949969
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703206364
      }
    ]
  },
  "announcement_body": {
    "gid": "3902996144652327832",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota 2 – Atualização de 18 de dezembro de 2023",
    "posttime": 1702952340,
    "updatetime": 1703206364,
    "body": [
      "Ao longo dos últimos dias, corrigimos vários problemas de jogabilidade:",
      "[list]",
      "[*]Bloodstone: foram corrigidos casos onde o bónus de área de efeito adicional permanecia ativo em habilidades passivas mesmo se o item fosse largado ou vendido.",
      "[*]Bloodthorn: foi corrigido um bug que fazia com que o bónus de regeneração de mana fosse 3 em vez de 3,5 proveniente da soma dos componentes do item.",
      "[*]Butterfly: foi corrigido um caso onde os bónus deste item ignoravam a rapidez de ataque base do herói portador.",
      "[*]Foram corrigidos casos onde o efeito Cleave não funcionava em ataques mágicos (por exemplo, ataques afetados por Revenant's Brooth).",
      "[*]Doubloon: foi corrigida uma falha crítica que ocorria ao ativar este item.",
      "[*]Khanda: foi corrigido um problema que impedia este item de causar dano letal corretamente.",
      "[*]Khanda e Phylactery: o cooldown destes itens é agora partilhado corretamente.",
      "[*]Khanda e Phylactery: foram corrigidos casos onde as habilidades Tree Throw, Toss, Snowball, Soul Assumption e Sticky Bomb não ativavam os efeitos destes itens.",
      "[*]Khanda e Phylactery: foi corrigida uma interação incorreta entre estes itens e a habilidade Spectral Dagger (da Spectre).",
      "[*]Khanda e Phylactery: foi corrigido um bug que impedia estes itens de funcionar em ilusões.",
      "[*]Meteor Hammer: foi corrigido um caso em que este item concedia mais Agilidade do que Inteligência.",
      "[*]Parasma: foi corrigido um caso onde este item não concedia 1,5 de regeneração de mana proveniente dos seus componentes.",
      "[*]Revenant's Brooch: foi corrigido um caso onde este item concedia erroneamente o efeito True Strike.",
      "[*]Foi corrigida uma falha crítica do servidor causada pela interação entre o término da habilidade Aphotic Shield (do Abaddon) e os itens Safety Bubble e Blade Mail.",
      "[*]Arc Warden: foi corrigido um caso onde o Tempest Double não clonava o item Royal Jelly.",
      "[*]Dawnbreaker: foi corrigido um problema ocasional com a habilidade Starbreaker, que fazia com que o martelo não fosse na direção selecionada.",
      "[*]Drow Ranger: foram corrigidos casos onde unidades que não são Ranged (não atacam à distância) recebiam o efeito True Strike da colina de gelo criada pela habilidade Glacier.",
      "[*]Drow Ranger: foram corrigidos alguns casos onde a Drow Ranger podia ficar presa ao tentar sair da colina de gelo de Glacier.",
      "[*]Chen: foi corrigido um problema que fazia com que a habilidade Penitence concedesse um bónus de alcance de ataque a creeps Melee controlados por Chen.",
      "[*]Chen: foi corrigido um caso onde a regeneração da habilidade Divine Favor não se aplicava a creeps controlados por Chen.",
      "[*]Chen: foi corrigido um caso onde o talento de nível 10 que reduzia o atraso de teletransporte não era aplicado corretamente.",
      "[*]Invoker: foi corrigido um problema que impedia este herói de apanhar frutos das Fontes de Lótus.",
      "[*]Juggernaut: foi corrigido um caso em que a frequência de ataque da habilidade Blade Fury não era atualizada se a rapidez de ataque do Juggernaut mudasse.",
      "[*]Juggernaut: foram corrigidos casos onde as habilidades Omnislash e Swiftslash não causassem dano a unidades etéreas, mesmo com o item Revenant's Brooch.",
      "[*]Juggernaut: foi corrigida uma interação incorreta entre a habilidade Blade Fury e o item Harpoon.",
      "[*]Lich: foi corrigido um problema com a habilidade Chain Frost, que não era afetada por bónus que aumentam a área de efeito.",
      "[*]Lone Druid: foram corrigidos casos em que itens na arca do Spirit Bear desapareciam ao aumentar o nível da habilidade Summon Spirit Bear.",
      "[*]Omniknight: foram corrigidos casos onde as cargas da habilidade Guardian Angel não eram atualizadas corretamente ao adquirir e largar um Aghanim's Scepter.",
      "[*]Pangolier: foi corrigido um problema com o tipo de dano da habilidade Shield Crash, que não tinha sido alterado corretamente para dano físico.",
      "[*]Pudge: foi corrigida uma falha crítica rara do servidor que ocorria durante a utilização da habilidade Dismember.",
      "[*]Silencer: foi corrigido um problema com a habilidade Last Word, que causava menos dano a creeps do que o pretendido.",
      "[*]Ancient Black Dragon (creep): foi corrigido um problema com a habilidade Splash Attack, que não funcionava corretamente.",
      "[*]Foram corrigidas algumas falhas críticas do servidor.",
      "[*]Foram corrigidos vários problemas relacionados com textos descritivos.",
      "[*]Foi readicionada a opção para substituir os ícones dos heróis no minimapa pelos respetivos nomes.",
      "[*]Foi corrigido um problema na pré-visualização do minimapa nas definições, que não redimensionava as setas se o tamanho dos ícones tivesse sido alterado.",
      "[*]Foi corrigido um bug ocasional na pré‑visualização de Personas que fazia com que os itens aparecessem no modelo base (ou vice‑versa) no Arsenal e no menu de equipamento.",
      "[/list]"
    ],
    "commentcount": 297,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_1415727794_1702954120_0",
      "ModAct_1415727794_1702957647_4",
      "ModAct_487486347_1703038333_4",
      "ModAct_1415588329_1703206498_4"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "4038104133478028419",
    "event_gid": "3902996144652327831",
    "voteupcount": 15062,
    "votedowncount": 1619,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133478028419",
  "rtime32_last_modified": 1710280823,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703206498,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 15062,
  "votes_down": 1619,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133478028419",
  "clan_steamid_original": "103582791433224455"
}