{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Detrás de las sendas: Nido de Espinas",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Detrás de las sendas: Nido de Espinas",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[i]Te damos la bienvenida a «Detrás de las sendas», un blog donde nuestro equipo de desarrollo discute algunos de los desafíos, correcciones de errores y golpes de suerte casuales que nos encontramos al trabajar en un juego tan único como Dota.[/i]",
      "Durante un evento tan multitudinario como la Caída de la Corona, pudimos probar muchos experimentos: mapas generales, historias con ramificaciones, fichas con temática de héroes, minijuegos, cómics, arte pixelado y otras ideas que llevábamos años deseando explorar.",
      "La libertad que teníamos para probar fue lo que nos dio la confianza necesaria para asumir esos riesgos —algo que aprovechamos siempre en Valve—. Probar en el sentido de recopilar datos reales de los jugadores, de permitir que los datos desafíen nuestras suposiciones e incluso nos hagan cambiar de opinión. Muchas veces decimos que no entendemos del todo lo que desarrollamos hasta que vemos a los jugadores interactuar con el resultado final, así que intentamos llegar a ese punto lo antes posible.",
      "Esa mentalidad también influye en la forma en que tomamos decisiones, normalmente lo más tarde posible durante la fase de desarrollo, cuando tenemos los mejores datos, que son a veces los únicos datos. En todo momento, nos basamos en las experiencias de los propios jugadores para enfocarnos en lo que tiene eco y evitar lo que no lo tiene.",
      "En esta edición de [i]Detrás de las sendas[/i], repasaremos el desarrollo de algo que apareció relativamente tarde en la Caída de la Corona, la batalla del Acto IV entre nuestros héroes y la reina Imperia en el [i]Nido de Espinas[/i]. También vamos a usar este caso práctico para mostrar cómo influyen en nuestra toma de decisiones las pruebas de juego y los datos que generan.",
      "[h3]Llegar a Imperia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "El primer y único minijuego del Acto I fue un modesto juego de pesca en el que Tidehunter ponía a prueba tus habilidades para pescar con la esperanza de que le consiguieras el desayuno. Una buena parte del Acto I era así: pequeñas ideas repartidas por todo el mapa para ver con qué interactuaban los jugadores. Los alentadores datos de los jugadores del Acto I nos dieron la confianza necesaria para ser más atrevidos en el Acto II. Y para el Acto III ya estábamos lanzando [i]Sleet Fighter[/i], un juego de lucha con Tusk haciendo de camorrista en su bar de mala muerte favorito, [i]Ajedrez Dragón[/i], un duelo de ingenio contra Winter Wyvern al estilo de combinar 3, y [i]La Guarida de Zaug[/i], un matamarcianos que enfrentaba a un dragón diabólico contra Vengeful Spirit en el retorcido conjunto de cavernas de Icewrack. ",
      "Para cuando llegamos al Acto IV, ya teníamos una idea clara de lo que funcionaba y lo que no. ¿Qué tipo de datos? Datos de todo tipo, desde datos concretos como el número de jugadores de cada minijuego y la frecuencia con que volvían a jugar a cada minijuego, hasta datos que había que interpretar, como los comentarios que enviaban los usuarios y notas de las discusiones en línea. Tener las cosas tan claras nos dio la confianza para ir a por todas en un final arrollador: una batalla épica contra la malvada reina Imperia.",
      "Por supuesto, decidir qué tipo de juego debería ser esa batalla no fue fácil. Sabíamos que teníamos que ofrecer un espectáculo de alto nivel para colmar las expectativas de los jugadores. Pero también teníamos que ofrecer algo suficientemente distinto y que se pudiera volver a jugar para mantener la frescura después de varias partidas. Y, como era un minijuego diseñado para jugarse mientras se hacía cola para una partida, necesitaba ser intenso pero breve. Tenía que degustarse como un pincho lleno de sabor, no como una comida de tres platos.",
      "Para lograr el equilibrio adecuado, necesitábamos usar un género que combinase los altos valores de producción de [i]Sleet Fighter[/i] con la rejugabilidad de [i]Ajedrez Dragón[/i]. Al fin y al cabo, este iba a ser un enfrentamiento épico entre Vengeful Spirit, Skywrath Mage y el recién llegado Kez —⁠el trío de la historia en cuatro actos de la Caída de la Corona⁠— en su asalto al castillo de Imperia. Nuestra idea era que el jugador sintiera que se enfrentaba a la misión casi imposible de llegar hasta la reina.",
      "[h3]Tramando un plan[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Una idea que casi cuaja al inicio fue una batalla por turnos al estilo de los juegos de rol japonés. Pero pronto nos dimos cuenta de que no era lo más adecuado. Necesitábamos algo que sumergiera a los jugadores rápidamente en la acción, algo breve, intenso y lo suficientemente divertido para jugar mientras se hacía cola en Dota.",
      "Entonces fue cuando se nos ocurrió el género de supervivientes. La opción perfecta para una batalla épica y de alto riesgo contra un jefe era una especie de lluvia de balas a la inversa con oleadas interminables de enemigos. El jugador tendría que abrirse paso entre una multitud de enemigos, a la vez que usaba un poco de estrategia para aumentar sus distintas habilidades antes de tener que enfrentarse a Imperia en la batalla final. Además, nos sería fácil incluir en la acción habilidades y objetos que ya existían en Dota, de modo que los jugadores tuviesen una idea aproximada de cómo funcionaba todo.",
      "Como queríamos que la experiencia fuera relativamente breve, la rejugabilidad era otra pieza importante del rompecabezas. El género de supervivientes nos dio mucha variabilidad para que la experiencia no se repitiese nunca. No se garantizaba que los jugadores fuesen a obtener los artículos o eventos que esperaban en el orden exacto que ellos querían. La variabilidad te anima a seguir intentándolo, empezando desde cero de una manera que supone un reto, pero sin resultar insuperable o frustrante. No queríamos que ganaras la primera vez... pero sí queríamos que pudieras seguir jugando cuando perdieras. ",
      "[h3]Primeros prototipos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Los primeros prototipos de [i]Nido de Espinas[/i] tenían los mismos elementos básicos que la versión que se lanzó al final. El jugador elegía uno de los tres héroes, se enfrentaba a una oleada tras otra de enemigos y al final llegaba a Imperia. Estos primeros intentos no tenían nada remotamente divertido. A veces, un héroe deambulaba por un mapa casi vacío y, de vez en cuando, se encontraba con algún esqueleto. En otras ocasiones, las oleadas de enemigos eran tan abrumadoras que resultaba imposible ganar —o al menos eso creíamos, pero hablaremos de esto más adelante—. Sabíamos que en el fondo se escondía un juego divertido. Solo tuvimos que seguir torturando a los jugadores que estaban probando las malas compilaciones hasta que lo descubrimos.",
      "Cada empleado de Valve es como un conejillo de indias. Poner a alguien delante de una compilación es la forma en que descubrimos si algo funciona o —⁠en la mitad de los casos⁠— si [i]no[/i] funciona. Podemos pensar en muchas ideas, pero no sabemos realmente si las decisiones que tomamos son acertadas hasta que alguien se sienta a jugar.",
      "Al principio, quienes probaban el juego sobrevivían entre 3 y 6 minutos. Normalmente, eso indica que el juego no está equilibrado o que no se explicaron bien las reglas. Nos sentábamos con los jugadores para que nos explicasen su experiencia, los momentos en que no sabían qué hacer, las situaciones que se volvían abrumadoras hasta parecer imposibles e incluso los casos en que les resultaba aburrido. Después, volvíamos a nuestros escritorios, hacíamos algunos cambios y se los presentábamos a un jugador nuevo. Poco a poco, empezamos a ver avances.",
      "Y entonces ocurrió algo inesperado.",
      "Después de guiarnos a través de su primera partida, un jugador que acababa de perder preguntó: «¿Puedo intentarlo de nuevo?».",
      "Fue una reacción nueva y alentadora. Nido de Espinas no era todavía lo suficientemente bueno, pues normalmente se necesitaban tres intentos antes de entender cómo se podía ganar al prototipo. Pero al menos estaba bien que, por una vez, no estuviéramos obligando a nuestros compañeros de trabajo a jugar a un prototipo horrible, sino que eran ellos quienes pedían jugar de nuevo a nuestro horrendo prototipo.  Fue un pequeño destello de interés: «No odio esto del todo». Nos conformamos con esa reacción.",
      "Pero el verdadero momento de inspiración aún estaba por llegar.",
      "[h3]Mejora de los héroes[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Un aspecto clave del género de supervivientes que no tenían nuestras primeras versiones era la presión constante. Al principio, solo generábamos una oleada de cien esqueletos en ese nivel y dejábamos que el héroe acabara con ellos. Una vez que el héroe se libraba de todos ellos, hacíamos que apareciese la siguiente oleada con un nivel de dificultad mayor. Los jugadores que participaron en las pruebas se aburrieron de esto rápidamente. Una vez que se dieron cuenta de que el único objetivo era librarse de los malos sin parar, empezó a parecerles una pesadez. La única recompensa por matarlos de forma más eficiente era que podías luchar contra la siguiente oleada que venía antes y era más dura. ¿¡De verdad!?",
      "Con el tiempo, nos dimos cuenta de que, cuando aparecían cien esqueletos y el héroe empezaba a librarse de ellos, teníamos que iniciar una cuenta atrás de la oleada y seguir añadiendo esqueletos sin importar cuántos había matado el héroe. Cuando el temporizador llegaba a cero, hacíamos aparecer una oleada de enemigos más difícil y reiniciábamos la cuenta atrás. Así la presión no se detenía y el jugador no perdía el interés. ",
      "Y lo que es más importante, cambiaron los [i]objetivos[/i] del jugador. Cuando nuestro héroe estaba masacrando a un número cada vez menor de esqueletos, el objetivo era «Hacer que el número de esqueletos llegue a cero». Pero si el número de esqueletos [i]no disminuye aunque mueran muchos[/i], entonces los jugadores entienden rápidamente que el objetivo real es algo distinto. ",
      "En vez de eso, empezaron a centrarse en lo que [i]lograban[/i] al matar a todos esos esqueletos: en este caso, habilidades y mejoras. De repente, el objetivo no era «Matar a todos los esqueletos», sino «¿Cuántas de estas cosas puedo matar lo más rápido posible para volverme lo más [i]fuerte[/i] posible?». En lugar de parecer una tarea ardua, eliminar oleadas de enemigos comenzó a percibirse como buscar un objetivo más importante, donde cada enemigo muerto te acercaba a la configuración perfecta de tu héroe. ",
      "Como el paso a la siguiente oleada ya no consistía en acabar con todo lo que había en la anterior, también habíamos conseguido algo nuevo: un reloj compartido. Esto significaba que los jugadores ahora compartían el mismo ritmo, un lenguaje común para cuando las cosas empezaban a ponerse difíciles. Entonces, cuando un jugador decía «No soporto esa oleada de arañas en el minuto cuatro», todos los demás sabían instantáneamente lo que quería decir (esas arañas son lo peor).",
      "Por fin habíamos encontrado el punto de diversión. Este pequeño cambio de enfoque ayudó a aclarar lo que les gustaba a los jugadores y por qué, y desencadenó una cascada de nuevas ideas: mejoras más potentes, habilidades más locas y posibilidades para los héroes que ni siquiera habíamos considerado. De esta forma, los jugadores podían crear configuraciones de héroes radicalmente diferentes entre sí en una sola partida. Además, los jugadores estaban más involucrados durante las pruebas de juego y nos daban comentarios y sugerencias más útiles para incorporar en la siguiente versión.",
      "Bueno, si preguntábamos más de una vez. A veces, después de una prueba de juego, descubríamos que nuestros compañeros de trabajo ya no querían hablar con nosotros de lo positivo y lo negativo. Querían hablar entre ellos sobre sus configuraciones y discutir cuál era la mejor. ",
      "A medida que aumentaba la variedad de configuraciones, empezamos a preguntarnos si habíamos pasado por alto una pieza importante del rompecabezas: ¿y si los héroes fueran tan únicos como las habilidades? En los primeros prototipos, aparte de su habilidad inicial, la experiencia del jugador era prácticamente idéntica sin importar el héroe que se eligiese. Ahora los estábamos modificando para convertirlos en opciones verdaderamente únicas, haciendo a uno más fuerte, a otro más rápido, a otro mejor para hacer daño mágico, lo que aumentó aún más las variaciones en las configuraciones. Elegir un héroe en lugar de otro también significó abrir ramas específicas de habilidades que de otra manera no se hubieran podido configurar y, como la suerte es siempre un factor en las mejoras que se reciben, cada elección parecía ser una apuesta de alto riesgo.",
      "[h3]Los seis primeros minutos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Además, mientras te distraes tratando de descubrir qué rama de mejoras te llevará a Imperia, poco a poco vamos aumentando la dificultad. En algún momento, sin que te des cuenta, las oleadas de enemigos se vuelven letales, el ritmo se hace implacable y apenas puedes mantenerte a flote. ",
      "Al menos, ese era el objetivo. Con la llegada de las mejoras, cambiamos el ritmo del juego. Queríamos que la experiencia fuera intensa, pero sin que se extendiera más de lo debido. Sabíamos que la mayoría de los jugadores iban a jugar mientras estaban en cola para una partida. Pero, por otro lado, queríamos dejar suficiente espacio para que los jugadores disfrutasen viendo cómo se acumulaban las opciones de mejoras.",
      "Nuestros rudimentarios cálculos en papel de servilleta nos dieron unos doce minutos de juego en total, sin contar los tres minutos de lucha contra Imperia al final. Así que nos pusimos manos a la obra para marcar el ritmo de los primeros seis minutos. ¿Con qué frecuencia le damos al jugador la opción de añadir una mejora al héroe? ¿Cuándo pueden empezar a acumular habilidades? ¿Cuánto daño debe hacer cada habilidad para que resulte satisfactoria pero no excesivamente poderosa? ",
      "Como estábamos ajustando la jugabilidad por secciones, al centrarnos en los primeros seis minutos, en ese momento era prácticamente imposible jugar a los últimos seis minutos. Hacíamos que la gente probase a jugar durante los primeros seis minutos y luego hacíamos que parasen. [i]En teoría[/i], podían seguir jugando, pero todo lo que pasaba después del minuto seis era provisional. No se esperaba que jugasen más allá de ese punto. De hecho, les suplicamos a nuestros compañeros de trabajo que no lo hicieran. ",
      "Una consecuencia graciosa de hacer que las habilidades y las mejoras fueran tan divertidas fue que a quienes estaban probando el juego no les importaba que la segunda mitad del juego no estuviese lista todavía. Nos sentábamos con alguien que estaba probando el juego para ver la primera mitad. Una vez que llegaba a los seis minutos, le decíamos: ",
      "«Genial, gracias. ¿Puedes volver a empezar el juego?».",
      "Tras una pausa, nos contestaba: ",
      "«En realidad, espera, creo que puedo ganar». ",
      "Les recordábamos que los últimos seis minutos eran un infierno desequilibrado y cruel de enemigos copiados y pegados, y que en ese momento era imbatible. Decían que lo entendían. Los entrevistábamos sobre sus altibajos. Nos daban montones de comentarios excelentes sobre su experiencia durante los primeros seis minutos y luego volvíamos a nuestros escritorios; al ver que nos marchábamos, reanudaban el juego y trataban de ganar de todos modos. ",
      "Algunos de nuestros compañeros de trabajo se tomaron como afrenta personal el no poder superar los últimos seis minutos, que eran injustos con saña y literalmente imposibles. Y, mientras nosotros diseñábamos la primera parte del juego, se pusieron a colaborar y a romperse la cabeza para intentar superar el reto imposible de la segunda parte. ",
      "Y la cuestión es que lo consiguieron. ",
      "Con el tiempo, descubrieron la combinación precisa de habilidades superpoderosas que aún no habíamos perfeccionado y superaron la parte del juego que se consideraba imbatible. Eso explica muy bien el diseño de juegos, pero resulta aún más revelador del tipo de personas que se dedican a este tipo de diseño.",
      "[h3]Caos bajo control[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Al llegar al final del proceso de desarrollo, teníamos creado el minijuego principal. Las habilidades, los encuentros con minijefes y el enfrentamiento final con la reina Imperia estaban todos listos.  En ese momento, ya no buscábamos problemas sobre cómo funcionaba el juego, sino maneras de ajustar, equilibrar y pulir hasta dejar brillante lo que ya sabíamos que funcionaba. Continuamos haciendo pruebas de juego, pero redujimos las exhaustivas entrevistas después de las partidas y simplemente dejamos que la gente jugara para divertirse —y, por supuesto, para generar más datos—.",
      "Los datos cuantitativos que obteníamos en cada instancia eran importantes, pero los cualitativos proporcionados por los jugadores no se quedaban atrás. Hubo un ejemplo que pasará a la historia donde la prueba de juego terminó de forma épica con la Masa de las Lamentaciones —que internamente llamábamos «carnaza»— ocupando más de la mitad de la pantalla y devorando al jugador. En ese momento, el jugador tenía detrás a un grupo de compañeros de trabajo riéndose de su mala suerte. Sin dudarlo un instante, pulsó el botón para jugar de nuevo.",
      "Estábamos seguros de que teníamos algo que merecía la pena lanzar, así que ampliamos las pruebas de juego para que pudieran probarlo no solo quienes se habían ofrecido voluntarios, sino básicamente cualquier persona a la que pudiéramos acorralar en la empresa para que participase en una partida. En nuestros primeros prototipos, nos sorprendían a las 11 de la noche con mensajes como «El juego es demasiado difícil». Pero entonces, aunque todavía nos llegaban esos mensajes de las 11 de la noche, le seguía otro hacia las 3 de la mañana diciendo «No importa, ya lo superé». ",
      "Incluso con un juego casi terminado, seguimos trabajando en [i]Nido de Espinas[/i] hasta que lanzamos el Acto IV de la Caída de la Corona. Al principio de esta publicación, dijimos que podemos tomar mejores decisiones cuando contamos con buenos datos que las respalden. Bueno, ahora tenemos algunos datos. Considerando lo entusiasmados que estaban los jugadores internos por jugar (y volver a jugar) al juego, obtuvimos montones de datos para saber qué partes de lo que habíamos creado estaban teniendo éxito. No hay nada mejor para llenar de entusiasmo una sala repleta de desarrolladores de juegos que el momento en el que un juego empieza a ser divertido. Queríamos incluir cuantos más aspectos de los que sabíamos que funcionaban bien como fuera posible. Nuevos objetos, habilidades, historias e incluso oleadas. Cada vez que pensábamos que habíamos dado en el clavo, a alguien se le ocurría inevitablemente una idea más, «solo una más». Y, como normalmente era una idea genial, no podíamos evitar probarla.",
      "No fue solo que seguían surgiendo ideas sobre nuevas funciones, sino que se fueron haciendo cada vez mejores a medida que nos acercábamos al lanzamiento. Al principio, cuando las cosas estaban menos definidas, era difícil distinguir entre una característica potencialmente de alto valor y una poco valiosa. Cuando faltaba una semana, estaba claro cuáles eran los mejores lugares donde invertir nuestros recursos y tiempo para mejorar el juego.",
      "[h3]Abandonar el nido[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Mientras le dábamos los toques finales a [i]Nido de Espinas[/i], pudimos dar un paso atrás y mirarlo con nuevos ojos. El desafío había sido usar lo que habíamos aprendido de los actos anteriores y crear batallas contra jefes épicas y apropiadas como colofón de un evento multitudinario. Estábamos bastante contentos con lo que habíamos logrado, especialmente considerando las limitaciones de tiempo. Habíamos encontrado el punto de diversión.",
      "Lamentablemente, la diversión no había llegado todavía a la comunidad. Lo que no habíamos tenido en cuenta es que, como [i]Nido de Espinas[/i] era una batalla contra un jefe, esa batalla tenía que ocurrir —⁠cuando se espera que aparezca el jefe⁠— al final del juego. Esto supuso al menos uno o dos días de tortura silenciosa mientras esperábamos a que los mejores jugadores de Dota se abrieran paso por el Acto IV a velocidades inhumanas para por fin ver a los jugadores disfrutarlo. ",
      "Resulta que no tuvimos que esperar mucho. Pensamos que tendríamos al menos un día o dos antes de que alguien llegara a la sala del trono de la reina Imperia. Pero habíamos subestimado enormemente la rapidez con la que los jugadores de Dota pueden avanzar a través del contenido. Tan solo dieciséis horas después del lanzamiento —sí, [i]horas[/i]—, los primeros jugadores más apasionados se habían abierto paso a través de todo el último acto y estaban disfrutando por primera vez de [i]Nido de Espinas[/i].",
      "Y, con el tiempo, el resto de los jugadores también llegaron. En el momento de escribir estas notas, se ha jugado a [i]Nido de Espinas[/i] casi cien millones de veces. Si aún no lo has logrado o simplemente quieres probarlo una vez más, todavía se puede jugar en el Archivo de la Caída de la Corona en el cliente del juego.",
      "[h3]Aceptar la incertidumbre[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Esperamos que esta mirada entre bastidores sobre cómo el equipo de Dota crea un minijuego os haya dado una mejor idea de nuestro proceso, y no os haya hecho leer con horror esta publicación de blog al descubrir que nos lo inventamos todo sobre la marcha. Lo que realmente esperamos es que demuestre que el diseño de juegos no es un arte místico desarrollado por genios creadores de juegos que juntan sus dedos en habitaciones oscuras, sino un proceso iterativo de pruebas y errores impulsado por datos, ansiedad, pruebas de juego y fracasos, pruebas de juego y más fracasos, y más pruebas de juego.",
      "El desarrollo de juegos prospera gracias a la iteración. Lo que comienza como «sin ideas» lentamente se convierte en «alguna idea» al observar ideas pasadas que funcionaron. Luego se convierte en un prototipo malo al que nadie quiere jugar, pero lo hacemos de todos modos. A continuación, vemos que los jugadores no se divierten jugando y nos ponemos a arreglar todas las partes que no son divertidas, hasta que finalmente vemos que la gente se divierte jugando. Luego lo pulimos y lo pulimos, y miramos el calendario de lanzamiento y lloramos. El espíritu de Valve siempre ha sido aceptar la incertidumbre y permitir que los datos den forma al desarrollo. Eso significa que no siempre sacamos las cosas a tiempo, pero creemos que, cuando estén listas y salgan, os van a gustar."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091367,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}