{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Νέα από τα Μέτωπα: Θρόνος των Αγκαθιών",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Νέα από τα Μέτωπα: Θρόνος των Αγκαθιών",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[i]Καλώς ήρθατε ξανά στα «Νέα από τα Μέτωπα», τις αναρτήσεις ιστολογίου όπου μέλη της ομάδας ανάπτυξής μας θα μας εξηγούν μερικές από τις προκλήσεις, τις διορθώσεις σφαλμάτων και τα ευτυχή ατυχήματα που βρίσκουμε στον δρόμο μας, καθώς εργαζόμαστε σε ένα τόσο ξεχωριστό παιχνίδι όσο το Dota.[/i]",
      "Κατά τη διάρκεια του τεράστιου συμβάντος Crownfall, είχαμε την ευκαιρία να πειραματιστούμε με πολλά πράγματα: χάρτες περιοχής, ιστορίες με διακλαδώσεις, μάρκες με θέμα τους ήρωες, μίνι παιχνίδια, κόμικ, τέχνη πίξελ και άλλες ιδέες που ανυπομονούσαμε να εξερευνήσουμε εδώ και χρόνια.",
      "Αυτό που μας έδωσε τη σιγουριά για να πάρουμε αυτά τα ρίσκα (και κάτι που αξιοποιούμε συνέχεια εδώ στη Valve) είναι η ελευθερία που έχουμε για την πραγματοποίηση συνεχών βελτιώσεων μέσω της συλλογής πραγματικών δεδομένων από παίκτες, τα οποία δοκιμάζουν τις υποθέσεις μας και μπορούν μέχρι και να μας αλλάξουν γνώμη. Συχνά λέμε ότι δεν καταλαβαίνουμε απολύτως τι φτιάχνουμε, μέχρι να δούμε τους παίκτες να αλληλεπιδρούν με αυτό, οπότε προσπαθούμε να φτάσουμε σε αυτό το σημείο το συντομότερο δυνατόν.",
      "Αυτός ο τρόπος σκέψης καθορίζει και τη χρονική στιγμή των αποφάσεών μας, δηλαδή συνήθως στις μεταγενέστερες φάσεις της ανάπτυξης, όταν έχουμε τα καλύτερα δεδομένα (και μερικές φορές τίποτα άλλο). Σε κάθε μας βήμα, βασιζόμαστε στις πραγματικές εμπειρίες των παικτών για να εστιάσουμε πιο αποτελεσματικά σε ό,τι έχει απήχηση και να αποφύγουμε ό,τι δεν έχει.",
      "Σε αυτήν την έκδοση των [i]Νέων από τα Μέτωπα[/i], θα περιγράψουμε πώς αναπτύξαμε κάτι που κυκλοφόρησε σχετικά αργά στο Crownfall: την τελική μάχη της Πράξης IV μεταξύ των ηρώων μας και της Βασίλισσας Ιμπίρια, με τίτλο [i]Θρόνος των Αγκαθιών[/i]. Το χρησιμοποιούμε επίσης ως μελέτη περίπτωσης για να δείξουμε πώς η δοκιμή παιχνιδιών, καθώς και τα δεδομένα που δημιουργεί, μπορούν να καθορίσουν τον τρόπο που παίρνουμε αποφάσεις.",
      "[h3]Οδεύοντας προς την Ιμπίρια[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Το πρώτο (και μόνο) μίνι παιχνίδι στην Πράξη I ήταν το ταπεινό μίνι παιχνίδι ψαρέματος, όπου ο Tidehunter δοκίμασε τις ικανότητες σας στο ψάρεμα με καλάμι, ελπίζοντας ότι θα πιάσετε κάτι για το πρωινό του. Ένα μεγάλο μέρος της Πράξης I ήταν έτσι: μικρές ιδέες που σκορπίσαμε σε όλον τον χάρτη για να δούμε τι θα αρέσει στους παίκτες. Τα ενθαρρυντικά δεδομένα παικτών από την Πράξη I μάς έδωσαν τη σιγουριά που χρειαζόμασταν για να γίνουμε πιο περιπετειώδεις στην Πράξη II. Όταν φτάσαμε στην Πράξη III, κυκλοφορήσαμε το [i]Sleet Fighter[/i], ένα παιχνίδι ξύλου στο αγαπημένο μπαράκι του Tusk, το [i]Δρακοσκάκι[/i], μια πνευματική διαμάχη τύπου «ταίριαξε 3» ενάντια στη Winter Wyvern, καθώς και τη [i]Φωλιά του Ζάουγκ[/i], ένα shoot 'em up όπου ένας κακός δράκος έρχεται αντιμέτωπος με τη Vengeful Spirit μέσα στις στριφογυριστές σπηλιές της Icewrack. ",
      "Μέχρι να φτάσουμε στην Πράξη IV, είχαμε μια καλή αίσθηση του τι δουλεύει και τι όχι. Τι είδους δεδομένα; Τα πάντα, από αντικειμενικά, όπως το πόσοι παίκτες έπαιξαν κάθε μίνι παιχνίδι και πόσο συχνά, έως τα πιο υποκειμενικά, όπως σχόλια και παρατηρήσεις που υπέβαλαν οι χρήστες και συζητήσεις στο διαδίκτυο. Έτσι, είχαμε τη σιγουριά για να τα δώσουμε όλα σε ένα συναρπαστικό φινάλε: μια επική μάχη εναντίον της διαβολικής Βασίλισσας Ιμπίρια.",
      "Φυσικά, δεν ήταν εύκολο να αποφασίσουμε τι είδους παιχνίδι θα ήταν αυτή η μάχη. Γνωρίζαμε ότι έπρεπε να προσφέρει το θέαμα υψηλού επιπέδου που περίμεναν οι παίκτες. Αλλά έπρεπε, επίσης, να προσφέρει αρκετή ποικιλία και δυνατότητα επανάληψης, ώστε να παραμένει φρέσκο ακόμα κι όταν παιζόταν πολλές φορές. Εφόσον ήταν μίνι παιχνίδι, σχεδιασμένο να παίζεται στην ουρά αναμονής για κάποιον αγώνα, έπρεπε να είναι έντονο αλλά σύντομο. Θα έπρεπε να έχει την αίσθηση ενός νόστιμου σνακ, όχι ενός μεγάλου γεύματος.",
      "Για να πετύχουμε την κατάλληλη ισορροπία, χρειαζόμασταν ένα είδος που συνδύαζε τη μεγάλη αξία παραγωγής του [i]Sleet Fighter[/i] με τη δυνατότητα επανάληψης που είχε το [i]Δρακοσκάκι[/i]. Άλλωστε, αυτή θα ήταν η επική αναμέτρηση μεταξύ της Vengeful Spirit, του Skywrath Mage και του νεοεισερχόμενου Kez (των «τριών μεγάλων» μας από τις τέσσερις πράξεις της ιστορίας Crownfall) που εισέβαλαν στο κάστρο της Ιμπίρια. Θέλαμε οι παίκτες να νιώθουν ότι οι πιθανότητες ήταν εναντίον τους στην αποστολή τους να φτάσουν στη βασίλισσα.",
      "[h3]Κατάστρωση σχεδίου[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Μια ιδέα που συζητήθηκε θετικά για λίγο ήταν η μάχη με γύρους σε στιλ JRPG. Αλλά γρήγορα καταλάβαμε ότι δεν θα ταίριαζε. Χρειαζόμασταν κάτι που θα έβαζε τους παίκτες γρήγορα στη δράση. Κάτι σύντομο, έντονο και αρκετά διασκεδαστικό για να παίζεται στην ουρά μεταξύ αγώνων Dota.",
      "Και εκεί έσκασε μύτη το είδος «Επιζώντες». Μια «αντίστροφη κόλαση πυρών» με ατελείωτα κύματα εχθρών ήταν το τέλειο μέσο για μια επική μάχη όπου διακυβεύονται πολλά. Ο παίκτης θα έπρεπε να χαράξει τον δρόμο του μακελεύοντας ορδές εχθρών και χρησιμοποιώντας ταυτόχρονα στρατηγική, προκειμένου να ενδυναμώσει διάφορες ικανότητες στην προετοιμασία του για την τελική αναμέτρηση με την Ιμπίρια. Θα ήταν επίσης εύκολο να ενσωματώσουμε υπάρχοντα αντικείμενα και ικανότητες του Dota στη δράση, ώστε οι παίκτες να έχουν μια αίσθηση του πώς λειτουργούν τα πράγματα.",
      "Καθώς θέλαμε η εμπειρία να είναι σχετικά σύντομη, η δυνατότητα επανάληψης ήταν άλλο ένα μεγάλο κομμάτι του γρίφου. Το είδος «Επιζώντες» μάς έδωσε αρκετή διακύμανση, καθώς δεν επαναλαμβάνεται ποτέ η ίδια εμπειρία δύο φορές. Δεν είναι σίγουρο ότι οι παίκτες θα λάβουν τα αντικείμενα ή τα συμβάντα που αναμένουν ακριβώς με τη σειρά που θέλουν. Αυτή η διακύμανση σάς ενθαρρύνει να συνεχίσετε την προσπάθεια ξεκινώντας από το μηδέν, με τρόπο που δίνει μεν την αίσθηση της δυσκολίας, αλλά χωρίς να μοιάζει ανυπέρβλητος ή να προκαλεί εκνευρισμό. Δεν θέλαμε απαραίτητα να κερδίσετε την πρώτη φορά... Αλλά θέλαμε να συνεχίσετε να παίζετε αφού χάσετε. ",
      "[h3]Αρχικά πρωτότυπα[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Τα αρχικά πρωτότυπα του [i]Θρόνου των Αγκαθιών[/i] ξεκίνησαν με τα ίδια βασικά στοιχεία που υπάρχουν στην έκδοση που κυκλοφορήσαμε τελικά. Ο παίκτης διάλεγε έναν από τους τρεις ήρωες, αντιμετώπιζε το ένα κύμα εχθρών μετά το άλλο και έφτανε τελικά στην Ιμπίρια. Αυτό που έλειπε τελείως από τις πρώτες προσπάθειες ήταν η διασκέδαση. Μερικές φορές κάποιος ήρωας περιπλανιόταν σε έναν κυρίως άδειο χάρτη, συναντώντας πού και πού κάποιον σκελετό. Άλλες φορές τα κύματα των εχθρών ήταν τόσο συντριπτικά που ο παίκτης δεν είχε ρεαλιστικά καμία πιθανότητα να κερδίσει (ή έτσι νομίζαμε, περισσότερα για αυτό παρακάτω). Γνωρίζαμε ότι κάπου στο βάθος υπήρχε ένα διασκεδαστικό παιχνίδι. Απλά έπρεπε να συνεχίσουμε να βασανίζουμε τους δοκιμαστές μας με κακές δομές μέχρι να το ανακαλύψουμε.",
      "Κάθε υπάλληλος της Valve είναι πειραματόζωο και για να καταλάβουμε αν κάτι λειτουργεί (ή, πιο συχνά, [i]δεν[/i] λειτουργεί) είναι να τους βάλουμε να παίξουν μια δομή. Μπορούμε να σκεφτόμαστε ιδέες αιωνίως, αλλά μέχρι να κάτσει και να παίξει κάποιος, δεν ξέρουμε αν οι επιλογές μας ήταν σωστές.",
      "Στην αρχή, οι δοκιμαστές δυσκολεύονταν να επιβιώσουν στα πρώτα 3 με 6 λεπτά. Συνήθως, αυτό είναι σημάδι ότι το παιχνίδι δεν είναι σωστά ισορροπημένο ή ότι δεν έχουμε εξηγήσει καλά τους κανόνες του. Καθόμασταν μαζί τους και τους ζητούσαμε να μας μιλήσουν αναλυτικά για την εμπειρία τους: για τις στιγμές που δεν ήταν σίγουροι τι να κάνουν, για εκείνες που οι εχθροί ήταν συντριπτικοί και το παιχνίδι γινόταν αδύνατο ή ακόμα και για τις στιγμές που ένιωθαν βαρεμάρα. Στη συνέχεια, επιστρέφαμε στα γραφεία μας, κάναμε μερικές αλλαγές και τις δίναμε σε κάποιον νέο δοκιμαστή. Σιγά-σιγά, αρχίσαμε να βλέπουμε πρόοδο.",
      "Και τότε κάτι συνέβη.",
      "Αφού μας εξηγούσαν την πρώτη τους προσπάθεια, οι δοκιμαστές που είχαν μόλις χάσει ρωτούσαν: «Βασικά, μπορώ να προσπαθήσω ξανά;».",
      "Αυτό ήταν κάτι νέο και ενθαρρυντικό. Ο «Θρόνος των Αγκαθιών» είχε ακόμα πολύ δρόμο για να θεωρηθεί καλό παιχνίδι. Συνήθως, χρειάζονταν τουλάχιστον τρεις προσπάθειες μέχρι να καταλάβει κανείς πώς να κερδίσει, αλλά, επιτέλους, αντί να ζητάμε εμείς από τους συναδέλφους μας να παίξουν το άθλιο πρωτότυπό μας, ζητούσαν εκείνοι να το παίξουν δεύτερη φορά.  Υπήρχε ένας μικροσκοπικός βαθμός ενδιαφέροντος: «Δεν το απεχθάνομαι και τελείως». Ήμασταν χαρούμενοι για κάθε θετική εξέλιξη.",
      "Αλλά η αληθινή στιγμή «Εύρηκα!» δεν είχε έρθει ακόμα.",
      "[h3]Αναβαθμίσεις ηρώων[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Μια βασική πτυχή του είδους «Επιζώντες» που έλειπε από τις πρώτες εκδόσεις μας ήταν η συνεχής πίεση. Αρχικά, εμφανίζαμε απλώς ένα κύμα εκατό σκελετών στο επίπεδο και αφήναμε τον ήρωα να τους αποδεκατίζει. Όταν ο ήρωας τους αφάνιζε εξ ολοκλήρου, εμφανίζαμε το επόμενο κύμα κακών που συνοδευόταν από μεγαλύτερο βαθμό δυσκολίας. Οι δοκιμαστές το βαρέθηκαν γρήγορα. Όταν κατάλαβαν ότι ο μόνος στόχος ήταν να αποδεκατίζουν τους κακούς, άρχισε να μοιάζει με αγγαρεία. Η μόνη ανταμοιβή για την αποτελεσματική εξόντωσή τους ήταν ότι μπορούσαν να πολεμήσουν το επόμενο, πιο δύσκολο κύμα νωρίτερα. (Τέλεια;)",
      "Εντέλει, καταλάβαμε ότι όταν εμφανίζαμε εκατό σκελετούς και ο ήρωας ξεκίναγε να τους κάνει με τα κομματάκια, χρειαζόταν να θέσουμε αυτό το κύμα εντός ενός χρονικού ορίου και να συνεχίσουμε να προσθέτουμε σκελετούς, ανεξάρτητα από το πόσους σκότωνε ο ήρωας. Μόλις το χρονικό όριο έφτανε στο μηδέν, θα εμφανίζαμε ένα δυσκολότερο κύμα εχθρών με ένα νέο χρονικό όριο. Έτσι, η πίεση δεν μειωνόταν ποτέ και ο παίκτης παρέμενε προσηλωμένος. ",
      "Αλλά το πιο σημαντικό ήταν ότι οι [i]στόχοι[/i] του άλλαζαν. Όταν ο ήρωάς μας απλώς σφάγιαζε έναν αριθμό σκελετών που ολοένα και λιγόστευε, ο στόχος ήταν «Κάντε τον αριθμό των σκελετών να φτάσει στο μηδέν». Αλλά, εάν ο αριθμός των σκελετών [i]δεν μειώνεται ποτέ ανεξάρτητα από το πόσους σκοτώνετε[/i], τότε δεν παίρνει και πολύ χρόνο για να συνειδητοποιήσουν οι παίκτες ότι το να τους σκοτώσουν δεν είναι επί της ουσίας ο στόχος. ",
      "Αντίθετα, έστρεφαν την προσοχή τους σε αυτό που [i]λάμβαναν[/i] όταν σκότωναν όλους αυτούς τους σκελετούς, που σε αυτήν την περίπτωση ήταν ικανότητες και αναβαθμίσεις. Ξαφνικά, ο στόχος δεν ήταν «Σκοτώστε όλους τους σκελετούς», ήταν «Πόσα από αυτά τα πράγματα μπορώ να σκοτώσω όσο το δυνατόν πιο γρήγορα για να γίνω όσο πιο [i]ισχυρός[/i] γίνεται;». Αντί να μοιάζει με αγγαρεία, το μακέλεμα κυμάτων εχθρών άρχισε να μοιάζει με κυνήγι τζάκποτ, όπου κάθε σκοτωμός ήταν ένα βήμα πιο κοντά στην τέλεια αναβάθμιση. ",
      "Επειδή η μετάβαση στο επόμενο κύμα δεν ήταν πλέον αλληλένδετη με το να σκοτώνονται τα πάντα από το προηγούμενο, είχαμε επίσης κερδίσει κάτι νέο: ένα κοινό ρολόι. Αυτό σήμαινε ότι οι παίκτες μοιράζονταν πλέον τον ίδιο ρυθμό, μια κοινή γλώσσα για το πότε τα πράγματα άρχιζαν να γίνονται δύσκολα. Οπότε, όταν κάποιος παίκτης έλεγε «Δεν αντέχω αυτό το κύμα αραχνών στο τέταρτο λεπτό», όλοι οι άλλοι καταλάβαιναν αμέσως τι εννοούσε (αυτές οι αράχνες είναι ό,τι χειρότερο).",
      "Επιτέλους βρήκαμε τη διασκέδαση. Αυτή η μικρή αλλαγή έκανε ξεκάθαρο το τι απολαμβάνουν οι παίκτες και γιατί, και οδήγησε σε έναν χείμαρρο νέων ιδεών: πιο ισχυρές αναβαθμίσεις, πιο τρελές ικανότητες και δυνατότητες αναβάθμισης ηρώων που δεν μας είχαν περάσει καν από το μυαλό. Αυτό σήμαινε ότι οι αναβαθμίσεις ηρώων που μπορούσαν να κάνουν οι δοκιμαστές σε κάθε παιχνίδι ήταν ριζικά διαφορετικές μεταξύ τους. Σαν αποτέλεσμα, ήταν πιο αφοσιωμένοι κατά τη διάρκεια αυτών των δοκιμών και μας έδιναν καλύτερα σχόλια και προτάσεις για να προσθέσουμε στην επόμενη δομή του παιχνιδιού.",
      "Αρκεί να ρωτούσαμε παραπάνω από μία φορά. Μετά από τη δοκιμή, διαπιστώναμε μερικές φορές ότι οι συνάδελφοί μας δεν ήθελαν να μας μιλήσουν πλέον για αυτά που τους άρεσαν περισσότερο και λιγότερο. Ήθελαν να μιλήσουν μεταξύ τους για τις αναβαθμίσεις των ηρώων τους και να συζητήσουν ποιες ήταν καλύτερες. ",
      "Καθώς η ποικιλία των αναβαθμίσεων συνέχιζε να αυξάνεται, αρχίσαμε να αναρωτιόμαστε αν έχουμε παραλείψει κάποιο μεγάλο κομμάτι του παζλ. Τι θα γινόταν αν οι ίδιοι οι ήρωες απέπνεαν ένα αίσθημα μοναδικότητας όπως ακριβώς και οι ικανότητες; Στα αρχικά πρωτότυπα, πέρα από την αρχική τους ικανότητα, η εμπειρία των παικτών ήταν σε μεγάλο βαθμό πανομοιότυπη, ανεξάρτητα από τον ήρωα που επέλεγαν. Πλέον μέσα από τροποποιήσεις και μικροδιορθώσεις τούς αναγάγαμε σε πραγματικά μοναδικές επιλογές, κάνοντας τον ένα πιο ισχυρό, τον άλλο ταχύτερο και έναν άλλο καλύτερο στη μαγική ζημιά, κάτι το οποίο διεύρυνε την ποικιλία των αναβαθμίσεων ακόμα πιο πολύ. Η επιλογή ενός ήρωα αντί ενός άλλου σήμαινε επίσης ότι «ξεκλειδώνονταν» έτσι συγκεκριμένοι κλάδοι ικανοτήτων, οδηγώντας τον παίκτη σε μια κατεύθυνση αναβαθμίσεων προς την οποία διαφορετικά δεν θα μπορούσε να πάει (και επειδή ο παράγοντας της τύχης λίγο πολύ πάντα υπάρχει όσον αφορά τις αναβαθμίσεις που παίρνετε, κάθε επιλογή έμοιαζε με ριψοκίνδυνο στοίχημα).",
      "[h3]Τα πρώτα έξι λεπτά[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Εντωμεταξύ, ενώ εσείς προσπαθείτε να βρείτε ποιος κλάδος αναβαθμίσεων θα σας οδηγήσει στην Ιμπίρια, εμείς αυξάνουμε σιγά-σιγά τη δυσκολία. Σε κάποια φάση, χωρίς καν να το παρατηρήσετε, τα κύματα των εχθρών γίνονται θανάσιμα, ο ρυθμός είναι αδυσώπητος και εσείς μετά βίας τα βγάζετε πέρα. ",
      "Τουλάχιστον, αυτός ήταν ο στόχος. Με τις αναβαθμίσεις να μπαίνουν σε τάξη, αρχίσαμε να ασχολούμαστε με τον ρυθμό του παιχνιδιού. Θέλαμε η εμπειρία να είναι έντονη, αλλά να μην γίνεται κουραστική (ξέραμε ότι οι περισσότεροι παίκτες θα έπαιζαν ενώ βρίσκονταν στην ουρά για κάποιον αγώνα). Από την άλλη, όμως, θέλαμε να αφήσουμε αρκετό περιθώριο ώστε να μπορούν οι παίκτες να απολαύσουν τις επιλογές αναβάθμισής τους.",
      "Με πρόχειρα μαθηματικά υπολογίσαμε περίπου δώδεκα λεπτά συνολικού χρόνου παιχνιδιού, χωρίς να λαμβάνουμε υπόψη την τρίλεπτη μάχη με την Ιμπίρια στο τέλος. Έτσι, αρχίσαμε να εργαζόμαστε πάνω στον ρυθμό των πρώτων έξι λεπτών. Πόσο συχνά να δίνουμε στον παίκτη μια επιλογή αναβάθμισης; Πόσο νωρίς να αρχίσουν να συσσωρεύουν ικανότητες; Πόση ζημιά θα πρέπει να προκαλεί κάθε ικανότητα ώστε να δημιουργεί ένα αίσθημα ικανοποίησης, αλλά όχι υπερβολής; ",
      "«Κουρδίζαμε» το παιχνίδι ανά ενότητες και επειδή είχαμε επικεντρωθεί στα πρώτα έξι λεπτά, τα τελευταία έξι λεπτά ήταν ουσιαστικά δυσλειτουργικά σε αυτήν τη φάση. Βάζαμε κόσμο να δοκιμάσει τα πρώτα έξι λεπτά του παιχνιδιού και μετά τους αναγκάζαμε να σταματήσουν. [i]Από τεχνικής άποψης[/i], θα μπορούσαν να συνεχίσουν να παίζουν, αλλά μετά το έκτο λεπτό δεν υπήρχαν παρά προσωρινά στοιχεία. Δεν προβλεπόταν να παίξουν πέρα από αυτό (στην πραγματικότητα παρακαλέσαμε τους συναδέλφους μας να μην το κάνουν). ",
      "Ένα αστείο επακόλουθο του ότι οι ικανότητες και οι αναβαθμίσεις έγιναν τόσο διασκεδαστικές, ήταν ότι οι δοκιμαστές δεν είχαν κάποιο θέμα που το μισό παιχνίδι δεν λειτουργούσε. Καθόμασταν στο γραφείο ενός συναδέλφου και τον παρακολουθούσαμε να παίζει το πρώτο μισό του παιχνιδιού. Μόλις έφτανε στο έκτο λεπτό: ",
      "«Τέλεια, ευχαριστούμε», λέγαμε. «Μπορείς να αρχίσεις το παιχνίδι από την αρχή;»",
      "Παύση. ",
      "«Βασικά, κάτσε λίγο, νομίζω ότι μπορώ να το τερματίσω.» ",
      "Του υπενθυμίζαμε ότι τα τελευταία έξι λεπτά ήταν μια βασανιστική, ανομοιόμορφη ερημιά με τους ίδιους και τους ίδιους εχθρούς, στην οποία ήταν αδύνατο να κερδίσει προς το παρόν. Έλεγε ότι καταλαβαίνει. Τον ρωτούσαμε για αυτά που του άρεσαν περισσότερο και λιγότερο. Μας έδινε πολλά και σπουδαία σχόλια και παρατηρήσεις για το πώς έπαιξε τα πρώτα έξι λεπτά. Και έπειτα γυρίζαμε πίσω στα γραφεία μας, μάς έβλεπε να φεύγουμε, ξεκινούσε το παιχνίδι από εκεί που το είχε αφήσει και προσπαθούσε πάραυτα να νικήσει. ",
      "Κάποιοι από τους συναδέλφους μας το πήραν ως προσωπική προσβολή ότι δεν μπορούσαν να νικήσουν τα τελευταία ανελέητα άδικα, κυριολεκτικά αήττητα έξι λεπτά. Έτσι, ενώ εμείς σχεδιάζαμε το πρώτο μισό του παιχνιδιού, εκείνοι ένωναν τις δυνάμεις τους και έσπαγαν το κεφάλι τους για να βρουν πώς να νικήσουν στο ανυπέρβλητο δεύτερο μισό. ",
      "Και δεν θα το μαντέψετε: Τα κατάφεραν. ",
      "Ανακάλυψαν τελικά τον ακριβή συνδυασμό υπερβολικά δυνατών ικανοτήτων που δεν είχαμε τελειοποιήσει ακόμα και κέρδισαν το μέρος του παιχνιδιού που δεν είχε σχεδιαστεί να νικιέται (που μας διδάσκει πολλά για τον σχεδιασμό παιχνιδιών ή, μάλλον, για το είδος των ανθρώπων που ασχολούνται με τον σχεδιασμό παιχνιδιών).",
      "[h3]Ελεγχόμενο χάος[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Μέχρι το τέλος της διαδικασίας ανάπτυξης, ο βασικός σκελετός του παιχνιδιού είχε φτιαχτεί. Οι ικανότητες, οι μάχες με μίνι αρχηγούς και η τελική αναμέτρηση με τη Βασίλισσα Ιμπίρια ήταν όλα έτοιμα.  Σε εκείνο το σημείο, δεν ψάχναμε πλέον για προβλήματα που θα ήταν ανασταλτικά για τη λειτουργία του παιχνιδιού, αλλά για τρόπους να προσαρμόσουμε, να εξισορροπήσουμε και να τελειοποιήσουμε αυτό που ήδη ξέραμε ότι λειτουργεί. Συνεχίσαμε να κάνουμε δοκιμές, αλλά είχαμε ελαττώσει τις εκ των υστέρων εκτενείς συνεντεύξεις και απλώς αφήναμε κόσμο να παίζει για να διασκεδάζει (και, φυσικά, για να έχουμε περισσότερα δεδομένα).",
      "Αν και τα ποσοτικά δεδομένα που είχαμε λάβει από κάθε δοκιμή παιχνιδιού ήταν σημαντικά, τα ποιοτικά δεδομένα ήταν εξίσου σημαντικά. Ένα αξιοσημείωτο παράδειγμα: Μια δοκιμή παιχνιδιού έληξε σαν έπος με τη Μάζα των Ουρλιαχτών (γνωστή μεταξύ μας και ως «Κεφτές») να καταλαμβάνει πάνω από τη μισή οθόνη και να καταβροχθίζει τον παίκτη. Όταν συνέβη αυτό, ο δοκιμαστής είχε ένα πλήθος συνεργατών από πίσω του να τον παρακολουθεί και να γελάει με την κακή του τύχη. Φυσικά, πάτησε κατευθείαν το κουμπί «Παίξτε ξανά».",
      "Ήμασταν βέβαιοι ότι είχαμε στα χέρια μας κάτι που άξιζε να κυκλοφορήσει. Έτσι, από εκεί που οι δοκιμαστές ήταν μόνο όσοι είχαν προσφερθεί εθελοντικά, ανοίξαμε τις δοκιμές σε οποιονδήποτε πετυχαίναμε στην εταιρεία και τον πείθαμε να παίξει. Στα αρχικά πρωτότυπα, μας ερχόταν μήνυμα στο Slack στις 11 μ.μ. που έλεγε «Το παιχνίδι είναι πολύ δύσκολο». Σε εκείνη τη φάση, εξακολουθούσαμε να δεχόμαστε μηνύματα στο Slack στις 11 μ.μ., αλλά με ένα δεύτερο μήνυμα στις 3 π.μ. που έλεγε «Άκυρο, το τερμάτισα». ",
      "Παρότι το παιχνίδι ήταν σχεδόν έτοιμο, εργαζόμασταν ακόμα πάνω στον [i]Θρόνο των Αγκαθιών[/i] μέχρι που κυκλοφορήσαμε την Πράξη IV του Crownfall. Πολύ πίσω, στην αρχή αυτής της ανάρτησης, είπαμε ότι μπορούμε να παίρνουμε καλύτερες αποφάσεις όταν έχουμε αξιόπιστα δεδομένα για να τις υποστηρίξουμε. Τώρα λοιπόν είχαμε μερικά: Χάρη στους εσωτερικούς δοκιμαστές που έπαιζαν (και ξαναέπαιζαν) με ενθουσιασμό το παιχνίδι, είχαμε άφθονα δεδομένα για να καταλάβουμε ποια κομμάτια του είχαν τη μεγαλύτερη απήχηση. Και τίποτα δεν προκαλεί περισσότερο ενθουσιασμό σε ένα δωμάτιο γεμάτο προγραμματιστές από τη στιγμή που το παιχνίδι αρχίζει να είναι διασκεδαστικό. Θέλαμε να φτιάξουμε περισσότερα από τα πράγματα που ξέραμε ότι λειτουργούσαν, όσα περισσότερα μπορούσαμε να χωρέσουμε. Νέα αντικείμενα, ικανότητες, ιστορία, ακόμη και κύματα. Κάθε φορά που νομίζαμε ότι είχαμε τελειοποιήσει το παιχνίδι, ήταν σίγουρο ότι κάποιος θα έβρισκε «μία ακόμη» ιδέα. Και επειδή συνήθως η ιδέα ήταν πολύ καλή, δεν μπορούσαμε να αντισταθούμε και να μην τη δοκιμάσουμε.",
      "Δεν ήταν μόνο ότι οι ιδέες για χαρακτηριστικά συνέχιζαν να έρχονται: συνέχιζαν να γίνονται ολοένα και καλύτερες καθώς πλησιάζαμε στην κυκλοφορία. Τον πρώτο καιρό, όταν δεν υπήρχε ακόμα συγκεκριμένη μορφή, ήταν δύσκολο να γίνει διάκριση μεταξύ ενός χαρακτηριστικού με δυνητικά υψηλή αξία και ενός με πραγματικά χαμηλή. Όταν φτάσαμε στην τελευταία εβδομάδα πριν την κυκλοφορία, τα καταλληλότερα σημεία στα οποία έπρεπε να αφιερώσουμε πόρους και χρόνο για να κάνουμε το παιχνίδι καλύτερο ήταν ξεκάθαρα.",
      "[h3]Αφήνοντας τον θρόνο πίσω[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Καθώς βάζαμε τις τελευταίες πινελιές στον [i]Θρόνο των Αγκαθιών[/i], μπορέσαμε να κάνουμε ένα βήμα πίσω και να τον δούμε με μια φρέσκια μάτια. Η πρόκληση ήταν να χρησιμοποιήσουμε πράγματα που είχαμε μάθει από προηγούμενες πράξεις, ούτως ώστε να δημιουργήσουμε μια αρμοστή και επική μάχη αρχηγών που θα λειτουργούσε ως επίλογος ενός τεράστιου συμβάντος. Ήμασταν αρκετά ευχαριστημένοι με αυτό που καταφέραμε να κάνουμε, ειδικά δεδομένων των χρονικών περιορισμών. Βρήκαμε τη διασκέδαση.",
      "Δυστυχώς, η κοινότητα δεν την είχε βρει ακόμα. Αυτό που δεν είχαμε σκεφτεί ήταν ότι, αφού ο [i]Θρόνος των Αγκαθιών[/i] ήταν μια μάχη αρχηγών, λογικά η τοποθεσία του έπρεπε να είναι στο… ε, εκεί που μένει ο αρχηγός, στο τέλος του παιχνιδιού. Αυτό ισούταν με τουλάχιστον μία ή δύο μέρες σιωπηλού μαρτυρίου όπου περιμέναμε τους ισχυρούς παίκτες του Dota να ολοκληρώσουν με κόπο την Πράξη IV σε υπεράνθρωπες ταχύτητες, για να δούμε πότε οι παίκτες θα έχουν επιτέλους την ευκαιρία να παίξουν τον Θρόνο των Αγκαθιών. ",
      "Εντέλει, δεν χρειάστηκε να περιμένουμε και πολύ. Θεωρήσαμε ότι θα έπαιρνε τουλάχιστον μία-δύο ημέρες ωσότου κάποιος να φτάσει στην αίθουσα του θρόνου της Βασίλισσας Ιμπίρια. Αποδείχθηκε ότι υποτιμήσαμε σε μεγάλο βαθμό με τι υπερηχητική ταχύτητα κινούνται οι παίκτες του Dota όταν είναι να οργώσουν περιεχόμενο του παιχνιδιού. Μόλις δεκαέξι ώρες μετά την κυκλοφορία – μάλιστα, [i]ώρες[/i] – οι πρώτοι ισχυροί παίκτες είχαν ήδη αγωνιστεί και ολοκληρώσει ολόκληρη την τελευταία πράξη και έπαιρναν την πρώτη τους γεύση από τον [i]Θρόνο των Αγκαθιών[/i].",
      "Και εντέλει, έφτασαν και οι υπόλοιποι εκεί. Τη στιγμή που γράφτηκε αυτή η ανάρτηση, ο [i]Θρόνος των Αγκαθιών[/i] είχε παιχτεί σχεδόν εκατό εκατομμύρια φορές (εάν εσείς δεν έχετε φτάσει ακόμα εκεί ή απλώς θέλετε να δοκιμάσετε την τύχη σας μία ακόμη φορά, μπορείτε να παίξετε μέσω του Αρχείου Crownfall στην εφαρμογή).",
      "[h3]Αγκαλιάζοντας την αβεβαιότητα[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Ελπίζουμε ότι αυτή η παρασκηνιακή ματιά στο πώς η ομάδα του Dota στήνει ένα μίνι παιχνίδι και το κάνει λειτουργικό σάς έδωσε μια καλύτερη ιδέα για το πώς δουλεύουμε και δεν σας έκανε να κοιτάτε αυτήν την ανάρτηση με τρόμο, σκεπτόμενοι ότι τα βγάζουμε απ' το μυαλό μας καθώς γράφουμε. Αλλά πραγματικά, ελπίζουμε πως αυτό αποδεικνύει ότι ο σχεδιασμός παιχνιδιών δεν είναι κάποια απόκρυφη τέχνη από ιδιοφυείς δημιουργούς παιχνιδιών που κάθονται σκεπτικοί σε σκοτεινά δωμάτια, αλλά μια επαναλαμβανόμενη διαδικασία δοκιμών και σφαλμάτων που συνοδεύεται από δεδομένα, άγχος, δοκιμές παιχνιδιού, αποτυχία, δοκιμές παιχνιδιού, περισσότερες αποτυχίες και περισσότερες δοκιμές παιχνιδιού.",
      "Η ανάπτυξη παιχνιδιών επωφελείται από τις συνεχείς βελτιώσεις: αυτό που ξεκινά ως «δεν έχω ιδέα» μετατρέπεται σιγά-σιγά σε «μια ιδέα», κοιτάζοντας παλαιότερες ιδέες που δούλεψαν. Στη συνέχεια, μετατρέπεται σε ένα κακό πρωτότυπο που κανείς δεν θέλει να παίξει, αλλά το φτιάχνουμε όπως και να 'χει. Μετά, τους παρακολουθούμε να το παίζουν χωρίς να περνάνε καλά και αρχίζουμε να διορθώνουμε όλα τα μη διασκεδαστικά σημεία, μέχρι τελικά να δούμε τον κόσμο να διασκεδάζει παίζοντάς το. Στη συνέχεια, κάνουμε τελικές αλλαγές επί τελικών αλλαγών, κοιτάζοντας το χρονοδιάγραμμα κυκλοφορίας και κλαίγοντας με μαύρο δάκρυ. Η φιλοσοφία της Valve ήταν πάντοτε να αγκαλιάζει την αβεβαιότητα και να αφήνει τα δεδομένα να διαμορφώνουν την ανάπτυξη. Αυτό σημαίνει ότι τα πράγματα δεν κυκλοφορούν πάντοτε στην ώρα τους. Αλλά πιστεύουμε ότι όταν είναι έτοιμα, θα σας αρέσουν."
    ],
    "commentcount": 4,
    "tags": [],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091375,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}