{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Entre les lanes : Nid d'épines",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Entre les lanes : Nid d'épines",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[i]Le blog « Entre les lanes » revient pour donner la parole à nos dévs. L'équipe y relate certains des défis auxquels elle a dû faire face, les corrections de bugs et les heureux accidents qui arrivent parfois en travaillant sur un jeu aussi unique que Dota ou un évènement aussi marquant que The International.[/i]",
      "La Chute de la couronne a été l'occasion pour nous de faire de nombreuses expériences : des cartes de campagne, des intrigues avec plusieurs embranchements, des jetons héroïques, des minijeux, des bandes dessinées, du pixel art et d'autres idées que nous avions hâte d'explorer depuis des années.",
      "Ce qui nous a donné la confiance nécessaire pour prendre ces risques (c'est d'ailleurs un avantage dont nous profitons constamment chez Valve), c'est la liberté d'itérer : recueillir des données réelles sur les joueurs et les joueuses, laisser ces données remettre en question nos hypothèses et même nous faire changer d'avis. Nous répétons toujours que, pour comprendre pleinement ce que nous construisons, nous avons besoin de voir les gens interagir avec nos réalisations. Nous essayons donc d'atteindre ce stade le plus rapidement possible.",
      "Cet état d'esprit influence également la prise de décisions, bien souvent le plus tard possible dans la phase de développement, lorsque nous disposons des meilleures données (et parfois des seules). À chaque étape, nous nous appuyons sur les expériences réelles de la communauté pour nous aider à nous concentrer sur ce qui marche et éviter le reste.",
      "Dans cette édition d'[i]Entre les lanes[/i], nous aborderons le processus de développement d'un minijeu qui a été mis en ligne assez tard dans La Chute de la couronne : le combat de boss de l'Acte IV entre nos valeureux protagonistes et la reine Imperia dans son [i]Nid d'épines[/i]. Ce minijeu se révèle également être l'étude de cas idéale pour vous parler de nos procédés de tests, de gestion des données récoltées et de nos prises de décisions.",
      "[h3]Atteindre Imperia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Le premier (et le seul) minijeu de l'Acte I consistait en une modeste partie de pêche dans lequel un Tidehunter affamé mettait vos compétences de pêche à l'épreuve. C'est d'ailleurs comme ça que nous avons abordé l'Acte I : de nombreuses petites idées éparpillées sur la carte afin de jauger la réaction des joueurs et des joueuses. Le bon accueil de l'Acte I, confirmé par des données encourageantes, nous a donné la confiance nécessaire pour passer à l'Acte II, et dès l'Acte III, nous avons lancé [i]Sleet Fighter[/i], un minijeu dans la taverne préférée de Tusk, le [i]Jeu d'échecs du dragon[/i], un combat de type Match 3 contre Winter Wyvern et [i]L'antre de Zaug[/i], un shoot 'em up opposant un dragon maléfique à Vengeful Spirit à travers les tunnels souterrains sinueux des landes de Glace. ",
      "Arrivé l'Acte IV, nous avions une idée précise de ce qui fonctionnait et de ce qui ne fonctionnait pas. Comment avons-nous fait ? Nous avons examiné toutes les données que nous avions sous la main, qu'il s'agisse de détails concrets (combien de personnes ont relancé les minijeux et à quelle fréquence) ou de questions plus subjectives, comme les commentaires envoyés par la communauté et les discussions en ligne. Ces retours ont conforté notre choix de nous lancer dans un bouquet final époustouflant : un combat de boss épique contre la méchante reine Imperia.",
      "Bien sûr, décider du type de mécanique de jeu à adopter pour un tel combat ne fut pas tâche aisée. Nous savions que les attentes étaient élevées et que nous devions proposer un spectacle digne de ce nom. Mais il devait également offrir suffisamment de variété et de rejouabilité pour rester amusant même après plusieurs tentatives. Et comme ce minijeu était placé pendant l'attente avant de trouver une partie, il se devait d'être à la fois bref et intense. On voulait proposer un amuse-bouche délicieux, pas un banquet interminable.",
      "Pour trouver le juste équilibre, nous avions besoin d'un genre combinant la qualité de [i]Sleet Fighter[/i] avec la rejouabilité de [i]Dragon Chess[/i]. Après tout, il s'agirait de la confrontation épique entre Vengeful Spirit, Skywrath Mage, le nouveau venu Kez (les trois personnages principaux des quatre actes de La Chute de la couronne) et la reine Imperia, au sein même de sa forteresse. Nous voulions donner l'impression qu'une succession d'obstacles impossibles à surmonter se dressait dans la quête menant à la reine.",
      "[h3]Élaboration du plan[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "L'idée d'une bataille au tour par tour de style JRPG nous a brièvement traversé l'esprit, mais nous avons rapidement abandonné cette piste. Il nous fallait quelque chose qui plonge directement dans l'action, suffisamment court, intense et amusant pour se divertir entre deux parties de Dota.",
      "C'est là que l'idée d'un survivor-like nous est venue. L'idée d'un bullet hell inversé, avec des vagues infinies de monstres, s'est imposée comme le genre idéal pour un combat de boss épique à l'enjeu capital. Il allait falloir se frayer un chemin à travers des hordes farouches, tout en usant d'un peu de stratégie pour améliorer des capacités et se préparer à la confrontation finale avec Imperia. Nous n'avions qu'à nous inspirer des items et des capacités déjà dans Dota et ainsi permettre aux joueurs et aux joueuses de savoir à quoi s'attendre.",
      "Comme nous voulions un minijeu assez court, la rejouabilité était une autre pièce importante du puzzle. Un survivor-like, grâce à sa variabilité inhérente, promettait des parties toujours différentes. Il est impossible de prédire à quel moment ou dans quel ordre tel item sera offert ou tel évènement se déclenchera. La variabilité encourage la persévérance. Certes, il faut repartir de zéro, mais le défi ne semble pas insurmontable ou frustrant pour autant. Le but n'était pas de vous faire gagner dès le premier essai, mais il ne fallait pas non plus que cela soit source de découragement. ",
      "[h3]Premiers prototypes[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Les premiers prototypes de [i]Nid d'épines[/i] démarraient déjà avec les mêmes éléments de base que ceux de la version définitive. On choisissait parmi trois unités héroïques, on affrontait des vagues de monstres et on se mesurait à Imperia. Il ne manquait qu'un seul ingrédient à ces premières versions : du plaisir. Parfois, il fallait parcourir une carte presque vide avant de se heurter à un pauvre squelette. D'autres fois, les vagues de monstres étaient si écrasantes qu'il n'était pas possible de gagner (du moins c'est ce que nous pensions, mais nous reviendrons sur ce point plus tard). Enfoui sous ces prototypes, le jeu avait du potentiel. À nous de torturer notre équipe de test avec des versions nulles et de creuser jusqu'à ce que nous le trouvions.",
      "Chez Valve, tout le monde sert de cobaye : on vous fait essayer un build, et c'est comme ça que l'on découvre ce qui marche (ou tout aussi souvent, ce qui [i]ne marche pas[/i]). Nous pouvons imaginer mille-et-une choses, mais à moins que quelqu'un ne s'assoie et ne joue au produit, nous n'avons aucun moyen de savoir si les choix que nous avons faits sont les bons.",
      "Dans les premières versions, survivre pendant les 3 à 6 premières minutes relevait de l'exploit. En général, c'est un indicateur que le jeu est déséquilibré ou que ses règles sont mal expliquées. Nous écoutions les retours de membres de l'équipe de test, qui nous faisaient part de leur expérience : on ne sait pas où aller, il se passe trop de choses, on s'ennuie, etc. Nous retournions ensuite à nos bureaux pour apporter quelques modifications avant de faire tester le build par une autre personne de l'équipe. Petit à petit, nous avons commencé à constater des progrès.",
      "C'est alors qu'un miracle s'est produit.",
      "Après nous avoir raconté sa première tentative, une personne qui venait de perdre nous a demandé : « Est-ce que je peux réessayer ? »",
      "C'était nouveau et encourageant. Nid d'épines était encore à des années-lumière d'être un bon minijeu. Cela prenait généralement trois essais pour remporter une victoire sur notre prototype. Mais au moins, nous n'avions plus à forcer nos collègues à jouer à notre jeu à la noix. Cette fois, les cobayes se portaient eux-mêmes volontaires pour y rejouer !  Nous décelions là une infime lueur de fun, qui se traduisait par : « J'ai déjà vu pire. » C'était déjà beaucoup !",
      "Le véritable miracle restait à venir.",
      "[h3]Builds héroïques[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "L'un des aspects caractéristiques du genre survivor-like qui manquait à nos premières versions était la pression constante. Au départ, nous faisions apparaitre une vague de centaines de squelettes dans le niveau et laissions le protagoniste faire le ménage. Une fois les squelettes anéantis, une nouvelle vague de monstres plus puissants prenait leur place. Les avis étaient unanimes : on s'ennuie ! Une fois qu'on a identifié que le seul objectif consiste à trucider des méchants, le jeu se transforme vite en corvée. La seule récompense obtenue après avoir éliminé une vague de monstres plus efficacement, c'était le déferlement rapide d'une autre vague encore plus difficile. (Super…)",
      "On a fini par avoir l'idée d'intégrer un chronomètre à ce déferlement de squelettes et de faire grossir toujours plus leurs rangs, peu importe combien notre héros ou héroïne en désossait. Quand le temps imparti était écoulé, on ajoutait une nouvelle vague de monstres avec son propre chronomètre. Ainsi, la pression était constante et le jeu est tout de suite devenu plus captivant. ",
      "Mais surtout, le [i]but[/i] du jeu avait changé. Quand nos protagonistes s'activaient à massacrer un nombre décroissant de squelettes, l'objectif était de « faire en sorte que le nombre de squelettes passe à zéro ». Mais si le nombre de squelettes à massacrer [i]ne diminuait jamais[/i], les joueurs et les joueuses ne tarderaient pas à réaliser que les tuer n'était pas vraiment l'objectif. ",
      "Leur attention s'est alors portée sur ce qu'on [i]obtenait[/i] en tuant tous ces squelettes, autrement dit, les capacités et améliorations. Soudain, l'objectif n'était plus « Puis-je tuer tous les squelettes ? », mais « Combien puis-je en tuer le plus vite possible pour [i]gagner en puissance[/i] ? » La destruction de vagues de monstres est alors passée d'une corvée à une course au gros lot, chaque élimination vous rapprochant du build parfait. ",
      "Comme le passage à la vague suivante n'était plus lié à l'éradication de la vague précédente, nous avons ajouté un nouvel élément : une horloge partagée. Ainsi, tout le monde partageait désormais le même rythme et savait exactement quand les choses allaient se corser. Si je vous dis « J'ai horreur de cette vague d'araignées à la quatrième minute », vous savez exactement de quoi je parle.",
      "Le fun était enfin au rendez-vous ! Ce petit changement de perspective nous a permis de comprendre ce que les gens appréciaient et pourquoi, et a donné naissance à une cascade de nouvelles idées : des améliorations plus puissantes, des capacités toujours plus dévastatrices et des possibilités de build que nous n'avions même pas envisagées. L'équipe de test pouvait désormais créer des builds radicalement différents pour leur protagoniste, et ce même au cours d'une même partie. Se sentant plus investie, l'équipe nous a alors envoyé de meilleurs retours et des suggestions pour améliorer la version suivante.",
      "Enfin, pour ça, il a fallu insister. Parfois après un test, nos collègues ne voulaient plus parler des points à améliorer, mais plutôt discuter de leur builds et se disputer sur qui avait le meilleur. ",
      "Alors même que la variété des builds ne cessait de croitre, nous avons commencé à nous demander si nous n'avions pas oublié une pièce importante du puzzle : et si les unités héroïques elles-mêmes devenaient aussi uniques que leurs capacités ? Dans les premiers prototypes, hormis la capacité de départ, l'expérience de jeu était relativement similaire, peu importe le personnage choisi. Nous avons donc décidé de les modifier pour rendre le choix du personnage plus déterminant : l'un serait plus fort, un autre plus rapide, et le dernier infligerait plus de dégâts magiques, ce qui augmentait encore la variabilité des builds. Le choix du personnage ouvrait alors des branches spécifiques de capacités qui n'auraient pas pu être développées autrement. (Et comme il y avait toujours un facteur chance dans l'obtention des améliorations, chaque choix devenait un pari risqué.)",
      "[h3]Les six premières minutes[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Alors même que vous devez vous concentrer sur le choix de vos améliorations pour avoir toutes vos chances contre Imperia, nous augmentons la difficulté en douce. À un moment donné, sans crier gare, les vagues de monstres deviennent mortelles et le rythme effréné, si bien que le simple fait de garder la tête hors de l'eau relève de l'exploit. ",
      "Ou du moins, c'était le but. Au fur et à mesure des améliorations, le rythme du jeu ne cessait de s'accélérer. Nous voulions que l'expérience soit intense, sans pour autant devenir décourageante. (Nous savions que le minijeu servirait de divertissement pendant la recherche de parties.) Toutefois, nous voulions laisser suffisamment de répit pour que les joueurs et les joueuses puissent voir le résultat de leurs choix d'améliorations.",
      "À vue de nez, le minijeu devait se terminer en environ douze minutes, sans compter les trois minutes de combat contre Imperia à la fin. Nous avons alors planché sur le rythme à adopter lors des six premières minutes. À quelle fréquence proposer une nouvelle amélioration ? À quel stade peut-on commencer à cumuler des capacités ? Combien de dégâts chaque capacité doit-elle infliger pour être satisfaisante sans paraitre surpuissante ? ",
      "À force d'affiner le gameplay section par section, en nous concentrant sur les six premières minutes, les six dernières minutes étaient devenues pratiquement injouables. Les sessions de tests portaient uniquement sur les six premières minutes, après quoi nous y mettions fin. [i]Techniquement[/i], le jeu ne s'arrêtait pas là, mais tout ce qui venait après était encore en chantier. « Circulez, il n'y a rien à voir. » (Nous avons dû implorer nos collègues de ne pas dépasser la limite.) ",
      "Le fait d'avoir rendu les capacités et les améliorations aussi amusantes à utiliser a eu un effet secondaire : parmi les personnes testant le jeu, rares étaient celles qui se souciaient du fait qu'une moitié du jeu était encore injouable. Il nous arrivait de regarder nos collègues jouer jusqu'à la moitié, puis, arrivée la sixième minute, de leur dire : ",
      "« Merci, ça ira. Peux-tu relancer une partie ? »",
      "… ",
      "« Attends un peu, je pense que je peux gagner. » ",
      "Nous leur rappelions alors que les six dernières minutes n'étaient qu'un bazar rempli de monstres copiés-collés impossible à vaincre. « Message reçu ». Nous les interrogions alors pour connaitre leurs impressions, et recevions alors de nombreux commentaires intéressants sur leur expérience de jeu au cours des six premières minutes. Et dès que nous avions le dos tourné, nos collègues reprenaient leur partie mise en suspens et continuaient de jouer malgré tout. ",
      "Le fait de ne pas pouvoir essayer les six dernières minutes, si injustes et impossibles soient-elles, constituait un affront impardonnable pour une partie de nos collègues. Alors que nous concevions la première moitié du jeu, ces joueurs et joueuses mettaient leurs ressources en commun pour venir à bout de la deuxième moitié impossible, coute que coute. ",
      "Et ça n'a pas manqué : quelques intrépides ont réussi. ",
      "Ces personnes ultramotivées ont fini par trouver des combinaisons précises de capacités surpuissantes que nous n'avions pas encore peaufinées, et ont terminé la partie du jeu qu'on croyait impossible. (Ce qui en dit long sur la conception de jeux vidéos, mais peut-être même encore plus sur le type de personnes qui se lancent dans cette voie.)",
      "[h3]Chaos maitrisé[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "À la fin du développement, le noyau du jeu était prêt. Les capacités, les affrontements avec les miniboss et le combat final contre la reine Imperia… tout ça était au point.  À ce stade, nous ne recherchions plus des bugs susceptibles de casser le jeu, mais des moyens d'ajuster, d'équilibrer et de peaufiner ce qui fonctionnait déjà. Les tests continuaient, mais nous avions mis fin aux entretiens post-mortem exhaustifs et nous avons simplement laissé les gens jouer pour le plaisir (et, bien sûr, pour générer plus de données).",
      "Si les données quantitatives provenant de chaque tentative étaient importantes, les données qualitatives provenant des sessions de test l'étaient tout autant. Dans un exemple mémorable, une session de test s'est terminée de façon épique lorsque la Masse des lamentations (que nous appelions « Meatball » en interne), a pris plus de la moitié de l'écran avant de dévorer le héros (ce qui n'a pas manqué de déclencher l'hilarité des collègues autour du pauvre testeur). Bien sûr, il a immédiatement cliqué sur le bouton « Rejouer ».",
      "Nous avions enfin un produit qui valait la peine d'être mis en ligne. Après n'avoir été disponibles qu'aux personnes qui s'étaient portées volontaires, les tests étaient désormais ouverts à tout le monde dans nos bureaux qui voulait bien se laisser convaincre d'essayer. À l'époque des premiers prototypes, il n'était pas rare de recevoir un message sur Slack à 23 heures disant « Le jeu est trop difficile ». Maintenant que le projet était plus abouti, nous recevions toujours ces messages à 23 heures, mais ils étaient suivis d'autres messages à 3 heures du matin du type : « J'ai rien dit, j'ai fini le jeu ». ",
      "Même si le minijeu était presque terminé, nous avons continué de travailler sur le [i]Nid d'épines[/i] jusqu'à la sortie de l'acte IV de La Chute de la couronne. Au début de cet article, nous avons rappelé l'importance de la collecte de données fiables, essentielles pour prendre de bonnes décisions. Nous en avions désormais quelques-unes : l'équipe de test interne prenait du plaisir à jouer et à rejouer au minijeu, et nous disposions d'une tonne de données nous permettant de savoir ce qui provoquait cet enthousiasme. Quand un jeu commence à devenir fun, c'est là que les dévs se lâchent. Nous voulions nous investir encore davantage dans ces aspects qui avaient enfin fait leurs preuves, et inclure un maximum d'éléments. De nouveaux items, de nouvelles capacités, de nouveaux dialogues et même de nouvelles vagues : chaque fois que nous pensions avoir terminé le jeu, quelqu'un avait inévitablement une « dernière petite idée » à proposer. Et comme c'était généralement une bonne idée, on se devait de l'essayer.",
      "Non seulement les idées ne cessaient d'arriver, mais elles ne cessaient de s'améliorer à mesure que nous approchions de la sortie. Au début du projet, il était difficile de faire la distinction entre une fonctionnalité au fort potentiel et une autre moins intéressante. À une semaine de la sortie, les aspects qui méritaient que l'on se concentre dessus pour améliorer le jeu étaient évidents.",
      "[h3]Quitter le nid[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Alors que nous appliquions les dernières retouches au [i]Nid d'épines[/i], nous avons pu prendre du recul et porter un regard neuf sur le jeu. L'enjeu avait été de taille, car nous avions dû mettre en pratique les leçons apprises lors des actes précédents pour créer un combat de boss suffisamment épique pour clore un évènement de grande envergure. Le résultat de nos efforts était plus que satisfaisant, compte tenu des contraintes de temps : le jeu était amusant.",
      "Mais ça, la communauté ne le savait pas encore. Ce à quoi nous n'avions pas pensé, c'est que puisque le [i]Nid d'épines[/i] était un combat de boss, il devait logiquement se dérouler dans la salle du trône, soit à la toute fin du dernier Acte. Le suspens était intenable. Nous allions devoir attendre deux ou trois jours, le temps que les pros de Dota se frayent un chemin jusqu'à la fin de l'Acte IV à la vitesse de la lumière. ",
      "Il s'avère que nous n'avons pas eu longtemps à attendre. Nous pensions qu'il nous resterait au moins un jour ou deux avant que quiconque n'atteigne la salle du trône de la reine Imperia. C'était sans compter sur la rapidité vertigineuse avec laquelle les fans de Dota peuvent dévorer le contenu. À peine seize heures après le lancement, oui, [i]16 heures[/i], certaines personnes s'étaient battues tout au long du dernier acte et tentaient de conquérir le [i]Nid d'épines[/i] pour la première fois.",
      "Et en fin de compte, toute la communauté a fini par se mesurer à Imperia. À l'écriture de ces lignes, plus de cent-millions de parties du [i]Nid d'épines[/i] ont été lancées. Si vous n'avez pas encore tenté votre chance, ou si vous voulez simplement vous y essayer une fois de plus, le minijeu est toujours disponible dans les archives de La Chute de la couronne, depuis le client du jeu.",
      "[h3]Accepter l'incertitude[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Nous espérons que cet aperçu des coulisses de la création d'un minijeu par l'équipe de Dota vous aura donné une meilleure idée de notre façon de travailler (et que nous ne vous avons pas fait peur en révélant que nous sommes tout le temps en train d'improviser). Cela prouve bien que la conception de jeux vidéos n'est pas un art mystique créé par des génies de la création vidéoludique qui se réunissent dans des salles obscures, mais un processus itératif d'essais et d'erreurs piloté par des données, de l'anxiété, des tests, des échecs, plus de tests, et encore plus d'échecs et ainsi de suite.",
      "Le développement de jeux repose sur l'itération : tout commence avec l'absence d'idée, qui se transforme lentement en une idée vague, motivée par d'anciennes idées qui avaient fonctionné. Entre alors en scène le mauvais prototype, celui auquel personne ne veut jouer mais que nous fabriquons quand même. Nous regardons alors des gens y jouer sans plaisir, poussons quelques jurons, puis réparons ce qui ne va pas, jusqu'à ce que finalement, nous regardions des gens prendre du plaisir en jouant. Vient ensuite le moment de peaufiner les moindres détails, les yeux rivés sur la date de sortie fatidique qui approche à une vitesse folle. La philosophie de Valve a toujours été d'accepter l'incertitude et de laisser les données guider le développement. Peut-être ne sortons-nous pas toujours nos produits à temps, mais nous savons qu'une fois prêts, nos produits vous plairont."
    ],
    "commentcount": 4,
    "tags": [],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091375,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}