{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "전선과 전선 사이: 가시 왕좌",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "전선과 전선 사이: 가시 왕좌",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]'전선과 전선 사이'를 찾아주신 여러분 모두 반갑습니다. 이 블로그 특집에서는 개발진들이 도타처럼 독특한 게임을 만들어 가면서 맞닥뜨리는 어려움, 버그 수정, 그리고 가끔의 즐거운 사건들을 다룹니다.[/i]",
      "왕권의 몰락과 같은 대규모 이벤트를 진행하는 동안, 저희는 전체 세계 지도, 여러 갈래의 이야기 줄기, 영웅을 주제로 한 주화, 미니 게임, 만화, 픽셀 아트, 그 외 저희가 수년간 발전시켜 보고 싶었던 아이디어 등 여러 가지를 시험해 보고자 했습니다.",
      "이러한 위험을 감수할 수 있다는 확신이 든 원인이자 Valve에서 끊임없이 잘 활용하는 부분이기도 한 것은 바로 반복해서 개선할 자유, 즉 실제 플레이어 데이터를 수집하고, 그 데이터로 저희가 세운 가정을 점검하며, 심지어 생각 자체도 틀어버릴 수 있는 자유입니다. 플레이어가 직접 상호작용 하는 걸 보기 전까지는 저희도 뭘 만드는지 완전히 이해하지 못한다는 말씀을 자주 드리곤 합니다. 그렇기에 저희는 최대한 빨리 그 단계에 도달하려 노력합니다.",
      "그러한 사고방식은 저희가 결정을 내리는 시점에도 영향을 미칩니다. 보통은 개발 단계에서 최대한 늦은 시점으로, 저희가 최고의(가끔은 유일한) 데이터를 얻을 때입니다. 각 단계에서 저희는 실제 플레이어 경험을 바탕으로 공감을 얻는 부분에 집중하고, 그렇지 못한 부분은 멀리했습니다.",
      "이번 [i]전선과 전선 사이[/i]에서는 왕권의 몰락에서 비교적 늦게 공개된 콘텐츠인 영웅과 임페리아 여왕의 IV막 우두머리 전투, [i]가시 왕좌[/i]의 개발 단계를 짚어보고자 합니다. 또한, 이를 사례 연구로 활용하여 플레이테스트와 테스트로 생성된 데이터가 저희의 의사 결정에 어떤 식으로 영향을 미치는지 보여드리겠습니다.",
      "[h3]임페리아에게 도달하기[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "I막의 첫 번째이자 유일한 미니 게임은 평범한 낚시 게임으로, 아침거리를 잡아다 주지 않을까 기대하는 파도사냥꾼이 여러분의 낚시 실력을 시험해 보는 미니 게임입니다. I막의 많은 부분이 이런 식이었습니다. 지도 곳곳에 작은 아이디어들을 펼쳐 놓고 플레이어들이 무엇에 반응하는지 지켜봤죠. I막에서 얻은 고무적인 플레이어 데이터를 통해 저희는 II막에서 좀 더 모험심을 발휘해도 되겠다는 자신감이 생겼고, III막에서 얼음폭군이 좋아하는 선술집에서 싸우는 격투 게임 [i]설원의 파이터[/i], 겨울 비룡을 상대로 순간의 재치를 겨루는 매치 3 게임 [i]용의 체스[/i], 얼음폐허의 굽이진 동굴계를 지나며 사악한 용과 복수 혼령이 맞붙는 진행형 슈팅 게임 [i]자우그의 둥지[/i]를 선보였습니다. ",
      "IV막에 이르렀을 때, 저희는 어떤 것이 통하고 어떤 것이 통하지 않는지 확실하게 인식할 수 있었습니다. 어떤 종류의 데이터를 말하는 걸까요? 미니 게임별로 플레이어 몇 명이 얼마나 자주 다시 플레이했는지와 같은 구체적 사항부터 사용자가 제출한 의견이나 인터넷상의 토론 같이 좀 더 해석이 필요한 사항까지 전부 다 해당합니다. 그렇게 명료한 인식을 바탕으로, 저희는 숨 막힐 정도로 강렬한 대단원, 바로 사악한 여왕 임페리아를 상대로 장엄한 우두머리 전투에 모든 것을 걸 확신이 생겼습니다.",
      "물론, 우두머리 전투를 어떤 게임으로 할지 결정하는 건 쉬운 일이 아니었습니다. 저희는 플레이어 여러분이 기대하는 대로 아슬아슬하면서도 화려한 볼거리를 전달해야 한다는 사실을 잘 알고 있었습니다. 하지만, 여러 번 전투를 펼치더라도 계속해서 새로움이 느껴지도록 다양함이나 반복 플레이할 가치를 충분히 제공해야 했습니다. 게다가 플레이어가 매치 대기열에 있는 동안 플레이하도록 고안된 미니 게임이었기에 강렬하면서도 짧아야 했습니다. 맛있는 간식처럼 느껴져야지, 장시간 즐기는 식사여서는 안 됐습니다.",
      "알맞은 균형점을 찾으려면, 저희는 [i]설원의 파이터[/i]만큼의 수준 높은 제작 품질과 [i]용의 체스[/i]만큼의 플레이 반복성을 결합한 장르가 필요했습니다. 결국에는 이것이 4막으로 진행되는 왕권의 몰락 이야기에서 '중심인물 3인방'으로 활약해온 복수 혼령, 하늘분노 마법사, 신예 케즈가 임페리아의 성을 급습하면서 장엄하게 펼치는 최종 결전이 되는 것이니까요. 저희는 여왕에게 도달하려는 여정이 불가능에 도전하는 것처럼 느껴지기를 원했습니다.",
      "[h3]작전 짜기[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "잠깐 관심이 갔던 아이디어 한 가지는 턴제 JRPG 방식의 전투였습니다. 하지만, 그리 오래지 않아 그게 잘 맞지 않는다는 사실을 파악했습니다. 플레이어가 바로 뛰어들 수 있는 무언가가 필요했습니다. 매치를 기다리는 동안 할 만큼 짧고, 강렬하며, 재미있는 것이어야 했습니다.",
      "바로 그래서 서바이버 장르가 등장한 겁니다. 적이 끝없이 밀려오는 '역 탄막 슈팅'은 장엄한 분위기의 아슬아슬한 우두머리 전투를 담아내기에 안성맞춤이었습니다. 플레이어는 떼로 몰려드는 적을 헤치고 나아가며 약간의 전략을 사용하여 다양한 능력을 강화하면서 임페리아와의 최종 결전을 준비합니다. 더욱이 이러한 개념은 기존의 도타 아이템과 능력을 활용하기도 용이하므로, 플레이어는 이미 작동 방식을 파악하고 있는 셈이 됩니다.",
      "저희는 비교적 짧은 플레이가 되게끔 하고 싶었기에, 플레이 반복성은 맞춰야 할 퍼즐의 또 다른 큰 조각이었습니다. 서바이버 장르는 특성상 절대로 같은 경험을 두 번 제공하지 않으므로 저희에게는 다양한 가변성이 확보되었습니다. 플레이어가 정확히 원하는 순서로 기대하는 아이템과 이벤트를 만나리라는 보장은 없습니다. 이러한 가변성 덕분에 여러분은 도저히 극복할 수 없다거나 엄청난 좌절감을 느끼는 일 없이 도전 정신으로 무장한 채 몇 번이고 처음부터 계속 시도할 용기를 얻습니다. 여러분이 첫 시도에 승리하게끔 할 필요는 없었지만... 한편으로는 패배해도 계속 플레이하게끔 하고 싶었습니다. ",
      "[h3]초기 시험 버전[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "[i]가시 왕좌[/i]의 최초 시험 버전은 처음에는 최종적으로 출시한 버전과 핵심 요소가 같았습니다. 플레이어가 세 영웅 중 한 명을 선택하고 단계적으로 연달아 밀려오는 적을 상대하다, 마침내 임페리아에 도달하는 거였습니다. 이러한 초기 시도에서는 재밌는 구석이라곤 전혀 찾을 수 없었습니다. 어떨 때는 영웅이 거의 비다시피 한 지도를 돌아다니다 어쩌다 해골과 마주치곤 했습니다. 또 어떨 때는 단계적으로 밀려오는 적이 너무나 압도적이어서 사실상 승리할 가능성이 전혀 없던(적어도 그렇게 생각했습니다. 나중에 더 자세히 말씀드리겠지만요.) 적도 있었습니다. 하지만 저희는 재미있는 게임이 어딘가에는 반드시 있다는 사실을 알았습니다. 그런 게임을 찾아낼 때까지는 부실한 빌드로 플레이테스터들을 계속 괴롭혀야만 했습니다.",
      "Valve 직원은 모두 실험용 쥐나 마찬가지입니다. 저희가 무언가 제대로 작동하는지(또는 그만큼 자주 작동하지 [i]않는지[/i])를 확인하는 방법은 누구든 빌드 앞에 앉혀 놓는 것입니다. 브레인스토밍이야 끝없이 할 수 있지만, 누군가를 앉혀 두고 플레이하게 하기 전까지는 저희가 선택했던 것들이 제대로 먹히는지를 알 방법이 없습니다.",
      "처음에 플레이테스터들은 첫 3~6분을 버텨내기를 힘들어했습니다. 보통 그러한 현상은 게임의 균형이 맞지 않거나 규칙이 잘 설명되지 않음을 나타내는 신호입니다. 저희는 같이 앉아서 그들이 경험한 것을 하나하나 차근차근 보여주게끔 했습니다. 다음에 뭘 해야 할지 모르겠는 순간이나 상황에 너무나 압도되어 아예 안 되겠다고 느꼈던 지점이나, 심지어 그냥 지겹게 느껴졌던 지점까지 전부 다요. 그다음에는 책상으로 돌아와 바꿀 부분을 바꾸고 다시 새로운 플레이테스터 앞에 갖다 놓았습니다. 조금씩 진전이 보이기 시작했습니다.",
      "그러다 일이 일어났습니다.",
      "처음으로 돌았던 판을 재연해 보여준 다음이었는데, 방금 패배하고 난 어느 플레이테스터가 이렇게 물었습니다. \"저기, 다시 해봐도 되나요?\"",
      "뭔가 신선하면서도 힘이 되는 말이었습니다. 그 시점에서 가시 왕좌는 좋은 것 근처에도 가지 못하는 수준이었습니다. 사실 적어도 세 판은 돌아야 초기 버전을 깨는 방법을 알아내는 사람이 나왔습니다. 하지만 적어도 이번 한 번은 동료들이 형편없는 초기 버전을 플레이한 게 아니라는 점은 좋았습니다. 실제로 그 형편 없는 초기 버전을 한 번 더 플레이하게 해달라는 요청이 나왔으니까요.  그건 작디작은 티끌만큼의 관심이었습니다. \"이건 아주 별로는 아니에요.\" 저희는 그 말을 기쁘게 받아들였습니다.",
      "하지만 진정한 깨달음의 순간은 아직 아니었습니다.",
      "[h3]영웅 빌드[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "저희의 초기 버전에는 없었던 서바이버 장르의 주요 특징 한 가지는 끊임없는 압박이었습니다. 처음에는 그저 한 레벨에 해골 백 마리가 한 차례 생성되고 영웅이 그들을 쓰러뜨리기만 하면 됐습니다. 영웅이 해골을 전부 쓰러뜨리고 나면, 다음 차례의 나쁜 놈들은 더 어려운 난이도로 생성되었습니다. 플레이테스터들은 이러한 방식에 금세 싫증이 났습니다. 유일한 목표가 나쁜 놈들을 끊임없이 쓰러뜨리는 것임을 알고 난 뒤에는, 따분한 허드렛일처럼 느껴지기 시작했습니다. 좀 더 효율적으로 처치했어도 유일하게 받는 보상이라고는 상대해야 할 다음 차례가 더 빨리, 더 어려운 난이도로 닥쳐오는 것뿐이었습니다. (보상이 맞나요?)",
      "결국에는 해골 백 마리를 생성하고 영웅이 그들을 쓰러뜨리기 시작했을 때, 해당 차례의 해골을 일정 시간 안에 처리하도록 하고 영웅이 몇 마리를 죽였든지 상관없이 계속 해골을 채워 넣어야 한다는 사실을 알았습니다. 주어진 시간이 다하면, 더 어려워진 적이 생성되면서 제한 시간은 다시 새로 시작되도록 했습니다. 이제 압박이 절대로 누그러들지 않기에, 플레이어는 계속 흥미를 잃지 않고 몰입했습니다. ",
      "그보다 더 중요한 사실은, [i]목표[/i]가 바뀌었다는 점입니다. 영웅이 점점 수가 줄어드는 해골을 도륙하고 있을 때의 목표는 '해골 수 0마리로 만들기'였습니다. 하지만 해골을 [i]아무리 많이 죽여도 절대로 수가 줄지 않는다[/i]면, 플레이어는 해골을 죽이는 게 목표가 아니라는 점을 금방 눈치챌 겁니다. ",
      "대신 초점을 돌려 그 모든 해골을 죽이는 데서 [i]얻는[/i] 게 뭔지에 집중할 겁니다. 여기서는 능력과 강화입니다. 갑자기 목표가 '모든 해골 죽이기'가 아니라 최대한 [i]강력[/i]해지려면 최대한 빠르게 몇 마리를 죽여야 하지?'가 되었습니다. 차례차례 밀려오는 적을 사냥하는 일이 따분한 허드렛일처럼 느껴지지 않고 대박을 뒤쫓는 일처럼 느껴지기 시작했습니다. 처치할 때마다 완벽한 빌드에 한 걸음 다가가는 거였죠. ",
      "다음 차례로 넘어가려면 이전 단계에서 마지막 한 마리까지 남김없이 쓸어버려야 하는 게 아니기 때문에, 새로운 것이 생겼습니다. 바로 공유 시계였죠. 이는 플레이어들이 같은 박자로 움직인다는 뜻입니다. 이는 공통의 언어가 되어 상황이 어려워지기 시작할 때 서로를 이해하는 데 도움이 되었습니다. 그래서 어느 플레이어가 \"4분에 거미 무리를 못 버티겠어요.\"라고 했을 때, 그 말이 무슨 뜻인지 모두 즉각 이해했습니다. (그 거미는 정말 최악이었죠.)",
      "마침내 재미를 찾아냈습니다. 이런 소소한 초점의 변화가 플레이어들이 무엇을 왜 즐기는지 명확히 밝히는 데 도움이 되면서, 더욱 강력한 강화, 더욱 기발한 능력, 생각조차 하지 못했던 빌드 가능성 등 새로운 아이디어가 폭포처럼 쏟아졌습니다. 그 말인즉슨, 플레이테스터들은 단 한 번의 플레이로 서로 완전히 다른 영웅 빌드를 구축할 수 있었다는 뜻입니다. 또한, 플레이테스터들이 테스트를 하는 동안 더욱 몰입하면서 더욱 유용한 피드백과 제안을 내놓음으로써 다음 빌드에 반영하는 상황으로 이어졌습니다.",
      "뭐, 몇 번 더 물어봤다면 그랬겠죠. 플레이테스트를 마친 후, 어떨 때 보면 동료들은 좋았던 점과 나빴던 점에 관한 얘기는 별로 하려 들지 않았습니다. 서로 빌드 얘기를 하면서 어떤 빌드가 더 나은지를 두고 따져보고 싶어 했습니다. ",
      "빌드가 점점 더 다양해지면서, 저희는 혹시 퍼즐의 큰 조각을 놓친 건 아닌지 하는 의문이 들었습니다. 영웅 자체가 능력만큼 독특하게 느껴진다면 어떨까? 초기 시험 버전에서는 시작 능력을 제외하면 플레이어는 어떤 영웅을 선택하든 대체로 동일한 경험을 했습니다. 이제 영웅 선택이 각각 제대로 독특한 것이 되도록 조정하면서, 하나는 더 강하게, 하나는 더 빠르게, 하나는 마법 피해를 더 잘 주게 했으며, 이에 따라 빌드의 가변성이 더욱 확대되었습니다. 한 영웅을 선택하면 다른 영웅으로는 구축할 수 없는 특정 능력 분야가 열린다는 뜻이기도 합니다. (어떤 강화를 획득하느냐는 언제나 운이 약간 따라야 하는 문제이기에, 모든 선택은 큰 도박처럼 느껴졌습니다.)",
      "[h3]전반부 6분[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "한편, 여러분이 어떤 강화 분야를 선택해야 임페리아에게 도달하는 데 도움이 될지 알아내느라 정신이 팔린 사이, 저희는 서서히 난이도를 조금씩 올리고 있었습니다. 어느 시점에, 여러분이 눈치채지 못하는 사이에, 적 무리는 더없이 강력해지고, 가차 없는 빠르기로 진행되면서 여러분은 간신히 버티기만 하는 지경이 됩니다. ",
      "어쨌든, 그게 목표였습니다. 강화 작업이 진행되었기에, 저희는 게임플레이의 속도로 넘어갔습니다. 강렬한 경험이 되면서 질릴 정도로 오래 끌지는 않으려 했습니다. (플레이어 대부분이 매치가 잡히기를 기다리는 동안 플레이한다는 사실을 알고 있었습니다.) 하지만 한편으로는, 플레이어들이 선택한 강화가 쌓이는 것을 보며 즐길 여유를 충분히 남겨주고 싶었습니다.",
      "대강 계산해 보니, 임페리아와 싸우는 마지막 3분을 제외하고 전체 게임 플레이가 한 12분 정도 되었습니다. 그래서 전반부 6분의 속도를 손보기 시작했습니다. 플레이어에게 강화 선택 기회를 얼마나 자주 제공할까? 능력을 쌓기 시작하는 시점을 언제부터로 할까? 만족스럽지만 지나치게 강력하다고 느껴지지 않으려면 각 능력으로 주는 피해가 얼마가 되어야 할까? ",
      "게임플레이를 부분으로 나누어 조정했기에, 전반부 6분에 집중했을 시점에 뒤 6분은 사실상 플레이할 수 없는 상태였습니다. 저희는 사람들에게 전반부 6분의 플레이테스트를 한 다음 그만하게 했습니다. [i]엄밀히 말하자면[/i] 계속 플레이할 수 있긴 했지만, 6분 이후의 것들은 전부 임시로 자리만 잡아놓은 것에 불과했습니다. 그 이후로는 플레이하면 안 되는 것이었습니다. (실제로 동료들에게 하지 말라고 간곡히 부탁했습니다.) ",
      "능력과 강화를 재미있게 만들자 한 가지 웃긴 부작용이 생겨났는데, 바로 게임 절반이 아직 플레이할 수 있는 상태가 아니라는 사실을 플레이테스터들이 신경 쓰지 않는 상황이 빈번하게 일어났다는 점이었습니다. 저희는 동료의 책상에 앉아서 게임의 앞부분 절반을 플레이하는 모습을 지켜봅니다.",
      " 일단 6분 지점에 도달하고 나면 이런 상황이 벌어집니다. ",
      "저희는 이렇게 말합니다. \"다됐어요. 고마워요.\" \"게임을 다시 시작해볼래요?\"",
      "일시 정지. ",
      "\"잠깐만요, 솔직히 깰 수 있을 것 같거든요.\" ",
      "그러면 후반부 6분은 복사해서 붙여 넣은 적이 출몰하는데 극도로 힘들고 균형은 전혀 잡히지 않은 황무지나 다름없으며 현재 깰 수 없다는 사실을 다시금 일깨워 줍니다. 그러면 알았다고 합니다. 저희는 좋았던 점과 나빴던 점을 듣습니다. 전반부 6분의 플레이를 바탕으로 중요한 의견이 많이 나옵니다. 그러면 저희는 제자리로 돌아가고, 동료들은 저희가 돌아간 것을 보고선 게임의 일시 정지를 풀고 어떻게든 깨보려고 합니다. ",
      "동료 일부는 지독하게 말도 안 되고, 그야말로 깰 수 없는 후반부 6분을 해내지 못했다는 사실을 개인적인 모욕으로 받아들이기까지 했습니다. 그래서, 저희가 게임 전반부를 설계하는 동안, 동료들은 자원을 모아 깰 수 없는 후반부를 해결하려고 머리를 싸매고 끙끙대고 있었습니다. ",
      "그런데 중요한 사실은, 그들이 깼다는 겁니다. ",
      "결국 아직 세세하게 조정되지도 않은 데다 과도하게 강력한 능력의 정확한 조합을 찾아내어 깨지 못하게 되어 있는 부분을 깬 겁니다. (이 얘기로 게임 디자인에 관해 여러 가지를 알 수 있긴 하겠지만, 그보다 어떤 유형의 사람들이 게임 디자인을 하는지를 훨씬 더 많이 파악하셨겠죠.)",
      "[h3]통제된 혼돈[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "개발이 끝날 무렵, 게임의 핵심이 완성되었습니다. 능력, 하급 우두머리 교전, 임페리아 여왕과의 최종 결전이 모두 제 모양새를 갖췄습니다.  이 시점에서 저희는 게임을 망가뜨리는 문제가 아니라 이미 잘 돌아간다고 알고 있지만 그것이 더 빛나도록 조정하고, 균형 잡고, 다듬을 방법을 찾았습니다. 플레이테스트는 계속했지만, 철저한 사후 분석 면담은 줄이고 그냥 재미로 플레이하게 내버려뒀습니다. (물론, 더 많은 데이터를 생성하도록 하려는 이유에서)",
      "한 판 할 때마다 얻는 정량 데이터도 중요하지만, 플레이테스트 게임에서 얻는 정성 데이터도 마찬가지로 중요했습니다. 기억에 남는 한 가지 예를 들자면, 어느 플레이테스트는 내부에서 '고기 완자'라고 불렀던 '흐느끼는 덩어리'가 화면 절반을 차지하고 플레이를 집어삼키면서 굉장하게 끝난 적도 있습니다. 그때 플레이테스터 뒤에는 지켜보던 동료들이 있었고 모두 그런 비극적 상황을 보고 웃음을 터뜨렸습니다. 당연히 그 테스터는 즉시 '다시 하기' 버튼을 눌렀죠.",
      "저희는 출시할 만한 게 만들어졌다는 확신이 있었고, 플레이테스트를 하겠다고 자원한 사람들부터 회사에서 압박할 수 있는 그야말로 누구든 상관없이 모두에게 플레이테스트 기회를 제공하고 게임으로 끌어들였습니다. 가장 초기의 시험 버전으로 테스트할 때는, 밤 11시에 Slack으로 \"게임이 너무 어렵네요.\"라는 메시지가 날아들곤 했습니다. 이 단계에서는 여전히 밤 11시에 Slack 메시지를 받겠지만, \"아까 한 말은 신경 쓰지 마세요. 깼으니까요.\"라는 후속 메시지가 새벽 3시에 날아든다는 점이 다릅니다. ",
      "거의 완성된 게임이었지만, 저희는 왕권의 몰락 IV막을 출시하기 바로 직전까지 계속해서 [i]가시 왕좌[/i] 작업을 진행했습니다. 이 글 처음에, 뒷받침할 좋은 데이터를 확보하면 더 좋은 결정을 내릴 수 있다고 얘기했습니다. 이제 데이터가 어느 정도 생겼습니다. 게임을 플레이(또는 다시 플레이)할 때만큼 적극적인 내부 플레이테스터들 덕분에 저희는 우리가 만드는 것의 어느 부분이 공감을 얻을지 알 수 있는 데이터를 엄청나게 확보했습니다. 방 하나에 가득한 게임 개발자들이 가장 들뜨는 때는 게임이 재밌어지기 시작하는 순간입니다. 저희는 제대로 통한다고 파악된 것을 더 많이, 넣을 수 있는 만큼 최대한으로 하고 싶었습니다. 새로운 아이템, 능력, 배경 이야기, 심지어 단계적으로 오는 무리까지... 이제 게임이 확정되었다고 생각할 때마다, 아니나 다를까, 누군가 나타나서 아이디어를 '딱 하나 더' 보태곤 했습니다. 그리고 보통 그렇게 보탠 아이디어는 굉장히 좋은 것이었기에 시도하지 않을 수가 없었습니다.",
      "기능 관련 아이디어가 계속 들어오기만 한 것이 아닙니다. 출시가 가까워질수록 나오는 점점 더 좋은 아이디어가 나왔습니다. 초창기, 모든 것이 모호했을 때는 높은 가치일지도 모르는 기능과 실제로 별 가치가 없는 기능을 구별하기가 어려웠습니다. 출시까지 1주일 남은 시점에서, 게임을 더 좋게 만들려면 우리의 시간과 자원을 어디에 들이는 것이 가장 좋을지는 분명했습니다.",
      "[h3]왕좌를 떠나며[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "[i]가시 왕좌[/i]의 마무리를 하면서, 한 걸음 물러나 새로운 시각으로 다시 볼 기회가 있었습니다. 이전 막에서 배운 것들을 활용하여 적절하게 장엄한 우두머리 전투를 구축하고 대규모 이벤트를 마무리 짓는 것이 남은 과제였습니다. 저희가 해낸 성과가 상당히 만족스러웠습니다. 특히 시간 제약이 있었다는 점을 고려한다면요. 저희는 재미를 찾아냈습니다.",
      "안타깝게도, 커뮤니티에서는 아직 그걸 찾지 못했습니다. 저희가 고려하지 못한 것은 [i]가시 왕좌[/i]가 우두머리 전투였기에 논리적으로는... 우두머리는 게임이 끝나는 시점에 우두머리가 사는 곳에 살아 있어야 한다는 점이었습니다. 다시 말하면, 도타 고수들이 인간 같지 않은 속도로 IV막을 헤쳐나가기를 기다리며 하루이틀 이상 고문 같은 시간을 보내야 한다는 얘기입니다. 플레이어들이 마침내 최종 우두머리 전투를 플레이할 기회를 언제 얻는지 확인하려면요. ",
      "알고 보니 그리 오래 기다릴 필요가 없었습니다. 저희는 임페리아 여왕의 알현실에 도달하는 사람이 나오려면 하루이틀은 걸릴 거로 생각했습니다. 뚜껑을 열고 보니, 도타 플레이어들이 얼마나 빠르게 콘텐츠를 정복할 수 있는지를 심각하게 과소평가했다는 사실이 드러났습니다. 불과 출시 16시간 만이었습니다. 그렇습니다. [i]시간[/i] 단위입니다. 첫 번째 고수가 이미 마지막 막을 모두 통과해서 [i]가시 왕좌[/i]를 처음으로 맛보기까지 걸린 시간입니다.",
      "그리고 결국에는 다른 사람들도 모두 따라잡았습니다. 이 글을 쓰는 시점에, [i]가시 왕좌[/i]가 플레이된 횟수는 거의 1억 회에 달합니다. (아직 그 단계까지 못 간 분이나, 그냥 한 번 더 해보고 싶은 분이 있다면, 지금도 클라이언트의 왕권의 몰락 기록보관소에서 플레이하실 수 있다는 점 참고해 주시기 바랍니다.)",
      "[h3]불확실성의 수용[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "도타 팀이 미니 게임을 개발하여 정상 궤도에 올리는 과정을 다룬 이번 제작 비화로 저희의 제작 과정을 조금 더 이해하실 수 있었기를 바랍니다. 아울러, 이번 블로그 글에서 밝혀진 대로 저희가 개발을 진행하면서 그때그때 만들어간다는 사실에 너무 경악하지 않으셨으면 합니다. 하지만 정말로 바라는 바는, 이 글을 통해 게임 디자인이란 게임을 만드는 천재들이 어두운 방에서 검지손가락을 맞댄 채 하는 일종의 신비술 같은 것이 아니라 데이터, 불안, 플레이테스트, 실패, 플레이테스트, 더 많은 실패, 더 많은 플레이테스트로 수많은 시행착오를 거치는 반복 작업이라는 사실이 증명된다면 좋겠습니다.",
      "게임 개발은 반복을 통해 완성됩니다. '아이디어 없음'으로 시작한 상태는 과거에 통했던 아이디어를 보면서 서서히 '어떤 아이디어'로 바뀝니다. 그다음 부실한 시험 버전이 됩니다. 플레이하고 싶어 하는 사람이 아무도 없는 수준이지만, 어쨌거나 만들어냅니다. 그다음 플레이하는 재미가 없는 걸 보고 가서 재미없는 부분을 전부 고칩니다. 그러다 보면 사람들이 플레이하면서 재미있어하는 모습이 보입니다. 그다음 다듬고, 다듬고, 출시 일정을 보고 웁니다. Valve는 언제든 불확실성을 수용하고 데이터가 개발을 이끌어가도록 하는 것을 기조로 삼습니다. 그 말은, 항상 시간을 딱 맞춰 출시하지는 않는다는 뜻입니다. 하지만, 준비된 것을 보면 여러분도 마음에 드시리라 생각합니다."
    ],
    "commentcount": 35,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 4,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 103,
    "votedowncount": 17,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747094901,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 91,
  "votes_down": 17,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}