{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Kulvarlar Arası: Sivri Kule",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Kulvarlar Arası: Sivri Kule",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[i]Kulvarlar Arası'na tekrar hoş geldiniz. Bu blogumuzda, geliştirici ekibimiz Dota gibi eşsiz bir oyun üzerinde çalışırken karşılaştıkları bazı zorluklardan, hata düzeltmelerinden ve mutlu kazalardan bahsedecek.[/i]",
      "Tacın Düşüşü gibi büyük bir etkinlikle; dünya haritaları, farklı sonları olan hikâyeler, kahraman temalı jetonlar, mini oyunlar, çizgi romanlar ve piksel çizimlerin yanı sıra yıllardır keşfetmek istediğimiz pek çok fikri deneme fırsatı bulduk.",
      "Bu riskleri rahatlıkla alabilmemizi sağlayan şey ise Valve'da sürekli olarak faydalandığımız deneme yanılma özgürlüğümüzdür. Gerçek oyuncuların verilerini toplayıp bunları varsayımlarımızla karşılaştırabiliyor ve yeri geldiğinde bakış açımızı değiştirebiliyoruz. Birçok durumda belirttiğimiz gibi, oyuncuların etkileşimini görene kadar yaratmaya çalıştığımız şeyi tam olarak anlayamadığımız için o noktaya mümkün olan en kısa sürede ulaşmaya çalışıyoruz.",
      "Bu düşünce yapısı, karar alma sürecimizi de etkiliyor. Kararlarımızı genellikle geliştirme sürecinin mümkün olan en son aşamasında, en etkili (ve bazen de tek bulabildiğimiz) verilere ulaştığımızda almaya çalışıyoruz. Her adımda gerçek oyuncu deneyimlerinden yararlanarak başarılı unsurlara odaklanıyor ve henüz bu seviyede olmayan unsurlardan kaçınıyoruz.",
      "Bu [i]Kulvarlar Arası[/i] blog yazımızda Tacın Düşüşü'ne nispeten geç eklenen bir bölümün geliştirme sürecini ele alacağız: 4. Bölüm'de kahramanlarımızın [i]Sivri Kule[/i]'de Kraliçe Imperia'ya karşı verdiği son savaş. Bu incelemeyi, oyun testlerinin ve oluşturdukları verilerin kararlarımızı nasıl etkilediğini göstermek için bir örnek olarak da kullanacağız.",
      "[h3]Imperia'ya Giden Yol[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "1. Bölüm'deki ilk (ve tek) mini oyun, Tidehunter'ın kahvaltılık bir şeyler yakalama umuduyla balıkçılık becerilerinizi test ettiği basit bir mini oyundu. 1. Bölüm çoğunlukla bu şekildeydi; oyuncuların nelerle ilgilendiğini anlamak için haritanın çeşitli yerlerine serpiştirdiğimiz küçük fikirler. 1. Bölüm'den aldığımız teşvik edici oyuncu verileri, 2. Bölüm'de daha cesur olabilmemizi sağladı. Bu şekilde 3. Bölüm'de Tusk'ın en sevdiği meyhanede geçen dövüş oyunu [i]Sleet Fighter[/i]'ı, Winter Wyvern'a karşı oynadığınız [i]Ejderha Satrancı[/i] adlı bir eşleştirme oyununu ve Vengeful Spirit'in, Icewrack'in dolambaçlı yeraltı tünellerinde kötü bir ejderhayla savaştığı shoot-'em up oyunu [i]Zaug'un İni[/i]'ni yayınladık. ",
      "4. Bölüm'e geldiğimizde neyin işe yarayıp neyin yaramadığını net bir şekilde anlamıştık. Ne tür veriler elde ettik? Mini oyunları kaç kişinin ne sıklıkla yeniden oynadığı gibi somut verilerden, kullanıcı geri bildirimleri ve çevrimiçi tartışmalar gibi daha yoruma açık verilere kadar pek çok değerli bilgi topladık. Bu bilgiler bize, kötü Kraliçe Imperia'ya karşı destansı bir son savaşın verileceği muhteşem bir final için her şeyi ortaya koyma öz güvenini sağladı.",
      "Elbette bu savaşın nasıl bir oyun olacağına karar vermek kolay değildi. Beklentinin yüksek olduğunu ve olağan üstü bir deneyim sunmamız gerektiğini biliyorduk. Ancak aynı zamanda, birden fazla denemeden sonra bile eğlenceli olacak şekilde çeşitlilik sunmalı ve tekrar oynanabilmeliydi. Ve bu mini oyun eşleştirme beklerken oynanmak üzere tasarlandığı için, etkileyici ama kısa olması gerekiyordu. Büyük bir öğün gibi değil, lezzetli bir atıştırmalık gibi olmalıydı.",
      "Doğru dengeyi bulabilmek için, [i]Sleet Fighter[/i]'ın yüksek görsel kalitesini [i]Ejderha Satrancı[/i]'nın tekrar oynanabilirliğiyle birleştiren türde bir oyuna ihtiyacımız vardı. Sonuçta bu, Vengeful Spirit, Skywrath Mage ve hikâyeye yeni katılan Kez'in (dört bölümlük Tacın Düşüşü'nün üç ana karakteri) Kraliçe Imperia'nın kalesine saldırıp onunla yüzleşeceği destansı bir mücadele olacaktı. Oyuncuların kraliçeyle yüzleşmek üzere ilerledikleri yolculukta, aşılması imkânsız engellerle karşı karşıya olduklarını hissetmelerini istedik.",
      "[h3]Planın Hazırlanışı[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "İlk başta aklımıza JRPG tarzı sıra tabanlı bir savaş oyunu geldi. Ancak kısa sürede uygun olmayacağını fark ettik. Oyuncuların doğrudan aksiyona dalabileceği, aynı zamanda kısa, etkileyici ve Dota maçları arasında oynamaya değecek kadar eğlenceli bir şeye ihtiyacımız vardı.",
      "Oyunu hayatta kalma türünde yapma fikri de buradan çıktı. Bir nevi \"mermi cehennemi\" türünde, sonsuz sayıda düşmanlarla dolu bir oyun. Destansı bir son savaş için mükemmel bir oynanış yapısıydı. Oyuncular, Imperia ile son karşılaşmaya hazırlanırken yeteneklerini güçlendirmek için stratejilerini kullanacak ve düşman ordularıyla savaşacaktı. Ayrıca oyuncuların oyunun işleyişine hâkim olabilmesi için mevcut Dota eşyalarından ve yeteneklerinden kolaylıkla faydalanabilecektik.",
      "Oyun deneyiminin nispeten kısa olmasını istediğimiz için tekrar oynanabilirlik değeri de önemli bir etkendi. Hayatta kalma türü, değişken yapısı nedeniyle bize çok fazla çeşitlilik sunuyordu. Bu tür oyunlarda ne tür eşyalar alacağınızı veya ne tür olaylarla karşılaşacağınızı tahmin etmek imkansızdır. Değişkenlik oyuncuyu zorlayıcı ama imkânsız veya sinir bozucu olmayan bir şekilde sıfırdan başlayarak oynamaya devam etmeye teşvik eder. İlk denemenizde kazanmanızı istemiyorduk... ama kaybettikten sonra da oynamaya devam etmenizi istiyorduk. ",
      "[h3]İlk Prototipler[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "[i]Sivri Kule[/i]'nin ilk prototipleri, yayınladığımız son hâliyle aynı temel öğelerle başladı. Oyuncu üç kahramandan birini seçtikten sonra düşman ordularıyla yüzleşerek Imperia'ya ulaşıyordu. Bu ilk denemeler hiç eğlenceli değildi. Bazı denemelerde seçtiğiniz kahraman neredeyse boş bir haritada gezinip arada sırada bir iskelete rastlıyordu. Bazılarında ise zorlayıcı düşman orduları kazanmayı imkânsız hâle getiriyordu (Ya da biz öyle düşünüyorduk ama buna daha sonra değineceğiz). Bu fikirlerden eğlenceli bir oyun çıkacağını biliyorduk. Bulana kadar da oyunu test eden kişilere kötü derlemelerle eziyet etmeye devam etmemiz gerekiyordu.",
      "Her Valve çalışanı bir kobaydır. Bir şeyin işe yaradığını (ya da genellikle [i]yaramadığını[/i]) anlamak için onlara bir derlemeyi test ettiririz. Yüzlerce fikir üretebiliriz ama birileri oturup bunları oynayana kadar yaptığımız seçimlerin doğru olup olmadığını hiçbir şekilde bilemeyiz.",
      "Başlangıçta, oyunu test eden kişiler ilk 3-6 dakika hayatta kalmakta zorluk çektiler. Bu durum genellikle oyunun dengesiz olduğunun veya kurallarının iyi açıklanmadığının göstergesidir. Bu testleri yapan kişilerden; ne yapacaklarını bilemedikleri anlar, oyunun zorlaştığı için imkânsız hale geldiği anlar, hatta sıkıldıkları anlar üzerine deneyimlerini paylaşmalarını istiyorduk. Daha sonra masamızın başına dönüp değişiklikler yaparak test için ekipteki başka bir kişiye sunuyorduk. Yavaş yavaş ilerleme görmeye başladık.",
      "Ve beklenmedik bir şey oldu.",
      "Testi yaptıktan ve bu sırada kaybettikten sonra ilk denemesini bize aktaran biri \"Tekrar denesem olur mu?\" diye sordu.",
      "Bu yeni ve cesaret verici bir şeydi. Sivri Kule henüz iyi olmaya yakın bile değildi. Birinin oyunu nasıl kazanacağını anlaması genellikle en az üç deneme gerektiriyordu. En azından artık meslektaşlarımızı korkunç prototipimizi oynamaya zorlamıyorduk, kendileri korkunç prototipimizi tekrar oynamak istiyordu.  Ufak bir ilgi parıltısı gördük. \"O kadar da kötü değil\" der gibi. Bize yeter de artardı.",
      "Ama henüz mucizevi bir ilerleme katetememiştik.",
      "[h3]Kahraman Yapıları[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "İlk sürümlerimizde hayatta kalma türündeki oyunlar için çok önemli olan bir unsur eksikti: Aralıksız bir baskı. Başlangıçta bölüme bir iskelet ordusu gönderip kahramanın hepsini yok etmesini bekliyorduk. Kahraman tüm iskeletleri yok ettikten sonra daha zor iskelet orduları gönderiyorduk. Test yapan kişiler bundan çabuk sıkıldı. Tek amacın kötü adamları yok etmek olduğunu anladıklarında, oyun angaryaya dönüştü. Bir orduyu daha etkili bir şekilde yok etmenin tek ödülü, daha da zorlu başka bir ordunun daha hızlı ortaya çıkmasıydı. (Harika değil mi?)",
      "Sonunda, yüz iskelet gönderdiğimizde ve kahraman onları yok etmeye başladığında, bu ordu için belirli bir zamanlayıcı koymamız ve kahramanın kaç iskelet öldürdüğüne bakmaksızın iskelet eklemeye devam etmemiz gerektiğini anladık. Bu zamanlayıcı dolduğunda yeni bir zamanlayıcıyla birlikte daha zor bir düşman ordusu eklemeye başladık. Aralıksız bu baskıyla birlikte oyun daha ilgi çekici hâle geldi. ",
      "Daha da önemlisi oyunun [i]amacı[/i] değişti. Kahramanımız giderek azalan sayıda iskeleti katletmekle meşgulken amaç \"iskelet sayısını sıfıra indirmekti.\" Ancak iskelet sayısı [i]ne kadar öldürülse de asla azalmayınca[/i], oyuncular asıl amacın bu iskeletleri öldürmek olmadığını kısa sürede anladı. ",
      "Bunun yerine bu iskeletleri öldürünce [i]elde ettikleri[/i] şeylere yani yeteneklere ve yükseltmelere odaklandı. Birdenbire amaç \"Bütün iskeletleri öldür\" değil, \"Olabildiğince [i]güçlü[/i] olmak için bu iskeletlerden kaç tanesini hızlıca öldürebilirim?\" oldu. Düşman ordularını yok etmek angarya olmaktan çıkıp her leşin sizi mükemmel yapıya yaklaştırdığı büyük bir ödül avına dönüştü. ",
      "Bir sonraki düşman dalgasına ilerlemek artık bir öncekindeki her şeyi öldürmeye bağlı olmadığından, aynı zamanda yeni bir şey daha elde etmiştik: paylaşılan bir saat. Bu, oyuncuların artık aynı ritmi deneyimlediği anlamına geliyordu. Yani oyun zorlaşmaya başladığında kullanılacakları ortak bir dil vardı. Örneğin, bir oyuncu \"Dördüncü dakikadaki o örümcek dalgasıyla baş edemiyorum\" dediğinde, diğer herkes bunun ne demek olduğunu anında anlayabiliyordu. (O örümcekler gerçekten berbattılar).",
      "Sonunda eğlenceyi bulmuştuk. Odak noktasındaki bu küçük değişiklik, oyuncuların nelerden hoşlandığını ve bunun nedenlerini netleştirmemize yardımcı oldu. Bu, daha güçlü geliştirmeler, daha çılgın yetenekler ve daha önce hiç düşünmediğimiz yapı olasılıkları gibi yeni fikirlerin ortaya çıkmasına yol açtı. Bu, oyunu test eden oyuncuların aynı oyun için birbirlerinden tamamen farklı kahraman yapıları oluşturabilecekleri anlamına geliyordu. Böylece oyun testleri sırasında daha fazla etkileşimde bulunup bir sonraki sürüme aktarabileceğimiz daha iyi geri bildirimler ve öneriler verebildiler.",
      "Tabii birden fazla kez sormamız gerekiyordu. Bir oyun testinden sonra bazen iş arkadaşlarımızın artık bizimle olumlu ve olumsuz görüşleri hakkında konuşmak istemediklerini fark ettik. Bunun yerine birbirleriyle kahraman yapıları hakkında konuşmak ve hangisinin daha iyi olduğunu tartışmak istiyorlardı. ",
      "Yapıların çeşitliliği arttıkça, bulmacanın büyük bir parçasını gözden kaçırdığımızı düşünmeye başladık. Kahramanların kendileri de yetenekleri kadar eşsiz bir deneyim sunabilir miydi? İlk prototiplerde, başlangıç yetenekleri hariç, hangi kahramanı seçerseniz seçin, oyun deneyimi büyük ölçüde aynıydı. Ama şimdi onları gerçekten benzersiz seçimlere dönüştürüyorduk; birini daha güçlü, diğerini daha hızlı, bir başkasını da büyü hasarında daha iyi hâle getirdik. Bu da yapıların çeşitliliğini daha da artırdı. Bir kahramanı diğerine tercih etmek aynı zamanda diğer kahramanlarla ulaşamayacağınız belirli yetenek dallarını açmak anlamına geliyordu. (Ve alacağınız yükseltmelerde her zaman bir şans faktörü olduğu için, her seçim yüksek riskli bir kumar gibi hissettiriyordu.)",
      "[h3]İlk Altı Dakika[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Bu arada siz hangi yükseltme dalının sizi Imperia'ya götüreceğini anlamaya çalışırken biz yavaş yavaş zorluğu artırıyoruz. Bir noktada, siz farkına bile varmadan, düşman dalgaları ölümcül bir hâl aldı, oyunun temposu amansızlaştı ve zar zor ayakta duruyorsunuz. ",
      "En azından amaç buydu. Yükseltmeleri hallettikten sonra oyunun temposuna geçtik. Yoğun geçen ancak fazla da uzun sürmeyen bir deneyim olmasını istedik. (Çoğu oyuncunun bunu eşleştirme beklerken oynayacağını biliyorduk.) Öte yandan, oyuncuların yükseltme tercihleriyle ilerlerken oyundan keyif alabilmelerine fırsat tanımak istedik.",
      "Hesaplamalarımıza göre, son bölümdeki üç dakikalık Imperia savaşı hariç, toplamda yaklaşık on iki dakikalık bir oyun süremiz vardı. Bu yüzden ilk altı dakikanın temposu üzerinde çalışmaya başladık. Oyunculara ne sıklıkla yükseltme seçeneği sunmalıydık? Yetenekleri ne kadar erken istiflemeye başlamalıydılar? Tatmin edici ama aşırı güçlü olmaması adına, her yetenek ne kadar hasar vermeliydi? ",
      "Oyunun oynanışını bölümler hâlinde ayarlıyorduk ve ilk altı dakikaya odaklanmak, son altı dakikanın o aşamada oynanamaz durumda olduğu anlamına geliyordu. Test edenler ilk altı dakikayı oynadıktan sonra onları durduruyorduk. [i]Teknik olarak[/i] oynamaya devam edebilirlerdi ancak altıncı dakikadan sonraki her şey geçici unsurlardan oluşuyordu. O noktadan sonrasını oynamalarına gerek yoktu. (Aslında oynamamaları için çalışma arkadaşlarımıza yalvarmak zorunda kaldık.) ",
      "Yetenekleri ve geliştirmeleri bu kadar eğlenceli yapmanın komik bir yan etkisi, oyunu test edenlerin oyunun yarısının oynanamaz durumda olmasını umursamamasıydı. Bir çalışma arkadaşımızın masasına oturur, oyunun ilk yarısını oynamasını izlerdik. Altıncı dakikaya ulaştıklarında: ",
      "\"Harika, teşekkür ederiz\" derdik. \"Oyuna baştan başlayabilir misin?\"",
      "Kısa bir sessizlik. ",
      "\"Bir saniye, aslında sanırım oyunu bitirebilirim.\" ",
      "Son altı dakikanın kopyalanıp yapıştırılmış düşmanlarla dolu, yorucu ve dengesiz bir yer olduğunu ve mevcut hâliyle bitirilemeyeceğini hatırlatırdık. Anladıklarını söylerlerdi. Onlara beğendikleri ve beğenmedikleri şeyleri sorardık. İlk altı dakikadaki oyun deneyimleri hakkında bize çok güzel geri bildirimler verirlerdi. Sonra masalarımıza geri dönerken onlar da bizim gidişimizi izlerlerdi ve ardından oyuna devam edip bitirmeye çalışırlardı. ",
      "Bazı çalışma arkadaşlarımız, son derece adaletsiz ve kelimenin tam anlamıyla geçilmesi imkânsız olan son altı dakikayı bitirememeyi kişisel bir hakaret olarak gördüler. Yani biz oyunun ilk yarısını tasarlarken, onlar da güçlerini birleştirip bitirilemeyen ikinci yarıya kafa yoruyorlardı. ",
      "Ve asıl olay şu ki, başardılar. ",
      "Sonunda henüz detaylı olarak ayarlamadığımız aşırı güçlü yeteneklerden oluşan belirli kombinasyon buldular ve oyunun o anda geçilmemesi gereken kısmını geçmeyi başardılar. (Bu, oyun tasarımı hakkında çok şey anlatıyor. Oyun tasarımına ilgi duyan insanlar hakkında daha da fazla şey anlatıyor.)",
      "[h3]Kontrollü Kaos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Geliştirme sürecinin sonunda oyunun temel parçaları oluşturulmuştu. Yetenekler, mini-boss karşılaşmaları ve Kraliçe Imperia ile son hesaplaşma hazırdı.  Bu noktada artık oyunu bozan sorunları aramıyorduk; bunun yerine, düzgün çalıştığını bildiğimiz şeyleri ayarlayıp dengeleyerek daha iyi hâle getirmenin yollarını arıyorduk. Oyunu test etmeye devam ettik ancak oyun sonrasında sorduğumuz soruların kapsamını azalttık ve insanların sadece eğlenmek için (ve tabii ki daha fazla veri üretmek için) oynamasına izin verdik.",
      "Bitirilen her oyundan gelen nicel veriler önemliydi ancak oyun testlerinden gelen nitel veriler de en az onlar kadar önemliydi. Oyun testlerinden birinin, dahili olarak \"Köfte\" olarak adlandırdığımız Ağlama Ayini'nin ekranın yarısını kaplayıp oyuncuyu yutmasıyla destansı bir şekilde sona ermesi unutulmaz örneklerdendi. Bu yaşanırken oyunu test eden kişinin arkasında onu izleyen ve talihsizliğine gülen bir grup iş arkadaşı vardı. Beklendiği gibi hemen \"tekrar oyna\" butonuna bastı.",
      "Yayınlamaya değer bir ürünümüz olduğundan emindik ve oyun testini genişleterek, bunu gönüllü olarak yapmayı teklif edenlere ek olarak, şirkette köşeye sıkıştırabildiğimiz herkesi dâhil etmeye başladık. İlk prototipler sırasında, akşam saat 11'de \"Oyun çok zor\" yazan bir Slack mesajı alıyorduk. Bu aşamada hâlâ akşam 11'deki Slack mesajlarını almaya devam ediyorduk ancak daha sonra gece 3'te \"Neyse boş ver, oyunu bitirdim\" mesajı gelirdi. ",
      "Oyunumuzun büyük bir kısmı bitmiş olmasına rağmen, Tacın Düşüşü Bölüm IV yayınlanana kadar [i]Sivri ",
      "Kule[/i] üzerinde çalışmaya devam ettik. Bu yazının başında, elimizde onları destekleyecek faydalı veriler olduğunda kararlarımızı daha iyi bir şekilde verebileceğimizden bahsetmiştik. Ve şimdi bu verilere sahiptik: Oyunu oynamaktan (ve tekrar oynamaktan) büyük heyecan duyan şirket içi oyun testçilerimiz sayesinde, hangi kısımlarının yankı uyandırdığını öğrenmemizi sağlayacak çok miktarda veri elde ettik. Ve hiçbir şey, oyun geliştiricilerini bir oyunun eğlenceli olmaya başladığı andan daha fazla heyecanlandıramaz. Düzgün çalıştığını bildiğimiz şeyleri mümkün olduğunca daha fazla dâhil etmek istiyorduk. Yeni eşyalar, yetenekler, hikâyeler ve hatta sürüler... Oyunu tamamladığımızı düşündüğümüz her an, birileri mutlaka \"bir fikrim daha var\" diyerek karşımıza çıkıyordu. Ve bunlar genellikle çok iyi bir fikirler olduğu için denemeden geçemedik.",
      "Yeni özellikler için fikirler gelmeye devam etmekle kalmadı; yayınlama tarihi yaklaştıkça bu fikirler gittikçe daha iyi hâle geliyordu. Başlangıçta her şey daha belirsizken, yüksek potansiyele sahip bir özellik ile gerçekten önemsiz bir özellik arasında ayrım yapmak zordu. Bir haftamız kalmışken oyunu daha iyi hâle getirmek için kaynaklarımızı ve zamanımızı harcamamız gereken yerler açıkça belliydi.",
      "[h3]Yuvadan Ayrılış[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "[i]Sivri Kule[/i]'nin son rötuşları üzerinde çalışırken, durup ona yeni gözlerle bakma fırsatı bulduk. Amacımız, önceki bölümlerden öğrendiğimiz şeyleri kullanarak bu büyük etkinliğe yakışır derecede destansı bir oyun sonu savaşı yaratmaktı. Özellikle kısıtlı zaman göz önüne alındığında, ortaya çıkan sonuçtan oldukça memnunduk. Eğlenceyi bulmuştuk.",
      "Ne yazık ki topluluk bunu henüz bulamamıştı. Dikkate almadığımız şey, [i]Sivri Kule[/i]'nin bir oyun sonu savaşı olması nedeniyle, mantıken oyunun sonunda olması gerektiğiydi. Bu, Dota'nın güçlü oyuncularının 4. bölümde olağanüstü hızlarda ilerlemesini ve sonunda bunu oynamasını beklerken en az bir iki günlük sessiz işkence anlamına geliyordu. ",
      "Ama o kadar beklememize gerek kalmadı. Birinin Kraliçe Imperia'nın taht odasına ulaşmasını en az bir iki gün bekleyeceğimizi düşünüyorduk. Dota oyuncularının içerikleri ne kadar hızlı tükettiğini aşırı hafife aldığımızı fark ettik. Çıkıştan sadece on altı saat sonra (evet [i]saat[/i]) ilk güçlü oyuncular son bölümün tamamında savaşarak ilerlediler ve [i]Sivri Kule[/i]'yi tadan ilk oyuncular oldular.",
      "Nihayetinde diğer oyuncular da son bölüme ulaştılar. Bu yazının yazıldığı tarih itibarıyla [i]Sivri Kule[/i] yaklaşık yüz milyon kez oynandı. (Siz henüz denemediyseniz veya bir kez daha denemek istiyorsanız, oyun istemcisindeki Tacın Düşüşü Arşivi kısmından oynayabilirsiniz.)",
      "[h3]Belirsizliği Kucaklamak[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Dota ekibinin bir mini oyunu hayata geçirme sürecinin perde arkasını gösteren bu yazının, size sürecimiz hakkında daha iyi bir fikir verdiğini (her şeye süreç ilerlerken karar verdiğimizi görüp dehşet içinde bakmadığınızı) umuyoruz. Cidden, bu yazının, oyun tasarımının karanlık odalarda parmaklarını oynatan bazı dahilerin yarattığı mistik bir sanat olmadığını kanıtladığını umuyoruz. Oyun geliştirmenin veri, kaygı, oyun testleri, başarısızlık, oyun testleri, daha fazla başarısızlık ve daha fazla oyun testleri ile ilerleyen bir deneme-yanılma süreci olduğunu göstermeye çalışıyoruz.",
      "Oyun geliştirme, bir fikir üzerinde değişiklikler yapıp süreci yinelemeyle gelişir. \"Hiçbir fikrim yok\" ile başlayan bir şey, geçmişte işe yarayan fikirlere bakılarak yavaş yavaş \"bir fikrim var\" haline gelir. Sonra bu kimsenin oynamak istemediği ama yine de yaptığımız kötü bir prototipe dönüşür. Ardından insanların oyunu oynarken eğlenmediklerini görürüz ve eğlenmedikleri kısımları düzeltiriz. En sonunda insanların oyunu oynarken eğlendiğini görürüz. Sonra daha iyi hâle getirmek için sürekli uğraşırken yayınlama takvimine bakıp ağlarız. Valve'ın felsefesi her zaman belirsizliği kucaklamak ve geliştirme sürecinin verilerle şekillenmesine olanak tanımak olmuştur. Bu da, içerikleri her zaman zamanında yayınlamamamız anlamına geliyor. Ama bu içerikler hazır olduklarında beğeneceğinizi düşünüyoruz."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091367,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}