{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Giữa làn đạn: Vương Sào Gai Góc",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Giữa làn đạn: Vương Sào Gai Góc",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]Chào mừng bạn trở lại Giữa làn đạn, loạt bài blog tiêu điểm mà các thành viên đội phát triển trình bày những thử thách, lỗi sửa, và đôi khi vài tình huống cười chảy nước mắt trong chặng đường phát triển một trò chơi độc đáo như Dota.[/i]",
      "Trong một sự kiện khổng lồ như Crownfall, chúng tôi đã có rất nhiều thử nghiệm — bản đồ thế giới, cốt truyện phân nhánh, token theo chủ đề tướng, trò chơi nhỏ, truyện tranh, tác phẩm pixel art, và nhiều ý tưởng khác mà chúng tôi đã háo hức muốn khám phá trong nhiều năm.",
      "Điều làm chúng tôi tự tin để chấp nhận những rủi ro đó — và thứ chúng tôi liên tục tận dụng ở Valve — là tính tự do thử nghiệm: thu thập dữ liệu người dùng thực, để dữ liệu thách thức giả định của chúng tôi, và thậm chí thay đổi suy nghĩ nhận thức. Chúng tôi thường nói mình không hoàn toàn hiểu những gì mình đang làm cho đến khi chứng kiến người chơi tương tác, vậy nên chúng tôi luôn tìm cách tiến đến thời điểm đó nhanh nhất có thể.",
      "Tư duy đó cũng định hình khi chúng tôi đưa ra quyết định — thường là trễ nhất có thể trong quá trình phát triển, vào lúc chúng tôi có dữ liệu tốt nhất (và đôi khi là duy nhất). Ở mỗi bước, chúng tôi đều dựa vào trải nghiệm thực tế của người chơi để tập trung nỗ lực vào những gì tạo ra tiếng vang, và tránh xa các thứ không làm được như vậy.",
      "Trong phiên bản [i]Giữa làn đạn[/i] này, chúng tôi sẽ nói về việc phát triển một thứ ra mắt khá trễ trong Crownfall — trận đấu trùm hồi IV giữa các tướng và Nữ đế Imperia, [i]Vương Sào Gai Góc[/i]. Chúng tôi xem đây là một tình huống nghiên cứu nhằm chứng minh cách mà việc chơi thử, và dữ liệu có được từ đó, đã định hình quyết định của chúng tôi.",
      "[h3]Đường đến gặp Imperia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Minigame đầu tiên (và duy nhất) trong hồi I là trò câu cá với Tidehunter thử thách kỹ thuật cầm cần, hy vọng bạn câu cho gã một bữa sáng no nê. Phần lớn hồi I có tính chất như thế — chúng tôi rải đều các ý tưởng nho nhỏ khắp bản đồ để xem người chơi sẽ tương tác với điều gì. Dữ liệu khích lệ của người chơi từ hồi I đã tiếp thêm tự tin cho chúng tôi để phiêu hơn trong hồi II, và đến hồi III chúng tôi cho ra mắt [i]Sleet Fighter[/i], trò chơi đối kháng tại quán bar lặn yêu thích của Tusk; [i]Cờ Rồng[/i], trận đấu trí khớp ba hình giống nhau với Winter Wyvern; và [i]Hang ổ Zaug[/i], kiểu chơi shoot 'em up giữa một con rồng độc ác và Vengeful Spirit qua hệ thống hang động quanh co của Icewrack. ",
      "Khi đến hồi IV, chúng tôi đã có nhận thức rõ ràng điều gì hiệu quả và điều gì không. Vậy có loại dữ liệu gì? Từ dữ liệu cơ bản — như bao nhiêu người chơi lại mỗi trò chơi nhỏ và tần suất chơi — đến những thông tin với phân tích chi tiết, như phản hồi từ người dùng và thảo luận trên mạng. Với hiểu biết rõ ràng đó, chúng tôi có đủ tự tin dốc toàn lực để bước vào giai đoạn chung cuộc đầy gay cấn: trận đấu trùm hoành tráng trước Nữ đế Imperia độc ác.",
      "Dĩ nhiên, quyết định được loại trò chơi gì cho đấu trùm cũng không hề đơn giản. Chúng tôi hiểu rõ, cuộc đối đầu cần phải đạt tầm vóc hoành tráng mà người chơi kỳ vọng. Đồng thời cũng phải đủ độ đa dạng để bạn vẫn cảm thấy mới mẻ sau nhiều lần chơi lại. Và vì đây là một trò chơi nhỏ, được thiết kế để trải nghiệm khi xếp hàng chờ trận đấu, do đó trò chơi tuy khốc liệt nhưng phải nhanh gọn. Trò chơi nhỏ này nên theo kiểu một bữa phụ ngon miệng, chứ không phải bữa ăn chính dài hơi.",
      "Để đạt đúng điểm cân bằng, chúng tôi cần một thể loại kết hợp giữa giá trị sản xuất cao như [i]Sleet Fighter[/i] với tính chơi lại như [i]Cờ Rồng[/i]. Nói cho cùng, đây sẽ là cuộc đối đầu hoành tráng giữa Vengeful Spirit, Skywrath Mage, và tân binh Kez (\"bộ tam\" của chúng tôi từ bốn hồi truyện Crownfall) càn quét lâu đài của Imperia. Chúng tôi muốn người chơi cảm thấy như họ đang phải đối mặt với thử thách không tưởng trong sứ mệnh chạm trán với nữ đế.",
      "[h3]Ấp ủ kế hoạch[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Một ý tưởng mau chóng thu hút sự ủng hộ là chiến đấu theo lượt kiểu nhập vai JRPG. Nhưng chẳng mấy chốc, chúng tôi nhận ra ý tưởng này không phù hợp. Chúng tôi cần cái gì đó để giục người chơi thật nhanh đi vào hành động — cái gì đó ngắn, khốc liệt, và đủ vui để chơi giữa những lúc tìm trận Dota.",
      "Đó là lúc thể loại sinh tồn lóe sáng. Một kiểu \"Bullet Hell ngược\" nhưng là với lượng quân địch vô tận, quả là khuôn mẫu hoàn hảo cho một trận đấu trùm đỉnh nóc, kịch trần. Người chơi phải bơi giữa loạt kẻ thù áp đảo, đồng thời dùng chút ít mưu mẹo để tăng cấp nhiều kỹ năng hòng chuẩn bị cho trận quyết tử cuối cùng với Imperia. Cũng sẽ dễ dàng tận dụng vật phẩm và kỹ năng mà Dota có sẵn, vì người chơi sẽ nhận thức được phần nào cách mọi thứ hoạt động.",
      "Vì muốn trải nghiệm chơi phải tương đối ngắn gọn, nên việc thiết kế mảng chơi lại cũng là một bài toán quan trọng cần giải đáp. Thể loại sinh tồn cho chúng ta nhiều biến tấu, vì không phải lần chơi nào cũng giống nhau. Người chơi không đảm bảo nhận được cùng vật phẩm hay sự kiện theo đúng thứ tự mong muốn. Biến số này cũng khuyến khích bạn bắt đầu tiếp, mang đến thử thách nhưng lại không bị choáng ngợp hay nản lòng. Chúng tôi không hẳn muốn bạn phải thắng từ lần đầu... nhưng chúng tôi cũng muốn bạn tiếp tục chơi kể cả khi thua. ",
      "[h3]Nguyên mẫu sơ khai[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Nguyên mẫu sơ khai nhất của [i]Vương Sào Gai Góc[/i] bắt đầu với các yếu tố cốt lõi hệt như phiên bản được cho ra mắt sau này. Người chơi chọn một trong ba tướng, đối mặt với nhiều lượt quân địch, và cuối cùng là chạm trán Imperia. Những thử nghiệm ban đầu này chả có gì đáng gọi là vui cả. Đôi lúc tướng sẽ lang thang trên bản đồ gần như trống trơn, lâu lâu mới đụng phải một con lính xương. Những lúc khác lượt quân địch lại quá áp đảo đến mức không thể nào thắng (đó là chúng tôi nghĩ thế; xin giải thích thêm về sau). Chúng tôi biết có một công thức để tạo nên trò chơi thật vui ẩn đâu trong đó. Chúng tôi chỉ cần tiếp tục tra tấn người chơi thử với những bản build tệ hại cho đến khi ơ-rê-ka, tìm ra rồi.",
      "Mỗi nhân viên Valve là một con chuột bạch, và việc đặt chuột vào thử bản build là cách chúng tôi phát hiện ra xem cái gì dùng được (mà đa phần là, [i]không[/i] dùng được). Ý tưởng thì vô vàn, nhưng phải đến khi ai đó ngồi xuống và chơi, thì chúng tôi mới biết lựa chọn đó có hợp lý hay không.",
      "Ban đầu, người chơi thử chật vật cầm cự trong 3-6 phút đầu. Thông thường, đó là dấu hiệu trò chơi không cân bằng hoặc giải thích quy tắc chưa tường tận. Chúng tôi ngồi xuống cùng người chơi thử và nghe chia sẻ trải nghiệm — những lúc họ không chắc phải làm gì tiếp theo, hay lúc cảm thấy choáng ngợp đến mức tưởng như bất khả thi, hay cả những chỗ tẻ nhạt. Rồi chúng tôi quay về bàn làm việc và biến tấu, rồi trình làng tới người chơi thử mới. Từ từ, chúng tôi bắt đầu thấy tiến triển.",
      "Và rồi điều bất ngờ xảy ra.",
      "Sau khi thuật lại về lần chơi đầu, một người chơi thử vừa thua đã hỏi, \"Ê này, tôi có thể thử lại không?\".",
      "Một ý hay mới và khích lệ. Vương Sào Gai Góc khi đó vẫn còn xa vời chữ tốt — và thường phải mất ít nhất ba lần chơi trước khi ai đó đoán ra cách đánh bại nguyên mẫu của chúng tôi — nhưng chí ít tin tốt là, nếu chỉ có một lần, chúng tôi không bắt đồng nghiệp phải chơi bản nguyên mẫu tào lao — họ thậm chí còn muốn chơi lại nguyên mẫu bí đao đó lần thứ hai.  Dù chỉ một đốm lửa quan tâm bé xíu xiu: \"Tôi không hoàn toàn ghét trò này\". Chúng tôi cũng hân hoan đón nhận.",
      "Nhưng khoảnh khắc ơ-rê-ka thực thụ vẫn chưa tới.",
      "[h3]Lên đồ tướng[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Các phiên bản đời đầu của chúng tôi cho thể loại game sinh tồn thiếu một yếu tố then chốt: áp lực liên tục. Ban đầu, chúng tôi chỉ tạo một lượt gồm hàng trăm lính xương vào màn chơi và để tướng chặt chém chúng. Sau khi không còn tên lính xương nào, chúng tôi sẽ tạo ra một đợt tiếp theo với độ khó cao hơn. Người chơi thử nhanh chóng cảm thấy nhàm chán. Sau khi hiểu ra mục tiêu duy nhất là không ngừng băm vằm kẻ xấu, người chơi cảm thấy mất dần hứng thú. Chỉ có một phần thưởng duy nhất khi hạ kẻ địch hiệu quả hơn là bạn có thể tiêu diệt đợt kẻ thù khó hơn kế tiếp một cách nhanh hơn. (Hoan hô?).",
      "Cuối cùng, chúng tôi nhận ra khi tạo một trăm lính xương để tướng bắt đầu chặt chém, phải đặt một bộ đếm ngược và liên tục thêm lính xương vào bất chấp tướng đã giết được bao nhiêu. Khi đồng hồ về 0, chúng tôi sẽ tạo ra một đợt địch khó hơn với mốc thời gian mới. Giờ đây, áp lực không bao giờ được giải tỏa, và người chơi liên tục bị cuốn hút. ",
      "Nhưng quan trọng hơn, [i]mục tiêu[/i] đã thay đổi. Khi tướng của chúng tôi tàn sát số lượng lính xương ngày càng ít đi, mục tiêu khi ấy là \"Biến số lượng lính xương về 0\". Nhưng nếu lượng lính xương [i]không bao giờ giảm bất kể có bao nhiêu bị giết[/i], thì chẳng mất nhiều thời gian để người chơi nhận ra giết chúng không phải là mục tiêu. ",
      "Thay vào đó, họ tập trung vào câu hỏi [i]nhận[/i] được gì khi giết tụi lính xương — trong trường hợp này, thì đó là kỹ năng và nâng cấp. Đột nhiên mục tiêu từ \"Giết toàn bộ lính xương\" đã biến thành \"Tôi có thể giết bao nhiêu càng nhanh càng tốt để trở nên [i]mạnh mẽ[/i] nhất có thể?\". Thay vì cảm thấy như phải làm việc nhà, gặt hái các đợt địch bắt đầu mang đến cảm giác như nuôi số — với mỗi mạng giết đem bạn tới gần hơn cách lên đồ và kỹ năng hoàn hảo. ",
      "Vì tiến vào đợt địch tiếp theo không còn gắn liền với hành động giết sạch như đợt trước, chúng tôi cũng phát triển một yếu tố mới: đồng hồ dùng chung. Điều này có nghĩa những người chơi giờ chia sẻ cùng nhịp độ — một lối diễn đạt chung để ra hiệu tình hình bắt đầu gay cấn hơn. Vậy nên khi một người chơi nói \"Tôi không qua nổi đợt nhện vào phút thứ bốn\", mọi người khác đều lập tức hiểu ý (lũ nhện đó khó nhằn nhất).",
      "Chúng tôi giờ đã tìm thấy công thức tạo sự thú vị. Sự chuyển đổi nhỏ trong trọng tâm giúp làm rõ cái gì người chơi thích thú và tại sao, và khơi mào một loạt ý tưởng mới — thêm nâng cấp mạnh hơn, kỹ năng điên rồ hơn, và cách lên đồ tiềm năng mà chúng tôi thậm chí còn chưa nghĩ tới. Điều này có nghĩa người chơi thử có thể tạo nhiều cách lên cấp tướng khác nhau rõ rệt trong một lần chơi. Qua đó, họ say mê hơn trong quá trình chơi thử, đem đến phản hồi và góp ý tốt hơn để đưa vào bản build tiếp theo.",
      "Đấy là nếu chúng tôi không chỉ dừng lại ở một lần hỏi. Sau một đợt chơi thử, chúng tôi đôi lúc thấy đồng nghiệp không còn muốn chia sẻ về những điều họ thích hoặc không thích. Mà lại muốn bàn về cách lên cấp kỹ năng, lên đồ, và tranh cãi phương hướng nào tốt hơn. ",
      "Với tùy chọn lên đồ ngày càng đa dạng, chúng tôi bắt đầu tự hỏi mình có bỏ sót mảnh ghép nào không — điều gì xảy ra nếu bản thân tướng cũng độc đáo không khác gì kỹ năng? Trong các nguyên mẫu sơ khai, ngoài kỹ năng khởi điểm, trải nghiệm người chơi thường đa phần giống nhau dù có chọn tướng nào đi chăng nữa. Giờ chúng tôi biến tấu để cho ra những lựa chọn độc đáo, làm tướng này mạnh hơn, tướng kia nhanh hơn, tướng khác thì gây sát thương phép giỏi hơn — từ đấy tăng tính đa dạng cho cách lên đồ. Chọn tướng này thay vì tướng kia cũng có nghĩa mở thêm một nhánh các kỹ năng cụ thể mà bạn sẽ không có cơ hội phát triển nếu không chọn. (Và vì luôn đòi hỏi yếu tố may mắn với mỗi nâng cấp nhận được, nên từng lựa chọn đều tựa như canh bài bạc tỷ).",
      "[h3]Sáu phút đầu tiên[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Trong lúc bạn bị phân tâm bởi việc phải chọn nhánh nâng cấp nào để đuổi tới Imperia, chúng tôi dần dần tăng độ khó. Đến một thời điểm, mà bạn thậm chí không nhận ra, các đợt công kích trở nên nguy hiểm chết người, diễn biến truy sát không ngơi nghỉ, và bạn chật vật giữ mạng sống của mình. ",
      "Chí ít, mục tiêu là vậy. Với việc các nâng cấp được định hình dần, chúng tôi chuyển sang nhịp độ của lối chơi. Chúng tôi muốn mang lại trải nghiệm khốc liệt, nhưng không đi quá đà. (Chúng tôi biết đa phần người dùng sẽ chơi khi họ đang xếp tìm trận đấu). Mặt khác, chúng tôi muốn chừa chút chỗ để người chơi tận hưởng thành quả từ lựa chọn nâng cấp của họ.",
      "Mấy phép tính ghi vội trên khăn ăn cho thấy tổng thời lượng chơi khoảng 12 phút — không tính ba phút đấu Imperia trong màn kết. Vậy nên chúng tôi điều chỉnh nhịp độ cho sáu phút đầu tiên. Nên cho phép người chơi lựa chọn nâng cấp bao lâu một lần? Người chơi có thể bắt đầu cộng dồn kỹ năng từ lúc nào? Mỗi kỹ năng nên gây bao nhiêu sát thương để tạo cảm giác thỏa mãn nhưng không gây áp đảo? ",
      "Vì chúng tôi điều chỉnh lối chơi theo giai đoạn, tập trung vào sáu phút đầu đồng nghĩa sáu phút cuối về cơ bản là không chơi được vào thời điểm này. Chúng tôi tổ chức buổi chơi thử cho sáu phút đầu và rồi ngừng lại. [i]Về mặt kỹ thuật[/i] họ vẫn có thể tiếp tục chơi, nhưng tất cả những gì sau sáu phút chỉ là gạch đá giữ chỗ. Không nên chơi quá thời gian đó. (Chúng tôi thực sự năn nỉ đồng nghiệp đừng chơi nữa). ",
      "Một tác dụng phụ của việc làm kỹ năng và nâng cấp trở nên vui nhộn là người chơi thử thường không quan tâm đến việc nửa sau của trò chơi vẫn không thể chơi được. Chúng tôi sẽ ngồi tại bàn của đồng nghiệp, xem họ chơi nửa phần đầu của trò chơi. Ngay khi chạm mốc sáu phút: ",
      "Chúng tôi sẽ nói \"Tuyệt vời, cảm ơn nhiều\". \"Giờ bắt đầu lại nha?\".",
      "Ngập ngừng. ",
      "\"Khoan nào, tôi nghĩ tôi qua màn được\". ",
      "Chúng tôi sẽ nhắc họ rằng sáu phút cuối là vùng đất hoang tàn nghiệt ngã mất cân bằng, tràn ngập kẻ địch giống hệt phần trước và không thể đánh bại. Họ sẽ nói kiểu, biết rồi, khổ lắm, nói mãi. Chúng tôi sẽ hỏi han họ về những giai đoạn thăng trầm. Họ chia sẻ rất nhiều phản hồi tuyệt vời về quá trình chơi trong sáu phút đầu. Và khi chúng tôi quay về bàn làm việc, họ ngó theo rồi quay lại tiếp tục chơi và tìm cách qua màn. ",
      "Một vài đồng nghiệp coi đó là hành động khi dễ khi cho rằng họ không thể đánh bại sáu phút khó điên đảo đến bất khả thi chẳng cách chi qua màn được. Vậy nên trong khi chúng tôi đang thiết kế nửa đầu của trò chơi, thì họ lại cùng nhau lao tâm khổ tứ tìm cách chinh phục nửa sau bất khả chiến bại. ",
      "Và chuyện là vầy: Họ đã làm được. ",
      "Rốt cuộc họ đã tìm ra cách kết hợp hoàn hảo những kỹ năng quá mạnh mà chúng tôi chưa kịp tinh chỉnh, và đánh bại phần trò chơi vốn không thể vượt qua. (Câu chuyện này nói lên rất nhiều về thiết kế trò chơi — nhưng có lẽ cũng chia sẻ góc nhìn tường tận về kiểu người tham gia vào thiết kế trò chơi).",
      "[h3]Hỗn loạn có kiểm soát[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Đến cuối quá trình phát triển, phần cốt lõi của trò chơi đã được hình thành. Kỹ năng, các cuộc đụng độ trùm phụ, và màn quyết đấu cuối cùng với Nữ đế Imperia đều sẵn sàng.  Tại thời điểm này, chúng tôi không truy tìm các lỗi phá hỏng trò chơi, mà tìm cách để điều chỉnh, cân bằng và đánh bóng hết cỡ những gì đang hoạt động hiệu quả. Chúng tôi tiếp tục cho chơi thử, nhưng giảm bớt các buổi phỏng vấn dài hơi sau đó và cứ để mọi người chơi thỏa thích (và dĩ nhiên, để tạo thêm nhiều dữ liệu).",
      "Dẫu dữ liệu định lượng từ mỗi lần chơi là rất cần thiết, dữ liệu định tính từ các trận chơi thử cũng không kém phần quan trọng. Lấy một ví dụ đáng nhớ, có một lần chơi thử kết thúc hoành tráng với trùm phụ Rên rỉ thành hình — tên nội bộ là \"Cục xíu mại\" — chiếm đến một nửa màn hình và nuốt chửng người chơi. Tại thời điểm đó, người chơi thử có một lượng khán giả kiêm đồng nghiệp dõi từ phía sau, tất cả đều chọc ảnh xu cà na. Dĩ nhiên, anh ta lập tức nhấn nút \"chơi lại\".",
      "Chúng tôi tự tin rằng mình có thứ gì đó đáng để ra mắt, và đã mở rộng việc chơi thử từ phạm vi người chơi tình nguyện, đến bất cứ ai chúng tôi có thể chèo kéo và nài nỉ trong công ty.  Trong nguyên mẫu sơ khai nhất, chúng tôi đã nhận được tin nhắn lúc 11 giờ đêm trên Slack than rằng \"Trò gì khó quá vậy\". Đến giai đoạn này, chúng tôi vẫn thấy mấy cái tin nhắn lúc 11 giờ đêm, rồi sau đó là tin \"À, tôi qua màn rồi\" vào lúc 3 giờ sáng. ",
      "Kể cả khi trò chơi đã gần hoàn thiện, chúng tôi vẫn tiếp tục phát triển [i]Vương Sào Gai Góc[/i] cho đến tận ngày ra mắt Crownfall hồi IV. Trở lại đầu bài viết này, chúng tôi đã nói rằng sẽ có thể ra quyết định tốt hơn khi tìm được đủ dữ liệu củng cố. Chà, giờ thì đã có: Với việc người chơi thử nội bộ hào hứng chơi đi (chơi lại), chúng tôi có hàng tấn dữ liệu để biết nội dung đã phát triển nào đang tạo được tiếng vang. Và chẳng có gì khiến căn phòng đầy các nhà phát triển phấn khích hơn khoảnh khắc trò chơi bắt đầu trở nên vui banh nóc. Chúng tôi muốn làm thêm những thứ mà nay biết là có hiệu quả, cố nhét vào nhiều nhất có thể. Vật phẩm, kỹ năng, truyện sử và thậm chí đợt quân địch mới — cứ mỗi khi tưởng chừng đã chốt xong trò chơi, thì y như rằng lại có ai đó nảy ra thêm ý tưởng \"thêm cái này nữa thôi\". Bởi toàn là sáng kiến, nên chúng tôi không thể kiềm chế mong muốn thử xem sao.",
      "Không chỉ liên tục xuất hiện, ý tưởng cho tính năng ngày càng trở nên thú vị hơn khi ngày ra mắt đã cận kề. Trong những ngày đầu, khi mọi thứ còn mơ hồ, rất khó để phân biệt giữa tính năng có thể mang đến giá trị cao với tính năng có giá trị thấp thực sự. Sau khoảng một tuần thì chúng tôi hiểu rõ được đâu là nơi tốt nhất để dồn tài nguyên và thời gian nhằm cải thiện trò chơi.",
      "[h3]Rời Vương Sào[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Khi đến công đoạn hoàn thiện sau cùng cho [i]Vương Sào Gai Góc[/i], chúng tôi đã có thể ngồi xuống và nhận định trò chơi dưới một góc nhìn mới. Thử thách ở đây là dùng những gì học hỏi được từ các hồi trước để phát triển một trận đấu trùm hoành tráng đặng khép lại một sự kiện khổng lồ. Chúng tôi khá hài lòng với những gì đạt được, đặc biệt với khoảng thời gian hạn chế. Chúng tôi đã tìm thấy công thức tạo niềm vui.",
      "Không may thay, cộng đồng vẫn chưa khám phá ra. Có một điều chúng tôi chưa tính tới, vì [i]Vương Sào Gai Góc[/i] là một trận đấu trùm, về lý thì trùm phải ngụ tại... thì, nơi trùm lập hộ khẩu, ở cuối trò chơi. Điều này có nghĩa chúng tôi phải chịu đựng một hai ngày tra tấn thầm lặng trong khi chờ đợi những game thủ siêu phàm của Dota cày hết hồi IV với tốc độ siêu nhân, chờ đợi đến lúc người chơi sau cùng cũng có cơ hội trải nghiệm. ",
      "Cơ mà chúng tôi không phải chờ lâu. Chúng tôi tưởng cần ít nhất một đến hai ngày để có người đến được phòng ngai vàng của Nữ đế Imperia. Nhưng chúng tôi đã đánh giá thấp tốc độ người chơi Dota càn quét nội dung. Chỉ mười sáu giờ sau khi ra mắt — đúng đó, tính bằng [i]giờ[/i] thôi — nhóm người chơi siêu đẳng đầu tiên đã cày nát toàn bộ hồi cuối và nếm thử vị của [i]Vương Sào Gai Góc[/i].",
      "Và rồi bàn dân thiên hạ còn lại cũng đuổi kịp. Tính đến thời điểm bài viết này, [i]Vương Sào Gai Góc[/i] đã được chơi tới gần một trăm triệu lần. (Nếu bản thân chưa bắt kịp, hoặc chỉ muốn thử sức một lần nữa, bạn có thể chơi từ Lưu trữ Crownfall trên phần mềm).",
      "[h3]Hoan nghênh sự bất định[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Chúng tôi hy vọng cái nhìn hậu trường về cách đội ngũ Dota gầy dựng một trò chơi nhỏ giúp bạn hiểu hơn về quy trình của chúng tôi — và không phải làm bạn nhìn vào bài blog này trong kinh hoàng để rồi nhận ra chúng tôi vừa viết vừa chém gió. Nhưng nói thiệt nha, chúng tôi mong bài viết chứng minh rằng thiết kế trò chơi không phải là nghệ thuật huyền ảo gì được tạo ra từ những khối óc thiên tài múa may trong phòng tối, mà đó là quy trình lặp đi lặp lại của thử nghiệm và thất bại được định hướng bởi dữ liệu và lo lắng và chơi thử và thất bại và lại chơi thử và lại thất bại, cứ thế tiếp tục.",
      "Quá trình phát triển trò chơi hưởng lợi từ hành động lặp đi lặp lại — bắt đầu từ \"không ý tưởng\" từ từ biến thành \"vài ý tưởng\" qua việc xem xét ý tưởng có hiệu quả trước đó. Rồi biến ý tưởng thành một nguyên mẫu tệ hại không ai muốn chơi nhưng chúng tôi vẫn làm. Rồi chúng tôi xem họ chơi trong bực dọc, và đi sửa tất tần tật những phần không vui, cho đến khi chúng tôi thấy mọi người thưởng thức trò chơi trong vui vẻ. Sau đó chúng tôi mài dũa, đánh bóng trong lúc khóc ròng khi nhìn vào lịch ra mắt. Triết lý của Valve luôn là đón chào sự bất định và cho phép dữ liệu định hình việc phát triển. Điều này có nghĩa chúng tôi không phải lúc nào cũng ra mắt đúng hạn. Nhưng chúng tôi nghĩ bạn sẽ thích hơn khi sản phẩm sẵn sàng."
    ],
    "commentcount": 341,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 28,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 2514,
    "votedowncount": 270,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747170127,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2510,
  "votes_down": 270,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}