{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "兵線之間：荊棘王座",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "兵線之間：荊棘王座",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[b]歡迎回到「兵線之間」，一個由我們開發團隊成員主筆的網誌內容，為大家詳細說明在開發像 Dota 這樣獨特的遊戲時，我們遇到的一些挑戰、程式錯誤修正，以及偶爾出現的意外驚喜。[/b]",
      "製作像王冠之墮這樣大規模的活動給我們很多機會做實驗——主世界地圖、分支故事情節、英雄主題代幣、小遊戲、漫畫、像素藝術品，和大家多年來很想探索的其它主意。",
      "讓我們能放膽冒這些險的原因，也是在 Valve 進行開發一直都有的優點，就是可逐步改進的自由：收集真實玩家的資料、讓資料質疑我們的假設，甚至改變我們的想法。 我們經常說，在看到玩家與我們製作的內容互動前，我們並不完全了解正在製作的是什麼，所以我們試著盡快把內容交給玩家。",
      "這心態亦影響我們做決定的時機——通常盡可能在開發過程的晚期，當我們獲得最好的（有時是僅有的）資料時。 在每一步中，我們依賴實際玩家體驗來協助我們專注於能產生共鳴的內容，並避開沒有共鳴的內容。",
      "在[b]兵線之間[/b]的這一版中，我們會詳細介紹的內容開發過程是王冠之墮比較晚推出的內容——第四幕中我們的英雄與依裴利亞女王對決的魔王關，[b]荊棘王座[/b]。 我們亦以此作案例研究，展示遊戲測試及其產生的資料如何影響我們的決策。",
      "[h3]追擊依裴利亞[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "第一幕中的第一款（也是唯一一款）小遊戲是簡單的釣魚小遊戲，當中潮汐獵人會測試您的角度瞄準技巧，希望您為他釣到早餐。 第一幕很多內容都是這樣——我們在地圖上散佈各種簡單想法的成品，看看玩家對哪些有興趣。 第一幕令人鼓舞的玩家資料讓我們有信心在第二幕更加大膽，而第三幕我們推出了[b]鬥塔旋風[/b]，一款在圖斯克最愛的地方酒吧中鬧事的格鬥遊戲；[b]龍棋[/b]，一款與寒冬飛龍鬥智的三消遊戲；[b]祖格的巢穴[/b]，一款讓惡龍與復仇之魂在冰川殘骸曲折蜿蜒的洞穴系統中對決的清版射擊遊戲。 ",
      "到開發第四幕時，我們已清楚了解什麼可行，什麼不可行。 收集到什麼樣的資料？ 從具體的數據——每款小遊戲有多少重複遊玩次數及頻率——到綜合性資訊，如使用者提交的意見回饋和線上討論全部都有。 由此獲得的全盤了解讓我們有信心放手一搏，完成前所未有的最終幕：與邪惡依裴利亞女王對決的史詩級大魔王之戰。",
      "當然，決定魔王關應該是怎樣的遊戲並不容易。 我們知道這需要為玩家帶來他們期望的高風險重大埸面， 但同時也要提供足夠的多樣性和可重玩性，這樣在多次遊玩後亦仍能保持新鮮感。 而因為這是個小遊戲，其設計是用在尋找遊戲配對的等待期間遊玩，所以要刺激但簡短。 應該要像好味道的零食，而不是一頓漫長的正餐。",
      "為達到適當的平衡，遊戲類型需要結合[b]鬥塔旋風[/b]的精良品質和[b]龍棋[/b]的可重玩性。 畢竟，這會是復仇之魂、天怒法師和新人卡斯隼（王冠之墮的四幕故事中的「三巨頭」）闖進依裴利亞的城堡進行的史詩級決戰。 我們想讓玩家在追擊女王時覺得這是困難重重、不太可能的任務。",
      "[h3]制定計畫[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "一個短暫受到歡迎的主意是回合制日系角色扮演風格戰鬥。 但我們不久後就發現這並不適合。 我們需要快速將玩家投入戰鬥的遊戲——簡短、激烈，又好玩到讓人想在 Dota 佇列之間遊玩的遊戲。",
      "這時候倖存者遊戲類型就最適合不過。 一波又一波敵人來襲的「反向彈幕」，是一場有史詩感又高風險的大魔王之戰的完美載體。 玩家需要在一群又一群敵人中殺出血路，同時需要在升級各種技能時稍為考慮戰略，為面對依裴利亞的最終對戰做準備。 在戰鬥中加入對應的既有 Dota 道具和技能也很容易，這樣玩家已經大概知道怎麼使用。",
      "由於我們希望這體驗相對短暫，因此可重玩性就成為難題的另一個重要部分。 倖存者類型遊戲的多變性高，因為每次的體驗都不會一樣。 玩家不一定能按想要的順序得到期望獲得的道具或遇到的事件。 這多變性鼓勵玩家不斷嘗試，充滿挑戰性地從頭開始，而不讓人感到難以克服或沮喪。 我們沒有想讓玩家第一次玩就贏……但也想大家在輸掉後繼續重玩。 ",
      "[h3]早期原型[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "[b]荊棘王座[/b]最早期原型和我們最終推出的版本有著相同的主要元素。 玩家從三個英雄中選一位，面對一波又一波的敵人，最後對上依裴利亞。 最早嘗試的幾個版本完全缺乏趣味。 有時英雄會在幾乎空無一人的地圖上遊走，偶爾遇到幾隻骷髏。 其它時候就敵人波數壓倒性地多，根本無法獲勝（或當時我們是這樣以為，之後再解釋）。 我們知道這遊戲可以很好玩。 我們只需要繼續用不好玩的版本折磨我們的遊戲測試員，直到找到好玩的版本為止。",
      "每個 Valve 員工都是隻白老鼠，將某個版本放在某人面前讓他試，是我們判斷成品可行（或一樣常見的，[b]不可行[/b]）的方式。 我們可以無限地集思廣益，但直到有人坐下來玩之前，我們不能確切地知道我們的選擇是否正確。",
      "一開始，遊戲測試員在頭 3 至 6 分鐘苦苦掙扎無法活下來。 通常，這代表遊戲要不是不平衡，就是沒清楚地解釋遊戲規則。 我們會跟他們一起坐下來，讓他們講解自己的體驗——他們不知道下一步要做什麼的時候，或遊戲難到覺得不可能贏，甚至是覺得很無聊的時候。 我們就會回到自己的辦公桌前進行修改，再給另一位遊戲測試員試玩。 慢慢地，我們開始看到進展。",
      "然後發生了一件事。",
      "一位剛輸掉的遊戲測試員在告訴我們他第一次玩的體驗後問：「話說，我可以再試一次嗎？」",
      "第一次有人這樣說，也振奮了我們。 雖然那時荊棘王座還遠遠談不上是好玩，通常要試三輪以上才會有人發現要怎麼打贏我們的原型——但至少，我們終於不用再強迫同事玩我們糟糕的原型了，他們真的想再玩一次那個糟糕的原型。  就是閃過的那一丁點興趣：「我不完全討厭這遊戲。」 這已經讓我們滿意。",
      "但真正開竅的時刻還未到來。",
      "[h3]英雄裝備技能組合[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "我們的初期版本所缺少的一項倖存者類型遊戲關鍵元素便是持續不斷的壓力。 最初，我們會在關卡中生成一個包含一百個骷髏的敵人波，並讓英雄盡情砍殺。 當英雄把敵人殺光後，我們會以更高的難度生成下一波敵人。 遊戲測試員很快就對此感到無趣。 當他們發現目標是永無止盡地砍殺壞人，遊戲便變得有些枯燥。 有效率地擊殺這些敵人，最後的獎勵卻僅僅是更快地與下一波更困難的敵人戰鬥。 （好像沒什麼意思？）",
      "最後，我們發現當我們生成一百個骷髏且英雄開始殺敵後，我們必須為此敵人波設定倒數計時，同時，無論英雄擊殺多少骷髏我們將不斷提供更多。 當倒數計時歸零時，我們會生成一波更困難的敵人並開始新的倒數計時。 這樣就會有持續不斷的壓力，且玩家能更加投入。 ",
      "但更重要的是，他們的[b]目標[/b]改變了。 我們的英雄原本是在屠殺一群數量不斷減少的骷髏，所以目標是「讓骷髏數量歸零」。 但是，如果[b]無論殺了多少，骷髏的數量都不會減少[/b]，玩家很快就會發現擊殺他們並不是真正的目標。 ",
      "他們反而會專注在擊殺骷髏時能[b]獲得[/b]些什麼，而此情況下，獲得的是技能與升級。 目標突然從「殺光骷髏」變成「我該怎麼盡快擊殺骷髏，然後變得更[b]強大[/b]」。 這樣一來，斬殺成群的敵人就不會枯燥，而是變得更像摸彩，每次擊殺都會讓您更接近完美的裝備技能組合。 ",
      "由於您的進展不再取決於擊殺上一波的所有敵人，我們也獲得了一個新的關鍵：共同的遊戲時間。 這代表玩家現在會體驗相同的遊戲節奏，這樣一來當遊戲難度持續提高時，大家都有能共享的體驗。 所以，當有玩家說「第四分鐘出的那波蜘蛛太難纏了」的時候，大家馬上就能了解他的意思（蜘蛛最討厭了）。",
      "我們終於找到了好玩之處。 這個小小的焦點轉移協助釐清玩家們喜歡的內容以及喜歡的原因，同時也帶來了各種新想法——更強大的升級、更誇張的技能和我們以前沒有考慮過的裝備技能組合。 這代表遊戲測試員能在每局遊戲中打造出非常不同的英雄裝備技能組合。 也代表他們在遊戲測試期間更加投入，並能為下一次版本更新提供更好的回饋與意見。",
      "如果我們多問幾次的話。 在遊戲測試後，我們有時候會發現這些同事並不想要跟我們討論他們在遊戲中的好壞體驗。 他們更想與彼此討論自己的裝備技能組合，並爭論哪一個更強。 ",
      "隨著裝備技能有越來越多種搭配方式，我們開始懷疑我們是不是漏掉了一個重要的關鍵——要是英雄能跟技能一樣能帶來獨特的體驗呢？ 在一些早期遊戲原型中，除了初始技能以外，無論選了哪一名英雄，玩家體驗都是大同小異。 現在我們將調整這一點，使其成為真正的獨特選項，讓一個角色更強、一個更快、另一個更擅長魔法傷害，這樣就能更進一步地擴展裝備技能組合的多元性。 挑選別的英雄也代表您能使用玩其他英雄時可能不會選的技能分支 （另外，由於取得哪些升級選項得看運氣，這會讓每一次做出選擇都有種投下高額賭注的感覺）。",
      "[h3]開局六分鐘[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "而在您分心思考哪個升級分支能帶您見到依裴利亞的同時，我們在慢慢提高著難度。 到一定程度，在您沒有意識到的情況下，一波一波的敵人變得殺機四伏、攻勢無歇，您幾乎要無法招架。 ",
      "至少，我們的目的是如此。 有了這些升級後，我們將目光轉向遊戲的節奏。 我們希望體驗帶有一定難度，但不招致抗拒感 （我們知道大多數玩家會在等候比賽佇列時玩）。 但是，另一方面，我們希望留下足夠的發揮空間，讓玩家享受看著升級搭配逐漸成形的感覺。",
      "我們用餐巾紙背面粗估了一下，總共大概需要 12 分鐘的遊戲時間——不包括最後對戰依裴利亞的 3 分鐘。 於是我們開始著手於調整遊戲前 6 分鐘的節奏。 多久給玩家一次升級選項？ 多早可以開始堆疊技能？ 每項技能應造成多少傷害，才能令人產生滿足感，但不至於過強？ ",
      "由於我們要分段調整遊戲體驗，所以專注於前 6 分鐘代表後 6 分鐘在那時候基本上是沒辦法玩的狀態。 我們讓大家測試遊戲的前 6 分鐘，然後請他們停下。 [b]嚴格來說[/b]還是可以繼續玩，但 6 分鐘後的所有內容都只是臨時的， 不應該讓人繼續玩下去 （實際上，我們還得懇求同事別再玩下去）。 ",
      "盡量將技能和升級做得好玩的一個有趣的副作用是，測試者通常不在乎一半的遊戲尚未完工。 我們會坐在同事的桌前，看著他們進行遊戲的前半部份。 接著 6 分鐘一到： ",
      "「很好，謝謝」我們說， 「可以請你重頭開始一遍嗎？」",
      "停頓了一下。 ",
      "「等一下，先不要，我覺得我可以打贏。」 ",
      "我們會提醒他們，最後 6 分鐘是一片極度不平衡、毫無一線生機的荒地，充滿複製貼上的敵人，目前無法通關。 他們會說他們了解。 我們會問問他們好玩和需要改進的地方在哪。 他們會針對前 6 分鐘的遊戲過程給我們許多絕佳的回饋。 我們再回到自己的辦公桌前，他們會看著我們離開，然後解除暫停，繼續破關。 ",
      "我們部份同事認為他們無法破完最後一段極端不公平、實際不可能戰勝的 6 分鐘，是對他們個人的否定。 因此，當我們在設計遊戲的前半部分時，他們一直在集中資源，全力挑戰堅不可摧的後半部分。 ",
      "事情是這樣：他們打贏了。 ",
      "最後，他們精確找出了我們尚未微調的超強技能組合，並通過了遊戲中本不可能通過的部分 （這讓各位了解很多遊戲設計是怎麼回事，又或許了解更多的是什麼樣的人會來做遊戲設計）。",
      "[h3]受控的混亂[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "在開發的尾聲，核心遊戲已經打造完成。 技能、小魔王遭遇事件以及與依裴利亞女王的最終對決都已經設計好。  在這個時候，我們不再尋找會破壞遊戲的問題，而是尋找調整、平衡與修飾的方式，將我們已知的可行部分做得更盡善盡美。 我們繼續進行遊戲測試，但測試後訪問不再追根究底，只讓測試者為了好玩而玩（當然也為了生成更多資料）。",
      "雖然每次執行遊戲所得到的量化資料十分重要，來自遊戲測試的質化資料也同樣重要。 舉個令人難忘的例子來說，有次遊戲測試迎來了史詩般的結局，悲慟骨堆（我們內部稱為「肉丸」）佔據了超過一半的畫面並吞噬了玩家。 此時，遊戲測試員背後還有一群同事正在看著，全都在嘲笑他的不幸。 想當然，他立刻按下了「再次遊玩」按鈕。",
      "我們有信心此時內容已值得推出，而遊戲測試的開放對象，也從自願參與測試的人，擴展到我們在公司裡能困住並說服參與測試的任何人。 在最早期的原型開發階段，我們晚上 11 點還會收到 Slack 訊息抱怨說「這遊戲太難了」。 到了這個階段，我們仍然會在晚上 11 點收到這種 Slack 訊息，但隨後又會在凌晨 3 點收到「沒事了，我打贏了」。 ",
      "即使遊戲大致上已經完成，到推出王冠之墮第四幕前夕，我們都還在努力開發[b]荊棘王座[/b]。 在本文開頭時，我們說如果有好的資料來支持想法，我們就能做出更好的決策。 好吧，現在我們有了一些資料：隨著內部遊戲測試者興奮地遊玩（並重複遊玩）遊戲，我們有一大堆資料來了解我們打造的哪些部分能引起共鳴。 能讓滿屋子的遊戲開發人員感到興奮的，莫過於遊戲開始變得有趣起來了。 只要塞得進去，我們就想做出更多現在已經知道有效果的東西。 新道具、技能、傳說甚至每波敵人——每次我們以為已經完成整個遊戲時，就一定會有人想到「再一個就好」的點子。 而且這些通常都是很不錯的點子，我們無法抵抗嘗試一下的誘惑。",
      "不只這些功能性的點子源源不絕；隨著推出時間越來越近，這些點子也越來越好。 在早期，當一切事物還較為模糊不確定時，我們很難分辨哪些功能可能遊玩價值比較高，哪些遊玩價值比較低。 但在距離推出時間只剩下一週時，我們該在哪裡投入資源和時間才能讓遊戲更好已經變得十分明顯了。",
      "[h3]離開王座[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "當我們完成[b]荊棘王座[/b]最後的修飾之後，終於能向後退一步，以全新的眼光來審視它。 挑戰在於要運用我們從先前幾幕所學的東西，來打造一個合適的史詩級大魔王之戰，好能圓滿結束這個巨型活動。 我們對於在有限時間內所完成的最終成品相當滿意。 我們找到好玩之處。",
      "很不幸的是，社群還沒找到。 我們沒考慮到的是，既然[b]荊棘王座[/b]是大魔王之戰，照道理來說大魔王應該住在……嗯，大魔王就應該在遊戲結尾之處等著。 這就是說我們要靜靜地煎熬至少一、兩天，等待 Dota 強力玩家們以非人的速度在第四幕挺進破關，等著看玩家終於有機會玩到這邊。 ",
      "結果我們不用等太久。 我們以為至少會需要一兩天，才有人能抵達依裴利亞女王的正殿。 顯然我們極度低估了 Dota 玩家破關斬將的速度有多快。 就在推出後的 16 小時內——沒錯，是[b]小時[/b]，首批強力玩家們就已經徹底打通最後一幕，並初嘗[b]荊棘王座[/b]的滋味。",
      "最終大家也都趕上進度了。 在撰寫此文之時，[b]荊棘王座[/b]已經達到將近一億次的遊玩次數 （如果您尚未追上進度，或只是想親自再玩一次，它仍在用戶端中的王冠之墮庫藏開放遊玩）。",
      "[h3]擁抱不確定[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "我們希望這次 Dota 團隊推出小遊戲的幕後花絮能讓您多了解一點我們的製作過程，而不只是讓您盯著這篇網誌文章，驚恐地發現原來我們根本是邊做邊想。 不過我們真的希望能證明遊戲設計不是某種秘術，由遊戲製作天才在暗室裡結些手印就變出來了。這是一個逐步改進的試誤過程，推動我們向前的是資料和焦慮和遊戲測試和失敗和遊戲測試，還有更多失敗和更多遊戲測試。",
      "遊戲開發是在逐步改進中茁壯成長，一開始的「完全沒概念」在檢視之前可行的想法之後，漸漸演變成「有點概念」。 接著做出一個很糟、沒人想玩的原型，但我們還是會強迫人來玩。 然後我們看著他們玩不怎麼好玩的原型，各回崗位去把不好玩的部分都修掉，直到我們看到他們覺得它玩起來很好玩。 接著我們把它打磨、再打磨，邊看著發行日曆邊流淚。 Valve 的精神一直都是擁抱不確定，並允許讓資料來形塑開發過程。 也就是說，我們不一定能每次都準時推出產品。 不過我們認為當產品準備好可以推出時，您會喜歡它們的。"
    ],
    "commentcount": 4,
    "tags": [],
    "language": 7,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091375,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}