{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Mezi linkami: Nest of Thorns",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mezi linkami: Nest of Thorns",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[i]Vítejte u dalšího příspěvku z rubriky Mezi linkami, v níž se s Vámi členové vývojářského týmu detailně podělí o nástrahy, problémy a občasné nehody s dobrým koncem, které jsou denním chlebem při práci na tak unikátní hře, jakou Dota 2 bezpochyby je.[/i]",
      "Masivní událost Pád moci nám dala příležitost experimentovat s celou řadou věcí – od map oblastí přes rozvětvené příběhové linky, nové pojetí žetonů, minihry, komiksy a pixel art až po další nápady, které jsme nosili v hlavě dlouhé roky.",
      "Co nám dodalo odvahu podstoupit s tím spojená rizika a čeho ve společnosti Valve využíváme dnes a denně, je volnost iterace: možnost posbírat data od skutečných hráčů, porovnat je s našimi předpoklady a třeba na jejich základě změnit názor. Často vlastně ani sami pořádně nechápeme, na čem pracujeme, dokud k tomu nepustíme hráče, a tak se do tohoto bodu snažíme dostat, co nejrychleji to jde.",
      "Tento přístup zároveň určuje, kdy činíme rozhodnutí – obvykle tak pozdě ve vývoji, jak je to možné, abychom k tomu měli nejlepší (a často jediná) data. Zároveň však platí, že na každém kroku spoléháme na zážitky hráčů a podle nich se zaměřujeme na to, co rezonuje, nebo naopak upouštíme od toho, co ne.",
      "V tomto příspěvku Vás tedy provedeme vývojem něčeho, co Pád moci rozšířilo až ke konci: minihra [i]Nest of Thorns[/i] zastávající ve čtvrtém aktu souboj s bossem, respektive souboj mezi našimi hrdiny a královnou Imperií. A když už jsme v tom, jedním šmahem to pojmeme jako případovou studii na téma toho, jak testování a jím generovaná data ovlivňují naše rozhodnutí.",
      "[h3]Cesta k Imperii[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "První a jedinou minihrou prvního aktu Pádu moci byla skromná rybářská hříčka, ve které Vám Tidehunter vrazil prut s nadějí, že mu ulovíte snídani. Ostatně celý první akt byl takový a po jeho mapě byly rozesety malé nápady, abychom zjistili, co hráče zaujme. A protože získaná data byla kladná, ve druhém aktu jsme šlápli na plyn a ve třetím vydali arkádovou bojovku [i]Sleet Fighter[/i] z Tuskovy oblíbené hospody U sťatý hlavy, [i]dračí šachy[/i] představující souboj myslí proti Winter Wyvern ve stylu her „spoj 3“ a Shoot 'Em Up [i]bitvu se Zaugem[/i], ve které Vengeful Spirit naháněla zlého draka skrze jeskyně Pomrzlých plání. ",
      "Když jsme dosáhli čtvrtého a posledního aktu, už jsme měli docela dobrou představu o tom, co funguje, a co ne. Vše bylo samozřejmě podloženo daty, a to jak těmi konkrétními (kolik hráčů hrálo kterou minihru opakovaně a kolikrát), tak těmi obtížněji zpracovatelnými, mezi něž se řadí uživatelská zpětná vazba a online diskuze. Zkrátka jsme měli důvěru v to, že se ve finále můžeme rozšoupnout a zvládneme nabídnout epický souboj s prohnanou královnou Imperií.",
      "Problém pochopitelně nastal při rozhodování o typu této minihry. Věděli jsme, že musíme nabídnout dramatickou podívanou, na kterou hráči čekají, ale zároveň musí být dostatečně různorodá a neohrát se po několika opakováních. A protože to pořád byla „jenom“ minihra určená pro vyplnění času při čekání na zápas, musela být krátká a intenzivní. Chutná svačina, ne tříchodová večeře, chcete-li.",
      "Abychom takového balancu dosáhli, potřebovali jsme žánr kombinující vysoké produkční hodnoty [i]Sleet Fighteru[/i] se znovuhratelností [i]dračích šachů[/i]. Přeci jenom, tohle měl být rozhodující souboj Vengeful Spirit, Skywrath Mage a nováčka Keze (alias naší „velké trojky“ příběhu Pádu moci) s nejzlejší možnou královnou Imperií, a chtěli jsme, aby si hráči na cestě k ní připadali jako tváří v tvář nepředstavitelné převaze.",
      "[h3]Hledání přeživších[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Jedním z nápadů, se kterými jsme krátce pracovali, byla tahová bitva ve stylu JRPG, nicméně trvalo sotva pár tahů, aby nám došlo, že tudy cesta nevede. Bylo nutné přijít s něčím, co hráče hodí přímo do akce. S něčím krátkým, intenzivním a zábavným pro hraní mezi běžnými zápasy Doty.",
      "Když tu nás to trklo: co takhle použít relativně nový žánr „survivor“ her? Frenetická střílečka z druhé strany (tzn. na nepřátele střílíte víc Vy, než oni na Vás) s nekonečnými vlnami nepřátel by mohla být ideálním základem pro epický souboj s bossem, kdy si hráč musí prosekat cestu skrze hordy soupeřů a s lehkým zapojením taktiky vylepšit své schopnosti před finálním setkáním s Imperií. Co víc, na tento koncept by šlo snadno navěsit stávající schopnosti a předměty, takže hráči by přibližně věděli, co a jak funguje.",
      "A znovuhratelnost, které jsme v souladu s požadavkem na krátký zážitek chtěli dosáhnout? Tu žánr frenetických přežívaček (jak mu interně říkáme) řešil také, jelikož žádné opakování v něm není stejné a hráči nemají zaručeno, že dostanou předměty, které chtějí, nebo že se události vyvinou v pořadí, v jakém očekávali. Tato variabilita nutí zkoušet to znovu, sice vždy od nuly a s vidinou obtížnosti, ale na druhou stranu nikdy není nepřekonatelná nebo frustrující. Takže na první pokus hráč nejspíš nevyhraje. Ale neodradí ho to hrát dál. ",
      "[h3]Prototypy prototypů[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Nejstarší prototypy minihry [i]Nest of Thorns[/i] nabízely stejné klíčové prvky, které se zachovaly do finální verze. Hráč si vybral jednoho ze tří hrdinů, postavil se vlnám nepřátel a eventuálně se probojoval až k Imperii. Co tyto prototypy nenabízely, byla zábava. Někdy se totiž hrdina toulal po převážně prázdné mapě a jen občas narazil na osamoceného kostlivce. Jindy byly zase vlny nepřátel natolik drtivé, že nebylo možné vyhrát (resp. aspoň jsme si to mysleli). Ta zábava tam tedy podle nás někde byla, akorát bylo potřeba mučit testery tak dlouho, dokud ji neobjevíme.",
      "Víte, každý zaměstnanec společnosti Valve je laboratorní krysa a to, že někoho posadíme před rozpracovaný build, je způsob, jak zjistit, jestli to funguje, nebo to naopak stojí za pendrek. Přemýšlet jde donekonečna, ale dokud to někomu nedáme zahrát, nemůžeme vědět, jestli jsme udělali správná rozhodnutí.",
      "V tomto případě měli testeři zprvu problém přežít prvních tři až šest minut, což je obvykle známka toho, že hra buď není vybalancovaná, nebo nezvládá vhodně vysvětlit svá pravidla. S testery jsme si proto sedli a požádali je, aby nám popsali svůj zážitek – momenty, kdy si nebyli jisti, co dělat dál, kdy se jim hra začala zdát nemožná nebo kdy se jednoduše začali nudit. Potom jsme se vrátili ke svým počítačům, provedli na základě dat pár změn a nový build dali jiným testerům. Postup byl pomalý, ale byl tam.",
      "Až do jednoho okamžiku.",
      "Poté, co nám tester, který právě prohrál, popsal svůj zážitek, přidal také svoji otázku: „Heleďte, nemohl bych to zkusit znovu?“",
      "To bylo nečekané a povzbuzující. Minihra měla stále daleko k tomu být kvalitní a testerům obvykle trvalo nejméně tři pokusy, než přišli na to, jak pokořit náš prototyp, ale bylo hezké, že jsme už svoje kolegy nenutili hrát otřesný prototyp – oni sami náš otřesný prototyp chtěli hrát!  A věřte, že i taková malá jiskra zájmu v raných fázích vývoje opravdu potěší.",
      "Na skutečný průlom jsme si však museli počkat o něco déle...",
      "[h3]Změna přístupu[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Jednou z hlavních vlastností frenetických přežívaček, kterou naše rané prototypy postrádaly, byl neustálý tlak. Na mapě se zčistajasna objevila stovka kostlivců a hrdina měl za úkol je pobít. Když se mu to podařilo a žádný kostlivec nezbyl, objevila se další vlna silnějších nepřátel. Testery to hodně rychle omrzelo, protože jak si uvědomili, že cílem bylo jenom nekonečné zabíjení nepřátel, z hraní se stala otrava. A už vůbec nepomohlo, že jedinou odměnou za efektivnější zabíjení nepřátel byl rychlejší přístup k silnějším nepřátelům. Zkrátka nuda.",
      "Jako řešení nás napadlo, že jakmile se objeví první stovka kostlivců a hráč je začne rubat, této vlně se spustí odpočet, který po dosažení nuly nechá objevit silnější nepřátele s vlastním odpočtem, a hráč tak bude neustále pod tlakem. ",
      "Co je ale důležitější, změnili jsme [i]cíle[/i]. Když totiž Váš hrdina jenom mlátí klesající počty kostlivců, cílem je pochopitelně dostat populaci kostlivců na nulu. Když však počet kostlivců nikdy neklesne, [i]nezávisle na tom, kolik jich zabijete,[/i] velmi rychle si uvědomíte, že zabíjení není cíl, za kterým byste se měli hnát. ",
      "Ne, namísto toho se logicky zaměříte na to, co za zabíjení všech těch kostlivců [i]dostanete[/i] – v tomto případě schopnosti a předměty – a cíl se změní ze „zabít všechny kostlivce“ na „zabít co nejrychleji co nejvíc kostlivců, abych co nejvíc [i]posílil[/i] svého hrdinu“. Voilà, mydlení vln nepřátel se z otravy změnilo v honbu za jackpotem, kdy Vás každé zabití o krůček přiblížilo k vytouženému buildu. ",
      "A protože přechod na další vlnu už nebyl spojený s kompletním vyvražděním té předchozí, dosáhli jsme ještě něčeho nového: sdíleného pojmu o čase. To možná zní zvláštně, ale ve skutečnosti tím myslíme prostý fakt, že minihra začala mít pro všechny stejný postup obtížnosti, a když jeden hráč přišel s tím, že „nemůže vystát tu vlnu pavouků ve čtvrté minutě“, všichni okamžitě pochopili, co tím myslí (a všichni s ním souhlasili).",
      "Zdánlivě malá změna hratelnosti tedy pomohla určit, co a proč hráče baví, a rázem se spustil vodopád nápadů poháněný čerstvě objevenou zábavou – ještě silnější předměty, šílenější schopnosti a možnosti buildů, o kterých se nám ani nezdálo. Testeři mohli najednou směřovat své hrdiny radikálně odlišnými směry, testování je více bavilo a my dostávali lepší zpětnou vazbu pro další verze.",
      "Nutno ale podotknout, že tuto zpětnou vazbu jsme z nich museli dolovat, protože kolegové s námi mnohdy po testování nechtěli mluvit o svém zážitku a místo toho s ostatními kolegy řešili své buildy a dohadovali se, kdo měl lepší. ",
      "A jak rostla různorodost buildů, došlo nám, jestli nepřehlížíme něco zásadního. Co kdyby sami hrdinové byli také rozdílní? V raných prototypech měnil výběr hrdiny jenom výchozí schopnost, ale co kdyby byl jeden silnější, druhý rychlejší a třetí například udílel vyšší magické poškození? Různorodost buildů dostala další úroveň a výběr hrdiny začal předurčovat směr, jakým se hráč vydá při vybírání dalších schopností, což ve spojení s jejich relativně náhodným nabízením ještě navýšilo pomyslné sázky a touhu hrát znovu a lépe. ",
      "[h3]Prvních šest minut[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "No a zatímco jsou hráči zaneprázdněni přemýšlením o tom, které schopnosti si chtějí dát do výbavy, my zvyšujeme obtížnost. Polehoučku a potichoučku, až do bodu, kdy si toho hráči všimnou a uvědomí si, že nepřátelé nějak víc bolí, je jich strašně moc a zdraví hrdiny je v červených číslech. ",
      "Respektive tohohle stavu jsme chtěli dosáhnout. Když jsme totiž rozlouskli problém s vylepšováním, přesunuli jsme se na tempo hratelnosti. Jak už jsme říkali, chtěli jsme, aby byl zážitek intenzivní a tak akorát dlouhý, jelikož většina hráčů se minihrám věnovala při čekání na zápas. Na druhou stranu jsme však potřebovali dosáhnout jistého vyvážení této intenzity a dát hráčům prostor kochat se výsledky svých (většinou správných) rozhodnutí.",
      "Hrubým výpočtem jsme tehdy při vývoji došli k tomu, že bez započtení tříminutového boje s Imperií zabere minihra přibližně dvanáct minut, a naše další kroky tak směřovaly na ladění prvních šesti minut hraní. Jak často by měl hráč dostávat nový předmět/vylepšení? Jak brzy by měl dostat možnost kombinovat schopnosti? Jaké poškození by jednotlivé schopnosti měly udílet, aby byly uspokojivé, ale ne přehnaně silné? ",
      "Naše aktuální zaměření na prvních šest minut nicméně logicky znamenalo, že zbylých šest minut bylo v této fázi prakticky nehratelných. Testery jsme nechávali hrát šest minut a následně je zastavili. [i]Technicky vzato[/i] mohli hrát dál, ale nic po šesté minutě nebylo dokončené. Nikdo to neměl vidět a kolegy jsme snažně prosili, aby přestali hrát. ",
      "Jenže vedlejším efektem toho, jak jsme dříve udělali schopnosti a předměty zábavnými, se ukázalo být, že některým testerům nevadilo, že druhá polovina minihry je nehratelná. Seděli jsme tedy nějakému kolegovi za zády a sledovali, jak hraje prvních šest minut. Když se dostal „do konce“, řekli jsme: ",
      "„Paráda, děkujeme. Můžeš to teď restartovat?“",
      "Pomlka. ",
      "„Počkejte, myslím, že to zvládnu vyhrát.“ ",
      "Tak jsme mu připomněli, že zbylých šest minut je nevybalancované peklo namnožených nepřátel a momentálně to nejde vyhrát. Kolega nám to odkýval, probrali jsme s ním jeho zážitky, on nám dal hromadu užitečné zpětné vazby a my zase odešli ke svým stolům. A co myslíte, že se dělo dál? Jak jsme se vzdálili, stejný kolega skočil zpátky do hry a pokusil se ji vyhrát! ",
      "Někteří kolegové to dokonce považovali za otázku cti a štvalo je, že se nedokáží probojovat skrze neférových a papírově nemožných šest minut, takže zatímco my pracovali na první polovině minihry, oni ztráceli čas mlácením hlavou do zdi – hraním druhé poloviny. ",
      "Jenže teď přijde ten vtip: nakonec se jim to povedlo. ",
      "Po nějaké době někteří z nich vykoumali přesnou kombinaci schopností, které jsme ještě neměli čas vybalancovat, a pokořili část hry, která neměla být pokořitelná. Akorát upřímně nevíme, jestli to vypovídá víc o vývoji her, nebo o tom, jaký typ lidí se kolem vývoje her primárně točí.",
      "[h3]Kontrolovaný chaos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Ke konci vývoje jsme měli hotové jádro minihry. Schopnosti, minibossové a finální setkání s královnou Imperií bylo připraveno.  V tuhle chvíli jsme už nehledali závažné problémy, ale spíš cesty, jak upravit, vybalancovat a vylepšit, co už jsme zjistili, že funguje. Testování tedy pokračovalo, jen jsme omezili zevrubné rozhovory po hraní a nechávali testery hrát primárně pro zábavu (a pochopitelně pro generování dalších dat).",
      "A přestože kvantitativní data z jednotlivých opakování (průběhů minihrou) byla důležitá, nemohli jsme přehlížet ani data kvalitativní. Jedno nezapomenutelné testování například skončilo tím, že miniboss zvaný „Skučící masa“ zabíral polovinu obrazovky. Tester neměl šanci ho zabít a narychlo vytvořený hlouček kolegů se smál jeho neštěstí, ale jak jistě tušíte, stejně následoval restart a tester hrál vesele dál.",
      "I případy jako tento nám potvrdily, že máme v rukách něco, co stojí za vydání, a proto jsme seznam testerů rozšířili z kolegů, kteří se nabídli, na víceméně každého, koho jsme potkali a přemluvili k vyzkoušení. Plus, a to je důležité, v této fázi se změnily zprávy, které jsme dostávali na Slacku. Z půlnočního výkřiku „Ta hra je moc těžká“ se stal půlnoční výkřik „Ta hra je moc těžká“ následovaný o tři hodiny později zprávou „Beru zpět, vyhrál jsem“. ",
      "Skončila nám tím práce? Ani zdaleka a na [i]Nest of Thorns[/i] jsme dělali až do dne vydání čtvrtého aktu Pádu moci. Jak jsme totiž zmínili na začátku tohoto příspěvku, lepší rozhodnutí činíme, když je máme podpořená daty. A těch jsme ke konci měli habaděj, jelikož interní testeři urputně hráli, aniž bychom je do toho museli nutit, což je pro vývojáře ta největší možná vzpruha. Nálada byla taková, že jsme chtěli přidávat další fungující věci a přidat jich, co nejvíc to půjde. Nové předměty, schopnosti, dialogy, dokonce i vlny nepřátel. Vždy když už jsme si mysleli, že „máme hotovo“, nevyhnutelně někdo přišel s dalším nápadem, který byl natolik dobrý, že jsme mu neodolali.",
      "Co víc, nápady nejenže neubývaly, ale čím blíž jsme byli k vydání, tím byly lepší! Zatímco v raných fázích minihra takříkajíc postrádala tvar a bylo těžké rozlišit mezi potenciálně kvalitními a potenciálně zbytečnými funkcemi, týden před vydáním jsme naprosto přesně věděli, co je dobré a na co se zaměřit.",
      "[h3]Královna je mrtvá, ať žije královna[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Teprve když jsme minihru veřejně vydali, dostali jsme možnost si ji pořádně prohlédnout a zhodnotit naši snahu. Podařilo se nám vzít poznatky, které jsme získali z předchozích aktů, a vystavět na nich epický souboj s bossem uzavírající několikaměsíční událost? Podle nás ano, obzvlášť při započtení toho, jak málo času jsme na to měli. A podařilo se nám objevit zábavu? Nepochybně.",
      "To ale bylo jenom naše zhodnocení. Na to od skutečných hráčů jsme si museli počkat, protože [i]Nest of Thorns[/i] je minihra o souboji s bossem... a takový boss logicky čeká až na konci hry. Takže aby se k němu hráči dostali, museli nejprve projít celým čtvrtým aktem, což podle našich předpokladů mělo zabrat alespoň den, reálně déle. ",
      "Pro nás hodiny mučivého ticha a čekání na verdikt těch nejpovolanějších. Naštěstí se ukázalo, že jsme komunitu výrazně podcenili, a první sprinteři (jinak jim ani říkat nejde) dosáhli trůnního sálu královny Imperie za pouhých [i]šestnáct hodin[/i] od vydání! Ani jeden celý den!",
      "Ostatním hráčům to pak trvalo trochu déle, ale nakonec i oni vyzvali královnu na souboj a ke dnešnímu dni zaznamenala minihra [i]Nest of Thorns[/i] téměř sto milionů zahrání/opakování. Pokud jste ji ještě nezkusili, nebo Vás tohle vzpomínání vyhecovalo k ještě jedné královnovraždě, přímo v Dotě je stále k dispozici archiv Pádu moci.",
      "[h3]Risk je zisk[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Snad Vám tento „pohled pod pokličku“ poskytl lepší představu o tom, jak u nás funguje vývoj, a neodnesete si z něj jen šok, že vlastně všechno děláme za pochodu... Ale teď vážně: herní vývoj není nějaké mystické umění známé pouze géniům zavřeným v tmavých místnostech. Je to iterativní proces „pokus-omyl“ řízený daty, testováním, selháním, dalším testováním, dalším selháním a zas a znovu testováním.",
      "Ještě jinak. Alespoň u nás herní vývoj stojí na iteraci, a co začne jako „žádný nápad“, se pohledem na funkční části pomalu změní v „nějaký nápad“. A pak se to změní ve špatný prototyp, který nikdo nechce hrát, ale my je stejně donutíme. A pak sledujeme, jak je to nebaví hrát, postupně opravujeme, co nám nahlásí, a takhle pořád dokola, až je to nakonec začne bavit hrát. A pak to vylepšujeme, ladíme a pláčeme při pohledu do kalendáře. Protože filozofie společnosti Valve vždy byla podstupovat rizika a nechat data řídit vývoj. Ano, možná kvůli tomu sem tam něco nevydáme včas, ale zato věříme, že až to vydáme, bude se Vám to líbit."
    ],
    "commentcount": 4,
    "tags": [],
    "language": 19,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091375,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}