{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Din spatele culoarelor: Cuibarul Ghimpilor",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Din spatele culoarelor: Cuibarul Ghimpilor",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]Bine ai revenit la rubrica „Din spatele culoarelor” din cadrul blogului nostru, unde echipa noastră de dezvoltare prezintă unele dintre provocările, remedierile de erori și ocazionalele accidente fericite pe care le-am întâmpinat în timp ce lucram la un joc atât de unic precum Dota.[/i]",
      "Căderea Coroanei a reprezentat pentru noi oportunitatea de a experimenta o mulțime de lucruri: hărți de campanie, povești ramificate, jetoane tematice cu eroi, minijocuri, benzi desenate, ilustrații pixelate și alte idei pe care ne doream să le explorăm de ani întregi.",
      "Ceea ce ne-a conferit încrederea necesară pentru a ne asuma aceste riscuri a fost libertatea de a utiliza o abordare iterativă, lucru pe care îl facem constant la Valve: să obținem date de la jucători reali, să comparăm aceste date cu așteptările noastre și chiar să ne răzgândim. Adeseori ne spunem că nu înțelegem în totalitate ce concepem până când jucătorii nu ajung să interacționeze cu acel ceva, așa că încercăm să ajungem cât mai rapid posibil în acel punct.",
      "Această mentalitate influențează și momentul în care luăm decizii: de obicei, cât mai târziu posibil în procesul de dezvoltare, atunci când avem cele mai concludente (și uneori singurele) date. În fiecare etapă, ne bazăm pe experiențele unor jucători reali pentru a ne concentra pe aspectele atractive și a renunța la cele neatractive.",
      "În acest articol din rubrica [i]Din spatele culoarelor[/i] vom aborda procesul de dezvoltare a unui minijoc care și-a făcut apariția relativ târziu pe durata evenimentului Căderea Coroanei: bătălia din actul IV dintre eroii noștri și Regina Imperia, un minijoc cu lupte cu boși care a fost intitulat [i]Cuibarul Ghimpilor[/i]. De asemenea, acest minijoc va servi și ca studiu de caz pentru a prezenta modul în care sesiunile de playtest și datele pe care le generează acestea contribuie la luarea deciziilor.",
      "[h3]Calea spre Imperia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Primul (și singurul) minijoc din actul I a fost un minijoc modest de pescuit în care Tidehunter îți punea la încercare aptitudinile de pescar, sperând că vei reuși să prinzi ceva pentru mic-dejunul său. O bună parte din actul I a fost compus din mici idei pe care le-am împrăștiat pe hartă pentru a vedea ce va stârni interesul jucătorilor. Datele promițătoare obținute de la jucători din actul I ne-au conferit încrederea de a deveni mai aventuroși în actul II, iar în actul III chiar am lansat [i]Sleet Fighter[/i], un minijoc cu lupte care se desfășura în taverna preferată a lui Tusk; [i]Șahul dragonilor[/i], o confruntare cu Winter Wyvern în care trebuie să potrivești nestemate; [i]Bârlogul lui Zaug[/i], un minijoc shoot 'em up în care trebuie să înfrunți cu Vengeful Spirit un dragon malefic prin tunelurile subterane întortocheate ale Ținuturilor Înghețate. ",
      "Odată ce am ajuns la actul IV, știam cu siguranță ce ne doream. Însă ce date aveam? Totul, de la date concrete, precum numărul de jucători care au rejucat fiecare minijoc și cât de des au făcut acest lucru, până la date ce pot fi interpretate, precum feedbackul transmis de utilizatori și discuțiile din mediul online. Claritatea oferită de aceste informații ne-a dat încrederea să mizăm totul pe o confruntare finală epică, o confruntare împotriva maleficei Regine Imperia.",
      "Desigur, luarea unei decizii privind tipul de minijoc nu a fost una ușoară. Știam că așteptările jucătorilor erau mari și trebuia să oferim un spectacol grandios. Însă minijocul trebuia să ofere suficientă varietate și un grad de rejucabilitate pentru a rămâne distractiv și după un anumit număr de rejucări. Și, pentru că era totuși vorba despre un minijoc care era conceput pentru a fi jucat în timp ce aștepți să găsești un meci, acesta trebuia să fie intens, dar scurt. Trebuia să fie ca o gustare savuroasă, și nu ca o masă principală.",
      "Pentru a găsi echilibrul perfect, aveam nevoie de ceva care să combine calitatea unui minijoc precum [i]Sleet Fighter[/i] și nivelul de rejucabilitate oferit de [i]Șahul dragonilor[/i]. La urma urmei, aceasta avea să fie confruntarea epică dintre Vengeful Spirit, Skywrath Mage, nou-venitul Kez (cele trei personaje principale ale actului IV din Căderea Coroanei) și Regina Imperia, chiar în castelul ei. Ne-am dorit ca jucătorul să trăiască sentimentul că se află într-o misiune imposibilă de a ajunge la Regina Imperia.",
      "[h3]Elaborarea unui plan[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Un tip de confruntare care ne-a atras atenția pentru scurt timp a fost o luptă de tip JRPG bazată pe ture. Dar nu ne-a luat mult să realizăm că nu era ceva tocmai potrivit. Aveam nevoie de ceva care să-i arunce pe jucători în mijlocul acțiunii, ceva care să fie scurt, intens și suficient de distractiv de jucat cât timp cauți un meci de Dota.",
      "Acesta a fost momentul în care genul jocurilor de supraviețuire a intrat în scenă. Un minijoc „opus jocurilor bullet hell” cu valuri nesfârșite de inamici, perfect pentru o luptă cu boși epică și cu mize mari. Jucătorul era nevoit să își croiască drum prin hoardele de inamici și să găsească o strategie de a-și îmbunătăți diverse abilități pentru a se pregăti pentru confruntarea finală cu Imperia. Avea să fie ușor pentru noi să încorporăm abilități și obiecte deja existente din Dota, astfel încât jucătorii să fie cât de cât familiari cu mecanicile.",
      "Deoarece ne doream ca experiența să fie una relativ scurtă, rejucabilitatea reprezenta o altă piesă importantă din puzzle-ul nostru. Genul jocurilor de supraviețuire ne-a pus la dispoziție destulă varietate, deoarece acesta nu oferă niciodată aceeași experiență de două ori. Jucătorii nu știu niciodată ce obiecte urmează să primească sau ce evenimente urmează să aibă loc, deoarece nu există o ordine exactă. Această variabilitate te motivează să încerci din nou și din nou, pornind întotdeauna de la zero într-o provocare care nu este insurmontabilă sau frustrantă. Nu intenționam neapărat ca jucătorul să câștige din prima încercare și ne doream ca acesta să reia jocul atunci când pierdea. ",
      "[h3]Primele prototipuri[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Primele prototipuri ale minijocului [i]Cuibarul Ghimpilor[/i] au pornit de la aceleași elemente de bază care aveau să fie prezente și în versiunea finală. Jucătorul era nevoit să aleagă unul dintre cei trei eroi, apoi să se confrunte cu numeroase valuri de inamici și, într-un final, să o înfrunte pe Imperia. Ce le-a lipsit acestor prototipuri de la început era faptul că nu erau deloc distractive. În unele cazuri, eroul rătăcea pe o hartă aproape goală, dând ocazional de câte un schelet. Alteori inamicii erau atât de numeroși încât era practic imposibil să câștigi (sau așa presupuneam; mai multe detalii despre asta mai târziu). Știam că elementele distractive aveau să urmeze. Trebuia doar să continuăm să ne torturăm playtesterii cu versiuni nereușite până ce aveam să o găsim pe cea potrivită.",
      "Fiecare angajat de la Valve este un cobai, iar modul prin care putem evalua dacă ceva este bun (sau, cel mai adesea, [i]nu este[/i] bun) este să-i oferim cobaiului o versiune pe care să o încerce. Putem veni cu o mulțime de idei, însă nu avem cum să știm dacă deciziile pe care le luăm sunt cu adevărat potrivite până când cineva nu le pune la încercare.",
      "La început, playtesterii supraviețuiau cu greu în primele 3-6 minute. De obicei, acesta este un semn că jocul este fie dezechilibrat, fie nu explică suficient de bine regulile sale. După o sesiune de playtest, îi rugam pe participanți să ne descrie experiența lor: momentele în care erau confuzi sau care îi puneau atât de mult în dificultate încât li se părea imposibil să progreseze, sau momentele care-i plictiseau. Apoi ne reapucam de muncă pentru a face câteva modificări și rugam un nou playtester să încerce minijocul. Încetul cu încetul am început să progresăm.",
      "În cele din urmă, ceva s-a întâmplat.",
      "După ce un playtester ne-a descris prima sa experiență cu prototipul, acesta ne-a întrebat dacă îl poate încerca din nou.",
      "A fost o reacție nouă și încurajatoare pentru noi. Cuibarul Ghimpilor nu se afla nici pe departe într-un stadiu ideal, iar participanții aveau nevoie de cel puțin trei încercări pentru a afla cum pot câștiga, însă era un sentiment plăcut, deoarece nu ne mai aflam în punctul în care ne rugam de colegi să încerce prototipul nostru nereușit, ci aceștia chiar ne cereau să îl încerce pentru a doua oară.  A fost o mică licărire de interes: „Chiar nu e rău.” Această remarcă a fost îmbucurătoare.",
      "Însă avea să mai dureze puțin până când aveam să rostim „Evrica!”.",
      "[h3]Configurații pentru eroi[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Unul dintre principalele elemente specifice jocurilor de supraviețuire care lipsea din primele noastre prototipuri era presiunea constantă. Inițial, pur și simplu cream un val de o sută de schelete în cadrul nivelului și-l lăsam pe erou să-și facă treaba. Odată ce acesta răpunea toate scheletele, cream următorul val de inamici cu o dificultate mai ridicată. Playtesterii se plictiseau însă repede. De îndată ce își dădeau seama că singurul obiectiv era să elimine inamicii, jocul începea să se transforme într-o rutină. Singura satisfacție pe care o aveai dacă reușeai să scapi într-un mod cât mai eficace de inamici era faptul că reușeai să treci mai rapid la următorul val de o dificultate mai ridicată. (Ura?)",
      "Ne-am dat seama în cele din urmă că, atunci când cream o sută de schelete și eroul începea să-i elimine, aveam nevoie de o numărătoare inversă și de înlocuirea scheletelor eliminate, indiferent de cât de multe schelete era vorba. Odată ce numărătoarea inversă ajungea la zero, cream un nou val de inamici mai dificili și începeam o nouă numărătoare inversă. Acum presiunea era constantă, iar jucătorul era cu adevărat captivat. ",
      "Dar, mai important, [i]obiectivele[/i] jucătorilor s-au schimbat. Când eroul ajungea să măcelărească un număr tot mai mic de schelete, obiectivul era acela de „a reduce numărul de schelete la zero”. Însă, dacă numărul de schelete [i]nu ar scădea niciodată indiferent de cât de multe ai elimina[/i], atunci jucătorilor nu le-ar lua mult timp să realizeze că nu acesta este de fapt obiectivul. ",
      "În schimb, aceștia și-au îndreptat atenția asupra a ceea ce [i]obțineau[/i] atunci când răpuneau aceste schelete, în acest caz fiind vorba despre abilități și îmbunătățiri. Dintr-o dată, obiectivul nu mai era acela de „a anihila scheletele”, ci „câți inamici pot ucide cât mai repede cu putință pentru a deveni cât mai [i]puternic[/i]?” În loc să pară o rutină, anihilarea valurilor de inamici începea să fie percepută precum încercarea de a obține un jackpot, fiecare ucidere reprezentând un pas înainte către configurația perfectă. ",
      "Deoarece trecerea la următorul val nu mai necesita uciderea tuturor inamicilor din ultimul val, am ajuns să avem ceva nou: un cronometru comun. Asta însemna că jucătorii progresau acum în același ritm, oferind o definiție uniformă privind momentele în care lucrurile vor începe să devină mai dificile. Așadar, atunci când un jucător spunea „Nu pot rezista valului de păianjeni de la minutul patru”, cu toții știau despre ce era vorba (păianjenii aceia sunt oribili).",
      "În cele din urmă a apărut și distracția. Această mică schimbare de abordare ne-a ajutat să identificăm ce stârnește interesul jucătorilor și motivele din spate, fapt ce a dat naștere unei noi serii de idei: îmbunătățiri mai puternice, abilități mai nebunești și configurații la care nici nu ne-am fi gândit. Astfel, jucătorii puteau crea configurații pentru eroi complet diferite în decursul unei singure sesiuni de joc. Iar asta a însemnat că erau și mai implicați în timpul sesiunilor de playtest, oferindu-ne feedback și sugestii pentru următoarele versiuni.",
      "Asta dacă le ceream părerea de mai multe ori. După un playtest, colegii noștri nu mai voiau uneori să discute aspectele pozitive și negative cu noi. Cu toții doreau să vorbească între ei despre propriile configurații și să dezbată care dintre ele este mai bună. ",
      "Pe măsură ce varietatea de configurații continua să crească, am început să ne întrebăm dacă nu cumva ne lipsește ceva important: cum ar fi ca eroii înșiși să fie la fel de unici precum abilitățile? În primele prototipuri, pe lângă abilitatea de început, experiența jucătorilor era în mare parte identică, indiferent de eroul ales. Acum le modificam pentru a le transforma în niște opțiuni cu adevărat unice: una mai puternică, alta mai rapidă, alta mai potrivită pentru daune magice. Acest fapt a contribuit și mai mult la variabilitatea configurațiilor. Alegerea unui erou în detrimentul altuia presupunea, de asemenea, descoperirea unor noi seturi de abilități care ar fi putut fi altfel imposibil de obținut. (Și, pentru că întotdeauna există și un strop de noroc în ceea ce privește îmbunătățirile pe care le poți obține, fiecare alegere părea una cu adevărat importantă.)",
      "[h3]Primele șase minute[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "În timp ce ești ocupat să descoperi ce alegeri te vor ajuta să ajungi la Imperia, dificultatea crește progresiv. La un moment, fără să realizezi, valurile de inamici devin mortale, ritmul este tot mai rapid și abia că mai poți rămâne pe linia de plutire. ",
      "Cel puțin, acesta era obiectivul. După ce am implementat îmbunătățirile, ne-am concentrat asupra ritmului jocului. Ne doream ca experiența să fie una intensă, dar nu foarte lungă. (Știam că majoritatea jucătorilor aveau să joace minijocul în timp ce așteptau să găsească un meci.) Pe de altă parte, totuși, ne-am dorit să le oferim jucătorilor suficient timp pentru a se bucura de configurațiile realizate.",
      "După calculele noastre, ar fi trebuit să avem în total douăsprezece minute de joc, asta pe lângă lupta finală de trei minute cu Imperia. Așadar, ne-am apucat să definim ritmul pentru primele șase minute. Cât de des ar trebui să-i oferim jucătorului o îmbunătățire? Cât de devreme ar trebui acesta să poată acumula abilități? Câte daune ar trebui să cauzeze fiecare abilitate astfel încât să fie satisfăcătoare, dar nu excesiv de puternică? ",
      "Deoarece modificam minijocul pe secțiuni și ne concentram asupra primelor șase minute, ultimele șase minute erau în esență de nejucat în acel moment. Lăsam oamenii să încerce primele șase minute de joc, iar apoi încetam sesiunea. [i]Tehnic[/i] vorbind, ar fi putut continua jocul, dar tot ce urma după minutul șase era neterminat. Așa că nu avea sens să continui să-l joci. (De fapt, i-am implorat pe colegii noștri să nu o facă.) ",
      "O consecință amuzantă a faptului că abilitățile și îmbunătățirile erau atât de distractive a fost că playtesterilor nu le păsa că jumătate din minijoc nu era încă gata. Așadar, ajungeam să ne așezăm lângă un coleg de muncă și să urmărim cum joacă prima jumătate. Apoi, după ce treceau șase minute, îi spuneam: ",
      "„Super, mulțumim!” „Poți începe jocul de la început?”",
      "Apoi urma o pauză. ",
      "„De fapt, stați puțin, cred că pot câștiga.” ",
      "Apoi îi reaminteam că ultimele șase minute erau un vest sălbatic înțesat cu inamici pe care i-am copiat și că acea secțiune e imposibilă de parcurs. În acel moment ne comunica faptul că înțelege situația, iar apoi noi îl intervievam cu privire la aspectele pozitive și negative. Acesta ne oferea suficient feedback cu privire la primele șase minute experimentate. În cele din urmă, ne întorceam la birourile noastre, iar colegul ne urmărea cu privirea, ca mai apoi să reia jocul pentru a-l termina. ",
      "Unii dintre colegii noștri au perceput ca pe o ofensă personală faptul că nu puteau trece de ultimele șase minute care erau extrem de dificile și literalmente imposibil de parcurs. Așadar, în timp ce noi lucram la prima jumătate a jocului, aceștia își concentrau toate eforturile să termine de parcurs cea de-a doua jumătate. ",
      "Și ghici ce: au reușit. ",
      "Au găsit în cele din urmă o combinație precisă de abilități superputernice pe care nu le reglasem încă și au reușit să parcurgă acea jumătate a jocului care nu era menită să fie parcursă. (Asta spune multe despre designul jocului sau poate chiar mai multe despre cei care ajung să lucreze ca designeri de jocuri.)",
      "[h3]Haos controlat[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "La sfârșitul dezvoltării, jocul de bază era gata. Abilitățile, luptele cu miniboși și confruntarea finală cu Regina Imperia erau toate gata.  În acest moment, nu mai căutam defecte serioase, ci modalități de a regla, echilibra și îmbunătăți ceea ce aveam deja. Am continuat să realizăm sesiuni de playtest, dar am revenit la interviurile complexe, post-mortem, și le-am permis oamenilor să joace de plăcere (și, desigur, pentru a genera mai multe date).",
      "Chiar dacă datele provenite din fiecare sesiune erau destul de importante, datele calitative provenite din sesiunile de playtest nu erau cu mai puțin importante. Într-un exemplu memorabil, o sesiune de playtest s-a încheiat într-un mod epic cu minibossul „Masa lamentară”, care la nivel intern era denumit „Chifteaua”, care a ajuns să acapareze jumătate din ecran și să devoreze jucătorul. În acest moment, playtesterul ajunsese să fie înconjurat de colegi care-l urmăreau din spate și râdeau de ghinionul său. Desigur că în acel moment a apăsat imediat butonul „Joacă din nou”.",
      "Eram convinși că aveam un minijoc demn de lansare și am început să oferim minijocul pentru playtest nu doar celor care s-au oferit voluntari anterior, ci și tuturor colegilor din companie cu care ne intersectam. Primele noastre prototipuri erau întâmpinate cu mesaje pe Slack la ora 23:00 care menționau: „Jocul e mult prea dificil”. În această etapă, continuam să primim aceste mesaje pe Slack la ora 23:00, însă mai apoi erau urmate de mesaje la ora 3:00 care sunau cam așa: „Uitați ce am spus, am câștigat”. ",
      "Chiar și cu un minijoc în mare parte terminat, am continuat să lucrăm la [i]Cuibarul Ghimpilor[/i] până la lansarea actului IV din Căderea Coroanei. La începutul acestei postări, am spus că putem lua decizii mai bune atunci când avem date de calitate care să le susțină. Ei bine, în acest moment aveam câteva: mulțumită echipei interne de playtesteri care se distra jucând (și rejucând) minijocul, aveam o mulțime de date pentru a ști ce stârnește interesul. Și nimic nu entuziasmează o cameră plină de dezvoltatori de jocuri mai mult decât momentul în care jocul începe să fie distractiv. Ne doream să implementăm cât mai multe elemente despre care știam acum că funcționau. Noi obiecte, abilități, povești și chiar valuri. De fiecare dată când credeam că am implementat tot ce ne doream, tot mai apărea cineva cu încă o „ultimă idee”. Și, pentru că adesea era o idee genială, nu puteam rezista să nu o încercăm.",
      "Nu doar că ideile noi continuau să apară, ci începeau să devină mai pertinente pe măsură ce ne apropiam de lansare. La început, când minijocul nu era bine definit, ne era greu să distingem dacă o caracteristică prezenta sau nu un potențial semnificativ. Cu o săptămână înainte de lansare, știam exact ce se potrivește și pe ce trebuie să ne concentrăm.",
      "[h3]Părăsirea Cuibarului[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "În timp ce realizam ultimele retușuri pentru [i]Cuibarul Ghimpilor[/i], am făcut un pas în spate pentru a-l analiza dintr-o perspectivă nouă. Miza era mare, deoarece a trebuit să ne folosim de ceea ce învățaserăm din actele anterioare pentru a realiza o luptă epică împotriva Reginei Imperia și a încheia un eveniment important. Eram destul de încântați de ceea ce realizasem, mai ales având în vedere constrângerile de timp. Am reușit să găsim distracția.",
      "Din păcate, comunitatea nu o găsise încă. Ce nu am luat în calcul a fost faptul că, deoarece [i]Cuibarul Ghimpilor[/i] este o luptă cu un boss, logica ar fi fost să aibă loc acolo unde... este de așteptat să se afle bossul. Adică, la finalul jocului. Asta se traducea în cel puțin 1-2 zile de tortură liniștită așteptând ca pasionații de Dota să progrese prin actul IV la viteze de neimaginat pentru a experimenta acest minijoc. ",
      "Cu toate acestea, se pare că nu am fost nevoiți să așteptăm atât de mult. Ne-am gândit că va trece cel puțin o zi sau două până când cineva va reuși să ajungă în sala tronului Reginei Imperia. Se pare însă că am subestimat aptitudinile jucătorilor de Dota privind rapiditatea cu care pot parcurge conținutul. La doar șaisprezece ore după lansare (da, [i]ore[/i]), primii jucători pasionați înfruntaseră deja provocările ultimului act și experimentau pentru prima dată [i]Cuibarul Ghimpilor[/i].",
      "Și, în cele din urmă, cu toții au ajuns să o înfrunte pe Imperia. În momentul scrierii acestui articol, [i]Cuibarul Ghimpilor[/i] a fost jucat de aproape o sută de milioane de ori. (Dacă nu l-ai jucat încă sau dorești să-l rejoci, acesta poate fi în continuare accesat în arhiva evenimentului Căderea Coroanei, care este disponibilă în joc.)",
      "[h3]Acceptarea incertitudinii[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Sperăm că această perspectivă asupra echipei Dota din timpul dezvoltării unui minijoc te-a ajutat să-ți faci o idee mai bună despre procesul nostru din spate. De asemenea, sperăm că această postare de pe blog nu te-a îngrozit când ai descoperit că inventăm totul pe măsură ce avansăm cu dezvoltarea. Dar, într-adevăr, sperăm să dovedim faptul că designul jocurilor video nu este o artă mistică a geniilor producătoare de jocuri care își învârt degetele în camere întunecate, ci un proces iterativ cu încercări și greșeli, ghidat de date, anxietate, playteste, eșecuri, alte playteste, mai multe eșecuri și încă și mai multe playteste.",
      "Dezvoltarea jocurilor prosperă prin iterație, iar ceea ce începe ca „n-avem nicio idee” se transformă încet „într-o idee” analizând ideile din trecut care au dat rezultat. Apoi se transformă într-un prototip nereușit pe care nimeni nu vrea să-l încerce, dar noi lucrăm oricum la el. Apoi îi urmărim pe jucători și observăm că nu se distrează, revenim la birourile noastre și remediem toate elementele nedistractive până când oamenii ajung să se distreze jucându-l. Apoi îl îmbunătățim cât de bine putem, vedem că se apropie ziua lansării și începem să plângem. Filosofia noastră, a celor de la Valve, a constat întotdeauna în a îmbrățișa incertitudinea și a permite datelor să modeleze dezvoltarea. Asta înseamnă că nu întotdeauna lansăm lucrurile la timp. Dar credem că îți vor plăcea când vor fi gata."
    ],
    "commentcount": 36,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 106,
    "votedowncount": 17,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747094999,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 105,
  "votes_down": 17,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}