{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Mellom slagene: Tornetronen",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mellom slagene: Tornetronen",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[i]Velkommen tilbake til Mellom slagene – en bloggspalte der utviklere går gjennom noen av utfordringene, feilrettingene og heldige uhell vi møter mens vi jobber med et spill så unikt som Dota.[/i]",
      "Under en så stor begivenhet som Kronfallet fikk vi muligheten til å prøve mange eksperimenter – oversiktskart, historier som forgrener seg, heltepolletter, minispill, tegneserier, pikselkunst og andre saker vi har hatt lyst til å utforske i mange år.",
      "Det som gav oss selvtillit nok til å ta disse risikoene – og noe vi hele tiden gjør nytte av hos Valve – er friheten til å iterere: å samle data fra virkelige spillere, la dette utfordre antakelsene våre og til og med få oss til å ombestemme oss. Vi sier ofte at vi ikke helt forstår hva det er vi setter sammen før vi ser spillere samhandle med det, så vi prøver å komme oss til det punktet så raskt som mulig.",
      "Denne tankegangen former også når vi fatter beslutninger – vanligvis så sent under utviklingsprosessen som mulig, når vi har de beste (og av og til eneste) dataene. På hvert eneste steg avhenger vi av spilleres faktiske erfaringer for å hjelpe oss med å fokusere på det som gjør inntrykk, og holde oss unna det som ikke fungerer.",
      "I denne utgaven av [i]Mellom slagene[/i] går vi gjennom utviklingen av noe som kom på plass relativt sent under Kronfallet – bosskampen i 4. akt mellom heltene og Dronning Imperia – [i]Tornetronen[/i]. Vi bruker det også som en liten studie som viser hvordan spilltesting, og dataene dette genererer, påvirker beslutningene våre.",
      "[h3]Veien til Imperia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Det første (og eneste) minispillet i første akt var et lite fiskespill der Tidehunter testet spilleres fiskeferdigheter i håp om å få seg en frokost. Mye av første akt var slik – små idéer vi spredte over kartet for å finne ut av hva spillere var interesserte i. De oppmuntrende spillerdataene fra første akt gav oss selvtilliten til å være mer eventyrlystne med andre akt, og da tredje akt kom ut, gav vi ut [i]Sleet Fighter[/i], et slåssespill som foregår i en av Tusks bruneste favorittkneiper, [i]Dragesjakk[/i], hvor du spiller tre på rad mot Winter Wyvern, og [i]Zaugs hule[/i] en «shoot 'em up» der en ond drage går i dyst mot Vengeful Spirit gjennom Isbrakks snodde hulesystem. ",
      "Da vi endelig kom oss til fjerde akt, hadde vi et godt inntrykk av hva som fungerte og hva som ikke fungerte. Hva slags data? Alt fra det håndfaste – hvor mange spillere spilte hvert minispill om igjen, og hvor ofte – til det som må fortolkes mer, slik som tilbakemelding fra brukere og diskusjoner på nett. Den forståelsen gav oss selvtilliten til å satse alt på en grensesprengende finale: en storslått bosskamp mot den onde dronning Imperia.",
      "Men å bestemme oss for hva slags spill denne bosskampen skulle være var ikke enkelt. Vi visste at den måtte levere et medrivende skue som levde opp til spillernes forventninger. Men den måtte også ha nok variasjon og gjenspillbarhet til å holde seg ferskt etter gjentatt spilling. Og fordi dette var et minispill som ble designet for å kunne spilles mens man er i kø for en kamp, måtte det være intenst og kortfattet. Det måtte føles som en kjapp godbit, og ikke et langt måltid.",
      "For å finne riktig balansegang måtte vi ha en sjanger som kombinerte produksjonsverdien til [i]Sleet Fighter[/i] med gjenspillbarheten til [i]Dragesjakk[/i]. Tross alt kom dette til å være et episk oppgjør mellom Vengeful Spirit, Skywrath Mage og nykommeren Kez (de «tre store» i Kronfallets fire akter) i det de stormet Imperias slott. Vi ville at spillere skulle føle at de stod overfor umulige odds i oppdraget om å nå dronningen.",
      "[h3]En plan klekkes[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Én idé som var aktuell et lite øyeblikk, var turbasert JRPG-stil. Men det tok ikke lang tid å innse at dette ikke passet bra. Vi måtte ha noe som fikk spillerne rett inn i spenningen – noe kort, intenst og gøy man kunne spille mellom Dota-kamper.",
      "Og det var her overlevelsessjangeren kom inn. Et «omvendt kulehelvete» med endeløse bølger av fiender var det perfekte miljøet for en episk bosskamp der alt stod på spill. Spilleren kunne slakte seg vei gjennom horder av fiender og samtidig bruke litt strategi til å forsterke seg i ulike egenskaper som forberedelse på det endelige oppgjøret med Imperia. Det ville også være enkelt å tilordne eksisterende gjenstander og evner i Dota til handlingen, slik at spillere allerede kunne ha en oppfatning av hvordan ting hang sammen.",
      "Siden vi ville at opplevelsen skulle være forholdsvis kort, var gjenspillbarhet en annen viktig del av puslespillet. Overlevelsesspill gav oss mye variasjon, siden det aldri er den samme opplevelsen to ganger. Spillere har ingen garanti for å få forventede gjenstander eller hendelser i den rekkefølgen de ønsker. Variasjonen oppmuntrer deg til å fortsette å prøve, begynne på nytt på en måte som føles utfordrende uten at det blir for vanskelig eller frustrerende. Vi ville egentlig ikke at du skulle vinne første gangen … men vi ville også at du skulle ville fortsette å spille etter å ha tapt. ",
      "[h3]Tidlige prototyper[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "De tidligste prototypene av [i]Tornetronen[/i] begynte med de samme kjerneelementene som den versjonen vi tilslutt gav ut. En spiller valgte én av tre helter, kjempet mot bølge etter bølge med fiender og kom til slutt frem til Imperia. Det disse første forsøkene ikke hadde, var noe som i det hele tatt var morsomt. Av og til vandret en helt over et for det meste tomt kart, og dultet borti ett og annet skjelett. Andre ganger var bølgene av fiender så overveldende at det faktisk ikke var mulig å vinne (trodde vi – mer om det senere). Vi visste at det fantes et gøyalt spill der inne en plass. Vi måtte bare fortsette å torturere spilltesterne våre med dårlige versjoner, helt til vi fant det.",
      "Hver eneste ansatte i Valve er en forsøkskanin, og vi satte dem foran en versjon for å finne ut om noe fungerte (eller like ofte, [i]ikke[/i] fungerte). Vi kan idémyldre i det uendelige, men vi kan ikke faktisk vite om valgene fungerer før noen setter seg ned og spiller.",
      "I begynnelsen slet spilltesterne med å overleve de første 3–6 minuttene. Vanligvis er det et tegn på at spillet enten er ubalansert eller ikke forklarer reglene godt nok. Vi satte oss ned med dem og lot dem vise oss hva de opplevde – øyeblikkene de ikke visste hva de skulle gjøre, eller der de ble så overveldede at det føltes umulig, eller der de simpelthen bare kjedet seg. Så gikk vi tilbake til skrivebordet og gjorde noen endringer, og satte det foran nye spilltestere. Vi begynte sakte, men sikkert, å se fremgang.",
      "Og så skjedde noe.",
      "Etter å ha ledet oss gjennom sin første runde, spurte en spilltester som nettopp hadde tapt: «Kan jeg prøve igjen?».",
      "Dette var nytt, og oppmuntrende. Tornetronen var ikke i nærheten av å være bra enda – det tok vanligvis tre forsøk før noen fant ut hvordan de skulle vinne i prototypen vår – men det var flott at vi for en gangs skyld ikke tvang kollegaene våre til å spille den elendige prototypen vår – de spurte faktisk om å få spille den elendige prototypen vår om igjen.  Det var et lite flimmer av interesse: «Jeg hater det faktisk ikke». Dette var vi fornøyde med.",
      "Men den virkelige aha-opplevelsen lot vente på seg.",
      "[h3]Heltebygg[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Et viktig aspekt ved overlevelsessjangeren de tidlige utgavene våre ikke hadde, var konstant press. Til å begynne med lagde vi bare en bølge med hundre skjeletter på brettet og lot helten hakke løs på dem. Når helten hadde hakket dem ned til null, lagde vi en ny bølge med skurker med høyere vanskelighetsgrad. Spilltestere gikk leie av dette veldig raskt. Når de fant ut at det eneste målet var å hakke løs på en uendelig mengde skurker, begynte det å føles som et ork. Den eneste belønningen for å drepe dem mer effektivt var at man fikk slåss mot den neste og vanskeligere bølgen raskere. (Hurra?)",
      "Til slutt fant vi ut at når vi lagde hundre skjeletter og helten begynte å hakke løs, måtte vi ha en tidtaker på bølgen og fortsette å lage skjeletter uansett hvor mange helten drepte. Når tidtakeren gikk til null, lagde vi en vanskeligere bølge med fiender som hadde en ny tidtaker. Nå tok presset aldri slutt, og spilleren holdt seg engasjert. ",
      "Men det viktigste var at [i]målene[/i] endret seg. Når helten vår bare slaktet et synkende antall skjeletter, var målet «Få antallet skjeletter til å bli null». Men hvis antall skjeletter [i]aldri synker uansett hvor mange man dreper,[/i] tar det ikke lang tid for spillere å innse at å drepe dem faktisk ikke er målet. ",
      "Istedenfor fokuserte de på hva de [i]fikk[/i] for å drepe alle disse skjelettene – i dette tilfellet var det evner og oppgraderinger. Plutselig var ikke målet å drepe alle skjelettene. Der var «Hvor mange av disse tingene kan jeg drepe så raskt som mulig for å bli så [i]mektig[/i] som mulig?» Istedenfor å føles som et ork, ble det å høste bølger med fiender mer som å jage en storgevinst – hvert eneste drap brakte spillere nærmere et perfekt oppsett. ",
      "Ettersom fremdrift til neste bølge ikke lenger var knyttet til å drepe alt fra forrige bølge, endte vi også opp med noe nytt: en delt klokke. Dette betydde at spillere nå delte samme rytme – et felles språk for når ting begynte å bli vanskelig. Så når en spiller sa «Jeg takler ikke den der edderkoppbølgen på fjerde minutt», forstod alle andre umiddelbart hva de mente (de edderkoppene er helt forferdelige).",
      "Vi hadde endelig funnet moroa. Denne lille endringen i fokus hjalp med å gjøre det klart hva spillere hadde det gøy med og hvorfor, og gav oss en hel rekke nye idéer – kraftigere oppgraderinger, sykere evner og byggmuligheter vi ikke engang hadde tenkt på. Dette betydde at spilltestere kunne lage helt forskjellige heltebygg fra hverandre i en enkelt gjennomspilling. Og det betydde at de var mer engasjerte under spilltestene, noe som gav oss bedre tilbakemeldinger og forslag til neste versjon.",
      "Altså, hvis vi spurte flere ganger. Etter en spilltest opplevde vi at kollegaer av og til ikke lenger hadde lyst til å snakke med oss om høydepunkter og lavmål. De hadde lyst til å snakke med hverandre om bygg, og krangle om hva som fungerte best. ",
      "Ettersom byggvariasjoner fortsatte å øke, begynte vi å lure på om vi hadde gått glipp av en stor bit av puslespillet – hva om selve heltene kunne være like unike som evnene? I tidligere prototyper, utenom startevnen deres, var spilleropplevelsen stort sett den samme uansett hvilken helt de valgte. Nå justerte vi dem til å bli virkelig unike valg, der en ble sterkere, en annen raskere, andre bedre i magisk skade – dette åpnet for en enda større variasjon mellom byggene. Å velge en helt over en annen medførte også at man åpnet opp spesifikke grener i evner man ellers ikke kunne bygge seg mot. (Og ettersom det alltid er litt flaks involvert i hvilke oppgraderinger man får, føles hvert valg som et sjansespill.)",
      "[h3]De første seks minuttene[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "I mellomtiden, mens du er distrahert med å finne ut av hvilken oppgraderingsretning som får deg til Imperia, øker vi vanskelighetsgraden sakte. På et eller annet tidspunkt, uten at du la merke til det, er fiendebølgene blitt dødelige, tempoet er blitt nådeløst og du klarer så vidt å holde hodet over vannet. ",
      "Det var i det minste det som var målet. Nå som oppgraderingene kom på plass, gikk vi videre til spillets tempo. Vi ville at opplevelsen skulle være intens, men også kjenne sin besøkelsestid. (Vi regnet med at de fleste spillere kom til å spille mens de ventet på en kamp.) Vi ønsket å gi spillerne nok pusterom til å kose seg med å se de valgte oppgraderingene stable seg oppå hverandre.",
      "Beregningene våre gav oss omtrent 12 minutters spilletid – uten å ta med den tre minutter lange kampen mot Imperia på slutten. Så vi satte i gang med å justere tempoet for de første seks minuttene. Hvor ofte gir vi spilleren et valg om å oppgradere? Hvor tidlig kan de begynne å stable evner? Hvor mye skade skal hver evne gjøre slik at det føles tilfredsstillende, men ikke for kraftig? ",
      "Fordi vi justerte spillopplegget stykkevis, betydde fokuset på de første seks minuttene at de siste seks minuttene av spillet i hovedsak var uspillbare på dette tidspunktet. Vi lot spilltestere spille de første seks minuttene før vi stoppet dem. [i]Teknisk sett[/i] kunne de fortsette å spille, men alt etter de første seks minuttene var bare plassholder. Det var ikke meningen å spille forbi det. (Vi ba dem innstendig om å ikke gjøre det.) ",
      "En morsom bivirkning av å lage evnene og oppgraderingene så morsomme som de ble, var at spilltesterne ofte ikke brydde seg om at den siste halvparten av spillet fortsatt var uspillbart. Vi satt ved siden av en kollega og fulgte med på spillingen gjennom første halvdel av spillet. Når de hadde spilt i seks minutter: ",
      "«Kjempebra, takk!» sa vi. «Kan du begynne på nytt igjen?»",
      "En pause. ",
      "«Vent litt, jeg tror faktisk jeg kan vinne.» ",
      "Vi måtte minne dem på at de siste seks minuttene var en smertefull, ubalansert ødemark av fiender som for øyeblikket var uslåelige. De svarte at de forstod. Vi spurte dem om opp- og nedturer i spillet. De gav oss masse gode tilbakemeldinger om gjennomspillingen i de første seks minuttene. Og så gikk vi tilbake til skrivebordene våre, og når vi hadde gått, gjenopptok de spillet og prøvde å vinne likevel. ",
      "Noen av kollegaene våre tok det personlig at de ikke klarte å komme gjennom de siste grusomt urettferdige, faktisk umulige seks minuttene. Så mens vi designet den første halvdelen av spillet, slo de sammen hodene sine for å overvinne den uslåelige siste halvdelen. ",
      "Og følgen ble at de klarte det. ",
      "Omsider fant de den nøyaktige kombinasjonen av overveldende evner som vi ikke hadde finjustert enda, og slo den delen av spillet som de ikke var ment å slå. (Som sier mye om spilldesign – men kanskje mest om den typen folk som blir spilldesignere.)",
      "[h3]Kontrollert kaos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Mot slutten av utviklingen ble spillets kjerne ferdigbygd. Evner, møter med minibosser og den endelige kampen mot dronning Imperia var alt på plass.  På dette tidspunktet lette vi ikke lenger etter problemer som ødela spillet, men måter å justere, balansere og finpusse de vi allerede visste fungerte. Vi fortsatte spilltestingen, men hadde tonet ned de slitsomme intervjuene etterpå, og vi lot folk bare spille for moro skyld (og selvsagt for å generere mer data).",
      "De kvantitative dataene fra hver gjennomspilling var viktig, men de kvalitative dataene fra spilltestingen var minst like viktig. I et minneverdig eksempel endte en spilltest episk med at Hylemassen – internt kalt «Kjøttbollen» – tok over halve skjermen og slukte spilleren. På dette tidspunktet hadde spilltesteren et publikum av kollegaer som fulgte med bak ham, og alle lo av ulykken hans. Han trykte selvsagt på «Spill igjen» med det samme.",
      "Vi var trygge på at vi hadde noe som var verdig å gi ut, og hadde åpnet spilltestingen fra de som var frivillige, til så å si alle vi klarte å fange på kontoret og dra inn i spillet. I de tidligste prototypene fikk vi ofte melding på Slack klokken 23 på kvelden om at «Spillet er for vanskelig». På dette stadiet fikk vi fortsatt meldinger på Slack klokken 23, men så med en oppfølging klokken 3 med «Glem det, jeg løste det». ",
      "Selv med et spill som nesten var ferdig, arbeidet vi med [i]Tornetronen[/i] helt til vi gav ut 4. akt av Kronfallet. Helt i starten av dette innlegget, nevnte vi at vi kunne gjøre bedre beslutninger når vi har godt datagrunnlag til å støtte dem. Nå hadde vi altså det: Med interne spilltestere så begeistret som de var over å spille spillet (igjen og igjen), og kjempemye data som viste hvilken del som gav gjenklang hos spillere. Og ingenting får et rom fullt av spillutviklere så begeistret som det øyeblikket et spill begynner å bli morsomt. Vi ville gjøre mer av de tingene som vi visste fungerte, så mye som vi kunne klare å fylle det med. Nye gjenstander, evner, bakgrunnshistorier og selv bølger – hver gang vi trodde at vi hadde spikret spillet ferdig, var det alltid noen som fant på enda en idé. Og fordi det som regel var en ganske god idé, klarte vi ikke å motstå å prøve den.",
      "Det var ikke bare at det strømmet på med forslag til nye funksjoner, men de ble bare bedre og bedre jo nærmere vi kom utgivelsesdatoen. Til å begynne med, da ting var mer flytende, var det vanskelig å skille mellom en funksjon av potensielt høy verdi og faktisk lav verdi. Etter en uke ble det ganske åpenbart hvor det var best å investere både ressursene og tiden for å lage et bedre spill.",
      "[h3]Tronen på verket[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Mens vi la siste hånd på [i]Tornetronen[/i], klarte vi å ta et steg tilbake og se på det med ferske øyne. Utfordringen var å bruke det vi hadde lært fra de forrige aktene, til å lage noe som var en passende episk avslutning på denne enorme begivenheten. Vi var ganske fornøyde med det vi hadde fått i stand, særlig med tanke på tidsbegrensningene. Vi hadde funnet moroa.",
      "Dessverre hadde ikke samfunnet funnet den enda. Det vi ikke hadde tenkt på, er at siden [i]Tornetronen[/i] var en bosskamp, måtte den naturlig nok være der bossen er, altså på slutten av spillet. Dette betydde minst en dag eller to i stille tortur mens vi ventet på at Dotas ivrigste spillere skulle komme seg gjennom fjerde akt i umenneskelig hastighet, mens vi ventet på å se at spillere endelig fikk muligheten til å spille det. ",
      "Det viste seg at vi ikke måtte vente lenge. Vi trodde det kom til å ta minst en dag eller to før noen nådde dronning Imperias tronerom. Men vi undervurderte kraftig hvor raskt Dota-spillere klarer å komme seg gjennom innhold. Bare seksten timer etter utgivelsen – ja, [i]timer[/i] – hadde de første spillerne allerede kommet seg gjennom hele siste akt, og fått sin første smak av [i]Tornetronen[/i].",
      "Og til slutt kom alle andre med også. I skrivende stund er [i]Tornetronen[/i] blitt spilt nesten et hundre millioner ganger. (Hvis du ikke har fått det med deg selv, eller bare har lyst til å prøve deg en gang til, kan det fremdeles spilles i Kronfallets arkiv i spillklienten.)",
      "[h3]Omfavne usikkerhet[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Vi håper at dette innblikket i hvordan Dota-teamet får et minispill i stand har gitt deg et bedre inntrykk av prosessen vår – og at du ikke bare stirret på dette blogginnlegget i avsky da vi avslørte at vi bare finner på ting underveis. Egentlig håper vi at dette beviser at spilldesign ikke er en mystisk kunst av spillutviklende genier, som maner frem idéer fra mørke rom, men en gjentakende prosess med prøving og feiling som er drevet av data og bekymring og spilltesting og feiling og spilltesting og mer feiling og mer spilltesting.",
      "Spillutvikling drives fremover med gjentakelser – det som begynner som «ingen aning», tar sakte form som «noen idéer» ved å betrakte tidligere idéer som fungerte. Og så blir det til en elendig prototype som ingen har lyst til å spille – men vi tvinger dem til det uansett. Og så ser vi på mens de ikke har det gøy mens de spiller den, går og fikser alt det som ikke er gøy helt til vi til slutt ser at folk har det gøy med spillingen. Og så finpusser vi og finpusser og ser på utgivelsesplanen og gråter. Valves etos har alltid vært å omfavne usikkerhet og la data forme utviklingen. Det medfører at vi ikke alltid klarer å levere ting i tide. Men vi tror dere kommer til å like dem når de er klare."
    ],
    "commentcount": 4,
    "tags": [],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091375,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}