{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Vonalak közt: Tüskefészek",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Vonalak közt: Tüskefészek",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]Üdv ismét a „Vonalak közt” blogon, amelyben fejlesztőcsapatunk tagjai végigvezetnek néhány olyan kihíváson, hibajavításon és esetenkénti szerencsés véletlenen, amikkel egy olyan egyedi játék készítése közben találkozunk, mint a Dota.[/i]",
      "Egy olyan hatalmas esemény során, mint a Trónfosztás, rengeteget tudtunk kísérletezni – Felvilág-térképekkel, elágazó történetszálakkal, hős témájú zsetonokkal, minijátékokkal, képregényekkel, pixelgrafikákkal és más ötletekkel, amelyeket évek óta szerettünk volna kipróbálni.",
      "Ami magabiztosságot adott, hogy vállaljuk e kockázatokat – és amit a Valve-nél folyamatosan ki is használunk –, az a fejlesztés szabadsága: valós játékosadatokat gyűjthetünk, hagyhatjuk, hogy azok megkérdőjelezzék a feltételezéseinket, sőt, akár meg is gondolhatjuk magunkat. Gyakran mondjuk, hogy nem értjük teljesen, mit építünk, amíg nem látjuk a játékosokat interakcióba lépni vele, ezért igyekszünk a lehető leggyorsabban eljutni arra a pontra.",
      "Ez a gondolkodásmód alakítja azt is, mikor hozunk döntést; általában a fejlesztés lehető legkésőbbi szakaszában, amikor már a legjobb (és néha az egyetlen) adataink vannak. Minden lépésnél valódi játékostapasztalatokra támaszkodunk, hogy segítsenek arra összpontosítanunk, ami igazán megfogja őket, és elkerülnünk azt, ami nem.",
      "A [i]Vonalak közt[/i] e kiadásában olyasvalami fejlesztését fogjuk bemutatni, ami viszonylag későn jelent meg a Trónfosztásban: a főellenségharcot a IV. felvonásban hőseink és Imperia királynő között, a [i]Tüskefészket[/i]. Esettanulmányként is használjuk, hogy megmutassuk, hogyan alakítja a játéktesztelés és az általa generált adatok a döntéshozatalunkat.",
      "[h3]Eljutni Imperiáig[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Az I. felvonás első (és egyetlen) minijátéka egy szerény horgászós minijáték volt, amelyben Tidehunter próbára tette a horgászképességeidet azt remélve, hogy reggelit fogsz neki. Az I. felvonás nagy része ilyen volt – apró ötleteket szórtunk szét a térképen, hogy lássuk, mivel foglalkoznak a játékosok. Az I. felvonás biztató játékosadatai önbizalmat adtak nekünk ahhoz, hogy a II. felvonásban bátrabbak legyünk, és a III. felvonásra már kiadtuk a [i]Sleet Fightert[/i], egy verekedős játékot, Tusk kedvenc kocsmájában; a [i]Sárkánysakkot[/i], egy hármas párosítós elmecsatát Winter Wyvern ellen; és a [i]Zaug fészkét[/i], egy shoot 'em up játékot, amelyben Vengeful Spirit egy gonosz sárkánnyal küzd meg Jégtönk kanyargós barlangrendszerében haladva. ",
      "Mire elértünk a IV. felvonáshoz, már határozottan éreztük, hogy mi működik és mi nem. De milyen adatokból? Mindenből, a konkrétumoktól kezdve (hogy hány játékos és milyen gyakran játszotta újra az egyes minijátékokat) az értelmezendőkig (mint például a felhasználók által beküldött visszajelzések és az online fórumok). E tisztánlátás magabiztosságot adott nekünk, hogy mindent beleadjunk egy minden addiginál nagyobb fináléba: egy eposzi főellenségcsatába a gonosz Imperia királynő ellen.",
      "Azt természetesen nem volt könnyű eldönteni, hogy milyen játék legyen a főellenségharc. Tudtuk, hogy azt a magas kockázatú látványosságot kell adnia, amit a játékosok elvártak. De elegendő változatosságot és újrajátszhatóságot is kellett kínálnia ahhoz, hogy többszöri végigjátszás után is friss maradjon. És mivel ez egy minijáték volt, arra tervezve, hogy meccsre sorban állás közben lehessen játszani, intenzívnek, de rövidnek kellett lennie. Ízletes nassolnivalónak kell érződnie, nem egy hosszú étkezésnek.",
      "A megfelelő egyensúly eltalálásához olyan műfajra volt szükségünk, amely ötvözi a [i]Sleet Fighter[/i] magas produkciós értékét a [i]Sárkánysakk[/i] újrajátszhatóságával. Elvégre ez lenne Vengeful Spirit, Skywrath Mage és az újonc Kez (a Trónfosztás négyfelvonásos történetének „nagy hármasa”) eposzi összecsapása, Imperia kastélyát ostromolva. Azt akartuk, hogy a játékos úgy érezze, esélytelen a királynő elérésére irányuló törekvése.",
      "[h3]A terv kiötlése[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Az egyik ötlet, ami rövid időre felmerült, egy körökre osztott JRPG stílusú csata volt. De nem sokáig tartott felismerni, hogy nem megfelelő. Olyasmire volt szükségünk, ami gyorsan akcióba dobja a játékosokat – valami rövidre, intenzívre és elég szórakoztatóra ahhoz, hogy a Dota játékra sorban állás alatt lehessen játszani.",
      "Ekkor jött képbe a túlélő műfaj. Egy „fordított bullet hell” végtelen ellenséghullámokkal tökéletes közeg egy eposzi hangulatú, magas téttel járó főellenségharchoz. A játékos ellenségek hordáin verekszi át magát, miközben egy kis stratégiát alkalmazva különféle képességeket fejleszt, felkészülve a végső leszámolásra Imperiával. A meglévő Dota tárgyakat és képességeket is könnyű lenne az akcióhoz rendelni, így a játékosoknak már lenne elképzelésük arról, hogyan működnek a dolgok.",
      "Mivel azt szerettük volna, hogy a játékélmény viszonylag rövid legyen, az újrajátszhatóság szintén a kirakós nagy darabja volt. A túlélő műfaj sok változatosságot kínált, mivel az élmény sosem kétszer egyforma. Nem garantált, hogy a játékosok pontosan a kívánt sorrendben kapják meg a várt tárgyakat vagy eseményeket. A változatosság arra ösztönöz, hogy újra és újra próbálkozz, az elejétől kezdve, oly módon, ami kihívást jelent anélkül, hogy leküzdhetetlennek vagy frusztrálónak éreznéd. Nem feltétlenül akartuk, hogy elsőre győzz... de azt is szerettük volna, hogy tovább játssz, amikor veszítesz. ",
      "[h3]Korai prototípusok[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "A [i]Tüskefészek[/i] legkorábbi prototípusai ugyanazokat az alapelemeket tartalmazták, mint a végül kiadott verzió. A játékos kiválasztott egyet a három hős közül, egymást követő ellenfélhullámokkal nézett szembe, és végül eljutott Imperiához. Ám ezekben a korai próbálkozásokban távolról sem volt semmi kicsit is szórakoztató. Néha egy hős egy többnyire üres térképen bolyongott, időnként belebotolva egy-egy csontvázba. Máskor az ellenséghullámok annyira elsöprőek voltak, hogy tényleg nem lehetett győzni (legalábbis gondoltuk mi; erről majd később). Tudtuk, hogy valahol ott van benne egy szórakoztató játék. Csak addig kellett kínoznunk a játéktesztelőinket rossz buildekkel, amíg meg nem találtuk.",
      "Minden Valve alkalmazott kísérleti nyúl, és egy build elé leültetve valakit derül ki, hogy valami működik-e, (vagy ugyanilyen gyakran, hogy [i]nem[/i] működik). Örökké ötletelhetünk, de amíg valaki le nem ül játszani, addig nem tudjuk igazán, hogy a döntéseink célba érnek-e.",
      "A játéktesztelőknek eleinte nehézséget okozott az első 3–6 perc túlélése. Ez általában annak a jele, hogy a játék vagy kiegyensúlyozatlan, vagy nem magyarázza el elég jól a szabályait. Leültünk velük, és megkértük őket, hogy vezessenek végig az élményükön: a pillanatokon, amikor nem voltak benne biztosak, mit kéne tenni, vagy amikor olyan nehéz volt, hogy lehetetlennek érződött, vagy akár ahol egyszerűen csak unatkoztak. Ez után visszamentünk az asztalainkhoz, változásokat eszközöltünk, és új játéktesztelő elé tettük azt. Lassan látni kezdtük az előrelépést.",
      "Aztán történt valami.",
      "Az egyik játéktesztelő, aki végigvezetett az első próbálkozásán, épp miután veszített, azt mondta: „Várjatok, megpróbálhatom újra?”",
      "Ez újdonság volt, és bátorítóan hatott. A Tüskefészek még mindig nagyon távol volt a jótól – általában legalább három menetre volt szükség, mire egy tesztelő rájött, hogyan fejezheti be a prototípust –, de legalább az jó érzés volt, hogy végre egyszer nem mi vettük rá a munkatársainkat, hogy játsszanak a béna prototípusunkkal, hanem ők kérték, hogy játszhassanak még egyszer a béna prototípusunkkal.  Felvillant az érdeklődés icipici szikrája: „Nem utálom szívből az egészet.” És mi örömmel vettük tudomásul.",
      "A valódi heuréka-pillanat azonban még váratott magára.",
      "[h3]Hős-összeállítások[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "A túlélő műfaj egyik kulcseleme, amivel a korai verzióink nem rendelkeztek, az a folyamatos nyomás. Kezdetben csak bedobtunk egy száz csontvázból álló hullámot a szintre, és hagytuk, hogy a hős lekaszabolja őket. Miután a hős mindet kiirtotta, bedobtuk a következő hullámnyi ellenséget egy nehezebb szinten. A játéktesztelők ezt gyorsan megunták. Miután rájöttek, hogy az egyetlen cél az ellenség vég nélküli kaszabolása, kezdték egyhangúnak érezni. A hatékony öldöklésük egyetlen jutalma az volt, hogy hamarabb harcolhattak a következő, nehezebb hullámmal. (Hurrá?)",
      "Végül rájöttünk, hogy miután bedobtunk száz csontvázat, és a hős kaszabolni kezdte őket, egy időzítőt kell adnunk a hullámhoz, és vissza kell töltenünk a csontvázak számát, függetlenül attól, hányat ölt meg a hős. Amikor az időzítő elérte a nullát, bedobunk egy nehezebb hullámnyi ellenséget egy új időzítővel. Így már soha nem csökkent a nyomás, és lekötötte a játékosokat. ",
      "Ám ami ennél is fontosabb, megváltoztak a [i]céljaik[/i]. Amikor a hősünk csak a fogyatkozó csontvázsereget gyilkolászta, a cél a „csontvázak számának nullára csökkentése” volt. Ha azonban a csontvázak száma [i]soha nem csökken, függetlenül attól, hányat ölsz meg[/i], nem tart sokáig, mire a játékosok rájönnek, hogy valójában nem a megölésük a cél. ",
      "Ehelyett arra kezdtek figyelni, hogy mit [i]kaptak[/i] a sok-sok csontváz megöléséért: ebben az esetben képességeket és fejlesztéseket. A cél hirtelen már nem „az összes csontváz megölése” volt, hanem hogy „hányat tudok megölni belőlük a lehető leggyorsabban, hogy a lehető [i]legerősebb[/i] legyek”. Ahelyett, hogy egyhangúnak érződött volna, az ellenség hullámainak learatása a főnyeremény hajszolásának kezdett érződni: mindegyik ölés közelebb vitt a tökéletes összeállításhoz. ",
      "Mivel a következő hullámra lépés már nem függött az előző teljes kiirtásától, valami újat is kaptunk: egy egységes időmérést. Ezt azt jelentette, hogy a játékosok ugyanabban az ütemben haladtak – egységes meghatározást adva arra, mikor kezdett nehezedni a dolog. Így, amikor egy játékos azt mondta, „Ki nem állhatom azt a pókos hullámot a 4. percnél.”, mindenki más azonnal tudta, mire gondolt (azok a pókok szörnyűek).",
      "Végre rátaláltunk a szórakozásra. A fókusz e kicsi elmozdulása segített tisztázni, mit élveztek a játékosok, és miért, ez pedig temérdek új ötletet hozott magával: erősebb fejlesztéseket, őrültebb képességeket, és összeállítási lehetőségeket, amikre nem is gondoltunk. Ez azt jelentette, hogy a játéktesztelők egymástól gyökeresen eltérő hős-összeállításokat készíthettek egyetlen játékmenetben. Ez pedig azt eredményezte, hogy sokkal jobban lekötötte őket a tesztelés, ezzel jobb visszajelzést és ötleteket adva nekünk, amiket beépíthettünk a következő változatba.",
      "Már ha többször rákérdeztünk. A játéktesztelés után néha úgy láttuk, hogy a munkatársaink már nem akartak velünk beszélni a jó és rossz élményeikről. Egymással akartak beszélni az összeállításaikról, és vitázni arról, hogy melyik a jobb. ",
      "Ahogy nőtt az összeállítások változatossága, kezdtünk azon gondolkodni, hogy nem hagytuk-e ki a kirakós egy nagy darabját: mi lenne, ha a hősök maguk is ugyanannyira egyedinek érződnének, mint a képességek? A korai prototípusokban a kezdőképességeiken kívül a játékosélmény a hősválasztástól függetlenül nagyjából ugyanolyan volt. Innentől azonban tényleg egyedi választási lehetőséggé tettük őket – az egyik erősebb lett, a másik gyorsabb, a harmadik pedig több mágikus sebzést okozott –, ami az összeállítások még nagyobb változatosságát jelentette. Az egyik hős választása a másik helyett olyan speciális képességsorok megnyitását is jelentette, amilyen irányba másképp nem fejlődhettél volna. (És mivel mindig közrejátszik a szerencse is, hogy mely fejlesztéseket kapod, mindegyik választás nagy kockázatú hazárdjátéknak érződött.)",
      "[h3]Az első hat perc[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Eközben, amíg téged lefoglal annak kitalálása, hogy melyik fejlesztéság fog eljuttatni Imperiához, mi lassan feltekerjük a nehézséget. Eljön a pont, anélkül, hogy egyáltalán észrevennéd, amikor az ellenséghullámok halálossá válnak, a tempó irgalmatlan, és alig tudsz életben maradni az ellenségáradatban. ",
      "Legalábbis ez volt a cél. A fejlesztések összeállásával áttértünk a játékmenet tempójára. Azt akartuk, hogy az élmény intenzív legyen, de ne vigye túlzásba. (Tudtuk, hogy a legtöbb játékos aközben fog játszani, hogy meccsre áll sorban.) Másrészt azonban, szerettünk volna elég időt hagyni a játékosoknak, hogy kiélvezzék az összeadódó fejlesztési választásaikat.",
      "A papírfecnikre felfirkált számításaink körülbelül 12 percnyi teljes játékidőt mutattak – a háromperces, Imperia ellen vívott csatát nem számítva a végén. Szóval nekiláttunk átdolgozni az első hat perc ütemét. Milyen gyakran adjunk a játékosnak fejlesztési választást? Milyen korán kezdhetik halmozni a képességeket? Mennyit sebezzenek az egyes képességek, ami még kielégítőnek érződik, de nem túl erős? ",
      "Mivel szakaszonként finomhangoltuk a játékmenetet, az első hat percre koncentrálás azt jelentette, hogy az utolsó hat perc ezen a ponton lényegében játszhatatlan volt. Az emberekkel az első hat percet teszteltettük, majd kértük, hogy hagyják abba. [i]Technikailag[/i] játszhattak volna tovább, de hat perc után minden csak helykitöltés volt. Nem terveztük, hogy azon túl játssz. (Konkrétan könyörögtünk a munkatársainknak, hogy ne csinálják.) ",
      "Annak, hogy a képességeket és fejlesztéseket egyre szórakoztatóbbá tettük, az lett az egyik vicces mellékhatása, hogy a játéktesztelőket gyakran nem érdekelte, hogy a játék fele még mindig játszhatatlan volt. Ültünk egy munkatárs asztalánál, és néztük, ahogy végigjátssza a játék első felét. Aztán hat perc után: ",
      "„Szuper, köszi.” – mondtuk. „Újra tudnád kezdeni a játékot?”",
      "Szünet. ",
      "„Várj csak, asszem végig tudnám csinálni.” ",
      "Emlékeztettük őket, hogy az utolsó hat perc egy büntető, kiegyensúlyozatlan senki földje volt átmásolt ellenségekkel, ami jelenleg teljesíthetetlen. Közölték, hogy megértették. Kikérdeztük őket a legjobb és legrosszabb pillanatokról. Sok szuper visszajelzést adtak az első hat perccel töltött játékmenetükről. Mi visszamentünk az asztalainkhoz, ők nézték, ahogy távozunk, majd a folytatásra kattintottak, és megpróbálták csak azért is végigjátszani. ",
      "Egyes munkatársaink személyes sértésnek vették, hogy nem tudtak átjutni az ádázul igazságtalan, szó szerint teljesíthetetlen utolsó hat percen. Szóval, amíg mi a játék első felét terveztük, ők minden erejüket összegyűjtve rohantak fejjel a teljesíthetetlen második felének. ",
      "És itt jön a csavar: teljesítették. ",
      "Idővel rátaláltak a még nem finomhangolt, túl erős képességek azon pontos kombinációjára, amivel teljesíthették a játék nem teljesíthetőnek szánt részét. (Ami sokat elárul a játéktervezésről, de a játékfejlesztőnek álló emberekről talán még annál is többet.)",
      "[h3]Irányított káosz[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "A fejlesztés végére elkészült a játék alapja. A képességek, a mini-főellenség találkozások és a végső összecsapás Imperia királynővel mind a helyükön voltak.  Ezen a ponton már nem alapvető hibákat kerestünk, hanem lehetőségeket annak finomítására, kiegyensúlyozására és csiszolására, amiről már tudtuk, hogy működik. Tovább teszteltünk, de visszavettünk a kimerítő, halál utáni interjúkból, és csak hagytuk az embereket szórakozásból játszani (és persze több adatot generálni).",
      "Bár fontosak voltak a játékmenetekből gyűjtött számszerű adatok, a játéktesztekből származó minőségi adatok úgyszintén. Egy emlékezetes példa, amikor az egyik teszt eposzi módon azzal ért véget, hogy a Jajongó tömeg – amit belsőleg csak „Húsgolyónak” hívtunk –, beborította a képernyő felét, és elnyelte a játékost. Ekkor a tesztjátékos mögül már egy egész közönségnyi munkatárs figyelt és röhögött a balszerencséjén. Ő persze azonnal megnyomta az „Új játék” gombot.",
      "Biztosak voltunk benne, hogy valami kiadásra érdemeset készítettünk, és az önkéntes tesztelőnek jelentkezők helyett lényegében mindenki előtt megnyitottuk a tesztelést, akit sarokba tudtunk szorítani és a játékba tudtunk rángatni a cégnél. A legkorábbi prototípusainknál „A játék túl nehéz.” Slack-üzeneteket kaptunk este 11-kor. Ezen a ponton továbbra is megkaptuk ezeket az este 11 órai üzeneteket, de aztán jött az újabb üzenet is hajnali 3-kor, hogy „Semmi, lenyomtam.” ",
      "Még nagyrészt kész állapotában is dolgozunk a [i]Tüskefészken[/i], egészen a Trónfosztás IV. felvonásának kiadásáig. Még e bejegyzés legelején írtuk, hogy jobb döntéseket tudunk hozni, amikor jó adatokkal tudjuk megtámogatni azokat. Hát, most már volt elég: a belső játéktesztelőinktől, akik ilyen izgatottak voltak a játék játszásától (és újrajátszásától), rengeteg adatunk volt tudni, hogy melyik része működött annak, amit építettünk. És egy irodányi játékfejlesztőnek annál a pillanatnál nincs izgalmasabb, mint amikor egy játék elkezd szórakoztató lenni. Többet akartunk abból, amiről most már tudtuk, hogy működik; annyit, amennyi csak belefér. Új tárgyakat, képességeket, történetet és még hullámokat is; valahányszor úgy éreztük, elkészült a játék, valaki elkerülhetetlenül előállt egy „még egy utolsó” ötlettel. És mivel általában elég remek ötlet volt, nem tudtunk ellenállni a kipróbálásának.",
      "Nemcsak hogy folyamatosan jöttek a funkcióötletek, de a kiadáshoz közeledve egyre jobbá is váltak. A korai fázisban, amikor a dolgok még nem öltöttek alakot, nehéz volt különbséget tenni egy potenciálisan értékes és egy valójában alacsony értékkel bíró funkció között. Amikor már csak egy hétnyire voltunk, nyilvánvalók voltak azok a helyek, ahova erőforrásainkat és időnket csoportosítva jobbá tehettük a játékot.",
      "[h3]A Fészek elhagyása[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Ahogy az utolsó simításokat végeztük a [i]Tüskefészken[/i], hátra tudtunk lépni, és friss nézőpontból megvizsgálni. A kihívás az volt, hogy a korábbi felvonásokból tanultak segítségével a hatalmas esemény lezárására kellőképp eposzi főellenség-harcot alkossunk. Nagyon elégedettek voltunk azzal, amit véghez vittünk, főleg a korlátozott idő tükrében. Rátaláltunk a szórakozásra.",
      "Sajnos a közösség ekkor még nem talált rá. Azt nem vettük figyelembe, hogy mivel a [i]Tüskefészek[/i] főellenségharc volt, logikus módon ott kellett történnie, ahol a főellenség él, a játék végén. Ez legalább egy-két napnyi néma kínzást jelentett, miközben vártuk, hogy a Dota legkeményebb játékosai embertelen sebességgel átküzdjék magukat a IV. felvonáson, hogy végre lássuk őket játszani vele. ",
      "Kiderült, hogy nem kellett sokáig várnunk. Úgy gondoltuk, legalább egy-két napunk van, mielőtt bárki elérné Imperia királynő tróntermét. Kiderült, hogy durván alábecsültük, milyen gyorsan tudnak a Dota játékosok átnyargalni a tartalmon. Csupán 16 órával a kiadás után – igen, [i]órával[/i] – az első játékosok már átküzdötték magukat a teljes utolsó felvonáson, és már az első ízelítőiket kapták a [i]Tüskefészekből[/i].",
      "És idővel mindenki más is felzárkózott. E bejegyzés írásakor a [i]Tüskefészket[/i] csaknem 100 millió alkalommal játszották. (Ha te magad nem jutottál el odáig, vagy csak szeretnéd még egyszer kipróbálni, továbbra is játszható a kliensben a Trónfosztás Archívumban.)",
      "[h3]A bizonytalanság elfogadása[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Reméljük, e betekintés a színfalak mögé, ahogy a Dota csapat életre kelt egy minijátékot, jobb rálátást adott a folyamatainkra – és reméljük, nem szörnyülködve bámulod ezt a blogbejegyzést, rádöbbenve arra, hogy mindent menet közben találunk ki. De komolyan, reméljük, bizonyítja, hogy a játéktervezés nem valami misztikus művészet, ami során játékkészítő zsenik sötét szobákban morzsolgatják az ujjaikat, hanem kísérletező próbálkozások szüntelen folyamata, amit adatok, aggodalom, tesztelés, kudarcok, tesztelés, még több kudarc és még több tesztelés hajt.",
      "A játékfejlesztést a ciklikusság élteti – ami ötlettelenséggel indulva lassan ötletekké válik, megvizsgálva olyan korábbi ötleteket, amelyek beváltak. Aztán egy rossz prototípus lesz belőle, amit senki se akar játszani, de mi csak azért is kényszerítjük őket. Majd nézzük, ahogy nem szórakoznak játék közben, és elmegyünk kijavítani a nem szórakoztató részeket, míg végül azt nem látjuk, hogy jól szórakozva játszanak vele. Ezután csiszoljuk és csiszoljuk, majd ránézünk a kiadási naptárra, és sírva fakadunk. A Valve-re mindig is jellemző volt a bizonytalanság elfogadása, és hagyni, hogy az adatok formálják a fejlesztést. Ez azt jelenti, hogy nem mindig adjuk ki időben a dolgokat. De hisszük, hogy szeretni fogjátok azokat, amikor elkészülnek."
    ],
    "commentcount": 34,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 81,
    "votedowncount": 17,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747094355,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 81,
  "votes_down": 17,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}