{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "สอดส่องลอดเลน: เนสต์ออฟธอร์น",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "สอดส่องลอดเลน: เนสต์ออฟธอร์น",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[i]ยินดีต้อนรับกลับสู่บล็อก \"สอดส่องลอดเลน\" ซึ่งจะให้สมาชิกทีมผู้พัฒนาของเรามาเล่าเรื่องราวอุปสรรค การแก้ไขข้อบกพร่อง และเรื่องค้นพบโดยบังเอิญสนุก ๆ บางครั้งที่พบขณะเราพัฒนาเกมที่ไม่เหมือนใครอย่าง Dota[/i]",
      "ในช่วงกิจกรรมอันยิ่งใหญ่ดังเช่นศึกบัลลังก์วิบัติ เราได้ทดลองทำหลาย ๆ อย่าง ทั้งการสร้างแผนที่โลก เนื้อเรื่องที่แตกกิ่งก้านสาขา โทเคนตามลักษณะฮีโร่ มินิเกม การ์ตูน พิกเซลอาร์ต และไอเดียอื่น ๆ ที่เราอยากสำรวจมาหลายปีแล้ว",
      "สิ่งที่ทำให้เรามั่นใจที่จะลองเสี่ยงเช่นนี้ และเป็นสิ่งที่เราใช้ประโยชน์อยู่เสมอที่ Valve นั่นคืออิสระในการปรับแต่งอย่างต่อเนื่อง: ในการรวบรวมข้อมูลผู้เล่นจริงและ ปล่อยให้ข้อมูลท้าทายสมมติฐานของเรา และแม้แต่เปลี่ยนความคิดของเรา เรามักกล่าวอยู่เสมอว่าเราจะไม่เข้าใจสิ่งที่เรากำลังสร้างขึ้นได้อย่างเต็มที่จนกว่าเราจะเห็นผู้เล่นโต้ตอบกับมัน ดังนั้นเราจึงพยายามไปถึงจุดนั้นโดยเร็วที่สุด",
      "ความคิดดังกล่าวยังช่วยกำหนดแนวทางการตัดสินใจของเราเช่นกัน ซึ่งมักเกิดขึ้นระหว่างการพัฒนาในช่วงท้ายสุดเท่าที่เป็นไปได้ เมื่อเรามีข้อมูลที่ดีที่สุด (และบางครั้งก็เป็นข้อมูลหนึ่งเดียวที่เรามี) ในทุกขั้นตอน เราอาศัยประสบการณ์ของผู้เล่นจริงเพื่อช่วยให้เราเน้นพัฒนาสิ่งที่ตอบรับได้ดีกับผู้เล่น และหลีกเลี่ยงสิ่งที่ดีไม่เท่าที่ควร",
      "ใน[i]สอดส่องลอดเลน[/i]ฉบับนี้ เราจะเล่าเรื่องราวการพัฒนาสิ่งที่เกิดขึ้นในช่วงท้าย ๆ ของศึกบัลลังก์วิบัติ นั่นก็คือด่านบอสในบทที่ IV ระหว่างเหล่าฮีโร่ของเรากับราชินีอิมพีเรียในเกม[i]เนสต์ออฟธอร์น[/i] อีกทั้งเรายังใช้เป็นกรณีศึกษาเพื่อแสดงให้เห็นว่าการทดสอบเล่นและข้อมูลที่เกิดขึ้นมานั้นมีผลต่อการตัดสินใจของเราอย่างไร",
      "[h3]การเดินทางสู่อิมพีเรีย[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "มินิเกมแรก (และเป็นเกมเดียว) ในบทที่ I คือมินิเกมตกปลาแสนเรียบง่าย ที่มี Tidehunter มาทดสอบทักษะการตกปลาของคุณเพื่อหวังจะช่วยตกอาหารเช้าให้เขาได้กิน ซึ่งบทที่ I ก็มีหลายอย่างในลักษณะนี้ เป็นไอเดียเล็ก ๆ น้อย ๆ ที่เรากระจายไปทั่วแผนที่เพื่อดูว่าผู้เล่นจะสนใจอะไร ข้อมูลผู้เล่นที่น่ากระชุ่มกระชวยใจจากบทที่ I ส่งผลให้เรามั่นใจที่จะลุยหนักขึ้นในบทที่ II และเมื่อถึงบทที่ III เราก็ได้เผยแพร่ [i]Sleet Fighter[/i] เกมต่อสู้ในบาร์เฮฮาโปรดของ Tusk, [i]หมากรุกมังกร[/i] เกมเรียงเพชรประลองปัญญาแข่งกับ Winter Wyvern และ [i]ตะลุยรังซ็อก[/i] เกมชูตเอ็มอัปที่ให้มังกรชั่วร้ายต่อสู้กับ Vengeful Spirit ผ่านระบบถ้ำที่คดเคี้ยวแห่งไอซ์แร็ก ",
      "เมื่อเราถึงบทที่ IV เรามีความคิดที่ชัดเจนขึ้นว่าอะไรได้ผลบ้างและอะไรที่ไม่ได้ผล แล้วเราใช้ข้อมูลประเภทใด? ทุกอย่างเลย ตั้งแต่ข้อมูลที่แน่ชัด เช่น จำนวนผู้เล่นที่เล่นมินิเกมแต่ละเกมซ้ำและความถี่ในการเล่น จนไปถึงข้อมูลที่ต้องใช้การตีความ เช่น ความเห็นที่ผู้เล่นส่งเข้ามาและการสนทนาทางออนไลน์ ความชัดเจนดังกล่าวทำให้เรามีความมั่นใจในการทุ่มสุดตัวให้กับเกมสุดท้ายแบบสุดลิ่มทิ่มประตู ซึ่งเป็นด่านบอสสุดยิ่งใหญ่กับราชินีอิมพีเรียจอมชั่วร้าย",
      "แน่นอนว่าการตัดสินใจว่าด่านบอสควรจะเป็นเกมประเภทใดนั้นไม่ใช่เรื่องง่าย เรารู้ว่ามันจำเป็นต้องนำเสนอการแสดงสุดยิ่งใหญ่ตามที่ผู้เล่นคาดหวัง แต่ก็ยังต้องมีความหลากหลายและความสามารถในการเล่นซ้ำได้เพียงพอที่จะยังคงสดใหม่หลังจากเล่นหลายครั้ง และเนื่องจากเป็นมินิเกมที่ออกแบบมาเพื่อเล่นขณะเข้าคิวค้นหาแมตช์ จึงจำเป็นต้องมีความเข้มข้นแต่มีระยะเวลาสั้น ควรให้ความรู้สึกเหมือนเป็นอาหารว่างแสนอร่อย ไม่ใช่มื้ออาหารแบบยาวนาน",
      "เพื่อสร้างสมดุลที่ดี เราต้องการเกมในประเภทที่ผสมผสานทุนการผลิตสูงอย่าง [i]Sleet Fighter[/i] เข้ากับความสามารถในการเล่นซ้ำได้ของ[i]หมากรุกมังกร[/i] ท้ายที่สุดแล้ว นี่จะเป็นการเผชิญหน้าอันยิ่งใหญ่ระหว่าง Vengeful Spirit, Skywrath Mage และฮีโร่หน้าใหม่ Kez (\"3 ตัวละครหลัก\" ของเราจากเรื่องราวศึกบัลลังก์วิบัติ 4 บท) ที่จะบุกโจมตีปราสาทของอิมพีเรีย เราต้องการให้ผู้เล่นรู้สึกเหมือนกับว่าพวกเขาต้องเผชิญกับอุปสรรคสุดแสนยากเข็ญในภารกิจเพื่อพิชิตราชินี",
      "[h3]ก่อร่างสร้างแผน[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "ไอเดียหนึ่งที่ได้รับความสนใจในช่วงสั้น ๆ คือเกมต่อสู้สวมบทบาทแบบญี่ปุ่นที่ผลัดตากันเดิน แต่ก็ใช้เวลาไม่นานก่อนที่เราจะรู้ว่านั่นไม่ใช่แนวที่เหมาะ เราต้องการอะไรบางอย่างที่จะกระตุ้นให้ผู้เล่นไปทำภารกิจได้อย่างรวดเร็ว — อะไรบางอย่างที่สั้น เข้มข้น และสนุกสนานพอที่จะเล่นระหว่างรอคิวเล่น Dota",
      "นั่นคือจุดที่เราลงเอยที่แนว Survivors แนว \"สาดกระสุนนรก\" ที่มีระลอกศัตรูแบบไม่รู้จบ ถือเป็นเกมที่สมบูรณ์แบบสำหรับการต่อสู้กับบอสที่มีเดิมพันสูงและมีความสนุกระดับมหากาพย์ ผู้เล่นจะต้องฟันฝ่าดงศัตรูโดยใช้กลยุทธ์เล็ก ๆ น้อย ๆ เพื่อเสริมพลังสกิลต่าง ๆ ในการเตรียมพร้อมที่จะเผชิญหน้าครั้งสุดท้ายกับราชินีอิมพีเรีย นอกจากนี้ยังสามารถเชื่อมโยงไอเท็มและสกิลที่มีใน Dota อยู่แล้วกับแอ็คชันได้ง่ายอีกด้วย ดังนั้นผู้เล่นจะเข้าใจได้ทันทีว่าจะใช้งานสิ่งต่าง ๆ อย่างไร",
      "เนื่องจากเราต้องการให้ประสบการณ์การเล่นมีระยะเวลาค่อนข้างสั้น ดังนั้นการเล่นซ้ำได้จึงเป็นอีกประเด็นหนึ่งที่สำคัญ เกมแนว Survivors ทำให้เรามีตัวแปรได้หลากหลายมาก เพราะผู้เล่นจะไม่มีทางได้รับประสบการณ์เดิมซ้ำสองครั้ง อีกทั้งยังไม่มีหลักประกันว่าผู้เล่นจะได้รับไอเท็มหรือกิจกรรมที่ตนคาดหวังไว้ตรงตามลำดับที่ตนต้องการเป๊ะ การมีตัวแปรต่าง ๆ ช่วยกระตุ้นให้คุณพยายามต่อไป โดยเริ่มต้นจากศูนย์ในลักษณะที่รู้สึกเป็นความท้าทาย แต่ไม่ทำให้รู้สึกว่าเกินความสามารถหรือน่าท้อแท้ เราไม่ได้ต้องการให้คุณชนะตั้งแต่เล่นครั้งแรก... แต่เราต้องการให้คุณเล่นต่อถึงแม้ว่าคุณจะแพ้ก็ตาม ",
      "[h3]ต้นแบบรุ่นแรก ๆ[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "ต้นแบบรุ่นแรกสุดของเกม[i]เนสต์ออฟธอร์น[/i]เริ่มต้นด้วยองค์ประกอบหลักเดียวกันกับเวอร์ชันที่เราจัดส่งในที่สุด นั่นคือ ผู้เล่นเลือก 1 ใน 3 ฮีโร่เพื่อเผชิญหน้ากับศัตรูระลอกแล้วระลอกเล่า จนในที่สุดก็ไปพบกับราชินีอิมพีเรีย แต่สิ่งที่รุ่นแรก ๆ เหล่านี้ขาดไปคือ อะไรก็ตามที่เรียกได้ว่าความสนุก บางครั้งฮีโร่ได้แต่เตร็ดเตร่ไปในแผนที่ที่เกือบว่างเปล่า และเดินชนกับโครงกระดูกเป็นครั้งคราว บางครั้ง ศัตรูก็โจมตีแบบถล่มทลายเป็นระลอกจนแทบไม่มีทางเอาชนะได้เลย (หรืออย่างน้อยเราก็คิดอย่างนั้น แล้วค่อยคุยเรื่องนี้เพิ่มเติมทีหลัง) เรารู้ว่ามีความสนุกแฝงเร้นที่ไหนสักแห่งในเกมนี้ เราแค่ต้องทรมานผู้ทดลองเล่นของเราต่อไปด้วยบิลด์แย่ ๆ จนกว่าเราจะหาเจอว่าความสนุกอยู่ตรงไหน",
      "พนักงานทุกคนของ Valve คือหนูทดลองดี ๆ นี่เอง และการปล่อยให้ใครสักคนมาลองเล่นบิลด์ก็ช่วยให้เราทราบว่าอะไรบ้างที่ใช้ได้ผล (หรือบ่อยพอ ๆ กัน - อะไรบ้างที่ใช้[i]ไม่[/i]ได้ผล) เราสามารถระดมความคิดได้ไม่จบสิ้น แต่เราไม่มีทางรู้จริง ๆ ว่าสิ่งที่เราตัดสินใจเลือกนั้นจะลงเอยด้วยดีหรือไม่จนกว่าจะมีใครสักคนยอมมานั่งลองเล่นเกมดู",
      "ในตอนแรก ผู้ทดลองเล่นต้องพยายามอย่างหนักเพื่อเอาตัวรอดให้ได้ในช่วง 3-6 นาทีแรก โดยปกติแล้ว นั่นเป็นสัญญาณบ่งบอกว่าเกมนั้นขาดความสมดุลหรืออธิบายกฎเกณฑ์ของเกมไว้ไม่ดีพอ เราจึงนั่งลงข้าง ๆ ผู้ทดลองเล่นและขอให้อธิบายประสบการณ์การเล่นให้เราฟัง — ช่วงเวลาที่ผู้ทดลองเล่นไม่แน่ใจว่าจะทำอย่างไรต่อไป หรือช่วงเวลาที่หลายอย่างประดังเข้ามาจนรู้สึกว่าไม่มีทางฝ่าไปได้ หรือแม้กระทั่งช่วงเวลาที่ผู้ทดลองรู้สึกเบื่อหน่าย จากนั้นเราจะกลับไปที่โต๊ะทำงานของเราและปรับเปลี่ยนอะไรบางอย่าง แล้วนำไปเสนอให้ผู้ทดลองเล่นอีกคนหนึ่ง นั่นแหละที่เราค่อย ๆ เห็นความคืบหน้า",
      "แล้วจู่ ๆ อะไรบางอย่างก็เกิดขึ้น",
      "หลังจากที่พาเราผ่านพ้นรอบแรกไปได้ ผู้ทดลองเล่นที่เพิ่งแพ้ไปหยก ๆ ก็ถามว่า \"ว่าไปแล้ว ขอผมลองเล่นอีกหนได้ไหม\"",
      "นั่นเป็นเรื่องใหม่ที่ทำให้เรามีกำลังใจ เกม \"เนสต์ออฟธอร์น\" ยังคงไปไม่ถึงไหนในทางที่ดี — ปกติแล้วต้องลองเล่นอย่างน้อยสามครั้งก่อนที่จะหาทางเอาชนะเกมต้นแบบของเราได้ — แต่อย่างน้อยที่สุดก็ดีตรงที่เราไม่ได้ทำให้เพื่อนร่วมงานต้องทนเล่นเกมต้นแบบห่วย ๆ ของเรา แต่กลับกลายเป็นว่า เพื่อนร่วมงานของเรากลับมาขอเล่นเกมต้นแบบห่วย ๆ ของเราอีกรอบหนึ่ง  โดยพูดเป็นนัยให้เห็นถึงความสนใจเล็ก ๆ ว่า \"ฉันไม่ได้เกลียดเกมนี้เข้าไส้หรอก\" แค่นี้เราก็ดีใจแล้ว",
      "แต่วินาที \"ปิ๊งไอเดีย\" ที่แท้จริงยังมาไม่ถึง",
      "[h3]แนวทางสร้างฮีโร่[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "หนึ่งในลักษณะสำคัญของเกมแนว Survivors ที่เวอร์ชันแรก ๆ ของเราไม่มีก็คือแรงกดดันอย่างต่อเนื่อง ในตอนแรก เราแค่สร้างเหล่าโครงกระดูก 100 ตัวขึ้นมาหนึ่งชุดในด่าน แล้วปล่อยให้ฮีโร่ฟาดฟันให้เรียบ พอฮีโร่ฟาดพวกมันจนหมดเกลี้ยงแล้ว เราก็สร้างศัตรูชุดถัดไปในระดับความยากสูงขึ้น ผู้ทดลองเล่นเบื่อกับรูปแบบนี้อย่างรวดเร็ว เมื่อผู้เล่นคิดออกว่าเป้าหมายเดียวคือการฟาดฟันเหล่าศัตรูอย่างไม่มีที่สิ้นสุด ก็เริ่มรู้สึกเหมือนเป็นงานที่น่าเบื่อเลยทีเดียว รางวัลเดียวสำหรับการฆ่าศัตรูอย่างมีประสิทธิภาพก็คือจะต้องต่อสู้กับศัตรูระลอกถัดไปที่แข็งแกร่งขึ้นในเวลาไวขึ้น (เย้?)",
      "สุดท้ายแล้ว เราก็คิดออกได้ว่าเมื่อเราได้สร้างโครงกระดูกครบ 100 ตัวและฮีโร่เริ่มโจมตีแล้ว เราจำเป็นต้องตั้งเวลาตามระลอกนั้นไว้และเติมเหล่าโครงกระดูกให้เต็มไม่ว่าฮีโร่จะฆ่าไปกี่ตัวก็ตาม เมื่อเวลาที่ตั้งไว้หมดลง เราก็จะสร้างศัตรูชุดถัดไปที่ยากขึ้นพร้อมกับเริ่มจับเวลาใหม่ ซึ่งทำให้เกิดแรงกดดันอย่างต่อเนื่อง และผู้เล่นก็จะมีส่วนร่วมอยู่ตลอด ",
      "แต่ที่สำคัญกว่านั้นคือ[i]เป้าหมาย[/i]ของผู้เล่นจะเปลี่ยนไป เมื่อฮีโร่ของเราเพียงแค่สังหารโครงกระดูกที่จำนวนน้อยลงเรื่อย ๆ เป้าหมายเดิมก็คือ \"ทำให้จำนวนโครงกระดูกลดลงเหลือศูนย์\" แต่หากจำนวนโครงกระดูก[i]ไม่ลดลงเลยไม่ว่าจะฆ่าไปกี่ตัวก็ตาม[/i] ในไม่ช้าผู้เล่นก็จะคิดได้ว่าการฆ่าศัตรูนั้นไม่ใช่เป้าหมายจริง ๆ ",
      "แต่ผู้เล่นจะไปสนใจสิ่งที่[i]ได้รับ[/i]จากการสังหารโครงกระดูกเหล่านั้นทั้งหมดแทน ซึ่งในเกมนี้ก็คือสกิลและการอัปเกรด ทันใดนั้น เป้าหมายก็ไม่ใช่ \"ฆ่าโครงกระดูกทั้งหมด\" อีกต่อไป แต่เป็น \"ฉันจะฆ่าสิ่งเหล่านี้โดยเร็วที่สุดได้กี่ตัวเพื่อให้[i]มีพลัง[/i]มากที่สุดเท่าที่จะเป็นไปได้?\" จากที่เคยรู้สึกว่าเหมือนเป็นงานน่าเบื่อ การกวาดล้างเหล่าศัตรูก็เริ่มให้ความรู้สึกเหมือนกำลังตามล่ารางวัลแจ็กพ็อต โดยการฆ่าแต่ละตัวจะทำให้คุณเข้าใกล้การสร้างฮีโร่ที่สมบูรณ์แบบมากขึ้น ",
      "เนื่องจากการไปสู่ศัตรูชุดถัดไปไม่ได้ผูกอยู่กับการฆ่าศัตรูทั้งหมดในชุดก่อนหน้าอีกต่อไป เราก็ได้สิ่งใหม่ขึ้นมาอีกด้วย นั่นคือนาฬิกาที่ใช้ร่วมกัน ซึ่งหมายความว่าผู้เล่นจะแบ่งปันจังหวะเกมในลักษณะเดียวกัน เป็นภาษากลางให้ได้รู้ถึงช่วงเวลาที่เกมจะเริ่มยากขึ้น ดังนั้นเมื่อผู้เล่นคนหนึ่งพูดว่า \"ฉันเกลียดแมงมุมฝูงนั้นตอนนาทีที่ 4 เสียจริง\" ทุกคนก็รู้ทันทีว่าพวกเขาหมายถึงอะไร (แมงมุมพวกนั้นมันแย่ที่สุดเลย)",
      "สุดท้ายแล้ว เราก็ค้นพบความสนุก การเปลี่ยนแปลงจุดโฟกัสเล็ก ๆ น้อย ๆ นี้ช่วยทำให้ทราบได้ชัดเจนขึ้นว่าผู้เล่นชื่นชอบอะไรด้วยเหตุผลใด และยังจุดประกายให้เกิดไอเดียใหม่ ๆ มากมาย เช่น การอัปเกรดทรงพลังยิ่งขึ้น สกิลที่บ้าระห่ำขึ้น และแนวทางการสร้างฮีโร่ต่าง ๆ ที่เราไม่เคยลองคิดมาก่อน ซึ่งหมายความว่าผู้ทดลองเล่นสามารถสร้างฮีโร่ที่แตกต่างจากกันและกันอย่างสิ้นเชิงได้ในการเล่นครั้งเดียว และหมายความว่าผู้เล่นจะมีส่วนร่วมระหว่างการทดลองเล่นมากขึ้น ทำให้เราได้รับผลตอบรับและข้อเสนอแนะที่ดีกว่าเดิมเพื่อนำไปใช้ในบิลด์ถัดไป",
      "แต่ก็ ถ้าเราได้มีโอกาสถามมากกว่าครั้งเดียวอะนะ หลังจากการทดลองเล่นแล้ว บางครั้งเราพบว่าเพื่อนร่วมงานไม่อยากคุยกับเราเกี่ยวกับช่วงเวลาดี ๆ และแย่ ๆ ของพวกเขาอีกต่อไป แต่กลับไปคุยกันเองเกี่ยวกับแนวทางการสร้างฮีโร่และก็เถียงกันว่าของใครดีกว่ากันแทน ",
      "เมื่อความหลากหลายในการสร้างฮีโร่มีมากขึ้น เราก็เริ่มสงสัยว่าเราพลาดชิ้นส่วนสำคัญของปริศนาไปอยู่หรือเปล่า จะเกิดอะไรขึ้นหากตัวฮีโร่เองให้ความรู้สึกพิเศษเฉพาะตัวเหมือนกับสกิล? ในต้นแบบรุ่นแรกเริ่ม นอกจากสกิลเริ่มต้นแล้ว ประสบการณ์ของผู้เล่นก็แทบจะเหมือนกันไม่ว่าจะเลือกฮีโร่ใดก็ตาม เราจึงปรับฮีโร่ให้กลายเป็นตัวเลือกที่มีเอกลักษณ์อย่างแท้จริง โดยกำหนดให้ตัวหนึ่งแข็งแกร่งกว่า อีกตัวเร็วกว่า และอีกตัวใช้ความเสียหายเวทมนตร์ได้ดีกว่า ซึ่งเปิดโอกาสให้มีความหลากหลายในแนวทางการสร้างฮีโร่ได้มากขึ้นกว่าเดิม การเลือกฮีโร่ตัวใดตัวหนึ่งยังหมายถึงเป็นการเปิดสายสกิลเฉพาะเจาะจงที่คุณอาจไม่สามารถสร้างขึ้นมาได้ด้วยวิธีอื่นด้วย (และเนื่องจากจะต้องใช้โชคช่วยนิดหน่อยในการสุ่มตัวเลือกการอัปเกรด ดังนั้น การเลือกทุกครั้งจึงเหมือนเป็นการเดิมพันที่มีความเสี่ยงสูง)",
      "[h3]หกนาทีแรก[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "ในขณะเดียวกันกับที่คุณมัวแต่พะวงหาคำตอบว่าเส้นทางอัปเกรดใดที่จะพาคุณไปยังอิมพีเรียได้ เราก็ค่อย ๆ เพิ่มความยากขึ้นเรื่อย ๆ และเมื่อมาถึงจุดหนึ่ง ศัตรูที่โจมตีมาเป็นระลอกก็โหดเหี้ยมขึ้น จังหวะเกมก็เร็วขึ้นไม่หยุดหย่อน และคุณก็แทบจะเอาตัวไม่รอดโดยที่คุณไม่ทันรู้ตัวด้วยซ้ำ ",
      "อย่างน้อยนั่นก็เป็นเป้าหมายของเรา เมื่อมีการอัปเกรดต่าง ๆ เพิ่มขึ้นเรื่อย ๆ เราก็มุ่งความสนใจไปที่จังหวะของเกมเพลย์ เราต้องการให้ประสบการณ์การเล่นเกมนั้นตื่นเต้นระทึกใจ แต่ก็ไม่นานจนเกินไป (เราทราบดีว่าผู้เล่นส่วนใหญ่จะเล่นเกมขณะที่เข้าคิวรอแมตช์) แต่ในขณะเดียวกัน เราก็อยากให้เว้นช่องว่างมากพอให้ผู้เล่นสนุกกับการสะสมตัวเลือกการอัปเกรดเพิ่มขึ้นเรื่อย ๆ ด้วย",
      "ผลลัพธ์จากการคำนวณคร่าว ๆ ของเราคือเกมเพลย์ที่รวมแล้วนานประมาณ 12 นาที โดยไม่นับการต่อสู้กับอิมพีเรีย 3 นาทีในตอนจบ ดังนั้นเราจึงพยายามกะจังหวะเกมเพลย์ในช่วง 6 นาทีแรก เราควรจะมอบตัวเลือกการอัปเกรดให้ผู้เล่นบ่อยแค่ไหน? ผู้เล่นจะเริ่มทับซ้อนสกิลได้ตั้งแต่ตอนไหน? แต่ละสกิลควรสร้างความเสียหายเท่าไหร่จึงจะทำให้รู้สึกว่าพอใจแต่ก็ไม่มากจนเกินไป? ",
      "เนื่องจากเราพยายามปรับจังหวะเกมเพลย์เป็นช่วง ๆ การเน้นที่ 6 นาทีแรกหมายความว่า พอมาถึงจุดนี้ ช่วง 6 นาทีสุดท้ายจะเล่นไม่ได้ เราจัดให้มีการทดลองเล่นในช่วง 6 นาทีแรก แล้วบอกให้หยุด [i]ในทางเทคนิคแล้ว[/i]ผู้ทดลองเล่นยังเล่นต่อไปได้ แต่ทุกอย่างหลังจาก 6 นาทีแรกจะเป็นเพียงตัวอย่างชั่วคราวเท่านั้น ที่จริงแล้วคุณจะไม่สามารถเล่นผ่านจุดนั้นได้ (เราถึงกับต้องขอร้องเพื่อนร่วมงานของเราไม่ให้เล่นเกินกันเลยทีเดียว) ",
      "ผลข้างเคียงที่ตลกมากของการทำให้สกิลและอัปเกรดเหล่านี้สนุกขนาดนั้นก็คือ ผู้ทดลองเล่นมักจะไม่สนใจว่าเกมตั้งครึ่งหนึ่งยังเล่นไม่ได้ เราไปนั่งดูเพื่อนร่วมงานคนหนึ่งเล่นเกมครึ่งแรกที่โต๊ะทำงาน พอเล่นถึง 6 นาที: ",
      "เราก็บอกว่า \"ขอบคุณนะ\" \"เริ่มเล่นใหม่ได้มั้ย?\"",
      "เงียบ ",
      "\"เดี๋ยวนะ ที่จริง ผมว่าผมชนะได้\" ",
      "เราก็จะบอกเพื่อนร่วมงานคนนั้นอีกครั้งว่า ช่วง 6 นาทีสุดท้ายเป็นแค่ดินแดนรกร้างไร้ความสมดุลที่เต็มไปด้วยศัตรูที่คัดลอกมาแปะ และตอนนี้ยังเอาชนะไม่ได้ เพื่อนร่วมงานคนนั้นก็จะบอกว่าเข้าใจ แล้วเราก็จะถามว่าตอนไหนที่เล่นดี ตอนไหนที่เล่นแย่ เพื่อนร่วมงานคนนั้นก็จะให้ข้อเสนอแนะดี ๆ มากมายที่ได้จากการเล่นเกมช่วง 6 นาทีแรก จากนั้นเราจะเดินกลับไปที่โต๊ะทำงานของเรา เพื่อนร่วมงานคนนั้นก็จะมองตาม แล้วก็หันกลับไปเริ่มเกมต่อเพื่อพยายามเอาชนะให้ได้อยู่ดี ",
      "เพื่อนร่วมงานบางคนของเราถือว่าเป็นการเสียหน้าอย่างแรงถ้าเล่นไม่ผ่านช่วง 6 นาทีสุดท้ายที่ไม่มีทางเอาชนะได้และสุดแสนไม่ยุติธรรม ดังนั้นในขณะที่เราออกแบบครึ่งแรกของเกม เพื่อนร่วมงานของเราก็ระดมกำลังสมองกันอย่างเต็มที่เพื่อบุกตะลุยในช่วงครึ่งหลังที่ไม่มีทางชนะได้ ",
      "ที่สำคัญคือ: พวกเขาเอาชนะได้จริง ๆ ",
      "สุดท้ายแล้ว เพื่อนร่วมงานเหล่านี้ค้นพบส่วนผสมที่เหมาะเจาะของสกิลที่แข็งแกร่งที่เรายังไม่ได้ปรับแต่ง และสามารถเอาชนะเกมส่วนที่ตั้งใจออกแบบมาให้เอาชนะไม่ได้ (ซึ่งคงทำให้คุณเข้าใจการออกแบบเกมมากขึ้น — แต่อาจทำให้เข้าใจยิ่งขึ้นไปอีกว่าคนประเภทไหนที่เลือกอาชีพเป็นนักออกแบบเกม)",
      "[h3]ความโกลาหลที่ควบคุมได้[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "เมื่อการพัฒนาสิ้นสุดลง เราก็สร้างเกมหลักได้สำเร็จ ทุกอย่างเข้าที่เข้าทางหมด ไม่ว่าจะเป็นสกิลต่าง ๆ การเผชิญหน้ากับมินิบอส และการเผชิญหน้าครั้งสุดท้ายกับราชินีอิมพีเรีย  ณ จุดนี้ เราไม่ได้มองหาจุดบกพร่องร้ายแรงที่ทำให้เล่นเกมไม่ได้อีกต่อไป แต่มองหาแนวทางที่จะปรับแต่ง ปรับสมดุล และขัดเกลาเพื่อทำให้สิ่งที่เรารู้อยู่แล้วว่าใช้ได้ผลดีนั้นมีความโดดเด่นมากขึ้น เราเปิดให้ทดลองเล่นต่อไปเรื่อย ๆ แต่ได้ลดการสอบถามรายละเอียดหลังการเล่นให้น้อยลง และปล่อยให้ทุกคนเล่นเพื่อความสนุกเท่านั้น (และแน่นอนว่า เพื่อให้มีข้อมูลเพิ่มเติม)",
      "แม้ว่าข้อมูลเชิงปริมาณที่มาจากการเล่นทุกครั้งจะมีความสำคัญ แต่ข้อมูลเชิงคุณภาพที่มาจากการทดลองเล่นเกมก็มีความสำคัญไม่น้อยไปกว่ากัน ตัวอย่างหนึ่งที่ลืมไม่ลงคือ การทดลองเล่นครั้งหนึ่งจบลงอย่างยิ่งใหญ่โดยที่ \"ก้อนมวลครวญคราง\" ซึ่งเรียกกันเล่น ๆ ภายในบริษัทว่า \"ลูกชิ้น\" กินพื้นที่หน้าจอไปครึ่งหนึ่งและสวาปามผู้เล่นเข้าไปด้วย ถึงตรงนี้ ผู้ทดลองเล่นคนนั้นก็มีเพื่อนร่วมงานจำนวนหนึ่งของเราคอยเฝ้าดูอยู่ข้างหลัง ทุกคนหัวเราะเยาะกับความโชคร้ายของเขา แน่นอนว่า เขากดปุ่ม \"เล่นอีกครั้ง\" ในพริบตา",
      "เรามั่นใจว่าเรามีเกมที่คุ้มค่ากับการจัดส่ง และได้เปิดโอกาสให้ทดลองเล่นได้ ตั้งแต่ผู้ที่สมัครใจเข้าร่วมทดลองเล่นไปจนถึงเพื่อนร่วมงานที่เราต้อนให้จนมุมและหว่านล้อมให้มาลองเล่นเกม ในเกมต้นแบบรุ่นแรก ๆ ของเรานั้น เราจะได้รับข้อความผ่านทาง Slack ตอน 5 ทุ่มว่า \"เกมนี้เล่นยากเกินไป\" ในช่วงนี้ เรายังคงได้รับข้อความผ่านทาง Slack ตอน 5 ทุ่มอยู่ แต่ก็ได้ข้อความตามหลังมาตอนตี 3 ด้วยว่า \"ไม่เป็นไร ชนะเกมแล้ว\" ",
      "แม้ว่าเกมเกือบจะเสร็จสมบูรณ์แล้ว แต่เราก็ยังคงปรับแต่ง[i]เนสต์ออฟธอร์น[/i]อยู่จนกระทั่งถึงจุดที่เราจัดส่งศึกบัลลังก์วิบัติ บทที่ IV ย้อนกลับไปในตอนต้นของโพสต์นี้ เราได้กล่าวไว้ว่าเราสามารถตัดสินใจได้ดีขึ้นเมื่อเรามีข้อมูลดี ๆ มาช่วยสนับสนุนการตัดสินใจนั้น ตอนนี้เราก็มีบ้างแล้ว นั่นคือ เมื่อผู้ทดลองเล่นภายในบริษัทรู้สึกตื่นเต้นที่จะได้เล่นเกม (และเล่นซ้ำอีก) เราก็มีข้อมูลจำนวนมากที่ช่วยให้ทราบว่าส่วนใดของเกมที่เราสร้างขึ้นนั้นได้รับการตอบรับด้วยดีจากผู้เล่น และไม่มีอะไรที่ทำให้ผู้พัฒนาที่แออัดกันเต็มห้องรู้สึกตื่นเต้นได้มากเท่ากับช่วงเวลาที่เกมเริ่มสร้างความสนุกสนานให้ผู้เล่น เราต้องการสร้างสรรค์มากไปกว่าสิ่งที่ตอนนี้เราทราบแล้วว่าเล่นได้สนุก และต้องการสร้างให้ได้มากที่สุดเท่าที่ทำได้ในเกม ไอเท็มใหม่ สกิลใหม่ ตำนานใหม่ และแม้แต่คลื่นใหม่ ๆ — ทุกครั้งที่เราคิดว่าเราปรับแต่งเกมนี้ได้ลงตัวดีแล้ว ก็จะต้องมีใครสักคนเสนอไอเดียใหม่ \"เพิ่มอีกไอเดีย\" ขึ้นมาเสมอ และเพราะว่าไอเดียนั้นมักจะเป็นไอเดียเจ๋ง ๆ เสมอ เราจึงอดไม่ได้ที่จะลองเพิ่มเข้าไป",
      "ไม่ใช่แค่เพียงไอเดียเกี่ยวกับคุณสมบัติใหม่ ๆ ที่ทยอยเข้ามาอย่างต่อเนื่องเท่านั้น แต่ยิ่งเข้าใกล้วันเปิดตัวมากเท่าไหร่ ไอเดียพวกนั้นก็ยิ่งดีขึ้นเท่านั้น ในช่วงแรก ๆ เมื่อหลาย ๆ อย่างยังคงคลุมเครือไม่เป็นรูปเป็นร่าง เป็นเรื่องยากที่จะแยกแยะระหว่างคุณสมบัติที่อาจมีคุณค่าสูงกับคุณสมบัติที่มีคุณค่าต่ำจริง ๆ แต่พอเหลือเวลาอีกเพียงหนึ่งสัปดาห์ก่อนเปิดตัว ก็เห็นชัดว่าจุดที่ดีที่สุดที่เราควรทุ่มเททรัพยากรและเวลาเพื่อปรับปรุงเกมให้ดียิ่งขึ้นอยู่ตรงไหน",
      "[h3]ออกจากรัง[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "ตอนที่เราปรับแต่ง[i]เนสต์ออฟธอร์น[/i]ในขั้นสุดท้ายนั้น เรามีโอกาสถอยไปตั้งหลักและพิจารณาด้วยมุมมองใหม่ ๆ ปัญหาที่ท้าทายเราคือ การใช้สิ่งที่เราเรียนรู้จากเกมในบทก่อน ๆ เพื่อสร้างด่านบอสระดับมหากาพย์ที่เหมาะสมเพื่อปิดฉากกิจกรรมอันยิ่งใหญ่ เราค่อนข้างพอใจกับสิ่งที่เราทำสำเร็จ โดยเฉพาะอย่างยิ่งเมื่อพิจารณาถึงเวลาที่มีจำกัด เราค้นพบความสนุก",
      "แต่น่าเสียดายที่ชุมชนยังไม่พบกับความสนุกนั้น สิ่งที่เราไม่ได้พิจารณาไว้ก่อนคือ เนื่องจาก[i]เนสต์ออฟธอร์น[/i]เป็นด่านบอส ดังนั้นตามหลักตรรกะแล้วก็ควรจะต้องอยู่ที่... ที่บอสอยู่ นั่นคือในช่วงท้ายเกม ซึ่งหมายความว่า เราต้องอดใจรอด้วยความทุกข์ทรมานอยู่เงียบ ๆ อย่างอย่างน้อย 1 หรือ 2 วันจนกว่าผู้เล่น Dota ชั้นเซียนจะฝ่าฟันพ้นบทที่ IV ด้วยความเร็วเหนือมนุษย์ แล้วรอดูว่าผู้เล่นอื่น ๆ จะมีโอกาสได้เล่นเมื่อไหร่ ",
      "แต่ปรากฏว่าเราไม่ต้องรอนาน เราคิดว่าเรามีเวลาอย่างน้อย 1 หรือ 2 วันก่อนที่ผู้เล่นสักคนจะบุกไปถึงท้องพระโรงของราชินีอิมพีเรีย แต่กลับกลายเป็นว่าเราประเมินความเร็วที่ผู้เล่น Dota ตะลุยผ่านเนื้อหาในเกมไว้ต่ำเกินไป แค่เพียง 16 ชั่วโมงหลังจากเปิดตัว — ใช่แล้ว \"[i]ชั่วโมง[/i]\" — ผู้เล่นชั้นเซียนกลุ่มแรกตะลุยฝ่าด่านในบทสุดท้ายทั้งบทไปได้เรียบร้อย และมีโอกาสสัมผัสกับ[i]เนสต์ออฟธอร์น[/i]เป็นครั้งแรก",
      "และในที่สุด ผู้เล่นอื่น ๆ ก็ตามไปทันเช่นกัน ตอนที่เขียนบทความนี้ มีการเล่น[i]เนสต์ออฟธอร์น[/i]ไปแล้วเกือบร้อยล้านครั้ง (หากคุณยังตามเทรนด์นี้ไม่ทัน หรือเพียงแค่อยากลองเล่นอีกสักครั้ง ก็ยังคงมีให้เล่นได้จาก \"จารึกศึกบัลลังก์วิบัติ\" ในไคลเอนต์)",
      "[h3]อ้าแขนรับความไม่แน่นอน[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "เราหวังว่าการดูเบื้องหลังของทีม Dota ในการสร้างมินิเกมนี้ได้ช่วยให้คุณเข้าใจแนวคิดเกี่ยวกับกระบวนการของเราดีขึ้น — และไม่ใช่แค่ทำให้คุณจ้องบล็อกโพสต์นี้ด้วยความสยดสยองกับการรู้ว่าเราพัฒนาทุกอย่างขึ้นมาแบบด้นสด แต่จริง ๆ แล้ว เราหวังว่าสิ่งนี้จะช่วยพิสูจน์ว่าการออกแบบเกมไม่ใช่งานศิลปะที่เพ้อฝันของนักออกแบบอัจฉริยะที่ชี้นิ้ววนไปมาในห้องมืด แต่เป็นกระบวนการทดลองวนซ้ำ ๆ แบบลองผิดลองถูกที่ขับเคลื่อนโดยข้อมูล ความวิตกกังวล การทดลองเล่น ความล้มเหลว การทดลองเล่น ความล้มเหลวซ้ำ ๆ และการทดลองเล่นซ้ำ ๆ",
      "การพัฒนาเกมเจริญเติบโตได้ดีจากการทำวนซ้ำ ๆ — เริ่มต้นด้วย \"ไม่มีไอเดียอะไรเลยแฮะ\" จนค่อย ๆ กลายเป็น \"ได้ไอเดียบางอย่างล่ะ\" โดยการมองไปที่ไอเดียในอดีตที่ทำแล้วได้ผล จากนั้นมันก็กลายเป็นต้นแบบสุดห่วยที่ไม่มีใครอยากเล่น แต่ยังไงซะเราก็สร้างมันขึ้นมาอยู่ดี แล้วเราก็เฝ้าดูผู้เล่นที่รู้สึกไม่สนุกกับการเล่นเกมนั้น ก่อนที่จะไปแก้ไขส่วนที่ไม่สนุกทั้งหมด จนกระทั่งในที่สุดเราจึงเห็นว่าผู้เล่นรู้สึกสนุกกับเกม จากนั้นเราก็จะขัดเกลาเกมซ้ำแล้วซ้ำอีก พร้อมทั้งเงยหน้าขึ้นดูปฏิทินที่มีกำหนดการจัดส่งแล้วร้องไห้น้ำตาซึม หลักปรัชญาของ Valve คือการอ้าแขนยอมรับต่อความไม่แน่นอนและยอมให้ข้อมูลเป็นตัวกำหนดการพัฒนาเสมอ ซึ่งหมายความว่าเราอาจไม่ได้จัดส่งสินค้าได้ตรงตามเวลาเสมอไป แต่เราคิดว่าคุณจะต้องชอบมันเมื่อมันพร้อมแล้วจริง ๆ"
    ],
    "commentcount": 2,
    "tags": [],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091367,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}