{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Linjoilla – Piikkipesä",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Linjoilla – Piikkipesä",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[i]Tervetuloa takaisin Linjoilla-blogisarjaan, jossa kehitystiimiläiset kertovat siitä, millaisia haasteita, bugeja ja välillä myös onnenkantamoisia tulee eteen Dotan kaltaisessa, ainutlaatuisessa pelissä.[/i]",
      "Kruununkaappaus oli kooltaan niin suuri, että se mahdollisti monenlaiset kokeilut: strategiakartat, polveilevan tarinan, sankarien teemapoletit, minipelit, sarjakuvat, pikselitaiteen ja monet muut jo kauan hautuneet ideat.",
      "Uskalsimme ottaa riskin ja kokeilla kaikenlaisia ideoita, koska meillä Valvella on vapaus toistaa asioita mielin määrin. Voimme kerätä pelaajadataa, ottaa sen suomat haasteet vastaan ja muuttaa mielemme. Emme aina tiedä, mitä tuleman pitää, ennen kuin pelaajat astuvat kuvaan, joten pyrimme pääsemään siihen vaiheeseen mahdollisimman pian.",
      "Tämä lähestymistapa määrää myös sen, milloin asioista päätetään: yleensä mahdollisimman myöhään, kun tarjolla on parasta (ja välillä ainoata) dataa. Joka vaiheessa ratkaisevassa asemassa on pelaajien kokemus. Sen avulla keskitytään siihen, mikä herättää vastakaikua, ja unohdetaan puolestaan se, mikä ei toimi.",
      "Tässä [i]Linjoilla[/i]-blogissa keskitytään [i]Piikkipesään[/i], joka julkaistiin osaksi Kruununkaappausta varsin myöhään. Se on saagan neljäs osa ja sankareiden ja kuningatar Imperian välinen viimeinen koitos. Se toimii myös esimerkkinä siitä, miten pelitestaus ja sen tarjoama data vaikuttavat päätöksentekoon.",
      "[h3]Imperiaa kohti[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Ensimmäisen osan ainoa minipeli oli vaatimaton kalastuspeli, jossa oli tarkoitus hankkia Tidehunterille aamupalaa. Ensimmäinen osa koostui pitkälti ympäri karttaa ripotelluista satunnaisista ideoista, joilla testattiin sitä, mihin pelaajat tarttuisivat. Ensimmäisen osan pelaajadata kannusti tekemään seuraavissa osissa rohkeita ratkaisuja. Osassa III tarjolla oli monta peliä: [i]Sleet Fighter[/i], Tuskin lempikapakkaan sijoittuva kahakkapeli; [i]Traakkishakki[/i], yhdistelypeli Winter Wyverniä vastaan sekä [i]Zaug's Lair[/i], jossa Vengeful Spirit ja julma lohikäärme taistelivat Jääraunioiden luolastoissa. ",
      "Viimeisen osan lähestyessä tiesimme jo varsin hyvin, mikä toimi ja mikä ei. Mitä dataa keräsimme? Sekä konkreettista, kuten minipelien pelikertojen määrää ja pelitiheyttä, että enemmän tulkinnanvaraista, kuten pelaajien lähettämää palautetta ja verkossa käytyjä keskusteluja. Selkeää kieltä puhuva data rohkaisi hoitamaan homman kotiin tajunnanräjäyttävällä finaalilla, jossa käydään eeppinen pomotaistelu ilkeää kuningatar Imperiaa vastaan.",
      "Pomotaistelun varsinaisen idean keksiminen ei ollut tietenkään mikään helppo homma. Tiesimme, että sen täytyi tarjota pelaajien odottama suuren luokan spektaakkeli, mutta myös paljon vaihtelua ja uudelleenpelattavuutta, jotta siihen ei kyllästyisi ensimmäisen pelikerran jälkeen. Ja koska kyseessä oli Dota-otteluiden välillä pelattava minipeli, sen täytyi olla lyhyt, mutta intensiivinen. Kuin maukas välipala, ei kokonainen ateria.",
      "Tasapainon löytämiseksi tarvittiin lajityyppi, joka yhdistäisi [i]Sleet Fighterin[/i] intensiivisyyden [i]Traakkishakin[/i] uudelleenpelattavuuteen. Kyseessä oli kuitenkin Vengeful Spiritin, Skywrath Magen ja uuden tulokkaan, Kezin, neliosaisen tarinan kohokohta: Imperian linnan valtaus. Haluttiin, että pelaajat kokisivat olevansa voimattomia edetessään kohti kuningatarta.",
      "[h3]Suunnitelma hautuu[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Yksi hetkellisesti hyvältä vaikuttavista ideoista oli vuoropohjainen, japanilaisten roolipelien kaltainen taistelu. Se todettiin kuitenkin äkkiä huonoksi. Piti keksiä peli, joka veisi pelaajat saman tien myrskyn silmään: jokin lyhyt, intensiivinen ja tarpeeksi hauska pelattavaksi seuraavaa peliä odotellessa.",
      "Sellaista tarjoaisi parhaiten selviytymispeli. Loputtomien vihollisaaltojen \"käänteinen luotihelvetti\" oli täydellinen keino toteuttaa eeppiseltä tuntuva kovan luokan pomotaistelu. Pelaaja raivaisi tiensä vihollisjoukkojen läpi ja suunnittelisi parhaimman kykykokoonpanon valmistautuessaan lopulliseen välienselvittelyyn Imperiaa vastaan. Dotan esineet ja kyvyt olisivat myös helposti tuotavissa osaksi taistelua, joten pelaajilla olisi jo jonkin sortin käsitys pelin toiminnasta.",
      "Koska pelikerran piti olla riittävän lyhyt, pelistä piti tehdä sellainen, että siihen oli helppo tarttua myöhemmin uudelleen. Selviytymispelit tarjosivat myös paljon vaihtelua, sillä jokainen pelikerta olisi täysin erilainen. Pelaajat eivät aina saaneet samoja esineitä tai kohdanneet samoja tapahtumia täsmälleen samassa järjestyksessä. Tällainen vaihtelu kannustaisi yrittämään yhä uudelleen. Peli alkaisi aina alusta tavalla, joka tuntuisi haastavalta, muttei ylitsepääsemättömältä tai turhauttavalta. Ei ollut tarkoituksena, että pelaajat selvittäisivät pelin välittömästi, mutta toisaalta häviön ei haluttu aiheuttavan täyttä lannistumista. ",
      "[h3]Varhaiset prototyypit[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Yksi [i]Piikkipesän[/i] varhaisimmista prototyypeistä sai alkunsa samoista peruselementeistä, joita löytyi aikanaan pelaajille toimitetusta versiosta. Ensin valittiin yksi kolmesta sankarista, kohdattiin viholliset aaltoina ja selvittiin lopulliseen kamppailuun Imperiaa vastaan. Näistä varhaisista kokeiluista puuttui kuitenkin hauskuus. Joskus sankari kolusi suurimmaksi osaksi tyhjää karttaa ja törmäsi siellä täällä luurankoihin. Muulloin viholliset kävivät kimppuun sellaisella ylivoimalla, ettei voittaminen ollut mahdollista (tai aluksi niin luultiin – lisää tästä hieman myöhemmin). Oltiin varmoja, että pohjimmiltaan kyseessä on hauska peli. Tosin testaajia piti kiduttaa huonoilla versioilla ennen kuin hauskuus saatiin kaivettua esiin.",
      "Jokainen Valven työntekijä on koekaniini, joten meillä on tapana antaa versio pelistä jollekulle testattavaksi. Näin saamme selville, toimiiko jokin ratkaisu (vai onko se ihan susi). Aivoriihtä voi venyttää vaikka kuinka pitkäksi, mutta ennen kuin joku kokeilee peliä, ei voi tietää, ovatko päätökset menneet nappiin.",
      "Ensi alkuun testaajien oli vaikea selvitä hengissä ensimmäiset 3–6 minuuttia. Yleensä tämä on merkki siitä, että pelistä puuttuu tasapaino tai sen sääntöjä ei selitetä pelaajalle tarpeeksi hyvin. Pelikokemusta käytiin läpi testaajien kanssa ja heitä pyydettiin jakamaan kokemuksiaan. Oliko pelissä hetkiä, jolloin he eivät tienneet, mitä tehdä seuraavaksi? Tai tilanteita, joissa peli muuttui ylivoimaisen vaikeaksi tai oli vain lopulta tylsä? Sen jälkeen palattiin kehitystyön pariin ja pyydettiin jotakuta muuta kokeilemaan peliä. Vähitellen asiat alkoivat lutviutua.",
      "Sitten se tapahtui.",
      "Testaaja kertoi ensimmäisen tappiollisen pelinsä kokemuksesta ja kysyi, voisiko yrittää uudestaan.",
      "Tämä oli uutta – ja hyvä merkki. Piikkipesä ei edelleenkään ollut voiton puolella, vaan testaajat tarvitsivat yleensä ainakin kolme pelikertaa prototyypin läpäisemiseen. Mutta oli mukava nähdä, etteivät työkaverit pelanneet surkeaa prototyyppiä pakosta, vaan koska he halusivat kokeilla sitä toisenkin kerran.  Oli nähtävissä pienen pientä kiinnostusta: Pelaajat alkoivat jopa pitää pelistä. Se oli positiivista.",
      "Todellinen älynväläys oli kuitenkin vielä edessä.",
      "[h3]Sankarikokoonpanot[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Pelin aikaisista versioista puuttunut selviytymisteemaan sopiva keskeinen piirre oli jatkuva paine. Alkujaan pelaajat pääsivät tason alussa käymään sadan luurangon kimppuun. Kun niistä kaikista oli selvitty, eteen vyöryi seuraava aalto edellistä vaikeampia pahiksia. Niinpä testaajat kyllästyivät nopeasti. Kun he saivat selville, että ainoana tavoitteena oli mätkiä vihulaisia loputtomiin, peli alkoi tuntua työnteolta. Ainoana palkintona niiden tehokkaammasta tappamisesta oli päästä pätkimään entistä vaikeampia vastustajia. ",
      "Lopulta huomattiin, että sadan luurangon ilmestyminen sankarin eteen vaati ajastinta. Lisäksi luurankoja piti ilmestyä koko ajan lisää riippumatta siitä, montako pelaaja oli listinyt. Kun ajastimesta loppui aika, pelaajan selvitettäväksi ilmestyi uusi aalto vihollisia uudella ajastimella. Jännitys pysyi yllä ja pelaaja halusi jatkaa. ",
      "Mutta kaiken a ja o oli se, että [i]tavoitteet[/i] muuttuivat. Kun sankari hakkasi hupenevaa määrää luurankoja, tavoitteena oli päästä eroon niistä kaikista. Mutta jos luurankojen määrä [i]ei vähentynytkään tappamisesta huolimatta[/i], pelaajat ymmärsivät pian yskän: niistä eroon pääseminen ei ollutkaan pelin tavoite. ",
      "Sen sijaan pelaajat keskittyivät siihen, mitä luurankojen listimisestä [i]jäi käteen[/i], nimittäin kykyjä ja päivityksiä. Tarkoitus ei ollut tappaa kaikkia luurankoja, vaan kysymys kuului, montako pystyi tappamaan mahdollisimman nopeasti, jotta sai mahdollisimman [i]mahtavat voimat[/i]. Pakkotyön sijaan vihollisaaltojen peittoaminen alkoi tuntua jättipotin jahtaamiselta: tappo tapolta kohti täydellistä hahmoa. ",
      "Koska seuraavaan vaiheeseen eteneminen ei enää riippunut kaiken aiemmin tielle osuneen tappamisesta, pelissä oli nyt yhteinen kello. Sen ansiosta pelaajilla oli nyt sama rytmi – yhteinen kieli vaikeustason noustessa. Kun yksi pelaaja sanoi, ettei selviydy neljännellä minuutilla kimppuun käyneiden hämähäkkien aallosta, kaikki tiesivät heti, mistä oli kyse (hämähäkeille ei heru sympatiaa).",
      "Hauskuus oli vihdoin saatu kaivettua esiin. Pieni muutos tavoitteessa auttoi selvittämään, mistä pelaajat pelissä pitivät ja miksi. Se sai alulle myös ryöpyn uusia ideoita: tehokkaampia päivityksiä, hullumpia kykyjä ja täysin uusia mahdollisuuksia. Tämän ansiosta testaajat pystyivät yhdellä läpipeluukerralla tekemään sankareihin isoja, toisistaan eronneita rukkauksia. Samalla pelitestistä tuli kiinnostavampi, saatu palaute oli parempaa. Saatiin myös parempia ehdotuksia seuraavaa versiota ajatellen.",
      "Joskus palautetta piti pyytää useamman kerran. Toisinaan pelitestin jälkeen oli selvää, etteivät työkaverit enää halunneet jakaa tuntemuksiaan. Sen sijaan he halusivat puhua toisilleen pelaamistaan versioista ja kinastella niiden välisestä paremmuudesta. ",
      "Versioiden määrän kasvaessa alettiin miettiä, josko palapelistä oli jäänyt puuttumaan iso palanen. Entä jos sankarit olisivat yhtä uniikkeja kuin kyvyt? Varhaisissa prototyypeissä peli oli aloituskykyjä huomioon ottamatta pitkälti saman toistoa, valitsipa pelaaja minkä sankarin hyvänsä. Tässä vaiheessa hahmoja säädettiin erilaisiksi. Yhdestä tehtiin vahvempi, toisesta nopeampi, kun taas kolmannen taiat aiheuttivat enemmän vahinkoa. Näin hahmot alkoivat entistä enemmän erota toisistaan. Sankarin valinta mahdollisti myös tietynlaiset kykyhaarat, jolloin sankareista pystyi kehittämään mitä erilaisempia. (Ja koska päivityksiin liittyy aina hieman onnea, jokaisella vaihtoehdolla tuntui olevan korkeat panokset.)",
      "[h3]Kuusi ensimmäistä minuuttia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Miettiessäsi millä päivityshaaralla pääset Imperian luo, vaikeustaso nousee hitaasti. Jossain vaiheessa huomaat, että vihollisaallot ovat muuttuneet tappaviksi, vauhti on armotonta ja pysyt nippa nappa hengissä. ",
      "Se oli ainakin tavoite. Päivitysten myötä siirryttiin pelin rytmiin. Kokemuksen haluttiin olevan intensiivinen, mutta ei liian pitkä. (Oli tiedossa, että useimmat pelaajat pelaisivat jonottaessaan otteluun.) Toisaalta pelaajille haluttiin jättää riittävästi tilaa, jotta he voisivat nauttia päivitysvalintojensa kasautumisesta.",
      "Summittaisten laskelmien mukaan peliaikaa olisi noin 12 minuuttia – lukuun ottamatta loppuvaiheen kolmen minuutin taistelua Imperiaa vastaan. Oli siis tarpeen säätää ensimmäisten kuuden peliminuutin rytmiä. Kuinka usein pelaajalle annettaisiin mahdollisuus päivittämiseen? Kuinka aikaisin he voisivat aloittaa kykyjen kasaamisen? Kuinka paljon vahinkoa kunkin kyvyn tulisi tehdä, jotta se tuottaisi tyydytystä, muttei olisi ylivoimainen? ",
      "Koska peliä hiottiin osissa, ensimmäisiin kuuteen minuuttiin keskittyminen tarkoitti, ettei viimeistä kuutta minuuttia oikeastaan voinut pelata. Testaajat joutuivat lopettamaan pelin ensimmäisten kuuden minuutin jälkeen. [i]Periaatteessa[/i] peliä voi jatkaa, mutta kuuden minuutin jälkeen kaikki oli väliaikaista materiaalia. Ei ollut tarkoitus pelata sen pidemmälle. (Työkavereita piti pyytää lopettamaan.) ",
      "Kykyjen ja päivitysten hauskuudessa oli se sivuvaikutus, etteivät testaajat välittäneet siitä, ettei pelin toista puolikasta voinut edes pelata. Istuimme työkaverin vieressä seuraamassa pelin ensimmäisen puoliskon läpäisemistä. Kuuden minuutin kohdalla... ",
      "Me kiitimme ja pyysimme aloittamaan alusta.",
      "Seurasi hetken hiljaisuus. ",
      "Kunnes hän päätti pelata pelin loppuun saakka. ",
      "Muistutimme, että viimeiset kuusi minuuttia oli ankeaa, toistuvien vihollisten joutomaata, jota ei vielä siinä vaiheessa voinut läpäistä. He sanoivat ymmärtävänsä. Kysyimme heiltä hyvistä ja huonoista puolista. He antoivat paljon hyvää palautetta kuuden ensimmäisen minuutin perusteella. Ja sitten palasimme suunnittelupöydän ääreen, he katsoivat peräämme, jatkoivat peliä ja yrittivät läpäistä sen joka tapauksessa. ",
      "Jotkut työkaverit ottivat henkilökohtaisena loukkauksena sen, etteivät he selvinneet viimeisistä raivokkaan epäreiluista, kirjaimellisesti ylitsepääsemättömistä kuudesta minuutista. Samalla kun suunnittelimme pelin ensimmäistä puolikasta, he puhalsivat yhteen hiileen ja yrittivät läpäistä mahdottoman toisen puolikkaan. ",
      "Mutta he läpäisivät sen. ",
      "He keksivät tarkan yhdistelmän kykyjä, joita ei vielä ollut hienosäädetty, ja läpäisivät pelin puolikkaan, jota ei ollut tarkoitus läpäistä. (Tämä kertoo paljon pelikehityksestä. Ja siitä, millaisia ​​ihmisiä siihen ryhtyy.)",
      "[h3]Kaaos hallintaan[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Kehityksen loppuun mennessä pelin ydin oli valmis. Kyvyt, minipomot ja viimeinen välienselvittely kuningatar Imperian kanssa olivat kaikki paikallaan.  Tässä vaiheessa ei enää etsitty peliä mullistavia ongelmia, vaan tapoja säätää, tasapainottaa ja hioa sitä, minkä jo tiedettiin toimivan. Pelin testausta jatkettiin, mutta pienemmällä määrällä perusteellisia jälkikäteen tehtäviä haastatteluja, ja annettiin käyttäjien pelata huvin vuoksi (ja tietenkin suuremman datamäärän toivossa).",
      "Vaikka jokaisesta pelikerrasta saatu kvantitatiivinen data oli tärkeää, pelitesteistä saatu kvalitatiivinen data oli vähintään yhtä tärkeää. Yhdessä mieleenpainuvassa esimerkissä pelitesti päättyi eeppisesti (sisäpiirivitsinä Lihapullaksi kutsuttuun) Valitusvyöryyn, joka valtasi puolet ruudusta ja ahmi pelaajan. Tässä vaiheessa pelin testaajalla oli takanaan joukko työtovereita, jotka kaikki nauroivat hänen epäonnelleen. Tietenkin hän painoi heti Pelaa uudelleen -painiketta.",
      "Oltiin varmoja, että tämä oli julkaisemisen arvoista, ja pelitestausmahdollisuutta laajennettiin vapaaehtoisista käytännössä kaikkiin kynnelle kykeneviin työntekijöihin. Varhaisimpien prototyyppien aikaan saimme kello 23 Slack-viestin, jossa luki, että peli on liian vaikea. Myöhemmin, kello 3 aamulla, saapui seuraava viesti: \"Ei hätää, pelasin sen läpi.\" ",
      "Vaikka peli oli enimmäkseen valmis, [i]Piikkipesää[/i] työstettiin edelleen Kruununkaappauksen neljänteen osaan asti. Kuten blogin alussa todettiin, on mahdollista tehdä parempia päätöksiä, kun niiden tueksi on tarjolla kunnon dataa. Nyt sitä oli: koska sisäiset pelitestaajat olivat yhtä innoissaan pelin pelaamisesta (ja uudelleenpelaamisesta), oli olemassa paljon dataa, jonka avulla selvisi, mitkä osat toimivat. Eikä mikään saa huoneellista pelikehittäjiä innostumaan niin kuin se hetki, jolloin pelissä alkaa olla hauskaa. Haluttiin tehdä enemmän niitä asioita, joiden tiedettiin toimivan. Uusia esineitä, kykyjä, tarinaa ja jopa aaltoja – joka kerta kun luultiin pelin olevan valmis, joku keksi vielä yhden idean. Ja koska se oli yleensä aika loistava idea, sitä oli kokeiltava.",
      "Kyse ei ollut vain siitä, että ideoita uusia ominaisuuksia varten tuli yhtenä ryöppynä. Niistä tuli myös parempia, mitä lähemmäs julkaisua päästiin. Alkuaikoina oli vaikea erottaa potentiaalisia huippuluokan ominaisuuksia huonosti toimivista. Viikossa parhaat kohteet resurssien ja ajan panostamiseen pelin parantamiseksi olivat ilmeiset.",
      "[h3]Pesän hylkääminen[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Kun [i]Piikkipesää[/i] viimeisteltiin, siihen otettiin etäisyyttä ja sitä katsottiin uusin silmin. Haasteena oli ollut käyttää aiemmista osista opittuja asioita, jotta voitiin kehittää sopivan eeppinen pomotaistelu massiivisen tapahtuman loppunäytökseen. Oltiin melko tyytyväisiä aikaansaannokseen, etenkin aikarajoitukset huomioon ottaen. Tämä oli hauskaa!",
      "Valitettavasti yhteisö ei ollut vielä samaa mieltä. Oli unohdettu, että koska [i]Piikkipesä[/i] oli pomotaistelu, sen piti loogisesti sijaita siellä, mistä pomo löytyy pelin lopussa. Tämä tarkoitti ainakin päivän tai kaksi hiljaista kidutusta, kun Dotan himopelaajat vänkäsivät itsensä neljännen luvun läpi epäinhimillisellä nopeudella, ja odotusta, milloin pelaajat vihdoin pääsisivät pelaamaan sitä. ",
      "Kävi ilmi, ettei tarvinnut odottaa kauaa. Luultiin, että kestäisi vähintään päivän tai kaksi ennen kuin joku pääsisi kuningatar Imperian valtaistuimelle. Olimme suuresti aliarvioineet sitä, kuinka nopeasti Dota-pelaajat pystyisivät kahlaamaan sisällön läpi. Vain kuusitoista [i]tuntia[/i] julkaisun jälkeen ensimmäiset pelaajat olivat jo taistelleet tiensä koko viimeisen näytöksen läpi ja saivat esimakua [i]Piikkipesästä[/i].",
      "Ja kaikki muut tulivat perässä. Tämän blogin kirjoitushetkellä [i]Piikkipesää[/i] on pelattu lähes sata miljoonaa kertaa. (Jos et ole vielä pelannut sitä tai haluat kokeilla sitä vielä kerran, se on edelleen pelattavissa Kruununkaappauksen arkistossa.)",
      "[h3]Epävarmuuden hyödyntäminen[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Toivon mukaan kurkistus kulissien taakse Dota-tiimin minipelin työstövaiheisiin antoi paremman kuvan prosessista ja auttoi ymmärtämään tapaa, jolla tarina etenee pelin kuluessa. Toivottavasti tämä todistaa, ettei pelin suunnittelu ole pelinerojen pimeissä huoneissa luomaa mystistä taidetta, vaan toistuva yrityksistä ja erehdyksistä koostuva prosessi, jota ohjaa data, ahdistus, testaus, epäonnistuminen, testaus uudelleen – ja vielä lisää epäonnistumista ja testausta.",
      "Pelikehittäminen kukoistaa toistamisen avulla – se alkaa tyhjästä, kehittyy hitaasti jonkinlaiseksi ideaksi tarkastelemalla aiemmin toimineita ideoita. Sitten siitä tulee huono prototyyppi, jota kukaan ei halua pelata, mutta periksi ei anneta. Sen jälkeen huomataan, ettei pelaajilla ole hauskaa pelatessaan, ja ryhdytään korjaamaan pelin vähemmän hauskoja kohtia, kunnes pelaajilla lopulta on hauskaa. Peliä hiotaan ja kiillotetaan ja yritetään pysyä julkaisuaikataulussa. Joskus se ei onnistu, vaan meinaa tulla itku. Valven kulttuuri on aina ollut epävarmuuden hyväksyminen ja yhteisön kuunteleminen. Se tarkoittaa, että julkaisu ei aina tapahdu ajoissa. Mutta tulet pitämään valmiista peleistä."
    ],
    "commentcount": 4,
    "tags": [],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091375,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}