{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Між лініями: «Тернове Гніздо»",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Між лініями: «Тернове Гніздо»",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]Вітаємо з поверненням до серії дописів блогу «Між лініями», де члени нашої команди розробників розповідають про виклики, виправлення помилок та несподівано щасливі випадки, які трапляються під час розробки такої унікальної гри, як Dota.[/i]",
      "Під час такої масштабної події, як Коронопад, нам довелося чимало експериментувати, реалізовуючи ідеї, які нас цікавили роками: мапи світу, розгалужені сюжетні лінії, пов’язані з героями жетони, мініігри, комікси, піксельні зображення і не лише.",
      "А спонукала нас із впевненістю брати на себе такі ризики наша свобода вносити зміни (чим ми постійно користуємось у Valve): ми збираємо дані про реальних гравців, щоби вони кидали виклик нашим припущенням, й навіть змінюємо свою думку. Ми часто кажемо, що не повністю розуміємо, що створюємо, доки не побачимо, як гравці взаємодіють із нашим творінням, тому намагаємось досягати цього етапу якнайшвидше.",
      "Такий підхід також впливає на те, коли ми приймаємо рішення — зазвичай якнайпізніше в процесі розробки, коли маємо найкращі (а іноді єдині) дані. На кожному етапі ми покладаємось на реальний досвід гравців — це допомагає нам зосередитися на тому, що викликає позитивні відгуки, і полишити роботу над тим, що викликає негативну реакцію.",
      "У цьому дописі блогу [i]«Між лініями»[/i] ми розглянемо розробку того, що з’явилося відносно пізно в Коронопаді, — бій із босом між нашими героями та королевою Імперією в мінігрі [i]«Тернове Гніздо»[/i] наприкінці дії IV. На цьому конкретному прикладі ми також продемонструємо, як тестування та згенеровані ним дані допомагають нам приймати рішення.",
      "[h3]Шлях до Імперії[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Скромна рибальська мінігра, в якій Хвилеріз перевіряв ваші навички риболовлі (сподіваючись, що ви зловите для нього сніданок), була першою (і єдиною) мінігрою в дії I. Власне, в цій дії було реалізовано багато таких маленьких ідей, розкиданих на мапі — ми хотіли побачити, з чим саме будуть взаємодіяти гравці. Дані про гравців з дії I заохотили нас із впевненістю експериментувати ще більше в дії II, а для дії III ми створили цілі три мінігри: [i]«Крижаний боєць»[/i] (бої в улюбленій таверні Бивня); [i]«Драконячі шахи»[/i] (гра жанру «три в ряд» проти Зимової Віверни); і [i]«Лігво Зауґа»[/i] (гра жанру «перестріляти всіх», де Мстива Душа зійшлася у двобої зі злим драконом, пролітаючи крізь хитросплетену печерну систему Льодоверті). ",
      "На момент початку роботи над дією IV ми вже мали чітке уявлення про те, що працює, а що ні. На які дані ми спиралися? На всі — від більш конкретних (як-от кількість гравців у кожній мінігрі та частота запуску цих мініігор) до більш описових (як-от відгуки користувачів та обговорення в Інтернеті). Ця ясність дозволила нам із впевненістю завершити подію вибуховим фіналом — епічним боєм із босом проти лихої королеви Імперії.",
      "Звичайно, визначити нюанси цієї мінігри було непросто. Ми знали, що мали створити запекле видовище, на яке й очікували гравці, але водночас із достатнім рівнем різноманітності й перепроходження для підтримання зацікавленості. А оскільки ця мінігра створювалася так, щоб у неї можна було грати під час перебування в черзі на матч, вона повинна була бути інтенсивною, але короткою. Інакше кажучи, це мала бути смачна закуска, а не головна страва.",
      "Для ідеального балансу нам потрібен був жанр, який би поєднував високу якість [i]«Крижаного бійця»[/i] з перепроходженням [i]«Драконячих шахів»[/i]. Зрештою, штурм замку Імперії союзом Мстивої Душі, Небогнівного Мага й Боривітра (найновішого героя «великої трійки» з історії Коронопаду в чотирьох діях) мав бути епічним. Ми хотіли, щоби гравець відчував, ніби йому протистоять набагато сильніші сили на шляху до королеви.",
      "[h3]Розробка плану[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Ми недовго розглядали варіант покрокової битви в стилі японських рольових ігор, та доволі швидко зрозуміли, що він не підходить. Нам потрібно було щось таке, що б швидко занурило гравців у вир бою — щось коротке, напружене та достатньо веселе для гри між матчами.",
      "Ось тут ми й згадали про жанр виживання. «Обернене пекло з куль» з нескінченними хвилями ворогів — ось що було ідеальним форматом для епічного й запеклого бою з босом. Гравець пробирається крізь орди ворогів, стратегічно підвищуючи рівень здібностей на шляху до фінальної сутички з Імперією. Також цей формат дозволяє легко додати предмети та здібності з Dota 2, що допомагає гравцям розібратися в механіці мінігри.",
      "Оскільки ми хотіли зробити мінігру доволі короткою, перепроходження було іншою важливою частиною головоломки. Жанр виживання має чималий елемент різноманітності, оскільки кожне проходження унікальне. Гравці не завжди отримують ті предмети або переживають ті події, на які очікують, і не завжди в тому порядку, в якому хочуть. Різноманітність спонукає продовжувати грати, починаючи із самого початку, і так, що гра здається складною, але й не викликає почуття безвихідності чи розчарування. Ми не хотіли зробити так, аби ви могли перемогти з першої спроби, але й не хотіли, аби ви здалися після першої поразки. ",
      "[h3]Перші прототипи[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Найперші прототипи [i]«Тернового Гнізда»[/i] починалися з тих самих основних елементів, що й фінальна версія. Гравець вибирав одного з трьох героїв, долав ворогів хвиля за хвилею та врешті-решт діставався до Імперії. Та цим раннім спробам чогось бракувало, а саме — хоч натяку на веселощі. Іноді герой блукав майже порожньою мапою, час від часу наштовхуючись на скелет. А були випадки, коли хвилі ворогів були настільки нездоланними, що перемогти було просто неможливо (ну або так нам здавалося… докладніше про це пізніше). Та ми знали, що десь у скирті сіна є ця голка веселощів. Нам просто треба було й далі мучити наших тестувальників поганими збірками, доки не знайдемо ту голку.",
      "Кожен співробітник Valve є піддослідним кроликом, і ми можемо з’ясувати, чи щось працює (або [i]не[/i] працює, що теж імовірно), видавши такому кролику збірку на перевірку. Ми можемо безліч часу витрачати на обмірковування, та поки хтось не сяде і не зіграє, ми насправді не знатимемо, чи були правильними наші рішення.",
      "Спочатку тестувальники ледь переживали перші 3—6 хвилин. Зазвичай це є ознакою того, що гра або незбалансована, або її правила пояснені недостатньо добре. Ми вислуховували всі їхні розповіді про ігровий досвід, зокрема в які моменти вони не знали, що робити далі, коли саме гра ставала настільки важкою, що проходження здавалося неможливим, або навіть моменти, коли було нудно грати. Після цього ми поверталися за свої робочі місця, вносили зміни та видавали чергову збірку новому тестувальнику. Поступово ми починали бачити прогрес.",
      "Аж раптом щось сталося.",
      "Розповівши про свою першу спробу, тестувальник, який щойно програв, запитав у нас, чи можна спробувати ще раз.",
      "Такий відгук був новим. І він підбадьорював. «Тернове Гніздо» все ще було далеким від ідеалу (нашим тестувальникам зазвичай потрібно було щонайменше три спроби, аби розібратися, як можна пройти гру), але нам принаймні було приємно, що хоч одного разу не доводилося примушували колегу грати в наш поганий прототип — колега сам попросився зіграти в наш поганий прототип ще раз.  Це була крихітна іскра зацікавленості без думки: «Я просто ненавиджу це». І ми з радістю прийняли такий відгук.",
      "Та справжнє відкриття було попереду.",
      "[h3]Збірки героїв[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Нашим раннім версіям бракувало одного ключового елемента жанру виживання — постійного тиску. Спочатку ми просто генерували хвилю зі ста скелетів, дозволяючи герою прорубувати шлях крізь них. Щойно шлях було прорубано й жодного скелета не лишалося, генерувалася наступна хвиля цілей для прорубування на вищому рівні складності. І тестувальникам це швидко набридало. Щойно ставало очевидно, що єдиною метою було нескінченне прорубування крізь ворогів, гра перетворювалася на рутину. Єдиною нагородою за ефективніше проходження крізь одну хвилю було швидше наближення наступної, важчої хвилі… Та хіба це нагорода?",
      "Зрештою, ми зрозуміли, що в момент генерування сотні скелетів, яких герой починає рубати, потрібно запустити таймер і продовжувати генерувати скелетів незалежно від кількості вбитих героєм. А ось щойно таймер зупиниться, потрібно згенерувати важчу хвилю ворогів і запустити новий таймер. Так тиск ніколи не зникав, і гравець постійно щось робив. ",
      "Та ще важливішим був той факт, що [i]ціль[/i] гравця змінювалася. Коли герой просто вбивав дедалі меншу кількість скелетів, метою було не залишити жодного скелета. Однак якщо кількість скелетів [i]ніколи не зменшується незалежно від того, скільки їх буде вбито[/i], тоді гравцю швидко стане ясно, що вбивство ворогів насправді не є ціллю. ",
      "Натомість гравець зосереджувався на тому, що [i]отримував[/i] за вбивство всіх цих скелетів, а саме — на здібностях та оновленнях. Раптом метою стало не вбити всіх ворогів, а якнайшвидше вбити якнайбільше ворогів, аби стати [i]якнайсильнішим[/i]. Тепер процес прорубування крізь хвилі ворогів перетворився з рутини на гонитву за нагородою, адже кожне вбивство наближувало до ідеальної збірки. ",
      "Оскільки перехід до наступної хвилі більше не відбувався після вбивства всіх ворогів з останньої хвилі, ми також отримали дещо нове: спільний таймер. Тобто гравці тепер мали однаковий ритм — спільну мову, що описувала ускладнення гри. І коли хтось казав, що не може здолати хвилю павуків на четвертій хвилині, всі інші миттєво розуміли, що мається на увазі (ці павуки найважчі).",
      "Нарешті наша гра стала веселою. Лиш невелика зміна фокусу допомогла визначити, що подобається гравцям і чому, а також дала початок серії нових ідей — потужнішим покращенням, божевільнішим здібностям та збіркам, про які ми навіть не думали. Це означало, що тестувальники могли створювати абсолютно різні збірки героїв за одне проходження, і через це вони були більш зацікавлені й надавали цінніші відгуки та пропозиції для наступних збірок.",
      "Тобто якщо ми кілька разів просили їх. Іноді після тестування наші колеги більше не хотіли розповідати про свій позитивний і негативний досвід. Натомість вони хотіли розповідати одне одному про свої збірки та сперечатися про те, яка з них найкраща. ",
      "Зі зростанням різноманітності збірок ми почали замислюватися, чи не пропустили якийсь великий фрагмент головоломки: а що як самі герої були такими ж унікальними, як і здібності? У ранніх прототипах ігролад був майже ідентичним незалежно від того, якого героя вибрати (якщо не враховувати стартову здібність). Та зараз ми вже зробили вибір по-справжньому унікальним (один герой сильніший, другий швидший, а третій завдає більшої магічної шкоди), і це уможливило ще більшу різноманітність збірок. Вибір одного героя замість іншого також відкривав конкретні гілки здібностей, які інакше б не можна було покращити. А оскільки отримання певних покращень завжди дещо залежить від удачі, кожен вибір мав нотку азарту.",
      "[h3]Перші шість хвилин[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Поки гравець обмірковує, яка гілка покращень приведе його до Імперії, ми поступово збільшуємо рівень складності. У якийсь момент можна й не помітити, що хвилі ворогів стали смертельними, темп — невпинним, і герой ледь не помирає. ",
      "Принаймні такою була наша ціль. Із покращень ми перевели фокус на темп ігроладу. Ми хотіли підтримувати напруженість, але в адекватній мірі, адже знали, що більшість гратиме під час перебування в черзі на матч. З іншого боку, ми хотіли переконатися, що гравці встигатимуть насолоджуватися результатами поєднань своїх покращень.",
      "За приблизним підрахунком загальна тривалість мала дорівнювати десь дванадцять хвилин, не враховуючи трихвилинного завершального бою з Імперією. І ми почали працювати над темпом перших шести хвилин, розмірковуючи над тим, як часто гравець має вибирати покращення, наскільки рано має з’являтися можливість поєднання здібностей і скільки шкоди має завдавати кожна здібність, аби вона приносила гравцеві задоволення, але не була надпотужною. ",
      "Оскільки ми налаштовували ігролад частинами, концентруючи зусилля на перших шести хвилинах, на той момент грати в останні шість хвилин було по суті не можливо. Після перших шести хвилин ми змушували тестувальників зупинитися. Тобто [i]теоретично[/i] можна було продовжувати грати, але після шостої хвилини вони побачили б лише тимчасовий вміст. У це не треба було грати. І ми благали колег не грати в це. ",
      "У нас вийшов кумедний побічний ефект від роботи над складовою веселощів у здібностях і покращеннях: тестувальникам було зазвичай байдуже, що половина гри й досі не готова. Ми сідали поруч з робочим місцем колеги та спостерігали за першою половиною гри, а після 6-ї хвилини казали: ",
      "«Чудово, дякуємо! А тепер із самого початку, добре?»",
      "Пауза. ",
      "«Власне, стривайте: гадаю, я зможу її пройти». ",
      "Але ми нагадували, що останні шість хвилин були невблаганною незбалансованою пусткою скопійованих ворогів, тож пройти цю частину наразі неможливо. І колега казав, що розуміє. Ми розпитували про його позитивний і негативний досвід, отримували багато чудових відгуків про перші шість хвилин, а потім поверталися за свої робочі місця. Тим часом він повертався за гру й усе одно намагався пройти її. ",
      "Деякі наші колеги сприйняли за образу те, що не можуть пройти останні шість жорстоко несправедливих і буквально нездоланних хвилин. Тож поки ми розробляли першу половину гри, вони колективно ламали голови над тим, як пройти непрохідну другу половину. ",
      "І… вони її пройшли. ",
      "Врешті-решт вони винайшли точну комбінацію надпотужних здібностей, які ми ще не підкоригували, і пройшли непрохідну частину. Цей факт чимало каже про дизайн ігор, але ще більше — про тих, хто ним займається.",
      "[h3]Контрольований хаос[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Наприкінці процесу розробки було створено основу гри: здібності, сутички з мінібосами та фінальний бій із королевою Імперією.  На цьому етапі ми більше не шукали критичні помилки; нас цікавили способи скоригувати, збалансувати та відшліфувати до блиску те, що вже працювало. Ми продовжували тестування, але більше не проводили вичерпні післяігрові розмови, а просто дозволяли людям грати для розваги (і, звичайно, для генерації додаткових даних).",
      "Важливими були як кількісні дані з кожного проходження, так і якісні дані з тестування. В одному випадку, що нам запам’ятався, тестування завершилося епічно: Ватага стогонів (внутрішня назва — «Фрикаделька») зайняла більш ніж половину екрана й поглинула гравця, посміятися над невдачею якого зібралося чимало колег. Звісно, ​​він одразу ж натиснув кнопку «Зіграти знову».",
      "Ми були впевнені, що мали готовий до випуску продукт, і почали долучати до тестування не лише волонтерів, але й практично всіх, кого могли спіймати й затягнути в гру. На етапі ранніх прототипів ми були задоволені повідомленнями типу «Гра надто складна», які отримували близько опівночі в Slack. На цьому етапі ми продовжували отримувати повідомлення такого типу, але за ними також слідували інші на кшталт: «Неважливо, я пройшов її» о третій ранку. ",
      "Навіть коли роботу над [i]«Терновим Гніздом»[/i] було майже завершено, ми продовжували повертатися до нього аж до випуску дії IV Коронопаду. Ще на початку цього допису ми зазначили, що здатні приймати кращі рішення, коли маємо хороші дані для їх підтримки, і на останньому етапі ми нарешті отримали такі дані: наші тестувальники з радістю проходили (і перепроходили) гру, а ми отримували масу даних, що дозволяли зрозуміти, над чим саме нам варто працювати. Ніщо так не підбадьорює всю команду розробників, як той факт, що їхня гра стала веселою. Ми хотіли додати до гри якнайбільше того, що вже отримувало позитивні відгуки. Нові предмети, здібності, діалоги, навіть хвилі ворогів… Щоразу, коли ми думали, що наша робота вже завершена, хтось продовжував підкидувати чергову «останню» ідею. І оскільки така ідея зазвичай була доволі чудовою, ми не могли втриматися від спроби її реалізувати.",
      "Справа не лише в тому, що нові ідеї продовжували надходити; вони ставали дедалі кращими ближче до випуску. У найперші дні роботи ми мали неясне уявлення про те, що створюємо, тому було важко відрізнити потенційно круті концепти від насправді поганих. Та коли до випуску лишався один тиждень, уже було очевидно, на що саме варто спрямувати наші ресурси й час.",
      "[h3]Прощання з гніздом[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Коли завершальні штрихи [i]«Тернового Гнізда»[/i] були нанесені, ми зупинилися й зі свіжим поглядом глянули на своє творіння. Наше завдання полягало у використанні досвіду роботи над попередніми діями для створення епічного бою з босом, що мав стати гідним завершенням масштабної події. І ми були дуже задоволені результатом (особливо враховуючи часові обмеження), адже наша гра стала веселою.",
      "На жаль, на той момент широкому загалу ще не було відомо про наш витвір. Був один момент, про який ми одразу не подумали: оскільки [i]«Тернове Гніздо»[/i] було боєм із босом, цілком логічно, що цей бій мав відбутися… ну, там, де живе бос, тобто наприкінці гри. А це означало, що нам довелося довго й нудно чекати принаймні день чи два, щоби найзатятіші гравці в Dota пройшли всю дію IV з нелюдською швидкістю, нарешті діставшись до Імперії. ",
      "І чекати довелося не довго. Ми думали, що гравцям знадобиться принаймні день чи два, перш ніж вони дійдуть до тронної зали королеви Імперії. Як виявилося, ми суттєво недооцінили швидкість найзатятіших гравців. Усього за 16 годин — так, [i]годин[/i], — після виходу останньої дії найшвидші гравці дісталися до її кінця та першими побачили [i]«Тернове Гніздо»[/i].",
      "Врешті-решт туди дійшли й усі інші. На момент написання цього допису в [i]«Тернове Гніздо»[/i] зіграли майже 100 мільйонів разів. А якщо ви ще не билися з Імперією чи просто хочете ще раз спробувати протистояти їй, цей бій із босом і досі доступний в «Архіві Коронопаду».",
      "[h3]Назустріч невизначеності[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Сподіваємось, що цей погляд за лаштунки процесу розробки мінігри командою Dota дав вам краще уявлення про нього (і не змусив із жахом читати цей допис, вважаючи, що ми все це вигадуємо на ходу). Насправді ж ми сподіваємось довести, що дизайн ігор — це не якесь містичне мистецтво геніїв, що в ледь освітлених кімнатах створюють ігри, а радше процес внесення змін на основі спроб і помилок, який ґрунтується на даних, хвилюванні, тестуванні, невдачах, повторному тестуванні, нових невдачах і знову тестуванні.",
      "Ітеративне внесення змін чудово підходить для розробки ігор: усе починається з «гадки не маю, що робити» та поступово перетворюється на «ось це може спрацювати», якщо озиратися назад й аналізувати, що вже спрацювало. Далі «ось це» перетворюється на поганий прототип, у який ніхто з тестувальників не хоче грати, але ми їх змушуємо. Потім ми спостерігаємо за їхньою невеселою грою, повертаємося за свої робочі місця, виправляємо все, що робить гру невеселою, аж поки тестувальникам не починає бути весело грати. Ну а потім ми відшліфовуємо та дошліфовуємо своє творіння, а як згадуємо про дату випуску, так одразу починаємо плакати. Ми у Valve завжди із впевненістю йдемо назустріч невизначеності та покладаємося на дані в процесі розробки. Це означає, що ми не завжди встигаємо випустити продукт вчасно, але вважаємо, що вам сподобається результат нашої праці, коли ви його побачите."
    ],
    "commentcount": 500,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 4751,
    "votedowncount": 502,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747692306,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 4751,
  "votes_down": 502,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}