{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Między ścieżkami: Siedlisko Cierni",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Między ścieżkami: Siedlisko Cierni",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]Witamy z powrotem w „Między ścieżkami”, rubryce na blogu, gdzie członkowie naszego zespołu rozwojowego dzielą się z wami szczegółami na temat wyzwań, rozwiązań błędów i okazjonalnych wesołych przypadków, które napotykamy przy pracy nad grą tak wyjątkową jak Dota 2.[/i]",
      "Podczas wydarzenia tak obszernego jak Utracona Korona przyszło nam wiele poeksperymentować – z mapami świata, rozwidleniami fabuły, żetonami z motywami bohaterów, minigrami, komiksami, pikselowymi grafikami oraz innymi pomysłami, do których odkrywania ciągnęło nas od lat.",
      "Tym, co dało nam pewność w podjęciu tego całego ryzyka (i czymś, z czego w Valve nieustannie korzystamy), jest swoboda iteracji – gromadzenia prawdziwych danych o graczach, dopuszczania, by kwestionowały nasze założenia, a nawet skłaniały do zmiany naszego zdania. Mawiamy, że nie do końca zdajemy sobie sprawę z tego, co tworzymy, dopóki nie zobaczymy interakcji graczy z naszymi dziełami, więc staramy się dotrzeć do tego momentu jak najszybciej.",
      "Ten rodzaj nastawienia kształtuje także nasz czas podejmowania decyzji, zazwyczaj w jak najpóźniejszej możliwej fazie rozwoju, kiedy to dysponujemy najlepszymi (a niekiedy jedynymi) danymi. Na każdym kroku opieramy się na rzeczywistych wrażeniach graczy, co pozwala nam skupić się na tym, co do nich przemawia oraz odejść od tego, co ma przeciwny skutek.",
      "W tym wydaniu [i]Między ścieżkami[/i] omówimy rozwój czegoś, co pojawiło się online w Utraconej Koronie stosunkowo późno, czyli walkę z bossem aktu IV będącą starciem między naszymi bohaterami a królową Imperią, a mowa tu o [i]Siedlisku Cierni[/i]. Używamy jej również jako studium przypadku w celu zaprezentowania, w jaki sposób testowanie gry i generowane tym sposobem dane kształtują nasz proces decyzyjny.",
      "[h3]Dotarcie do Imperii[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Pierwszą (i jedyną) minigrą aktu I była niepozorna minigierka wędkarska, w której Tidehunter poddawał próbie waszą wprawę w tym sporcie w nadziei, że schwytacie mu śniadanie. W ten właśnie sposób prezentowała się znaczna część aktu I – drobne pomysły rozrzucone przez nas po mapie, by sprawdzić, czym zajmą się gracze. Zachęcające dane od graczy z aktu I dodały nam śmiałości do podjęcia większego ryzyka w akcie II, zaś w III wydaliśmy [i]Sleet Fighter[/i], czyli bijatykę umiejscowioną w ulubionej spelunie Tuska. Wydaliśmy takżę [i]Smocze Szachy[/i] stanowiące pojedynek na spryt z Winter Wyvern polegający na dobieraniu 3 elementów, a także [i]Gniazdo Zauga[/i], minigrę typu shoot 'em up, w której wcielacie się w Vengeful Spirit i stawiacie czoła złemu smokowi w krętych jaskiniach Lodowej Ruiny. ",
      "Nim dotarliśmy do aktu IV, mieliśmy mocne poczucie tego, co działa, a co nie. Jakiego rodzaju dane, spytacie? Wszystko, od konkretnych kwestii takich jak liczba graczy, którzy ponownie zagrali w daną grę i jak często to robili, po te bardziej podlegające interpretacji takie jak przesłane przez użytkowników opinie oraz dyskusje w internecie. Ta jasność dodała nam animuszu, by pójść na całość i zafundować graczom wybuchowy finał – walkę z bossem na epicką skalę przeciwko złej królowej Imperii.",
      "Decyzja, jakiego rodzaju grą powinna być walka z bossem, do łatwych, rzecz jasna, nie należała. Wiedzieliśmy, że musiała zapewnić graczom niebywale dramatyczne widowisko, na które liczyli. Musiała jednak oferować także wystarczająco w kwestii różnorodności oraz regrywalności, by nie przejadła się po kilku przejściach. No i ponieważ była to minigra stworzona do zajęcia się nią w oczekiwaniu w kolejce na mecz, musiała być krótka, acz intensywna. Powinna dawać wrażenie smakowitej przekąski, a nie długiego posiłku.",
      "Aby osiągnąć właściwą równowagę, potrzebowaliśmy gatunku, który łączył w sobie wysoką wartość produkcyjną [i]Sleet Fighter[/i] z regrywalnością [i]Smoczych Szachów[/i]. W końcu miało to być legendarne starcie z udziałem Vengeful Spirit, Skywrath Mage'a i nowicjusza Keza (naszej „wielkiej trójki” z czteroaktowej historii Utraconej Korony) szturmujących zamek Imperii. Naszym zamiarem było wywarcie u gracza odczucia, że stawia czoła niemożliwym przeciwnościom losu w swoim dążeniu do dotarcia do królowej.",
      "[h3]Knucie planu[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Jednym z pomysłów, który na krótko nabrał tempa, była turowa walka w stylu JRPG. Jednak nie zajęło nam wiele czasu zorientowanie się, że to nie to. Potrzebowaliśmy czegoś, co szybko wrzuciłoby graczy w wir akcji – czegoś krótkiego, intensywnego i dającego wystarczająco frajdy do grania między kolejkami w Dota 2.",
      "I właśnie w tym momencie pojawił się gatunek „survivors”. „Odwrócone bullet hell” z niekończącymi się falami wrogów było idealnym wcieleniem dla epickiej bitwy z bossem o wysoką stawkę. Gracz miałby przedzierać się przez hordy wrogów, używając nieco strategicznego myślenia, by rozwijać rozmaite umiejętności w przygotowaniu na finałowe starcie z Imperią. Łatwo byłoby również przypisać istniejące przedmioty i umiejętności z Dota 2 do działań, więc gracze mieliby już poczucie, co jak działa.",
      "Ponieważ chcieliśmy, aby rozgrywka była stosunkowo krótka, regrywalność stanowiła znaczący element układanki. Gatunek survivors dał nam sporą zmienność, ponieważ za każdym razem dzieje się coś innego. Gracze nie mają gwarancji natrafienia spodziewanych przez nich przedmiotów i zdarzeń dokładnie w tej kolejności, w jakiej by chcieli. Ta zmienność zachęca was do ciągłego ponawiania próby, zaczynając od zera, w taki sposób, który kreuje wrażenie stawiania przed wami wyzwania, ale które jednocześnie nie wydaje się nie do przejścia czy frustrujące. Niekoniecznie chcieliśmy, byście wygrali za pierwszym razem… ale chcieliśmy też, byście grali dalej po poniesieniu porażki. ",
      "[h3]Wczesne prototypy[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Najwcześniejsze prototypy [i]Siedliska Cierni[/i] zaczęły się od tych samych podstawowych elementów co wersja, która ostatecznie trafiła do gry. Gracz wybierał jednego z trzech bohaterów, stawiał czoła falom wrogów jedna po drugiej i ostatecznie docierał do Imperii. To, czego te wczesne próby nie miały, to jakakolwiek frajda z gry. Czasem bohater wędrował po w większości pustej mapie, natykając się od czasu do czasu na szkielet. Innym razem fale wrogów były tak przytłaczające, że tak naprawdę wygrana była niemożliwa (albo tak nam się zdawało, więcej o tym później). Wiedzieliśmy, że gdzieś w tym tkwiła fajna gra. Musieliśmy po prostu torturować naszych testerów okropnymi kompilacjami, tak długo, aż jej nie odkryjemy.",
      "Każdy pracownik Valve jest królikiem doświadczalnym, a postawienie kogoś przed daną wersją gry to sposób, w jaki ustalamy, czy coś działa (lub równie często [i]nie[/i] działa). Możemy prowadzić burzę mózgów całą wieczność, ale póki ktoś nie usiądzie i nie zagra, tak naprawdę nie wiemy, czy dokonane przez nas wybory są trafne.",
      "Początkowo testerzy z trudem byli w stanie przetrwać pierwsze 3 do 6 minut. Zazwyczaj jest to znak, że gra nie jest zrównoważona lub nie objaśnia wystarczająco dobrze swoich zasad. Siadaliśmy z nimi i prosiliśmy o przedstawienie nam ich wrażeń – momentów, w których brak było im pewności, co robić dalej albo miejsc, gdzie rozgrywka stawała się tak przytłaczająca, że wydawała się niemożliwa lub nawet tych, kiedy po prostu czuli się znudzeni. Potem wracaliśmy do biurek i wprowadzaliśmy kilka zmian, a następnie sadzaliśmy przed nimi nowego testera. Z wolna zaczęliśmy dostrzegać postępy.",
      "I wtedy coś się wydarzyło.",
      "Po przeprowadzeniu nas przez swe pierwsze przejście tester, który właśnie przegrał, zapytał: „Tak w sumie, to czy mogę spróbować jeszcze raz?”.",
      "To było coś nowego i zachęcającego. Siedlisku Cierni wciąż daleko było do dobrego – zorientowanie się, jak przejść prototyp, zajmowało zazwyczaj 3 próby. Jednak miłe było przynajmniej to, że w końcu to nie my zmuszaliśmy kolegów z pracy do grania w nasz badziewny prototyp, tylko to oni faktycznie prosili o zagranie w nasz badziewny prototyp raz jeszcze.  To była malutka iskierka zainteresowania w stylu: „Nie jest to całkowicie do chrzanu”. Z radością przyjęliśmy te wieści.",
      "Ale prawdziwa chwila olśnienia miała dopiero nadejść.",
      "[h3]Schematy bohaterów[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Jednym z kluczowych aspektów gier z gatunku survivors, którego brakowało naszym wczesnym wersjom, była ciągła presja. Początkowo po prostu wywoływaliśmy na poziom falę stu szkieletów i pozwalaliśmy bohaterowi się przez nie przerąbywać. Gdy bohater wybił je do zera, pojawiała się kolejna fala wrogów o wyższym poziomie trudności. Testerzy szybko się tym znudzili. Kiedy zorientowali się, że ich jedynym celem jest nieustanne siekanie wrogów, zaczęło to przypominać uciążliwy obowiązek. Jedyną nagrodą za skuteczne zabijanie ich była możliwość szybszej walki z następną, trudniejszą falą wrogów (hurra?).",
      "Ostatecznie zorientowaliśmy się, że gdy pojawi się sto szkieletów i bohater zacznie się przez nie przerąbywać, musimy dołączyć licznik czasu do tej fali i stale dodawać szkielety bez względu na to, ile z nich zabije bohater. Gdy licznik osiągał zero, pojawiała się trudniejsza fala wrogów wraz z nowym licznikiem. Powodowało to, że presja nie spadała, a gracz pozostawał zaangażowany w grę. ",
      "Ale co ważniejsze, [i]cele[/i] gracza uległy zmianie. Kiedy nasz bohater mordował coraz to malejącą liczbę szkieletów, jego celem było wybicie szkieletów do zera. Ale jeśli liczba szkieletów [i]nigdy nie spada, bez względu na to, ile ich zabijecie[/i], to gracze szybko zdają sobie sprawę, że zabijanie nie jest ich celem. ",
      "Zamiast tego skupiali się na tym, co [i]zyskiwali[/i], zabijając te wszystkie szkielety – w tym przypadku na umiejętnościach i ulepszeniach. Nagle celem nie było już zabicie wszystkich szkieletów, ale „Ile z nich mogę zabić jak najszybciej, aby stać się tak [i]potężnym[/i], jak to tylko możliwe?”. Zamiast sprawiać wrażenie uciążliwego obowiązku, zabijanie fal wrogów zaczęło przypominać pogoń za nagrodą – każde zabójstwo przybliżało gracza do idealnie dostosowanej postaci. ",
      "Ponieważ przejście do następnej fali nie było już związane z koniecznością zabicia wszystkich wrogów z poprzedniej, zyskaliśmy także coś nowego: współdzielony zegar. Oznaczało to, że gracze zaczęli dzielić ten sam rytm – wspólny język na wypadek, gdy sytuacja zaczynała się komplikować. Kiedy więc jeden z graczy powiedział „nie mogę znieść tej fali pająków w czwartej minucie”, wszyscy inni od razu wiedzieli, co miał na myśli (te pająki są najgorsze).",
      "W końcu znaleźliśmy frajdę z gry. Ta niewielka zmiana w naszym podejściu pomogła nam zrozumieć, co podoba się graczom i dlaczego, a także zapoczątkowała lawinę nowych pomysłów – mocniejsze ulepszenia, bardziej szalone umiejętności i możliwości dostosowania schematów postaci, których wcześniej nawet nie braliśmy pod uwagę. Oznaczało to, że testerzy mogli podczas jednej rozgrywki tworzyć zupełnie różne wersje dla swoich bohaterów. Byli również bardziej zaangażowani w testy rozgrywki, dzięki czemu mogliśmy lepiej ocenić ich opinie i sugestie, które mogliśmy uwzględnić przy tworzeniu kolejnej wersji minigry.",
      "Cóż, gdybyśmy zapytali więcej niż raz. Czasami po testach okazywało się, że współpracownicy nie chcieli już rozmawiać z nami o swoich wzlotach i upadkach. Chcieli rozmawiać między sobą o swoich schematach i spierać się, który z nich jest lepszy. ",
      "Wraz ze wzrostem różnorodności konfiguracji postaci zaczęliśmy się zastanawiać, czy nie przegapiliśmy ważnego elementu układanki – co by było, gdyby sami bohaterowie wydawali się równie wyjątkowi, jak ich umiejętności? We wczesnych prototypach, poza umiejętnościami początkowymi, sposób rozgrywki był w zasadzie identyczny niezależnie od wybranego bohatera. Przekształciliśmy je w naprawdę wyjątkowe wybory, sprawiając, że jeden był silniejszy, inny szybszy, jeszcze inny był lepszy w zadawaniu obrażeń magicznych – co jeszcze bardziej zwiększyło różnorodność w dostosowywaniu postaci. Wybór jednego bohatera zamiast innego oznaczał również odblokowanie określonych gałęzi umiejętności, których w innym przypadku mogliście nie mieć szansy rozwijać – a ponieważ w grę zawsze wchodzi łut szczęścia co do ulepszeń, jakie otrzymacie, każdy wybór zdawał się zakładem o wysoką stawkę.",
      "[h3]Pierwsze sześć minut[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Tymczasem, gdy wy zajęci jesteście rozpracowywaniem, która gałąź ulepszeń zaprowadzi was do Imperii, my powoli podkręcamy trudność. W pewnym momencie, nim się spostrzegliście, fale wrogów stały się zabójcze, tempo bezlitosne i z trudem utrzymujecie się na powierzchni. ",
      "A przynajmniej taki był zamysł. Wraz z kolejnymi ulepszeniami przeszliśmy do tempa rozgrywki. Chcieliśmy, by rozgrywka była intensywna, lecz bez przeciągania jej. Wiedzieliśmy, że większość graczy zajmie się nią, czekając w kolejce na mecz. Z drugiej strony pragnęliśmy zostawić graczom wystarczająco luzu, by mieli przyjemność z oglądania tego, jak ich ulepszenia łączą się ze sobą.",
      "Nasze obliczenia na kolanie dały nam jakieś 12 minut całkowitej rozgrywki (nie licząc trzyminutowej walki z Imperią na zakończenie). Wzięliśmy się więc za opracowywanie tempa dla pierwszych 6 minut. Jak często dajemy graczowi wybór w kwestii ulepszeń? Jak wcześnie może zacząć łączyć umiejętności? Ile obrażeń powinna zadawać każda umiejętność, by była uznawana za satysfakcjonującą, ale nie przegiętą? ",
      "Ponieważ dostosowywaliśmy rozgrywkę w sekcjach, skupienie się na pierwszych 6 minutach oznaczało, że ostatnie 6 zasadniczo nie nadawało się w tym momencie do gry. Dawaliśmy ludziom testować pierwsze 6 minut, a potem kazaliśmy im przestawać. [i]Technicznie rzecz biorąc[/i], mogli grać dalej, ale wszystko po tych 6 minutach było tylko zapychaczem. Nie mieli już grać po tym momencie – naprawdę błagaliśmy kolegów, żeby tego nie robili. ",
      "Jednym z zabawnych skutków ubocznych tworzenia umiejętności i ulepszeń tak fajnymi, jakimi się stawały, było to, że testerów nierzadko nie obchodziło, że gra nadal była w połowie niegrywalna. Siadaliśmy za biurkiem współpracownika i patrzyliśmy, jak gra w pierwszą połowę gry. Po wybiciu 6 minuty rozgrywki: ",
      "„Super, dzięki”, mówiliśmy. „Możesz zacząć grę od nowa?”.",
      "Pauza. ",
      "„Tak właściwie to czekaj, wydaje mi się, że to przejdę”. ",
      "Przypominaliśmy mu, że ostatnie 6 minut stanowiło katorżnicze, pozbawione balansu pustkowie usiane wrogami typu kopiuj-wklej i do tego w danej chwili nie dało się go przejść. Odpowiadał, że rozumie, a my wypytywaliśmy go o jego najlepsze i najgorsze momenty z rozgrywki. Dawał nam mnóstwo świetnych opinii na temat swojej rozgrywki w pierwsze 6 minut. A potem wracaliśmy do swoich biurek, a on patrzył za nami, a potem odpauzowywał grę i próbował i tak ją pokonać. ",
      "Niektórzy z naszych kolegów uznali to za osobistą zniewagę, że nie mogli przejść ostatnich morderczo niesprawiedliwych, dosłownie niemożliwych do przejścia 6 minut. Więc kiedy my tworzyliśmy pierwszą połowę gry, on wkładał wszystko w przejście tej niemożliwej do przejścia, zjadając na tym zęby. ",
      "A co najlepsze, przeszedł ją. ",
      "Koniec końców wykombinował precyzyjne połączenie za mocnych umiejętności, których jeszcze nie dostroiliśmy i przeszedł część gry, której nie miało dać się przejść. Co z kolei wiele mówi o projektowaniu gry. A może nawet więcej o tym, jakiego rodzaju ludzie się w nie pakują.",
      "[h3]Kontrolowany chaos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Pod koniec prac rozwojowych mieliśmy już gotową podstawową wersję gry. Były już umiejętności, zdarzenia z minibossami oraz finałowe starcie z królową Imperią.  W tamtym momencie nie szukaliśmy już problemów psujących grę, lecz sposobów na dostosowanie, zbalansowanie oraz odpicowanie tego, czego skutecznego działania byliśmy już świadomi. Kontynuowaliśmy testy rozgrywki, ale ukróciliśmy wyczerpujące rozmowy sprawozdawcze i po prostu dawaliśmy ludziom grać dla zabawy (i, rzecz jasna, by wygenerować więcej danych).",
      "Chociaż dane ilościowe pochodzące z każdej próby przejścia miały istotne znaczenie, to dane jakościowe pochodzące z rozgrywek testowych były tak samo ważne. W jednym z pamiętnych przykładów, jeden z testów zakończył się widowiskowym przejęciem przez zawodzącą masę (wewnętrznie zwaną „pulpetem”) ponad połowy ekranu i pożarciem gracza. W tym momencie tester miał publiczność w postaci współpracowników zaglądających mu przez ramię, którzy co do jednego zaśmiewali się z jego niefarta. Oczywiście natychmiast nacisnął przycisk „zagraj ponownie”.",
      "Byliśmy pewni, że mamy coś wartego wydania i rozszerzyliśmy testy z osób, które się dobrowolnie do nich zgłosiły, na praktycznie każdego, kogo mogliśmy dopaść w firmie i wmanewrować w grę. Przy naszych najwcześniejszych prototypach o 23:00 byliśmy raczeni wiadomością na Slacku o treści: „Gra jest za trudna”. Na tym etapie nadal otrzymywaliśmy takie wiadomości o 23:00, jednak potem, o 3 nad ranem następowała kontynuacja w postaci: „Nieważne, udało mi się ją przejść”. ",
      "Nawet przy niemal skończonej grze nadal pracowaliśmy nad [i]Siedliskiem Cierni[/i] aż do wydania aktu IV Utraconej Korony. Na początku tego wpisu wspomnieliśmy, że możemy podejmować lepsze decyzje, gdy dysponujemy dobrymi danymi, które je popierają. Cóż, na tym etapie trochę ich już mieliśmy. Dzięki entuzjazmowi testerów do zagrania (i zagrania raz jeszcze) w grę, mieliśmy mnóstwo danych mówiących nam, które części naszego dzieła cieszyły się uznaniem. I nic tak nie rozpala entuzjazmu pokoju pełnego twórców gier, jak moment, w którym gra zaczyna dawać frajdę. Chcieliśmy zrobić więcej rzeczy, o których teraz już wiedzieliśmy, że działają – i by było ich jak najwięcej się dało. Nowe przedmioty, umiejętności, złożoność uniwersum, a nawet fale – za każdym razem, gdy wydawało nam się, że dopracowaliśmy grę do końca, ktoś nieuchronnie wpadał na pomysł „na jeszcze tylko jedną rzecz”. A z uwagi na to, że zazwyczaj to był dość świetny pomysł, to nie mogliśmy się powstrzymać przed jego wypróbowaniem.",
      "I nie chodziło tylko o to, że napływały pomysły na funkcje – robiły się tym lepsze, im mniej czasu było do wydania. Na wczesnym etapie, gdy sprawy nie miały jeszcze w pełni nadanego kształtu, trudno było odróżnić potencjalnie wartościową funkcję od tej o faktycznie niskiej wartości. Na tydzień przed wydaniem najlepsze miejsca na ulokowanie naszych zasobów i czasu w celu ulepszenia gry wydawały się oczywiste.",
      "[h3]Opuszczenie Siedliska[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Przy ostatnich szlifach [i]Siedliska Cierni[/i] mogliśmy zrobić krok wstecz i przyjrzeć mu się ze świeżej perspektywy. Wyzwanie stanowiło tutaj wykorzystanie rzeczy, których dowiedzieliśmy się z poprzednich aktów, by stworzyć należycie epicką walkę z bossem na zakończenie ogromnego wydarzenia. Byliśmy dość zadowoleni z tego, co nam się udało, zwłaszcza biorąc pod uwagę ograniczenia czasowe. Odnaleźliśmy frajdę.",
      "Niestety nie można było tego jeszcze powiedzieć o społeczności. Faktem, którego nie wzięliśmy pod uwagę, było to, że skoro [i]Siedlisko Cierni[/i] stanowiło walkę z bossem, to logiczne było, że jego akcja musiała istnieć, cóż… tam, gdzie istnieje boss, na końcu gry. Oznaczało to co najmniej dzień lub dwa cichych tortur, w oczekiwaniu, aż zapaleni gracze Dota 2 przedrą się przez akt IV z nieludzką prędkością i czekania, aż gracze w końcu będą mieli szansę zagrać. ",
      "Jak się okazało, nie musieliśmy długo czekać. Myśleliśmy, że mamy co najmniej dzień lub dwa, nim ktokolwiek dotrze do sali tronowej królowej Imperii. Okazuje się, że poważnie zbagatelizowaliśmy prędkość, z jaką gracze Dota 2 potrafią się uwijać, jeżeli chodzi o treści. Zaledwie 16 godzin od wydania – tak, [i]godzin[/i] – pierwsi mocni zawodnicy przedarli się już przez całość ostatniego aktu i zaznali przedsmaku [i]Siedliska Cierni[/i].",
      "A w końcu i inni gracze nadrobili tempa. W momencie powstawania tego wpisu w [i]Siedlisko Cierni[/i] zagrano prawie 100 milionów razy. Jeśli wam samym nie udało się nadrobić zaległości albo po prostu chcecie spróbować swoich sił w rozgrywce raz jeszcze, to wciąż możecie to zrobić w archiwum Utraconej Korony w kliencie gry.",
      "[h3]Akceptacja niepewności[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Mamy nadzieję, że ten rzut oka na kulisy pracy zespołu Dota 2 nad minigrą pozwolił wam lepiej zrozumieć nasz proces – i nie sprawił, że po prostu z przerażeniem przeczytaliście ten wpis na blogu, odkrywając, że ciągle improwizujemy. Ale tak naprawdę mamy nadzieję, że pokazuje to, że projektowanie gier nie jest jakąś mistyczną sztuką, którą wykonują geniusze gier, przebierając palcami w ciemnych pomieszczeniach, ale iteracyjnym procesem prób i błędów, napędzanym przez dane, niepokój, testowanie, porażki i więcej testowania i więcej porażek.",
      "Tworzenie gier opiera się na iteracji – to, co zaczyna się jako „brak pomysłu”, powoli przekształca się w „jakiś pomysł” poprzez przyjrzenie się wcześniejszym pomysłom, które się sprawdziły. Potem powstaje z tego kiepski prototyp, w który nikt nie chce grać, ale i tak go tworzymy. Następnie przyglądamy się tej grze i zabawie, której w niej brakuje i naprawiamy wszystkie fragmenty, które nie sprawiają frajdy, do momentu aż zobaczymy, że ludzie zaczynają się przy niej dobrze bawić. A potem szlifujemy i szlifujemy, patrzymy na kalendarz wydania i zalewamy się łzami. Filozofią Valve od zawsze było akceptowanie niepewności i pozwalanie, aby to dane kształtowały rozwój. Oznacza to, że nie zawsze wydajemy produkty na czas. Ale myślimy, że spodobają się wam, kiedy będą gotowe."
    ],
    "commentcount": 31,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 61,
    "votedowncount": 14,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747093823,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 58,
  "votes_down": 14,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}