{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Nas Entretrilhas: Poleiro de Espinhos",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Nas Entretrilhas: Poleiro de Espinhos",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]Bem-vindos de volta à série [b]Nas Entretrilhas[/b], na qual membros da nossa equipe de desenvolvimento falam dos desafios, correções de erros e ocasionais \"acidentes felizes\" que ocorrem no desenvolvimento de um jogo único como o Dota.[/i]",
      "Durante um evento tão grande quanto a Queda Coronal, nós pudemos testar várias coisas — mapas de campanha, histórias ramificadas, fichas temáticas, minijogos, histórias em quadrinhos, arte pixelada e outras ideias que queríamos explorar há anos.",
      "O que nos deu confiança para correr esses riscos — e algo que aproveitamos bastante na Valve — foi a liberdade de iterar: coletar dados reais dos jogadores, compará-los com as nossas suposições e até mesmo nos fazer mudar de ideia. Costumamos dizer que não compreendemos por completo o que estamos construindo até vermos como os jogadores interagem. Por isso, tentamos chegar a essa fase o mais rápido possível.",
      "Essa mentalidade também define quando tomamos decisões — geralmente o mais tarde possível no processo de desenvolvimento, quando temos os melhores (e às vezes os únicos) dados. A cada etapa, nós analisamos a experiência de jogadores reais para nos ajudar a concentrar no que está bom e deixar de lado o que não está.",
      "Nesta edição de [i]Nas Entretrilhas[/i], detalharemos o desenvolvimento de algo que chegou relativamente tarde na Queda Coronal: a batalha final do 4º Ato entre os nossos heróis e a Rainha Imperia, no [i]Poleiro de Espinhos[/i]. Também usaremos essa batalha como um caso de estudo para demonstrar como os testes e os dados gerados por eles guiam a nossa tomada de decisões.",
      "[h3]Chegando até Imperia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "O primeiro (e único) minijogo do 1º Ato era um modesto minijogo de pescaria, onde o Tidehunter testava as suas habilidades de pesca na esperança de faturar um café da manhã. Muitos dos elementos do 1º Ato eram assim — pequenas ideias espalhadas pelo mapa para ver com o que os jogadores interagiriam. Os dados encorajadores obtidos no 1º Ato nos deram confiança para arriscar ainda mais no 2º Ato, e no 3º Ato lançamos [i]Sleet Fighter[/i], um jogo de luta no bar favorito do Tusk; [i]Xadrez Dragão[/i], uma batalha estratégica de \"ligar os três\" contra a Winter Wyvern; e o [i]Covil de Zaug[/i], uma chuva de balas que colocou um dragão maligno contra a Vengeful Spirit, atravessando as cavernas sinuosas das Geleiras Devastadas. ",
      "Quando chegamos ao 4º Ato, já tínhamos uma noção do que havia funcionado. Com base em que tipo de dado? Todos, desde os concretos — quantos jogadores voltaram a jogar cada minijogo, e com qual frequência —, até os mais subjetivos, como os comentários enviados pelos jogadores e discussões on-line. Essa clareza nos deu confiança para mergulhar de cabeça em um grande desfecho: uma batalha épica contra a maligna Rainha Imperia.",
      "É claro que decidir como seria essa batalha não foi fácil. Sabíamos que ele precisava entregar o clímax espetacular que os jogadores estavam esperando. Mas também precisava oferecer variedade e rejogabilidade suficientes para continuar divertido após várias sessões. E como ele era um minijogo, pensado para ser aproveitado enquanto o jogador busca uma partida, precisava ser intenso, mas terminar rápido. Como um lanche saboroso, não uma refeição completa.",
      "Para chegar ao equilíbrio perfeito, precisávamos de um gênero que combinasse os valores de alta produção do [i]Sleet Fighter[/i] com a rejogabilidade do [i]Xadrez Dragão[/i]. Afinal, esse seria o embate épico entre a Vengeful Spirit, o Skywrath Mage e o novato Kez (o \"trio principal\" da história da Queda Coronal) durante a invasão do castelo de Imperia. Queríamos que o jogador sentisse estar enfrentando uma [i]desigualdade esmagadora[/i] na missão para chegar até a rainha.",
      "[h3]Chocando um plano[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Uma ideia que brevemente desenvolvida foi uma batalha por turnos, como um JRPG. Mas não demorou muito para percebermos que não combinava bem. Precisávamos de algo que colocasse os jogadores direto na ação rapidamente — algo breve, intenso e divertido de se jogar entre partidas de Dota.",
      "Foi aí que chegamos ao gênero [i]\"survivors\"[/i]. Uma \"chuva de balas ao avesso\" com intermináveis ondas de inimigos — era a base perfeita para uma batalha épica das mais altas proporções. Os jogadores abririam caminho por hordas de inimigos, usando um pouco de estratégia para aprimorar diversas habilidades em preparação para um embate final contra Imperia. Também seria fácil trazer itens e habilidades existentes do Dota para a ação, para que os jogadores já tivessem uma ideia de como cada um funcionava.",
      "Como a nossa meta era uma experiência relativamente curta, a rejogabilidade era outro grande fator importante. Esse gênero nos permitiu aumentar a variabilidade, já que uma experiência nunca é igual a outra. Os jogadores podem não receber os itens ou eventos que estavam esperando na ordem desejada. Essa variedade encoraja você a continuar tentando, começando do zero de uma forma que pareça desafiadora, mas não impossível ou frustrante. Não queríamos necessariamente que você vencesse na primeira tentativa... mas também queríamos que você continuasse jogando mesmo quando perdesse. ",
      "[h3]Protótipos iniciais[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Os primeiros protótipos do [i]Poleiro de Espinhos[/i] começaram com os mesmos elementos principais da versão lançada. O jogador escolhia um dos três heróis, enfrentava onda após onda de inimigos e, enfim, chegava até Imperia. O que faltava nessas primeiras versões era qualquer vestígio de diversão. Às vezes, um herói vagava por um mapa quase vazio, esbarrando em um esqueleto ou outro. Outras vezes, as ondas de inimigos eram tão grandes que era virtualmente impossível vencer (ou assim pensávamos — falaremos mais sobre isso depois). Sabíamos que havia um jogo divertido escondido ali. Só precisávamos continuar torturando os nossos testadores com versões ruins até finalmente encontrá-lo.",
      "Todo funcionário da Valve é uma cobaia em potencial, e é colocando alguém na frente de uma versão que descobrimos se algo está funcionando (ou, com a mesma frequência, [i]não[/i] está). Podemos debater ideias a rodo, mas até alguém sentar e jogar, não tem como sabermos se fizemos boas escolhas.",
      "No início, os testadores tinham dificuldade em sobreviver aos primeiros três a seis minutos. Geralmente, isso é um sinal de que o jogo está desequilibrado ou não está explicando as regras muito bem. Nós sentávamos com eles e pedíamos para que detalhassem a experiência — momentos em que não sabiam bem o que fazer, quando ficou tão cheio de inimigos que parecia impossível, ou quando simplesmente bateu o tédio. E então nós voltávamos para as nossas mesas, fazíamos algumas alterações e colocávamos na frente de outro testador. Lentamente, começamos a ver progresso.",
      "E então algo aconteceu.",
      "Após detalhar a sua primeira vez, um testador que havia acabado de perder perguntou: \"Posso tentar novamente?\".",
      "Isso não havia acontecido antes — e foi encorajador. O Poleiro de Espinhos ainda não estava nem perto de ser bom (geralmente eram necessárias três tentativas no protótipo antes de alguém descobrir como vencer), mas pelo menos não estávamos obrigando os nossos colegas de trabalho a jogar o nosso protótipo terrível — eles estavam pedindo para jogar o nosso protótipo terrível novamente.  Foi um pequeno lampejo de interesse: \"eu não odeio isso completamente\". Nós aceitamos de bom grado.",
      "Mas o verdadeiro momento \"eureca!\" ainda estava por vir.",
      "[h3]Combinando habilidades e itens[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Um aspecto importante do gênero [i]survivors[/i] que as nossas primeiras versões não tinham era a pressão constante. Inicialmente, nós criávamos uma onda com cem esqueletos no nível e deixávamos o herói avançar entre eles. Depois que o herói tivesse eliminado todos, criávamos uma nova onda de malvadões mais difíceis. Os testadores ficavam entediados rapidamente. Após eles perceberem que o único objetivo era eliminar os inimigos, o jogo começou a parecer mais uma tarefa chata. A única recompensa por matá-los de forma mais eficiente era poder enfrentar a próxima onda mais cedo. (Irra!?)",
      "Finalmente, percebemos que quando criávamos uma centena de esqueletos e o herói começava a matá-los, precisávamos ativar um cronômetro para continuar criando novos esqueletos, independentemente de quantos o herói matasse. Ao final desse cronômetro, criaríamos uma onda de inimigos mais difíceis, sob um novo cronômetro. Dessa forma, a pressão era constante e o jogador se mantinha engajado. ",
      "Mas, e ainda mais importante, isso mudou os seus [i]objetivos[/i]. Quando o nosso herói simplesmente assassinava uma quantidade decrescente de esqueletos, o objetivo era \"fazer a quantidade de esqueletos chegar a zero\". Mas quando a quantidade de esqueletos [i]nunca diminui, não importa quantos você matar[/i], não demora até os jogadores perceberem que matá-los não é o verdadeiro objetivo. ",
      "Em vez disso, eles passaram a focar no que eles estavam [i]obtendo[/i] ao matar esses esqueletos — neste caso, habilidades e aprimoramentos. De repente, o objetivo não era mais \"matar todos os esqueletos\", mas sim \"quantos eu consigo matar rapidamente para ficar o mais [i]poderoso[/i] possível?\". Em vez de parecer uma tarefa chata, ceifar ondas de inimigos começou a parecer uma caça ao tesouro — com cada morte aproximando você da combinação perfeita. ",
      "Como avançar para a onda seguinte não dependia mais de matar todos os inimigos da onda anterior, também ganhamos algo novo: um relógio compartilhado. A partir de então, os jogadores compartilhavam o mesmo ritmo — ajudando na comunicação. Quando um jogador falava \"eu odeio aquela onda de aranhas aos quatro minutos\", todos nós sabíamos o que eles queriam dizer (aquelas aranhas são terríveis).",
      "Nós finalmente encontramos a diversão. Essa pequena mudança de abordagem nos ajudou a esclarecer o que os jogadores estavam gostando e o porquê, e isso desencadeou diversas novas ideias — mais aprimoramentos poderosos, habilidades mais malucas e possibilidades de combinações que ainda não havíamos considerado. Dessa forma, os testadores podiam criar combinações completamente distintas entre si em uma única sessão. Isso significava que eles estavam mais engajados durante os testes, nos dando opiniões mais detalhadas e sugestões para a próxima versão.",
      "Bom, isso se perguntássemos mais de uma vez. Após uma sessão de testes, às vezes percebíamos que os nossos colegas de trabalho não queriam mais falar conosco sobre os pontos positivos e negativos. Eles queriam conversar entre si sobre as suas combinações, e debater qual era a melhor. ",
      "Conforme a variedade de combinações aumentava, começamos a pensar se não havíamos deixado algo importante passar despercebido — e se os próprios heróis fossem tão distintos quanto as habilidades? Nos protótipos iniciais, a experiência dos jogadores era bem parecida independentemente do herói escolhido — só a primeira habilidade é que mudava. Agora, estávamos ajustando o protótipo para que fossem escolhas realmente distintas. Um era mais forte, outro mais rápido, o terceiro melhor em dano mágico — o que abria as portas para combinações ainda mais variadas. Escolher um herói em vez de outro também criava ramificações específicas de habilidades que outrora não seriam combinadas (e como o jogador sempre dependia da sorte para obter os aprimoramentos almejados, cada escolha passava a sensação de uma aposta arriscada).",
      "[h3]Os primeiros seis minutos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Enquanto você está pensando em qual combinação levará você até Imperia, nós estamos lentamente aumentando a dificuldade. Em algum momento, sem você nem ao menos perceber, as ondas de inimigos estão mortais, o ritmo é impiedoso e você mal consegue respirar. ",
      "Ao menos esse era o objetivo. Com os aprimoramentos dando certo, partimos para o ritmo da jogabilidade. Gostaríamos que a experiência fosse intensa, mas não se alongasse demais (sabíamos que a maioria dos jogadores estaria jogando enquanto buscava por uma partida). Mas, por outro lado, queríamos que durasse tempo suficiente para que os jogadores pudessem curtir os resultados das suas escolhas.",
      "A nossa matemática básica dizia que o minijogo duraria cerca de doze minutos — desconsiderando a luta de três minutos contra Imperia. Então, nós começamos a trabalhar no ritmo dos primeiros seis minutos. Com qual frequência daremos uma escolha de aprimoramento? Quão cedo os jogadores podem começar a acumular habilidades? Quanto dano cada habilidade deveria causar para que seja satisfatória, mas sem trivializar o jogo? ",
      "Como nós estávamos ajustando o jogo em seções, a nossa concentração nos primeiros seis minutos tornou os seis minutos finais praticamente injogáveis. Nós testávamos o pessoal durante os seis primeiros minutos e então pedíamos para parar. [i]Tecnicamente[/i], eles podiam continuar jogando, mas nada a partir dali estava pronto. Você não devia jogar a partir dali (nós realmente imploramos para os nossos colegas não jogarem). ",
      "Um efeito colateral engraçado de tornar todos os aprimoramentos e habilidades tão divertidos é que os testadores muitas vezes nem ligavam que metade do jogo ainda era injogável. Nós sentávamos na mesa de um colega, observávamos a jogatina durante a primeira metade do jogo. Ao atingir os seis minutos: ",
      "\"Ótimo, valeu!\", nós dizíamos. \"Pode começar de novo?\"",
      "Uma pausa. ",
      "\"Espera um pouco, eu acho que consigo vencer.\" ",
      "Nós avisávamos que os últimos seis minutos eram uma terra selvagem cruel, desequilibrada, com inimigos copiados e impossível de ser vencida. A resposta? \"Tudo bem.\" Nós questionaríamos os pontos positivos e negativos. Eles davam ótimos comentários sobre a sua sessão de jogo durante os primeiros seis minutos. Assim, nós voltávamos para as nossas mesas, eles esperavam a gente se afastar e então retomavam o jogo para tentar vencê-lo mesmo assim. ",
      "Alguns dos nossos colegas tomaram como uma afronta pessoal não conseguirem atravessar aqueles seis minutos ferozmente injustos e literalmente impossíveis. Então, enquanto nós modelávamos a primeira metade do jogo, eles estavam reunindo forças para continuar dando murro em ponta de faca em uma segunda metade intransponível. ",
      "E então: eles conseguiram. ",
      "De tanto tentar, eles uma hora descobriram uma combinação precisa de habilidades poderosas que ainda não havíamos ajustado bem, e zeraram a parte do jogo que não devia ser zerável (o que ensina muito sobre o design de jogos — mas talvez ainda mais sobre o tipo de pessoa que trabalha nessa área).",
      "[h3]Caos controlado[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Próximo ao fim do desenvolvimento, a base do jogo estava pronta. As habilidades, minichefes e o confronto final contra a Rainha Imperia estavam lá.  Nesse momento, não estávamos mais buscando problemas graves, mas sim formas de ajustar, equilibrar e polir ainda mais o que já sabíamos estar funcionando. Continuamos testando, mas já tínhamos parado com os questionários exaustivos e estávamos deixando o pessoal jogar por diversão (e, claro, para gerar mais dados).",
      "Embora os dados quantitativos provenientes de cada sessão fossem importantes, os dados qualitativos não eram menos importantes. Em um exemplo memorável, um teste terminou de forma épica com a Massa da Lamentação — internamente nomeada \"almôndega\" — ocupando metade da tela e devorando o jogador. Nesse ponto, o testador tinha uma plateia de colegas assistindo logo atrás dele, rindo da desgraça alheia. É claro que ele apertou o botão de \"jogar novamente\" sem pestanejar.",
      "Nós estávamos confiantes de que tínhamos algo bom, e então abrimos o leque de testadores, passando de voluntários para basicamente qualquer pessoa na empresa que pudéssemos encurralar e obrigar a participar. Nos protótipos iniciais, nós volta e meia recebíamos uma mensagem no Slack às 23h dizendo que \"esse jogo é muito difícil\". Mas nessa etapa, ainda recebíamos mensagens assim às 23h, só que por volta das 3h da manhã chegava outra: \"esquece, zerei\". ",
      "Mesmo com um jogo quase finalizado, continuamos trabalhando no [i]Poleiro de Espinhos[/i] até o momento em que lançamos o 4º Ato da Queda Coronal. Lá atrás, no início desta publicação, comentamos sobre como podemos tomar decisões melhores quando temos bons dados para embasá-las. Bom, agora nós tínhamos: com testadores internos tão animados para jogar (e rejogar) o jogo, nós tínhamos muitos dados para saber quais partes do que estávamos construindo estavam indo bem. E nada deixa uma sala cheia de desenvolvedores de jogos tão animados quanto o momento em que o seu jogo começa a ficar divertido. Gostaríamos de fazer mais dos elementos que agora sabíamos estarem funcionando, tanto quanto fosse possível. Novos itens, habilidades, histórias e mesmo ondas — sempre que pensávamos ter terminado, alguém sempre aparecia com mais uma \"última\" ideia. E como geralmente era uma ótima ideia, não dava para resistir.",
      "E não eram apenas novas ideias chegando: elas ficavam ainda melhores conforme a data de lançamento se aproximava. Nos primeiros dias, quando o jogo não estava muito bem definido, era difícil distinguir entre um recurso potencialmente importante e um recurso secundário. Mas quando faltava apenas uma semana, estava claro onde melhor dedicar os nossos esforços e o nosso tempo.",
      "[h3]Descendo do poleiro[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Enquanto dávamos os toques finais no [i]Poleiro de Espinhos[/i], pudemos dar um passo para trás e apreciá-lo com outros olhos. O desafio era usar os nossos aprendizados com os atos anteriores para construir uma batalha épica apropriada para o ato final de um evento gigantesco. E nós estávamos bem felizes com o que entregamos, especialmente dado os prazos. Nós encontramos a diversão.",
      "Infelizmente, a comunidade ainda não tinha encontrado. Demoramos para perceber que, sendo a batalha contra a grande vilã, o [i]Poleiro de Espinhos[/i] precisaria estar... no final. Isso significava pelo menos um ou dois dias de tortura silenciosa enquanto esperávamos que os jogadores mais assíduos de Dota abrissem caminho pelo 4º Ato em velocidade sobre-humana, aguardando o momento em que finalmente poderiam experimentá-lo. ",
      "Mas nem precisamos esperar muito. Pensávamos que a primeira pessoa precisaria de um ou dois dias para alcançar a sala do trono da Rainha Imperia. Mas nós subestimamos muito a velocidade em que os jogadores de Dota devoram os nossos conteúdos. Em apenas 16 horas após o lançamento (isso mesmo, [i]horas[/i]), os jogadores mais ávidos já haviam atravessado todo o último ato e estavam conhecendo o [i]Poleiro de Espinhos[/i].",
      "E, mais cedo ou mais tarde, todo mundo chegou lá. No momento em que escrevemos este artigo, o [i]Poleiro de Espinhos[/i] foi jogado quase cem milhões de vezes (se você não contribuiu com esse número, ou ficou com vontade de jogar mais uma vez, ele ainda está disponível no Arquivo da Queda Coronal no cliente do jogo).",
      "[h3]Abraçando a incerteza[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Esperamos que essa visão por trás dos panos sobre como a equipe do Dota criou um minijogo dê uma ideia mais clara sobre o nosso processo — e não tenha servido apenas para aterrorizar você com a revelação de que é tudo basicamente improviso. Falando sério agora: esperamos que isso prove que o design de jogos não é uma arte mística realizada por gênios da área bolando novas ideias em salas escuras, mas sim um processo iterativo de tentativa e erro conduzido por dados, ansiedade, testes, fracassos, testes, mais fracassos e mais testes.",
      "O desenvolvimento de jogos prospera em cima dessas iterações — o que começa como \"nenhuma ideia\" transforma-se lentamente em \"alguma ideia\" conforme analisamos as ideias anteriores que deram certo. Depois, isso se transforma em um protótipo ruim que ninguém quer jogar, mas a gente os obriga mesmo assim. Então nós assistimos às pessoas não se divertirem enquanto jogam, e voltamos para consertar todas as partes não divertidas, até que, eventualmente, assistimos às pessoas se divertirem com o jogo. Então nós polimos, polimos mais um pouco, olhamos quanto tempo falta para o lançamento e choramos. A filosofia da Valve sempre foi de abraçar a incerteza e permitir que os dados moldem o desenvolvimento. Isso significa que nem sempre lançamos as coisas no prazo. Mas acreditamos que você gostará delas quando estiverem prontas."
    ],
    "commentcount": 58,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 202,
    "votedowncount": 24,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747097662,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 202,
  "votes_down": 24,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}