{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Mellem lanerne: Tornereden",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mellem lanerne: Tornereden",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]Velkommen tilbage til \"Mellem lanerne\" – en blog, hvor vores udviklingsteam snakker om nogle af de udfordringer, fejlrettelser og til tider heldige uheld, som vi støder på i vores arbejde på et spil så unikt som Dota.[/i]",
      "Under en begivenhed så massiv som Crownfall havde vi lejlighed til at eksperimentere en masse med oververdenskort, forgrenede historier, poletter med heltetema, minispil, tegneserier, pixel art og andre idéer, som vi har villet udforske i mange år.",
      "Det, der gav os selvtilliden til at tage disse risici – og noget, som vi hele tiden benytter os af hos Valve – er friheden til at iterere: at samle data fra virkelige spillere og lade dataene udfordre vores antagelser og endda ændre vores mening. Vi siger tit, at vi ikke helt ved, hvad vi skaber, før vi ser spillere interagere med det, så vi forsøger at nå til det punkt så hurtigt som muligt.",
      "Det er også denne tankegang, som hersker, når vi tager beslutninger – som regel så sent i udviklingen som muligt, når vi har de bedste (og nogle gange eneste) data. På hvert trin er vi afhængige af virkelige spilleres erfaringer til at hjælpe os med at fokusere på det, der fænger, og styre udenom det, der ikke gør det.",
      "I denne udgave af [i]Mellem lanerne[/i] snakker vi om udviklingen af noget, som blev udgivet relativt sent i Crownfall – nemlig bosskampen i del IV mellem vores helte og Dronning Imperia, [i]Tornereden[/i]. Vi bruger det også som et casestudie til at vise, hvordan spiltestning og de data, dette giver, former vores beslutningsproces.",
      "[h3]Vejen til Imperia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Det første (og eneste) minispil i del I var et beskedent fiskeminispil, hvor Tidehunter testede dine evner indenfor fiskeri i håbet om, at du ville kunne fange morgenmad til ham. Det var sådan, meget af del I var – små idéer, som vi dryssede ud i banen for at se, hvad der ville fange spillernes interesse. De positive spillerdata fra del I gav os selvtilliden til at prøve flere ting i del II, og da vi nåede til del III, udgav vi [i]Sleet Fighter[/i], et kampspil på Tusks foretrukne værtshus; [i]Drageskak[/i], hvor man skal kombinere tre ens mod Winter Wyvern; og [i]Zaugs hule[/i], et shoot 'em up-spil, hvor en ond drage kæmper mod Vengeful Spirit i Icewracks snoede hulesystem. ",
      "Da vi kom til del IV, havde vi en rigtig god idé om, hvad der fungerede, og hvad der ikke gjorde. Hvilken slags data? Alt fra det konkrete – hvor mange spillere spillede hvert minispil flere gange og hvor ofte – til det mere fortolkningsbaserede som feedback fra brugere og diskussioner på nettet. Denne klarhed gav os selvtilliden til at sætte alt ind på en bragende finale: en storslået bosskamp mod den onde Dronning Imperia.",
      "Det var selvfølgelig ikke nemt for os at finde ud af, hvilken slags spil bosskampen skulle være. Vi vidste, det skulle være et medrivende udstyrsstykke, som levede op til spillernes forventninger. Men det skulle også have tilstrækkelig variation og genspilningsværdi til stadig at være spændende, når man har spillet det flere gange. Og fordi det var et minispil, designet til at skulle spilles, mens man var i kø til en kamp, skulle det være intenst, men kortvarigt. Det skulle føles som en lille lækker snack, ikke et stort måltid.",
      "For at ramme den rigtige balance havde vi brug for en genre, som kombinerede den store produktionsværdi fra [i]Sleet Fighter[/i] med genspilningsværdien fra [i]Drageskak[/i]. Det skulle jo trods alt være det episke opgør mellem Vengeful Spirit, Skywrath Mage og den nye Kez (vores \"tre store\" fra Crownfall-historiens fire dele), som stormer Imperias slot. Vi ville have, at spillerne skulle føle, at de var oppe imod helt umulige odds under deres rejse til dronningen.",
      "[h3]En plan udklækkes[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Én idé, som vandt frem i en kort periode, var en turbaseret kamp i JRPG-stil. Men det viste sig hurtigt, at det ikke duede. Vi havde brug for noget, som hurtigt kastede spillerne ud i handlingen – noget, som var hurtigt, intenst og sjovt at spille mellem Dota-kampe.",
      "Og det var her, at overlevelsesgenren kom ind. Et \"omvendt kuglehelvede\" med uendelige bølger af fjender – det var det perfekte miljø til en altafgørende, episk bosskamp. Spillerne skulle hugge sig vej gennem horder af fjender og samtidigt bruge lidt strategi for at opgradere forskellige evner som forberedelse på det endelige opgør med Imperia. Det ville også være nemt at tilknytte eksisterende genstande og evner fra Dota til handlingen, så spillere allerede ville have en fornemmelse for, hvordan tingende fungerede.",
      "Eftersom vi ville have, at oplevelsen skulle være relativ kort, var genspilningsværdien også en vigtig brik i puslespillet. Overlevelsesgenren gav os en masse variabilitet, da den samme oplevelse aldrig gentages. Spillere har ingen garanti for at få de genstande eller hændelser, som de forventer, i præcis den rækkefølge, de vil have. Variabiliteten opfordrer dig til at blive ved med at prøve og at starte forfra på en måde, som føles udfordrende uden at føles uoverkommelig eller frustrerende. Vi ville ikke nødvendigvis have, at du vandt første gang... men samtidigt ville vi gerne have, at du blev ved med at spille, når du tabte. ",
      "[h3]Tidlige prototyper[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "De tidligste prototyper af [i]Tornereden[/i] startede med de samme kerneelementer som de versioner, vi endte med at udgive. Spilleren valgte en af tre helte, mødte den ene bølge af fjender efter den anden og kom til sidst til Imperia. Det, som disse tidlige forsøg ikke havde, var noget, som på nogen måde var sjovt. Nogle gange vandrede en helt rundt i en fortrinsvis tom bane og stødte til tider ind i et skelet. Andre gange var bølgerne af fjender så overvældende, at det faktisk var umuligt at vinde (eller det troede vi i hvert fald, mere om dette senere). Vi vidste, at der var et sjovt spil et eller andet sted derinde. Vi skulle bare blive ved med at pine vores spiltestere med dårlige builds, indtil vi fandt det.",
      "Alle Valve-medarbejdere er forsøgskaniner, og vores måde at finde ud af, om noget fungerer (eller lige så ofte [i]ikke[/i] fungerer), er ved at sætte folk foran et build. Vi kan brainstorme i al evighed, men før nogen sætter sig ned og spiller, ved vi ikke, om vi har truffet de rigtige valg.",
      "I starten kæmpede spiltesterne med at overleve de første 3-6 minutter. Som regel er det et tegn på, at spillet enten er ude af balance, eller at reglerne ikke er forklaret godt nok. Vi satte os sammen med dem og bad dem fortælle os om deres oplevelse. Øjeblikke, hvor de var usikre på, hvad de skulle gøre som det næste, eller steder, hvor det var så overvældende, at det føltes umuligt, eller hvor det bare var kedeligt. Så gik vi tilbage til skrivebordet og lavede nogle ændringer og gav det til en ny spiltester. Langsomt begyndte vi at se fremskridt.",
      "Og så skete der noget.",
      "Efter en spiltester, som så fortabt ud, havde gennemgået sin første gennemspilning med os, spurgte spilleren: \"Må jeg prøve igen?\"",
      "Det var nyt, og opmuntrende. Tornereden var stadig slet ikke i nærheden af at være god nok endnu. Det tog som regel mindst tre gennemspilninger, før nogen fandt ud af at slå prototypen, men det var i det mindste rart, at vi for en gangs skyld ikke tvang kolleger til at spille vores elendige prototype – de bad rent faktisk om at spille vores elendige prototype igen.  Der var et lille bitte glimt af interesse: \"Jeg hader det ikke fuldstændigt.\" Det var vi tilfredse med.",
      "Men det virkelige mirakel lod vente på sig.",
      "[h3]Heltebuilds[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Et vigtigt aspekt ved overlevelsesgenren, som vores tidlige versioner ikke havde, var konstant pres. Til at starte med lavede vi bare en bølge med et hundrede skeletter på det pågældende level og lod helten hugge dem ned. Når helten havde hugget dem alle sammen ned, lavede vi den næste bølge med skurke på en højere sværhedsgrad. Spiltesterne blev hurtigt trætte af det. Da de opdagede, at det eneste mål var at hugge skurkene ned i en uendelighed, begyndte det at føles som kedeligt arbejde. Den eneste belønning for at dræbe dem mere effektivt var, at man skulle kæmpe mod den næste, sværere bølge hurtigere. (Jubi?)",
      "I sidste ende fandt vi ud af, at når vi lavede et hundrede skeletter, og helten begyndte at hugge løs, skulle vi have en timer og blive ved med at sætte skeletter ind, uanset hvor mange helten dræbte. Når timeren nåede ned på nul, lavede vi en sværere bølge med fjender, som havde en ny timer. Nu aftog presset ikke, og spilleren var hele tiden engageret. ",
      "Men det vigtigste var, at [i]målet[/i] ændrede sig. Da vores helt bare slagtede et lavere og lavere antal skeletter, var målet at \"få antallet af skeletter ned på nul\". Men hvis antallet af skeletter [i]aldrig falder, uanset hvor mange du dræber[/i], så går der ikke lang tid, før spillerne indser, at målet faktisk ikke er at dræbe dem. ",
      "I stedet begynder de at fokusere på, hvad de [i]får[/i], når de dræber alle de skeletter – i dette tilfælde evner og opgraderinger. Pludselig var målet ikke \"dræb alle skeletter\", men \"hvor af mange af de her ting kan jeg dræbe så hurtigt som muligt for at blive så [i]stærk[/i] som muligt?\" I stedet for, at det føltes som kedeligt arbejde, føltes det at høste bølger af fjender nu mere som at jagte den helt store gevinst – hvor hvert dræb førte dig tættere på det perfekte build. ",
      "Og eftersom fremskridt til den næste bølge ikke længere var knyttet til at dræbe alt fra den forrige, havde vi også fået noget nyt: et fælles ur. Det betød, at spillerne nu delte samme rytme – et fælles sprog for, når det begyndte at blive svært. Så da en spiller sagde: \"Jeg kan ikke lide bølgen af edderkopper på minuttal fire\", vidste alle andre med det samme, hvad spilleren mente (de edderkopper er de værste).",
      "Endelig havde vi fundet det sjove. Dette lille skift i fokus hjalp til at tydeliggøre, hvad spillerne kunne lide og hvorfor, og satte gang i en kaskade af nye idéer – stærkere opgraderinger, endnu mere skøre evner og buildmuligheder, vi slet ikke havde tænkt på. Det betød, at spiltesterne kunne lave markant forskellige heltebuilds i én enkelt gennemspilning. Og det betød, at de var mere engagerede i spiltests og gav os bedre feedback og forslag til det næste build.",
      "Altså, hvis vi spurgte flere gange. Efter en spiltest oplevede vi nogle gange, at vores kolleger ikke længere ville tale med os om deres op- og nedture. De ville gerne tale med hinanden om deres heltebuilds og diskutere, hvis der var bedre. ",
      "I takt med at variationen i disse builds voksede, begyndte vi at spekulere på, om vi havde misset en stor brik i puslespillet – hvad hvis selve heltene var lige så unikke som evnerne? Bortset fra startevnerne var spilleroplevelsen i de tidlige prototyper meget den samme, uanset hvilken helt man valgte. Nu tilpassede vi dem og gjorde dem helt unikke. En blev stærkere, en anden hurtigere, en tredje bedre til magisk skade. Det åbnede op for endnu større variabilitet i heltebuilds. Når man valgte én helt fremfor en anden, indebar det også, at man åbnede op for bestemte grene af evner, som man ellers ikke kunne bygge sig til. (Og fordi der altid er lidt held involveret i, hvilke opgraderinger man får, føles hvert eneste valg som et chancespil).",
      "[h3]De første seks minutter[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Mens du er distraheret af at finde ud af, hvilken opgraderingsgren der fører dig til Imperia, øger vi langsomt sværhedsgraden. På et tidspunkt, uden at du lægger mærke til det, er bølgerne af fjender blevet livsfarlige, tempoet er ekstremt, og du kan knap nok holde hovedet over vand. ",
      "Det var i det mindste målet. Nu hvor opgraderingerne var på plads, gik vi videre til spillets tempo. Vi ville have, at oplevelsen var intens, men uden at gå for vidt. (Vi vidste, at de fleste spillere ville spille, mens de stod i kø til en kamp). På den anden side ville vi dog også have nok pusterum til, at spillere kunne nyde at se deres opgraderingsvalg hobe sig op.",
      "Vores matematiske beregninger, som vi havde lavet på bagsiden af en serviet, gav os omkring tolv minutters samlet spilletid – uden at medregne den tre minutter lange kamp mod Imperia til sidst. Så vi gik i gang med at justere tempoet i de første seks minutter. Hvor ofte giver vi spilleren et opgraderingsvalg? Hvor tidligt kan spilleren begynde at stable evner? Hvor meget skade skal hver evne gøre, så det føles tilfredsstillende, men uden at blive for meget? ",
      "Vi justerede gameplayet i sektioner, med fokus på de første seks minutter, og det betød, at de sidste seks minutter i princippet ikke kunne spilles på dette tidspunkt. Vi lod folk spilteste de første seks minutter og bad dem derefter om at stoppe. [i]Teknisk set[/i] kunne de spille videre, men alt efter minuttal seks var en pladsholder. Det var ikke meningen, at folk skulle spille efter dette punkt. (Vi måtte faktisk tigge vores kolleger om ikke at gøre det). ",
      "En sjov bivirkning ved at gøre evnerne og opgraderingerne så sjove, som de blev til, var, at spiltestere ofte var ligeglade med, at halvdelen af spillet stadigvæk ikke kunne spilles. Vi sad ved en kollegas skrivebord og så personen spille gennem første halvdel af spillet. Da kollegaen var seks minutter inde i spillet, sagde vi: ",
      "\"Fedt, tak. Kan du starte spillet forfra?\"",
      "Der var stilhed et øjeblik. ",
      "\"Vent lige, jeg tror, jeg kan gennemføre resten.\" ",
      "Vi måtte minde kollegaen om, at de sidste seks minutter var en forfærdelig ubalanceret ødemark af copy-pastede fjender og i øjeblikket totalt umulig at gennemføre. Det var personen indforstået med. Vi interviewede vores kollega om op- og nedture i spillet. Vedkommende gav os en masse god feedback om gennemspilningen af de første seks minutter. Og så os gå tilbage til vores skrivebord og satte derefter spillet i gang igen og prøvede at gennemføre det alligevel. ",
      "Nogle af vores kolleger tog det som en personlig fornærmelse, at de ikke kunne gennemføre de sidste voldsomt uretfærdige, bogstaveligt talt umulige seks minutter. Så mens vi designede den første halvdel af spillet, slog de hovederne sammen for at gennemføre den uovervindelige anden halvleg. ",
      "Og så skete det: De gennemførte den! ",
      "Til sidst fandt de ud af den præcise kombination af alt for stærke evner, som vi endnu ikke havde finjusteret, og gennemførte den del af spillet, som det ikke var meningen, at man skulle kunne gennemføre. (Hvilket siger en del om spildesign – men måske endnu mere om den slags mennesker, som er interesseret i spildesign).",
      "[h3]Kontrolleret kaos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Da vi var færdige med udviklingen, blev spillets kerne bygget. Evner, kampe mod minibosser og det sidste opgør med Dronning Imperia var alt sammen på plads.  På dette tidspunkt kiggede vi ikke længere efter problemer, som ødelagde spillet, men måder, vi kunne finjustere, afbalancere og perfektionere det, vi allerede vidste, fungerede. Vi fortsatte med at spilteste, men droslede ned med de udtømmende efterspilsinterviews og lod i stedet bare folk spille for sjov (og selvfølgelig for at generere flere data).",
      "Mens de kvantitative data, der kom fra hver gennemspilning, var vigtige, var de kvalitative data fra spiltestene mindst lige så vigtige. I et særligt mindeværdigt tilfælde sluttede en spiltest med, at Den Klagende Masse – internt kaldet for \"Kødbollen\" – overtog halvdelen af skærmen og åd spilleren. På det tidspunkt havde spiltesteren et helt publikum af kolleger, som kiggede ham over skulderen og grinte af hans ulykke. Og selvfølgelig trykkede han \"Spil igen\" med det samme.",
      "Vi var overbeviste om, at vi havde noget, som var værd at udgive, og åbnede op fra at have spiltest med folk, som havde meldt sig frivilligt til at spilteste, til at lade alle, vi kunne finde i virksomheden, spille. I vores tidligste prototyper fik vi en Slack-besked kl. 23, hvor der stod: \"Spillet er for svært\". På dette stadie fik vi stadigvæk den slags Slack-beskeder sent om aftenen, men så kom der en efterfølgende besked kl. 3 om morgenen: \"Ignorer min besked, jeg gennemførte det\". ",
      "Selv med et stort set færdigt spil arbejdede vi stadig på [i]Tornereden[/i] helt frem til udgivelsen af Crownfall del IV. Helt tilbage i begyndelsen af dette blogindlæg sagde vi, at vi kan træffe bedre beslutninger, når vi har gode data til at understøtte dem. Og ja, nu havde vi nogle: Med både interne spiltestere, som var vildt begejstrede for at spille spillet (igen og igen), og en masse data, der fortalte os, hvilke af de dele, vi havde bygget, der gav genklang hos spillerne. Og intet gør et rum fyldt med spiludviklere begejstret som det øjeblik, hvor et spil begynder at være sjovt. Vi ville lave så meget, vi kunne, med de ting, som vi nu vidste, fungerede. Nye genstande, evner, baggrundshistorier og endda bølger – men hver gang vi troede, spillet var perfekt, var der altid en eller anden, som fandt på endnu en idé. Og fordi det som regel var en ret god idé, kunne vi ikke modstå fristelsen til at afprøve den.",
      "Det var ikke bare, at idéer til funktioner blev ved med at komme, men de blev bedre og bedre, jo tættere vi kom på udgivelsen. I de tidlige dage, hvor tingene var mere ustrukturerede, var det svært at skelne mellem, hvad der potentielt var en funktion med høj værdi og en med lav værdi. Da vi havde været i gang i en uge, var det langt mere tydeligt, hvor det var bedst at allokere vores tid og resurser for at gøre spillet bedre.",
      "[h3]Væk fra reden[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Mens vi lagde sidste hånd på [i]Tornereden[/i], kunne vi træde et skridt tilbage og se på det med friske øjne. Udfordringen havde været at bruge det, vi havde lært fra de forrige dele, til at skabe en passende episk bosskamp som afslutning på denne enorme begivenhed. Vi var ganske tilfredse med resultatet, især i betragtning af tidsbegrænsningen. Vi havde fundet det, der gjorde det sjovt.",
      "Desværre havde fællesskabet ikke fundet det endnu. Det, vi ikke havde tænkt på, var, at eftersom [i]Tornereden[/i] var en bosskamp, skulle den logisk set udspilles... ja, der, hvor bossen var, altså til sidst i spillet. Det betød mindst en dag eller to i stille tortur, mens Dotas powerspillere kæmpede sig gennem del IV med umenneskelig hastighed, hvor vi ventede på at se, hvornår spillerne endelig ville få mulighed for at spille det. ",
      "Det viste sig, at vi ikke behøvede at vente længe. Vi tænkte, at det ville tage mindst en dag eller to, før nogen nåede frem til Dronning Imperias tronsal. Det viste sig, at vi i den grad havde undervurderet, hvor hurtigt Dota-spillere kan fortære indhold. Blot seksten timer efter udgivelsen – ja, [i]timer[/i] – havde de første powerspillere allerede kæmpet sig vej gennem hele den sidste del og prøvede [i]Tornereden[/i] for første gang.",
      "Og efterhånden nåede alle andre også frem. I skrivende stund er [i]Tornereden[/i] blevet spillet næsten et hundrede millioner gange. (Hvis du ikke selv er nået til det, eller du vil prøve det en gang til, kan det stadig spilles i Crownfall-arkivet i klienten).",
      "[h3]Uvished er velkomment[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Vi håber, at dette indblik i, hvordan Dota-teamet får stablet et minispil på benene, har givet dig en bedre idé om vores proces – og at du ikke bare har stirret forskrækket på det her blogindlæg, fordi vi finder på alting hen ad vejen. I virkeligheden håber vi, at dette viser, at spildesign ikke er en eller anden mystisk disciplin, som udføres af spiludviklingsgenier, der sidder i mørke lokaler med fingerspidserne presset mod hinanden, men en iterativ proces, hvor man forsøger sig frem, laver fejl og prøver igen, som drives af data og angst og spiltestning og flere fejl og mere spiltestning.",
      "Spiludvikling trives med det iterative – det, der starter som \"ingen idé\", bliver langsomt til \"en idé\" ved at se på tidligere idéer, som har fungeret. Så bliver det til en dårlig prototype, som ingen vil spille, men vi tvinger dem til det alligevel. Så ser vi på, mens de spiller og ikke har det sjovt, og går tilbage og retter alle de ikke så sjove elementer, indtil vi til sidst ser, at folk har det sjovt, når de spiller. Så finpudser vi igen og igen og ser på udgivelsesplanen og græder. Valves etos har altid været, at uvished er velkomment, og at lade data forme udviklingen. Det betyder, at vi ikke altid udgiver ting til tiden. Men vi tror, du vil kunne lide dem, når de er klar."
    ],
    "commentcount": 60,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 229,
    "votedowncount": 29,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747098565,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 229,
  "votes_down": 29,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}