{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Abseits der Pfade: Das Dornennest",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Abseits der Pfade: Das Dornennest",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]Willkommen zurück bei „Abseits der Pfade“, einem Blog, in dem unsere Entwickler über die Herausforderungen, Fehlerbehebungen und gelegentlichen glücklichen Zufälle berichten, die ihre Arbeit an einem so einzigartigen Spiel wie Dota mit sich bringt.[/i]",
      "Ein so großes Event wie Thronsturz war die perfekte Gelegenheit, wilde Ideen umzusetzen, die sich über die Jahre angesammelt hatten. Wir konnten ausprobieren, wie sich Gebietskarten, verzweigte Handlungsstränge, Heldenmarken, Minispiele, Comics, Pixel-Dekorationen und andere Experimente in der Praxis bewähren würden.",
      "Was uns letztlich dazu ermutigt hat, diese Risiken einzugehen, ist ein altbewährtes Erfolgsrezept von Valve: die Freiheit der Iteration. Wir experimentieren, sammeln echte Spielerdaten, hinterfragen unsere Ideen und werfen sie manchmal sogar komplett über den Haufen, um unsere Produkte kontinuierlich zu verbessern. Oft verstehen wir erst, woran wir gerade arbeiten, wenn wir Spieler in die Entwicklung einbeziehen. Daher versuchen wir, diese schnellstmöglich zu integrieren.",
      "Diese Herangehensweise prägt auch unsere Entscheidungsfindung – wichtige Weichenstellungen erfolgen so spät wie möglich in der Entwicklung, wenn wir über die besten (und manchmal einzigen) Daten verfügen. Dabei verlassen wir uns auf die Erlebnisse der Spieler und konzentrieren uns auf das, was bei ihnen gut ankommt.",
      "Dieser Beitrag zu [i]Abseits der Pfade[/i] wirft einen Blick auf das große Finale des vierten und letzten Akts der Thronsturz-Saga: den Bosskampf zwischen unseren Helden und Königin Imperia im [i]Dornennest[/i]. Die Entwicklung dieses Minispiels ist die perfekte Fallstudie, um zu zeigen, wie Spieltests und die dadurch generierten Daten unsere Entscheidungen beeinflussen.",
      "[h3]Der Weg zu Imperia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Das erste (und einzige) Minispiel in Akt I war ein einfaches Angel-Minispiel, bei dem Tidehunter ihre Angelkünste auf die Probe stellte, in der Hoffnung, sich ein Frühstück ergattern zu können. Das war es, was Akt I ausmachte: Viele kleine Ideen, die wir auf der Gebietskarte verteilt hatten, um herauszufinden, womit sich die Spieler beschäftigen würden. Die Spielerdaten aus Akt I ermutigten uns, Akt II mit weiteren abenteuerlichen Minispielen zu spicken. In Akt III trafen Spieler in Eismarsch auf [i]Sleet Fighter[/i], ein Prügelspiel in Tusks Lieblingsbar, [i]Drachenschach[/i], ein Kombinationsspiel gegen Winter Wyvern, und [i]Zaugs Hort[/i], ein Shoot-’Em-Up, bei dem Vengeful Spirit gegen einen bösen Drachen kämpft. ",
      "Vor der Veröffentlichung von Akt IV hatten wir ein gutes Gespür dafür entwickelt, was funktionierte und was nicht. Natürlich verließen wir uns dabei auf die erhobenen Daten: Wie viele Spieler die einzelnen Minispiele gespielt hatten und wie oft sowie auf subjektives Feedback von Spielern, beispielsweise aus Onlineforen. Diese Daten gaben uns das Selbstvertrauen, die Thronsturz-Saga mit einem atemberaubenden Finale zu beenden – dem epischen Bosskampf gegen die böse Königin Imperia.",
      "Es war natürlich nicht einfach, sich auf eine bestimmte Art von Bosskampf festzulegen. Wir wussten, dass wir den Spielern ein Spektakel mit hohen Einsätzen bieten mussten, das sowohl abwechslungsreich war als auch beim wiederholten Spielen Spaß machte. Und weil der Bosskampf in erster Linie ein Minispiel ist, das die Zeit in der Spielsuche versüßen soll, musste er intensiv und kurz sein. Er sollte also mehr wie ein schmackhafter Snack als eine umfangreiche Mahlzeit sein.",
      "Für die richtige Balance brauchten wir ein Genre, das das ausgefeilte Design von [i]Sleet Fighter[/i] mit dem Wiederspielwert von [i]Drachenschach[/i] kombinierte. Schließlich handelte es sich um den Showdown zwischen den drei wichtigsten Protagonisten der Thronsturz-Saga Vengeful Spirit, Skywrath Mage sowie dem Neuling Kez und der Tyrannin Imperia. Wir wollten Spieler im Kampf gegen die Königin mit unüberwindlich erscheinenden Hindernissen konfrontieren.",
      "[h3]Den Plan schmieden[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Unsere erste Idee war ein rundenbasierter Kampf im JRPG-Stil. Aber uns wurde schnell klar, dass wir ein Genre benötigten, das Spieler schneller in Action versetzt – ein kurzes, intensives Minispiel, das das Warten während der Spielsuche versüßt.",
      "Dann kam das Survival-Genre ins Spiel, quasi ein umgekehrtes Bullet-Hell-Spiel, das sich mit seinen endlosen Wellen an Gegnern als perfekte Herausforderung für einen Bosskampf entpuppte. Spieler müssen sich einen Weg durch Horden von Feinden kämpfen und in der Hitze des Gefechts eine Strategie zur Verbesserung ihrer Fähigkeiten entwickeln, um im finalen Showdown mit Imperia eine Chance zu haben. Ein weiteres Plus ist die einfache Integration von bekannten Gegenständen und Fähigkeiten aus Dota, durch die Spieler schneller ein Gefühl dafür entwickeln, wie Dinge funktionieren.",
      "Da jeder Kampf relativ kurz sein musste, war es wichtig, dass auch wiederholtes Spielen Spaß machte. Glücklicherweise bietet das Survival-Genre Spielern in jeder Partie ein unterschiedliches Erlebnis. Sie können sich nie darauf verlassen, dass Sie die erwarteten Gegenstände erhalten oder Ereignisse sich in der gewohnten Reihenfolge wiederholen. So viel Abwechslung ermutigt Spieler, bei jedem Durchgang neu zu experimentieren; auf eine Weise, die sich herausfordernd, jedoch nicht unüberwindbar oder frustrierend anfühlt. Wir wollten nicht, dass Spieler beim ersten Mal gewinnen, sondern sie motivieren, es nach einer Niederlage erneut zu versuchen. ",
      "[h3]Die ersten Prototypen[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Die ersten Prototypen von [i]Dornennest[/i] hatten dieselben Kernelemente wie die Version, die wir schließlich veröffentlicht haben. Der Spieler wählt einen von drei Helden aus, kämpft sich durch endlose Wellen von Gegnern und konfrontiert schließlich Imperia im Thronsaal. Leider machten diese ersten Versionen keinen Spaß. Zunächst wanderte ein Held über eine fast leere Karte und stieß dabei gelegentlich auf ein Skelett. Dann waren die Wellen der Gegner so überwältigend, dass ein Sieg unmöglich war (dachten wir zumindest; mehr dazu später). Wir wussten aber, dass sich der Spielspaß irgendwo versteckte. Um diese unterhaltsame Spielversion zu finden, mussten wir unsere Tester einfach weiter mit schlechten Builds quälen.",
      "Jeder Valve-Mitarbeiter ist ein Versuchskaninchen. Mit ihrer Hilfe testen wir jeden Build und finden heraus, ob etwas funktioniert oder, genauso oft, [i]nicht[/i] funktioniert. Wir können ewig mit Ideen jonglieren, aber bevor sich jemand vor den PC setzt und spielt, wissen wir nicht wirklich, ob wir diese erfolgreich umgesetzt haben.",
      "Anfangs hatten die Spieltester Mühe, die ersten fünf Minuten zu überleben. Normalerweise ist das ein Zeichen dafür, dass das Spiel entweder unausgewogen ist oder seine Regeln sich nicht ausreichend erschließen. Wir setzten uns mit den Testern zusammen und ließen uns ihre Spielerfahrung beschreiben. Es stellte sich heraus, dass es viele Momente gab, in denen sie sich nicht sicher waren, was sie als Nächstes tun sollten, und auch solche, die sie überwältigten oder sogar langweilten. Also setzten wir uns zurück an unsere Schreibtische, nahmen einige Änderungen vor und präsentierten das Ergebnis dem nächsten Spieltester. Langsam begannen wir, Fortschritte zu machen.",
      "Und dann geschah es!",
      "Nachdem er uns durch seinen ersten gescheiterten Durchlauf geführt hatte, fragte ein Spieltester: „Kann ich es noch einmal versuchen?“",
      "Das war neu und ermutigend. Dornennest war weit davon entfernt, ein gutes Spiel zu sein – normalerweise benötigten Tester mindestens drei Durchläufe, um zu gewinnen –, aber wir freuten uns, dass wir zum ersten Mal unsere Kollegen nicht zwingen mussten, den miserablen Prototypen zu spielen. Sie bestanden sogar darauf, es noch einmal probieren zu dürfen.  Ein Schimmer Hoffnung sagte also: „Ganz so schlecht ist es jetzt auch nicht.“ Das motivierte uns ungemein.",
      "Aber der wahre Durchbruch sollte später folgen.",
      "[h3]Helden-Builds[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Ein wichtiger Aspekt des Survival-Genres, den unsere frühen Versionen nicht berücksichtigten, ist ständiger Druck. Zunächst bevölkerten wir die Karte einfach mit hundert angriffslustigen Skeletten und ließen den Helden auf sie los. Nachdem der Held alle Skelette besiegt hatte, schickten wir die zweite Welle mit einem höheren Schwierigkeitsgrad hinterher. Den Spieltestern wurde das schnell zu langweilig, da ihre einzige Aufgabe darin bestand, endlos auf Bösewichte einzuhacken. Die einzige Belohnung für effizienteres Kämpfen bestand darin, dass man früher gegen die nächste, härtere Welle kämpfen konnte. (Juhu!?)",
      "Unsere Lösung für dieses Problem war ein Timer. Während die Zeit lief, ließen wir die ersten hundert Skelette auf den Helden los und füllten ihre Ränge permanent auf, egal, wie viele vernichtet wurden. Nach Ablauf des Timers flutete die nächste härtere Welle die Karte mit ihrem eigenen Timer. Dadurch ließ der Druck nie nach und der Spieler blieb engagiert. ",
      "Noch wichtiger war jedoch, dass sich dadurch die [i]Ziele[/i] des Spielers änderten. Als der Held einer begrenzten Zahl an Skeletten gegenüberstand, lautete es: „Reduziere die Anzahl der Skelette auf null“. Wenn sich jedoch die Anzahl der Skelette [i]trotz allen Hackens nicht verringert[/i], wird klar, dass es nicht allein auf ihre Vernichtung ankommt. ",
      "Der Spieler konzentriert sich stattdessen darauf, welche [i]Belohnung[/i] er für vernichtete Skelette bekommt – in unserem Fall neue Fähigkeiten und Upgrades. Plötzlich lautete das Ziel nicht mehr „Vernichte alle Skelette“, sondern „Vernichte so schnell wie möglich viele Skelette, um so [i]mächtig[/i] wie möglich zu werden“. Anstatt sich wie eine lästige Pflicht anzufühlen, glich das Ausmerzen von Skeletten der Jagd nach einem Jackpot – jeder Kill brachte den Spieler dem perfekten Helden-Build näher. ",
      "Da das Erscheinen der nächsten Welle nicht mehr von der kompletten Auslöschung der ersten abhing, erhielt das Spiel eine Uhr. Dies bedeutete, dass alle Spieler nun im gleichen Rhythmus schwierige Momente meisterten und sich somit darüber austauschen konnten. Wenn also ein Spieler sagte, „Ich hasse die Spinnenwelle in der vierten Minute“, wussten alle anderen sofort, was er damit meinte. (Diese Spinnen sind das Schlimmste.)",
      "Endlich machte das Minispiel Spaß. Diese kleine Schwerpunktverlagerung half nicht nur dabei, darzulegen, was den Spielern Spaß machte, sondern löste auch eine Flut neuer Ideen aus – mächtigere Upgrades, verrücktere Fähigkeiten und Helden-Builds, an die wir zuvor nicht einmal gedacht hatten. Was wiederum bedeutete, dass unsere Spieltester bald in einem einzigen Durchgang völlig unterschiedliche Helden-Builds erstellen konnten. Und dadurch waren sie bei den Spieltests engagierter und konnten uns besseres Feedback für den nächsten Build geben.",
      "Vorausgesetzt, sie hatten Zeit, unsere Fragen zu beantworten. Immer öfter steckten Tester nach einem Spiel lieber ihre Köpfe zusammen, anstatt mit uns über Erfolg oder Niederlage zu sprechen. Sie wollten lieber miteinander über ihre Helden-Builds sprechen und darüber streiten, welcher besser sei. ",
      "Während die Builds immer vielfältiger wurden, fragten wir uns, wie es wäre, wenn sich die Helden genauso einzigartig anfühlten wie ihre Fähigkeiten? In frühen Prototypen war das Spielerlebnis, abgesehen von der Startfähigkeit, weitgehend identisch, egal welchen Helden man auswählte. Also optimierten wir sie, damit der Spieler eine echte Entscheidung bei der Auswahl treffen musste: Bevorzuge ich Stärke, Geschwindigkeit oder magischen Schaden? Dies erhöhte die Variabilität der Helden-Builds erheblich. Die Wahl eines bestimmten Helden bedeutete auch, dass Fähigkeitszweige freigeschaltet wurden, die man sich mit einem anderen Helden nicht aneignen konnte. Und da auch immer ein bisschen Glück im Spiel war, welche Upgrades man bekommt, fühlte sich jede Entscheidung wie eine riskante Wette an.",
      "[h3]Die ersten sechs Minuten[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Während unsere Tester damit abgelenkt waren, herauszufinden, welcher Upgradezweig sie zu Imperia führt, steigerten wir langsam den Schwierigkeitsgrad. Allmählich und ohne dass sie es bemerkten, wurden die Gegner tödlicher, das Tempo unerbittlicher und sie konnten kaum noch den Kopf über Wasser halten. ",
      "Zumindest war das das Ziel, damit wir mit den nächsten Iterationen das Tempo des Gameplays steigern konnten. Wir wollten ein intensives Erlebnis erzielen, das nicht zu viel Zeit in Anspruch nimmt. (Wir wussten, dass das Minispiel bei der Suche nach einer Partie gespielt werden würde.) Andererseits wollten wir unseren Testern auch genügend Raum bieten, herauszufinden, wie sich ihre Upgrade-Auswahl im Spiel auswirkte.",
      "Grob gerechnet hatten wir ohne den dreiminütigen Kampf gegen Imperia am Ende eine Gesamtspielzeit von etwa zwölf Minuten. Also setzten wir uns daran, das Tempo der ersten sechs Minuten zu verbessern. Wir dachten darüber nach, wie oft wir Spielern ein Upgrade zur Auswahl geben und wie früh sich Fähigkeiten aufsummieren sollten. Wie viel Schaden sollte jede Fähigkeit zufügen, um sich befriedigend, aber nicht zu zerstörerisch anzufühlen? ",
      "Da wir das Gameplay abschnittsweise optimierten und uns dabei auf die ersten sechs Minuten konzentrierten, konnte man sie zu diesem Zeitpunkt im Prinzip nicht spielen. Wir beschränkten unsere Tests auf die ersten sechs Minuten und beendeten sie dann. Technisch gesehen hätten die Tester weiterspielen können, aber alles nach der sechsten Minute war ein Platzhalter. Es war also zwecklos, weiterzuspielen. (Wir haben unsere Kollegen angefleht, es nicht zu tun.) ",
      "Dank des gesteigerten Unterhaltungswerts der Fähigkeiten und Upgrades war es den Spieltestern nun oft egal, dass die zweite Hälfte des Spiels immer noch unspielbar war. Wir schauten Kollegen am Schreibtisch beim Spielen der ersten Hälfte des Spiels über die Schulter. Sobald sie die Sechs-Minuten-Marke erreichten, unterbrachen wir das Spiel und sagten: ",
      "„Danke, großartig! Kannst du das Spiel von vorne beginnen?“",
      "Der Tester pausierte das Spiel und meinte: ",
      "„Wartet, ich glaube, ich schaffe das.“ ",
      "Wir schüttelten den Kopf und erinnerten den Spieler daran, dass die nächsten sechs Minuten aus kopierten und eingefügten Gegnern in einer unausgewogene Einöde bestanden, die derzeit nicht zu schlagen waren. Der Spieler nickte verständnisvoll mit dem Kopf, beschrieb uns ausführlich die Hoch- und Tiefpunkte seines Spielerlebnisses und gab uns wertvolles Feedback zu den ersten sechs Minuten. Dann gingen wir zurück zu unseren Schreibtischen und der Tester konnte es kaum abwarten, das Spiel fortzusetzen, in dem festen Glauben, gewinnen zu können. ",
      "Einige unserer Kollegen empfanden es als persönliche Beleidigung, dass sie die letzten, extrem unfairen und nicht gewinnbaren sechs Minuten nicht überstehen konnten. Während wir also die erste Hälfte des Spiels optimierten, bündelten sie gemeinsam ihre Ressourcen und kämpften unverdrossen gegen die unschlagbaren Gegner der zweiten Hälfte an. ",
      "Und hier ist die Pointe: Sie schafften es! ",
      "Sie entdeckten die genaue Kombination der stärksten, von uns noch nicht verfeinerten, Fähigkeiten und gewannen den Teil des Spiels, der eigentlich nicht gewonnen werden konnte. (Das sagt viel über Spieledesign aus – aber vielleicht noch mehr über die Art von Leuten, die sich mit Spieledesign ihren Lebensunterhalt verdienen.)",
      "[h3]Kontrolliertes Chaos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Am Ende der Entwicklung war der Kern des Spiel vollendet. Fähigkeiten, Begegnungen mit Mini-Bossen und der Showdown mit Königin Imperia im Finale waren fertig.  Zu diesem Zeitpunkt suchten wir nicht mehr nach Problemen, die das Spiel gegebenenfalls abstürzen ließen, sondern nach Möglichkeiten, gut funktionierende Teile anzupassen, auszugleichen und auf Hochglanz zu polieren. Wir führten weiterhin Spieletests durch, reduzierten jedoch die ausführlichen Interviews nach Spielsitzungen und ließen Spieler nur noch Spaß haben (und natürlich Daten generieren).",
      "Dabei waren die quantitativen Daten aus jedem Durchlauf ebenso wichtig wie die qualitativen. In einem denkwürdigen Beispiel endete ein Spieletest damit, dass die Klagende Masse – intern „Fleischklößchen“ genannt – die Hälfte des Bildschirms einnahm und den Spieler verschlang. Zu diesem Zeitpunkt hatte der Spieletester ein Publikum aus Kollegen hinter sich, die ihm zusahen und alle über sein Unglück lachten. Natürlich spielte er den Abschnitt sofort erneut.",
      "Wir waren überzeugt, dass wir etwas hatten, dessen Veröffentlichung sich lohnte, und hatten die Testphase eröffnet. Unsere Freiwilligen waren alle Kollegen, die wir firmenweit zum Testen hatten überreden können. Beim Testen der ersten Prototypen bekamen wir um 23 Uhr eine Slack-Nachricht, die sagte, das Spiel sei zu schwierig. Zu diesem Zeitpunkt bekamen wir immer wieder Slack-Nachrichten um 23 Uhr, aber dann um 3 Uhr morgens oft auch Folgenachrichten, wie: „Kümmert euch nicht drum, ich bin jetzt weg.“ ",
      "Obwohl das Spiel fast fertig war, arbeiteten wir noch bis zur Veröffentlichung von Akt IV von Kronensturz an [i]Dornennest[/i]. Ganz am Anfang dieses Beitrags steht, dass wir bessere Entscheidungen treffen können, wenn wir gute Daten haben. Nun, zu diesem Zeitpunkt hatten wir die; da interne Spieletester genauso gespannt darauf waren, das Spiel (immer wieder) zu spielen, verfügten wir über zahlreiche Daten, die uns verrieten, welche Teile von [i]Dornennest[/i] besonders Anklang fanden. Und nichts begeistert einen Raum voller Spieleentwickler mehr als der Moment, in dem ein Spiel anfängt, Spaß zu machen. Wir wollten daher weiter an den Dingen arbeiten, die funktionierten – neue Gegenstände, Fähigkeiten, Hintergrundgeschichten und sogar Wellen. Doch jedes Mal, wenn wir dachten, das Spiel sei jetzt ganz sicher fertig, kam unweigerlich jemand mit „nur noch einer“ Idee um die Ecke. Und weil es meistens eine gute Idee war, konnten wir nicht widerstehen, sie auszuprobieren.",
      "Es war nicht nur so, dass wir ständig neue Ideen für neue Funktionen hatten. Unsere Ideen wurden auch immer besser, je näher die Veröffentlichung rückte. Zu Beginn der Entwicklung, als vieles noch vage war, war es schwierig, zwischen einer potenziell hochwertigen und einer letztlich relativ wertlosen Funktion zu unterscheiden. Doch eine Woche vor der Veröffentlichung war klar, in was wir unsere Ressourcen und Zeit am besten investieren sollten.",
      "[h3]Das Nest verlassen[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Als wir [i]Dornennest[/i] den letzten Schliff gaben, konnten wir einen Schritt zurücktreten und es mit frischem Blick betrachten. Die Herausforderung bestand darin, zuvor Gelerntes zu nutzen, um einen angemessen epischen Bosskampf zum Abschluss eines riesigen Events zu kreieren. Wir waren ziemlich zufrieden mit dem Ergebnis, insbesondere angesichts der Zeitbeschränkungen. Wir hatten etwas geschaffen, das uns Spaß machte.",
      "Leider machte es aber der Community keinen Spaß. Wir hatten nicht bedacht, dass, da es sich um einen Bosskampf handelte, dieser in [i]Dornennest[/i] logischerweise dort stattfinden musste, wo sich der Boss am Ende des Spiels befindet. Dies bedeutete mindestens ein oder zwei Tage stiller Folter, während wir darauf warteten, dass eingefleischte Dota-Spieler sich mit unmenschlicher Geschwindigkeit durch Akt IV kämpften und die restlichen Spieler endlich die Chance hatten, [i]Dornennest[/i] ebenfalls zu spielen. ",
      "Wir mussten nicht lange warten. Wir dachten, wir hätten mindestens ein oder zwei Tage Zeit, bevor jemand den Thronsaal von Königin Imperia erreicht. Es stellte sich heraus, dass wir stark unterschätzt hatten, wie schnell Dota-Spieler Inhalte durchspielen können. Nur sechzehn Stunden nach dem Start – ja, [i]Stunden[/i] – hatten sich die ersten Power-Spieler bereits durch den gesamten letzten Akt gekämpft und erhielten den ersten Vorgeschmack auf [i]Dornennest[/i].",
      "Andere Spieler holten schnell auf. Und zum Zeitpunkt, als wir diesen Beitrag verfassten, wurde [i]Dornennest[/i] fast hundert Millionen Mal gespielt. (Wenn Sie es bisher nicht geschafft haben oder es einfach noch einmal versuchen möchten, finden Sie das Kapitel im In-Client des Crownfall-Archivs.)",
      "[h3]Ungewissheit willkommen[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Wir hoffen, dass dieser Einblick in das Dota-Team während der Entwicklung eines Minispiels Ihnen ein besseres Verständnis unserer Arbeitsvorgänge vermitteln konnte. Wir hoffen auch, dass Sie diesen Blog-Beitrag nicht nur entsetzt angestarrt haben, weil Ihnen beim Lesen klar wurde, dass wir uns einfach ohne Vorauszudenken in die Arbeit stürzen. Wir wollen verdeutlichen, dass es sich beim Spiel-Design nicht um die mystische Kunst von Genies handelt, die in abgedunkelten Räumen grübeln, sondern um einen iterativen Prozess, der von Daten, Nervosität, Spieltests, Fehlschlägen, weiteren Spieltests, weiteren Fehlschlägen und noch mehr Spieltests geprägt ist.",
      "Die Spieleentwicklung lebt von wiederholten Verbesserungen – was mit „keine Ahnung“ beginnt, verwandelt sich langsam in eine Idee, indem man sich frühere Ideen ansieht, die funktioniert haben. Dann wird daraus ein schlechter Prototyp, den niemand spielen will, aber wir entwickeln ihn trotzdem. Anschließend beobachten wir, dass das Spielen bestimmter Teile keinen Spaß macht, und arbeiten daran, diese zu verbessern, bis Leute Spaß beim Spielen haben. Und dann beginnt der Feinschliff mit ängstlichem Blick auf den Veröffentlichungskalender. Das Ethos von Valve bestand schon immer darin, Ungewissheit zu akzeptieren und die Entwicklung auf Grundlage von Daten vorzunehmen. Das bedeutet, dass wir Inhalte nicht immer pünktlich veröffentlichen. Aber wir sind überzeugt, dass sie Spielern gefallen werden, wenn sie fertig sind."
    ],
    "commentcount": 4,
    "tags": [],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091375,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}