{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Между линий: как создавался «Терновый трон»",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Между линий: как создавался «Терновый трон»",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[i]Мы продолжаем рубрику «Между линий», где рассказываем о сложностях, ошибках и счастливых случайностях, с которыми сталкиваемся во время работы над такой уникальной игрой, как Dota 2.[/i]",
      "Во время такого масштабного события, как «Павшая корона», нам часто доводилось экспериментировать: над картами актов, разветвляющимся сюжетом, геройскими жетонами, мини-играми, комиксами, пиксельной графикой и множеством других идей, которые мы уже несколько лет хотели опробовать.",
      "Принимая эти рискованные решения, мы сохраняли уверенность в себе благодаря свободе, которую нам (и Valve в целом) даёт итеративный подход: мы собираем данные о настоящих игроках, сравниваем их со своими ожиданиями и время от времени меняем своё мнение. Нередко мы говорим, что сможем до конца осознать результат своих трудов, только когда увидим его в руках игроков, поэтому стараемся дойти до этого этапа как можно скорее.",
      "Подобный подход приводит и к тому, что при разработке мы обычно принимаем решения как можно позднее — когда у нас уже есть самая полезная (а иногда единственная) информация. На каждом этапе мы полагаемся на реальный опыт игроков, что помогает нам сосредоточиться на привлекательных аспектах и избегать неприглядных.",
      "Сегодня в рубрике [i]«Между линий»[/i] мы подробно расскажем о разработке того, что появилось в «Павшей короне» относительно поздно, — финальной битвы в четвёртом акте между нашими героями и королевой Империей, то есть мини-игры «Терновый трон». На её примере мы также покажем, как тестирование и полученные с его помощью данные влияют на наши решения.",
      "[h3]Путь к Империи[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Первой (и единственной) мини-игрой в первом акте была самая обычная рыбалка, в которой Левиафан проверял ваше удильное мастерство в надеждах, что ему выловят завтрак. Впрочем, такой была бóльшая часть первого акта: мы разбросали по карте свои идейки и ждали реакции игроков. Обнадёживающие данные придали нам уверенности и подтолкнули на более смелые решения во втором акте, а в третьем игроков уже ждали [i]«Сосулечный боец»[/i] (файтинг в любимом кабаке Бивня), [i]«Драконьи шахматы»[/i] (головоломка формата «три в ряд» от Зимней виверны) и [i]«Логово Зауга»[/i] (shoot 'em up, где Шен отстреливалась от злого дракона в хитросплетённых пещерах Айсрека). ",
      "Подбираясь к четвёртому акту, мы в целом понимали, что работает, а что нет. Какие у нас были данные? Все! От строгих (числа и частоты запусков каждой мини-игры) до описательных (отзывов пользователей и обсуждений в сети). Совокупность всей этой информации ясно дала нам понять: эпическому финальному противостоянию, взрывной и сносящей все устои битве с королевой Империи — быть!",
      "Разумеется, было нелегко определиться, какой будет геймплей у этой битвы. Мы знали, что игроки ожидают чего-то грандиозного и эффектного, а ещё нельзя было обойтись без разнообразия и реиграбельности, которые сделали бы повторные «забеги» не менее увлекательными. К тому же, мини-игра должна быть ярким и недолгим развлечением при поиске матча — эдаким приятным перекусом, а не полноценным ужином.",
      "Нам нужно было найти жанр, который позволил бы достичь всех поставленных целей, объединив качество [i]«Сосулечного бойца»[/i] и реиграбельность [i]«Драконьих шахмат»[/i]. Как-никак, в этой эпичной схватке Шен, Драгонус и Кез (новенький герой, вошедший в нашу тройку «Павшей короны») берут штурмом крепость Империи. Нам хотелось, чтобы на пути к королеве игроки почувствовали: им противостоят явно превосходящие силы.",
      "[h3]Вынашивание идей[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Одной из идей, которой мы уделили некоторое внимание, была пошаговая битва в стиле японских ролевых игр. Однако мы довольно быстро поняли, что это не то. Нам нужно было что-то, где не нужно долго ждать. Нужно было быстрое, насыщенное и весёлое развлечение между матчами.",
      "Так мы и пришли к Survivors-играм. «Пулевой ад наоборот» с волнами бесчисленных врагов идеально подошёл для эпичной и напряжённой битвы с боссом. Игрок прорубал бы свой путь через орды противников, при этом используя несложную механику усиления способностей, чтобы подготовиться к финальной схватке с Империей. А ещё в этот жанр можно легко перенести предметы и способности из Доты, отчего игрокам будет на что ориентироваться.",
      "Поскольку мы хотели, чтобы битва была относительно короткой, реиграбельность стала ещё одной важной частью головоломки. Выбранный жанр уже предоставил нам большое разнообразие, в котором ни одна попытка не будет похожа на предыдущую: ни предметы, ни события не повторяются в том порядке, которого хотелось бы игроку. Подобная вариативность подталкивает начинать с чистого листа снова и снова, но при этом не вызывает чувства безысходности или раздражения. Мы не слишком хотели, чтобы вы победили с первой же попытки... но и не хотели, чтобы вы бросали игру после поражения. ",
      "[h3]Ранние прототипы[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Самые ранние прототипы [i]«Тернового трона»[/i] начинались с тех же ключевых элементов, что и выпущенная в итоге версия. Игрок выбирал одного из трёх героев, одолевал волны врагов и в конце концов добирался до Империи. Вот только одного ключевого элемента в них не было — какого-либо веселья. Иногда герой бродил по почти пустой карте, изредка натыкаясь на скелета. В других случаях волны врагов были настолько превосходящими, что победить было попросту невозможно (по крайней мере, так мы думали; подробнее об этом позже). Мы знали, что где-то здесь кроется увлекательная игра, — оставалось лишь найти её, попутно мучая наших тестировщиков неудачными сборками.",
      "Каждый сотрудник Valve — это подопытный кролик, которому мы можем выдать сборку игры, чтобы оценить её удачность (или, столь же часто, [i]не[/i]удачность). Можно сколько угодно искать новые идеи, но мы не поймём, верные ли решения мы приняли, пока не усадим кого-нибудь за игру.",
      "Вначале тестировщики с трудом переживали первые 3–6 минут. Как правило, это означает, что у игры либо проблемы с балансом, либо с донесением правил. Мы просили, чтобы тестировщики подробно описали свои впечатления: моменты, когда игра заставляла их растеряться, когда она казалась до невозможности сложной и даже когда им попросту было скучно. А затем мы возвращались за работу, вносили изменения и звали нового тестировщика. Постепенно мы начали замечать прогресс.",
      "А потом кое-что случилось.",
      "Рассказывая о своей первой попытке, только что проигравший тестировщик спросил: «А можно, я попробую ещё раз?»",
      "Эта реакция была новой — и обнадёживающей. «Терновый трон» даже близко не был хорошей игрой (обычно победную стратегию получалось найти как минимум с третьей попытки), но было приятно, что на этот раз мы не заставляли коллегу играть в наш паршивый прототип. Коллега сам захотел ещё раз сыграть в наш паршивый прототип.  Это была крошечная искорка интереса: «Мне не совершенно омерзительно играть». Мы с радостью приняли этот отзыв.",
      "Но настоящая эврика была впереди.",
      "[h3]Сборки героев[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Одним из ключевых аспектов Survivors-игр, который отсутствовал в наших ранних версиях, было постоянное напряжение. Сперва мы просто создавали волну из сотни скелетов и позволяли герою их кромсать. Когда материал для кромсания заканчивался, мы создавали следующую, более сложную волну плохишей. Тестировщикам это быстро наскучило: как только они понимали, что единственной целью было бесконечное кромсание врагов, игра превращалась в рутину. Единственной наградой за эффективную расправу над волной было более быстрое появление более сложных противников. (Ура?)",
      "В конце концов мы поняли: когда мы создали сотню скелетов, а герой приступил к кромсанию, нам нужно запустить таймер и пополнять ряды скелетов, сколько бы их ни убивали. По истечении таймера мы создавали волну более сложных врагов с новым таймером — теперь напряжение не спадало, а игрокам всегда было чем заняться. ",
      "Но, что ещё важнее, изменилась их [i]цель[/i]. Когда наш герой просто расправлялся с редеющей толпой скелетов, целью было снизить число врагов до нуля. Однако если с убийством скелетов их число [i]не уменьшается[/i], игроки быстро осознают, что цель состоит не в убийстве. ",
      "Вместо этого они обращают внимание на [i]награду[/i] за убийство полчищ скелетов — в нашем случае на способности и улучшения. Внезапно цель превратилась из «убить всех скелетов» в «сколько этих тварей можно убить как можно быстрее, чтобы стать как можно [i]сильнее[/i]»? Из рутины расправа над врагами превратилась в погоню за джекпотом, и каждое убийство приближало игрока к идеальной сборке. ",
      "Поскольку переход к новой волне больше не сводился к уничтожению всех противников до одного, мы получили кое-что новое: общий таймер. Это означало, что у игроков был единый ритм — общий язык, который описывает усложнение игры. Так что если кто-то говорил про «мерзких пауков на четвёртой минуте», все понимали, о чём идёт речь (эти пауки и правда хуже некуда).",
      "Мы наконец нашли источник веселья. Совсем небольшое смещение акцентов помогло понять, что и почему нравится игрокам, а также породило целый ряд новых идей: более мощных улучшений, безумных способностей и комбинаций, о которых мы даже не думали. Это означало, что тестировщики могли создавать принципиально разные сборки — и что они вовлекались сильнее, отчего давали более полезные отзывы и предложения для будущих сборок.",
      "По крайней мере, если мы просили этого несколько раз. Иногда мы обнаруживали, что после тестирования наши коллеги хотят не рассказывать нам о плюсах и минусах, а обсуждать сборки друг с другом и спорить, какая из них лучше. ",
      "По мере того, как росло разнообразие сборок, мы начали задумываться, не упустили ли значительную часть головоломки: что, если сами герои были бы такими же уникальными, как способности? В ранних прототипах процесс игры был почти одинаковым вне зависимости от выбранного героя, не считая его стартовой способности. Теперь же мы делали выбор поистине уникальным — один герой сильнее, другой быстрее, третий лучше наносит магический урон, — что ещё больше расширило разнообразие сборок. Выбирая одного героя вместо другого, игрок также открывал для себя определённые ветки способностей, которые в ином случае нельзя было бы развить. (А поскольку список доступных улучшений зависел от удачи, каждый выбор казался весьма рискованным.)",
      "[h3]Первые шесть минут[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Между тем, пока вы витаете в облаках, продумывая путь по улучшениям, которые помогут вам добраться до Империи, мы постепенно повышаем сложность. Вы даже не заметили, что в какой-то момент волны врагов стали смертоносными, а темп — неумолимым, тогда как вы едва держитесь на плаву. ",
      "По крайней мере, такова была задумка. Разобравшись с улучшениями, мы перешли к темпу геймплея. С одной стороны, игра должна быть напряжённой, но не изматывающей (ведь мы знали, что большинству она будет скрашивать ожидание при поиске матча). С другой стороны, мы хотели дать игрокам достаточно времени, чтобы они получили удовольствие от наблюдения за тем, как сочетаются их улучшения.",
      "По ну очень примерным подсчётам у нас было двенадцать минут игры (не считая трёхминутного финала с Империей), поэтому мы начали работать над темпом первых шести минут. Как часто игрок должен выбирать улучшение? Как рано он сможет сочетать способности? Какой урон должна наносить каждая способность, чтобы приносить наслаждение, но не казаться чересчур сильной? ",
      "Поскольку мы налаживали геймплей по частям, работа над первыми шестью минутами означала, что в этот момент последние шесть минут были практически неиграбельными. Мы давали протестировать первые шесть минут игры, а затем требовали остановиться. [i]Строго говоря[/i], можно было играть и дальше, но после шестой минуты у нас были одни заглушки. Дальше играть было не положено (о чём мы умоляли наших коллег). ",
      "Забавный побочный эффект того, что мы делали способности и улучшения как можно более увлекательными, заключался в том, что часто тестировщикам было всё равно, что половина игры ещё не была готова. Мы садились за стол коллеги, наблюдали за первой половиной игры, и как только таймер доходил до шести минут: ",
      "«Отлично, спасибо! — говорили мы, — Можешь начать заново?»",
      "Пауза. ",
      "«Знаете, что? Кажется, я ещё могу выиграть». ",
      "Мы напоминали коллеге, что последние шесть минут были суровой несбалансированной пустошью накопированных врагов, которую пока что невозможно пройти. Коллега отвечал, что понимает. Мы задавали вопросы о плюсах и минусах, получали много отличных замечаний о первых шести минутах игры. А когда мы уходили за свои столы, коллега провожал нас взглядом, снимал игру с паузы и всё равно пытался её пройти. ",
      "Некоторые из наших коллег приняли на свой счёт тот факт, что они не способны пройти последние шесть чудовищно нечестных и буквально непреодолимых минут. В итоге, пока мы дорабатывали первую половину игры, они объединились и коллективными усилиями долбились над непроходимой второй половиной. ",
      "И вот в чём штука: они её прошли. ",
      "В конце концов они вычислили точное сочетание слишком сильных способностей, которые мы ещё не доработали, и прошли часть игры, не предназначенную для прохождения. (Это говорит многое о геймдизайне — но, пожалуй, говорит ещё больше о тех, кто им увлекается.)",
      "[h3]Управляемый хаос[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "К концу разработки основа игры была создана. Способности, стычки с мини-боссами и финальная битва с королевой Империей — всё это было на месте.  В этот момент мы уже искали не критические ошибки, а способы скорректировать, сбалансировать и довести до блеска то, что и так работало. Мы продолжали тесты, но отказались от исчерпывающих послеигровых разборов и просто давали играть всем, кто захочет (и, разумеется, собирали дополнительные данные).",
      "Важны были не только количественные данные о каждом «забеге», но и качественные данные от тестирования. В одном памятном случае игру грандиозно закончила Стенающая масса (между собой мы прозвали её «Фрикаделькой»), которая заняла больше половины экрана и поглотила игрока. К этому моменту за спиной тестировщика собралась аудитория коллег, дружно смеющихся над несчастным. И, конечно же, он сразу нажал кнопку «Играть снова».",
      "Мы обрели уверенность в том, что приготовили достойное блюдо, и начали звать на тестирование не только добровольцев, но и вообще всех, кого мы только могли схватить в наши сети и затянуть в игру. На ранних этапах прототипирования мы наслаждались полуночными сообщениями в Slack: «Игра слишком сложная». Теперь же мы начали получать не только подобные сообщения, но и обновления к ним в 3 часа ночи: «А, нет, у меня получилось». ",
      "Хоть игра и была почти готова, мы всё равно продолжали работать над «Терновым троном» вплоть до выпуска четвёртого акта «Павшей короны». В начале этого поста мы упоминали, что хорошие данные помогают нам принимать правильные решения. Что ж, мы наконец получили такие данные: коллеги-тестеры были так рады пройти (и неоднократно перепройти) игру, что мы собрали огромное количество информации о том, какие именно элементы игры вызывали у них положительный отклик. И ничто не будоражит полную разработчиков комнату сильнее, чем осознание, что их игру сочли весёлой. Мы хотели успеть добавить в игру как можно больше того, что действительно её улучшало. Новые предметы, способности, диалоги и даже волны врагов — каждый раз, когда мы думали, что игра уже совсем готова, кому-нибудь в голову обязательно приходила ещё одна «ну точно последняя» идея. И эта идея обычно была очень даже крутой, так что мы не могли устоять соблазну её воплотить.",
      "Дело даже не в том, что идей было всё больше и больше, а в том, что они становились всё круче и круче. В самом начале, когда у нас было лишь туманное представление об игре, отделить зёрна от плевел было непросто. Но когда до выпуска осталась всего лишь неделя, стало очевидно, чему именно следует уделять внимание и ресурсы.",
      "[h3]Восхождение на трон[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Нанеся завершающие штрихи на полотно «Тернового трона», мы отошли назад и посмотрели на него свежим взглядом. Нашей задачей было воспользоваться наработками из предыдущих актов, чтобы создать эпичную битву с боссом, достойную финала последнего акта. Мы остались довольны результатом; особенно с учётом ограничения по времени. Игра получилась весёлой.",
      "Вот только, к сожалению, у игроков ещё не получилось до неё добраться. Мы слегка не учли тот факт, что [i]«Терновый трон»[/i] был битвой с боссом, и, очевидно, эта битва должна была произойти... там, где босс живёт, то есть в самом конце игры. Это значило, что нам предстояло день-два мучительно ждать, пока самые целеустремлённые игроки в Доту не пронесутся по четвёртому акту и не получат шанс опробовать мини-игру. ",
      "Как оказалось, ждать нам пришлось недолго. Мы думали, что первые игроки достигнут тронного зала Империи где-то через день или два. Но вскоре стало ясно, что мы недооценили скорость, с которой наши игроки могут поглощать контент. Уже через 16 часов — да-да, [i]часов[/i] — нашлись умельцы, которые прорвались через весь последний акт и ознакомились с [i]«Терновым троном»[/i].",
      "В конце концов туда добрались и все остальные. На момент написания этого поста в [i]«Терновый трон»[/i] сыграли почти сто миллионов раз. Между прочим, если вы ещё не попробовали эту мини-игру или же хотите пройти её ещё разок, архив события и все входящие в него мини-игры всё ещё доступны в архиве события в главном меню.",
      "[h3]Принятие непредсказуемости[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Надеемся, что подобный взгляд за кулисы того, как команда Доты создавала мини-игру с нуля, позволит вам лучше узнать о нашем процессе разработки, а не вызовет ужас от мысли, что мы просто придумываем всё на ходу. На самом деле, мы лишь хотим показать вам, что геймдизайн это не какая-то магия, доступная только гениям, работающим все ночи напролёт. Разработка игры — это путь проб и ошибок, основанный на данных, переживаниях, тестировании, неудачах, тестировании, ещё неудачах и снова тестировании.",
      "Итеративный подход приносит свои плоды — всё начинается с «непонятно чего», но потом вы анализируете предыдущие успехи и постепенно приходите к «уже чему-то». Это вытекает в паршивенький прототип, в который играть никто не хочет, но всё равно будет (по вашей просьбе). Затем вы видите, до чего же им не весело, возвращаетесь к работе и удаляете всё, что не весело, и повторяете этот процесс, пока им наконец не станет весело. А потом вы неустанно шлифуете, полируете и правите игру, бросаете взгляд на календарь с датой выпуска и начинаете рыдать. Мы в Valve всегда стараемся принять непредсказуемость и позволить данным задать путь разработки. Из-за этого наши продукты не всегда выходят в назначенное время. Тем не менее мы надеемся, что они вам понравятся — когда будут готовы."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091367,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}