{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Mellan striderna: Törnnästet",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mellan striderna: Törnnästet",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[i]Välkommen tillbaka till Mellan striderna, en blogg där medlemmarna i utvecklingsteamet berättar om utmaningar, buggåtgärder och en och annan lycklig tillfällighet som man stöter på när man jobbar med ett så unikt spel som Dota.[/i]",
      "Då Crownfall var ett gigantiskt event fick vi möjligheten att prova på en hel del experiment: övervärldskartor, förgrenade berättelser, polletter med hjältetema, minispel, serier, pixelkonst och andra idéer som vi hade velat utforska i många år.",
      "Det som gav oss förtroendet att ta dessa risker – och något som vi ständigt drar nytta av på Valve – är friheten att iterera: att samla in riktiga spelardata och låta de uppgifterna utmana våra antaganden och till och med få oss att ändra våra åsikter. Vi säger ofta att vi inte helt förstår vad det är vi skapar förrän vi ser spelare använda produkten, så vi brukar försöka komma till det skedet så fort som möjligt.",
      "Det tankesättet styr också när vi fattar beslut, vanligtvis så sent i utvecklingen som möjligt, när vi har våra bästa (och ibland enda) data. Vid varje steg är riktiga spelarupplevelser till hjälp när vi fokuserar på det som fungerar och undviker det som inte gör det.",
      "I den här utgåvan av [i]Mellan striderna[/i] går vi igenom utvecklingen av något som gavs ut relativt sent i Crownfall, nämligen bosskampen mellan hjältarna och drottning Imperia i akt IV: [i]Törnnästet[/i]. Vi använder det också som en fallstudie för att visa hur speltestning och de data som det genererar formar vårt beslutsfattande.",
      "[h3]Vägen till Imperia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Det första (och enda) minispelet i akt I var ett enkelt litet fiskeminispel där Tidehunter testade dina fiskefärdigheter i hopp om att du skulle lyckas fånga frukost åt honom. Så var stora delar i akt I uppbyggda – små idéer som vi hade spridit ut över kartan för att se vad spelare var mest intresserade av. Positiva spelardata från akt I gav oss självförtroendet att bli mer äventyrliga i akt II, och i akt III levererade vi [i]Sleet Fighter[/i], ett fightingspel som utspelar sig på Tusks favoritkrog. Annat som dök upp i akt II var [i]Drakschack[/i], där man kombinerar tre i rad mot Winter Wyvern, och [i]Zaugs Lair[/i], en shoot 'em up där en ond drake ställs mot Vengeful Spirit i Icewracks slingrande grottor. ",
      "När vi nådde akt IV hade vi en tydlig uppfattning om vad som fungerade och vad som inte fungerade. Vad för slags data? Allt från sådant som går att mäta, som hur många spelare som spelade om varje minispel och hur ofta de gjorde det, till sådant som måste tolkas lite mer, som användarfeedback och onlinediskussioner. Den klarheten gjorde oss mer benägna att satsa allt på en storslagen final: en episk bosskamp mot onda drottning Imperia.",
      "Naturligtvis var det inte lätt att bestämma vilken slags spel bosskampen skulle vara. Vi visste att kampen behövde leverera ett spektakel där allt stod på spel och som levde upp till spelarnas förväntningar. Men det var också viktigt att den innehöll tillräckligt med variation och återspelningsvärde för att fortsätta vara spännande efter flera omgångar. Och eftersom det skulle vara ett minispel som spelas medan man köar till en match ville vi att det skulle vara intensivt men kort. Det skulle kännas som en snabb liten godbit, inte en stor måltid.",
      "För att hitta rätt balans behövde vi en genre som kombinerade [i]Sleet Fighters[/i] höga produktionsvärden med [i]Dragon Chess[/i] återspelningsvärde. Det här skulle trots allt bli den episka uppgörelsen mellan Vengeful Spirit, Skywrath Mage och nykomlingen Kez (huvudpersonerna, så att säga, i Crownfalls fyra akter) när de stormar Imperias slott. Vi ville att spelaren skulle känna att hen stod emot omöjliga odds i sin strävan att nå drottningen.",
      "[h3]En plan utvecklas[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "En idé som under ett tag fick lite fäste var turbaserad strid i JPRG-stil. Men det tog inte lång tid att inse att det inte skulle fungera bra. Vi behövde något som snabbt kastade in spelarna i all action – något som var kort, intensivt och tillräckligt roligt att spela mellan Dota-matcher.",
      "Det var då överlevnadsgenren kom in i bilden. Ett omvänt kulregn med oändliga vågor av fiender – det var den perfekta miljön för en episk bosskamp där allt stod på spel. Spelaren hugger sig igenom horder av fiender och använder samtidigt lite strategi för att förstärka olika förmågor i förberedelse för en sista uppgörelse med Imperia. Det var också enkelt att knyta befintliga Dota-föremål och -förmågor till handlingen, så spelarna redan hade en uppfattning om hur saker och ting fungerade.",
      "Vi ville att bosskampen skulle vara relativt kort, och därför var det viktigt att folk inte hade något emot att spela om den. Tack vare överlevnadsgenren fick vi mycket variation eftersom samma upplevelse aldrig upprepas. Spelarna är inte garanterade att få de föremål eller händelser som de förväntar sig i exakt den ordning som de vill ha dem. Variationen får dig att vilja fortsätta försöka och börja om från början på ett sätt som känns utmanande utan att vara oövervinnligt eller frustrerande. Vi ville egentligen inte att du skulle vinna första gången ... men vi ville också att du skulle vilja fortsätta spela efter att ha förlorat. ",
      "[h3]Tidiga prototyper[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "De tidigaste prototyperna av [i]Törnnästet[/i] började med samma kärnelement som slutversionen. Spelaren valde en av tre hjältar, möttes av våg efter våg av fiender och kom till slut fram till Imperia. De tidiga försöken hade ingenting som var ens en gnutta roligt. Ibland kunde en hjälte vandra runt på en mestadels tom karta och bara stöta på något enstaka skelett. Andra gånger var fiendevågorna så överväldigande att det inte ens var möjligt att vinna (eller det var det vi trodde – mer om det senare). Vi visste att det gömde sig ett roligt spel någonstans där inne. Vi var bara tvungna att fortsätta tortera speltestarna med dåliga byggversioner tills vi hittade det vi sökte.",
      "Varje Valve-anställd är försökskanin, och genom att låta folk testa byggversionerna får vi reda på om något fungerar (eller lika ofta [i]inte[/i] fungerar). Vi skulle kunna brainstorma hur länge som helst, men det är inte förrän någon sätter sig ner och spelar spelet som vi verkligen vet om vi har gjort rätt val.",
      "Först kämpade speltestarna med att överleva de första 3–6 minuterna. Vanligtvis är det ett tecken på att spelet antingen är obalanserat eller att reglerna inte förklaras tillräckligt väl. Vi satte oss ner med dem och lät dem visa oss vad de upplevde – ögonblick där de inte var säkra på vad som behövde göras härnäst eller där de blev så överväldigade att det kändes omöjligt eller till och med där de helt enkelt blev uttråkade. Därefter återvände vi till skrivbordet och gjorde några ändringar som vi sedan presenterade för en ny speltestare. Sakta men säkert började vi se framsteg.",
      "Och sedan hände något.",
      "Efter att ha gått igenom den första omgången med oss frågade en speltestare som nyss förlorat om det gick bra om hen gjorde ett till försök.",
      "Det hade inte hänt tidigare och kändes uppmuntrande. Törnnästet var ingenstans i närheten av att vara bra ännu. Det tog vanligtvis minst tre omgångar innan någon kom på hur man vann, men det var åtminstone trevligt att vi för en gångs skull inte behövde tvinga kollegorna att spela den usla prototypen – de bad faktiskt om att få spela den en andra gång.  Det fanns en pytteliten glimt av intresse: ”Jag hatar det inte helt och hållet”. Det var vi nöjda med.",
      "Men det riktiga miraklet lät vänta på sig.",
      "[h3]Hjältestrukturer[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "En viktig aspekt av överlevnadsgenren, som de tidigare versionerna inte hade, var konstant press. Inledningsvis skapade vi en våg av hundra skelett på nivån och lät hjälten hugga ner dem. När hjälten hade huggit ner dem till noll kom nästa skurkvåg som hade högre svårighetsgrad. Speltestarna tröttnade snabbt på det. När de väl insåg att det enda målet var att hugga en oändlig mängd skurkar började det kännas som ett besvär. Den enda belöningen för att döda dem mer effektivt var att man fick bekämpa nästa våg tidigare, och den vågen var svårare. (Hurra?)",
      "Så småningom kom vi på att när vi hade skapat hundra skelett och hjälten började hugga loss, behövde vi sätta en timer på den vågen och fortsätta skapa nya skelett oavsett hur många hjälten hade dödat. När timern hamnade på noll kom en svårare våg av fiender med en ny timer. Trycket släppte aldrig och spelaren fortsatte vara engagerad. ",
      "Men det viktigaste var att deras [i]mål[/i] ändrades. När hjälten slaktade ett minskande antal skelett blev målet att få antalet skelett att gå ner till noll. Men om skelettantalet [i]aldrig minskar oavsett hur många man dödar[/i] tar det inte lång tid för spelarna att inse att målet faktiskt inte är att döda dem. ",
      "Istället vände de sitt fokus till vad de [i]fick ut[/i] av alla döda alla skelett – i det här fallet förmågor och uppgraderingar. Plötsligt var målet inte att döda alla skelett, utan hur många skelett man kan döda så snabbt som möjligt för att bli så [i]stark[/i] som möjligt. Istället för att kännas som ett besvär började det när man skördade vågor av fiender att kännas som att jaga en storvinst – varje gång man dödar någon kommer man ett steg närmare den perfekta hjältestrukturen. ",
      "Man behövde inte längre döda alla skelett i en våg innan man gick vidare till nästa, och det fick oss att implementera något nytt: en delad klocka. Det innebar att spelarna nu delade samma rytm – ett gemensamt språk för när det började bli svårt. När en spelare sa: ”Jag står inte ut med spindelvågen i minut fyra” förstod alla genast vad hen menade (spindlarna är hemska).",
      "Äntligen hade vi hittat något som var lite skoj. Den här lilla fokusväxlingen gjorde det klart för oss vad spelarna uppskattade och varför, och vi hade helt plötsligt en hel kaskad av nya idéer – kraftfullare uppgraderingar, galnare förmågor och strukturmöjligheter som vi en gång i tiden inte ens hade tänkt på. Det innebar att speltestarna kunde bygga helt olika hjältestrukturer från varandra under en enda genomspelning. Det innebar att de var mer engagerande under speltesterna, vilket gav oss bättre feedback och förslag att använda i nästa byggversion.",
      "Om vi frågade mer än en gång, vill säga. Efter ett speltest upptäckte vi ibland att kollegorna inte längre ville prata med oss om deras med- och motgångar. Istället föredrog de att prata med varandra om sina hjältestrukturer och diskutera vems som var bäst. ",
      "När hjältestrukturvariationen fortsatte att växa började vi undra om det fanns en stor pusselbit som vi hade missat – tänk om hjältarna själva kändes lika unika som förmågorna? I de tidiga prototyperna var spelarupplevelsen i stort sett identisk oavsett vilken hjälte man valde, bortsett från startförmågan som kunde skilja sig. Nu anpassade vi dem till att bli riktigt unika val. Vi gjorde en starkare, en annan snabbare och en tredje bättre på magisk skada, vilket öppnade upp variationen i hjältestrukturen ännu mer. Att välja en hjälte framför en annan innebar också att man öppnade upp specifika förmågor som man annars kanske inte skulle kunna använda. (Och eftersom lite tur alltid är inblandad när det gäller vilka uppgraderingar man får, kändes varje val som en chansning där allt stod på spel.)",
      "[h3]De första sex minuterna[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Medan du är distraherad med att klura ut vilken uppgraderingsgren som kan ta dig till Imperia, ökar vi sakta svårighetsgraden. Vid något tillfälle, utan att man ens märker det, har fienderna blivit riktigt farliga. Tempot är obevekligt och det går knappt att hålla huvudet ovanför vattenytan. ",
      "Det var åtminstone det som var målet. Nu när uppgraderingarna hade fallit på plats började vi finjustera tempot i spelet. Vi ville att upplevelsen skulle vara intensiv, men den fick inte vara för långvarig. (Vi var medvetna om att de flesta spelar medan de köar till en match.) Å andra sidan ville vi ge tillräckligt med andrum så att spelarna kunde glädja sig över av att se sina uppgraderingsval staplas.",
      "Våra slarviga beräkningar gav oss cirka 12 minuters totalt av gameplay – om man inte räknar Imperia-kampen på tre minuter på slutet. Så vi satte igång med att justera tempot under de första sex minuterna. Hur ofta ska vi ge spelaren ett uppgraderingsval? Hur tidigt ska de kunna börja stapla förmågor? Hur mycket skada ska varje förmåga göra så att den känns tillfredsställande men inte för mäktig? ",
      "Vi justerade gameplay i sektioner, med fokus på de första sex minuterna, vilket gjorde att de sista sex minuterna i princip var ospelbara vid det laget. Vi lät speltestare spela de första sex minuterna, och sedan bad vi dem att sluta. [i]Tekniskt sett[/i] skulle de ha kunnat fortsätta spela, men allt efter minut sex var bara platshållare. Det var inte meningen att man skulle spela efter minut sex. (Vi bad faktiskt kollegorna att inte göra det.) ",
      "En rolig bieffekt av att göra förmågorna och uppgraderingarna så roliga som de var, var att speltestarna ofta inte brydde sig om att halva spelet fortfarande var ospelbart. Vi brukade sitta vid kollegornas skrivbord och se på när första halvan spelades. Efter att ha spelat i sex minuter: ",
      "”Bra, tack”, sa vi. ”Kan du börja om från början nu?”",
      "En paus. ",
      "”Vänta lite, jag tror faktiskt att jag kan ta mig igenom resten.” ",
      "Vi påminde speltestarna om att de sista sex minuterna var en förfärlig, obalanserad ödemark av fiender som för närvarande var oslagbara. De brukade säga att de förstod. Vi pratade med dem om deras med- och motgångar. De gav oss massor av bra feedback om hur de första sex minuterna hade gått. När vi hade gått iväg återupptog de spelet och försökte vinna ändå. ",
      "Några av kollegorna tog det som en personlig förolämpning att det inte gick att ta sig igenom de sista fruktansvärt orättvisa, bokstavligen talat omöjliga sex minuterna. Medan vi utformade den första halvan av spelet, slog speltestarna sina huvuden samman mot den oslagbara andra halvan. ",
      "Följden blev att de klarade det. ",
      "Till sist kom de fram till den exakta kombinationen av extremt kraftfulla förmågor som vi inte hade finjusterat än, och de slog den del av spelet som inte skulle kunna slås. (Det säger en hel del om spelutveckling, men kanske ännu mer om vilken typ av folk som blir spelutvecklare.)",
      "[h3]Kontrollerat kaos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "I slutet av utvecklingen utformades spelets kärna. Förmågor, möten med minibossar och den sista uppgörelsen med drottning Imperia satt på plats.  Vid det laget letade vi inte längre efter problem som kunde få spelet att krascha, utan sätt att justera, balansera och finslipa det som vi redan visste fungerade. Vi fortsatte med speltestningen men tonade ner de slitsamma intervjuerna efter ett test och lät helt enkelt folk spela för skojs skull (och naturligtvis för att generera mer data).",
      "De kvantitativa data vi fick från varje omgång var viktiga, men de kvalitativa data som vi fick från speltesterna var minst lika viktiga. I ett minnesvärt exempel slutade ett speltest på ett episkt sätt med den klagande massan (som internt kallas köttbullen) som tog över halva skärmen och slukade spelaren. Vid det laget hade speltestaren en publik av kollegor som tittade på bakom honom, och alla skrattade gott åt hans olycka. Naturligtvis tryckte han omedelbart på spela igen-knappen.",
      "Vi var övertygade om att vi hade något värt att leverera. Speltestningen var nu öppen både för folk som hade anmält sig till att speltesta frivilligt och i princip vem som helst från företaget som vi kunde locka in. I de tidigaste prototyperna fick vi ofta Slack-meddelanden kl. 23.00 där det stod att spelet var för svårt. Vid det laget fick vi fortfarande sådana meddelanden vid 23-tiden, men uppföljningen ”glöm det, jag slog det” kom då kl. 03.00 på natten. ",
      "Trots att spelet var i stort sett färdigt, arbetade vi fortfarande med [i]Törnnästet[/i] ända fram till att vi släppte akt IV av Crownfall. I början av det här inlägget sa vi att det är lättare att fatta beslut när man har bra dataunderlag som stödjer besluten. Nu hade vi alltså det. De interna speltestarna trivdes med att spela (och spela om) spelet, och vi hade dessutom massor av data som hjälpte oss avgöra vilka delar av spelet som fungerade. Ingenting får ett rum fullt av spelutvecklare att bli så överlyckliga som det ögonblick då ett spel börjar bli roligt. Vi ville göra så mycket av möjligt av det som vi visste fungerade, så mycket som bara fick plats. Nya föremål, förmågor, historia och även vågor – varje gång vi trodde att spelet var perfekt var det alltid någon som hade en ny idé. Och eftersom det för det mesta var ett rätt bra idé kunde vi inte motstå att prova den.",
      "Det var inte bara det att det strömmade in förslag – de blev bättre och bättre ju mer vi närmade oss lanseringsdatumet. I början, när saker och ting var lite mer ostrukturerade, var det svårt att skilja mellan en potentiellt högvärdig funktion och en lågvärdig funktion. En vecka före lanseringen blev det ganska uppenbart att det var bäst att ägna resurser och tid till att göra spelet bättre.",
      "[h3]Dags att lämna boet[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "När vi hade lagt sista handen på [i]Törnnästet[/i] kunde vi gå tillbaka och se på det med nya ögon. Utmaningen hade varit att använda saker som vi hade lärt oss från tidigare akter och på så vis skapa en passande episk bosskamp för att avsluta det gigantiska eventet. Vi var rätt nöjda med vad vi hade åstadkommit, särskilt med tanke på tidsbristen. Vi hade hittat det som var skoj.",
      "Tyvärr hade gemenskapen inte gjort det än. Vad vi inte hade tänkt på var att eftersom [i]Törnnästet[/i] var en bosskamp, var den logiskt sett tvungen att utspela sig ... ja, där bossen bor, alltså i slutet av spelet. Det innebar minst en eller två dagar av tyst tortyr medan vi väntade på att Dotas bästa spelare skulle ta sig igenom akt IV i omänsklig hastighet. Vi väntade på att få bevittna spelarna äntligen spela Törnnästet. ",
      "Det visade sig att vi inte behövde vänta länge. Vi förväntade oss att det skulle ta minst ett par dagar innan någon nådde drottning Imperias tronsal. Det visade sig att vi kraftigt hade underskattat hur snabbt Dota-spelare kan ta sig igenom innehåll. Inte mer än 16 timmar efter lanseringen – ja, [i]timmar[/i] – hade de första spelarna redan kämpat sig igenom hela sista akten och fick prova på [i]Törnnästet[/i].",
      "Och så småningom kom alla andra ikapp. I skrivande stund har [i]Törnnästet[/i] spelats nästan hundra miljoner gånger. (Om du inte har hunnit komma ikapp än eller vill ge det ett till försök, går det fortfarande att spela Törnnästet i Crownfall-arkivet i spelklienten.)",
      "[h3]Ovisshet är välkommen[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Vi hoppas att den här titten på hur Dota-teamet får igång ett minispel har gett dig en bättre uppfattning om processen – och att det inte bara fick dig att stirra på blogginlägget i fasa med avslöjandet att vi bara hittar på alltihop allteftersom. Egentligen hoppas vi att det bevisar att spelutveckling inte är någon mystisk konstform med spelskapande genier som manar fram idéer från mörka rum, utan en iterativ process med tester och problem som drivs av data, ångest och speltester samt misslyckanden, speltester och mer misslyckanden och mer speltester.",
      "Spelutveckling frodas i iteration. Det som börjar som ”ingen aning” förvandlas långsamt till ”en aning” när man tittar på tidigare idéer som har fungerat. Sedan förvandlas det till en dålig prototyp som ingen vill spela, men vi skapar dem ändå. Sedan ser vi på medan speltestarna inte har kul när de spelar, och vi går tillbaka och åtgärdar alla de tråkiga delarna tills de faktiskt börjar ha kul. Sedan finslipar vi prototypen, tar en titt på lanseringskalendern och gråter. Valves etos har alltid varit att välkomna ovisshet och låta data forma utvecklingen. Det betyder att vi inte alltid levererar allt i tid. Men vi tror att du kommer att gilla det när det väl är klart."
    ],
    "commentcount": 4,
    "tags": [],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747091375,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}