{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Между алеите — Тръненото гнездо",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Между алеите — Тръненото гнездо",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]Посрещаме Ви отново в „Между алеите“, характеристика на блога, където членове от нашия екип с разработчици обхващат някои от предизвикателствата, поправките на неизправности и случайните щастливи инциденти, на които се натъкваме, докато работим върху толкова уникална игра като Dota 2.[/i]",
      "По време на толкова масивно събитие като Crownfall, успяхме да опитаме много експерименти: световни карти, разклоняващи се сюжети, жетони с героична тематика, мини игри, комикси, пикселно художествено творчество и куп други идеи, които бяхме нетърпеливи да проучим от години наред.",
      "Това, което ни даде увереност да поемем тези рискове, а то е нещо, от което във Valve постоянно се възползваме, е свободата да повтаряме опитите: да се събират реални данни от играчите, да позволяваме съответните такива да оспорват нашите предположения, а дори и да променят мнението ни. Често казваме, че не разбираме напълно какво изготвяме, докато не видим играчите да си взаимодействат с него, ето защо се опитваме да стигнем до този момент възможно най-бързо.",
      "Този манталитет също се оформя при вземането на решения, обикновено възможно най-късно в разработката, когато разполагаме с най-добрите, а понякога и единствените данни. При всяка стъпка разчитаме на действителните преживявания на играчите да ни помогнат да се съсредоточим върху това, което отеква с потребителите, и да страним от онова, което не ги привлича.",
      "В това издание на [i]„Между алеите“[/i] ще Ви преведем през разработката на нещо, което се появи на линия сравнително късно в Crownfall — бос битката от IV акт между нашите герои и кралица Империя в [i]Тръненото гнездо[/i]. Също така го използваме като казус, за да покажем как игралните изпитания и генерираните от тях данни оформят процеса ни по вземане на решения.",
      "[h3]Достигането до Империя[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "Първата (и единствена) мини игра в I акт беше скромна риболовна такава, където Tidehunter изпитваше Вашите риболовни умения с надеждата да му уловите закуска. Голяма част от I акт беше такава… Малки идеи, които бяхме разпръснали из цялата карта, за да видим с какво щяха да се ангажират играчите. Окуражаващите данни от играчите през I акт ни дадоха увереността да станем по-авантюристични във II акт, а до III вече доставяхме: [i]Sleet Fighter[/i] — кавгаджийска бойна игра за сражения в любимата долнопробна кръчма на Tusk; [i]Dragon Chess[/i] — битка на съобразителността от типа „напасване на три“ срещу Winter Wyvern; и [i]Zaug's Lair,[/i] — престрелки, изправящи зъл дракон срещу Vengeful Spirit през засуканата пещерна система на Ледоостанково. ",
      "По времето, когато достигнахме до IV акт, разполагахме със солидна представа относно това какво работи и какво не. Какъв вид данни? Всички такива, обхващащи конкретната информация за това колко потребители са преиграли всяка мини игра, както и колко често е ставало това, чак до по-тълкувателната, като например отзивите и дискусиите на линия, подавани от потребителите. Тази яснота ни даде увереността да се заложим изцяло на един смайващ финал — епична бос битка срещу злата кралица Империя.",
      "Разбира се, вземането на решение за това какъв вид да бъде играта за бос битката не беше лесно. Знаехме, че е нужно да поднесем зрелищния спектакъл с високи залози, който играчите очакваха. Но също така трябваше да предлага достатъчно разнообразие и възможност за преиграване, така че преживяването да остане свежо след многократни пробези. И защото това е мини игра, предназначена да се пуска, докато се вреждате в опашката за търсене на мач, беше нужно тя да бъде интензивна, но краткотрайна. Трябва да оставя усещането като от приятно похапване, а не от обилно наяждане.",
      "С цел да постигнем правилния баланс, имахме нужда от жанр, който да съчетава висококачествената продукция на [i]Sleet Fighter[/i] с възможността за преиграване на [i]Dragon Chess[/i]. В крайна сметка, това щеше да бъде епичната битка между Vengeful Spirit, Skywrath Mage и новодошлия Kez (нашето „голямо трио“ от четириактната история на Crownfall), щурмуващи замъка на Империя. Искахме играчите да се почувстват така сякаш са изправени срещу непреодолими препятствия в стремежа си да достигнат кралицата.",
      "[h3]Замислянето на план[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Една идея, която за кратко придоби известна популярност, беше походова битка в стила на японска ролева игра. Но не след дълго осъзнахме, че това не е подходящото решение. Нуждаехме се от нещо, което бързо да запрати играчите в действието — нещо кратко, напрегнато и достатъчно забавно, така че да се играе между опашките, докато чакате търсенето за Dota 2 мачове.",
      "Точно там се появи жанрът на игрите за оцеляване. „Обратен куршумен ад“ с безкрайни вълни от врагове, това беше перфектното място за епична бос битка с високи залози. Играчът щеше да си проправя път през орди от врагове, докато използва мъничко стратегия за подсилване на разнообразни умения в подготовка за финален сблъсък с Империя. Също така би било лесно да се преобразуват съществуващите Dota 2 предмети и умения към действието, така че играчите вече да имат представа за това как нещата работят.",
      "Тъй като искахме преживяването да бъде сравнително краткотрайно, възможността за преиграване беше друго важно парче от пъзела. Жанрът на игра в стил оцеляване ни даде купища променливост, тъй като никога нямаше да се повтори същото преживяване. На играчите не е гарантирано, че ще получат предметите или събитията, които очакват, в точния ред, който те искат. Променливостта Ви насърчава да продължавате с опитите, стартирайки от нулата по начин, който оставя у Вас усещането за изправяне пред предизвикателство, без да чувствате, че то е непреодолимо или разочароващо. Не искахме непременно да спечелите още първия път… но също така искахме да продължавате да играете, когато загубите. ",
      "[h3]Ранни прототипи[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Най-ранните прототипи на [i]Тръненото гнездо[/i] стартираха със същите основни елементи като версията, която в крайна сметка доставихме. Даден играч избираше един от трима герои, опълчваше се срещу една подир друга вълна от врагове и в крайна сметка достигаше до Империя. Това, което тези ранни опити не притежаваха, беше нещо дори бегло забавно. Понякога даден герой се скиташе по почти празна карта, натъквайки се на някой и друг периодичен скелет. Друг път вълните от врагове бяха толкова непреодолими, че всъщност не беше възможно да се победи или поне така си мислехме (още по този въпрос по-късно). Знаехме, че някъде там имаше забавна игра. Просто трябваше да продължим да измъчваме нашите игрални изпитатели с лоши версии, докато я намерихме.",
      "Всеки служител на Valve е морско свинче и поставянето на някого от тях пред дадена версия е начинът, по който разбираме дали нещо работи или [i]не[/i]… и двете се случват достатъчно често. Можем да подхвърляме идеи до безкрай, но докато някой не седне и не заиграе, всъщност не знаем дали решенията, които сме направили, се получават.",
      "Първоначално игралните изпитатели се мъчеха да оцелеят през първите 3 — 6 минути. Обикновено това е знак, че играта е небалансирана или не обяснява достатъчно добре своите правила. Сядахме с тях и ги молехме да ни преведат през тяхното преживяване — моменти, в които не са били сигурни какво да правят по-нататък, а може би когато ситуацията е ставала толкова непреодолима, че е изглеждала невъзможна, или дори когато просто са се чувствали отегчени. След това се връщахме към бюрата си, да направим някои промени и да я представим пред нов игрален изпитател. Лека-полека започнахме да виждаме напредък.",
      "И тогава нещо се случи.",
      "След като ни преведе през първото си проиграване, един от игралните изпитатели, който току-що беше загубил, попита — „Всъщност, мога ли да опитам отново?“",
      "Това беше нещо ново и окуражаващо. Тръненото гнездо все още далеч не се доближаваше до нещо добро. Обикновено бяха необходими поне три опита, преди някой да проумее как да надвие нашия прототип… Но най-сетне беше хубаво, че поне веднъж не принуждавахме колегите ни да играят с нашия калпав прототип. Действително искаха да играят нашия калпав прототип за втори път.  Беше мъничък проблясък на интерес, заявяващ „Не мразя това абсолютно“. Бяхме щастливи да приемем това.",
      "Но истинският миг на „Еврика!“ тепърва предстоеше.",
      "[h3]Билдове за герои[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Един ключов аспект на жанра за оцеляване, който ранните ни версии не притежаваха, беше постоянният натиск. Първоначално просто щяхме да създадем вълна от сто скелета в нивото и да оставим героя да ги посича. Щом героят ги беше посякъл до нула, щяхме да призовем следващата вълна от непрокопсаници при по-високо ниво на трудност. Игралните изпитатели бързо се отегчаваха от това. Щом проумяваха, че единствената цел беше безкрайното посичане на непрокопсаници, това започваше да им се струва като досадно задължение. Единствената награда за по-ефективното им убиване беше, че можехте да се биете със следващата, по-силна вълна по-рано. (Ура?)",
      "В крайна сметка проумяхме, че когато призовем стотина скелета и героят започне да ги посича, беше нужно да поставим тази вълна на брояч и да продължаваме да допълваме ранговете им, без значение колко от тях е убил героят. Щом броячът достигнеше до нула, призовавахме по-трудна вълна от врагове с ново отброяване. Напрежението вече никога не отслабваше и играчът оставаше ангажиран. ",
      "Но по-важното е, че [i]крайната цел[/i] се промени. Когато нашият герой просто изколваше чезнещ брой скелети, целта беше „Направете така, че броят на скелетите да достигне до нула“. Но ако броят на скелетите [i]никога не намаляваше, без значение колко убиваха,[/i] тогава на играчите не им отнемаше много време да осъзнаят, че всъщност това не е целта. ",
      "Вместо това, насочваха вниманието си към онова, което [i]получаваха[/i] от убиването на всички тези скелети — в този случай, умения и подобрения. Изведнъж целта не беше „Убийте всички скелети“, а „Колко от тези неща мога да убия възможно най-бързо, за да стана възможно [i]най-могъщ[/i]?“ Вместо да оставят усещането за досадно задължение, обирането на вълни от врагове започваше да се усеща като преследване на джакпот! С всяко убийство се доближавахте до перфектния билд за героя. ",
      "Тъй като напредването към следващата вълна вече не беше обвързано с убиването на всичко от предходната, също така бяхме придобили нещо ново — споделено постигане на време. Това означаваше, че играчите вече споделяха един и същ ритъм — общ език за миговете, когато ситуацията започваше да става трудна. И така, когато един играч каза „Не мога да понеса тази вълна от паяци в четвъртата минута“, всички останали незабавно знаеха какво е имал предвид (тези паяци са сред най-лошите неща).",
      "Най-сетне бяхме намерили забавлението. Това малко изместване на фокуса помогна да се изясни на какво играчите се наслаждаваха и защо. Също така постави началото на обилен изблик от нови идеи! По-мощни подобрения, по-щури умения и благоприятни възможности за билдове, които дори не бяхме обмисляли. Това означаваше, че игралните изпитатели можеха да създават коренно различни билдове за герои едни от други в едно и също проиграване. А това означаваше, че те бяха още по-ангажирани по време на изпитанията, давайки ни по-добри отзиви и предложения, с които да подхранваме следващата версия.",
      "Е, ако ги запитвахме повече от веднъж. Понякога след игрално изпитание установявахме, че колегите ни вече не искат да говорят с нас за своите пикове и падения. Те искаха да говорят помежду си относно своите билдове и да спорят коя е била по-добра. ",
      "С нарастването на разнообразието от билдове, започнахме да се чудим дали не сме пропуснали голяма част от пъзела… Ами ако самите герои също оставяха усещането, че са толкова уникални, колкото и уменията? В ранните прототипи, освен началните умения, преживяването на играчите до голяма степен беше идентично, независимо от това кой беше избраният герой. Сега вече ги доизпипвахме в наистина уникални избори, правейки единия по-силен, другия по-бърз, третия по-добър при нанасянето на магически щети… А това отвори още повече разнообразието от билдове. Избирането на един герой вместо друг също означаваше и отваряне на специфични клонове от умения, към които в противен случай не бихте могли да подобрявате. И тъй като винаги има мъничко късмет в това кои подобрения ще получите, всеки избор сякаш беше хазартен риск с висок залог.",
      "[h3]Първите шест минути[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Междувременно, докато Вие сте разсеяни, опитвайки се да разберете кой клон от подобрения ще Ви отведе до Империя, ние бавно покачвахме трудността. В един момент, без дори да забележите, вълните от враговете бяха станали смъртоносни, темпото беше безмилостно и едва успявахте да задържате главата си над водата. ",
      "Или поне това беше целта. Тъй като подобренията се развиваха много добре, преминахме към темпото на игралното преживяване. Искахме преживяването да бъде напрегнато, но не и да продължава повече, отколкото трябва. Знаехме, че повечето потребители щяха да играят, докато са се вредили в опашката за търсене на мач. Макар че от друга страна, искахме да дадем достатъчна възможност на играчите да си поемат дъх, за да се насладят, гледайки последствията от това какво се получава при подбора им на подобрения.",
      "По груби сметки това ни даваше общо около дванадесетминутно игрално преживяване. Без да броим триминутното сражение с Империя накрая. Ето защо се заловихме на работа върху темпото през първите шест минути. Колко често даваме избор за подобрение на играчите? Колко рано могат да започнат да трупат умения? Колко щети би трябвало да нанася всяко умение, така че да оставя задоволително усещане, но не и да бъде прекалено мощно? ",
      "Тъй като настройвахме игралното преживяване в отделни секции, фокусирането над първите шест минути означаваше, че финалните шест на практика бяха невъзможни за проиграване на този етап. Провеждахме игралните изпитания с хора над първите шест минути, а след това ги карахме да спрат. [i]Технически погледнато[/i] биха могли да продължат играта, но всичко от шестата минута нататък беше временно съдържание. Никой и нищо оттам насетне не беше предназначено да се играе. Всъщност умолявахме колегите ни да не го правят. ",
      "Един забавен страничен ефект от превръщането на уменията и подобренията в нещо толкова развлекателно, беше, че на игралните изпитатели често не им пукаше дали половината игра все още беше невъзможна за проиграване. Сядахме покрай бюрото на даден колега, гледайки как проиграва през първата половина от играта. Щом достигнеха шестата минута, провеждахме този диалог: ",
      "„Страхотно, благодарим Ви“, казвахме ние. „Можете ли да стартирате играта отначало?“",
      "Следваше пауза. ",
      "„Всъщност, почакайте, мисля, че мога да я надвия.“ ",
      "Напомняхме им, че последните шест минути бяха изтощителна небалансирана пустош от копирани и поставени врагове, които понастоящем бяха непобедими. Отвръщаха, че са разбрали. Интервюирахме ги за техните пикове и падения. Те ни даваха купища страхотни отзиви за проиграването им през първите шест минути. После се връщахме към своите бюра, а те ни гледаха, докато си отиваме, след което пускаха играта от пауза и се опитваха да я надвият така или иначе. ",
      "Някои от колегите ни приемаха факта, че не можеха да удържат фронта през последните жестоко несправедливи, буквално невъзможни за надвиване шест минути, като лично оскърбление. И така, докато проектирахме първата половина на играта, те сбираха ресурсите си, блъскайки главите си срещу непобедимата втора половина. ",
      "А ето и разковничето — успяха да я надвият. ",
      "Евентуално проумяваха точната комбинация от свръхмощни умения, чиито настройки все още не бяхме доизпипали, и надвиха частта от играта, която не беше предназначена да бъде побеждавана. Което Ви разкрива доста относно игралното проектиране, но може би дори повече за вида хора, които се занимават с дизайна на игри.",
      "[h3]Контролиран хаос[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Към края на разработката, основната част на играта беше изготвена. Уменията, схватките с мини босове и финалният сблъсък срещу кралица Империя си бяха на мястото.  На този етап вече не търсихме проблеми, които повреждаха играта, а начини да коригираме, балансираме и излъскаме до блясък това, което вече знаехме, че работи. Продължавахме с игралните изпитания, но бяхме се пооттеглили от изтощителните интервюта след сесията за проиграване, така че просто оставяхме хората да разцъкват за забавление и, разбира се, за да генерират още данни.",
      "Макар че количествените данни, които идваха от всяко проиграване, бяха важни, качествените данни, идващи от игралните изпитания, бяха не по-малко важни. В даден паметен пример, едно игрално изпитание завърши епично с Ридаещата маса, която ние вътрешно бяхме кръстили „Кюфтето“, превземаща повече от половината екран и поглъщаща играча. На този етап игралният изпитател разполагаше с публика от колеги, гледащи иззад гърба му, като всички задружно се присмиваха на неговото нещастие. Разбира се, той незабавно натисна бутона „Играйте отново“.",
      "Бяхме уверени, че разполагаме с нещо, което си струва да бъде доставено, и бяхме отворили възможността за игрални изпитания от хора, които доброволно бяха пожелали да участват, до почти всеки от компанията, когото можехме да привлечем и да въвлечем в игра. При най-ранните ни прототипи, в 23:00 часа бивахме посрещнати със съобщение в Slack, което гласеше „Играта е прекалено трудна“. На този етап все още получавахме тези известия в Slack в 23:00 часа, но тогава последващите ги съобщения в 3:00 часа гласяха „Няма значение, надвих я“. ",
      "Дори и при почти завършена игра, все още работехме по [i]Тръненото гнездо[/i] чак до доставянето на Crownfall — IV акт. Още в началото на тази публикация заявихме, че можем да вземаме по-добри решения, когато разполагаме с добри данни, които да ги подкрепят. Е, вече разполагахме с някакви данни. От вътрешните игрални изпитатели, които бяха толкова развълнувани да играят (и да преиграват) мини играта, разполагахме с купища данни, за да разберем кои части от това, което бяхме изготвили, резонираха с потребителите. А нищо не кара стая, пълна с игрални разработчици, да се вълнува така, както мигът, когато дадена игра започне да бъде забавна. Искахме да направим още от нещата, които вече знаехме, че работят, и то колкото повече от тях можехме да вместим. Нови предмети, умения, история и дори вълни… Всеки път, когато си мислехме, че сме се справили перфектно с изготвянето на играта, някой неизбежно измисляше поредната идея от типа „само още едничка“. И защото обикновено беше доста страхотна идея, не можехме да устоим да не я опитаме.",
      "Не ставаше въпрос само за това, че идеите за характеристики продължаваха да идват… Те ставаха все по-добри, колкото повече наближавахме датата за издаване. През ранните дни, когато нещата бяха по-безформени, беше трудно да разграничим между потенциално високостойностна и действително нискостойностна характеристика. По времето, когато оставаше седмица до издаването, най-добрите места, където можехме да вложим ресурсите и времето си, за да подобрим играта, бяха очевидни.",
      "[h3]Напускане на гнездото[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Докато нанасяхме финалните щрихи по [i]Тръненото гнездо[/i], бяхме способни да отстъпим назад и да хвърлим поглед със свежи очи върху творението. Предизвикателството беше да използваме наученото от предходните актове, за да изготвим подходяща епична бос битка, която да е завършек на мащабното събитие. Бяхме доста доволни от това, което бяхме постигнали, особено като се имат предвид времевите ограничения. Бяхме намерили забавлението.",
      "За жалост, общността все още не го беше намерила. Това, което не бяхме обмислили, беше, че тъй като [i]Тръненото гнездо[/i] беше бос битка, логично трябваше да се намира на… Е, ами, там, където живее босът, в края на играта. Това означаваше поне ден-два безмълвни изтезания, докато чакахме опитните Dota 2 играчи да си проправят път през IV акт при нечовешки скорости, така че да видим кога най-сетне потребителите щяха да имат шанс да я пуснат. ",
      "Оказа се, че нямаше да чакаме дълго. Мислехме, че ще изминат поне ден-два, преди някой да достигне до тронната зала на кралица Империя. Оказа се, че значително сме подценили колко бързо Dota 2 играчите могат да опердашат съдържанието. Само шестнадесет часа след пускането… Да, [i]часа[/i]… Първите опитни играчи вече си бяха пробили път през целия последен акт и за пръв път се наслаждаваха на [i]Тръненото гнездо[/i].",
      "И евентуално всички останали ги настигнаха. Към момента, в който пишем тази статия, [i]Тръненото гнездо[/i] е било проиграно близо сто милиона пъти. Ако самите Вие не сте наваксали или просто искате да се пробвате още веднъж, все още е достъпно от клиента в Crownfall архива.",
      "[h3]Възползване от несигурността[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Надяваме се, че този задкулисен поглед относно това как Dota 2 екипът подготвя мини игра от начало до край, Ви е дал по-добра представа за нашия работен процес. А не че просто Ви е накарал да стоите в ступор втренчени към тази публикация от блога с ужас от разкритието, че си измисляме всичко в движение. Но наистина се надяваме, че това доказва как игралният дизайн не е някакво мистично художествено изкуство, дело на гении в областта на създаването на игри, които сплитат пръсти в мрачни стаи, а итеративен процес на проби и грешки, воден от данни, безпокойство, игрални изпитания, неуспехи, игрални изпитания, още неуспехи и още игрални изпитания.",
      "Игралната разработка процъфтява чрез итерации. Това, което стартира като „няма идея“, бавно се превръща в „някаква идея“, като се преразглеждат предходни такива, които са проработили. След това се превръща в лош прототип, който никой не иска да пуска, но ние ги принуждаваме така или иначе. След това ги гледаме как не се забавляват, докато я играят. После отиваме и поправяме всички неразвлекателни части, докато евентуално започнем да наблюдаваме как хората се забавляват, докато играят. След това доизпипваме фините елементи, полираме до блясък, гледаме календара относно датата за доставка и ридаем. Нравът на Valve винаги е бил да приема и да се възползва от несигурността, позволявайки на данните да оформят разработката. Това означава, че невинаги доставяме нещата навреме. Но считаме, че ще Ви харесат, когато са готови."
    ],
    "commentcount": 516,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 5327,
    "votedowncount": 551,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1748387104,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5327,
  "votes_down": 551,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}