{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Entre las sendas: El Nido de Espinas",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Entre las sendas: El Nido de Espinas",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]Te damos la bienvenida a \"Entre las sendas\", una característica en el blog en la que los miembros de nuestro equipo de desarrollo explican algunos de los desafíos, correcciones de errores y accidentes ocasionales felices que nos encontramos mientras trabajamos en un juego tan único como lo es Dota.[/i]",
      "Durante un evento tan grande como lo fue la Caída de la Corona, tuvimos la oportunidad de probar muchos experimentos: mapas generales, historias entrelazadas, fichas con temáticas de héroes, minijuegos, cómics, ilustraciones pixeladas y otras ideas que llevábamos años pensando explorar.",
      "Lo que nos dio confianza para tomar estos riesgos (y algo de lo que tomamos ventaja constantemente en Valve) es la libertad de iterar: recopilar datos reales de los jugadores, dejar que desafíen nuestras suposiciones, e incluso, cambiar de parecer. A menudo decimos que no entendemos por completo lo que estamos creando hasta que vemos a los jugadores interactuar, así que tratamos de llegar a ese punto lo más pronto posible.",
      "Esa mentalidad también influye en la forma en que tomamos decisiones, normalmente lo más tarde posible durante la fase de desarrollo, cuando tenemos los mejores datos (que a veces son los únicos datos). Confiamos en todo momento en la experiencia de los usuarios para enfocarnos en lo que funciona y soltar todo aquello que no.",
      "En esta edición de [i]Entre las sendas[/i], repasaremos el desarrollo de algo que llegó relativamente tarde a la Caída de la Corona: la batalla contra el jefe en el Acto IV de nuestros héroes contra la Reina Imperia en el [i]Nido de Espinas[/i]. También lo vamos a usar como caso práctico para mostrar cómo las pruebas de juego y los datos que se generan influyen en nuestra toma de decisiones.",
      "[h3]Llegando a Imperia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "El primer (y único) minijuego del Acto I fue un modesto minijuego de pesca donde Tidehunter ponía a prueba tus habilidades de pesca en espera de cazar su desayuno. Una buena parte del Acto I fue así: pequeñas ideas que distribuimos por todo el mapa para ver con qué interactuaban los jugadores. Los datos alentadores del Acto I nos dieron la confianza para ser más aventureros con el Acto II, y para el Acto III lanzamos [i]Sleet Fighter[/i], un juego de peleas en la taberna favorita de Tusk; [i]Ajedréz del Dragón[/i], una batalla ingeniosa de tres partidas contra Winter Wyvern; y [i]La Guarida de Zaug[/i], un matamarcianos que enfrentaba a un diabólico dragón contra Vengeful Spirit en un retorcido sistema de cavernas a través de Icewrack. ",
      "Para cuando llegamos al Acto IV, ya teníamos una idea sólida sobre lo que funcionaba y lo que no. ¿De qué tipo de datos hablamos? De todo tipo, desde cómo los jugadores volvían a jugar cada minijuego hasta la frecuencia en que lo hacían, hasta datos que teníamos que interpretar, como los comentarios enviados y las discusiones en línea. Esta claridad nos dio la confianza para apostarlo todo en un final espectacular: una batalla épica contra el jefe, la malvada Reina Imperia.",
      "Claro que no fue fácil decidir qué tipo de juego debería ser la batalla contra el jefe. Sabíamos que teníamos que ofrecer el espectáculo de alto riesgo que los jugadores esperaban, pero también tenía que ofrecer suficiente variedad para mantenerse fresco después de múltiples partidas tras jugarlo varias veces. Y, como era un minijuego diseñado para jugarse al estar en espera de una partida, tenía que ser intenso pero breve. Tenía que ser algo como un buen bocadillo, no una comida de varios tiempos.",
      "Para lograr el balance adecuado, necesitábamos un género que combinara los altos valores de producción de [i]Sleet Fighter[/i] con la rejugabilidad del [i]Ajedrez del Dragón[/i]. Después de todo, esta debería ser una batalla épica entre Vengeful Spirit, Skywrath Mage y el recién llegado Kez (nuestra \"trifecta\" de la historia de cuatro actos de la Caída de la Corona) en un asalto al castillo de Imperia. Nuestra idea era que los jugadores sintieran que se enfrentaban a una misión casi imposible para llegar a la reina.",
      "[h3]Creando un plan[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Una idea inicial que duró poco fue la de una batalla por turnos al estilo de rol japonés, pero no tardamos mucho en darnos cuenta de que no era la mejor opción. Necesitábamos algo que sumergiera rápidamente a los jugadores en un ambiente de acción, algo corto, intenso y lo suficientemente divertido para jugar entre partidas de Dota.",
      "Aquí es donde se nos ocurrió usar el género de supervivientes. La opción perfecta para una batalla épica contra un jefe y de alto riesgo era una especie de lluvia de balas a la inversa con interminables oleadas de enemigos. Los jugadores tenían que enfrentarse a oleadas de enemigos mientras usaban un poco de estrategia para subir de nivel varias habilidades en preparación al enfrentamiento final contra Imperia. También era fácil incluir los objetos y habilidades ya existentes en Dota para que los jugadores tuvieran una idea aproximada de cómo funcionaban las cosas.",
      "Como queríamos que la experiencia fuera relativamente breve, la rejugabilidad era otra pieza importante del rompecabezas. El género de supervivientes nos dio mucha variabilidad, ya que nunca se vive la misma experiencia. No se le garantizaba a los jugadores los mismos objetos o eventos que esperan en el mismo orden que ellos querían. La variabilidad te alentaba a seguir intentándolo, a empezar desde cero de una forma que se sintiera desafiante sin sentirse insuperable o frustrante. No queríamos que necesariamente ganaras al primer intento... pero sí queríamos que siguieras jugando después de que perdieras. ",
      "[h3]Primeros prototipos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Los primeros prototipos del [i]Nido de Espinas[/i] contaban con los mismos elementos básicos como en la versión que eventualmente lanzamos. Un jugador seleccionaba a uno de tres héroes, se enfrentaba a oleadas de enemigos y eventualmente, llegaba a Imperia. Estos primeros intentos no eran para nada divertidos. Algunas veces, un héroe podía merodear un mapa casi vacío, enfrentándose de vez en cuando con un esqueleto. En otras ocasiones, las oleadas de enemigos eran tan abrumadoras que no era posible ganarlas (o eso pensábamos; hablaremos sobre ello más adelante). Sabíamos que podíamos hacer de esto un juego divertido, solo teníamos que seguir torturando a los jugadores que estaban haciendo pruebas con las malas compilaciones hasta que lo descubrimos.",
      "Todos los empleados de Valve son conejillos de indias. Poner a alguien frente a una compilación es la forma en que descubrimos si algo funciona o (⁠en la mitad de los casos⁠) [i]no[/i] funciona. Podemos intercambiar ideas sin fin, pero hasta que alguien se sienta y juega, no podemos saber realmente si nuestras decisiones fueron acertadas.",
      "Al principio, aquellos que realizaron las pruebas batallaron para sobrevivir entre los 3 y 6 minutos. Normalmente, ese es un signo de que el juego no está balanceado o que no explica las reglas adecuadamente. Nos sentábamos con ellos y les pedíamos que nos contaran su experiencia: momentos en los que no estaban seguros de qué hacer a continuación, o en los que la situación se volvió tan abrumadora que parecía imposible, o incluso en los que simplemente se sentían aburridos. Después, regresamos a nuestros escritorios e hicimos algunos cambios, y los pusimos frente a un nuevo jugador para que los probara. Poco a poco, empezamos a ver avances.",
      "Y entonces sucedió algo.",
      "Después de guiarnos a través de su primera partida, un jugador que acababa de perder preguntó: \"¿Puedo intentarlo de nuevo?\".",
      "Eso fue algo nuevo y alentador. El Nido de Espinas todavía estaba lejos de verse bien (normalmente tomaba tres intentos antes de que alguien se diera cuenta de cómo vencer a nuestro prototipo), pero al menos era bueno que alguien (para variar) nos pidiera volver a jugar nuestro prototipo espantoso en vez de obligar a nuestros compañeros de trabajo a jugar nuestro prototipo espantoso por segunda vez.  Fue un pequeño destello de interés: \"No odio esto del todo\". Nos dio gusto escuchar esto.",
      "Pero todavía nos faltaba llegar al factor de asombro.",
      "[h3]Mejora de los héroes[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Un aspecto clave del género de supervivientes que no tenían nuestras primeras versiones era la presión constante. Al principio, solo generábamos una oleada de cien esqueletos en ese nivel y dejábamos que el héroe acabara con ellos. Una vez que el héroe acababa con todos ellos, aparecería una nueva oleada de enemigos con mayor dificultad. Los jugadores que hacían las pruebas se aburrieron rápidamente de esto. Una vez que se dieron cuenta de que la meta era matar enemigos sin parar, esto empezó a sentirse como una tarea molesta. La única recompensa por matarlos de forma más eficiente era que podías luchar contra la siguiente oleada que venía antes y que era más difícil. (¿Bravo?)",
      "Al final nos dimos cuenta de que cuando generábamos cien esqueletos y el héroe comenzaba a atacarlos, teníamos que poner esa ola en un temporizador y seguir metiendo esqueletos sin importar cuántos matara el héroe. Una vez que el temporizador llegaba a cero, soltábamos una oleada de enemigos más letales con un temporizador nuevo. De esta manera, la presión no se detenía y los jugadores seguían interesados. ",
      "Lo más importante era que sus [i]objetivos[/i] habían cambiado. Mientras nuestro héroe se encontraba masacrando a un número cada vez menor de esqueletos, el objetivo era \"Haz que el número de esqueletos llegue a cero\", pero si el número de esqueletos [i]no disminuye sin importar a cuantos asesines[/i], entonces los jugadores entienden rápidamente que matarlos no es el objetivo. ",
      "En vez de eso, se enfocaron en lo que [i]lograban[/i] al matar a todos esos esqueletos: en este caso, habilidades y mejoras. De repente, el objetivo no era \"Matar a todos los esqueletos\", sino que era \"¿A cuántos de estos puedo matar lo más rápido posible para volverme lo más [i]poderoso[/i] posible?\". En lugar de sentirse como una tarea molesta, el eliminar oleadas de enemigos comenzó a sentirse como ir tras el premio mayor, donde cada enemigo muerto te acerca a la combinación perfecta de tu héroe. ",
      "Como el paso a la siguiente oleada ya no consistía en acabar con todo lo que había en la anterior, también habíamos obtenido algo nuevo: un temporizador compartido. Esto significaba que los jugadores ahora compartían el mismo ritmo, un lenguaje común para cuando las cosas empezaban a ponerse difíciles. Así que cuando un jugador decía, \"No soporto la oleada de arañas al minuto cuatro\", todos sabían de inmediato lo que eso significaba (esas arañas eran lo peor).",
      "Finalmente, habíamos encontrado el factor de diversión. Este pequeño cambio de enfoque ayudó a aclarar lo que les gustaba a los jugadores y por qué, y desencadenó una cascada de ideas nuevas: mejoras más potentes, habilidades más locas y posibilidades para los héroes que ni siquiera habíamos considerado. Esto significó que quienes probaban el juego podían crear combinaciones de héroes totalmente diferentes entre sí en una sola partida. Además, los jugadores estaban más involucrados durante las pruebas de juego y nos daban mejores comentarios y sugerencias para incorporar a la próxima versión.",
      "Bueno, eso si hubiéramos preguntado más de una vez. Después de una prueba de juego, algunas veces descubríamos que nuestros compañeros de trabajo ya no querían hablar con nosotros sobre sus altibajos, querían hablar entre ellos sobre sus combinaciones y discutir sobre cuál era la mejor. ",
      "A medida en que aumentaba la variedad de combinaciones, empezamos a preguntarnos si habíamos pasado por alto una pieza importante del rompecabezas: ¿qué pasaría si los héroes en sí se sintieran tan únicos como las habilidades? En los primeros prototipos, aparte de su habilidad inicial, la experiencia del jugador era prácticamente idéntica, sin importar el héroe que seleccionara. Ahora los estábamos modificando para convertirlos en opciones verdaderamente únicas, haciendo a uno más fuerte, a otro más rápido, a otro mejor para infligir daño mágico, lo que aumentó aún más las variaciones en las combinaciones. Elegir un héroe en vez de otro también significó abrir ramas específicas de habilidades que de otra manera no se hubieran podido configurar, y como la suerte es siempre un factor involucrado en las mejoras que recibes, cada elección parecía ser una apuesta de alto riesgo.",
      "[h3]Los primeros seis minutos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Mientras tanto, mientras estás distraído tratando de descubrir qué rama de mejora te llevará a Imperia, poco a poco vamos aumentando la dificultad. En algún punto (sin que te des cuenta), las oleadas de enemigos se vuelven más letales, la paz no tiene lugar y a duras penas puedes mantenerte a flote. ",
      "O al menos, ese era el objetivo. Con la llegada de las mejoras, cambiamos el ritmo del juego. Queríamos que la experiencia fuera intensa, pero sin que fuera más larga de lo debido. Sabíamos que la mayoría de los jugadores iban a jugar mientras estaban a la espera de una partida. Por otro lado, queríamos dejar suficiente espacio para que los jugadores disfrutaran viendo cómo se acumulaban sus opciones de mejora.",
      "Nuestros cálculos hechos en una vil servilleta desechable nos daban 12 minutos de juego en total, sin contar los tres minutos de la batalla final contra Imperia. Así que nos pusimos a trabajar de nuevo para marcar el ritmo de los primeros seis minutos. ¿Con qué frecuencia tendríamos que ofrecerle al jugador una opción de mejora? ¿Qué tan pronto podrían comenzar a acumular habilidades? ¿Cuánto daño debería infligir cada habilidad para que resulte satisfactoria pero no excesivamente poderosa? ",
      "Como estábamos ajustando la jugabilidad por secciones, enfocarnos en los primeros seis minutos significaba que los últimos seis minutos eran básicamente injugables en este punto. Hacíamos que la gente probara el juego durante los primeros seis minutos y luego les pedíamos que se detuvieran. [i]En teoría[/i], podían seguir jugando, pero todo lo que pasaba después del minuto seis era provisional. No se esperaba que jugaran más allá de ese punto, (en realidad, le suplicamos a nuestros compañeros de trabajo que no lo hicieran). ",
      "Un efecto secundario gracioso de hacer que las habilidades y mejoras fueran tan divertidas como lo fueron en realidad, fue que los jugadores que probaron el juego a menudo no les importaba que la mitad del mismo seguía sin poderse jugar. Nos sentábamos en el escritorio de un compañero de trabajo para verlos jugar la primera mitad del juego. Una vez que llegaban a los seis minutos, les decíamos: ",
      "\"Genial, gracias\". \"¿Puedes comenzar el juego otra vez?\"",
      "Después de una pausa, nos decían: ",
      "\"¿Sabes qué? Espera. Creo que lo puedo pasar\". ",
      "Les recordamos que los últimos seis minutos eran un páramo desequilibrado y castigador de enemigos copiados y pegados, y que en ese momento era imbatible. Nos decían que lo entendían. Les hacíamos preguntas sobre sus altibajos. Nos ofrecieron muchos comentarios valiosos sobre su experiencia de juego durante los primeros seis minutos, y luego regresábamos a nuestros escritorios, y mientras que ellos nos observaban irnos, reanudaban el juego e intentaban pasarlo de todos modos. ",
      "Algunos de nuestros compañeros de trabajo se tomaron esto como una ofensa personal porque no podían superar los últimos ferozmente injustos y literalmente imposibles seis minutos. Así que mientras diseñábamos la primera parte del juego, ellos se pusieron a colaborar para ver cómo se podía pasar la imbatible segunda parte, mientras se rompían la cabeza pensando. ",
      "Y el meollo del asunto fue que lo pasaron. ",
      "Con el tiempo, descubrieron la combinación precisa de habilidades superpoderosas que aún no habíamos perfeccionado y superaron la parte del juego que se consideraba imbatible, lo cual habla mucho sobre el diseño del juego, pero incluso más sobre el tipo de personas que se dedican al diseño de juegos.",
      "[h3]Caos controlado[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Creamos el minijuego principal al final del proceso de desarrollo. Teníamos listas las habilidades, los encuentros con mis minijefes y la batalla final con la Reina Imperia.  En este punto, ya no buscábamos problemas sobre cómo funcionaba el juego, sino formas para ajustar, equilibrar y pulir hasta dejar reluciente lo que ya sabíamos que funcionaba. Continuamos haciendo pruebas de juego, pero redujimos las exhaustivas entrevistas después de las partidas y simplemente dejamos que la gente jugara para divertirse (y, por supuesto, para generar más datos).",
      "Los datos cuantitativos que obteníamos en cada instancia eran importantes, pero los cualitativos proporcionados por los jugadores haciendo pruebas no se quedaban atrás. Hubo un ejemplo que pasará a la historia donde un jugador haciendo pruebas terminó la partida de forma épica con La Masa de las Lamentaciones (que internamente llamábamos \"carnicería\"), donde se apoderó de más de la mitad de la pantalla y devoró al jugador. En ese momento, el jugador tenía detrás de él una audiencia de compañeros de trabajo riéndose de su desgracia. Claro que de inmediato presionó el botón \"Reintentar\".",
      "Teníamos la seguridad de que teníamos algo que merecía la pena lanzar, así que ampliamos las pruebas de juego para que pudieran probarlo todas las personas que se habían ofrecido como voluntarios, quedó abierto básicamente a cualquier persona a la que pudiéramos acorralar en la empresa para que participara en una partida. En nuestros primeros prototipos, nos sorprendían a las 11 de la noche con mensajes en Slack diciendo cosas como \"Este juego es demasiado difícil\". En este punto, todavía nos llegaban esos mensajes de las 11 de la noche, pero seguido por otro a las 3 de la mañana diciendo \"Olvídenlo. Ya lo pasé\". ",
      "Incluso con un juego casi terminado, seguimos trabajando en el [i]Nido de Espinas[/i] hasta que lanzamos el Acto IV de la Caída de la Corona. Muy al inicio de esta publicación, dijimos que podemos tomar mejores decisiones cuando contamos con buenos datos que los respalden. Bueno, ahora tenemos algunos datos. Considerando lo entusiasmados que estaban los jugadores haciendo pruebas por jugar (y volver a jugar) al juego, obtuvimos muchísimos datos para saber qué partes de lo que habíamos creado estaban teniendo éxito. No hay nada mejor para llenar de entusiasmo una sala repleta de desarrolladores de juegos que el momento en el que un juego se pone divertido. Queríamos hacer más de las cosas que ahora sabíamos funcionaban, tanto como fuera posible. Nuevos objetos, habilidades, historias e incluso oleadas, cada vez que pensábamos que habíamos dado en el clavo, a alguien se le ocurría inevitablemente una idea más, \"nada más una\", y como normalmente era una idea maravillosa, no podíamos evitar probarla.",
      "No fue solo que seguían surgiendo ideas sobre nuevas funciones, sino que fueron cada vez mejores a medida que nos acercábamos al lanzamiento. Al principio, cuando las cosas estaban más amorfas, era difícil distinguir entre una característica potencialmente de alto valor y una de poco valor. Cuando estábamos a una semana del lanzamiento, era claro cuáles eran los mejores lugares donde invertir nuestros recursos y tiempo para mejorar el juego.",
      "[h3]Abandonando el nido[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Mientras le dábamos los toques finales al [i]Nido de Espinas[/i], pudimos dar un paso atrás y verlo con ojos nuevos. El desafío había sido aplicar las cosas que habíamos aprendido de actos anteriores para construir una batalla lo suficientemente épica contra un jefe para cerrar un evento masivo. Estábamos muy contentos con lo que habíamos logrado, especialmente considerando las limitaciones de tiempo. Lo habíamos hecho divertido.",
      "Desafortunadamente, la comunidad aún no lo veía así. Lo que no habíamos considerado fue que, debido a que el [i]Nido de Espinas[/i] era una batalla contra un jefe, lógicamente tenía que suceder en… bueno, donde vive el jefe (en este caso jefa), al final del juego. Esto significó al menos un día o dos de tortura silenciosa mientras esperábamos a que los mejores jugadores de Dota avanzaran a paso lento en el Acto IV a velocidades inhumanas, esperando ver cuándo los jugadores finalmente tendrían la oportunidad de jugarlo. ",
      "Resulta que no tuvimos que esperar mucho. Pensamos que tendríamos al menos un día o dos antes de que alguien llegara a la sala de trono de la Reina Imperia. Resulta que habíamos subestimado enormemente la rapidez con la que los jugadores de Dota pueden avanzar a toda velocidad por el contenido. Tan solo dieciséis horas después del lanzamiento (sí, [i]horas[/i]), los primeros jugadores más apasionados se habían abierto paso a través de todo el último acto y estaban disfrutando por primera vez del [i]Nido de Espinas[/i].",
      "Y eventualmente todos se pusieron al día. Al momento de escribir este artículo, el [i]Nido de Espinas[/i] ha sido jugado casi cien millones de veces, (si aún no te has puesto al día, o si solo quieres probarlo una vez más, todavía lo puedes jugar en el archivo de la Caída de la Corona).",
      "[h3]Aceptando la incertidumbre[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Esperamos que esta retrospectiva entre bastidores del equipo de Dota creando un minijuego te haya dado una mejor idea de nuestro proceso y no te haya hecho ver esta publicación con horror al descubrir que lo estamos inventando todo sobre la marcha. Realmente esperamos que esto demuestre que el diseño de juegos no es un arte místico creado por genios creadores de juegos que juntan sus dedos en habitaciones oscuras, sino un proceso iterativo de prueba y error impulsado por datos, ansiedad, pruebas de jugabilidad y fracasos, más pruebas de jugabilidad y más fracasos, y más pruebas de jugabilidad.",
      "El desarrollo de juegos se basa en la iteración; lo que comienza como \"no tengo idea\" lentamente se convierte en \"una idea\" al observar las ideas anteriores que funcionaron. Luego se convierte en un prototipo malo al que nadie quiere jugar, pero de todos modos lo hacemos. Después los vemos que no se divierten jugándolo, y arreglamos todas esas partes que no son tan divertidas, hasta que finalmente vemos que comienzan a divertirse. Luego lo pulimos y lo volvemos a pulir, y vemos la fecha de lanzamiento y nos ponemos a llorar. El espíritu de Valve siempre ha sido aceptar la incertidumbre y permitir que los datos moldeen el desarrollo. Esto significa que no siempre sacamos las cosas a tiempo, pero creemos que, cuando estén listas y las lancemos, te van a gustar."
    ],
    "commentcount": 31,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 58,
    "votedowncount": 14,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747093762,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 58,
  "votes_down": 14,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}