{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "開発こぼれ話：いばらの巣",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "開発こぼれ話：いばらの巣",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]ブログ連載「開発こぼれ話」へようこそ。この連載では、Dotaチームがこのユニークなゲームの開発中に遭遇した課題、バグ修正、偶然起こったうれしい出来事などを紹介していきます。[/i]",
      "Crownfallのような大規模イベントでは、オーバーワールドマップ、分岐するストーリーライン、ヒーローをテーマにしたトークン、ミニゲーム、コミック、ピクセルアート、そして長年探求したいと思っていたアイデアなど、さまざまな実験を試みる必要がありました。",
      "こうしたリスクを受け入れる自信を持てた理由は、Valveが「イテレーションを行う自由」を常に活用しているからです。それは、実際のプレイヤーデータを収集し、想定を検証し、時には考えを改めることにもつながるものです。 私たちは「プレイヤーの実際の反応を見るまでは、自分たちが作っているものを完全に理解することはできない」とよく言います。だからこそ、その段階にできるだけ早く到達できるよう努めています。",
      "この考え方は、意思決定のタイミングにも影響を与えます。通常、それは開発のできるだけ終盤、つまり最良の（場合によっては唯一の）データが得られたときです。 私たちは、開発のあらゆる段階で実際のプレイヤーの体験を参考にし、反応が良いものに焦点を当てる一方、そうでないものからは遠ざかるようにしています。",
      "今回の「[i]開発こぼれ話[/i]」では、Crownfallの比較的終盤に登場した第4幕の女王インペリアとのボス戦「[i]いばらの巣[/i]」の開発秘話を紹介します。 これは、プレイテストとそれによって生成されるデータが意思決定にどのように影響するかを示すケーススタディとしても使用されています。",
      "[h3]インペリアへの道[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "第1幕における最初の（そして唯一の）ミニゲームは、朝食に魚を食べたいタイドハンターが、プレイヤーの釣りの腕前を試すというささやかなものでした。 第1幕の大部分はこのような小さなアイデアをマップ全体に散りばめて、プレイヤーの反応を確認しました。 第1幕で得られた有望なプレイヤーデータのおかげで、第2幕でさらなる冒険をする自信がついた私たちは、第3幕では、タスクの行きつけの酒場を舞台にした格闘ゲーム「[i]Sleet Fighter[/i]」、ウィンターワイバーンと知恵比べをするマッチ3ゲーム「[i]Dragon Chess[/i]」、そしてアイスラックの入り組んだ洞窟システムの中で邪悪なドラゴンとヴェンジフルスピリットが戦うシューティングゲーム「[i]Zaug's Lair[/i]」をリリースしました。 ",
      "そして、第4幕に到達する頃には、何がうまくいって何がうまくいかなかったのかがはっきりとわかっていました。 では、どのようなデータを参考にしたのでしょうか？ それは、各ミニゲームを何人のプレイヤーがどれくらいの頻度で再プレイしたかというような具体的なデータから、ユーザーから寄せられたフィードバックやオンラインでの議論のような、より分析的なものまで、あらゆるデータを参考にしました。 この明確な認識があったからこそ、私たちは自信を持って、あの衝撃的なフィナーレ、邪悪な女王インペリアとの壮大なボス戦に全力を注ぐことができたのです。",
      "もちろん、ボス戦をどのようなゲームにするかを決めるのは容易ではありませんでした。 プレイヤーが期待するハイリスクで壮大な見せ場を提供する必要があることは分かっていました。 しかし同時に、何度プレイしても飽きない十分なバリエーションとリプレイ性も提供する必要がありました。 さらに、これはあくまでもミニゲームであり、マッチの待ち時間にプレイすることが想定されているため、緊迫感がありながらも短時間で楽しめる必要がありました。 本格的な食事ではなく、美味しい軽食のように感じてもらう必要がありました。",
      "適切なバランスを実現するためには、「[i]Sleet Fighter[/i]」のプロダクションバリューと「[i]Dragon Chess[/i]」のリプレイ性を兼ね備えたジャンルが必要でした。 結局のところ、これはヴェンジフルスピリット、スカイラスメイジ、そして新参者のケズ（4幕で構成されるCrownfallのストーリーに登場する「ビッグ3」）がインペリアの城を襲撃する壮大な対決となります。 プレイヤーには、女王に辿り着くまでの道のりで、不可能と思える困難に立ち向かっているかのような感覚を味わってほしいと考えました。",
      "[h3]計画の立案[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "一時的に注目を集めたアイデアの1つは、ターン制JRPGスタイルの戦闘でした。 しかし、それが適切ではないことに気づくのに、それほど時間はかかりませんでした。 私たちが必要としていたのは、プレイヤーをすぐにアクションに引き込めるものであり、Dotaのキューの合間にプレイできるほど短く、緊迫感があり、楽しいものでした。",
      "そこで浮かび上がってきたのが「サバイバル」というジャンルです。 無限に敵が押し寄せる「逆弾幕シューティング」は、壮大な雰囲気と緊迫感のあるボス戦に最適なゲームでした。 プレイヤーは、インぺリアとの最終決戦に備えて、ちょっとした戦略を使って、さまざまなアビリティを強化しながら、敵の大群の中を切り抜けていきます。 既存のDotaアイテムやアビリティをアクションに容易にマッピングできるため、プレイヤーはすでにその仕組みを理解しています。",
      "比較的短い体験にしたかったため、リプレイ性も重要な要素のひとつでした。 サバイバルというジャンルでは、同じ体験が繰り返されることはないため、可変性が得られます。 プレイヤーが期待しているアイテムやイベントが、プレイヤーの希望に沿った順序で入手できるという保証はありません。 可変性があることで、乗り越えられないと感じたり、イライラしたりすることなく、やりがいを感じながら、何度でもゼロから挑戦し続ける意欲が湧いてきます。 必ずしも最初から勝ってほしいと思っていたわけではありませんが、負けてもプレイし続けてもらいたいと思っていました。 ",
      "[h3]初期プロトタイプ[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "「[i]いばらの巣[/i]」の初期のプロトタイプは、最終的に公開したバージョンと同じコア要素から始まりました。 プレイヤーは3人のヒーローから1人を選び、次々と押し寄せる敵に立ち向かい、最終的にはインペリアと対峙します。 初期のプロトタイプは、まったく楽しいものではありませんでした。 あるときは、ヒーローがほとんど何もないマップをさまよって、時折スケルトンに遭遇するだけでした。 またあるときは、押し寄せる敵の波に圧倒されて、勝つことが不可能な状態になりました（少なくともそのときはそう思っていました。これについては後述します）。 ですが、このゲームが楽しいものとなる糸口がどこかにあるはずだと信じていました。 そのため、それを見つけるまで、私たちは楽しくないビルドでプレイテスターたちを苦しめ続けるしかありませんでした。",
      "Valve社員は全員、実験台のモルモットです。ビルドを誰かに試してもらうことで、何が機能しているか（また、同様の頻度で何が機能して[i]いないか[/i]）を判断できます。 ブレインストーミングはいつまでもできますが、誰かが実際にプレイするまで、私たちがしてきた選択が正しかったかどうかはわかりません。",
      "当初、プレイテスターは最初の3～6分間を生き延びるのにも苦労しました。 通常、これはゲームのバランスが取れていないか、またはルールの説明が不十分であることを示しています。 私たちは、プレイテスターたちから感想を聞きました。例えば、次に何をすべきかわからなかったり、圧倒されて勝つことが不可能だと感じたり、退屈だと感じたりしたときについて話してもらいました。 その後、私たちはデスクに戻って変更を加え、新しいプレイテスターに試してもらいました。 進捗はゆっくりとしたものでした。",
      "すると、あるとき変化が起こりました。",
      "最初のプレイで負けてしまったプレイテスターが、「もう一度やってもいい？」と言ったのです。",
      "それは初めてのことであり、励みになりました。 「いばらの巣」はまだ良いゲームというには程遠く、プロトタイプをクリアする方法を理解するまでに少なくとも3回はプレイする必要がありました。しかし、たった一度とは言え、この酷いプロトタイプをもう一度プレイさせてほしいと言う人が現れたことで、自分たちが単に同僚に酷いプロトタイプをプレイさせているだけではないと思えることができてほっとしました。  「まったくダメというわけじゃないと思うよ」とほんの少し興味を示してくれたのです。 私たちはその言葉を喜んで受け取りました。",
      "しかし、真のエウレカの瞬間はまだ訪れていませんでした。",
      "[h3]ヒーロービルド[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "初期のバージョンに欠けていた、重要なサバイバルの要素は、絶え間ないプレッシャーでした。 最初は、1つのレベルに100体のスケルトンの波を発生させ、ヒーローがそれらを倒すだけでした。 ヒーローが敵をすべて倒したら、より高い難易度で次の波が発生します。 プレイテスターはこれにすぐ飽きてしまいました。 敵を際限なく倒すことが唯一の目標だとわかると、面倒な作業のように感じられます。 敵をより効率的に倒したことで得られる報酬は、難易度の高い次の波とより早く戦えるということだけでした。 （誰が喜ぶでしょう？）",
      "最終的に、スケルトンを100体出現させてヒーローが攻撃を開始したら、その波にタイマーを設定し、ヒーローが何体倒してもスケルトンを補充し続けることが必要であるとわかりました。 タイマーがゼロになると、新たなタイマーとともにより強力な敵の波が出現します。 これにより、プレッシャーが緩むことはなく、テスターは熱心にプレイし続けました。 ",
      "しかし、もっと重要なのは、彼らの[i]目標[/i]が変わったことです。 ヒーローが倒すスケルトンの数が減り続けると、「スケルトンの数をゼロにすること」が目標になります。 ですが、スケルトンを[i]どれだけ倒しても数がまったく減らなければ[/i]、スケルトンを倒すことが本当の目標ではないことに気付くのにそれほど時間はかかりません。 ",
      "代わりに、プレイヤーの焦点は、すべてのスケルトンを倒すことで[i]得られるもの[/i]、今回の場合はアビリティとアップグレードに移りました。 突然、目標は「すべてのスケルトンを倒す」ことではなく、「できるだけ早くたくさん倒して、ヒーローをいかに[i]強く[/i]するか」ということに変わりました。 敵の波を倒すことが、ただの面倒な作業ではなくなり、敵を倒すたびに完璧なビルドに近づくような、ジャックポットを追い求める感覚が生まれました。 ",
      "次の波に進むために、前の波の敵をすべて倒す必要がなくなったことで、クロックを共有することもできるようになりました。 これにより、プレイヤー間の時間感覚が共通となり、ゲームの難易度が上がるタイミングのような話がしやすくなりました。 例えば、あるプレイヤーが「開始4分目に現れるクモの大群が本当に嫌だ」と言うと、他のプレイヤーはその意味をすぐに理解できました（あのクモは最悪です）。",
      "私たちは、ついに楽しさを見つけたのです。 焦点をわずかにずらすことで、プレイヤーが何をなぜ楽しんでいるのかが明確になり、より強力なアップグレードや、より素晴らしいアビリティ、思いもよらなかったビルドの可能性など、新しいアイデアが次々と生まれました。 プレイテスターたちは1回プレイするだけで、お互いにまったく異なるヒーロービルドを作成できるようになりました。 その結果、彼らはより熱心にプレイテストに取り組むようになり、次のビルドに活かすためのより良いフィードバックや提案をしてくれるようになりました。",
      "まぁ、何度も聞く必要はありましたが。 時折、プレイテストを終えた同僚たちが、良かった点や悪かった点について私たちに話してくれないことがありました。 彼らはお互いのビルドについて話したがり、どちらのビルドが優れているかを議論したがったのです。 ",
      "ビルドの種類が増え続けるにつれ、私たちはパズルの大きなピースを見逃しているのではないかと考え始めました。ヒーロー自体もアビリティと同じくらいユニークに感じられるようにできないかと思ったのです。 初期のプロトタイプでは、開始時のアビリティ以外は、どのヒーローを選んでも、プレイヤーエクスペリエンスはほぼ同じでした。 そこで、ヒーローの選択肢がそれぞれにユニークなものとなるように、1人は屈強にし、別の1人は敏捷にし、また別の1人は魔法ダメージを高めることで、ビルドの多様性をさらに押し広げました。 選択肢の中から1人のヒーローを選ぶことが、他のヒーローでは得られないそのヒーロー特有のアビリティを強化していくことを意味します。 （どのアップグレードを入手するかには常に多少の運が伴うため、どの選択も大きな賭けのように感じられました。）",
      "[h3]最初の6分間[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "そんな中、どのアップグレードブランチでインぺリアにたどり着けるだろうかとプレイヤーが考えている間に、難易度が徐々に上がっていきます。 ある時点で、気づかないうちに敵の波は致命的なダメージを与えるようになり、そのペースは容赦なく、頭を水面上に出しているのがやっとの状態になります。 ",
      "少なくとも、それがそのときの目標でした。 アップグレードが進むにつれ、ゲームプレイのペースを調整する作業に移りました。 プレイ体験はハードなものにしたかったのですが、長すぎるのは良くないと考えていました。 （ほとんどのプレイヤーが、マッチの前のキューで待っている間にプレイすることになることはわかっていました。） しかしその一方で、プレイヤーがアップグレードの選択を積み重ねていくプロセスを楽しむのに十分な時間の余裕も残しておきたいと考えました。",
      "ざっと計算してみたところ、最後の3分間のインペリアとの戦いを除くと、合計のゲームプレイ時間は約12分間になりました。 そこでまずは、最初の6分間のペース調整に取り掛かりました。 具体的には、どのくらいの頻度でプレイヤーにアップグレードの選択肢を提示するか、 どれくらい早くからアビリティのスタックをできるようにするか、 満足感がありながらも強すぎると感じさせないために、各アビリティが与えるダメージはどの程度にすべきか、などということについて考えました。 ",
      "ゲームプレイの調整はセクションごとに取り組んでいたため、最初の6分間に集中していたこの時点では、最後の6分間は基本的にはプレイできない状態でした。 そのため、テスターには最初の6分間だけプレイしてもらい、そこで終了するように依頼しました。 厳密に言えば、プレイし続けることは可能でしたが、6分目以降はプレースホルダーの状態でした。 「そこからあとはプレイしなくていいから」 と実際に同僚たちにお願いする必要がありました。 ",
      "アビリティやアップグレードをより楽しくしたことによる副次的な面白い効果の1つは、プレイテスターは概して、ゲームの残り半分がプレイできない状態であることを気にしていなかったということです。 私たちは同僚のデスクの近くに座って、彼らがゲームの前半をプレイするのを見ていました。 6分が経過すると、彼らとこのような会話をしました。 ",
      "「よし、ありがとう」 「じゃあもう一度、初めからやり直してもらってもいい？」",
      "一瞬の間。 ",
      "「いや、待ってくれ。このままクリアできると思う。」 ",
      "私たちは彼らに「後半の6分間は、まだバランスが非常に悪く、コピー＆ペーストされた敵がひしめき合った荒れ地のような状態であり、その時点ではクリアは不可能である」と改めて伝える必要がありました。 彼らはそれを理解してくれました。 そして、私たちは彼らに前半部分の良かった点と悪かった点を尋ねました。 彼らは最初の6分間のプレイに関する素晴らしいフィードバックを数多く提供してくれました。 そして、私たちがデスクに戻ったのを見届けた彼らは、ゲームの一時停止を解除して、何とかして最後までクリアしようとしたのです。 ",
      "同僚の中には、あまりにも難しく、打ち負かすのが絶対に不可能な後半の6分間を生き延びることができなかったことを個人的な侮辱だと受け取った者もいました。 そのため、私たちがゲームの前半を設計している間も、彼らは全力で、クリア不可能な後半を何とかクリアしようと頭を働かせ続けていたのです。 ",
      "すると驚くべきことが起こりました。彼らはゲームをクリアしたのです。 ",
      "最終的に、彼らは私たちがまだ微調整していない強力なアビリティの正確な組み合わせを見つけ出し、クリアできるはずがなかった部分をクリアしてしまいました。 この出来事はゲームデザインについて多くのことを教えてくれます。いや、むしろゲームデザインに携わっている人々についてより多くのことを教えてくれているのかもしれません。",
      "[h3]制御されたカオス[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "開発の終盤には、ゲームのコア部分は完成していました。 アビリティ、ミニボス戦、そして女王インペリアとの最終決戦もすべて整っていました。  この時点では、もはや重大なエラーを探すのではなく、すでに正常に機能しているものを手直しし、バランスを調整し、さらに磨きをかけるようにしていました。 引き続きプレイテストは実施しましたが、プレイ後の徹底的なインタビューは控えて、テスターにとってはただ楽しむために（そしてもちろん、私たちにとってはより多くのデータを収集するために）プレイしてもらいました。",
      "毎回のプレイテストから得られる量的データは重要ですが、それから得られる質的データも同様に重要でした。 記憶に残る例として、あるプレイテストでは、The Wailing Massという敵（社内では「ミートボール」と呼んでいました）が画面の半分以上を占め、プレイヤーを飲み込むという壮大な結末を迎えました。 このとき、プレイテスターの背後には同僚たちが集まり、彼の不運を笑いながら見守っていました。 そしてもちろん、彼はすぐに「もう一度プレイ」ボタンを押しました。",
      "私たちは、このゲームがリリースする価値があるものであると確信していたため、プレイテストに志願してくれた人はもちろんのこと、社内で捕まえられそうな同僚を見つけては、誰にでもプレイテストを体験してもらいました。 初期のプロトタイプのときは、「このゲームは難しすぎる」というメッセージが午後11時にSlackに届いていました。 しかし、この段階では、午後11時の「難しすぎる」というメッセージはまだ来ていても、その後午前3時には「やっぱりさっきのは忘れて。クリアしたから。」との続報が届いていました。 ",
      "ゲームはほぼ完成していましたが、Crownfallの第4幕をリリースするまで「[i]いばらの巣[/i]」の開発は続けられていました。 この記事の冒頭で、優れたデータがあれば、それを根拠により良い意思決定を行うことができると述べました。 この時点では、いくらかのデータを収集することができていました。内部プレイテスターがゲームを一度だけでなく何度も喜んでプレイしてくれたおかげで、この段階のゲームのどの部分に好意的に反応したかを知るための大量のデータが得ることができました。 ゲームが面白くなり始める瞬間ほど、ゲーム開発者でいっぱいの部屋を沸き立たせるものはありません。 私たちは、すでにうまくいっているとわかっているものを、可能な限り発展させたいと考えていました。 新しいアイテムやアビリティ、ロア、敵の波など、ゲームが完成したと思ったらすぐに必ず誰かが「あと1つだけ」とアイデアを思いつくのです。 そして、それはたいてい非常に素晴らしいアイデアだったので、試さずにはいられませんでした。",
      "機能のアイデアが次々と湧いてきただけでなく、リリースが近づくにつれて、アイデアはどんどん良くなっていきました。 初期の頃は、状況がまだ漠然としていたため、潜在的に価値の高い機能と実際には価値の低い機能を区別するのが困難でした。 しかし、リリースまで1週間を切った頃には、ゲームをより良くするためにどこにリソースと時間を費やすべきかは明らかになっていました。",
      "[h3]巣立ちの日[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "「[i]いばらの巣[/i]」の最後の仕上げをしながら、私たちは一歩引いて、新たな視点でそれを見つめることができました。 ここでの課題は、それまでの幕から学んだことを活かして、この大規模イベントの締めくくりにふさわしい壮大なボス戦を作り上げることでした。 時間的な制約にもかかわらず、やり遂げられたことに私たちはかなり満足していました。 楽しさを見つけることもできました。",
      "しかし残念ながら、コミュニティはまだ楽しみを見いだせずにいました。 私たちが見落としていたのは、「[i]いばらの巣[/i]」がボス戦である以上、論理的に考えれば、ボスはゲームの終盤に配置されるべきだということでした。 これはつまり、プレイヤーがこのゲームをプレイできるようになるまで、Dotaの達人プレイヤーが第4幕を驚異的なスピードでクリアするのを少なくとも1日から2日は静かに耐えて待つ必要があることを意味していました。 ",
      "ですが結局、それほど長く待つ必要はありませんでした。 女王インペリアの玉座に誰かが辿り着くまで、少なくとも1日か2日はかかるだろうと思っていました。 ところが、Dotaプレイヤーがコンテンツをどれだけ速くクリアできるかを過少評価していたようです。 実際には、リリースからわずか16時間後（そうです、16日ではなく16「[i]時間[/i]」です）には、最初の達人プレイヤーがすでに最終幕にたどり着くまでの戦いをすべてクリアし、「[i]いばらの巣[/i]」を楽しんでいました。",
      "やがて、他のプレイヤーたちも追いついてきました。 この記事を執筆している時点で、「[i]いばらの巣[/i]」は1億回近くプレイされています。 （まだプレイしていない方、またはもう一度プレイしたい方は、クライアント内のCrownfallのアーカイブからプレイ可能です。）",
      "[h3]不確実性を受け入れる[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Dotaチームによるミニゲーム制作の舞台裏の様子をお伝えすることで、私たちの取り組みをより深く理解してもらえれば幸いです。また、私たちがあらゆるものをその都度成り行きで作っているという事実に驚き、ただこのブログ記事を呆然と見つめるだけではなかったことを願います。 実際、ゲーム開発とは、天才たちが密室で考え抜いた神秘的な芸術などではなく、収集したデータや不安感を原動力にした試行錯誤、そしてプレイテストでの失敗を繰り返すことによって形作られているということを証明できればと思います。",
      "ゲーム開発は、試行錯誤を重ねることで成功へと近づきます。「アイデアがない」状態から始まったものが、過去に成功したアイデアを参考にすることで徐々に形になり、「何らかのアイデア」へと変わっていきます。 すると誰もプレイしたがらないような出来の悪いプロトタイプが生まれますが、それでも私たちは作り続けます。 プレイヤーが十分に楽しめていない様子を見て、楽しくない部分を徹底的に修正し、最終的にプレイヤーに楽しんでもらえるようになるまで改善を重ねていきます。 そして、さらに磨きをかけつつ、リリーススケジュールを見て涙するのです。 Valveの精神は常に、不確実性を受け入れ、データをもとに開発を進めることにあります。 そのため、必ずしも予定通りにリリースできるとは限りません。 しかし、完成した暁には、きっと皆さんに気に入っていただけると信じています。"
    ],
    "commentcount": 35,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 10,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 91,
    "votedowncount": 17,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747094598,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 81,
  "votes_down": 17,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}