{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "Entre as Lanes: Ninho dos Espinhos",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Entre as Lanes: Ninho dos Espinhos",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]Estamos de volta para mais um \"Entre as Lanes\", a crónica do blog do Dota 2 onde os membros da nossa equipa de desenvolvimento descrevem alguns dos desafios, correções de bugs e ocasionais \"acidentes felizes\" com que nos deparamos quando trabalhamos num jogo tão distinto como o Dota 2.[/i]",
      "Durante um evento tão gigantesco como o Crownfall, pudemos fazer muitas experiências: mapas do mundo, histórias ramificadas, fichas temáticas, minijogos, histórias de banda desenhada, pixel art e outras ideias que queríamos explorar há anos.",
      "O que nos deu a confiança para correr estes riscos — e algo que aproveitamos bastante aqui na Valve — foi a liberdade para iterar: poder analisar os dados de jogadores reais, compará-los com as nossas suposições e até mudar de ideias. Costumamos dizer que não compreendemos totalmente o que estamos a criar até vermos a interação dos jogadores, então tentamos chegar a esse ponto o mais rápido possível.",
      "Esta mentalidade também influencia o momento em que tomamos decisões: normalmente, o mais tarde possível no processo de desenvolvimento, quando temos os melhores (e às vezes os únicos) dados. Em cada passo, dependemos da experiência de jogadores reais para que nos ajude a concentrar nos melhores resultados e fugir do que não está a ser bem recebido.",
      "Nesta edição do [i]Entre as Lanes[/i], vamos descrever o desenvolvimento de algo que chegou relativamente tarde no evento Crownfall: um minijogo intitulado [i]Ninho dos Espinhos[/i] ([i]Nest of Thorns[/i] na versão inglesa), que serviu de palco para a batalha entre os nossos heróis e a Rainha Imperia, o boss final do Ato IV. Também usaremos esta edição como um caso de estudo para demonstrar como testes de jogos e os dados gerados por estes influenciam as nossas decisões.",
      "[h3]O caminho para a Imperia[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "O primeiro (e único) minijogo do Ato I foi um humilde minijogo de pesca onde o Tidehunter testava a tua perícia com o anzol na esperança de ganhar um bom peixe para o almoço. Muitas partes do Ato I eram assim — pequenas ideias espalhadas pelo mapa para ver com o que é que os jogadores interagiriam. Os dados encorajadores do Ato I deram-nos a confiança para sermos mais arrojados no Ato II e, no fim do Ato III, já tínhamos criado o [i]Sleet Fighter[/i], um jogo de luta na taberna favorita do Tusk; [i]Xadrez de Dragão[/i], um duelo do género \"Match 3\" contra a Winter Wyvern; e o [i]Covil do Zaug[/i], um jogo do género \"shoot 'em up\" onde a Vengeful Spirit tem de derrotar um dragão malvado nas cavernas tortuosas de Icewrack. ",
      "Quando chegámos ao Ato IV, já tínhamos uma boa noção do que funcionava bem e do que não era lá grande coisa. Com base no quê? Em tudo, desde dados concretos (como o número de jogadores que voltaram a jogar cada minijogo e com que frequência) até aos mais interpretativos (como o feedback enviado por utilizadores e comentários online). Com estes dados esclarecedores, ficámos confiantes o suficiente para dar tudo por tudo num desfecho inigualável: uma batalha épica contra a malvada Rainha Imperia.",
      "Obviamente, não foi fácil decidir qual tipo de jogo esta batalha seria. Sabíamos que teria de ser o espetáculo culminante de que os jogadores estavam à espera. Mas também tinha de oferecer variedade e repetibilidade suficientes para dar vontade de jogar várias vezes. E como isto era um minijogo, pensado para ser jogado enquanto se espera na fila por uma partida, tinha de ser intenso, mas breve. Devia ser como um petisco saboroso, não uma refeição completa.",
      "Para encontrar o equilíbrio certo, precisávamos de um género que combinasse os valores de alta produção do [i]Sleet Fighter[/i] com a repetibilidade do [i]Xadrez de Dragão[/i]. Afinal, isto era suposto ser o confronto épico entre o \"trio principal\" da história de quatro atos de Crownfall (Vengeful Spirit, Skywrath Mage e o estreante Kez) e a Rainha Imperia no seu castelo. Queríamos que os jogadores sentissem que estavam a desafiar o impossível na missão para chegar até à rainha.",
      "[h3]O plano[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "Uma ideia que no início parecia ter pernas para andar era uma batalha por turnos, estilo JRPG. Mas não demorou muito para percebermos que não era a escolha certa. Precisávamos de algo que colocasse os jogadores na ação rapidamente — algo breve, intenso e divertido o suficiente para ser jogado entre partidas de Dota.",
      "Foi aí que chegamos ao género dos jogos tipo \"Survivors\". A ideia de um \"bullet hell\" ao contrário, com hordas intermináveis de inimigos, era a fundação perfeita para uma batalha épica de alto risco. Os jogadores teriam de prevalecer sobre exércitos de inimigos e usar um pouco de estratégia para fortalecer diversas habilidades em preparação para uma luta final contra a Rainha Imperia. Também seria fácil trazer itens e habilidades existentes do Dota para a ação, então os jogadores já teriam uma ideia de como as coisas funcionariam.",
      "Como queríamos que a experiência fosse relativamente curta, a repetibilidade era outro requisito importante. Este género deu-nos muita variabilidade, uma vez que a experiência nunca é sempre a mesma. Não é garantido que os jogadores recebam os mesmos itens ou eventos de que estavam à espera e na ordem desejada. A variabilidade incentiva-te a continuar a jogar, começando do zero de uma forma que parece desafiadora, mas não impossível ou frustrante. Não queríamos necessariamente que vencesses na primeira tentativa... mas também queríamos que continuasses a jogar depois de perderes. ",
      "[h3]Primeiros protótipos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "Os primeiros protótipos do [i]Ninho dos Espinhos[/i] começaram com os mesmos elementos principais da versão lançada. O jogador escolhia um de três heróis, enfrentava horda após horda de inimigos até eventualmente chegar à Rainha Imperia. Acontece que estas primeiras versões não eram nem um pouco divertidas. Às vezes, o herói andava à deriva por um mapa quase vazio. Com sorte, encontrava um esqueleto ou dois. Outras vezes, os inimigos eram tão numerosos que era praticamente impossível vencer (ou assim pensávamos — falaremos sobre isso mais adiante). Sabíamos que havia um jogo divertido para aqui algures. Só tínhamos de continuar a torturar os jogadores de teste com más versões até finalmente encontrarmos a ideal.",
      "Cada empregado da Valve é uma cobaia e pedir a alguém para experimentar uma versão é como descobrimos se algo está a funcionar (ou, com a mesma frequência, [i]não[/i] está). Podemos discutir ideias eternamente, mas enquanto ninguém se sentar para jogar, não podemos saber se as nossas escolhas foram as certas.",
      "Ao início, as pessoas que testaram o jogo tinham dificuldades em sobreviver durante os primeiros 3‑6 minutos. Normalmente, isso significa que o jogo ou está desequilibrado ou não está a explicar as regras lá muito bem. Pedimos então aos jogadores de teste para nos descreverem a experiência — os momentos em que não sabiam o que fazer a seguir, quando os inimigos eram tantos que o desafio parecia impossível ou quando o jogo ficou simplesmente entediante. Depois voltávamos para as nossas mesas, fazíamos algumas alterações e pedíamos a outra pessoa para experimentar a nova versão. Lentamente, começámos a ver progresso.",
      "E foi então que algo aconteceu.",
      "Depois de nos descrever a sua primeira tentativa, uma pessoa que tinha acabado de perder perguntou \"Posso tentar outra vez?\".",
      "Isto nunca tinha acontecido antes e era encorajador. O Ninho dos Espinhos ainda não estava em condições de ser considerado \"bom\" (normalmente, as pessoas só percebiam como passar o nosso protótipo após três tentativas no mínimo), mas ao menos já não tínhamos de pedir aos nossos colegas que jogassem o nosso protótipo horrível — agora, eram os nossos colegas a pedir para voltar a jogar o nosso protótipo horrível.  Havia agora um pequeníssimo pingo de interesse: \"Não detesto isto completamente\". Aceitámos de bom grado o comentário.",
      "Mas o verdadeiro momento de inspiração ainda estava por vir.",
      "[h3]Builds de heróis[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "Um aspeto-chave deste tipo de jogo que as nossas primeiras versões não tinham era pressão constante. Inicialmente, metíamos uma horda de cem esqueletos no nível e deixávamos o herói desancá-los. Assim que o herói os matasse todos, gerávamos então a próxima horda de inimigos, mas mais difíceis. As pessoas que testaram o jogo depressa começaram a ficar aborrecidas com isto. Quando se aperceberam de que o único objetivo era estar constantemente a matar inimigos, o jogo começou a parecer uma tarefa chata. A única recompensa por matá‑los eficientemente era que a próxima horda de inimigos ia aparecer mais depressa. (Ena, que bom…?)",
      "Eventualmente, percebemos que quando gerávamos uma horda de cem esqueletos e o herói começava a desancá‑los, era necessário aplicar um temporizador a essa horda e continuar a gerar esqueletos independentemente de quantos o herói matou. Assim que o tempo chegasse a zero, gerávamos uma nova horda de inimigos sob outro temporizador. Desta forma, a pressão era constante e o jogador permanecia interessado no jogo. ",
      "Mas, mais importante ainda, é que os seus [i]objetivos[/i] mudaram. Quando o nosso herói estava a massacrar um número cada vez menor de esqueletos, o objetivo era \"Reduzir o número de esqueletos a zero\". Contudo, se o número de esqueletos [i]nunca diminui, independentemente de quantos matares[/i], os jogadores depressa compreendem que matá‑los não é o verdadeiro objetivo. ",
      "Em vez disso, começaram a concentrar‑se no que [i]ganhavam[/i] por matar os esqueletos — neste caso, habilidades e upgrades. De repente, o objetivo já não era \"Matar todos os esqueletos\", mas sim \"Quantos destes ossudos consigo matar o mais rápido possível para ficar o mais [i]forte[/i] possível?\" Em vez de ser uma tarefa chata, matar hordas de inimigos começou a parecer uma caça ao tesouro, onde cada inimigo morto era mais um passo dado para alcançar a build perfeita. ",
      "Como a progressão para a próxima horda de inimigos já não dependia de matar todos os inimigos da horda anterior, também ganhámos algo novo: um relógio partilhado. Isto significava que os jogadores agora partilhavam o mesmo ritmo, que tinham uma linguagem em comum para se referirem às mesmas partes do jogo. Assim, quando um jogador dizia \"eh pá, não posso com aquela horda de aranhas ao minuto 4\", toda a gente sabia logo do que se estava a falar (aquelas aranhas são do piorio).",
      "Finalmente, encontráramos a diversão. Esta pequena alteração ajudou a esclarecer o que estava a agradar aos jogadores e porquê, o que resultou numa enchente de novas ideias, como upgrades mais poderosos, habilidades ainda mais malucas e possibilidades de builds que nem sequer tínhamos considerado. Isto significava que os jogadores podiam fazer builds de heróis completamente diferentes entre si. Por sua vez, isto queria dizer que estavam mais envolvidos durante os testes e davam‑nos melhor feedback e sugestões para aplicar à versão seguinte do jogo.",
      "Bem, isto se perguntássemos mais de uma vez. Depois de uma sessão de testes, às vezes acontecia que os nossos colegas já não queriam falar dos pontos altos e baixos. Em vez disso, queriam falar uns com os outros sobre as suas builds e discutir qual era a melhor. ",
      "À medida que a variedade de builds aumentava, começávamos a pensar se não estava a faltar algo importante: e se os próprios heróis fossem tão distintos quanto as habilidades? Nos primeiros protótipos, para além da habilidade inicial, a experiência dos jogadores era praticamente idêntica, fosse qual fosse o herói escolhido. Mas agora, estávamos a ajustá‑los e a torná‑los verdadeiramente únicos, fazendo com que um fosse mais forte, outro fosse mais rápido e outro fosse especializado em dano mágico, possibilitando builds ainda mais variadas. Escolher um herói em prol de outro também significava que se abriam ramos específicos de habilidades que, com outro herói, não seriam consideradas. (E, como havia sempre alguma sorte a ditar quais eram os upgrades disponíveis para o jogador, cada escolha era como uma aposta de alto risco.)",
      "[h3]Os primeiros seis minutos[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "Enquanto os jogadores estão distraídos a pensar em que upgrades os poderão levar à Imperia, nós estamos lentamente a aumentar a dificuldade. A certa altura, sem que se apercebam, as hordas de inimigos tornam‑se mortíferas, o ritmo não dá tréguas e os jogadores mal conseguem permanecer vivos. ",
      "Pelo menos, era esse o objetivo. Já que a parte dos upgrades estava a correr bem, começámos a trabalhar no ritmo da jogabilidade. Queríamos que a experiência fosse intensa, mas que não fosse demasiado longa. (Sabíamos que a maioria dos jogadores iria jogar enquanto esperava na fila por uma partida de Dota.) Por outro lado, queríamos que houvesse espaço de manobra suficiente para que os jogadores pudessem desfrutar dos upgrades que se iam acumulando.",
      "Pelas nossas contas, tínhamos cerca de doze minutos de jogo, sem contar com a luta de três minutos contra a Imperia no fim. Então, começámos a trabalhar no ritmo dos primeiros seis minutos. Com que frequência damos uma escolha de upgrade ao jogador? Quão cedo pode este começar a acumular habilidades? Quanto dano deve cada habilidade fazer a um ponto que seja satisfatória, mas não demasiado forte? ",
      "Como estávamos a afinar a jogabilidade por secções e estávamo‑nos a concentrar nos primeiros seis minutos, isto significava que os seis minutos finais eram praticamente impossíveis de jogar. Deixávamos pessoas testar os primeiros seis minutos e depois parávamos o teste. [i]Tecnicamente[/i], podiam continuar a jogar, mas depois do sexto minuto era tudo coisas inacabadas. Não era suposto jogar para além daquele ponto. (Implorámos aos nossos colegas que não o fizessem.) ",
      "Na verdade, acabámos por tornar as habilidades e os upgrades tão divertidos, que as pessoas que estavam a testar não se importavam que a segunda metade do jogo ainda não estivesse pronta. Nós ficávamos sentados ao lado dos colegas a vê‑los a jogar pela primeira metade do jogo. Assim que chegassem aos seis minutos: ",
      "\"OK, obrigado\", dizíamos nós. \"Podes recomeçar o jogo?\"",
      "Fazia-se um momento de silêncio. ",
      "\"Sabes que mais? Deixa-me continuar, acho que consigo ganhar.\" ",
      "Nós relembrávamos que os últimos seis minutos eram um inferno desequilibrado de inimigos copiados e era impossível ganhar. Em resposta, diziam \"Tudo bem\". Perguntávamos então quais foram os pontos altos e baixos. Davam‑nos muito feedback útil acerca destes primeiros seis minutos de jogo. Depois, voltávamos para as nossas mesas, eles viam-nos a ir embora, tiravam o jogo da pausa e tentavam chegar ao fim na mesma. ",
      "Alguns dos nossos colegas levaram a peito o facto de que não conseguiam passar os últimos seis minutos, que eram ferozmente injustos e literalmente impossíveis. Ou seja, enquanto estávamos a trabalhar na primeira metade do jogo, os nossos colegas estavam dedicados a enfrentar a imbatível segunda metade. ",
      "O engraçado é que conseguiram ganhar. ",
      "Eventualmente, descobriram a combinação precisa de habilidades superpoderosas que ainda não tínhamos ajustado e passaram a parte do jogo que não era suposto passar. (Isto diz muito sobre o design de jogos, mas diz talvez ainda mais sobre o tipo de pessoas que trabalha no design de jogos.)",
      "[h3]Caos controlado[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "Na reta final do desenvolvimento, a base do jogo estava pronta. Habilidades, minibosses, o confronto final com a Rainha Imperia… estava tudo lá.  A este ponto, já não estávamos à procura de problemas que virassem o jogo do avesso, mas sim de maneiras de ajustar, equilibrar e polir o que já sabíamos que estava a funcionar. Continuámos as sessões de teste, mas parámos com as entrevistas exaustivas pós‑jogo e deixámos o pessoal jogar por diversão (e para gerar mais dados, claro).",
      "Embora os dados quantitativos de cada partida fossem importantes, o peso dos dados qualitativos não era de todo inferior. Num exemplo memorável, uma partida acabou de uma maneira épica, com a Esfera das Lamúrias (internamente chamada de \"Meatball\", ou seja, \"Almôndega\") a ocupar metade do ecrã e a devorar o jogador. Neste momento, o jogador tinha uma multidão de colegas de trabalho a assistir, todos a rir‑se do seu azar. Claro que este premiu imediatamente o botão \"Jogar outra vez\".",
      "Estávamos confiantes de que tínhamos algo que valia a pena lançar e então abrimos os testes a mais pessoas — não só a voluntários, mas também a basicamente qualquer pessoa na empresa que conseguíssemos encurralar e obrigar a jogar. Nos primeiros protótipos, éramos brindados com uma mensagem no Slack às 11 da noite a dizer \"O jogo é muito difícil\". Nesta fase, ainda recebíamos essas mensagens às 11 da noite, mas com uma mensagem posterior às 3 da manhã a dizer \"Esquece, consegui chegar ao fim\". ",
      "Mesmo com um jogo praticamente terminado, continuámos a trabalhar no [i]Ninho dos Espinhos[/i] até ao lançamento do Ato IV do Crownfall. No início deste post, dissemos que podemos tomar melhores decisões quando temos bons dados para as suportar. Bom, agora tínhamos dados: as pessoas que testaram o jogo internamente gostaram tanto de o jogar (repetidamente), que tínhamos dados mais que suficientes para saber quais eram as partes que estavam a ter impacto. E não há nada que deixe uma sala cheia de developers de jogos tão entusiasmados como o momento em que um jogo começa a ser divertido. Queríamos apostar mais nas coisas que sabíamos que estavam a funcionar bem, tanto quanto possível. Mais itens, habilidades, história e até hordas. Sempre que pensávamos que o jogo estava \"pronto\", alguém aparecia com \"mais uma ideia\". E, como geralmente era sempre uma ideia muito boa, tínhamos de a experimentar.",
      "Nem era questão de estarem sempre a surgir ideias de funcionalidades: as ideias estavam cada vez melhores à medida que a data de lançamento se aproximava. Nos primeiros dias, quando as coisas ainda não estavam bem definidas, era difícil distinguir entre uma funcionalidade com potencial e uma menos importante. A uma semana do lançamento, os melhores sítios para concentrar os nossos recursos e tempo para tornar o jogo melhor eram óbvios.",
      "[h3]Sair do ninho[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "Enquanto dávamos os retoques finais no [i]Ninho dos Espinhos[/i], pudemos admirar o nosso trabalho com uma nova perspetiva. O desafio foi usar coisas que aprendemos de atos anteriores para construir uma batalha final épica para concluir um evento massivo. Ficámos muito felizes com o resultado, especialmente tendo em conta os prazos. Encontráramos a diversão.",
      "Infelizmente, a comunidade ainda não a tinha encontrado. Não considerámos que, como o [i]Ninho dos Espinhos[/i] era uma luta contra um boss, logicamente, tinha de acontecer onde o boss vive. Ou seja, no fim do jogo. Isto significava que tínhamos de esperar mais um dia ou dois a sofrer em silêncio, enquanto esperávamos que os jogadores mais dedicados de Dota passassem o Ato IV com uma rapidez estonteante para finalmente poderem experimentar o Ninho dos Espinhos. ",
      "Mas não tivemos de esperar assim tanto. Pensámos que teríamos de esperar pelo menos um dia ou dois para alguém chegar à sala do trono da Rainha Imperia. Acontece que subestimámos muito a rapidez com que jogadores de Dota devoram conteúdo. Em apenas dezasseis horas depois do lançamento — sim, [i]horas[/i] — os primeiros jogadores já tinham passado o último ato inteiro e estavam a experimentar o [i]Ninho dos Espinhos[/i].",
      "Eventualmente, toda a gente lá chegou. No momento em que escrevemos este artigo, o [i]Ninho dos Espinhos[/i] foi jogado cerca de cem milhões de vezes. (Para quem não chegou lá, ou para quem quer jogar mais uma vez, ainda é possível jogá‑lo no Arquivo de Crownfall no jogo.)",
      "[h3]Aceitar a incerteza[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "Esperamos que este olhar pelos bastidores da equipa do Dota a preparar um minijogo ofereça uma melhor ideia do nosso processo e que não tenha feito os nossos leitores ficar boquiabertos ao aperceberem‑se de que foi quase tudo inventado em cima do joelho. Mas, agora a sério, esperamos que sirva para mostrar que a criação de jogos não é uma arte mística de génios a teclar numa sala escura, mas sim um processo iterativo de tentativa e erro impulsionado por dados, ansiedade, testes, falhanços e mais testes e mais falhanços e ainda mais testes.",
      "O desenvolvimento prospera na iteração. O que começa como \"não faço ideia\" lentamente se transforma em \"tenho uma ideia\" ao olhar para ideias do passado que funcionaram. Depois transforma-se num protótipo horrível que nem os nossos colegas querem jogar, mas obrigamo‑los a experimentar mesmo assim. Depois vemos que as pessoas não se estão a divertir enquanto jogam o protótipo e lá vamos nós consertar as partes menos divertidas, até que finalmente começamos a ver pessoas a divertir‑se. Depois polimos, polimos e voltamos a polir, olhamos para a data de lançamento e choramos. A filosofia da Valve sempre foi aceitar a incerteza e permitir que os dados moldem o desenvolvimento. Isto significa que nem sempre lançamos as coisas a tempo. Mas pensamos que as pessoas vão gostar quando as coisas estiverem prontas."
    ],
    "commentcount": 342,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 2527,
    "votedowncount": 270,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747170550,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2527,
  "votes_down": 270,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}