{
  "gid": "537722458840500111",
  "clan_steamid": "103582791433224455",
  "event_name": "刀塔漫谈：荆棘之巢",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1747091340,
  "rtime32_end_time": 1747093860,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "a597e1b6e578dbaf54061d00ce734f703345c61b.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1747082996
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1747091366
      },
      {
        "strSteamID": "76561198012148855",
        "rtUpdated": 1746662789
      }
    ]
  },
  "announcement_body": {
    "gid": "537722458840500112",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "刀塔漫谈：荆棘之巢",
    "posttime": 1747091367,
    "updatetime": 1747091367,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/a597e1b6e578dbaf54061d00ce734f703345c61b.png[/img]",
      "[i]欢迎回到“刀塔漫谈”特色博文，我们开发团队的成员会在文章中梳理自己遇到的一些挑战、错误修复还有偶尔令人莞尔的意外，主要是在开发像Dota这样独特游戏的过程中。[/i]",
      "在倾天之战这样的大型活动期间，我们尝试了很多种试验——多张大地图、带分支的故事线、英雄主题的代币、小游戏、漫画、像素画风，还有我们多年来一直想探索的其他想法。",
      "那是什么给了我们信心去承担这些风险——又是什么能让我们在Valve能不断利用呢——就是可以随意迭代的自由：收集真实的玩家数据，让数据挑战我们的假设，甚至是改变我们的想法。 我们经常说，我们也不完全明白我们在做什么东西，直到我们看到了玩家与其互动的情况，所以我们努力尽快达到这个阶段。",
      "这个心态也影响了我们做决策的时间——一般在开发阶段是很靠后的时候，我们的数据达到最佳状态（有时也只有数据）的时候。 每一步我们都依赖真实的玩家体验来帮助我们把精力集中到产生共鸣的地方，避开没有产生共鸣的地方。",
      "在本期的[i]刀塔漫谈[/i]中，我们会梳理如何开发倾天之战中上线相对较晚的——第四幕我们的英雄们与英佩瑞雅女王之间的决战，[i]荆棘之巢[/i]。 我们也会用作案例研究，展示游戏测试，还有测试中产生的数据如何影响我们作出决策。",
      "[h3]决战英佩瑞雅[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2fb6ebb175ae62ed8b49b78c27beabf998823a3e.png[/img]",
      "第一幕中第一个（也是唯一一个）小游戏是规模不大的钓鱼小游戏，潮汐猎人考验玩家的钓鱼技术，希望能为他抓来早饭。 第一幕中有很多类似的地方——散落在地图中，让玩家可以互动。 第一幕的玩家数据让人鼓舞，给了我们信心在第二幕中可以更加大胆地尝试，而到了第三幕我们推出了[i]雪原霸王[/i]，在巨牙海民最爱的破酒吧里发生的格斗游戏；[i]神龙象棋[/i]，与寒冬飞龙比拼智慧的三消游戏；还有[i]佐戈之巢[/i]，复仇之魂穿梭在冰川残骸交错复杂的洞穴里追赶恶龙的射击游戏。 ",
      "等我们到达第四幕的时候，我们已经切实地感觉到有哪些设计达到了预期的效果。 都有什么种类的数据？ 有非常具体的——多少玩家重玩了每个小游戏，还有他们的重玩频率——也有非常概括的，就像玩家提交的反馈，还有在线上的讨论。 有了清晰的认识后我们也有信心全力以赴完成惊心动魄的结局：与邪恶女王英佩瑞雅的史诗级决战。",
      "当然了，大决战要确定采用哪种游戏类型并非易事。 我们明白，需要呈现玩家所期望的高风险大场面。 但是也需要提供足够的多样性，多次游玩后重玩还会有新鲜感。 而且因为是小游戏，设计的初衷是在匹配比赛期间游玩，所以需要很刺激，但也要很简短。 给人的感觉是美味的零食，而不是漫长的正餐。",
      "为了达到合适的平衡，我们需要的游戏类型应该是结合了高水准的[i]雪原霸王[/i]和重玩性很高的[i]神龙象棋[/i]。 毕竟这会是复仇之魂、天怒法师和新人凯（我们的倾天之战四幕故事里的“三巨头”）攻入英佩瑞雅城堡的史诗级对决。 我们想要玩家感觉自己到达女王跟前的征程是在挑战不可能的任务。",
      "[h3]孵化计划[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/6fe794a0aa19db5d2dd04bbed69835e1cb6ed9ba.png[/img]",
      "其中一个短期内吸引到不少注意的是回合制的JRPG大战。 但没过多久就发现并不合适。 我们需要能让玩家快速投入战斗的东西——简短、激烈又好玩，让人在匹配Dota比赛期间游玩。",
      "这就是为什么采用了幸存者类型。 拥有着无尽浪潮的敌人，这样的“反向子弹地狱”能完美承载具有史诗感，高风险的魔王战。 玩家需要从成群的敌人中杀出一条血路，再用上一点策略强化多种技能，准备迎接与英佩瑞雅的最终对决。 而且把现有的Dota物品和技能放进来应该也很方便，这样玩家就已经了解到很多东西是什么机制。",
      "由于我们希望体验相对较短，所以能否重复游玩也是需要考虑的重要因素。 幸存者类型的游戏存在很多变量，因为相同的体验绝不可能有第二次。 玩家遇到的物品或事件并不是必定按照他们期望的顺序。 这种多变性会鼓励大家不断尝试从头开始，有挑战的感觉，但不会觉得难以克服和沮丧。 我们并不希望大家第一次就能获胜……但是我们希望大家在失败时也能继续玩下去。 ",
      "[h3]早期原型[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/5bead734fa540f1f8bc64856f0682bb1ef9d0cce.png[/img]",
      "[i]荆棘之巢[/i]最早期的原型中核心元素与我们最终发布的版本是完全相同的。 玩家从三名英雄中选择一名，面对一波又一波的敌人，最终到达英佩瑞雅的面前。 这些早期的尝试一点都不好玩。 有时候英雄是在几乎空荡荡的地图上闲逛，偶尔会遇见骷髅兵。 其他时候敌人的攻势太过猛烈，根本无法获胜（或者只是我们的想法；稍后会详细叙述）。 我们知道游戏开发到一定程度会变得好玩。 我们只需要用不好玩的版本一直折磨我们的测试员就能找到。",
      "每个Valve的员工都是小白鼠，把他们放到一个版本的面前我们就能确定一个设计是否有效（或者通常是，[i]无效[/i] 。） 我们可以一直头脑风暴，但是只有让人坐下玩起来，我们才能知道我们所作的选择能否落地。",
      "一开始测试员很难在最初3-6分钟存活下来。 通常来说，这表明游戏要么是不平衡，要么是没有充分解释游戏规则。 我们会和他们坐下来，让他们讲述他们的体验——在哪些时候他们不确定接下来该做什么，或者什么地方的压迫感太强，让人觉得不可能获胜，还有什么地方他们就是觉得开始无聊了。 然后我们就回到办公桌做出一些修改，再丢给新的测试员。 慢慢地我们开始看到了进展。",
      "然后发生了一件事。",
      "有个测试员刚输完了以后带我们梳理了他的首次闯关体验后问道，“话说，我能再试一下吗？”",
      "这是头一遭，也让人备受鼓舞。 荆棘之巢还远远谈不上好玩的境界—通常需要至少闯关三次才能搞清楚如何在我们的原型里取胜—但至少已经算不错了，这一次我们不是强迫同事去玩我们糟糕的原型，而是他们主动要求再玩一次我们糟糕的原型。  有那么一丁点儿的兴趣一闪而过：“我不是完全讨厌这游戏。” 我们已经很满意了。",
      "但是真正的尤里卡时刻还未到来。",
      "[h3]英雄流派[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/3d92e3fe8261de20e3ee9106b95db76edc557026.png[/img]",
      "我们的早期版本中缺失了幸存者类型游戏中很重要的一环，就是持续不断的压力。 最初我们只是在关卡中生成了由一百个骷髅兵组成的一波敌人，让我们的英雄努力活下去。 一旦英雄把敌人杀光，我们就再生成一波难度高一点的坏蛋。 测试员很快就觉得无聊了。 只要他们发现了唯一的目标就是无休止地杀掉坏人，就会开始觉得繁琐又无趣。 提升消灭敌人的效率只有一个奖励，就是可以更快地消灭下波更难的敌人。 （好耶？）",
      "最终我们搞明白了，我们生成了一百个骷髅兵让英雄开始作战后，我们需要给那波敌人添加一个倒计时，不管英雄击杀了多少个都要持续补充骷髅兵。 只要倒计时归零，我们就生成一波更难的敌人，再设置一个倒计时。 现在压力就不会减弱，而且玩家会保持投入的状态。 ",
      "但更重要的是，他们的目标改变了。 我们的英雄原本是在屠杀数量不断减少的骷髅兵，目标则是“让骷髅兵的数量变为零。” 如果不管消灭了多少骷髅兵，骷髅兵的[i]数量都不会减少[/i]，那么玩家用不了多久就会意识到消灭他们并非真正的目标。 ",
      "他们会把注意力转到消灭这些骷髅后[i]获得[/i]的东西上——在本例中就是技能和升级。 突然间目标就不是“杀光骷髅兵”，而是“我要杀掉多少个这样的东西我才能尽快变得[i]强大[/i]？” 就这样，消灭一波又一波的敌人就没有了枯燥的感觉，而是追逐大奖的感觉——每次击杀都会让你离完美的技能组合更近。 ",
      "因为进入下一波不再与消灭上一波所有敌人有关系，所以我们也获得了一个新东西：共同的游戏时间。 这意味着玩家现在拥有相同的游玩节奏——游戏开始上强度的常用说法。 所以有个玩家说道“我承受不住四分钟时的那波小蜘蛛，”其他人就能马上明白他的意思（小蜘蛛最变态了）。",
      "我们终于找到了乐趣所在。 注意力上发生的小小转移帮我们搞清楚了玩家到底在享受什么，又是为什么会有享受的感觉，同时让我们开启了一系列新想法——更加强力的升级效果，更加疯狂的技能还有我们未曾考虑到的流派可能性。 这意味着测试员可以在每次闯关中选择截然不同的英雄流派。 这也意味着他们在游戏测试期间可以更加投入，为我们提供更好的反馈和建议，为下一个版本服务。",
      "好吧，如果我们多问几次的话。 在一次测试后，我们有时发现同事们并不想和我们谈论他们的心情起伏。 他们想互相交谈，聊聊他们的路线流派，还去争论哪个更好。 ",
      "随着流派越来越多，我们开始怀疑自己是不是错过了重要的一环——要是英雄就和技能一样是独特的呢？ 在早期原型中，除了初始技能，玩家不管是选择了哪个英雄，他们的体验都是基本相同的。 现在我们把他们调整为真正独特的选项，一个威力更大，一个速度更快，一个更擅长魔法伤害——这样就让流派的多样性进一步提高。 对英雄进行选择也意味着会打开特定的技能分支，这个流派是选择其他英雄无法开启的。 （而且因为获得哪种升级效果都会有运气的成分，所以每次选择都像是高风险的赌博。）",
      "[h3]前六分钟[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/a7d96e54908df162d8bebb342cc4e5555db7b6d5.png[/img]",
      "与此同时，在玩家分心思考哪个升级路线能让自己见到英佩瑞雅的时候，我们在慢慢提高难度。 到了某个时间点，大家甚至都不会注意到，每波敌人开始变得致命，而且源源不断，玩家只能勉强存活下来。 ",
      "至少，那是个目标。 做完这些改动升级后，我们开始转向游戏的节奏。 我们想要整个游玩体验很紧张，但是又不会惹人厌烦。 （我们知道大多数玩家会在等候匹配比赛的时候进行游玩。） 但是另一方面，我们希望给玩家留下足够的喘息空间，看着自己的升级选择不断堆叠的过程有享受的感觉。",
      "我们用纸巾的背面算了一下，算出总游戏时长应为十二分钟左右——这还不计入最后三分钟与英佩瑞雅的战斗。 因此我们必须着手调整开局六分钟的节奏。 我们多久给玩家一次升级的选择？ 他们多早才能堆叠技能？ 每个技能应该造成多少伤害才会感觉令人满意又不会太过厉害？ ",
      "因为我们是分阶段调整游戏玩法，只专注在最初的六分钟就意味着最后六分钟在这个时候基本是玩不了的。 我们就让大家只测试前六分钟，然后让他们停下来。 [i]严格来说[/i]他们可以继续玩下去，但是六分钟后的所有内容都只是占位符。 本来就不该玩到这个的后面。 （我们真的是在求同事别玩下去了。） ",
      "把技能和升级效果做得更为有趣后产生了一个有意思的副作用，就是测试员一般也不在乎另一半时间的游戏是不是完工的状态。 我们会坐在同事的办公桌前，看着他们玩完游戏的前半部分。 一旦他们达到了六分钟大关： ",
      "我们会说：“太好了，谢谢。” “你能重新开始吗？”",
      "暂停。 ",
      "“话说，等一下，我觉得我能通关。” ",
      "我们会提醒他们，最后六分钟是一片残酷的变态荒地，全是复制粘贴的敌人，目前是无法取胜的。 他们会说他们明白。 我们会采访他们的感想。 他们会针对前六分钟的流程给我们很多不错的反馈。 然后我们会回到自己的办公桌，他们则是目送我们离开，然后取消暂停游戏，尝试通关。 ",
      "因为最后六分钟极其不公平、几乎不可能战胜，所以我们认为没人能够通关，但有部分同事觉得这是对他们的蔑视。 所以在我们设计游戏的前半部分时，他们正在集中资源，全力冲击不可战胜的后半部分。 ",
      "事实就是：他们战胜了。 ",
      "他们最终在我们尚未微调的强力技能中找到了精确的组合，并在本该落败的后半部分取得胜利。 （这能说明很多游戏设计的知识——但也许更多的是说明从事游戏设计的人。）",
      "[h3]可控的混乱[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/837204d27e0743323de00cf393f235e44238c2b0.png[/img]",
      "到了开发的末尾，游戏的核心已经构建完成。 技能、小头目遭遇战和英佩瑞雅女王的最终决战都已就位。  到了这个时候，我们不再寻找破坏游戏的问题，而是寻找调整、平衡和完善的方法，让已知有效的设计能够尽善尽美。 我们继续进行测试，但是减少了详尽的事后访谈，只是让大家为了好玩而进行游戏（当然，也是为了生成更多数据）。",
      "虽然每次闯关得到的定量数据很重要，但是来自游戏测试的定性数据也同样重要。 举一个令人难忘的例子，有一次游戏测试以悲叹之核——内部名称为“肉球”——占据了大半个屏幕并吞噬玩家而结束。 此时，测试员身后站着一群同事，他们都在嘲笑他的不幸。 当然，他马上按下了“再玩一次”的按钮。",
      "我们确信已经有值得推出的东西了，而且把游戏测试的范围从自愿报名扩大到公司里能碰到的所有人。 在我们最早期的原型阶段，我们会在晚上11点收到一条Slack消息，说“游戏太难了。” 到了这个阶段，我们还是会收到那些晚上11点的Slack消息，但后续还有凌晨3点的“没关系，我赢了。” ",
      "尽管游戏已经基本完成，但我们在推出倾天之战第四幕的前夕还在制作[i]荆棘之巢[/i]。 早在本文开头，我们就说过，我们有了良好的数据作为支撑的时候，我们可以做出更好的决策。 好吧，现在我们有了一些：内部测试员非常有兴趣玩（和重玩）游戏，因此我们有大量数据可以知道我们构建的内容中哪些部分引起了共鸣。 要让满屋子里的游戏开发者兴奋起来，没什么能比得上游戏开始变得好玩的那一刻。 我们希望尽可能多地做我们现在知道行之有效的东西。 新的物品、技能、剧情甚至是一波敌人——每当我们以为游戏已经尘埃落定的时候，总会有人不可避免地再提出一个“就再加一个”的想法。 而且因为通常都是非常不错的想法，所以我们都会忍不住再去尝试一下。",
      "这不仅仅是因为功能性的创意不断涌现：随着我们越来越接近发布的时刻，想法越来越接近落地。 在开发的初期，很多东西都很模糊的时候，潜在的高价值功能和实际的低价值功能很难作出区分。 到了距离发布只剩一周的时候，到底在哪里投入我们的资源和时间能让游戏变得更好就显而易见了。",
      "[h3]离开高巢[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/685097328585da9bfa275cdcfe3b8fc216dcb911.png[/img]",
      "我们对[i]荆棘之巢[/i]进行最后润色的时候，我们能够后退一步，用全新的眼光来看待它。 我们原先面临的挑战是，利用我们在前几幕学到的东西来构建一场适当的史诗级决战，作为大型活动的尾声。 我们对取得的成果非常满意，特别是考虑到时间的限制。 我们找到了乐趣所在。",
      "不幸的是，社区还没有找到。 我们没有考虑到的是，既然[i]荆棘之巢[/i]是决战大魔王，从逻辑上来说，是存在于……好吧，大魔王的所在地，也就是游戏的最后。 这意味着我们至少要静静地忍受一两天的折磨，等待着Dota的超人玩家以惊人的速度完成第四幕，才能看到玩家们最终有机会进行游戏。 ",
      "事实证明我们不需要等很久。 我们以为至少要一两天才能有人到达英佩瑞雅女王的王座室。 实际上我们严重低估了Dota玩家通关的速度。 发布后仅仅过了十六个小时——没错，[i]小时[/i]——首个超人玩家就已经奋战完整个最终幕，并且初次体验到了[i]荆棘之巢[/i]。",
      "最终其他人也都赶上来了。 截至撰写本文时，[i]荆棘之巢[/i]的游玩次数达到了近一亿次。 （如果你自己还没追上进度，或者还想亲手再玩一次，客户端内的倾天之战档案馆中还是可以游玩的。）",
      "[h3]拥抱不确定性[/h3]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/dc44d370056152b0705848de726f1125ca31b8ee.png[/img]",
      "我们希望，这篇关于Dota团队开发小游戏的幕后花絮能让大家更好地了解我们的流程——而不仅仅是让人惊恐地盯着这篇博客文章，意外地发现我们都是边做边想。 但说实话，我们希望文章能证明游戏设计并不是制作游戏的天才在黑暗的房间里用手指创造的某种秘术，而是一个反复实验试错的迭代过程，驱动是靠数据、焦虑、游戏测试、失败、游戏测试、更多失败和更多游戏测试。",
      "游戏开发是依靠迭代来成长——不断回顾过去可行的想法，让最初的“没有想法”慢慢变成了“有想法”。 然后变成一个糟糕的原型，没人会主动想玩，但我们还是会强迫的。 然后我们看着大家玩得并不开心，再去解决不好玩的地方，直到最后我们看着大家玩得很开心。 然后我们不断进行打磨，看着推出的日程安排默默流泪。 Valve的精神一直都是拥抱不确定性，让数据来影响开发过程。 这意味着我们并不是总能按时更新。 但我们认为，推出更新的时候大家会喜欢的。"
    ],
    "commentcount": 346,
    "tags": [
      "mod_reviewed",
      "ModAct_1691520782_1747092502_0"
    ],
    "language": 6,
    "hidden": 0,
    "forum_topic_id": "598526573215232864",
    "event_gid": "537722458840500111",
    "voteupcount": 2576,
    "votedowncount": 274,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598526573215232864",
  "rtime32_last_modified": 1747172682,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1747092503,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2575,
  "votes_down": 274,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598526573215232864",
  "clan_steamid_original": "103582791433224455"
}