{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2023 Kutlama Güncellemesi",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "The International 2023 Kutlama Güncellemesi",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "The International 2023 için The International Dergisini yayınlayacağımız için çok heyecanlıyız. Önceki yılların dergilerine nazaran bu senenin dergisi yenilikler barındırıyor. Bu yüzden yeni derginin ne olduğunu, nasıl çalıştığını ve neden bu şekilde yaptığımızı sizlere açıklamak istiyoruz.",
      "[url=https://www.dota2.com/newsentry/6252732681186068104]Birkaç ay önce açıkladığımız gibi[/url] Dota'nın geçmişine göz attığımızda Mücadele Biletlerinin bir yılda bütün içerikleri istikrarlı bir şekilde tüketecek şekilde büyüdüğünü ve yıl boyunca yaratıcı şeyler sunmamızı engellediğini fark ettik. Bu durumu düzeltmek istedik ve birkaç ay önce yeni şeyleri daha geniş formlarda daha sık yayınlama kararı aldık. Bu yıl deneylerle doluydu: [url=https://www.dota2.com/newsentry/3692442542239261662]yepyeni bir oyuncu davranış sistemi[/url], [url=https://www.dota2.com/newsentry/3640650512230380185]10. Yıl dönümünü kutlamak[/url] için ücretsiz öğeler, [url=https://www.dota2.com/newsentry/5657125992547620671]çeşitli[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]oynanış yamaları[/url], topluluk yapımı setler ve daha fazlasını sizlerle buluşturduk. Bu Dergi de getirdiğimiz yeniliklerin bir örneğidir.",
      "[h3]Etkinlik Odaklı Özellikler, Etkinlik Odaklı Ödüller[/h3]",
      "Her Dota güncellemesinin çeşitli hedefleri vardır ve bir güncellemeyi tasarlayıp oluşturma işinin bir parçası da nereye odaklanacağını seçmektir. Bir güncelleme kozmetik içerikler veya dengeyi iyileştirmeye odaklanabilir. Bir güncelleme en büyük ödül havuzunu oluşturmaya çalışabilir. Bu hedefler yerine bu güncellemeyi daha dar bir şekilde odaklamayı seçtik: Oyuncuları, takımları, ve The International'da oynanan üst düzey Dota sanatını yükseltmek. Oyunlar oynanırken TI'ı daha eğlenceli hale getirecek bir dizi aktivitenin yanı sıra oyunlar [i]oynanmazken[/i] de TI'ı daha eğlenceli hale getirecek başka bir dizi aktiviteye odaklandık.",
      "İşte bu yılki Dergi'nin özeti: Etkinliğin kendisi ve profesyonel oyuncuların etrafında oluşturduğumuz mücadelelerin bir koleksiyonu. Fantezi ve Tahminler gibi eski favorilerden bazılarını geri getirdik ve geliştirdik. Ayrıca, basit etkinliklerden (Bingo) ciddi derecede zorlu olanlara (The International'a Doğru Mücadelesi) kadar uzanan bazı yeni aktiviteler de sunuyoruz.",
      "Dergi aracılığıyla başaracağınız her şey ödüllere doğru ilerlemenizi sağlar. Dergi mücadelelerinde olduğu gibi, bu senenin bütün ödülleri oyuncular ve etkinlik etrafında inşa edildi. The International 2023 gösterge paneli, kalıcı sohbet çarkı replikleri ve fiziksel Koleksiyoncunun Kalkanı'nın yanı sıra takım ve oyuncu çıkartmaları ve Profil Vitrini (aşağıya göz atın) gibi birçok yeni içerik mevcut.",
      "[h3]Herkes için Bir Şeyler[/h3]",
      "Bu yılın başında belirlediğimiz hedefler doğrultusunda, ister yeni özellikler ister yeni oynanış deneyimleri olsun, yayınladığımız her güncellemenin bütün Dota oyuncuları için bir şeyler içermesi konusunun üstünde bilerek durduk. Bu güncelleme de farklı değil. Eğer birçokları gibi The International'ı izlemenin büyük bir hayranıysanız ancak tepeye çıkmış Arteezy gibi eski efsaneler veya Emo'nun oyun hikayesinin derinlikli araştırmaları ve soru işaretlerinin çeşitli şekillerde kullanılması konularına aşina değilseniz merak etmeyin, bu güncellemede sizin için de bir şeyler var.",
      "Bu güncelleme aynı zamanda bütün oyuncuların erişebileceği ücretsiz Profil Vitrinini de içerir. İster rekorlarınızla ister oyun için moda anlayışınızla ister Invoker ile bir oyun kazandığınız için gurur duyuyor olun, Dota deneyiminizin en çok değer verdiğiniz kısımlarını gösterebileceğiniz bir tuval oluşturduk. Bunun ne kadar havalı olduğunu bütün gün anlatabiliriz ancak bir resim bin kelimeye bedel olduğundan bütün güncellemenin bir sayfasını oluşturduk: [url=https://www.dota2.com/international2023?1]Resimlere göz atın[/url].",
      "[h3]İleriye Doğru[/h3]",
      "Farklı odaklara sahip gelecek güncellemeler adına çalışmaya çoktan başladık ve bir sonraki büyük güncelleme, yeni gizemli öğe setleri ve üzerinde çalıştığımız geri kalan her şey hakkında bilgi almak için ne kadar heyecanlı olduğunuzun farkındayız. Ancak şampiyonlar Kalkan'ı elde edene kadar beklemelisiniz. Şimdilik Seattle dünyanın en iyi oyuncularının geri dönüşünü memnuniyetle karşılarken biz de heyecanla bekliyoruz. The International'a Doğru'da görüşmek üzere."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}