{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "อัปเดตเฉลิมฉลอง The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "อัปเดตเฉลิมฉลอง The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "เราตื่นเต้นที่จะได้เผยแพร่ Compendium สำหรับ The International 2023 เนื่องจาก Compendium ครั้งนี้พลิกโฉมเป็นรูปแบบใหม่ต่างจากปีก่อน ๆ เราจึงอยากอธิบายให้คุณทราบว่ารูปแบบใหม่นี้มีอะไร ใช้งานอย่างไร และเราสร้างขึ้นมาเพราะเหตุใด",
      "ตามที่เราได้[url=https://www.dota2.com/newsentry/6252732681186068104]อธิบายไว้เมื่อสามเดือนก่อน[/url] เมื่อเราได้ดูประวัติของ Dota แล้วก็เห็นได้ชัดเจนว่าแบตเทิลพาสเติบโตขึ้นอย่างต่อเนื่องจนกลืนกินเนื้อหาทั้งหมดในแต่ละปี ทำให้เป็นการยากที่เราจะสามารถจัดส่งเนื้อหาเชิงสร้างสรรค์ได้ตลอดทั้งปี เราต้องการแก้ไขปัญหานี้ และได้ตั้งใจตัดสินใจเมื่อหลายเดือนก่อนที่จะผลิตและเผยแพร่สิ่งใหม่ ๆ ให้บ่อยขึ้นในรูปแบบที่หลากหลายกว่าเดิม ซึ่งปีนี้ก็เต็มไปด้วยการทดลองต่าง ๆ มากมาย เราได้เปิดตัว[url=https://www.dota2.com/newsentry/3692442542239261662]ระบบความประพฤติผู้เล่นแบบใหม่[/url] ไอเท็มฟรีสำหรับ[url=https://www.dota2.com/newsentry/3640650512230380185]ฉลองครบรอบ 10 ปี[/url] [url=https://www.dota2.com/newsentry/5657125992547620671]แพตช์เกมเพลย์[/url][url=https://www.dota2.com/newsentry/3674426239866314901]ต่าง ๆ[/url] ชุดเซ็ตไอเท็มจากชุมชน และอีกมากมาย Compendium นี้ก็เป็นอีกตัวอย่างหนึ่งของสิ่งใหม่",
      "[h3]คุณสมบัติและรางวัลมุ่งเน้นที่งานแข่ง[/h3]",
      "การอัปเดต Dota ทุกครั้งมีเป้าหมายหลากหลาย และส่วนหนึ่งของการออกแบบและสร้างอัปเดตคือการเลือกว่าจะให้ความสำคัญกับจุดใด การอัปเดตสามารถมุ่งเน้นไปที่การส่งมอบเนื้อหาไอเท็มเครื่องแต่งกายหรือการปรับสมดุล การอัปเดตสามารถพยายามสร้างเงินรางวัลรวมที่ใหญ่ที่สุดเท่าที่จะเป็นไปได้ แต่การอัปเดตครั้งนี้ไม่ได้มีเป้าหมายดังที่กล่าวไป โดยเราเลือกมุ่งเน้นเป้าหมายที่แคบขึ้น นั่นคือเพื่อยกระดับผู้เล่น ทีม และศิลปะการเล่น Dota ระดับสูงในงานแข่ง The International เราจะเน้นไปที่การสร้างชุดกิจกรรมต่าง ๆ เพื่อให้ TI สนุกสนานมากขึ้นในขณะที่เกมกำลังดำเนินอยู่ และสร้างกิจกรรมอีกชุดหนึ่งที่จะทำให้ TI สนุกสนานมากขึ้นเมื่อเกม[i]ไม่ได้[/i]ดำเนินอยู่",
      "ดังนั้น Compendium ในปีนี้ก็คือ: ชุดบททดสอบความท้าทายที่เราสร้างขึ้นซึ่งเกี่ยวข้องกับผู้เล่นมืออาชีพและตัวงานแข่งเอง เราได้นำคุณสมบัติที่ผู้คนชื่นชอบกลับมาอีกครั้งและปรับปรุงเพิ่มเติม เช่น แฟนตาซีและการทายผล นอกจากนี้ เราขอแนะนำกิจกรรมใหม่ ๆ อีกด้วย ตั้งแต่กิจกรรมสนุกสนานสบาย ๆ (บิงโก) ไปจนถึงกิจกรรมเข้มข้นโหดหิน (บททดสอบเส้นทางสู่ The International)",
      "ทุกอย่างที่คุณจะทำสำเร็จใน Compendium จะทำให้คุณได้รับความคืบหน้าสู่รางวัลต่าง ๆ รางวัลทั้งหมดในปีนี้สร้างขึ้นโดยเกี่ยวข้องกับผู้เล่นและงานแข่งเหมือนกับบททดสอบใน Compendium โดยมีทั้ง HUD ของ The International 2023, วงล้อสนทนาแบบถาวร และ Aegis ของจริงสำหรับสะสม พร้อมกับเนื้อหาใหม่ ๆ มากมายสำหรับหน้าแสดงผลงานบนโปรไฟล์ของคุณ (อ่านรายละเอียดด้านล่างนี้) ซึ่งรวมถึงสติกเกอร์ทีมและผู้เล่น",
      "[h3]สิ่งใหม่สำหรับทุกคน[/h3]",
      "เพื่อให้สอดคล้องกับเป้าหมายที่เราตั้งไว้เมื่อต้นปีนี้ เรามีเจตนารมณ์ที่จะทำให้แน่ใจว่าทุกการอัปเดตที่เราเผยแพร่จะมีบางสิ่งบางอย่างสำหรับผู้เล่น Dota ทุกคน ไม่ว่าจะเป็นเกมเพลย์แบบใหม่หรือคุณสมบัติใหม่ก็ตาม การอัปเดตครั้งนี้ก็เช่นเดียวกัน หากคุณเป็นผู้ชมส่วนใหญ่ที่ชอบรับชมการแข่งขัน The International อันน่าระทึกใจ แต่ไม่คุ้นเคยกับตำนานเก่าแก่อย่าง Arteezy ติดอยู่บนเขา หรือการค้นคว้าวิจัยของ Emo ลงลึกสู่ประวัติและการใช้งานหลากหลายของเครื่องหมายคำถาม ก็ไม่ต้องกังวลไป การอัปเดตครั้งนี้มีสิ่งใหม่ให้คุณเหมือนกัน",
      "อัปเดตนี้มาพร้อมกับหน้าแสดงผลงานบนโปรไฟล์อีกด้วย พร้อมใช้งานได้ฟรีสำหรับผู้เล่นทุกคน ไม่ว่าคุณจะภูมิใจกับสถิติของตัวเอง ความเปรื่องปราดเรื่องแฟชั่น หรือเกี่ยวกับเกมนั้นที่คุณชนะด้วย Invoker เราได้สร้างผืนผ้าใบที่คุณสามารถแสดงส่วนหนึ่งจากประสบการณ์ Dota ของคุณที่รู้สึกสำคัญมากที่สุดได้ เราสามารถอธิบายได้ทั้งวันว่ามันเจ๋งขนาดไหน แต่สิบปากว่าก็ไม่เท่าตาเห็น เราจึงรวบรวมทุกอย่างไว้ในหน้าอัปเดต [url=https://www.dota2.com/international2023?1]ลองเข้าไปดูรูปภาพได้เลย[/url]",
      "[h3]อนาคต[/h3]",
      "เราได้เริ่มพัฒนาอัปเดตสำหรับอนาคตแล้วโดยมีเป้าหมายที่แตกต่างกันออกไป และเรารู้ว่าคุณคงตื่นเต้นที่จะเรียนรู้เพิ่มเติมเกี่ยวกับแพตช์ใหญ่ครั้งหน้า และไอเท็ม Arcana ชุดถัดไป รวมไปถึงทุกสิ่งอย่างที่เรากำลังดำเนินงานอยู่ แต่ก็ต้องขออุบไว้ก่อนจนกว่าผู้ชนะจะได้คว้า Aegis of Champions สำหรับตอนนี้ เมืองซีแอตเทิลยินดีต้อนรับการกลับมาของผู้เล่นที่เก่งที่สุดในโลก และเราแทบจะอดใจรอไม่ไหวแล้ว ไว้พบกันในการแข่งขันเส้นทางสู่ The International"
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}