{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização comemorativa do International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Atualização comemorativa do International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Estamos muito entusiasmados por lançar o Compêndio do International 2023. Como este Compêndio tem um novo formato comparado com os dos anos anteriores, gostaríamos de explicar o que é, como funciona e porque o fizemos.",
      "Tal como [url=https://www.dota2.com/newsentry/6252732681186068104]descrevemos há uns meses[/url], olhar para o histórico de atualizações do Dota tornou claro como os Passes de Batalha cresceram de tal forma que consumiam todo o conteúdo de um determinado ano, o que inibia a nossa capacidade de lançar conteúdo criativo ao longo do ano. Quisemos corrigir isto e, por isso, tomámos a decisão de lançar algo novo com maior frequência e de diversas formas. Este ano foi cheio de experiências: lançámos [url=https://www.dota2.com/newsentry/3692442542239261662]um sistema de conduta novinho em folha[/url], itens gratuitos em [url=https://www.dota2.com/newsentry/3640650512230380185]comemoração do 10.ᵒ aniversário[/url], [url=https://www.dota2.com/newsentry/5657125992547620671]várias[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]atualizações de jogabilidade[/url], uma coleção de conjuntos da comunidade e muito mais. Este Compêndio é mais um exemplo de algo novo.",
      "[h3]Funcionalidades e recompensas focadas no evento[/h3]",
      "Cada atualização do Dota tem diversos objetivos e escolher o que devemos enfatizar faz parte do processo de idealização e desenvolvimento. O foco de algumas atualizações pode ser lançar itens cosméticos ou ajustar o equilíbrio da jogabilidade, enquanto o de outras é tentar gerar o maior prémio possível para um torneio. Em vez destes objetivos, decidimos concentrar os nossos esforços em algo mais específico para esta atualização: elevar os jogadores, as equipas e a arte que é o Dota de alto nível jogado no International. Dedicámo‑nos a criar um conjunto de atividades para tornar o TI mais divertido enquanto as partidas decorrem e outro conjunto de atividades para tornar o TI mais divertido quando as partidas [i]não[/i] estão a decorrer.",
      "Resumindo, é isso o que o Compêndio deste ano é: uma coleção de desafios que criámos em torno dos jogadores profissionais e do evento em si. Trouxemos de volta e melhorámos alguns velhos favoritos, como o Dota de Sonho e os Prognósticos. Também incluímos algumas atividades novas, desde umas mais leves (Bingo) a outras realmente formidáveis (o Desafio do Caminho para o International).",
      "Tudo o que fizeres no Compêndio irá conceder progresso para desbloqueares recompensas. Tal como os desafios do Compêndio, todas as recompensas deste ano foram pensadas com os jogadores e o evento em mente. Temos um tema de HUD do International 2023, mensagens para a Chat Wheel permanentes e uma Égide de Colecionador física, assim como muito conteúdo novo para a tua Galeria do Perfil (mais detalhes abaixo), incluindo autocolantes de equipas e jogadores.",
      "[h3]Algo para todos[/h3]",
      "De acordo com as metas que estabelecemos no início deste ano, a nossa intenção tem sido garantir que cada atualização lançada inclua algo para todos os jogadores de Dota, quer no âmbito de jogabilidade ou de funcionalidades. Esta atualização não é diferente: se, como muitos outros, gostas de assistir ao espetáculo do International, mas não estás a par das peripécias de Arteezy num penhasco ou da pesquisa de Emo sobre a profunda história e os vários usos do ponto de interrogação, também temos algo para ti!",
      "Outra novidade desta atualização é a Galeria do Perfil, grátis e disponível para todos os utilizadores. Quer tenhas orgulho nas tuas estatísticas, no teu sentido de moda no jogo, ou naquela vez que ganhaste uma partida de Invoker, criámos uma tela onde podes exibir as partes da tua experiência no Dota que mais valorizas. Podíamos estar aqui o dia todo a descrever como é fixe, mas como uma imagem vale mais do que mil palavras, preparámos uma página de atualização: [url=https://www.dota2.com/international2023?1]clica aqui e vê as imagens[/url].",
      "[h3]O futuro[/h3]",
      "Já estamos a trabalhar em atualizações futuras com objetivos diferentes e sabemos que todos estão entusiasmados para saber mais sobre a próxima grande atualização, a próxima remessa de conjuntos Arcanos e tudo o mais que estamos a preparar, mas isso ficará para depois de os campeões conquistarem a Égide. Para já, Seattle dá as boas‑vindas ao regresso dos melhores jogadores do mundo e mal podemos esperar. Vemo‑nos no Caminho para o International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}