{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Fejring af The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Fejring af The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Vi er meget spændte på at udgive kompendiet til The International 2023. Kompendiet har en anden form i forhold til tidligere år, og derfor tænkte vi, at vi ville gennemgå, hvad det er, hvordan det fungerer, og hvorfor vi har lavet det.",
      "Som vi [url=https://www.dota2.com/newsentry/6252732681186068104]beskrev for et par måneder siden[/url], var det tydeligt, når vi så på Dotas historie, at Battle Passet støt og roligt havde overtaget alt indholdet for et år, hvilket forhindrede os i at udgive kreative ting i løbet af året. Det ville vi gerne rette, så vi traf et bevidst valg for flere måneder siden om at udgive nye ting oftere i flere forskellige former. I år har været fyldt med eksperimenter: Vi har udgivet [url=https://www.dota2.com/newsentry/3692442542239261662]et helt nyt spilleropførselssystem[/url], gratis genstande for at [url=https://www.dota2.com/newsentry/3640650512230380185]fejre 10-årsjubilæet[/url], [url=https://www.dota2.com/newsentry/5657125992547620671]adskillige[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]spilopdateringer[/url], en samling fællesskabssæt og meget mere. Dette kompendium er endnu et eksempel på noget nyt.",
      "[h3]Begivenhedsfokuserede funktioner, begivenhedsfokuserede belønninger[/h3]",
      "Alle Dota-opdateringer har forskellige mål, og en del af arbejdet med at designe og udvikle opdateringer er at vælge, hvad vi skal lægge vægt på. En opdatering kan være fokuseret på at levere kosmetiske genstande eller balancejusteringer. En opdatering kan handle om at prøve at generere den størst mulige præmiepulje. I stedet for disse mål har vi valgt et smallere fokus for denne opdatering: At løfte spillerne, holdene og den kunstneriske dygtighed, som findes på det allerhøjeste niveau af Dota, som spilles ved The International. Vi har fokuseret ene og alene på at udvikle et sæt aktiviteter, som gør TI sjovere, mens der spilles kampe, og et andet sæt aktiviteter, som gør TI sjovere, når der [i]ikke[/i] spilles kampe.",
      "Så det er årets kompendium: en samling udfordringer, som vi har udviklet omkring de professionelle spillere og selve begivenheden. Vi har hentet nogle gamle favoritter frem fra gemmerne og gjort dem bedre, f.eks. fantasispil og forudsigelser. Vi introducerer også nogle nye aktiviteter, lige fra det hyggelige (bingo) til det seriøst formidable (Vejen til The International-udfordringen).",
      "Alt, du opnår i kompendiet, giver dig fremskridt til belønninger. Ligesom kompendiumudfordringerne handler alle belønningerne i år om spillerne og begivenheden. Der er en grænseflade til The International 2023, permanente chathjulsreplikker og et fysisk Aegis-samlerobjekt, plus masser af nyt indhold til din profilfremvisning (se nedenfor), inklusive hold- og spillerklistermærker.",
      "[h3]Noget for alle[/h3]",
      "I overensstemmelse med de mål, vi satte tidligere i år, har vi været bevidste om at sikre, at alle vores opdateringer har noget til alle Dota-spillere, uanset om det er nye spilmekanikker eller nye funktioner. Det gælder også denne opdatering. Hvis du, som så mange andre, elsker at se spektaklet, som er The International, men ikke er bekendt med de gamle legender om Arteezy på klippen eller Emos forskning i den dybe historie og de mange forskellige anvendelser af spørgsmålstegnet, så bare rolig – denne opdatering har også noget for dig.",
      "Opdateringen indeholder også profilfremvisninger, som er gratis for alle spillere. Uanset om du er stolt over din præstation, din modestil i spillet eller dengang, du vandt et spil som Invoker, så har vi skabt et lærred, hvor du frit kan fremvise den oplevelse i Dota, du værdsætter mest. Vi kunne bruge hele dagen på at beskrive, hvor fedt det er, men da et billede siger mere end tusind ord, har vi sammensat en opdateringsside: [url=https://www.dota2.com/international2023?1]Besøg den, og sæt pris på de flotte billeder[/url].",
      "[h3]Fremadrettet[/h3]",
      "Vi arbejder allerede på fremtidige opdateringer, som fokuserer på andre ting, og vi ved, at du er spændt på den næste store opdatering, de næste Arcana-sæt og alt det andet, vi arbejder på – men det kommer til at vente til efter, at mestrene har vundet Aegis of Champions. Lige nu byder Seattle verdens bedste spillere velkomne, og vi glæder os! Vi ses på vejen til The International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}