{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Update zur Feier von The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Update zur Feier von The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Wir freuen uns, das Kompendium zu The International 2023 zu veröffentlichen. Da es sich um eine neue Form im Vergleich zu den Kompendien der vergangenen Jahre handelt, möchten wir Ihnen erläutern, worum es sich dabei handelt, wie es funktioniert und warum wir es so konzipiert haben.",
      "Wie wir bereits [url=https://www.dota2.com/newsentry/6252732681186068104]vor einigen Monaten[/url] dargelegt haben, zeigte ein Blick auf die Geschichte von Dota, dass die vergangenen Schlachtenpässe immer mehr Inhalte eines Jahres verschlungen haben und uns dieser Umstand daran hinderte, über das ganze Jahr verteilt kreative Inhalte zu veröffentlichen. Wir wollten dies ändern und haben uns deshalb vor einigen Monaten bewusst dafür entschieden, Neuerungen häufiger und in verschiedenen Formen zu veröffentlichen. Dieses Jahr war ein Jahr voller Experimente: Wir haben ein brandneues [url=https://www.dota2.com/newsentry/3692442542239261662]System zur Bewertung des Spielerverhaltens[/url], kostenlose Gegenstände zur [url=https://www.dota2.com/newsentry/3640650512230380185]Feier des 10. Jubiläums[/url], das [url=https://www.dota2.com/newsentry/5657125992547620671]Gameplay-Update „Neue Horizonte“[/url] und [url=https://www.dota2.com/newsentry/3674426239866314901]andere spezielle Updates[/url] sowie Schätze mit von der Community erstellten Heldensets und noch viel mehr veröffentlicht. Dieses Kompendium ist ebenfalls ein Beispiel für eine Neuerung.",
      "[h3]Funktionen und Belohnungen rund um das Event[/h3]",
      "Jedes Dota-Update verfolgt verschiedene Ziele, weshalb ein Teil der Arbeit beim Konzipieren und Erstellen eines Updates darin besteht, zu entscheiden, worauf der Schwerpunkt liegen soll. Ein Update kann sich das Ziel setzen, kosmetische Inhalte bereitzustellen oder die Spielbalance zu verbessern. Ein Update kann sich auch das Ziel setzen, ein möglichst hohes Preisgeld zu erzielen. Stattdessen haben wir uns dazu entschieden, dieses Update enger zu fassen: Wir wollen die Spieler, die Teams und die Meisterklasse des bei The International dargebotenen Dota-Erlebnisses in den Mittelpunkt stellen. Wir haben uns ganz darauf konzentriert, eine Reihe von Aktivitäten zu kreieren, damit TI mehr Spaß macht, während Partien stattfinden, und eine weitere Reihe von Aktivitäten, mit denen TI mehr Spaß macht, wenn [i]keine[/i] Partien stattfinden.",
      "Und genau das macht das diesjährige Kompendium aus: eine Reihe von Herausforderungen, die sich rund um die Profispieler und das Event drehen. Wir haben auch einige alte Favoriten wie die Fantasy-Liga und Prognosen zurückgebracht und verbessert. Darüber hinaus gibt es einige neue Aktivitäten, die von heiter (Bingo) bis ernsthaft (Herausforderung zum Weg zu TI) reichen.",
      "Alle Kompendiumaktivitäten bringt Ihnen Fortschritte für Belohnungen ein. Wie bei den Kompendiumherausforderungen drehen sich in diesem Jahr auch alle Belohnungen um die Spieler und das Event. Es gibt ein HUD zu The International 2023, permanent verfügbare Chatradsprüche und eine physische Sammlerägis sowie viele neue Inhalte für den Profilaussteller (siehe unten), einschließlich Team- und Spieleraufkleber.",
      "[h3]Etwas für jeden Geschmack[/h3]",
      "Im Einklang mit den Zielen, die wir uns Anfang des Jahres gesetzt haben, haben wir bewusst darauf geachtet, dass jedes Update, das wir veröffentlichen, etwas für alle Dota-Spieler bietet, egal, ob es sich um Änderungen am Gameplay oder neue Funktionen handelt. Dieses Update bildet da keine Ausnahme: Wenn Sie, wie viele andere, ein großer Fan des TI-Spektakels sind, aber nichts mit den alten Legenden von Arteezy auf einer Klippe oder Emos Nachforschungen über die tiefgründigen Überlieferungen und vielfältigen Verwendungen des Fragezeichens anfangen können, ist das auch in Ordnung – dieses Update hält auch für Sie etwas bereit.",
      "Damit gemeint ist unter anderem der Profilaussteller, der ab sofort für alle Spieler verfügbar ist. Egal, ob Sie stolz auf Ihre Erfolge sind, Ihren Sinn für Mode im Spiel zur Schau stellen wollen oder dieses eine Mal eine Partie als Invoker gewonnen haben – wir haben eine Leinwand geschaffen, auf der Sie Ihre meist geschätzten Dota-Erfahrungen ausstellen können. Wir könnten den ganzen Tag lang darüber reden, wie cool das alles ist, aber ein Bild sagt mehr als tausend Worte; deshalb haben wir eine ganze Website für das Update zusammengestellt: [url=https://www.dota2.com/international2023]Sehen Sie sich also die Bilder an![/url]",
      "[h3]Blick in die Zukunft[/h3]",
      "Wir arbeiten bereits an zukünftigen Updates mit unterschiedlichen Schwerpunkten und wir wissen, dass Sie schon gespannt sind, mehr über den nächsten großen Patch, die nächsten Arkanas oder alles andere, woran wir arbeiten, zu erfahren – mehr dazu, nachdem die Champions die Ägis für sich beansprucht haben. Bis dahin heißt Seattle erneut die besten Spieler der Welt willkommen. Wir können es kaum erwarten, bis es losgeht. Wir sehen Sie auf dem Weg zu The International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}