{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Commemorazione del The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Commemorazione del The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Siamo lieti di rilasciare il Compendio del The International 2023. Poiché questo Compendio ha un formato diverso rispetto a quello degli anni passati, ci teniamo a spiegarti cos'è, come funziona e perché lo abbiamo realizzato così.",
      "Come [url=https://www.dota2.com/newsentry/6252732681186068104]descritto qualche mese fa[/url], esaminare la storia di Dota ci ha fatto capire che i Pass Battaglia stavano crescendo talmente tanto da inglobare tutti i contenuti di un determinato anno, impedendoci di rilasciare aggiornamenti più creativi. Per ovviare a questo problema, diversi mesi fa abbiamo preso la decisione di rilasciare novità più di frequente e in una più ampia varietà di forme. Quest'anno è stato pieno di esperimenti: abbiamo rilasciato [url=https://www.dota2.com/newsentry/3692442542239261662]un nuovissimo sistema di condotta dei giocatori[/url], oggetti gratuiti per [url=https://www.dota2.com/newsentry/3640650512230380185]celebrare il decimo anniversario[/url], [url=https://www.dota2.com/newsentry/5657125992547620671]diversi[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]aggiornamenti al gameplay[/url], una serie di set della Comunità e altro ancora. Anche questo Compendio è un esempio di novità di questo tipo.",
      "[h3]Funzionalità e ricompense incentrate sull'evento[/h3]",
      "Ogni aggiornamento di Dota ha una serie di obiettivi e parte del lavoro di progettazione e creazione di un aggiornamento consiste nella scelta di dove porre l'accento. Un aggiornamento può essere incentrato sul rilascio di contenuti cosmetici o sul perfezionamento dell'equilibrio di gioco. Un aggiornamento può cercare di generare il montepremi più grande possibile. Invece di questi obiettivi, con questo aggiornamento abbiamo deciso di concentrare i nostri sforzi per elevare i giocatori, le squadre e il talento artistico rappresentato dal Dota di alto livello giocato al The International. Ci siamo concentrati interamente sulla creazione di una serie di attività per rendere il TI più divertente durante le partite e un'altra serie di attività per rendere il TI più divertente tra una partita e l'altra.",
      "Il Compendio di quest'anno è proprio questo: una raccolta di sfide basate sui giocatori professionisti e sull'evento stesso. Abbiamo riproposto e migliorato alcuni classici popolari, come il FantaDota e i pronostici. Abbiamo anche sviluppato alcune nuove attività, da quelle più spensierate (il Bingo) a quelle davvero formidabili (la Sfida del Cammino per il The International).",
      "Tutti i tuoi traguardi all'interno del Compendio ti permetteranno di fare progressi per sbloccare le ricompense. Proprio come le sfide del Compendio, anche tutte le ricompense di quest'anno si basano sui giocatori e sull'evento. Abbiamo un'interfaccia del The International 2023, frasi permanenti per la chat radiale e un'Egida fisica da collezionista, oltre a moltissimi nuovi contenuti per la galleria del profilo (vedi più in basso), tra cui adesivi delle squadre e dei giocatori.",
      "[h3]Qualcosa per tutti[/h3]",
      "Per rimanere in linea con gli obiettivi che ci siamo prefissati a inizio anno, ci teniamo ad assicurarci che ogni aggiornamento abbia qualcosa da offrire per tutti i giocatori di Dota, che si tratti di nuove funzionalità o di nuovi aspetti legati al gameplay. Questo aggiornamento non fa eccezione. Se, come tanti altri, anche a te piace assistere allo spettacolo del The International, ma non conosci le vecchie leggende come Arteezy su un dirupo o la ricerca approfondita di Emo sulla storia di Dota e sui molteplici usi del punto di domanda, non hai di che preoccuparti: abbiamo qualcosa anche per te!",
      "Questo aggiornamento include anche la galleria del profilo, gratuita e disponibile per tutti i giocatori. Se vai fiero delle tue statistiche, del tuo gusto nel vestire in gioco o di quella volta che hai vinto una partita con Invoker, abbiamo creato una tela dove poter mostrare le parti che apprezzi maggiormente della tua esperienza su Dota. Potremmo stare qui tutto il giorno a descrivere il potenziale di questa funzionalità, ma poiché un'immagine vale più di mille parole, abbiamo dedicato un'intera pagina all'aggiornamento: [url=https://www.dota2.com/international2023?1]dai un'occhiata alle immagini[/url].",
      "[h3]Il futuro[/h3]",
      "Stiamo già lavorando agli aggiornamenti futuri con obiettivi diversi e sappiamo che non vedi l'ora di saperne di più sulla prossima grande patch, sui prossimi set Arcani e su tutto ciò che bolle in pentola, ma per ora è meglio aspettare che i campioni conquistino l'Egida. Prima di allora, Seattle accoglierà un'altra volta i migliori giocatori al mondo. Ci vediamo sul Cammino per il The International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}