{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "A The International 2023 ünnepi frissítés",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "A The International 2023 ünnepi frissítés",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Izgatottan adjuk ki a The International 2023 Összefoglalóját. Mivel ez egy új forma a tavalyi évi Összefoglalóhoz képest, szerettük volna bemutatni, hogy mi ez, hogyan működik, és miért készítettük.",
      "Ahogy [url=https://www.dota2.com/newsentry/6252732681186068104]néhány hónappal korábban írtuk[/url], a Dota történelmét vizsgálva világossá vált, hogy a Csatabelépők szép lassan akkorára nőttek, hogy bekebelezték az adott év összes tartalmát, és meggátoltak minket abban, hogy az egész év során tudjunk kreatív dolgokat kiadni. Ezen javítani szerettünk volna, ezért azt a tudatos döntést hoztuk több hónappal ezelőtt, hogy gyakrabban és különféle formában adunk ki új dolgokat. Ez az év tele volt kísérletezéssel; kiadtunk [url=https://www.dota2.com/newsentry/3692442542239261662]egy vadiúj játékosviselkedés rendszert[/url], ingyenes tárgyakat [url=https://www.dota2.com/newsentry/3640650512230380185]a 10. évforduló ünneplésére[/url], valamint [url=https://www.dota2.com/newsentry/5657125992547620671]számos[/url] játékmeneti [url=https://www.dota2.com/newsentry/3674426239866314901]frissítést[/url], egy gyűjteménnyi közösségi szettet és sok mást. Ez az Összefoglaló az újdonságok egy újabb példája.",
      "[h3]Eseményközpontú funkciók, eseményközpontú jutalmak[/h3]",
      "Minden Dota frissítésnek különféle céljai vannak, és a frissítések tervezési és felépítési munkálatainak egy részét a hangsúly kiválasztása jelenti. A frissítések koncentrálhatnak díszítő tárgyakra vagy az egyensúly finomítására. Valamely frissítés megpróbálhatja a lehető legnagyobb nyereményalapot generálni. E célok helyett úgy döntöttünk, hogy e frissítéssel egy szűkebb részre koncentrálunk, és bemutatjuk a játékosokat, csapatokat és azt a csaknem művészi színvonalat, amit a The Internationalen játszott magas szintű Dota képvisel. Egy sor olyan tevékenység megalkotására összpontosítottunk, amelyek még szórakoztatóbbá teszik a TI-t, miközben zajlanak a meccsek, és egy sor másik tevékenységre, amelyek még szórakoztatóbbá teszik a TI-t, miközben [i]nem zajlanak[/i] meccsek.",
      "Tehát erről szól az idei Összefoglaló: kihívások gyűjteménye, amit a hivatásos játékosok és maga az esemény köré építettünk. Visszahoztunk és fel is javítottunk néhány olyan régi kedvencet, mint a Fantasy és a Tippek. Új tevékenységeket is bemutatunk, könnyedebbektől kezdve (Bingó) a komolyan félelmetesekig (A The Internationalig vezető út kihívás).",
      "Minden, amit elérsz az Összefoglalóban, előrehaladást ér a jutalmak felé. Ahogy az Összefoglaló kihívásai, úgy az idei jutalmak is a játékosok és az esemény köré szerveződnek. Van The International 2023 HUD, maradandó csevegőkorong-szövegek, és egy fizikai gyűjthető Égisz, rengeteg új tartalom mellett a Profilvitrinedbe (lásd alább), köztük csapat- és játékosmatricákkal.",
      "[h3]Mindenki talál valamit[/h3]",
      "Összhangban az idén korábban felállított célokkal, kifejezetten figyeltünk rá, hogy az összes kiadott frissítés tartogasson valamit minden Dota játékosnak, legyen az új játékmenet vagy új funkció. Ebben a frissítésben sincs ez másként: Az is rendben van, ha sokakhoz hasonlóan nagy rajongója vagy a The International nézésének, de nem vagy tisztában az olyan régi legendákkal, mint Arteezy sziklás esetei, vagy a kérdőjel különféle használati módjai, miután Emo mélyen beleásta magát a Dota történetébe. Számodra is tartogat dolgokat ez a frissítés.",
      "Ez a frissítés tartalmazza a Profilvitrint is, ami ingyenes és mostantól minden játékos számára elérhető. Akár a rekordjaidra vagy büszke, akár játékon belüli stílusérzékedre, vagy arra az egyetlen alkalomra, amikor nyertél Invokerrel, létrehoztunk egy vásznat, ahol bemutathatod Dota élményed azon részeit, melyeket a legtöbbre tartasz. Akár egész nap mesélhetnénk arról, hogy milyen menőn néz ki, de egy kép többet mond ezer szónál, ezért összedobtunk egy egész frissítési oldalt. [url=https://www.dota2.com/international2023?1]Menj és nézd meg a képeket.[/url]",
      "[h3]És tovább[/h3]",
      "Már dolgozunk a különböző dolgokra összpontosító jövőbeni frissítéseken, és tudjuk, hogy izgatottan várjátok az új infókat a következő nagy frissítésről, a következő adag Titokzatosról és minden másról, amin dolgozunk... de ezeket az utánra tartogatjuk, hogy a bajnokok megszerezték az Égiszt. Egyelőre Seattle köszönti a világ visszatérő legjobb játékosait, és mi alig várjuk. Találkozunk a The Internationalig vezető úton."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}