{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Ενημέρωση: Εορτασμός του The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Ενημέρωση: Εορτασμός του The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Ανακοινώνουμε με χαρά την κυκλοφορία του International Compendium για το The International 2023. Επειδή έχει νέα μορφή σε σχέση με τα Compendium των προηγούμενων ετών, θέλαμε να σας εξηγήσουμε τι είναι, πώς λειτουργεί και γιατί το φτιάξαμε.",
      "Όπως [url=https://www.dota2.com/newsentry/6252732681186068104]περιγράψαμε πριν μερικούς μήνες[/url], παρατηρώντας την ιστορία του Dota, έγινε ξεκάθαρο ότι τα Πάσο Μάχης είχαν μεγαλώσει τόσο ώστε να καταλαμβάνουν όλο το περιεχόμενο της χρονιάς, κάτι που μας στερούσε τη δυνατότητα κυκλοφορίας δημιουργικών πραγμάτων κατά τη διάρκεια του έτους. Θέλαμε να αλλάξει αυτό, οπότε, πριν αρκετούς μήνες, κάναμε τη σκόπιμη επιλογή να κυκλοφορούμε νέα πράγματα πιο συχνά και σε διάφορες μορφές. Η φετινή χρονιά ήταν γεμάτη πειράματα: Κυκλοφορήσαμε ένα [url=https://www.dota2.com/newsentry/3692442542239261662]ολοκαίνουριο σύστημα συμπεριφοράς παικτών[/url], δωρεάν αντικείμενα για να [url=https://www.dota2.com/newsentry/3640650512230380185]γιορτάσουμε τη 10η Επέτειο[/url], [url=https://www.dota2.com/newsentry/5657125992547620671]πολλές[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]ενημερώσεις παιχνιδιού[/url], μια συλλογή από σετ Κοινότητας και άλλα. Αυτό το Compendium είναι επίσης κάτι νέο.",
      "[h3]Χαρακτηριστικά και ανταμοιβές επικεντρωμένα στη διοργάνωση[/h3]",
      "Με κάθε ενημέρωση Dota, στοχεύουμε σε πολλά πράγματα και μέρος του σχεδιασμού και της δημιουργίας της είναι να επιλέξουμε πού θα δώσουμε έμφαση. Μια ενημέρωση μπορεί να εστιάζει σε κοσμητικό περιεχόμενο ή στην εξισορρόπηση του τρόπου παιχνιδιού. Μια άλλη ενημέρωση μπορεί να στοχεύει στη συγκέντρωση του μεγαλύτερου δυνατού χρηματικού επάθλου. Με τη συγκεκριμένη ενημέρωση, αποφασίσαμε να εστιάσουμε στην ανάδειξη των παικτών, των ομάδων και της τέχνης του Dota υψηλού επιπέδου στο The International. Επικεντρωθήκαμε εξ ολοκλήρου στη δημιουργία ορισμένων δραστηριοτήτων, με σκοπό να γίνει πιο διασκεδαστικό το ΤΙ όσο διεξάγονται αγώνες, καθώς επίσης και όσο [i]δεν[/i] διεξάγονται αγώνες.",
      "Να λοιπόν περί τίνος πρόκειται το φετινό Compendium: είναι ένα σύνολο από προκλήσεις δημιουργημένες γύρω από τους επαγγελματίες παίκτες και τη διοργάνωση αυτή καθαυτή. Επαναφέραμε και βελτιώσαμε μερικά παλιά αγαπημένα χαρακτηριστικά, όπως το Εικονικό Πρωτάθλημα και τις Προβλέψεις. Επίσης, παρουσιάζουμε διάφορες νέες δραστηριότητες: από το εντελώς ξέγνοιαστο Μπίνγκο έως την πραγματικά αξιοθαύμαστη Πρόκληση «Δρόμος προς το The International».",
      "Ό,τι κατορθώσετε μέσω του Compendium, θα αυξήσει την πρόοδό σας για απόκτηση ανταμοιβών. Όπως και οι προκλήσεις του Compendium, όλες οι φετινές ανταμοιβές έχουν δημιουργηθεί γύρω από τους παίκτες και τη διοργάνωση. Υπάρχει διεπαφή για το The International 2023, μόνιμες ατάκες ροδέλας συνομιλίας και μια πραγματική ρέπλικα του Aegis, καθώς επίσης και πολύ νέο περιεχόμενο για την Παρουσίαση Προφίλ σας (δείτε παρακάτω), που περιλαμβάνει αυτοκόλλητα ομάδων και παικτών.",
      "[h3]Κάτι για όλους[/h3]",
      "Σύμφωνα με τους στόχους που θέσαμε νωρίτερα φέτος, θέλουμε να διασφαλίσουμε ότι κάθε ενημέρωση διαθέτει κάτι για όλους τους παίκτες του Dota, είτε πρόκειται για νέο τρόπο παιχνιδιού είτε για νέα χαρακτηριστικά. Αυτή η ενημέρωση δεν διαφέρει. Αν σας αρέσει να παρακολουθείτε το θέαμα του The International, όπως και σε πολλούς άλλους, αλλά δεν είστε εξοικειωμένοι με τους παλιούς θρύλους του Arteezy που κόλλησε πάνω σε έναν γκρεμό, την έρευνα του Emo στη βαθιά ιστορία του παιχνιδιού ή τις πολλές και διάφορες χρήσεις του ερωτηματικού, δεν πειράζει καθόλου. Έχουμε πράγματα και για εσάς σε αυτήν την ενημέρωση.",
      "Αυτή η ενημέρωση περιλαμβάνει επίσης την Παρουσίαση Προφίλ, που είναι δωρεάν και διαθέσιμη τώρα σε όλους τους παίκτες. Είτε είστε περήφανοι για κάποιο ρεκόρ σας, για την αισθητική σας εντός παιχνιδιού ή για εκείνο το παιχνίδι που κερδίσατε με τον Invoker, δημιουργήσαμε έναν καμβά όπου μπορείτε να προβάλετε τις εμπειρίες Dota που έχουν τη μεγαλύτερη αξία για εσάς. Θα μπορούσαμε να μιλάμε όλη μέρα για το πόσο τέλεια είναι, αλλά εφόσον μια εικόνα αξίζει χίλιες λέξεις, φτιάξαμε μια σελίδα ενημέρωσης: [url=https://www.dota2.com/international2023?1]Ρίξτε μια ματιά στις εικόνες[/url].",
      "[h3]Το μέλλον[/h3]",
      "Έχουμε ήδη ξεκινήσει να δουλεύουμε στις μελλοντικές ενημερώσεις, που θα έχουν διαφορετικούς στόχους. Γνωρίζουμε ότι ανυπομονείτε να μάθετε περισσότερα για την επόμενη ενημέρωση, το επόμενο σετ arcana και όλα τα άλλα στα οποία εργαζόμαστε, αλλά αυτό θα γίνει μετά την κατάκτηση του Aegis από τους πρωταθλητές. Προς το παρόν, το Σιάτλ υποδέχεται την αφρόκρεμα των παικτών από όλον τον κόσμο και εμείς ανυπομονούμε. Θα σας δούμε στον Δρόμο προς το The International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}