{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualización de la Celebración The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Actualización de la Celebración The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Estamos emocionados por lanzar el Compendio The International 2023. Debido a que tiene un formato distinto al de los años anteriores, queremos darte un recorrido para explicarte de qué se trata, cómo funciona y por qué lo construimos.",
      "Como lo [url=https://www.dota2.com/newsentry/6252732681186068104]describimos hace algunos meses[/url], al analizar la historia de Dota, nos dimos cuenta de que los Pases de Batalla ya habían crecido progresivamente hasta superar las expectativas de contenido del año, y nos estaban impidiendo lanzar otras creaciones. Queríamos arreglar esto, así que tomamos una decisión deliberada varios meses atrás para lanzar cosas nuevas más seguido en una amplia variedad de formas. Este año ha estado lleno de experimentos: lanzamos un [url=https://www.dota2.com/newsentry/3692442542239261662]nuevo sistema de comportamiento de los jugadores[/url], objetos gratis para [url=https://www.dota2.com/newsentry/3640650512230380185]celebrar el aniversario 10[/url], una [url=https://www.dota2.com/newsentry/5657125992547620671]serie de[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]parches de jugabilidad[/url], una colección de sets creados por la comunidad y más. Este Compendio es otro ejemplo de algo nuevo.",
      "[h3]Características enfocadas en eventos, recompensas enfocadas en eventos[/h3]",
      "Cada actualización de Dota tiene una variedad de metas y parte del trabajo del diseño y creación de una actualización es seleccionar dónde hacer énfasis. Una actualización puede enfocarse en entregar contenido cosmético o refinar el equilibrio. Una actualización puede tratar de generar el mayor premio total posible. En vez de estas metas, decidimos enfocar esta actualización de manera más estrecha: celebrar a los jugadores, los equipos y el arte que hacen que las partidas de Dota que se juegan en The International sean de alto nivel. Nos enfocamos completamente en crear un conjunto de actividades para hacer que TI sea más divertido mientras se llevaban a cabo las partidas, y otro conjunto de actividades para hacer que TI fuera más divertido cuando las partidas no se [i]estaban[/i] llevando a cabo.",
      "Y de esto se trata el Compendio de este año: una colección de desafíos que hemos construido en torno a los jugadores profesionales y al evento en sí. Trajimos de regreso y mejoramos algunos de nuestros elementos favoritos, como la Liga Fantasía y las Predicciones. También presentamos algunas actividades nuevas, que van desde el despreocupado Bingo, hasta algo formidablemente serio como El camino a The International.",
      "Todo lo que logres a través del Compendio te ayudará a avanzar para obtener recompensas. Al igual que los desafíos del Compendio, todas las recompensas de este año se construyeron en torno a los jugadores y al evento. Tenemos un HUD para The International 2023, ruedas de chat con frases permanentes y una copia física de la Égida de colección, junto con mucho contenido nuevo para tu Galería de Perfil (ver a continuación), que incluye calcomanías de equipos y jugadores.",
      "[h3]Algo para todos[/h3]",
      "En línea con los objetivos que establecimos a principios de este año, tuvimos la intención de garantizar que cada actualización que lanzamos tuviera algo para todos los jugadores de Dota, ya sea una nueva jugabilidad o nuevas características. Esta actualización no es diferente: si como muchos eres un gran fanático de ver el espectáculo de The International, pero no estás familiarizado con las viejas leyendas de Arteezy en un acantilado, o Emo investigando la historia profunda del juego y los usos varios del signo de interrogación, está bien... también tenemos cosas para ti en esta actualización.",
      "Esta actualización también incluye la Galería del Perfil, que es gratis y estará disponible ahora para todos los jugadores. Ya sea que estés orgulloso de tu registro, de tu sentido de la moda en el juego o de que una vez ganaste un juego con Invoker, creamos un lienzo donde puedes presumir las partes de tu experiencia Dota que más valoras. Podríamos pasarnos todo el día contándote lo genial que es esto, pero como una imagen vale más que mil palabras, [url=https://www.dota2.com/international2023?1]visita la página de actualización[/url] que hemos creado para que las veas.",
      "[h3]Hacia el futuro[/h3]",
      "Ya estamos trabajando en futuras actualizaciones con diferentes enfoques y sabemos que estás emocionado de saber más sobre el próximo gran parche, y el próximo conjunto de arcanos, y todo lo demás en lo que estamos trabajando, pero será después de que los campeones reclamen la Égida. Por ahora, Seattle le da la bienvenida a los mejores jugadores del mundo, y estamos ansiosos. Nos vemos en El camino a The International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}