{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Firandet av The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Firandet av The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Vi ser fram emot att lansera kompendiet till The International 2023. Kompendiet skiljer sig från kompendier från tidigare år, och därför hade vi tänkt gå igenom vad det är, hur det fungerar och varför vi skapade det.",
      "Som vi [url=https://www.dota2.com/newsentry/6252732681186068104]förklarade för några månader sedan[/url] blev det tydligt när vi såg tillbaka på Dotas historia att stridspasset hade vuxit till att omfatta allt innehåll under ett år. Det hindrade oss från att kunna leverera kreativa saker under årets lopp. Vi ville lösa detta och tog därför ett medvetet beslut för flera månader sedan om att leverera nya saker oftare och i många fler olika former. Det här året har varit fullt av experiment. Vi lanserade [url=https://www.dota2.com/newsentry/3692442542239261662]ett helt nytt uppförandesystem[/url], gratis föremål för att [url=https://www.dota2.com/newsentry/3640650512230380185]fira 10-årsjubileet[/url], ett [url=https://www.dota2.com/newsentry/5657125992547620671]antal[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]speluppdateringar[/url], en samling gemenskapsset och mer. Kompendiet är ett annat exempel på något som är nytt.",
      "[h3]Funktioner och belöningar med fokus på eventet[/h3]",
      "Alla Dota-uppdateringar har en mängd olika mål, och en del av arbetet med att utforma och bygga en uppdatering handlar om att avgöra vad man ska lägga vikt på. En uppdatering kan ha fokus på att leverera kosmetiskt innehåll eller finjustera balansen. En uppdatering kan handla om att försöka skapa en så stor prispott som möjligt. Istället för de målen har vi valt att ge den här uppdateringen ett smalare fokus: att lyfta fram spelarna, lagen och det konstnärliga, som finns på den högsta nivån av Dota som spelas på The International. Vi har fokuserat helt och hållet på att skapa ett gäng aktiviteter för att göra TI roligare när matcher pågår samt andra aktiviteter för att göra TI roligare när det [i]inte[/i] pågår några matcher.",
      "Det är årets kompendium: en samling utmaningar som vi har byggt runt proffsspelarna och själva eventet. Vi har återinfört och förbättrat några gamla favoriter, som fantasiligor och förutsägelser. Vi presenterar också några nya aktiviteter, från lättsamma (bingo) till det mer seriösa (Vägen till The International-utmaningen).",
      "Det du uppnår genom kompendiet för dig närmare belöningar. Precis som utmaningarna i kompendiet är alla belöningar i år byggda kring spelarna och eventet. Det finns en HUD för The International 2023, permanenta chatthjulsrepliker och ett fysiskt Aegis-samlarobjekt, samt massor av nytt innehåll till din profilmonter (se nedan), bland annat lag- och spelarklistermärken.",
      "[h3]Något för alla[/h3]",
      "I överensstämmelse med målen vi satte tidigare under året har vi avsiktligt sett till att alla uppdateringar vi levererar har något för alla Dota-spelare, vare sig det är nytt spelupplägg eller nya funktioner. Det gäller också den här uppdateringen. Om du, liksom många andra, är ett stort fan av att titta på The International-spektaklet men inte känner till de gamla klassikerna, som Arteezy på klippan, Emos djupdyk långt ned i historien och de många olika användningsområdena för frågetecknet, är det också okej. Det finns något för dig i uppdateringen också.",
      "Uppdateringen innehåller även profilmontrar som är gratis och tillgängliga för alla spelare. Oavsett om du är stolt över din spelhistorik, ditt mode i spelet eller den där gången då du vann en match som Invoker, har vi skapat en tavla där du kan visa upp delarna av Dota-upplevelsen som du värdesätter mest. Vi skulle kunna spendera hela dagen med att beskriva hur coolt det är, men eftersom en bild säger mer än tusen ord har vi satt ihop en hel uppdateringssida: [url=https://www.dota2.com/international2023?1]Ta dig en titt på bilderna här[/url].",
      "[h3]En blick framåt[/h3]",
      "Vi jobbar redan med framtida uppdateringar som har olika fokus, och vi vet att du ser fram emot att lära dig mer om nästa stora uppdatering, nästa set med Arcanas och allt annat vi jobbar med, men det får bli efter att vinnarna tar hem Aegis of Champions. Tills dess önskar Seattle de bästa spelarna i världen välkomna tillbaka. Vi kan knappt vänta. Vi ses på Vägen till The International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}