{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Обновление за честването на The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Обновление за честването на The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Развълнувани сме да пуснем The International Compendium за The International 2023. Защото това е нова негова форма спрямо всеки Compendium от предходните години, искахме да Ви запознаем с това какво представлява, как работи и защо го създадохме.",
      "Както [url=https://www.dota2.com/newsentry/6252732681186068104]описахме преди няколко месеца[/url], разглеждайки историята на Dota 2 ни стана ясно, че бойните пропуски неотклонно нарастваха, за да консумират всичкото съдържание през дадена година и възпрепятстваха способността ни да доставяме креативни нещица през цялата година. Искахме да поправим това. Ето защо преди няколко месеца направихме умишлен избор да доставяме нови неща по-често и в по-широкообхватно разнообразие от форми. Тази година е изпълнена с експерименти. Доставихме [url=https://www.dota2.com/newsentry/3692442542239261662]чисто нова поведенческа система[/url]; безплатни артикули за [url=https://www.dota2.com/newsentry/3640650512230380185]честване на десетата годишнина[/url]; [url=https://www.dota2.com/newsentry/5657125992547620671]редица [/url] [url=https://www.dota2.com/newsentry/3674426239866314901]обновления на игралното преживяване[/url]; колекция от обществени набори… И още други. Този Compendium е поредният пример за нещо ново.",
      "[h3]Характеристики и награди, съсредоточени към събитията[/h3]",
      "Всяко Dota 2 обновление разполага с разнообразни цели, а част от работата по проектирането и изграждането му е избирането на това какъв да бъде акцентът. Дадено обновление може да е съсредоточено над предоставянето на козметично съдържание или изпипване на баланса. Или пък да опитва да генерира възможно най-големия награден фонд. Вместо тези цели, избрахме да съсредоточим това обновление над нещо по-конкретно. Да извисим играчите, отборите и артистичността, която представлява висококласната игра на Dota 2, представяна на The International. Съсредоточихме се изцяло над създаването на набор от дейности, за да направим TI по-забавно събитие, докато игрите протичат. Както и друг набор от дейности, за да направим TI по-забавно събитие, когато игрите [i]не[/i] протичат.",
      "И тъй, това е тазгодишният Compendium. Колекция от предизвикателства, които сме изградили около професионалните играчи и самото събитие. Върнахме и подобрихме някои стари любими дейности като въображаемата лига и прогнозите. Също така въвеждаме някои нови дейности, вариращи от безгрижните („Бинго“) до сериозно застрашителните („Предизвикателството за пътя към The International“).",
      "Всичко, което ще постигнете посредством Compendium, Ви носи напредък към награди. Подобно на предизвикателствата от Compendium, всички тазгодишни награди са учредени около играчите и събитието. Има проекционен дисплей за International 2023, перманентни чат рулетки и физическа колекционерска версия на Aegis. Редом с всичко това има много ново съдържание за Вашето профилно изложение (вижте по-долу), а това включва стикери за отбори и играчи.",
      "[h3]По нещичко за всекиго[/h3]",
      "Съобразно целите, които установихме по-рано тази година, умишлено полагахме усилия относно това да подсигурим, че всяко обновление, което пускахме, разполага с нещо за всички Dota 2 играчи. Независимо от това дали е новост за игралното преживяване или свежи характеристики. Това обновление по нищо не се различава. Ако, като мнозина, сте огромни почитатели на това да гледате спектакъла от The International, но не сте запознати със старите легенди за Arteezy върху скала или задълбоченото проучване на Emo в игралната история и многото разнообразни употреби на въпросителния знак, нямайте грижи. В това обновление имаме неща и за Вас.",
      "Това обновление също включва профилното изложение, безплатно и вече достъпно за всички играчи. Независимо дали се гордеете с постиженията си… Своя моден вкус в играта… Или пък че веднъж сте спечелили игра с Invoker, създадохме пано, където можете да демонстрирате онези части от Dota 2 в преживяването Ви, които цените най-много. Бихме могли да описваме колко е готино цял ден, но тъй като една снимка е равносилна на хиляди думи, подготвихме цяла страница за обновлението, [url=https://www.dota2.com/international2023]така че им хвърлете едно око[/url].",
      "[h3]Занапред[/h3]",
      "Вече работим върху бъдещи обновления съсредоточени върху различни неща и знаем, че сте развълнувани да научите още за следващата голяма поправка, следващия набор от Arcana артикули и всичко останало, върху което се трудим… Но това ще стане, след като шампионите заявят Aegis. Засега Сиатъл приветства завръщането на най-добрите играчи по света, а ние тръпнем от нетърпение. Ще се видим по пътя към The International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}