{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2023: feestupdate!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "The International 2023: feestupdate!",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Met trots presenteren we het nieuwe compendium voor The International van 2023. Omdat het er dit jaar iets anders uitziet dan vorige jaren, leggen we jullie graag uit wat het compendium precies is, hoe het werkt en waarom we het hebben samengesteld.",
      "Zoals we [url=https://www.dota2.com/newsentry/6252732681186068104]met onze terugblik op de geschiedenis van Dota[/url] hebben vastgesteld, werd nieuwe content steeds meer aan de gevechtspas gekoppeld. Het gevolg was dat het steeds moeilijker werd om ook door het jaar heen met nieuwe creatieve releases te komen. We wilden hier verandering in brengen en hebben daarom een aantal maanden geleden besloten om vaker en meer verschillende soorten inhoud uit te brengen. Dit jaar zat vol experimenten: [url=https://www.dota2.com/newsentry/3692442542239261662]een splinternieuw systeem voor de beoordeling van spelergedrag[/url], gratis items om [url=https://www.dota2.com/newsentry/3640650512230380185]onze 10e verjaardag te vieren[/url], een [url=https://www.dota2.com/newsentry/5657125992547620671]aantal[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]gameplaypatches[/url], een verzameling communitysets en nog veel meer. En dit compendium is ook een van die nieuwe dingen.",
      "[h3]Speciale functies en beloningen voor evenementen[/h3]",
      "Bij elke Dota-update hebben we een aantal verschillende doelstellingen. Bij het ontwerpen en bouwen van een update moeten we dus ook bepalen waar we de nadruk op willen leggen. Een update kan gericht zijn op cosmetische items of het uitbalanceren van het spel. Bij een andere update kan het genereren van de grootst mogelijke prijzenpot centraal staan. In plaats daarvan hebben we bij deze update voor een preciezere focus gekozen: de spelers, de teams en de kunst van Dota op het hoge niveau van The International. In het kader hiervan hebben we allerlei activiteiten bedacht die TI leuker maken als er spellen aan de gang zijn, en daarnaast nog andere activiteiten die TI leuker maken als er [i]geen[/i] spellen worden gespeeld.",
      "En dat is dus precies wat het compendium van dit jaar is: een verzameling uitdagingen rond de professionele spelers en het evenement zelf. Oude favorieten als fantasy en voorspellingen zijn in een nieuw jasje gegoten. We introduceren ook nieuwe activiteiten, van leuke spelletjes (bingo!) tot serieuze aangelegenheden (The Road to the International Challenge).",
      "Alle compendiumactiviteiten die je met succes afrondt, helpen je verder op weg naar beloningen. Net als de uitdagingen van dit jaar, staan alle beloningen ook in het teken van de spelers en het evenement. Zo hebben we een HUD voor The International 2023, permanente chatwielberichten, een fysieke replica van de Aegis voor verzamelaars en heel veel nieuwe inhoud voor je profielshowcase (zie hieronder), inclusief team- en spelerstickers.",
      "[h3]Voor elk wat wils[/h3]",
      "Als verlengde van de doelen die we eerder dit jaar hebben vastgesteld, zorgen we er nu ook voor dat iedere update iets biedt waar alle Dota-spelers van kunnen profiteren, bijvoorbeeld nieuwe gameplay of nieuwe functies. Deze update is daarin geen uitzondering. Als je, net als vele anderen, groot fan bent van het spektakel van The International, maar niet bekend bent met de oude legendes van Arteezy op een klif, of het uitgebreide onderzoek van Emo naar de lore en het brede gebruik van het vraagteken, dan geeft dat niks: ook voor jou heeft deze update van alles te bieden.",
      "In deze update zit ook de profielshowcase, die gratis beschikbaar is voor alle spelers. Of je nu trots bent op je stats, je gevoel voor mode in het spel of die ene keer dat je een spel hebt gewonnen als Invoker, je hebt nu een plek waar je je favoriete momenten uit je Dota-loopbaan kunt delen. We kunnen eindeloos doorgaan over hoe cool alles is, maar het is misschien beter om het gewoon te laten zien. Ga nu naar de updatepagina om [url=https://www.dota2.com/international2023?1]de plaatjes te bekijken[/url].",
      "[h3]Een blik vooruit[/h3]",
      "We zijn nu al bezig aan nieuwe updates met ieder hun eigen focus. We weten dat jullie ongeduldig uitkijken naar de volgende gameplaypatch, nieuwe Arcana's en alles waar nog aan gewerkt wordt, maar dat moet allemaal even wachten. Daar komen we nog op terug nadat de nieuwe kampioenen de Aegis eindelijk in handen hebben. Nu gaan we eerst naar Seattle om de beste spelers ter wereld te verwelkomen. We kunnen niet wachten! We zien jullie op weg naar The International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}