{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualización de la celebración de The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Actualización de la celebración de The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Con gran emoción, hoy lanzamos el Compendio de The International 2023. El Compendio de este año es un poco diferente a los de años anteriores, así que queremos contaros brevemente qué es, cómo funciona y por qué lo hemos creado.",
      "Como [url=https://www.dota2.com/newsentry/6252732681186068104]explicamos hace unos meses[/url], al analizar la historia de Dota, nos dimos cuenta de que los pases de batalla habían ido creciendo progresivamente hasta acaparar todo el contenido del año y nos estaban impidiendo lanzar otras creaciones. Para solucionarlo, decidimos empezar a lanzar contenido nuevo más a menudo y de muchas otras maneras. Este año ha estado lleno de experimentos: lanzamos un [url=https://www.dota2.com/newsentry/3692442542239261662]nuevo sistema de comportamiento de los jugadores[/url], objetos gratis para [url=https://www.dota2.com/newsentry/3640650512230380185]celebrar el 10.⁰ aniversario[/url], una [url=https://www.dota2.com/newsentry/5657125992547620671]serie de[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]parches de jugabilidad[/url], una colección de sets creados por la comunidad y mucho más. Este Compendio es otro ejemplo de esa innovación.",
      "[h3]Características y recompensas centradas en los eventos[/h3]",
      "Todas las actualizaciones de Dota tienen objetivos diversos, y parte del trabajo al diseñar y crear una actualización es decidir qué queremos destacar. Las actualizaciones pueden estar dedicadas a lanzar contenido cosmético o a ajustar el equilibrio del juego. También pueden estar destinadas a generar el mayor fondo de premios posible. En lugar de eso, para esta actualización, decidimos centrarnos en algo mucho más específico: celebrar a los jugadores, a los equipos y el arte que constituyen las partidas de Dota de alto nivel que se juegan en The International. Nos concentramos por completo en crear un conjunto de actividades con las que disfrutar aún más de The International mientras se estén jugando partidas y otro conjunto para seguir disfrutando de The International mientras [i]no[/i] haya partidas en curso.",
      "Y eso es exactamente el Compendio de este año: una colección de desafíos creados en torno a los jugadores profesionales y al evento en sí. Hemos recuperado y mejorado algunos antiguos favoritos, como la liga Fantasía y las predicciones. También hemos incluido una serie de actividades nuevas que van de lo simpático (¡Bingo!) a lo absolutamente formidable (como el desafío «El camino a The International»).",
      "Todo lo que consigas en el Compendio te ayudará a avanzar para conseguir recompensas. Al igual que los desafíos del Compendio, todas las recompensas de este año se centran en los jugadores y en el evento. Verás un HUD de The International 2023, líneas permanentes de la rueda de chat y una Égida física de Coleccionista, así como montones de contenido nuevo para el expositor de tu perfil (más detalles abajo), incluyendo pegatinas de equipos y jugadores.",
      "[h3]Para todos los gustos[/h3]",
      "De acuerdo con los objetivos que nos propusimos a principios de este año, nos hemos empeñado en que todas las actualizaciones tengan algo interesante para todos los jugadores de Dota, ya sea nueva jugabilidad o características nuevas. Y esta actualización va en esa misma línea. Si te encanta (como a muchos) disfrutar del espectáculo de The International, pero no conoces antiguas leyendas como la de Arteezy al precipicio o la de Emo investigando la historia profunda del juego y los diferentes usos de los signos de interrogación, no pasa nada: esta actualización te va a gustar de todas formas.",
      "Incluye también el Expositor del Perfil, gratis y disponible ya para todos los jugadores. Si admiras con orgullo tu trayectoria, tu estilo dentro del juego o aquella vez que ganaste una partida con Invoker, hemos creado un panel en el que puedes mostrar todo lo que más valoras de tu experiencia en Dota. Podríamos pasarnos el día contándote lo guay que es, pero una imagen vale más que mil palabras, así que [url=https://www.dota2.com/international2023?1]pásate por la página de la actualización[/url] que hemos creado y échale un vistazo.",
      "[h3]De cara al futuro[/h3]",
      "Ya estamos preparando próximas actualizaciones centradas en diferentes temas y sabemos que esperáis con ansias el próximo parche importante, un nuevo conjunto de arcanos y todo lo demás que presentaremos muy pronto, pero eso solo será después de que los campeones se hagan con la Égida. Por ahora, Seattle vuelve a recibir a los mejores jugadores del mundo, y nos morimos de ganas. Nos vemos en «El camino a The International»."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}