{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Feiring av The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Feiring av The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Vi er glade for å kunne gi ut kompendiet til The International 2023. Ettersom dette er en ny form for kompendium i forhold til tidligere år, tenkte vi å gå gjennom hva det er, hvordan det fungerer og hvorfor vi har laget det.",
      "Som vi [url=https://www.dota2.com/newsentry/6252732681186068104]beskrev for noen måneder tilbake[/url], ble det tydlig da vi så på Dotas historie at battlepassene sakte, men sikkert hadde vokst seg så store at de tok over alt innholdet i løpet av et år. Det hindret oss fra å kunne gi ut kreative ting gjennom hele året. Vi ville løse dette, så derfor tok vi et bevisst valg om å gi ut nye ting oftere i mange flere ulike former. Dette året har vært fullt av eksperimenter: Vi har gitt ut [url=https://www.dota2.com/newsentry/3692442542239261662]et nytt spilleratferdssystem[/url], gratis gjenstander for å [url=https://www.dota2.com/newsentry/3640650512230380185]feire 10-årsjubileet[/url], en [url=https://www.dota2.com/newsentry/5657125992547620671]rekke[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]spilloppdateringer[/url], en samling med samfunnssett og mer. Dette kompendiet er enda et eksempel på noe nytt.",
      "[h3]Funksjoner og belønninger med fokus på begivenheten[/h3]",
      "Alle Dota-oppdateringer har en rekke mål, og en del av arbeidet med å utforme og bygge en oppdatering går med på å velge hva vi skal legge vekt på. En oppdatering kan ha fokus på å gi ut pynteting eller finjustere balansen. En oppdatering kan prøve å skape den størst mulige premiepotten. I stedet for disse målene valgte vi å gi denne oppdateringen en smalere fokus: Å løfte frem spillerne, lagene og artisteriet man får fra det aller høyeste nivå av Dota ved The International. Vi har fokusert helt og holdent på å lage en rekke aktiviteter som gjør TI mer moro mens kampene pågår, og andre aktiviteter som gjør TI mer moro selv om det [i]ikke[/i] pågår noen kamper.",
      "Så det er årets kompendium: En rekke utfordringer som vi har bygget rundt proffspillerne og selve begivenheten. Vi har hentet tilbake og forbedret noen gamle favoritter som fantasispillet og forutsigelser. Vi har også innført noen nye aktiviteter, alt fra det letthjertede (bingo) til det mer seriøse (Veien til The International-utfordringen).",
      "Alt du oppnår gjennom kompendiet, gir deg fremgang mot belønninger. I likhet med utfordringene i kompendiet er alle belønningene i år bygget rundt spillerne og begivenheten. Det er et grensenitt for The International 2023, permanente replikker til samtalehjulet og et fysisk Aegis-samleobjekt, sammen med mye nytt innhold til profilutstillingen (se nedenfor), blant annet klistremerker for lag og spillere.",
      "[h3]Noe for alle[/h3]",
      "I tråd med målene vi satte oss tidligere i år, har vi vært bevisste på at alle oppdateringene vi gir ut, skal ha noe for alle Dota-spillere, enten det er nytt spillopplegg eller nye funksjoner. Det gjelder også denne oppdateringen: Hvis du, som mange andre, er stor tilhenger av å se The International, men ikke er like kjent med de gamle klassikerne Arteezy på en klippe, eller Emos dypdykk langt ned i historien og de mange ulike bruksområdene til spørsmålstegnet, er det også i orden. Vi har noe til deg i denne oppdateringen også.",
      "Denne oppdateringen inneholder også profilutstillingen – gratis og tilgjengelig nå for alle spillere. Om du er stolt av kamphistorikken, motesansen din i spillet eller den ene gangen du vant som Invoker, har vi laget et lerret der du kan vise frem de delene av Dota-opplevelsen du setter mest pris på. Vi kunne brukt hele dagen på å beskrive hvor kult det er, men siden et bilde sier mer enn tusen ord, har vi snekret sammen en hel oppdateringsside: [url=https://www.dota2.com/international2023?1]Se på bildene her[/url].",
      "[h3]Videre[/h3]",
      "Vi jobber allerede med fremtidige oppdateringer som har forskjellige fokus, og vi vet at du kanskje er spent på den neste store oppdateringen, det neste settet med arkanaer og alt det andre vi jobber med – men det får bli etter at mesterne har gjort krav på Aegis of Champions. Inntil videre ønsker Seattle de beste spillerne i verden velkommen, og vi gleder oss skikkelig. Vi sees på veien til The International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}