{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2023 – Actualizarea festivă",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "The International 2023 – Actualizarea festivă",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Suntem încântați să lansăm astăzi compendiul International pentru The International 2023. Deoarece compendiul de anul acesta capătă o nouă formă, ne-am dorit să ți-l prezentăm în detaliu pentru a-ți explica modul în care funcționează și deciziile pe care le-am luat pentru realizarea acestuia.",
      "Așa cum [url=https://www.dota2.com/newsentry/6252732681186068104?l=romanian]am menționat în urmă cu câteva luni[/url], analizând istoricul jocului Dota 2, am putut realiza cu ușurință faptul că permisele de bătălie au început să acapareze întregul conținut din decursul unui an, iar acest lucru nu ne permitea să lansăm și alte chestii interesante de-a lungul anului. Ne-am dorit să remediem această problemă și, prin urmare, am decis în mod deliberat să lansăm mai regulat o gamă variată de conținut. Acest an a fost unul al experimentelor: am lansat [url=https://www.dota2.com/newsentry/3692442542239261662?l=romanian]un sistem nou de evaluare a comportamentelor jucătorilor[/url], obiecte gratuite ca parte a [url=https://www.dota2.com/newsentry/3640650512230380185?l=romanian]aniversării de 10 ani[/url], o [url=https://www.dota2.com/newsentry/5657125992547620671?l=romanian]serie de[/url] [url=https://www.dota2.com/newsentry/3674426239866314901?l=romanian]actualizări de joc[/url], o colecție de seturi comunitare și multe altele. Compendiul acesta reprezintă un alt exemplu de conținut nou.",
      "[h3]Caracteristici și recompense axate pe eveniment[/h3]",
      "Fiecare actualizare Dota își propune să îndeplinească o gamă variată de obiective, iar o parte din munca de proiectare și realizare a unei actualizări o reprezintă alegerea unui element central. O actualizare se poate axa pe lansarea de accesorii sau realizarea unor modificări care să echilibreze jocul. În alte cazuri, o actualizare poate încerca să genereze cel mai mare fond de premiere posibil pentru o competiție. În locul acestor obiective, am decis ca pentru această actualizare să ne concentrăm eforturile asupra unui singur scop: acela de a promova jucătorii, echipele și realizatorii care participă la campionatul The International. Ne-am axat în întregime pe crearea unui set de activități menite să facă TI mai distractiv pe parcursul meciurilor, dar și atunci când [i]nu[/i] se desfășoară meciuri.",
      "Astfel, compendiul de anul acesta se rezumă la: o serie de provocări pe care le-am conceput ținând cont de jucătorii profesioniști și de eveniment în sine. Am reintrodus și îmbunătățit câteva dintre provocările preferate ale comunității: provocare Fantasy și pronosticurile. De asemenea, venim și cu câteva activități noi, care variază de la lucruri relativ simple (Bingo) până la lucruri cu adevărat minunate (provocarea „Drumul spre The International”).",
      "În plus, toate realizările tale din cadrul compendiului te vor aduce mai aproape de recompense. Asemenea provocărilor din compendiu, toate recompensele de anul acesta sunt axate pe jucători și eveniment. Există o interfață de joc The International 2023, replici permanente pentru rotița de chat, o replică fizică pentru colecționari a trofeului Aegis, dar și o mulțime de conținut nou pentru afișierul profilului tău (vezi mai jos), inclusiv abțibilduri cu echipe și jucători.",
      "[h3]Ceva pentru toate gusturile[/h3]",
      "Conform obiectivelor pe care ni le-am stabilit la începutul acestui an, intenția noastră a fost să ne asigurăm că fiecare actualizare pe care o lansăm include câte ceva pentru fiecare jucător de Dota, indiferent dacă este vorba despre noi experiențe de joc sau caracteristici noi. Această actualizare nu face excepții: dacă, asemenea multor jucători, îți face mare plăcere să urmărești spectacolul oferit de The International, dar nu ești la curent cu momentele în care Arteezy s-a folosit de stânci în favoarea sa sau cu cercetările efectuate de Emo cu privire la semnul întrebării, avem ceva pregătit și pentru tine.",
      "O nouă caracteristică lansată cu această actualizare o reprezintă afișierul pentru profiluri, acesta fiind disponibil gratuit pentru toți jucătorii. Fie că dorești să te mândrești cu propriile reușite, accesoriile pe care le deții sau acel moment când ai câștigat un meci ca Invoker, am creat o pânză pentru tine cu ajutorul căreia poți prezenta cele mai importante experiențe ale tale din Dota. Am putea continua cât e ziua de lungă să-ți justificăm cât de faine sunt aceste afișiere, dar, din moment ce o poză face cât o mie de cuvinte, am creat o pagină dedicată actualizării: [url=https://www.dota2.com/international2023?1&l=romanian]accesează pagina pentru a vizualiza imaginile[/url].",
      "[h3]Viitorul[/h3]",
      "Lucrăm deja la actualizări viitoare care privesc diverse aspecte și cunoaștem faptul că aștepți cu nerăbdare să afli mai multe despre următoarea actualizare de joc importantă, următorul set de obiecte Arcana și restul lucrurilor la care lucrăm, însă acestea vor urma după ce campionii vor revendica trofeul Aegis. Între timp, așteptăm cu nerăbdare să-i întâmpinăm în Seattle pe cei mai buni jucători din lume. Ne vedem pe „Drumul spre The International”!"
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}