{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja z okazji świętowania The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Aktualizacja z okazji świętowania The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Z radością udostępniamy Kompendium The International 2023. Z uwagi na jego nową formę w stosunku do edycji z poprzednich lat chcieliśmy objaśnić wam, czym jest, jak działa i dlaczego je stworzyliśmy.",
      "Tak jak już to opisaliśmy [url=https://www.dota2.com/newsentry/6252732681186068104]kilka miesięcy temu[/url], rzut oka na historię Dota 2 dał nam jasno do zrozumienia, że Przepustki Bitewne stopniowo rozrastały się do takiego stopnia, że zaczęły pożerać całą zawartość dla danego roku oraz hamowały nasze możliwości udostępniania naszych kreatywnych wytworów w ciągu danego roku. Chcieliśmy to naprawić, więc kilka miesięcy temu podjęliśmy świadomy wybór publikowania nowości częściej oraz w bardziej zróżnicowanej formie. Ten rok był wypełniony eksperymentami: udostępniliśmy [url=https://www.dota2.com/newsentry/3692442542239261662]nowy system kontroli zachowania graczy[/url], darmowe przedmioty z okazji [url=https://www.dota2.com/newsentry/3640650512230380185]świętowania 10. rocznicy[/url], [url=https://www.dota2.com/newsentry/5657125992547620671]mnóstwo[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]aktualizacji rozgrywki[/url], kolekcję zestawów społeczności i nie tylko. To kompendium jest kolejnym przykładem czegoś nowego.",
      "[h3]Funkcje i nagrody skupione na wydarzeniach[/h3]",
      "Każda aktualizacja Dota 2 ma wiele celów, a częścią pracy związanej z projektowaniem i budowaniem aktualizacji jest wybór, na co położyć nacisk. Aktualizacja może być skoncentrowana na dostarczaniu zawartości ozdobnej czy udoskonalaniu balansu rozgrywki lub stanowić próbę wygenerowania największej możliwej puli nagród. Lecz zamiast skupiać się na tych celach postanowiliśmy zawężyć zakres tej aktualizacji: wyróżnić graczy, drużyny i kunszt, którym jest wysokopozioma Dota 2 rozgrywana podczas The International. Skupiliśmy się całkowicie na stworzeniu zestawu zadań, by The International dawał więcej frajdy podczas rozgrywek, a także kolejny taki zestaw, by osiągnąć ten sam cel, gdy rozgrywki akurat się [i]nie[/i] odbywają.",
      "I tym jest właśnie tegoroczne Kompendium: zbiorem wyzwań, które zbudowaliśmy wokół zawodowych graczy i samego wydarzenia. Przywróciliśmy i ulepszyliśmy kilka ulubionych klasyków np. ligę marzeń i typowania. Wprowadzamy również kilka nowych zadań, począwszy od beztroskiego (bingo) po budzące grozę (wyzwanie Drogi do The International).",
      "Wszystkie ukończone przez was zadania z Kompendium przybliżają was do zdobycia nagród. Podobnie jak wyzwania Kompendium, wszystkie nagrody w tym roku są skupione wokół graczy i wydarzenia. Mamy interfejs The International 2023, niewygasające kwestie koła czatu i fizyczną wersję kolekcjonerską Egidy Czempionów, a także mnóstwo treści do waszych gablot profilu (sprawdźcie poniżej), włączając w to naklejki drużyn i graczy.",
      "[h3]Dla każdego coś fajnego[/h3]",
      "Zgodnie z celami, które wyznaczyliśmy na początku tego roku, z rozmysłem chcieliśmy się upewnić, że każda udostępniona przez nas aktualizacja ma w sobie coś dla każdego gracza Dota 2, czy to nową formę rozgrywki, czy też nowe funkcje. Ta aktualizacja niczym się od tego nie różni: jeśli (tak jak mnóstwo ludzi) jesteście oddanymi fanami śledzenia widowiska, którym jest The International, ale nie za bardzo orientujecie się w starych legendach o Arteezym na klifie albo dociekaniach Emo o złożoność uniwersum i wielu rozmaitych zastosowaniach znaku zapytania, to też w porządku, bo to również mamy dla was w tej aktualizacji.",
      "Obejmuje ona również gablotę profilu, która jest dostępna za darmo dla wszystkich graczy. Niezależnie od tego, czy jesteście dumni ze swojego rekordu, wyczucia stylu w grze albo tego jednego przypadku, gdy wygraliście grę Invokerem, to stworzyliśmy płótno, na którym możecie wyeksponować te elementy rozgrywki w Dota 2, które są najbliższe waszym sercom. Moglibyśmy rozwodzić się nad wspaniałością tego wszystkiego aż do wieczora, ale skoro obraz jest wart więcej niż tysiąc słów, stworzyliśmy kompletną stronę aktualizacji. [url=https://www.dota2.com/international2023?1]Udajcie się tam i popatrzcie na obrazki[/url].",
      "[h3]Co dalej[/h3]",
      "Już pracujemy nad przyszłymi aktualizacjami skupionymi na różnych kwestiach i wiemy też, że z niecierpliwością oczekujecie więcej informacji na temat kolejnej dużej łatki, następnego zestawu arkanów i wszystkiego, czym się zajmujemy. Ale na to przyjdzie czas po tym, gdy zwycięzcy sięgną już po Egidę. Na razie Seattle serdecznie wita powrót najlepszych graczy na świecie, a my ze zniecierpliwieniem czekamy na to, co nastąpi. Widzimy się na Drodze do The International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}