{
  "gid": "3735229909364378684",
  "clan_steamid": "103582791433224455",
  "event_name": "Bản cập nhật chào mừng The International 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1695849420,
  "rtime32_end_time": 1695853801,
  "comment_count": 0,
  "creator_steamid": "76561199113010392",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "10e287ee86593153efb62123989869bd386c23a9.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1695850440
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1695858755
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1696529470
      }
    ]
  },
  "announcement_body": {
    "gid": "3735229909364378685",
    "clanid": "3703047",
    "posterid": "76561199113010392",
    "headline": "Bản cập nhật chào mừng The International 2023",
    "posttime": 1695849309,
    "updatetime": 1696529470,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ff438f53339fe12849e788e3902b319d2b0828c.jpg[/img]",
      "Chúng tôi xin hân hoan ra mắt International Compendium cho giải The International 2023. Vì đây là một hình thức mới so với Compendium các năm trước, chúng tôi muốn giải thích tường tận về nội dung, cách hoạt động và nguyên do chúng tôi tạo ra nó.",
      "Như [url=https://www.dota2.com/newsentry/6252732681186068104]đã nói cách đây vài tháng[/url], việc nhìn lại lịch sử Dota giúp ta nhận thấy rõ rằng: Battle Pass đã dần lớn lên đến mức nuốt chửng toàn bộ nội dung trong năm, ngăn cản chúng tôi ra mắt nhiều thứ sáng tạo xuyên suốt cả năm. Vì muốn giải quyết vấn đề này nên mấy tháng trước, chúng tôi đã có quyết định sáng suốt là thường xuyên tung ra nhiều nội dung mới hơn dưới nhiều hình thức khác nhau. Đây là một năm đầy thử nghiệm: Chúng tôi đã ra mắt [url=https://www.dota2.com/newsentry/3692442542239261662]hệ thống mới cho hành vi người chơi[/url], vật phẩm miễn phí để [url=https://www.dota2.com/newsentry/3640650512230380185]chào mừng kỷ niệm 10 năm[/url], [url=https://www.dota2.com/newsentry/5657125992547620671]một cơ số[/url] [url=https://www.dota2.com/newsentry/3674426239866314901]các bản cập nhật lối chơi[/url], hàng loạt bộ vật phẩm cộng đồng và nhiều nữa. Compendium năm nay là một ví dụ khác về sự đổi mới.",
      "[h3]Tính năng vì sự kiện, phần thưởng do sự kiện[/h3]",
      "Mỗi bản cập nhật Dota đều có nhiều mục tiêu khác nhau và tìm chọn yếu tố cần nhấn mạnh chính là một phần công việc khi thiết kế và xây dựng bản cập nhật. Bản cập nhật có thể tập trung vào việc cung cấp vật phẩm trang trí hoặc tinh chỉnh sự cân bằng. Bản cập nhật có thể tìm cách tạo ra tổng giải thưởng lớn nhất. Thay vì các mục tiêu đó, chúng tôi chọn tập trung vào bản cập nhật này theo cách tinh gọn hơn: Nâng tầm tuyển thủ, đội tuyển, và màn trình diễn nghệ thuật - chính là các trận đấu Dota đẳng cấp cao tại giải The International. Chúng tôi tập trung hoàn toàn vào việc tạo ra một loạt hoạt động để TI trở nên hào hứng hơn khi các trận đấu đang diễn ra, và một nhóm hoạt động khác để TI sôi nổi không kém ngay cả khi [i]chẳng có[/i] trận đấu nào.",
      "Vậy Compendium năm nay là: một loạt thử thách được xây dựng xoay quanh tuyển thủ chuyên nghiệp và chính sự kiện này. Chúng tôi đem trở lại và cải thiện một số chương trình yêu thích thân quen như Fantasy và dự đoán. Kèm theo đó là vài hoạt động mới, từ vui tươi nhẹ nhàng (lô tô) cho đến hàng nặng đô (Thử thách Đường tới The International).",
      "Mọi thứ hoàn thành qua Compendium sẽ giúp bạn đạt tiến độ cần thiết để nhận phần thưởng. Giống như các thử thách Compendium, tất cả phần thưởng năm nay đều xoay quanh người chơi và sự kiện. Giao diện The International 2023 này, vòng tán gẫu sở hữu trọn đời, bản sao Aegis sưu tầm, cùng cơ man nội dung mới cho quầy trưng bày hồ sơ (xem bên dưới), bao gồm hình dán đội tuyển và tuyển thủ.",
      "[h3]Ai nấy đều có phần[/h3]",
      "Để phù hợp với các mục tiêu đặt ra trong nửa đầu năm nay, chúng tôi đã chủ đích đảm bảo rằng mỗi bản cập nhật phát hành chứa đựng điều gì đó mà tất cả người chơi Dota đều có thể thưởng thức, dù là lối chơi hay tính năng mới. Bản cập nhật này không là ngoại lệ: Nếu bạn cũng như nhiều người khác là fan ruột thích xem các trận chiến mãn nhãn ở giải The International nhưng lại không quen thuộc với các huyền thoại như Arteezy mắc kẹt trên vách đá, hay cách Emo nghiên cứu nguồn gốc kỳ bí và hàng loạt thủ pháp sử dụng dấu chấm hỏi, thì cũng không sao cả — trong bản cập nhật này vẫn có nội dung dành cho bạn.",
      "Bản cập nhật cũng bao gồm tính năng quầy trưng bày hồ sơ, hiện đã ra mắt và miễn phí cho tất cả người chơi. Cho dù niềm tự hào của bạn đến từ thành tích, gu thời trang trong trò chơi, hay một lần thắng khi chơi Invoker, chúng tôi đã tạo một khung tranh để bạn flex những trải nghiệm Dota đáng giá nhất đó. Có thể dành cả ngày để mô tả tính năng này tuyệt cú mèo thế nào, nhưng một bức ảnh đáng giá hơn ngàn lời nói, vì vậy chúng tôi đã tổng hợp trang cập nhật: [url=https://www.dota2.com/international2023?1]cùng vào xem ảnh[/url].",
      "[h3]Hướng tới tương lai[/h3]",
      "Chúng tôi đang thực hiện các bản cập nhật cho tương lai và biết bạn rất háo hức tìm hiểu về chúng cũng như bộ Arcana tiếp theo cùng nhiều thứ khác — nhưng hãy đợi đến sau khi các nhà vô địch của chúng ta nhận Aegis nhé. Hiện tại, chúng tôi hết sức nôn nao chào đón sự trở lại của những tuyển thủ xuất sắc nhất thế giới đến Seattle. Hẹn gặp bạn tại Đường tới The International."
    ],
    "commentcount": 2067,
    "tags": [
      "mod_reviewed",
      "ModAct_441547739_1695850059_0",
      "ModAct_1428002267_1695850713_4",
      "ModAct_1426387032_1695859709_4",
      "ModAct_487791598_1696039296_4",
      "ModAct_487997664_1696531358_4"
    ],
    "language": 28,
    "hidden": 0,
    "forum_topic_id": "3884974596969320070",
    "event_gid": "3735229909364378684",
    "voteupcount": 8573,
    "votedowncount": 6784,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3884974596969320070",
  "rtime32_last_modified": 1700125634,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1696531359,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 8573,
  "votes_down": 6784,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3884974596969320070",
  "clan_steamid_original": "103582791433224455"
}