{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "อัปเดต Dota Plus - ฤดูใบไม้ผลิ 2024 (และ Dota Labs)",
  "event_type": 13,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "อัปเดต Dota Plus - ฤดูใบไม้ผลิ 2024 (และ Dota Labs)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]อัปเดต Dota Plus ประจำฤดูกาล[/h2]",
      "เมื่อฤดูใบไม้ผลิมาถึงพร้อมดอกไม้ที่เบ่งบานรอบตัวเรา พวกเราในทีม Dota ก็หวนรำลึกถึงฤดูใบไม้ผลิแต่กาลก่อน ครั้งที่โลกยังแปลกใหม่และเต็มไปด้วยสีสันแห่งชีวิต ใครจะลืมเรื่องการปีนขึ้นต้นโอ๊กเก่าแก่ข้างสะพานได้ลง? หรือการขโมยแครอทและหัวผักกาดจากลุงชาวไร่แม็กกอตเจ้าอารมณ์? หรือการนำแหวนวงนั้นไปยังดินแดนมอร์ดอร์ แล้วโยนลงในปล่องภูเขาไฟแห่งเมาท์ดูม อันเป็นสถานที่หล่อหลอมมัน? ",
      "[h3]สมบัติประจำฤดูกาล Dota Plus[/h3]",
      "ส่วนสุดท้ายจากไตรภาคแห่งความทรงจำในฤดูใบไม้ผลิของเรานั้นมีความเกี่ยวข้องกับปัจจุบันเป็นพิเศษ เนื่องจากเราได้ค้นพบสมบัติล้ำค่าอีกชิ้นหนึ่ง และครั้งนี้ สมบัติชิ้นนั้นดีเกินกว่าจะโยนลงไปในปล่องภูเขาไฟ ",
      "สมบัติประจำฤดูใบไม้ผลิ 2024 มาถึงแล้ว พร้อมให้สั่งซื้อด้วยเศษมณี สมบัตินี้ประกอบด้วยชุดใหม่ทั้งหมดสำหรับ Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord และ Nyx Assassin นอกจากนี้ยังมีโอกาสปลดล็อค Courier Sir Molestach Irondrill ซึ่งมาถึงเลนต่าง ๆ พร้อมกับอัญมณีประเภท Ethereal และ Prismatic แบบสุ่ม",
      "นอกจากนี้เรายังได้นำชุดเซ็ตต่าง ๆ จากสมบัติประจำฤดูร้อน 2022 มาให้ซื้อได้โดยตรงชุดละ 15,000 เศษมณี ซึ่งเป็นส่วนหนึ่งของชุดเซ็ตสะสมดั้งเดิมในร้านค้าเศษมณีด้วย",
      "[h3]ภารกิจประจำฤดูกาลและรางวัลกิลด์ฉบับอัปเดต[/h3]",
      "อัปเดตในวันนี้ยังมาพร้อมกับภารกิจ Dota Plus ชุดใหม่เพื่อช่วยเก็บสะสมเศษมณีเพิ่มเติมสำหรับตรามณีและสมบัติประจำฤดูกาลใหม่ — โดยมีให้สูงสุดถึง 115,200 เศษมณีตลอดฤดูกาล ส่วนรางวัลกิลด์ได้รับการอัปเดตเช่นกัน ประกอบด้วยอีโมติคอน สเปรย์ และวงล้อสนทนาให้เหล่ากิลด์นักทำคะแนนชั้นนำได้เลือกใช้",
      "[table]",
      "  [tr]",
      "    [th]ระดับกิลด์[/th]",
      "    [th]รางวัล[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]เงิน[/td]",
      "    [td][list]",
      "      [*]อิโมติคอน - lion_bounce",
      "      [*]อิโมติคอน - rainbow_phoenix",
      "      [*]อิโมติคอน - riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]ทอง[/td]",
      "    [td][list]",
      "      [*]สเปรย์ - Aghanim - ดัน!",
      "      [*]สเปรย์ - Bounty Hunter - รวยเละ",
      "      [*]สเปรย์ - Hoodwink - ลูกโอ๊ก",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]แพลทินัม[/td]",
      "    [td][list]",
      "      [*]วงล้อสนทนา - \"Что это?! Какая жесть!\"",
      "      [*]วงล้อสนทนา - \"Ooooh, por dios!\"",
      "      [*]วงล้อสนทนา - \"你行你行，你上你上\"",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]ขอแนะนำ Dota Labs[/h2]",
      "นอกเหนือจากเนื้อหา Dota+ อัปเดตวันนี้จะนำเสนอคุณสมบัติการทดลองสำหรับผู้เล่น Dota ทุกคน และเป็นวิธีใหม่สำหรับเราในการจัดส่งการทดลอง: Dota Labs (เราสนุกกับการตั้งชื่ออย่าง \"ส่วนผสมที่ไม่เสถียร\" และ \"การปรับปรุงของนักปรับปรุง\" แต่ในที่สุดเราก็ตัดสินใจว่าเราอยากให้ชื่อนั้นน่าเบื่อและชัดเจน และมีคุณสมบัติที่น่าสนใจดีกว่า)",
      "หากคุณโหลดเมนูตัวเลือกของคุณ คุณจะเห็นแท็บใหม่ที่มีป้ายกำกับ \"Dota Labs\" คุณสมบัติเหล่านี้อยู่ในขั้นการทดลอง และยังมีการปรับปรุงน้อยกว่าคุณสมบัติอื่น ๆ ที่เราจัดส่ง ดังนั้นคุณสมบัติทั้งหมดนี้จึงอยู่ในเมนูพิเศษและปิดใช้งานอยู่โดยค่าเริ่มต้น โดยเมื่อเราใช้คุณสมบัติเหล่านี้ในการทดสอบเกมแล้ว เราได้ข้อมูลที่ไม่ชัดเจนหรือเกิดผลตอบรับเป็นเสียงแตก เราไม่มีทางรู้ได้จริง ๆ ว่าผลลัพธ์จะออกมาดี หรือจะทำให้ดีขึ้นได้อย่างไร หากไม่มีผู้เล่น Dota ที่แท้จริงใช้คุณสมบัติเหล่านี้ ดังนั้นเราจึงได้จัดส่งคุณสมบัติเหล่านี้ในรูปแบบก่อนกำหนดที่มีจุดประสงค์เพื่อให้คุณสามารถบอกเราได้ว่าคุ้มค่าที่จะลงทุนลงแรงต่อไปหรือไม่",
      "ชุดคุณสมบัติเบื้องต้นของ Dota Labs ประกอบด้วย:",
      "[list]",
      "[*][b]แผนที่โอเวอร์เลย์[/b] แผนที่นี้มีรูปลักษณ์คล้ายกับแผนที่ย่อ แต่มีขนาดใหญ่แทนที่จะเล็ก และโปร่งใสแทนที่จะทึบ และเป็นแบบเต็มหน้าจอแทนที่จะแยกอยู่ที่มุมหน้าจอ เรามีคำถามมากมาย รวมไปถึง (แต่ก็ไม่ได้มีแค่นี้นะ): มันมีประโยชน์ต่อรูปแบบการเล่นของคุณหรือไม่? คุณใช้งานมันอย่างไร? คุณต้องการให้มันทำอะไรได้?",
      "[*][b]การกำหนดปุ่มเปลี่ยนแปลงสำหรับกรองการร่าย[/b] การกำหนดเป้าหมายในสภาพแวดล้อมที่วุ่นวายอาจเป็นเรื่องที่ท้าทาย และการคลิกผิดก็มีโอกาสทำให้วายป่วงได้ Dota พยายามประเมินคำสั่งที่คุณป้อนอย่างดีที่สุดแล้ว แต่บางครั้งก็ดูเหมือนว่าคุณอยากจะใช้ Laguna Blade กับครีปตัวนั้นจริง ๆ คุณสมบัติใหม่นี้ช่วยให้คุณสามารถกำหนดปุ่มสำหรับเปลี่ยนแปลงการร่าย ซึ่งเมื่อกดค้างไว้จะบังคับให้การเลือกเป้าหมายของคุณไปยังศัตรู เพื่อนร่วมทีม ครีป หรือฮีโร่ เมื่อใช้งานจริงแล้ววิธีกำหนดเป้าหมายแบบใดมีประโยชน์มากที่สุดและน้อยที่สุด? เราขาดอะไรไปบ้าง?",
      "[*][b]แถบพลังชีวิตฮีโร่ตามตำแหน่งที่เห็นได้ชัดเจน[/b] การต่อสู้เป็นทีมใน Dota มักมีความวุ่นวาย และบางครั้งในความโกลาหลก็อาจทำให้คุณหาฮีโร่ตัวเองไม่เจอได้ ตัวเลือกนี้จะเปลี่ยนรูปแบบและความชัดเจนของป้ายชื่อสำหรับเฉพาะฮีโร่ของคุณให้โดดเด่นขึ้นอย่างมาก ตัวเลือกนี้ช่วยให้ดูง่ายขึ้นไหม หรือทำให้ตาลายหนักกว่าเดิม?",
      "[/list]",
      "เราคาดหวังอย่างเต็มที่ว่าคุณสมบัติบางอย่างเหล่านี้ (หรือไอเดีย Dota Labs ในอนาคต) จะเติบโตเต็มที่และสำเร็จการศึกษาออกจากห้องทดลอง และคุณสมบัติบางอย่างก็อาจโดนเก็บเข้ากรุ แต่จะเป็นอันไหนบ้างก็ขึ้นอยู่กับคุณ",
      "พวกคุณบางคนที่อ่านข้อความนี้อาจรู้สึกตื่นเต้นที่ได้ลองใช้คุณสมบัติเหล่านี้ แต่ก็กังวลว่าเราจะใช้คุณสมบัติพวกนี้ต่อไปหรือไม่ในอนาคต \"ครั้งที่แล้วที่พวกเธอนำเสนออะไรใน Dota ใหม่ ๆ ที่มีชื่อเรียกว่า 'สอดส่องลอดเลน' นั่นน่ะ นี่ก็ผ่านมาตั้งหลายเดือนแล้ว ไม่เห็นมีโพสต์ใหม่บ้างเลย\" พูดอีกก็ถูกอีก! เราคิดว่าวิธีที่ดีที่สุดในการแสดงให้เห็นว่าเรามีแผนมุ่งมั่นระยะยาวในส่วนนี้ ก็คือการแสดงความมุ่งมั่นของเราระยะยาวในส่วนตรงนั้นเช่นกัน ดังนั้น ขอให้สนุกกับ[url=https://www.dota2.com/newsentry/4115798034511159059]สอดส่องลอดเลนของวันนี้[/url]เช่นกัน"
    ],
    "commentcount": 370,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 6419,
    "votedowncount": 1023,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1715113653,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 6419,
  "votes_down": 1023,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}