{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Оновлення Dota Plus — весна 2024 (і лабораторії Dota)",
  "event_type": 13,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Оновлення Dota Plus — весна 2024 (і лабораторії Dota)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Сезонне оновлення Dota Plus[/h2]",
      "Весна пробуджує все навколо й повертає нашу команду Dota в старі-добрі часи, коли світ був молодим і сповненим життя. Як можна забути, як залізали на той старий дуб біля мосту? А викрадання моркви й ріпи з городу старого роздратованого Фермера Маґґота? Або шлях до Мордору й кидання Персня у вогняну лаву Судної Гори, де його було створено? ",
      "[h3]Сезонна скарбниця Dota Plus[/h3]",
      "Остання частина нашої трилогії весняних спогадів особливо доречна сьогодні, адже ми приготували нову безцінну скарбницю — її-то не варто кидати у вогняну лаву. ",
      "Сезонна весняна скарбниця 2024 року вже тут. Вона доступна для придбання за уламки. Ця скарбниця містить нові набори для Буретворця, Темної Верби, Спектральної Мари, Лицаря Хаосу, Доленосця, Земляного Духа, Підземного Лорда та Нікса-Вбивці. У вас є шанс отримати рідкісного кур’єра Sir Molestach Irondrill, що має одразу два самоцвіти — призматичний і кінетичний.",
      "Ми також узяли набори з літньої скарбниці 2022 року та зробили їх доступними для безпосереднього придбання за 15 000 уламків за кожен у колекції класичних наборів крамниці уламків.",
      "[h3]Оновлені сезонні завдання й нагороди гільдії[/h3]",
      "Сьогоднішнє оновлення також дає новий набір завдань Dota Plus, які посилять ваш запас уламків для нових реліквій і сезонної скарбниці. Загалом за сезон можна отримати 115 200 уламків. Ми оновили й нагороди для гільдій, і тепер гільдії з найбільшою кількістю очок отримають нові смайлики, графіті та фрази колеса чату.",
      "[table]",
      "  [tr]",
      "    [th]Ступінь гільдії[/th]",
      "    [th]Нагороди[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Срібло[/td]",
      "    [td][list]",
      "      [*]Смайлик «lion_bounce»",
      "      [*]Смайлик «rainbow_phoenix»",
      "      [*]Смайлик «riki_peaceout»",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Золото[/td]",
      "    [td][list]",
      "      [*]Графіті «Aghanim — Push»",
      "      [*]Графіті «Bounty Hunter — Riches»",
      "      [*]Графіті «Hoodwink — Acorn»",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Платина[/td]",
      "    [td][list]",
      "      [*]Фраза для колеса чату «Что это?! Какая жесть!»",
      "      [*]Фраза для колеса чату «Ooooh, por dios!»",
      "      [*]Фраза для колеса чату «你行你行，你上你上»",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Представляємо лабораторії Dota[/h2]",
      "Окрім вмісту Dota Plus у сьогоднішньому оновленні ми представляємо набір експериментальних функцій, який доступний для всіх гравців Dota, а також новий спосіб випуску таких експериментів — лабораторії Dota. Щодо назви цих лабораторій: ми мали й інші варіанти, як-от «Нестабільні суміші» та «Механіки Механіка», але зрештою вирішили, що суть має бути зрозумілою (навіть якщо назва виглядатиме нудно), а власне експериментальні функції мають бути цікавими.",
      "Відкривши меню налаштувань, ви побачите нову вкладку: «Лабораторії Dota». На ній ви знайдете виключно експериментальні функції, що мають менш довершений вигляд у порівнянні з іншими, тому вони зібрані разом у цьому окремому меню та стандартно вимкнені. Це функції, ігрове тестування яких надало змішані або неоднозначні результати. Оскільки без відгуків справжніх гравців нам важко знати напевно, наскільки ці результати хороші або як можна їх покращити, ми вирішили випускати такі функції на ранній стадії розробки, щоб одразу дізнаватися, чи варто продовжувати роботу над ними.",
      "Ось початковий набір функцій лабораторій Dota:",
      "[list]",
      "[*][b]Велика мапа[/b]. На відміну від мінімапи, вона велика, прозора та заповнює весь екран, а не розташована в куті. Нас дуже цікавить низка питань, а саме: чи пасує вона вашому стилю гри? Як ви взаємодієте з нею? Чого їй бракує?",
      "[*][b]Призначення клавіш фільтрування цілі[/b]. Шукати ціль, коли навколо суцільний хаос, непросто, а промахи в таких умовах можуть мати катастрофічні наслідки. Гра максимально намагається розпізнавати ваші команди, та все ж бувають моменти, коли здається, що ви збиралися застосувати ульт на того кріпа. Завдяки цій новій функції ви зможете призначити клавіші фільтрування цілі. Утримуючи ці клавіші, можна вибрати ціллю ворогів, союзників, кріпів або героїв. А нас цікавить ось що: які фільтри найменш і найбільш корисні на практиці? Чогось бракує?",
      "[*][b]Виділення смуги здоров’я власного героя[/b]. Командні бої бувають настільки метушливими, що у вирі подій важко помітити власного героя. Ця опція суттєво змінює стиль і помітність смуги здоров’я конкретно вашого героя. Нам важливо знати: вона допомагає чи породжує ще більший візуальний хаос?",
      "[/list]",
      "У нас немає сумнівів, що деякі з цих функцій (або інших ідей, які ще з’являться в лабораторіях Dota) будуть вдосконалені та залишаться в грі, а деякі — покинуть її. Які саме? Це залежить від вас.",
      "Здогадуємось, що вам уже кортить протестувати ці функції власноруч. Можливо, вам ще більше хочеться дізнатися, чи залишаться вони в грі. «Ви вже давно оголосили новинку під назвою \"Між лініями\", та вже минуло кілька місяців після виходу останнього допису цієї серії», — можете сказати ви… І матимете рацію! Чи не найкращим доказом серйозності наших намірів щодо довготривалої роботи в цьому напрямку буде продовження довготривалої роботи й у тому напрямку. Отже, представляємо вашій увазі [url=https://www.dota2.com/newsentry/4115798034511159059]сьогоднішній допис «Між лініями»[/url]."
    ],
    "commentcount": 370,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 6419,
    "votedowncount": 1023,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1715113653,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 6419,
  "votes_down": 1023,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}