{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja Dota Plus – wiosna 2024 (i laboratoria Dota)",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aktualizacja Dota Plus – wiosna 2024 (i laboratoria Dota)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Aktualizacja sezonowa Dota Plus[/h2]",
      "Wokół nas powoli nastaje wiosna i przyroda budzi się do życia, jednocześnie przenosząc nasz zespół pracujący nad grą do wiosen lat dawnych, kiedy to świat był nowy i tętniący życiem. Kto mógłby zapomnieć o wspinaniu się na ten stary dąb przy moście? Albo o kradzieży marchwi i rzepy od szurniętego farmera Maggota? Albo o zabraniu tego pierścienia do Mordoru i wrzuceniu go do ognistych otchłani Góry Przeznaczenia, gdzie został wykuty? ",
      "[h3]Sezonowy skarb Dota Plus[/h3]",
      "Ta ostatnia część naszej trylogii wiosennych wspomnień ma szczególne znaczenie dzisiaj, ponieważ odkryliśmy kolejny bezcenny skarb – i tym razem jest on zbyt dobry, by go wyrzucać do wulkanu. ",
      "Sezonowy skarb wiosny 2024 jest już dostępny i można go kupić za odłamki. Skarb ten zawiera całkowicie nowe zestawy dla Disruptora, Dark Willow, Spectre, Chaos Knighta, Dooma, Earth Spirita, Underlorda i Nyx Assassina. Istnieje również szansa na odblokowanie kuriera – Pana Krecioszka Żelazowiertłego, który przybywa na ścieżki, dzierżąc losowe pryzmatyczne i eteryczne klejnoty.",
      "Zebraliśmy także zestawy dostępne w letnim skarbie sezonowym 2022 i udostępniliśmy je do bezpośredniego zakupu w ramach kolekcji starszych zestawów w sklepie odłamków w cenie 15 000 odłamków za sztukę.",
      "[h3]Zaktualizowane misje sezonowe i nagrody gildii[/h3]",
      "Dzisiejsza aktualizacja zawiera również nowy zbiór misji Dota Plus, aby wspomóc was w uzupełnieniu waszych schowków odłamków o nowe relikwie i sezonowy skarb – podczas całego sezonu można zebrać maksymalnie 115 200 odłamków. Zaktualizowane zostały również nagrody gildii, udostępniając nowe emotikony, spraye oraz koła czatu gildiom mogącym poszczycić się wysokimi pozycjami w tabeli wyników.",
      "[table]",
      "  [tr]",
      "    [th]Stopień gildii[/th]",
      "    [th]Nagrody[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Srebrny[/td]",
      "    [td][list]",
      "      [*]Emotikona – lion_bounce;",
      "      [*]Emotikona – rainbow_phoenix;",
      "      [*]Emotikona – riki_peaceout.",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Złoty[/td]",
      "    [td][list]",
      "      [*]Spray – Aghanim – Pchnięcie;",
      "      [*]Spray – Bounty Hunter – Bogactwa;",
      "      [*]Spray – Hoodwing – Żołądź.",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platynowy[/td]",
      "    [td][list]",
      "      [*]Koło czatu – „Что это?! Какая жесть!”;",
      "      [*]Koło czatu – „Ooooh, por dios!”;",
      "      [*]Koło czatu – „你行你行，你上你上”.",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Przedstawiamy laboratoria Dota[/h2]",
      "Oprócz treści w Dota+ dzisiejsza aktualizacja wprowadza także zbiór eksperymentalnych funkcji dostępnych dla wszystkich graczy, a także nową drogę dla nas na wydawanie takich eksperymentów: laboratoria Dota. Mieliśmy sporo zabawy z wymyślaniem nazwy dla tej nowości, np. „Niestabilne wywary” albo „Majsterkowanie Majstra”, ale ostatecznie zdecydowaliśmy, że wolelibyśmy mieć nudną i jasną nazwę, a za to by same funkcje były interesujące.",
      "Po otwarciu menu opcji zobaczycie nową zakładkę z etykietą laboratoriów Dota. Obecne w tym miejscu funkcje są eksperymentalne i mniej dopracowane niż wiele innych, które wydajemy, przez co wszystkie nowinki są w konkretnym specjalnym menu i domyślnie wyłączone. Są to funkcje, przy których nasze testy rozgrywki przyniosły nam mieszane lub niejasne dane. Nie mamy za bardzo jak stwierdzić, czy są one dobre lub jak je ulepszyć bez sprawdzenia, jak korzystają z nich faktyczni gracze, więc celowo wydajemy je we wcześniejszej formie, abyście mogli nam powiedzieć, czy warto w nie inwestować.",
      "Początkowy zbiór funkcji w laboratoriach Dota obejmuje:",
      "[list]",
      "[*][b]Mapę-nakładkę[/b]. To coś w stylu minimapy, ale jest duża zamiast mała, przezroczysta zamiast pełnokolorowa i na cały ekran zamiast wyizolowana w rogu. Mamy trochę pytań, m.in.: czy pomaga ona w waszym stylu gry? Jak z niej korzystacie? Co chcielibyście, by była w stanie robić?",
      "[*][b]Przypisania filtra klawiszy modyfikujących[/b]. Używanie umiejętności obierających konkretny cel w chaotycznym środowisku może stanowić wyzwanie, a przypadkowe wciśnięcia mogą okazać się dewastujące. Dota 2 stara się jak najlepiej obsługiwać wasze rozkazy, ale czasami serio to wygląda tak, że chcieliście rzucić Laguna Blade na tego stwora. Ta nowa funkcja pozwala wam przypisać klawisze modyfikujące, które, po przytrzymaniu, wymuszą wybór celu między wrogami, sojusznikami, stworami lub bohaterami. Które metody obierania za cel są najbardziej i najmniej przydatne w praktyce? O czym nie pomyśleliśmy?",
      "[*][b]Pasek zdrowia waszej postaci o zwiększonej widoczności[/b]. Walki drużynowe w Dota 2 potrafią być szaleńczo zacięte i czasami w tym chaosie ciężko nadążać za położeniem waszego bohatera. Ta opcja znacząco zmienia styl i czytelność obwódki paska stanu zdrowia waszej postaci. Czy to pomaga, a może wprowadza jeszcze więcej graficznego chaosu?",
      "[/list]",
      "W pełni oczekujemy, że niektóre z tych funkcji (lub przyszłe pomysły w laboratoriach Dota) dojrzeją i doczekają się oficjalnego wydania, a inne mogą zostać wycofane. Decyzja, gdzie się co znajdzie, zależy od was.",
      "Prawdopodobnie część z was, która to czyta, cieszy się na myśl o wypróbowaniu tych nowych zabawek, ale martwi się, czy będziemy nadal ich używać w przyszłości. „Ostatnim razem, jak wprowadziliście nową rzecz związaną z grą mającą swoją konkretną nazwę, było to »Między ścieżkami« i minęło parę miesięcy odkąd ostatnio zamieściliście coś spod tego szyldu”. Macie rację! Naszym zdaniem najlepszym sposobem na zaznaczenie, że planujemy w dalszym ciągu czynić w tej kwestii długoterminowe nakłady jest czynić to samo także w tym miejscu, więc nacieszcie się również [url=https://www.dota2.com/newsentry/4115798034511159059]dzisiejszym wydaniem „Między ścieżkami”[/url]."
    ],
    "commentcount": 370,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 6419,
    "votedowncount": 1023,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1715113653,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 6419,
  "votes_down": 1023,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}