{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Aggiornamento di Dota Plus — Primavera 2024 (e i Dota Labs)",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675424
      }
    ]
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aggiornamento di Dota Plus — Primavera 2024 (e i Dota Labs)",
    "posttime": 1709684551,
    "updatetime": 1709684551,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Aggiornamento stagionale di Dota Plus[/h2]",
      "La primavera risveglia la vita intorno a noi e ci ricorda le primavere passate del team di Dota, quando il mondo era ancora giovane e dinamico. Chi mai potrebbe dimenticare l'arrampicata su quella quercia secolare vicino al ponte? O quando si rubavano carote e rape al vecchio e scontroso Fattore Maggot? O la volta in cui abbiamo portato quell'anello a Mordor per gettarlo nelle profondità ardenti del Monte Fato, dove era stato forgiato? ",
      "[h3]Tesoro stagionale di Dota Plus[/h3]",
      "Oggi l'ultima parte della nostra trilogia di ricordi primaverili è particolarmente importante, poiché sveliamo un altro tesoro inestimabile. Questa volta, però, è troppo bello per essere gettato in un vulcano. ",
      "Il tesoro stagionale della primavera 2024 è arrivato e può essere acquistato con i Frammenti. Questo tesoro contiene nuovissimi set per Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord e Nyx Assassin. Avrai anche la possibilità di sbloccare il Corriere \"Sir Molestach Irondrill\", che entrerà in corsia equipaggiato con gemme prismatiche e cinetiche casuali.",
      "Abbiamo anche reso disponibili per l'acquisto diretto nel negozio dei Frammenti, al prezzo di 15.000 Frammenti l'uno, alcuni set del Tesoro Estivo 2022 come parte di una raccolta di set meno recenti.",
      "[h3]Nuove missioni e ricompense stagionali per le gilde[/h3]",
      "L'aggiornamento di oggi include anche un nuovo insieme di missioni di Dota Plus con cui rimpinguare la propria scorta di Frammenti per acquistare nuove Reliquie e il tesoro stagionale. Potrai accumulare fino a 115.200 Frammenti nel corso della stagione. Anche le ricompense delle gilde sono state aggiornate con nuove emoticon, spray e frasi per la chat radiale, sbloccabili dalle gilde più meritevoli.",
      "[table]",
      "  [tr]",
      "    [th]Grado della gilda[/th]",
      "    [th]Ricompense[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Argento[/td]",
      "    [td][list]",
      "      [*]Emoticon: lion_bounce",
      "      [*]Emoticon: rainbow_phoenix",
      "      [*]Emoticon: riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Oro[/td]",
      "    [td][list]",
      "      [*]Spray: Spinta di Aghanim",
      "      [*]Spray: Tesori di Bounty Hunter",
      "      [*]Spray: Ghianda di Hoodwink",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platino[/td]",
      "    [td][list]",
      "      [*]Chat radiale: \"Что это?! Какая жесть!\"",
      "      [*]Chat radiale: \"Ooooh, por dios!\"",
      "      [*]Chat radiale: \"你行你行，你上你上\"",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Presentiamo i Dota Labs[/h2]",
      "Oltre ai contenuti di Dota+, l'aggiornamento di oggi introduce una serie di funzionalità sperimentali disponibili a tutti i giocatori di Dota e un nuovo modo per distribuire gli esperimenti di questo tipo: i Dota Labs (ci siamo divertiti a pensare a nomi come \"Miscugli Instabili\" e \"Invenzioni di Tinker\", ma alla fine abbiamo preferito optare per un nome chiaro e noioso e puntare tutto sulle funzionalità).",
      "Aprendo il menu delle opzioni, vedrai comparire una nuova sezione chiamata \"Dota Labs\". Qui le funzionalità sono sperimentali e meno rifinite rispetto alle altre che rilasciamo, pertanto vengono raccolte in un menu speciale e disabilitate in modo predefinito. Si tratta di funzionalità per cui i nostri test di gioco hanno prodotto dati contrastanti o ambigui. Siccome non riusciamo a stabilire come migliorarle o se sono effettivamente valide, abbiamo deciso di rilasciarle appositamente in uno stato precoce affinché i giocatori di Dota possano provarle e dirci se vale la pena continuare a svilupparle.",
      "Le funzionalità iniziali dei Dota Labs includono:",
      "[list]",
      "[*][b]Mappa sovrapposta[/b]: è un po' come la minimappa, ma è più grande, trasparente e viene mostrata a schermo intero anziché in un angolo. Abbiamo diverse domande in merito: è utile per il tuo stile di gioco? Come interagisci con questo tipo di mappa? Come ti piacerebbe migliorarla?",
      "[*][b]Tasti per filtrare i bersagli[/b]: usare le abilità su un bersaglio specifico in situazioni caotiche può rivelarsi una sfida e un clic sbagliato può essere devastante. Dota fa del suo meglio per elaborare tutti i comandi, ma a volte sembra veramente che tu voglia incenerire un creep con Lama della laguna. Questa nuova funzionalità consente di definire dei tasti che puoi tenere premuti per forzare la selezione dei bersagli a una categoria specifica (nemici, alleati, creep o Eroi). Quali metodi di selezione del bersaglio sono più e meno utili nella pratica? Ci stiamo perdendo qualcosa?",
      "[*][b]Barra della salute ad alta visibilità per il tuo Eroe[/b]: i combattimenti di squadra su Dota possono essere frenetici e talvolta è difficile tenere traccia del proprio Eroe. Questa opzione cambia in modo significativo lo stile e la leggibilità della barra della salute del tuo Eroe (e solo del tuo Eroe). Questo cambiamento è utile o rende il tutto ancora più caotico?",
      "[/list]",
      "Ci aspettiamo che alcune di queste funzionalità (o le idee future dei Dota Labs) crescano nel tempo e diventino ufficiali, mentre altre vengano rimosse del tutto. Il loro destino è nelle tue mani.",
      "Probabilmente alcuni dei nostri lettori non vedono l'ora di provare queste funzionalità, ma al contempo si chiedono se manterremo la parola e useremo i Dota Labs anche in futuro. \"L'ultima novità originale di Dota è stata la rubrica Tra le Corsie e sono passati mesi dall'ultima edizione che avete pubblicato\". Hai ragione! Riteniamo che il modo migliore per sottolineare il nostro impegno di investire a lungo termine qui sia continuare a investire a lungo termine anche lì, quindi ecco a te una nuova edizione della rubrica [url=https://www.dota2.com/newsentry/4115798034511159059]\"Tra le Corsie\"[/url]."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1709684552,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}