{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Обновление на Dota Plus — Пролет 2024 (и Dota лаборатории)",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Обновление на Dota Plus — Пролет 2024 (и Dota лаборатории)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Dota Plus сезонно обновление[/h2]",
      "Докато пролетта е в разцвет, оживявайки около нас, тя пренася всички ни от Dota 2 екипа към отминалите пролети, когато светът беше свеж и жизнен. Кой би могъл да забрави катеренето на онзи стар дъб край моста? Или краденето на моркови и репи от раздразнителния стар фермер Магот? Или отнасянето на онзи пръстен в Мордор и хвърлянето му в огнените ями на Съдбовния връх, където е бил изкован? ",
      "[h3]Dota Plus сезонно съкровище[/h3]",
      "Тази последна част от нашата пролетна трилогия със спомени е особено актуална днес, тъй като разкрихме поредното безценно съкровище. А този път е прекалено хубаво, за да бъде хвърлено във вулкан. ",
      "Сезонното съкровище за пролет 2024 е тук. Достъпно е за покупка с късове. Това съкровище включва съвсем нови набори за Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord и Nyx Assassin. Също така имате шанс да отключите куриера Sir Molestach Irondrill, който пристига в алеите, носейки произволни призматични и ефирни скъпоценни камъни.",
      "Също така взехме набори, които бяха налични в „Лятно съкровище 2022“, и ги направихме достъпни за директно закупуване в „Магазина за късове“ за 15 000 къса всеки като част от колекцията с класически набори.",
      "[h3]Обновени сезонни приключения и гилдийни награди[/h3]",
      "Днешното обновление също идва с нов набор от Dota Plus приключения, които да Ви помогнат да подсигурите инвентара си от късове за закупуването на нови реликви и сезонното съкровище. В хода на сезона можете да съберете до 115 200 къса. Гилдийните награди също бяха обновени, правейки достъпни нови емотикони, спрейове и чат рулетки за онези от тях, отбелязали високи резултати.",
      "[table]",
      "  [tr]",
      "    [th]Гилдийна поредица[/th]",
      "    [th]Награди[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Сребърна[/td]",
      "    [td][list]",
      "      [*]Емотикона — lion_bounce;",
      "      [*]Емотикона — rainbow_phoenix;",
      "      [*]Емотикона — riki_peaceout.",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Златна[/td]",
      "    [td][list]",
      "      [*]Спрей — Aghanim – Push;",
      "      [*]Спрей — Bounty Hunter – Riches;",
      "      [*]Спрей — Hoodwink – Acorn.",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Платинена[/td]",
      "    [td][list]",
      "      [*]Чат рулетка — „Что это?! Какая жесть!“;",
      "      [*]Чат рулетка — „Ooooh, por dios!“;",
      "      [*]Чат рулетка — „你行你行，你上你上“.",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Представяме Dota лаборатории[/h2]",
      "В допълнение към съдържанието за Dota+, днешното обновление представя набор от експериментални характеристики, достъпни за всички Dota 2 играчи, и нов начин за нас да доставяме подобни експерименти — Dota лаборатории. Позабавлявахме се, измисляйки имена като „Нестабилни буламачи“ и „Скалъпванията на Нескопосника“, но в крайна сметка решихме, че предпочитаме названието да е скучно и ясно, а самите характеристики да бъдат това, което ще е интересното.",
      "Ако заредите своето меню с опции, ще видите нов раздел с надписа „Dota лаборатории“. Тукашните характеристики са експериментални и не толкова безупречни, колкото много други, които доставяме. Ето защо всички те са в специално меню и по подразбиране са преустановени. Това са характеристики, при които нашите игрални изпитания са довели до смесени или двусмислени данни. Не можем наистина да разберем дали са добри, нито пък как да ги направим по-добри, без да видим как истински Dota 2 играчи да ги използват. Ето защо целенасочено ги доставяме в по-ранна форма, за да можете да ни кажете дали си струва да продължим да инвестираме в тях.",
      "Първоначалният набор от характеристики на Dota лабораториите включва:",
      "[list]",
      "[*][b]Слой с картата[/b]. Донякъде наподобява мини картата, но е голям, прозрачен и е на цял екран, вместо да е малък, плътен и изолиран в ъгъла. Имаме куп въпроси, включващи, но не и ограничени до: „Полезно ли е за Вашия игрален стил?“, „Как взаимодействате с него?“, „Какво Ви се ще да прави?“;",
      "[*][b]Филтриране на комбинациите за клавишни модификатори[/b]. Нацелването на команди в хаотични обкръжения може да бъде предизвикателно, а неправилните кликвания могат да бъдат опустошителни. Dota 2 прави всичко възможно с въвежданото от Вас, но понякога наистина изглежда така, сякаш сте искали да ползвате Laguna Blade върху някой крийп. Тази нова характеристика Ви позволява да задавате клавишни модификатори, които при задържане, ще принудят Вашето прицелване да бъде към врагове, съюзници, крийпове или герои. Кои методи за прицелване са най-много и най-малко полезни на практика? Какво пропускаме;",
      "[*][b]Локална забележима лента със здравето на героя[/b]. Отборните сражения в Dota 2 могат да бъдат трескави, а понякога в хаоса е трудно да следите своя герой. Тази опция значително променя стилизацията и отчетливостта само на табелката с името на Вашия герой. Кажете ни дали това помага или внася още повече визуален хаос?",
      "[/list]",
      "Напълно очакваме, че някои от тези характеристики (или бъдещи идеи от Dota лабораториите) ще се оформят и квалифицират напълно, докато други е възможно да бъдат оттеглени. Отсяването им ще зависи от Вас.",
      "Някои от Вас, четящи това, вероятно са развълнувани относно изпробването на тези характеристики, но се притесняват дали ще продължим да ги използваме и занапред. „Последният път, когато представихте някаква наименувана Dota 2 новост, я нарекохте „Между алеите“ и минаха доста месеци, откакто последно публикувахте нещо такова.“ Прави сте! Считаме, че най-добрият начин да отбележим, че тук планираме да продължим да инвестираме в дългосрочен план, е да сторим същото и там. Ето защо също можете да се насладите и на [url=https://www.dota2.com/newsentry/4115798034511159059]днешната публикация „Между алеите“[/url]."
    ],
    "commentcount": 352,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 4423,
    "votedowncount": 735,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1710287206,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4423,
  "votes_down": 735,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}