{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualizare Dota Plus – Primăvara 2024 (și laboratoarele Dota)",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualizare Dota Plus – Primăvara 2024 (și laboratoarele Dota)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Dota Plus — Actualizarea sezonieră[/h2]",
      "Pe măsură ce natura înflorește în jurul nostru odată cu sosirea primăverii, echipa Dota se lasă purtată de amintirile de odinioară, când lumea încă era nouă și plină de viață. Cine ar putea uita cățăratul în stejarul bătrân de lângă pod? Sau mersul la furat de morcovi și ridichi de la bătrânul fermier Maggot? Sau drumul către Mordor pentru a arunca inelul în flăcările din Muntele Osândei, locul în care a fost făurit? ",
      "[h3]Comoara de sezon Dota Plus[/h3]",
      "Această ultimă parte din trilogia amintirilor de primăvară are sens în special azi, deoarece am descoperit o altă comoară neprețuită. Care e prea bună de data asta pentru a fi aruncată într-un vulcan. ",
      "Comoara sezonieră de primăvară 2024 a sosit și poate fi achiziționată cu fragmente. Comoara aceasta conține seturi complet noi pentru Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord și Nyx Assassin. Aceasta oferă și o șansă de a obține curierul Sir Molestach Irondrill, care ajunge pe culoarele hărții cu nestemate prismatice și cinetice aleatorii.",
      "De asemenea, seturile din comoara de vară 2022 sunt disponibile acum pentru achiziție directă la prețul de 15.000 de fragmente fiecare, făcând parte din colecția de seturi clasice disponibile în magazinul cu fragmente.",
      "[h3]Actualizări pentru misiunile și recompensele de sezon ale clanurilor[/h3]",
      "Actualizarea de astăzi aduce și un set nou de misiuni pentru Dota Plus care te vor ajuta să strângi fragmente pentru noile relicve și comoara de sezon, toate acestea oferind până la 115.200 de fragmente de-a lungul sezonului. Recompensele pentru clanuri au fost actualizate, de asemenea, acum fiind disponibile noi emoticoane, grafittiuri și rotițe de chat pentru clanurile de niveluri superioare.",
      "[table]",
      "  [tr]",
      "    [th]Categoria clanului[/th]",
      "    [th]Recompense[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Argint[/td]",
      "    [td][list]",
      "      [*]Emoticon – lion_bounce",
      "      [*]Emoticon – rainbow_phoenix",
      "      [*]Emoticon – riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Aur[/td]",
      "    [td][list]",
      "      [*]Graffiti – Aghanim – Push",
      "      [*]Graffiti – Bounty Hunter – Riches",
      "      [*]Graffiti – Hoodwink – Acorn",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platină[/td]",
      "    [td][list]",
      "      [*]Rotiță de chat – „Что это?! Какая жесть!”",
      "      [*]Rotiță de chat – „Ooooh, por dios!”",
      "      [*]Rotiță de chat – „你行你行，你上你上”",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Vă prezentăm laboratoarele Dota[/h2]",
      "Pe lângă conținutul oferit pentru Dota+, actualizarea de astăzi vine și cu un set de caracteristici experimentale disponibile tuturor jucătorilor de Dota și care reprezintă pentru noi o nouă modalitate de a lansa astfel de experimente: laboratoarele Dota. (Ne-am distrat propunând nume precum „Amestecuri instabile” și „Meșteșugăriile meșteșugarului”, dar, în cele din urmă, am decis că preferăm ca numele să fie plictisitor și clar, dar caracteristicile în sine să fie interesante.)",
      "Dacă deschizi meniul de opțiuni, vei vedea o filă nouă cu eticheta „Laboratoare”. Caracteristicile de aici sunt experimentale și mai puțin rafinate decât multe alte caracteristici pe care le lansăm, ca urmare toate sunt grupate într-un meniu special și dezactivate în mod implicit. Aceste caracteristici au produs rezultate mixte sau neconcludente atunci când le-am testat în joc. Nu putem ști cu adevărat dacă sunt bune sau cum să le îmbunătățim fără a observa modul în care adevărații jucători de Dota le folosesc. Drept urmare, le lansăm într-o formă experimentală în mod intenționat, astfel încât să aflăm de la comunitate dacă aceste caracteristici merită dezvoltate în continuare.",
      "Setul inițial de caracteristici al laboratoarelor Dota include:",
      "[list]",
      "[*][b]Harta suprapusă[/b] – se aseamănă minihărții, dar este mare în loc să fie mică, transparentă în loc să fie opacă și este afișată pe tot ecranul în loc să fie izolată în colț. Avem o mulțime de întrebări, cum ar fi: „Este aceasta utilă pentru stilul tău de joc? Cum interacționezi cu ea? Ce ți-ai dori să facă?”",
      "[*][b]Asocieri pentru tastele modificatoare[/b] – comenzile de țintire în împrejurări haotice se pot dovedi dificile, iar clicurile greșite pot fi devastatoare. Dota îți interpretează cât de bine poate inputurile, dar uneori chiar pare că ai vrut să răpui cu Laguna Blade acel creep. Această nouă funcționalitate permite asocierea tastelor modificatoare astfel încât, atunci când sunt ținute apăsate, vor forța selecția țintei la inamici, aliați, creepi sau eroi. Care sunt metodele practice de țintire cele mai utile și cele mai puțin utile? Ne lipsește ceva?",
      "[*][b]Bară proeminentă de viață pentru eroul tău[/b] – confruntările dintre echipe se pot dovedi înfocate și, uneori, în haosul creat este greu să-ți urmărești eroul. Această opțiune modifică semnificativ stilul și lizibilitatea doar pentru eticheta eroului tău. Crezi că această etichetă îți este de ajutor sau doar produce mai mult haos vizual?",
      "[/list]",
      "Știm sigur că unele dintre aceste caracteristici (sau viitoarele idei din laboratoarele Dota) vor continua să se dezvolte și vor fi lansate într-o formă finală, în timp ce alte vor fi retrase. Care anume, depinde de tine.",
      "Unii dintre voi, care citiți această postare, sunteți probabil încântați să încercați aceste caracteristici, dar sunteți nedumeriți dacă vom continua să le folosim în continuare. „Ultima dată când ați introdus o chestie nouă în Dota, ați intitulat-o «Din spatele culoarelor» și au trecut câteva luni de când nu ați mai scris o astfel de postare.” Aveți dreptate! Ne-am gândit că cel mai bun mod de a demonstra că intenționăm să continuăm să depunem eforturi pe termen lung pentru acest proiect este să continuăm să realizăm același lucru și pentru rubrica „Din spatele culoarelor”, așa că iată [url=https://www.dota2.com/newsentry/4115798034511159059?l=romanian]postarea de azi „Din spatele culoarelor”[/url]."
    ],
    "commentcount": 338,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "mod_require_rereview"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 3622,
    "votedowncount": 516,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1709922508,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709760815,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 3620,
  "votes_down": 516,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}