{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização do Dota Plus – Primavera de 2024 (e Dota Labs)",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Atualização do Dota Plus – Primavera de 2024 (e Dota Labs)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Atualização sazonal do Dota Plus[/h2]",
      "Com a primavera a florescer e a ganhar vida por todo o lado, nós aqui na equipa do Dota somos transportados para as primaveras de antigamente, quando o mundo era novo e vibrante. Quem é que se poderia esquecer da sensação de trepar aquela velha árvore perto da ponte? Ou de roubar as cenouras e os nabos do bom velho Agricultor Lagarta? Ou de levar aquele anel a Mordor e largá-lo nas profundezas flamejantes do Monte da Condenação, onde foi forjado? ",
      "[h3]Tesouro sazonal do Dota Plus[/h3]",
      "Esta última parte da trilogia da nossa memória primaveril é especialmente relevante hoje, uma vez que desvendámos outro tesouro de valor inestimável. E desta vez, é demasiado bom para ser largado num vulcão. ",
      "O tesouro sazonal da primavera de 2024 já chegou e pode ser comprado com Fragmentos. Este tesouro contém conjuntos inéditos para os heróis Chaos Knight, Dark Willow, Disruptor, Doom, Earth Spirit, Nyx Assassin, Spectre e Underlord. Também tens a chance de receber o estafeta \"Sir Molestach Irondrill\", que vem pré‑equipado com joias prismáticas e etéreas aleatórias.",
      "Além disso, os conjuntos do Tesouro de Verão 2022 estão agora disponíveis para compra direta na secção de conjuntos clássicos da Loja de Fragmentos, por 15 000 Fragmentos cada.",
      "[h3]Novas missões e recompensas sazonais de clãs[/h3]",
      "A atualização de hoje também traz um novo conjunto de missões exclusivas do Dota Plus para te ajudarem a juntar até um máximo de 115 200 Fragmentos ao longo da temporada, os quais podes usar para obter novas relíquias e o tesouro sazonal. As recompensas de clãs também foram atualizadas: os clãs mais bem‑sucedidos poderão agora contar com novos emoticons, sprays e mensagens para a Chat Wheel.",
      "[table]",
      "  [tr]",
      "    [th]Patamar do clã[/th]",
      "    [th]Recompensas[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Prata[/td]",
      "    [td][list]",
      "      [*]Emoticon - lion_bounce",
      "      [*]Emoticon - rainbow_phoenix",
      "      [*]Emoticon - riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Ouro[/td]",
      "    [td][list]",
      "      [*]Spray - Aghanim - Push",
      "      [*]Spray - Bounty Hunter - Riches",
      "      [*]Spray - Hoodwink - Acorn",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platina[/td]",
      "    [td][list]",
      "      [*]Chat Wheel - \"Что это?! Какая жесть!\"",
      "      [*]Chat Wheel - \"Ooooh, por dios!\"",
      "      [*]Chat Wheel - \"你行你行，你上你上\"",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Apresentamos o Dota Labs[/h2]",
      "Para além do conteúdo do Dota Plus, a atualização de hoje inclui algumas funcionalidades experimentais e uma nova forma de as lançar: Dota Labs, já disponível para todos os jogadores do Dota 2. (Passámos um bom bocado a pensar em nomes divertidos, como \"Misturas Instáveis\" e \"As Invenções do Tinker\", mas acabámos por decidir que seria melhor se o nome fosse simples e claro. Afinal, são as funcionalidades em si que devem ser interessantes.)",
      "Ao abrir o menu das opções, poderás ver o novo separador \"Dota Labs\". As funcionalidades aqui incluídas são experimentais e menos trabalhadas do que muitas outras funcionalidades que lançamos. Por isso, estão num menu especial e desativadas como predefinição. Uma vez que são funcionalidades onde os nossos testes produziram resultados inconclusivos ou ambíguos, precisamos de as ver a ser usadas por jogadores de Dota em partidas a sério para sabermos se são úteis ou como as podemos melhorar. Portanto, vamos lançá‑las de propósito num estado beta para que jogadores como tu nos possam dizer se vale a pena continuar a desenvolvê‑las.",
      "A primeira remessa de funcionalidades do Dota Labs inclui:",
      "[list]",
      "[*][b]Mapa sobreposto[/b]: é parecido com o minimapa, mas é grande em vez de pequeno, transparente em vez de opaco e ocupa o ecrã todo em vez de estar só no canto. Temos várias perguntas, como: é útil para o teu estilo de jogo? Como interages com o mapa? O que gostarias que o mapa fizesse?",
      "[*][b]Teclas de filtragem[/b]: às vezes, pode ser um desafio usar habilidades diretamente num alvo e um clique errado pode ser devastador. O Dota faz o melhor que pode com o que pressionas, mas às vezes parece mesmo que querias incinerar aquele creep com Laguna Blade. Com esta nova funcionalidade, é possível associar teclas modificadoras que, quando pressionadas, irão forçar que apenas inimigos, aliados, creeps ou heróis sejam selecionados como alvo. Que métodos de seleção de alvos são mais e menos úteis na prática? Esquecemo‑nos de alguma coisa?",
      "[*][b]Destaque de alta visibilidade da barra de vida do teu herói[/b]: no Dota, as lutas entre equipas podem ser caóticas e, às vezes, é difícil saber onde anda o teu herói no meio da confusão. Esta opção muda significativamente o estilo e a visibilidade da barra de vida do teu herói (e apenas do teu herói). Será que é útil ou causa ainda mais confusão visual?",
      "[/list]",
      "Prevemos que algumas destas funcionalidades (ou ideias futuras do Dota Labs) amadureçam e se tornem oficiais, enquanto outras sejam removidas. Mas quais? Isso irá depender da comunidade.",
      "É possível que alguns dos nossos leitores estejam em pulgas para experimentar estas novidades, mas também a questionar‑se se continuaremos a desenvolvê‑las no futuro. \"Da última vez que vocês fizeram algo novo no Dota, deram‑lhe o nome de Entre as Lanes e já se passaram alguns meses desde a última edição.\" Bem visto! Acreditamos que a melhor forma de comprovar que pretendemos continuar a investir a longo prazo aqui é continuando a investir a longo prazo lá, então cá vai: a [url=https://www.dota2.com/newsentry/4115798034511159059]edição de hoje do Entre as Lanes[/url]."
    ],
    "commentcount": 352,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 4423,
    "votedowncount": 735,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1710287206,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4423,
  "votes_down": 735,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}