{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota Plus-opdatering: Forår 2024 (og Dota Labs)",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675424
      }
    ]
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota Plus-opdatering: Forår 2024 (og Dota Labs)",
    "posttime": 1709684551,
    "updatetime": 1709684551,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Dota Plus – årstidsopdatering[/h2]",
      "Foråret springer ud omkring os, og det får os her i Dota-teamet til at mindes forår fra fordums tid, hvor verden var ny og fuld af liv. Hvem kunne glemme dengang, man klatrede i det gamle egetræ ved broen? Eller stjal gulerødder og majroer fra Maggot, den sure gamle landmand? Eller tog ringen til Mordor og kastede den i Dommedagsbjergets brændende afgrund, hvor den blev skabt? ",
      "[h3]Årstidsskat i Dota Plus[/h3]",
      "Den sidste del af vores trilogi af forårsminder er især relevant i dag, da vi har løftet sløret for endnu en uvurderlig skat. Og denne gang er den for god til at smide i en vulkan. ",
      "Forårets årstidsskat 2024 er ude nu og kan købes med skår i skårshoppen. Denne skat indeholder helt nye sæt til Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord og Nyx Assassin. Der er også chance for at låse op for kuréren Sir Molestach Irondrill, som slutter sig til slagmarken med tilfældige prismatiske og æteriske ædelsten.",
      "Desuden kan sæt fra sommerskatten 2022 købes direkte for 15.000 skår hver som en del af samlingen med klassiske sæt i skårshoppen.",
      "[h3]Opdaterede sæsonopgaver og guild-belønninger[/h3]",
      "Dagens opdatering indeholder også et nyt sæt Dota Plus-opgaver, så du kan fylde din skårbeholdning til nye relikvier og årstidsskatten – op til 115.200 skår i løbet af sæsonen. Guild-belønninger er også blevet opdateret med nye emotikoner, sprays og chathjulsreplikker, som alt sammen er tilgængeligt for guilds med høj score.",
      "[table]",
      "  [tr]",
      "    [th]Guild-niveau[/th]",
      "    [th]Belønninger[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Sølv[/td]",
      "    [td][list]",
      "      [*]Emotikon: lion_bounce",
      "      [*]Emotikon: rainbow_phoenix",
      "      [*]Emotikon: riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Guld[/td]",
      "    [td][list]",
      "      [*]Spray: Aghanim – Push",
      "      [*]Spray: Bounty Hunter – Riches",
      "      [*]Spray: Hoodwink – Acorn",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platin[/td]",
      "    [td][list]",
      "      [*]Chathjulsreplik: \"Что это?! Какая жесть!\"",
      "      [*]Chathjulsreplik: \"Ooooh, por dios!\"",
      "      [*]Chathjulsreplik: \"你行你行，你上你上\"",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Vi introducerer Dota Labs[/h2]",
      "Ud over Dota Plus-indholdet introducerer dagens opdatering et sæt eksperimentelle funktioner, som er tilgængelige for alle Dota-spillere, samt en ny måde at udgive sådanne eksperimenter: Dota Labs. (Vi havde det sjovt med at finde på navne såsom \"Ustabile brygge\" og \"Tinkers lapperier\", men vi besluttede i sidste ende, at vi hellere ville have et kedeligt og tydeligt navn og lade selve funktionerne være det interessante).",
      "Hvis du indlæser din indstillingsmenu, vil du nu se en ny fane med Dota Labs. Funktionerne her er eksperimentelle og mindre polerede end mange andre funktioner, vi udgiver, så de ligger i en særlig menu og er deaktiveret som udgangspunkt. Dette er funktioner, hvor vores spiltest har givet blandede eller tvetydige data. Vi kan ikke rigtig vide, om de er gode, eller hvordan man gør dem bedre, uden at se rigtige Dota-spillere bruge dem, så vi udgiver dem med vilje i en tidlig udgave, så du kan fortælle os, om de er værd at fortsætte med at investere i.",
      "Det første sæt af Dota Labs-funktioner omfatter:",
      "[list]",
      "[*][b]Overlaykort[/b]. Det er lidt ligesom minikortet, men det er stort i stedet for lille, gennemsigtigt i stedet for ugennemsigtigt og vises på fuld skærm i stedet for at være isoleret i hjørnet. Vi har en helt masse spørgsmål, bl.a.: Hjælper det måden, du spiller på? Hvordan interagerer du med det? Hvad ville du ønske, det gjorde?",
      "[*][b]Filterbindinger for modificeringstaster[/b]. Angrebskommandoer i kaotiske miljøer kan være udfordrende, og fejlklik kan være katastrofale. Dota gør det bedste, det kan med dine input, men nogle gange virker det, som om du hellere ville bruge Laguna Blade mod krybet. Denne nye funktion gør det muligt at binde modificeringstaster, som tvinger målvalget til fjender, allierede, kryb eller helte, når de holdes nede. Hvilke angrebsmetoder er mest og mindst nyttige i praksis? Hvad mangler vi?",
      "[*][b]Tydelig helbredsbjælke for egen helt[/b]. Dota-holdkampe kan være hektiske, og nogle gange midt i kaosset er det svært at holde styr på din helt. Denne indstilling ændrer stilen og læsbarheden på din helts navneskilt markant. Hjælper dette, eller bliver det bare endnu mere kaotisk rent visuelt?",
      "[/list]",
      "Vi forventer, at nogle af disse funktioner (eller fremtidige idéer fra Dota Labs) vil modnes og blive udgivet, mens andre bliver lagt på hylden. Hvad, der sker med dem hver især, er op til jer.",
      "Nogle, som læser dette, er sikkert spændte på at prøve de nye funktioner, men bekymrede for, om vi vil fortsætte med at bruge dem fremover. \"Sidste gang I introducerede en ny Dota-ting, kaldte I det Mellem lanerne, og det er flere måneder siden, I sidst udgav en af dem\". Det er rigtigt! Vi tænker, at den bedste måde at vise vores planer om fortsat at investere langsigtet her, er at fortsætte med at investere langsigtet der også, så god fornøjelse med [url=https://www.dota2.com/newsentry/4115798034511159059]dagens udgave af Mellem lanerne[/url]."
    ],
    "commentcount": 2,
    "tags": [],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1709684560,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}