{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota Plus-uppdatering – våren 2024 (och Dota Labs)",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675424
      }
    ]
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota Plus-uppdatering – våren 2024 (och Dota Labs)",
    "posttime": 1709684551,
    "updatetime": 1709684551,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Dota Plus – säsongsuppdatering[/h2]",
      "Utanför fönstret slår våren ut och det får oss här i Dota-teamet att minnas barndomens vårar då världen var ny och full av liv. Hur skulle man kunna glömma när man klättrade i den gamla eken vid bron? Eller stal morötter och kålrötter från den griniga gamla bonden Maggot? Eller tog ringen till Mordor och kastade ned den i Domedagsbergets flammande avgrund där den ursprungligen hade smitts? ",
      "[h3]Säsongsskatten för Dota Plus[/h3]",
      "Den senaste delen i vårminnestrilogin är särskilt relevant idag eftersom vi har avtäckt ännu en ovärderlig skatt. Och den här gången är den för bra för att kastas bort i en vulkan. ",
      "Säsongsskatten för våren 2024 är här och kan köpas med skärvor. Skatten innehåller alla nya set för Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord och Nyx Assassin. Det finns också en chans att låsa upp kuriren Sir Molestach Irondrill som anländer på vägarna med diverse prismatiska och eteriska ädelstenar.",
      "Dessutom kan set från sommarskatten 2022 köpas för 15 000 skärvor styck som en del av samlingen med klassiska set i skärvbutiken.",
      "[h3]Uppdaterade uppdrag och gillesbelöningar för säsongen[/h3]",
      "Dagens uppdatering levereras med en ny uppsättning Dota Plus-uppdrag så att du kan håva in extra skärvor för nya reliker och säsongsskatten – upp till 115 200 skärvor kan tjänas in under hela säsongen. Gillesbelöningarna har också uppdaterats, vilket gör nya uttryckssymboler, sprejer och chatthjul tillgängliga för gillen med höga poäng.",
      "[table]",
      "  [tr]",
      "    [th]Gillesnivå[/th]",
      "    [th]Belöningar[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Silver[/td]",
      "    [td][list]",
      "      [*]Uttryckssymbol – lion_bounce",
      "      [*]Uttryckssymbol – rainbow_phoenix",
      "      [*]Uttryckssymbol – riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Guld[/td]",
      "    [td][list]",
      "      [*]Sprej – Aghanim – Push",
      "      [*]Sprej – Bounty Hunter – Riches",
      "      [*]Sprej – Hoodwink – Acorn",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platina[/td]",
      "    [td][list]",
      "      [*]Chatthjul – ”Что это?! Какая жесть!”",
      "      [*]Chatthjul – ”Ooooh, por dios!”",
      "      [*]Chatthjul – ”你行你行，你上你上”",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Vi presenterar Dota Labs[/h2]",
      "Utöver innehållet till Dota Plus introducerar dagens uppdatering en uppsättning experimentella funktioner som finns tillgängliga för alla Dota-spelare, samt ett nytt sätt för oss att leverera liknande experiment: Dota Labs. (Vi hade roligt när vi hittade på namn som ”Unstable Concoctions” och ”Tinker's Tinkerings”, men i slutändan insåg vi att vi hellre vill ha ett tråkigt, tydligt namn och låta själva funktionerna vara det intressanta.)",
      "I inställningsmenyn finns det en ny flik som heter Dota Labs. Funktionerna där är experimentella och inte lika fulländade som många andra funktioner som vi levererar. Det är därför de finns i en specialmeny och är inaktiverade som standard. De här funktionerna har gett blandade och tvetydiga data i speltesterna. Vi har svårt att avgöra om de är bra och hur vi kan göra dem bättre utan att se riktiga Dota-spelare använda dem. Därför ger vi avsiktligt ut dem i en tidig utgåva så att ni kan berätta för oss om det är värt att fortsätta att lägga ned tid på dem.",
      "Den första uppsättningen Dota Labs-funktioner innehåller:",
      "[list]",
      "[*][b]En överläggskarta[/b]. Det är som en minikarta, men den är stor istället för liten, genomskinlig istället för solid och i helskärm istället för att vara isolerad i hörnet. Vi har en massa frågor, till exempel: Är den till hjälp för sättet du spelar på? Hur interagerar du med den? Vad önskar du att den kunde göra?",
      "[*][b]Filterbindningar för modifieringsnycklar[/b]. Att rikta kommandon i kaotiska miljöer kan vara utmanande och felklick kan vara förödande. Dota gör sitt bästa med dina inmatningar, men ibland verkar det verkligen som att du ville använda Laguna Blade på creepet. Med den nya funktionen kan du binda modifieringsnycklar, som tvingar målvalet till fiender, allierade, creeps eller hjältar när de hålls ned. Vilka riktningsmetoder är mest och minst användbara i praktiken? Vad har vi missat?",
      "[*][b]Tydlig hälsomätare för egen hjälte[/b]. Dota-lagkamper kan vara hektiska, och ibland kan det vara svårt hålla koll på din hjälte mitt i allt kaos. Det här alternativet ändrar stilen och läsbarheten på hjältens namnskylt avsevärt. Hjälper det eller leder det till ännu mer visuellt kaos?",
      "[/list]",
      "Vi förväntar oss att vissa av funktionerna (eller framtida Dota Labs-idéer) kommer att mogna och lanseras medan andra kanske sätts på hyllan. Det är upp till er vad som sker med dem.",
      "En del av er som läser det här ser förmodligen fram emot att prova på de nya funktionerna, men ni kanske oroar er över om vi kommer att fortsätta att använda dem framöver. ”Den senaste gången ni presenterade en ny namngiven Dota-grej kallade ni den Mellan striderna, och det har gått några månader sedan ni senast lade upp en sådan.” Det stämmer! Vi tror att det bästa sättet att visa att vi planerar att fortsätta att investera långsiktigt här är genom att investera långsiktigt även där, så ha så kul med [url=https://www.dota2.com/newsentry/4115798034511159059]dagens Mellan striderna[/url]."
    ],
    "commentcount": 2,
    "tags": [],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1709684560,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}