{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota Plusz frissítés – 2024. tavasz (és a Dota Labor)",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota Plusz frissítés – 2024. tavasz (és a Dota Labor)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Dota Plusz szezonális frissítés[/h2]",
      "Ahogy a tavasz virágba borít és életre kelt mindent körülöttünk, minket itt a Dota csapatnál a hajdani tavaszokhoz repített vissza, amikor a világ új és élénk volt. Ki tudná elfelejteni, hogy felmásztunk arra az öreg tölgyfára a híd mellett? Vagy hogy répát loptunk az öreg, házsártos Zsizsik gazdától? Vagy hogy elvittük azt a gyűrűt Mordorba, és behajítottuk a Végzet Hegyének tüzes mélyébe, ahol kovácsolták? ",
      "[h3]Dota Plusz Szezonális Kincs[/h3]",
      "Tavaszi emlékezettrilógiánk ezen utolsó része ma különösen releváns, mivel felfedtünk egy újabb felbecsülhetetlen értékű kincset. Ez viszont túl jó ahhoz, hogy egy vulkánba dobjuk. ",
      "Megérkezett a 2024-es Tavaszi Szezonális Kincs, és szilánkokért megvásárolható. Ez a kincs vadonatúj szetteket tartalmaz Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord és Nyx Assassin számára. Esélyt ad továbbá Vakondok Úr, a Vasfúró futár feloldására, aki véletlenszerű színjátszó és kinetikus ékkövekkel felpakolva érkezik a vonalakra.",
      "Továbbá a Nyári Kincs 2022-ben szereplő szetteket elérhetővé tettük közvetlen megvásárlásra, egyenként 15 000 szilánkért a Szilánkboltban, a hagyományos szettek gyűjteményének részeként.",
      "[h3]Frissített szezonális küldetések és céhjutalmak[/h3]",
      "A mai frissítéssel új adag Dota Plusz küldetés is érkezik, hogy segítsen bezsákolni némi plusz szilánkot új relikviákhoz és a szezonális kincshez, akár 115 200 szilánkot kínálva a szezon során. A céhjutalmak is frissítésre kerültek, új hangulatjeleket, festéseket és csevegőkorongokat téve elérhetővé a magas pontszámot elérő céheknek.",
      "[table]",
      "  [tr]",
      "    [th]Céhszint[/th]",
      "    [th]Jutalmak[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Ezüst[/td]",
      "    [td][list]",
      "      [*]Hangulatjel: lion_bounce",
      "      [*]Hangulatjel: rainbow_phoenix",
      "      [*]Hangulatjel: riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Arany[/td]",
      "    [td][list]",
      "      [*]Festés: Aghanim – Tolás",
      "      [*]Festés: Bounty Hunter – Gazdagság",
      "      [*]Festés: Hoodwink – Makk",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platina[/td]",
      "    [td][list]",
      "      [*]Csevegőkorong: „Что это?! Какая жесть!”",
      "      [*]Csevegőkorong: „Ooooh, por dios!”",
      "      [*]Csevegőkorong: „你行你行，你上你上”",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Bemutatjuk a Dota Labort[/h2]",
      "A Dota Plusz tartalom mellett a mai frissítés bemutat egy sor, minden Dota játékosnak elérhető kísérleti funkciót, valamint az ehhez hasonló kísérletek kiadására egy új módot is: a Dota Labort. (Jól elszórakoztunk az olyan nevekkel, mint az „Instabil főzetek” és a „Bütykölő bütykölményei”, de végül úgy döntöttünk, hogy a név legyen inkább unalmas és érthető, és maguk a funkciók legyenek érdekesek.)",
      "Ha megnyitod a Beállítások menüdet, látni fogsz egy új fület a „Dota Labor” címkével. Az itt levő funkciók kísérleti jellegűek, és sok más általunk kiadott funkciónál kevésbé csiszoltak, ezért mind egy külön menüben vannak, és alapértelmezetten ki vannak kapcsolva. Ezek olyan funkciók, amelyeknél a játéktesztelésünk vegyes vagy nem egyértelmű adatokat eredményezett. Nem igazán tudjuk, hogy jók-e, vagy hogyan lehetne jobbá tenni őket anélkül, hogy valódi Dota játékosokat látnánk használni azokat, ezért szándékosan egy korábbi formában adjuk ki e funkciókat, hogy elmondhassátok nekünk, érdemes-e további erőfeszítéseket fektetni beléjük.",
      "A Dota Labor funkcióinak kezdeti készlete a következőket tartalmazza:",
      "[list]",
      "[*][b]Átfedő térkép[/b]: Olyasmi, mint a minitérkép, csak kicsi helyett nagy, átlátszatlan helyett átlátszó, és teljes képernyős, ahelyett, hogy a sarokba lenne korlátozva. Van egy csomó kérdésünk, beleértve, de nem kizárólagosan: Hasznos-e a játékstílusodhoz? Milyen módon használod? Milyen működést szeretnél tőle?",
      "[*][b]Módosítóbillentyűk szűrésének kiosztása[/b]: A parancsok kaotikus környezetben történő célzása nagy kihívást jelenthet, a félrekattintások pedig pusztító hatással bírhatnak. A Dota amit csak lehet, megtesz a beviteleiddel, de néha tényleg úgy néz ki, mintha a Laguna Blade-et akartad volna használni azon a creepen. Ez az új funkció lehetővé teszi olyan módosítóbillentyűk kiosztását, amelyek nyomva tartása esetén ellenségekre, szövetségesekre, creepekre vagy hősökre lesz kényszerítve a célpontválasztásod. Mely célzási módok a leginkább és a legkevésbé hasznosak a gyakorlatban? Mit hagytunk ki?",
      "[*][b]Nagy láthatóságú, helyi hős-életerőcsík[/b]: A Dota csapatharcok hektikusak lehetnek, és néha nehéz nyomon követni hősödet a káoszban. Ez a beállítás jelentősen megváltoztatja a te hősöd életerőcsíkjának stílusát és kivehetőségét. Segít ez, vagy még nagyobb vizuális káoszt okoz?",
      "[/list]",
      "Teljes mértékben arra számítunk, hogy e funkciók (vagy a jövőbeni Dota Labor ötletek) némelyike ​​bekerül majd a játékba, míg másokat kivezetünk. Hogy melyikkel mi lesz, az tőletek függ.",
      "Néhányan közületek ezt olvasva valószínűleg izgatottan várják, hogy kipróbálhassák e funkciókat, de aggódnak amiatt, hogy a továbbiakban is használni fogjuk-e őket. „A legutóbbi alkalommal, amikor bemutattatok egy új, nevesített Dota dolgot, az a Vonalak közt nevet kapta, és már jó néhány hónapja nem tettetek közzé belőle.” Igazatok van! Úgy gondoljuk, a legjobb módja annak, hogy megmutassuk, továbbra is hosszú távon tervezünk ezzel, az az, ha folytatjuk a hosszú távú befektetéseket annak kapcsán is, szóval élvezzétek a [url=https://www.dota2.com/newsentry/4115798034511159059]mai Vonalak közt bejegyzést[/url] is."
    ],
    "commentcount": 370,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 6419,
    "votedowncount": 1023,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1715113653,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 6419,
  "votes_down": 1023,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}