{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota Plus Güncellemesi— 2024 Bahar (ve Dota Laboratuvarı)",
  "event_type": 13,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota Plus Güncellemesi— 2024 Bahar (ve Dota Laboratuvarı)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Dota Plus Mevsimsel Güncellemesi[/h2]",
      "Bahar her yerde çiçek açıp canlanırken, Dota ekibini de dünyanın yeni ve canlı olduğu eski baharlara götürüyor. Köprünün yanındaki yaşlı meşe ağacına tırmandığını kim unutabilir ki? Ya da huysuz çiftçi Maggot'tan havuç ve şalgam çaldığını? Ya da o yüzüğü Mordor'a götürüp, dövüldüğü Hüküm Dağı'nın kıyamet çatlağına attığını? ",
      "[h3]Dota Plus Mevsimsel Hazinesi[/h3]",
      "Bu bahar üçlemesinin hafızamızdaki son bölümü, bugün paha biçilmez bir hazineyi daha keşfetmemiz açısından ayrı bir önem taşıyor. Ve bu sefer bir yanardağın içine atılmayacak kadar iyi. ",
      "2024 Bahar Mevsimsel Hazinesi çıktı ve parçalarınızı kullanarak hazineyi satın alabilirsiniz. Bu hazine, Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord ve Nyx Assassin için tamamen yeni setler içeriyor. Ayrıca kulvarlara rastgele prizmatik ve ruhani taşlarla kuşanmış şekilde gelen Sir Molestach Irondrill kuryesini elde etme şansınız da vardır.",
      "Ayrıca 2022 Yaz Hazinesi'nde bulunan setleri de Parça Dükkânı'na koyarak kadim setler koleksiyonunun bir parçası olarak her birini 15.000 parça karşılığında doğrudan satın alınabilir hâle getirdik.",
      "[h3]Güncellenmiş Mevsimsel Görevler ve Lonca Ödülleri[/h3]",
      "Bugünkü güncelleme aynı zamanda parça zulanızı zenginleştirmek için bir dizi yeni Dota Plus görevini de beraberinde getiriyor. Bu görevler sayesinde yadigârlar ve mevsimsel hazine için sezon boyunca toplam ilave 115.200 parça kazanabileceksiniz. Lonca ödülleri de güncellendi ve yüksek skor toplayan loncalara yeni ifadeler, spreyler ve sohbet çarkı replikleri elde etme şansı veriyor.",
      "[table]",
      "  [tr]",
      "    [th]Lonca Sınıfı[/th]",
      "    [th]Ödüller[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Gümüş[/td]",
      "    [td][list]",
      "      [*]İfade - lion_bounce",
      "      [*]İfade - rainbow_phoenix",
      "      [*]İfade - riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Altın[/td]",
      "    [td][list]",
      "      [*]Sprey - Aghanim - İttir",
      "      [*]Sprey - Bounty Hunter - Servet",
      "      [*]Sprey - Hoodwink - Palamut",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platin[/td]",
      "    [td][list]",
      "      [*]Sohbet Çarkı - \"Что это?! Какая жесть!\"",
      "      [*]Sohbet Çarkı - \"Ooooh, por dios!\"",
      "      [*]Sohbet Çarkı - \"你行你行，你上你上\"",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Karşınızda Dota Laboratuvarı[/h2]",
      "Dota+ içeriğine ek olarak, bugünkü güncelleme tüm Dota oyuncularına bir dizi deneysel özellik ve yeni deneyleri yapabilmemiz için yeni bir yol sunuyor: Dota Laboratuvarı. (“Dengesiz Karışımlar” ve “Tinker'ın Tamiratları” gibi isimler koymayı düşünerek eğlendik ama nihayetinde adın sıkıcı ve net olmasını ve özelliklerin ilginç olmasın gerektiğine karar verdik.)",
      "Ayarlar menüsünü açtığınızda Dota Labs etiketine sahip yeni bir sekme bulacaksınız. Buradaki özellikler deneyseldir ve yayınladığımız diğer özelliklere göre daha az test edilmiştir. Dolayısıyla hepsi özel bir menüdedir ve varsayılan olarak devre dışıdır. Bunlar, oyun testlerimizin bize karışık veya belirsiz veriler verdiği özelliklerdir. Gerçek Dota oyuncularının bu özellikleri kullandığını görmeden bunların iyi olup olmadığını veya nasıl daha iyi hâle getirebileceğimizi bilmiyoruz. Bu yüzden onları bilerek geliştirme aşamasındaki sürümlerinde yayınlıyoruz; böylece üzerinde çalışmaya değer olup olmadıklarını bize söyleyebilirsiniz.",
      "Dota Laboratuvarı özelliklerinin ilk bölümü şunları içerir:",
      "[list]",
      "[*][b]Arayüz Haritası[/b]. Bir bakıma mini haritaya benziyor; ancak küçük ve opak olmak yerine büyük ve şeffaf, köşede sabit olması yerine tam ekran bir biçimde. Bunları da içeren bir dizi soruya yanıt arıyoruz: Oyun tarzınız için yararlı mı? Nasıl etkileşime giriyorsunuz? Ne yapmasını isterdiniz?",
      "[*][b]Özel Hedef Tuşu Ataması[/b]. Kaotik ortamlarda hedefleme komutlarını kullanmak zor olabilir ve yanlış tıklamalar felâketle sonuçlanabilir. Dota, girdilerinizle elinden gelenin en iyisini yapmakta; ancak bazen gerçekten o yaratığa bir Laguna Blade göndermek istiyormuşsunuz gibi görünüyor. Bu yeni özellik tuşa basılı tutulduğunda hedefleme seçiminizi düşmanlar, dostlar, yaratıklar veya kahramanlarla sınırlı olmaya zorlayacak şekilde belirleyebilir. Hangi hedefleme yöntemleri oyunda daha çok veya daha az yararlı? Bir şey mi unuttuk?",
      "[*][b]Belirgin Kahraman Sağlık Çubuğu[/b]. Dota'daki takım savaşları yoğun olabilir ve bazen kaosun içinde kahramanınızı takip etmek de zor olabilir. Bu seçenek, sadece sizin kahramanınızın adının stilini ve okunabilirliğini önemli ölçüde değiştirir. Bu size faydalı oldu mu yoksa daha fazla kaosa mı yol açtı?",
      "[/list]",
      "Bu özelliklerden bazılarının (veya gelecekteki Dota Laboratuvarı fikirlerinin) olgunlaşıp oyuna eklenmesini, diğerlerinin ise kullanımdan kaldırılmasını bekliyoruz. Bu da size bağlı.",
      "Bunu okuyan bazılarınız bu yeni özellikleri denemeye hevesliyken aynı zamanda bunları gelecekte geliştirmeye devam edip etmeyeceğimiz konusunda endişeli olabilir. Bazılarınız \"Dota'da en son yeni bir şey yaptığınızda buna Kulvarlar Arası adını vermiştiniz ve son gönderinin üzerinden aylar geçti.\" diyebilir. Haklısınız! Burada uzun vadeli yatırım yapmaya devam etme niyetinde olduğumuzu kanıtlamanın en iyi yolunun o seride de uzun vadeli yatırım yapmak olduğunu düşündük. Bu nedenle [url=https://www.dota2.com/newsentry/4115798034511159059]bugünkü Kulvarlar Arası[/url] gönderisinin tadını çıkarın."
    ],
    "commentcount": 370,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 6419,
    "votedowncount": 1023,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1715113653,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 6419,
  "votes_down": 1023,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}