{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualización de Dota Plus — Primavera de 2024 (y Dota Labs)",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualización de Dota Plus — Primavera de 2024 (y Dota Labs)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Actualización estacional de Dota Plus[/h2]",
      "Mientras que la primavera cobra vida a nuestro alrededor, nos transporta aquí, en el equipo de Dota, a los manantiales de antaño, cuando el mundo era lindo y estaba lleno de vida. ¡Cómo olvidar cuando nos trepábamos a ese árbol viejo cerca del puente! ¿O cuando se robaban las zanahorias y nabos de aquel viejito granjero cascarrabias? ¿O llevar ese anillo a Mordor para aventarlo en las fosas ardientes del Monte del Destino donde se forjó? ",
      "[h3]Tesoro estacional de Dota Plus[/h3]",
      "Esa última parte de nuestra trilogía de recuerdos primaverales es especialmente relevante el día de hoy, ya que damos a conocer otro tesoro invaluable. Y en esta ocasión, es demasiado bueno para irlo a aventar a un volcán. ",
      "El Tesoro estacional de primavera 2024 está aquí y está disponible para su compra con fragmentos. Este tesoro cuenta con sets completamente nuevos para Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord y Nyx Assassin. También hay una oportunidad para desbloquear al mensajero, Sir Molestach Irondrill, quien se da la vuelta por las sendas con gemas prismáticas y etéreas.",
      "También retomamos sets que estuvieron disponibles en el Tesoro de verano de 2022 y los pusimos a tu disposición para su compra directa a 15 000 fragmentos cada uno como parte de la colección de sets heredados en la Tienda de fragmentos.",
      "[h3]Actualización de misiones estacionales y recompensas de clan[/h3]",
      "La actualización de hoy también incluye un nuevo set de misiones de Dota Plus, que te ayudarán a reforzar tu reserva de fragmentos para obtener nuevas reliquias y el tesoro estacional, con la posibilidad de obtener hasta 115 200 fragmentos durante toda la temporada. Las recompensas de clan también se actualizaron: los clanes que tengan la puntuación más alta podrán disfrutar de nuevos emoticonos, aerosoles y ruedas de chat.",
      "[table]",
      "  [tr]",
      "    [th]Niveles de clan[/th]",
      "    [th]Recompensas[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Plata[/td]",
      "    [td][list]",
      "      [*]Emoticono - lion_bounce",
      "      [*]Emoticono - rainbow_phoenix",
      "      [*]Emoticono - riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Oro[/td]",
      "    [td][list]",
      "      [*]Aerosol - Aghanim - Presionar",
      "      [*]Aerosol - Bounty Hunter - Riquezas",
      "      [*]Aerosol - Hoodwink - Bellotazo",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platino[/td]",
      "    [td][list]",
      "      [*]Rueda de chat - \"Что это?! Какая жесть!\"",
      "      [*]Rueda de chat - \"Ooooh, por dios!\"",
      "      [*]Rueda de chat - \"你行你行，你上你上\"",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Presentamos Dota Labs[/h2]",
      "Además del contenido de Dota Plus, con la actualización de hoy presentamos un conjunto de características experimentales, que estarán disponibles para todos los jugadores de Dota y nos permitirán seguir lanzando experimentos entre esos, Dota Labs. (Nos divertimos mucho inventando nombres como “Brebajes inestables” y “Chatarrería de Tinker”, pero finalmente decidimos que preferiríamos que el nombre fuera aburrido y claro y que las características en sí fueran interesantes).",
      "Si abres tu menú de opciones, verás una nueva pestaña llamada \"Dota Labs\". Las características aquí son experimentales y menos refinadas que otras que hemos lanzado, por lo que todas están en un menú especial y están deshabilitadas de manera predeterminada. Estas son características en las que nuestras pruebas de juego produjeron datos mixtos o ambiguos. Realmente no podemos saber si son buenas o cómo mejorarlas sin ver a jugadores reales de Dota usándolas, por lo que las estamos lanzando antes de tiempo a propósito para que puedan comentarnos si vale la pena continuar invirtiendo en ellas.",
      "El conjunto inicial de características de Dota Labs incluye:",
      "[list]",
      "[*][b]Mapa superpuesto[/b]. Es parecido al minimapa, pero es grande en lugar de pequeño, y transparente en lugar de opaco, y abarca toda la pantalla completa en vez de estar aislado en la esquina. Tenemos varias preguntas, que incluyen, entre otras: ¿Te resulta útil para tu estilo de juego? ¿Cómo lo usas? ¿Qué quisieras que haga?",
      "[*][b]Filtrado de teclas modificadoras vinculadas[/b]. Los comandos para marcar objetivos en un entorno caótico es todo un reto y hacer clic en el sitio equivocado puede ser devastador. Dota hace lo mejor que puede con tus entradas, pero a veces realmente parece que quieres matar a ese creep con Hoja de Laguna. Esta nueva característica nos permite vincular teclas modificadoras, de manera en que cuando se mantienen presionadas, obligarán a tu objetivo a seleccionar enemigos, aliados, creeps o héroes. ¿Cuáles son los métodos más y menos útiles en práctica? ¿Qué nos falta?",
      "[*][b]Barra de vida de tu héroe más visible[/b]. Las peleas en equipo de Dota pueden ser caóticas y, a veces, cuesta trabajo seguirle la pista a tu héroe. Esta opción cambia de manera significativa el estilo y la legibilidad de la placa identificativa de tu héroe. ¿Esto ayuda o crea todavía más caos a nivel visual?",
      "[/list]",
      "Esperamos que algunas de estas características (o ideas futuras para Dota Labs) maduren y sean lanzadas por completo, mientras que otras podrían ser retiradas. Esto depende de ti.",
      "Algunos de ustedes que están leyendo esto estén probablemente emocionados al probar estas características, pero también preocupados sobre si continuaremos usándolas en un futuro. Estamos consientes que pasó algo similar la última vez que presentamos algo nuevo en Dota, llamado \"Entre las sendas\", y ya pasaron varios meses desde la última vez que hicimos algo así. ¡Es cierto! Creemos que la mejor manera de demostrar que planeamos seguir invirtiendo a largo plazo aquí es seguir invirtiendo a largo plazo también por allá, así que disfruta también de [url=https://www.dota2.com/newsentry/4115798034511159059]Entre las sendas[/url], ya disponible."
    ],
    "commentcount": 352,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 4423,
    "votedowncount": 735,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1710287206,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4423,
  "votes_down": 735,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}