{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Mise à jour de Dota Plus du printemps 2024 (et Dota Labs)",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675424
      }
    ]
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mise à jour de Dota Plus du printemps 2024 (et Dota Labs)",
    "posttime": 1709684551,
    "updatetime": 1709684551,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Dota Plus : mise à jour saisonnière[/h2]",
      "La nature est en fleurs et les oiseaux gazouillent ! Pour nous, à l'équipe Dota, le printemps nous ramène à de très lointains souvenirs, lorsque le monde était encore neuf et débordant de vie. Comment oublier ces fois où l'on grimpait au vieux chêne près du pont ? Comment oublier ces vols de carottes et de navets au vieux père Maggotte ? Comment oublier ce long voyage vers le Mordor pour y jeter cette bague dans la fosse ardente du Mont Destin où elle fut forgée ? ",
      "[h3]Trésor saisonnier de Dota Plus[/h3]",
      "Ce dernier volet de notre trilogie sur les souvenirs printaniers est particulièrement pertinent aujourd'hui, car un autre trésor inestimable vient d'être découvert. Et cette fois-ci, il est bien trop beau pour être jeté dans un volcan. ",
      "Le trésor du printemps 2024 est là. Il est disponible à l'achat avec des fragments. Ce trésor contient de tout nouveaux ensembles pour Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord et Nyx Assassin. Avec un peu de chance, vous pourrez peut-être obtenir le coursier « Taupiforeur », qui trottine dans les lanes apportant gemmes éthérées et prismatiques aléatoires.",
      "Nous avons aussi repris des ensembles du trésor de l'été 2022 pour les proposer directement à l'achat au prix de 15 000 fragments chacun. Ils sont compris dans la collection des anciens ensembles de la boutique des fragments.",
      "[h3]Mise à jour des quêtes saisonnières et des récompenses de guilde[/h3]",
      "La mise à jour d'aujourd'hui comprend également de nouvelles quêtes pour les membres de Dota Plus pour vous aider à faire grossir votre butin. Obtenez jusqu'à 115 200 fragments tout au long de la saison pour acheter le nouveau trésor et les nouvelles reliques. Les récompenses de guilde ont également été mises à jour : de nouveaux graffitis, émoticônes et répliques seront accordés aux membres des guildes en haut du classement.",
      "[table]",
      "  [tr]",
      "    [th]Niveau de guilde[/th]",
      "    [th]Récompenses[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Argent[/td]",
      "    [td][list]",
      "      [*]Émoticône : lion_bounce",
      "      [*]Émoticône : rainbow_phoenix",
      "      [*]Émoticône : riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Or[/td]",
      "    [td][list]",
      "      [*]Graffiti : push d'Aghanim",
      "      [*]Graffiti : jackpot de Bounty Hunter",
      "      [*]Graffiti : gland de Hoodwink",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platine[/td]",
      "    [td][list]",
      "      [*]Réplique : « Что это?! Какая жесть! »",
      "      [*]Réplique : « Ooooh, por dios! »",
      "      [*]Réplique : « 你行你行，你上你上 »",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Arrivée de Dota Labs[/h2]",
      "Outre le contenu de Dota Plus, la mise à jour d'aujourd'hui offre un ensemble de fonctionnalités expérimentales disponibles à tout le monde, et une nouvelle façon pour nous de proposer des expériences comme celles-ci : Dota Labs. (L'équipe s'est bien amusée à essayer de trouver des titres, comme « Concoctions instables », ou encore « Bricoles du bricoleur ». Mais nous avons finalement décidé qu'il valait mieux avoir un nom ennuyeux et clair, et que les fonctionnalités soient intéressantes.)",
      "Si vous ouvrez le menu des options, vous y verrez un nouvel onglet avec l'étiquette « Dota Labs ». Les fonctionnalités qui y sont proposées restent expérimentales et moins abouties que celles qui sont publiées dans les mises à jour. Elles se trouvent donc toutes dans un menu spécial et sont désactivées par défaut. Ces fonctionnalités ont eu des résultats mitigés, voire ambigus, lors de nos tests de jeu. Nous ne pouvons pas vraiment établir leur valeur ou les améliorer sans observer de vraies personnes les utiliser. Elles vous sont donc livrées dans leur forme expérimentale afin que vous puissiez nous dire si elles méritent un investissement plus poussé de notre part.",
      "Ce premier ensemble de Dota Labs comprend les fonctionnalités suivantes.",
      "[list]",
      "[*][b]La carte superposée[/b]. C'est un peu comme la minicarte, mais celle-ci est grande, transparente et en plein écran. Nombreuses sont nos questions à son sujet, y compris, mais sans s'y limiter : est-elle adaptée à votre façon de jouer ? Comment l'utilisez-vous ? Quelles fonctionnalités aimeriez-vous voir ajoutées ?",
      "[*][b]Association de filtres aux touches de raccourci[/b]. Trouver rapidement ses commandes au cœur de la tourmente peut être difficile, et les erreurs de clic peuvent être dévastatrices. Dota interprète au mieux vos entrées… mais vouliez-vous vraiment occire ce creep avec Laguna Blade ? Cette nouvelle fonctionnalité vous permet de définir des touches de raccourci qui, lorsqu'elles sont maintenues appuyées, forcent la sélection de votre choix à des unités ennemies ou alliées, à des creeps ou à d'autres unités héroïques. Quelles méthodes de sélection sont les plus ou les moins utiles en pratique ? Que manque-t-il à cette option ?",
      "[*][b]Barre de vie ultravisible de l'unité héroïque[/b]. Les combats dans Dota peuvent être mouvementés, et, dans la panique, il est parfois difficile de suivre votre unité héroïque. Le style et la lisibilité de son étiquette se démarqueront clairement des autres unités grâce à cette option. Cela vous est-il utile, ou bien au contraire, cela est-il source d'un chaos visuel encore plus dense ?",
      "[/list]",
      "Nous pensons que certaines de ces fonctionnalités (comme toute future idée de Dota Labs) seront adoptées une fois arrivées à maturité, tandis que d'autres seront supprimées. C'est à vous que revient ce choix.",
      "Peut-être y en a-t-il parmi vous qui sont enthousiastes à l'idée d'essayer ces fonctionnalités, mais se demandent si elles continueront à être utilisées à l'avenir. « La dernière fois que vous avez présenté une nouvelle rubrique associée à Dota, vous l'avez appelé \"Entre les lanes\", et cela fait quelques mois qu'on n'a rien vu de nouveau. » Vous avez raison ! La meilleure façon de montrer que l'équipe souhaite continuer à investir sur le long terme pour ce projet est de continuer à faire de même pour « Entre les lanes ». Aussi, n'hésitez pas à jeter un œil à [url=https://www.dota2.com/newsentry/4115798034511159059]l'article du jour correspondant[/url]."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1709684552,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}