{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota Plus: update voor lente 2024 (en Dota Labs)",
  "event_type": 13,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota Plus: update voor lente 2024 (en Dota Labs)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Seizoensupdate voor Dota Plus[/h2]",
      "Terwijl de lente om ons heen ontluikt, worden wij hier bij Dota teruggevoerd naar de lentes van weleer, toen de wereld nog pril en vol beloften was. We zullen nooit vergeten hoe we altijd in die oude eik bij de brug klommen. Of hoe we wortels en rapen stalen van die chagrijnige oude boer Van der Made. Of weet je nog toen we die ring terugbrachten naar Mordor en hem in het vuur van de Doemberg gooiden om hem te vernietigen in het vuur waarin hij was gesmeed? ",
      "[h3]Seizoensschat voor Dota Plus[/h3]",
      "Vooral dat laatste gedeelte van onze trilogie aan voorjaarsherinneringen is vandaag van belang, want we hebben nóg een onbetaalbare schat ontdekt. En deze keer is de schat te waardevol om in een vulkaan te mikken. ",
      "De seizoensschat voor de lente van 2024 kan nu met fragmenten worden gekocht. Deze schat bevat gloednieuwe sets voor Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord en Nyx Assassin. Bovendien maak je kans om Sir Molestach Irondrill te ontgrendelen, een koerier die over de paden zwerft met een hele vracht prismatische en etherische juwelen.",
      "De sets van de seizoensschat van de zomer van 2022 zijn nu als onderdeel van een verzameling klassieke sets rechtstreeks te koop in de fragmentenwinkel voor 15.000 fragmenten per stuk.",
      "[h3]Bijgewerkte seizoensquests en guildbeloningen[/h3]",
      "De update van vandaag bevat ook een nieuwe set quests voor Dota Plus om je te helpen wat extra fragmenten voor nieuwe relikwieën en de seizoensschat bij elkaar te sprokkelen. Tot het eind van het seizoen kun je zo tot wel 115.200 fragmenten verdienen. De guildbeloningen zijn ook bijgewerkt, met nieuwe emoticons, graffiti en chatwielen voor hoog scorende guilds.",
      "[table]",
      "  [tr]",
      "    [th]Guildrang[/th]",
      "    [th]Beloningen[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Zilver[/td]",
      "    [td][list]",
      "      [*]Emoticon: lion_bounce",
      "      [*]Emoticon: rainbow_phoenix",
      "      [*]Emoticon: riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Goud[/td]",
      "    [td][list]",
      "      [*]Graffiti: Aghanim - Push",
      "      [*]Graffiti: Bounty Hunter - Riches",
      "      [*]Graffiti: Hoodwink - Acorn",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platina[/td]",
      "    [td][list]",
      "      [*]Chatwiel: 'Что это?! Какая жесть!'",
      "      [*]Chatwiel: 'Ooooh, por dios!'",
      "      [*]Chatwiel: '你行你行，你上你上'",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Maak kennis met Dota Labs[/h2]",
      "Naast alle nieuwe inhoud voor Dota+ krijg je met deze update ook een hele reeks nieuwe experimentele functies die alle Dota-spelers kunnen gebruiken, én een nieuw portaal om dit soort experimenten vanaf nu met jullie te kunnen delen: Dota Labs. (We hadden nog een aantal andere leuke namen verzonnen, zoals 'Instabiele brouwsels' en 'Knutselarijen van de knutselaar', maar uiteindeijk hebben we toch besloten dat een saaie maar duidelijke naam beter is, zodat de interessante functies zelf alle aandacht krijgen.)",
      "Als je je menu Opties opent, zie je vanaf nu een nieuw tabblad met de naam Dota Labs. De functies daar zijn experimenteel en minder goed afgewerkt dan onze andere functies. Daarom hebben we ze in een speciaal menu verzameld en zijn ze standaard uitgeschakeld. Dit zijn functies die tijdens speltesten gemengde reacties opriepen of waarbij de verzamelde gegevens niet eenduidig waren. We weten pas of ze goed zijn en hoe we ze kunnen verbeteren, als we zien hoe echte Dota-spelers ze gebruiken. Daarom brengen we deze functies al in een iets vroeger stadium uit, zodat jullie ons kunnen vertellen of het zin heeft om ze verder uit te werken.",
      "De eerste functies in Dota Labs zijn:",
      "[list]",
      "[*][b]Een overlay-kaart[/b]. Het lijkt een beetje op de minikaart, maar dan groot in plaats van klein, transparant in plaats van dekkend, en op volledig scherm in plaats van in een hoekje. We hebben heel wat vragen over deze functie, zoals bijvoorbeeld: is dit handig voor jouw speelstijl? Hoe gebruik je de kaart? Wat zou je willen dat je ermee kon doen?",
      "[*][b]Doelwitten filteren met sneltoetsen[/b]. Het kan moeilijk zijn om de juiste doelwitten te selecteren in chaotische omstandigheden. Als je even verkeerd klikt, kan dat grote gevolgen hebben. Dota doet wat het kan om je invoer te interpreteren, maar soms lijkt het echt of je Laguna Blade op een creep wilt gebruiken. Met deze nieuwe functie kun je sneltoetsen toewijzen waarmee je, als je ze ingedrukt houdt, alleen vijanden, bondgenoten, creeps of helden als doelwit kunt selecteren. Welke methoden om doelwitten te selecteren zijn in de praktijk handig en welke juist helemaal niet? Waar hebben we niet aan gedacht?",
      "[*][b]Beter leesbare lokale gezondheidsbalk voor je held[/b]. Teamgevechten in Dota zijn soms een beetje hectisch en in die chaos kun je je held nog weleens uit het oog verliezen. Met deze optie wordt de stijl en leesbaarheid van de gezondheidsbalk van je held significant verbeterd in jouw eigen weergave. Helpt dit of zorgt dit juist voor nog meer visuele chaos?",
      "[/list]",
      "We zijn ervan overtuigd dat sommige van deze functies (en andere Dota Labs-ideeën in de toekomst) verder worden ontwikkeld en in het spel worden opgenomen. Andere zullen het niet verder schoppen dan een tijdelijk experiment. Hoe die kaarten vallen, bepaal jij.",
      "Misschien kun je niet wachten om deze functies uit te proberen, maar vraag je je ook af of we dit portaal wel zullen blijven gebruiken. \"De laatste keer dat jullie iets nieuws verzonnen voor Dota was het 'Tussen de paden' en daar hebben we al maanden niets over gehoord.\" Dat klopt! De beste manier om te bewijzen dat we in Dota Labs zullen blijven investeren, is door te laten zien dat we ook in 'Tussen de paden' blijven investeren. Dus: veel plezier met [url=https://www.dota2.com/newsentry/4115798034511159059]de nieuwe uitgave van 'Tussen de paden'[/url] van vandaag."
    ],
    "commentcount": 370,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 6419,
    "votedowncount": 1023,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1715113653,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 6419,
  "votes_down": 1023,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}