{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota Plus Update — Spring 2024 (And Dota Labs)",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675424
      }
    ]
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota Plus Update — Spring 2024 (And Dota Labs)",
    "posttime": 1709684551,
    "updatetime": 1709684551,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Dota Plus Seasonal Update[/h2]",
      "As Spring blooms to life around us, it transports us here on the Dota team to the springs of yore, when the world was new and vibrant. Who could forget climbing that old oak tree by the bridge? Or stealing carrots and turnips from cranky old Farmer Maggot? Or taking that ring to Mordor, and casting it into the fiery pits of Mount Doom where it was forged? ",
      "[h3]Dota Plus Seasonal Treasure[/h3]",
      "That last part of our spring memory trilogy is especially relevant today, since we’ve uncovered another priceless treasure. And this time it’s too good to throw into a volcano. ",
      "The Spring 2024 Seasonal Treasure is here and available for purchase with shards. This treasure features all new sets for Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord, and Nyx Assassin. There's also a chance to unlock the Sir Molestach Irondrill courier, who arrives in the lanes bearing random prismatic and ethereal gems.",
      "We've also taken sets that were available in the Summer Treasure 2022 and made them available for direct purchase for 15,000 shards each as part of the collection of legacy sets in the Shard Shop.",
      "[h3]Updated Seasonal Quests & Guild Rewards[/h3]",
      "Today’s update also comes with a new set of Dota Plus quests to shore up your shard stash for new relics and the Seasonal Treasure — offering up to 115,200 shards over the course of the season. Guild rewards have also been updated, making new emoticons, sprays, and chat wheels available to high-scoring guilds.",
      "[table]",
      "  [tr]",
      "    [th]Guild Tier[/th]",
      "    [th]Rewards[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Silver[/td]",
      "    [td][list]",
      "      [*]Emoticon - lion_bounce",
      "      [*]Emoticon - rainbow_phoenix",
      "      [*]Emoticon - riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Gold[/td]",
      "    [td][list]",
      "      [*]Spray - Aghanim - Push",
      "      [*]Spray - Bounty Hunter - Riches",
      "      [*]Spray - Hoodwink - Acorn",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platinum[/td]",
      "    [td][list]",
      "      [*]Chat Wheel - \"Что это?! Какая жесть!\"",
      "      [*]Chat Wheel - \"Ooooh, por dios!\"",
      "      [*]Chat Wheel - \"你行你行，你上你上\"",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Introducing Dota Labs[/h2]",
      "In addition to the Dota+ content, today's update introduces a set of experimental features available to all Dota players, and a new way for us to ship experiments like them: Dota Labs. (We had fun coming with names like \"Unstable Concoctions\" and \"Tinker's Tinkerings\" but ultimately decided we'd rather have the name be boring and clear and the features themselves be interesting.)",
      "If you load up your options menu, you'll see a new tab with the Dota Labs label. Features here are experimental, and less polished than many other features we ship, so they're all in a special menu and disabled by default. These are features where our playtesting has produced mixed or ambiguous data. We can't really know if they're good or how to make them better without seeing real Dota players using them, so we're shipping them in an earlier form on purpose so you can tell us whether they're worth continuing to invest in.",
      "The initial set of Dota Labs features includes:",
      "[list]",
      "[*][b]Overlay Map[/b]. It's sort of just like the minimap, but it's large instead of small, and transparent instead of solid, and is full-screen instead of being isolated to the corner. We have a bunch of questions, including but not limited to: Is it helpful for your playstyle? How do you interact with it? What do you wish it did?",
      "[*][b]Modifier Key Filter Bindings[/b]. Targeting commands in chaotic environments can be challenging, and misclicks can be devastating. Dota does the best it can with your inputs, but sometimes it really does look like you wanted to Laguna Blade that creep. This new feature allows you bind modifier keys that, when held, will force your target selection to enemies, allies, creeps or heroes. Which targeting methods are the most and least useful in practice? What are we missing?",
      "[*][b]High-Visibility Local Hero Healthbar[/b]. Dota teamfights can be hectic, and sometimes in the chaos it's hard to keep track of your hero. This option significantly changes the styling and readability of only your hero's nameplate. Does this help, or does it introduce even more visual chaos?",
      "[/list]",
      "We fully expect that some of these features (or future Dota Labs ideas) will mature and graduate out, while others may be retired. Which are which depends on you.",
      "Some of you reading this are probably excited about trying these features out, but worried about whether we'll continue to use them moving forward. \"The last time you introduced a new named Dota thing, you called it Between the Lanes, and it's been some months since you last posted one of those.\" You're right! We figure the best way to make the point that we're planning to continue to invest long-term here is to continue to invest long-term there as well, so: Enjoy [url=https://www.dota2.com/newsentry/4115798034511159059]today's Between the Lanes[/url] as well."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 0,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1709684552,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}