{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Ενημέρωση Dota Plus — Άνοιξη 2024 (και Κέντρο Έρευνας Dota)",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675424
      }
    ]
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ενημέρωση Dota Plus — Άνοιξη 2024 (και Κέντρο Έρευνας Dota)",
    "posttime": 1709684551,
    "updatetime": 1709684551,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Εποχιακή ενημέρωση Dota Plus[/h2]",
      "Καθώς όλα ανθίζουν γύρω μας, μας πιάνει κι εμάς η Άνοιξη εδώ στην ομάδα του Dota και θυμόμαστε τον παλιό καλό καιρό, όταν ολόκληρος ο κόσμος ήταν ακόμα νέος και γεμάτος ζωντάνια. Ξεχνιέται το σκαρφάλωμα σ' εκείνη τη γέρικη βελανιδιά δίπλα από τη γέφυρα; Ή το σούφρωμα καρότων και γογγυλιών από εκείνον τον γκρινιάρη αγρότη τον γερο-Μάγκοτ; Ή η μεταφορά εκείνου του δαχτυλιδιού στη Μόρντορ, όπου σφυρηλατήθηκε μέσα στους φλογερούς λάκκους του Όρους Ντουμ; ",
      "[h3]Εποχιακός Θησαυρός Dota Plus[/h3]",
      "Το τελευταίο μέρος αυτής της τριλογίας ανοιξιάτικων αναμνήσεων έχει ιδιαίτερη σημασία σήμερα, καθώς ανακαλύψαμε ακόμα έναν ανεκτίμητο θησαυρό. Και αυτή τη φορά είναι πολύ καλός για να τον πετάξουμε σε κάποιο ηφαίστειο. ",
      "Ο Εποχιακός Θησαυρός «Άνοιξη 2024» είναι εδώ και διαθέσιμος για αγορά με πετράδια. Αυτός ο θησαυρός διαθέτει ολοκαίνουρια σετ για τους Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord και Nyx Assassin. Επιπλέον, μπορεί να ξεκλειδώσετε τον μεταφορέα Sir Molestach Irondrill, ο οποίος φτάνει στα μέτωπα με τυχαία πρισματικά και αιθέρια πετράδια.",
      "Επίσης, τα σετ από τον θησαυρό «Καλοκαίρι 2022» είναι πλέον διαθέσιμα για απευθείας αγορά, με 15.000 πετράδια το καθένα, ως μέρος της συλλογής παραδοσιακών σετ στο Μαγαζί Πετραδιών.",
      "[h3]Ενημερώσεις σε εποχιακές αποστολές και ανταμοιβές Συλλόγων[/h3]",
      "Η σημερινή ενημέρωση συνοδεύεται επίσης από ένα νέο σύνολο αποστολών Dota Plus, για να αυξήσετε τη συλλογή πετραδιών σας και να αποκτήσετε τα νέα κειμήλια και τον νέο Εποχιακό Θησαυρό. Προσφέρουν έως και 115.200 πετράδια κατά τη διάρκεια της σεζόν. Οι ανταμοιβές Συλλόγων έχουν επίσης ενημερωθεί, με νέα emoticon, σπρέι και ροδέλες συνομιλίας για τους Συλλόγους με την υψηλότερη βαθμολογία.",
      "[table]",
      "  [tr]",
      "    [th]Βαθμίδα Συλλόγου[/th]",
      "    [th]Ανταμοιβές[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Ασημένια[/td]",
      "    [td][list]",
      "      [*]Emoticon – lion_bounce",
      "      [*]Emoticon – rainbow_phoenix",
      "      [*]Emoticon – riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Χρυσή[/td]",
      "    [td][list]",
      "      [*]Σπρέι – Aghanim – Push",
      "      [*]Σπρέι – Bounty Hunter – Riches",
      "      [*]Σπρέι – Hoodwink – Acorn",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Πλατινένια[/td]",
      "    [td][list]",
      "      [*]Ροδέλα Συνομιλίας – «Что это?! Какая жесть!»",
      "      [*]Ροδέλα Συνομιλίας – «Ooooh, por dios!»",
      "      [*]Ροδέλα Συνομιλίας – «你行你行，你上你上»",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Παρουσιάζουμε το Κέντρο Έρευνας Dota[/h2]",
      "Εκτός από το περιεχόμενο του Dota+, με τη σημερινή ενημέρωση εισάγονται και κάποια πειραματικά χαρακτηριστικά για όλους τους παίκτες του Dota, καθώς και ένας νέος τρόπος κυκλοφορίας των πειραμάτων: το Κέντρο Έρευνας Dota. (Σπάσαμε πλάκα με ονόματα όπως «Ασταθείς Αλχημείες» και «Tinkerάματα», αλλά τελικά αποφασίσαμε ότι καλύτερα να είναι το όνομα βαρετό και ξεκάθαρο και ενδιαφέροντα τα ίδια τα χαρακτηριστικά.)",
      "Φορτώνοντας το μενού επιλογών, θα δείτε μια νέα καρτέλα με την ετικέτα «Κέντρο Έρευνας Dota». Πρόκειται για πειραματικά χαρακτηριστικά, που δεν είναι βελτιστοποιημένα στον ίδιο βαθμό με άλλα χαρακτηριστικά που κυκλοφορούμε. Έτσι, βρίσκονται όλα σε ένα ειδικό μενού και είναι απενεργοποιημένα από προεπιλογή. Είναι τα χαρακτηριστικά για τα οποία οι δοκιμές παιχνιδιού μας απέφεραν μεικτά ή διφορούμενα αποτελέσματα. Δεν μπορούμε να γνωρίζουμε αν είναι καλά ή πώς να τα βελτιώσουμε, αν δεν δούμε πραγματικούς παίκτες του Dota να τα χρησιμοποιούν, οπότε, τα κυκλοφορούμε σκόπιμα σε πρώιμη μορφή για να μας πείτε αν αξίζει να συνεχίσουμε να τα δουλεύουμε.",
      "Το αρχικό σύνολο χαρακτηριστικών του Κέντρου Έρευνας Dota:",
      "[list]",
      "[*][b]Χάρτης επικάλυψης[/b]: Μοιάζει λίγο με τον μίνι χάρτη, αλλά είναι μεγάλος και διαφανής, ενώ καταλαμβάνει όλη την οθόνη αντί να περιορίζεται στη γωνία. Έχουμε πολλές ερωτήσεις, όπως: Σας βολεύει όταν παίζετε; Πώς τον χρησιμοποιείτε; Τι θα θέλατε να κάνει;",
      "[*][b]Δεσμεύσεις φιλτραρίσματος των πλήκτρων τροποποιήσεων[/b]: Οι εντολές στόχευσης σε χαοτικές συνθήκες μπορεί να είναι δύσκολες και τα λανθασμένα κλικ καταστροφικά. Το Dota κάνει ό,τι καλύτερο μπορεί με τις εισόδους σας, αλλά πού και πού φαίνεται ότι όντως θέλατε να ρίξετε Laguna Blade στο κριπάκι. Με αυτό το νέο χαρακτηριστικό, μπορείτε να δεσμεύετε πλήκτρα τροποποιήσεων και, όταν τα κρατάτε πατημένα, θα επιβάλλεται η επιλογή του στόχου σας σε εχθρούς, συμμάχους, κριπάκια ή ήρωες. Ποιες μέθοδοι στόχευσης είναι περισσότερο ή λιγότερο εύχρηστες στην πράξη; Τι τους λείπει;",
      "[*][b]Μπάρα ζωής υψηλής ορατότητας του ήρωα[/b]: Μερικές φορές, οι ομαδικές μάχες στο Dota είναι ταραχώδεις και είναι δύσκολο να δείτε τον ήρωά σας μέσα στο χάος. Αυτή η επιλογή αλλάζει σημαντικά το στιλ και την αναγνωσιμότητα της λεζάντας ονόματος του δικού σας ήρωα μόνο. Βοηθάει αυτό ή επιδεινώνει το οπτικό χάος;",
      "[/list]",
      "Αναμένουμε ότι μερικά από αυτά τα χαρακτηριστικά (ή μελλοντικές ιδέες του Κέντρου Έρευνας Dota) θα ωριμάσουν και θα κυκλοφορήσουν, ενώ άλλα θα αποσυρθούν. Εξαρτάται από εσάς ποια θα κυκλοφορήσουν και ποια θα αποσυρθούν.",
      "Κάποιοι από εσάς ενθουσιαστήκατε με τα νέα χαρακτηριστικά διαβάζοντας το κείμενο, αλλά ανησυχείτε για το αν θα συνεχίσουμε να τα χρησιμοποιούμε στο μέλλον. «Την τελευταία φορά που ήρθε κάτι νέο στο Dota, το λέγανε «Νέα από τα Μέτωπα» και έχουν περάσει μήνες από την τελευταία φορά που γράψατε κάτι εκεί.» Έχετε δίκιο! Σκεφτήκαμε ότι ο καλύτερος τρόπος για να αποδείξουμε ότι σκοπεύουμε να συνεχίσουμε να ασχολούμαστε μακροπρόθεσμα με αυτό εδώ είναι να κάνουμε το ίδιο και εκεί, οπότε, απολαύστε τα [url=https://www.dota2.com/newsentry/4115798034511159059]σημερινά «Νέα από τα Μέτωπα»[/url]."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1709684552,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}