{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Обновление Dota Plus: весна 2024 года (и «Лаборатории Доты»)",
  "event_type": 13,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675424
      }
    ]
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Обновление Dota Plus: весна 2024 года (и «Лаборатории Доты»)",
    "posttime": 1709684551,
    "updatetime": 1709684551,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Сезонное обновление Dota Plus[/h2]",
      "Расцвет весны напоминает нашей команде разработчиков о стародавних временах, когда мир был свеж и ярок. Помните, как вы залезали на старый дуб у моста? Как крали морковь и репу у ворчливого старика Мэггота? Как несли кольцо туда, где его выковали, — в Мордор, к жерлу Роковой Горы? ",
      "[h3]Сезонная сокровищница Dota Plus[/h3]",
      "Последняя часть нашей трилогии весенних воспоминаний особенно актуальна, ведь мы подготовили очередную бесценную сокровищницу. И она слишком прелестна, чтобы выкидывать её в вулкан. ",
      "Представляем сезонную весеннюю сокровищницу 2024 года, которую можно приобрести за осколки. Она содержит новые наборы для Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord и Nyx Assassin. С каждой открытой сокровищницей у вас есть шанс получить очень редкого курьера Sir Molestach Irondrill, в котором сразу есть два случайных самоцвета: призматический и потусторонний.",
      "Кроме того, теперь наборы из летней сокровищницы 2022 года можно напрямую приобрести в магазине за 15 000 осколков. Ищите их в разделе «Наследие».",
      "[h3]Обновлённые сезонные задания и награды гильдии[/h3]",
      "Сегодняшнее обновление также включает новый набор сезонных заданий для Dota Plus, чтобы вы могли заработать как можно больше осколков для новых реликвий и сокровищниц. В сумме за все задания можно получить до 115 200 осколков. Награды для гильдий также обновились, открывая успешным гильдиям доступ к новым смайликам, граффити и фразам для колеса чата.",
      "[table]",
      "  [tr]",
      "    [th]Разряд гильдии[/th]",
      "    [th]Награды[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Серебро[/td]",
      "    [td][list]",
      "      [*]Смайлик: lion_bounce",
      "      [*]Смайлик: rainbow_phoenix",
      "      [*]Смайлик: riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Золото[/td]",
      "    [td][list]",
      "      [*]Граффити: Aghanim - Push",
      "      [*]Граффити: Bounty Hunter - Riches",
      "      [*]Граффити: Hoodwink - Acorn",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Платина[/td]",
      "    [td][list]",
      "      [*]Звук «Что это?! Какая жесть!»",
      "      [*]Звук «Ooooh, por dios!»",
      "      [*]Звук «你行你行，你上你上»",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Представляем лаборатории Доты[/h2]",
      "В дополнение к контенту для Dota Plus сегодняшнее обновление добавляет несколько экспериментальных функций, доступных всем игрокам, а также новый способ тестировать подобные нововведения — представляем «Лаборатории Доты». (Названия вроде «Химичим с Алхимиком» или «Механики от Механика» казались нам веселее, но в итоге мы решили сделать интересными сами функции, а заголовок остался скучным и понятным.)",
      "Открыв меню настроек, вы увидите новую вкладку — «Лаборатории». Функции в ней экспериментальные и не такие проработанные, как те, что мы обычно выпускаем, поэтому они находятся в отдельном меню и по умолчанию выключены. Тестируя их, мы получили смешанные или неоднозначные результаты, так что нам сложно сказать, хороши ли они или как их улучшить. А вот реальные игроки вполне смогут сказать нам, стоит ли продолжать разработку этих функций — именно поэтому мы выпускаем их в раннем виде.",
      "Вот какие нововведения есть в «Лабораториях Доты» уже сегодня:",
      "[list]",
      "[*][b]Карта на весь экран[/b]. По сути, это та же мини-карта, только большая (а не маленькая), полупрозрачная (а не непрозрачная) и развёрнутая на весь экран (а не зажатая в угол). У нас множество вопросов, в том числе: сочетается ли эта карта с вашим стилем игры? Как вы будете её использовать? Каких возможностей ей не хватает?",
      "[*][b]Клавиша фильтрации действий[/b]. Выбрать нужную цель в суматохе бывает непросто, и неверное нажатие может привести к катастрофе. Игра очень старается правильно распознать все ваши действия, но иногда всё же создаётся впечатление, что вы хотите ультануть в крипа. Эта новая функция позволит вам назначить клавиши-модификаторы, зажатие которых ограничит возможные цели врагами, союзниками, крипами или героями. Какой из фильтров наиболее и наименее полезен на практике? Мы ничего не упускаем?",
      "[*][b]Более заметная полоса здоровья[/b]. Командные бои бывают сумбурными, а в хаосе сражения легко потеряться. Эта функция значительно меняет стиль и читаемость имени вашего героя. Упрощается ли от этого игра? Или, наоборот, визуальной путаницы становится только больше?",
      "[/list]",
      "Мы не сомневаемся, что некоторые из этих функций (или будущих идей) усовершенствуются и станут частью игры, а другие — покинут её. Исход зависит от вас.",
      "Некоторые из читающих наверняка рады попробовать новые возможности, но сомневаются, что мы продолжим работу над ними. «О прошлой новинке с уникальным названием — „Между линий“ — ничего не слышно уже несколько месяцев», — скажут они. И будут правы! Пожалуй, лучший способ показать серьёзность наших намерений в одном деле — это показать их и в другом, так что... позвольте представить [url=https://www.dota2.com/newsentry/4115798034511159059]новый текст в рубрике «Между линиями»[/url]."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1709684552,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}