{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Dota-Plus-Update – Frühling 2024 (und Dota Labs)",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Dota-Plus-Update – Frühling 2024 (und Dota Labs)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Saisonales Update für Dota Plus[/h2]",
      "Während der Frühling die Natur um uns herum zu neuem Leben erwachen lässt, fühlen wir uns hier im Dota-Team an vergangene frühlingshafte Tage erinnert, als die Welt noch jung und von regem Treiben erfüllt war. Unvergessen bleibt uns die alte Eiche an der Brücke, auf die wir ständig geklettert sind. Oder als wir Karotten und Rüben vom schrulligen alten Bauer Maggot mitgehen ließen. Oder das Abenteuer, als wir den Einen Ring tief nach Mordor hineintrugen und in die feurige Lava des Schicksalsberges warfen, wo er einst geschmiedet wurde. ",
      "[h3]Saisonaler Schatz für Dota Plus[/h3]",
      "Die letzte dieser drei Frühlingserinnerungen ist die lebhafteste von allen, da wir heute erneut einen einzigartigen Schatz in den Händen halten. Aber dieses Mal wäre es wirklich zu schade, ihn in einen Vulkan zu werfen. ",
      "Der saisonale Schatz zum Frühling 2024 ist jetzt verfügbar und kann mit Splittern erworben werden. Dieser Schatz enthält brandneue Sets für Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord und Nyx Assassin. Außerdem erhalten Sie eine Chance, den Kurier „Herr Grabor Eisenbohrer“ freizuschalten, der sich durch die Pfade wühlt und zufällige prismatische und ätherische Edelsteine mit sich führt.",
      "Darüber hinaus bieten wir Sets des Sommerschatzes 2022 jetzt in der Sammlung der klassischen Sets für jeweils 15.000 Splitter im Splitter-Shop direkt zum Kauf an.",
      "[h3]Aktualisierte saisonale Quests und Gildenbelohnungen[/h3]",
      "Das heutige Update enthält auch neue Dota-Plus-Quests, mit denen sich ein üppiger Splittervorrat für neue Relikte und den saisonalen Schatz anhäufen lässt. Insgesamt warten 115.200 Splitter bis zum Ende der Saison darauf, eingesammelt zu werden. Die Gildenbelohnungen wurden ebenfalls aktualisiert und stellen Gilden mit hohem Punktestand neue Emoticons, Graffitis und Chatradsprüche zur Verfügung.",
      "[table]",
      "  [tr]",
      "    [th]Gildenstufe[/th]",
      "    [th]Belohnungen[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Silber[/td]",
      "    [td][list]",
      "      [*]Emoticon: lion_bounce",
      "      [*]Emoticon: rainbow_phoenix",
      "      [*]Emoticon: riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Gold[/td]",
      "    [td][list]",
      "      [*]Graffiti: Aghanim – Voran",
      "      [*]Graffiti: Bounty Hunter – Reichtümer",
      "      [*]Graffiti: Hoodwink – Eichel",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platin[/td]",
      "    [td][list]",
      "      [*]Chatradspruch: „Что это?! Какая жесть!“",
      "      [*]Chatradspruch: „Ooooh, por dios!“",
      "      [*]Chatradspruch: „你行你行，你上你上“",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Wir präsentieren: Dota Labs[/h2]",
      "Zusätzlich zu den neuen Inhalten für Dota Plus führt das heutige Update eine Reihe von experimentellen Funktionen ein, die allen Dota-Spielern zur Verfügung stehen, sowie ein neues Werkzeug für uns, mit dem wir solche Experimente demnächst veröffentlichen: Dota Labs. (Wir haben uns einige lustige Namen wie „Instabiles Gebräu“ und „Tinkers Tüfteleien“ ausgedacht, aber letztendlich entschieden wir, dass der Name lieber langweilig und verständlich sein sollte, während die Funktionen umso interessanter sind.)",
      "Wenn Sie Ihre Einstellungen öffnen, finden Sie dort nun den neuen Tab „Dota Labs“. An dieser Stelle finden Sie experimentelle und weniger ausgefeilte Funktionen, die sich deutlich von bereits implementierten unterscheiden. Deswegen wurden diese in einem speziellen Menü zusammengefasst und sind standardmäßig deaktiviert. Sie sind dort gelandet, weil unsere Spieltests keine eindeutig positiven Ergebnisse lieferten. Da wir nicht mit Sicherheit sagen können, ob diese Funktionen eine Bereicherung darstellen oder noch ausbaufähig sind, möchten wir sehen, wie sie von echten Dota-Spielern genutzt werden. Dementsprechend veröffentlichen wir sie absichtlich in einer frühen Version, damit wir anhand Ihres Feedbacks entscheiden können, ob sich eine weitere Entwicklung lohnt.",
      "Die ersten Funktionen von Dota Labs umfassen:",
      "[list]",
      "[*][b]Karten-Overlay[/b]: Das Karten-Overlay funktioniert so ähnlich wie die Minikarte, ist jedoch groß statt klein, transparent statt einfarbig und füllt den ganzen Bildschirm aus, statt in eine Ecke gepfercht zu sein. Hier einige unserer ersten Fragen dazu: Hilft Ihnen diese Funktion bei Ihrem Spielstil? Wie interagieren Sie mit dieser Funktion? Was sollte diese Funktion Ihrer Meinung nach können?",
      "[*][b]Tastenbelegung zum Filtern von Zielen[/b]: In chaotischen Umgebungen kann das Anvisieren von Gegnern schwierig sein, und Fehlklicks können verheerende Folgen haben. Dota ist bemüht, Ihre Eingaben so gut wie möglich zu interpretieren, aber manchmal sieht es wirklich so aus, als wollten Sie Laguna Blade auf einen Diener abfeuern. Diese neue Funktion ermöglicht es Ihnen, Zieltasten zu belegen. Wenn Sie diese gedrückt halten, wird die Auswahl eines bestimmten Ziels – Gegner, Verbündete, Einheiten oder Helden – erzwungen. Uns interessiert: Welche Methoden zum Anvisieren sind in der Praxis am nützlichsten und welche eher unbrauchbar? Gibt es etwas, das wir vergessen haben?",
      "[*][b]Hervorstechender Lebensbalken für den eigenen Helden[/b]: In Dota-Teamkämpfen kann es sehr hektisch zugehen. In diesem Chaos ist es manchmal schwer, den eigenen Helden im Auge zu behalten. Diese Option ändert das Erscheinungsbild und die Lesbarkeit des Lebensbalkens Ihres Helden deutlich. Wir wollen wissen: Hilft Ihnen diese Funktion oder sorgt diese für noch mehr visuelles Chaos?",
      "[/list]",
      "Wir gehen fest davon aus, dass einige dieser Funktionen (oder künftige Ideen der Dota Labs) reifen und sich weiterentwickeln, während andere wieder eingestellt werden. Welche das sind, hängt von Ihrem Feedback ab.",
      "Einige von Ihnen freuen sich wahrscheinlich darauf, die neuen Funktionen auszuprobieren, zweifeln aber gleichzeitig daran, ob wir uns auch langfristig für dieses neue Werkzeug begeistern können. „Das letzte Mal, als ihr ein neues Dota-Ding mit schickem Namen vorgestellt habt, habt ihr es ‚Abseits der Pfade‘ genannt. Es ist nun aber schon einige Monate her, seitdem ihr das letzte Mal einen solchen Beitrag veröffentlicht habt.“ Da haben Sie recht! Und deshalb bringen wir unsere Absicht, Dota Labs langfristig zu unterstützen, am besten dadurch zum Ausdruck, indem wir auch hier am Ball bleiben: In diesem Sinne, viel Spaß beim Lesen der aktuellen Ausgabe von [url=https://www.dota2.com/newsentry/4115798034511159059]Abseits der Pfade[/url]."
    ],
    "commentcount": 352,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 4423,
    "votedowncount": 735,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1710287206,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4423,
  "votes_down": 735,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}