{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualización de Dota Plus — Primavera de 2024 (y Laboratorios de Dota)",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualización de Dota Plus — Primavera de 2024 (y Laboratorios de Dota)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Actualización de temporada de Dota Plus[/h2]",
      "Con la primavera en flor a nuestro alrededor, el equipo de Dota rememora primaveras de otros tiempos, en los que el mundo era nuevo y estaba lleno de vida. ¡Cómo olvidar cuando trepamos por aquel roble viejo cerca del puente! O cuando le robamos zanahorias y nabos a Maggot, el viejo granjero cascarrabias. O cuando llevamos aquel anillo a Mordor y lo arrojamos a los abismos de fuego del Monte del Destino, donde se había forjado. ",
      "[h3]Tesoro estacional de Dota Plus[/h3]",
      "Esa última parte de nuestra trilogía de recuerdos primaverales es especialmente relevante hoy, ya que hemos descubierto otro tesoro de valor incalculable. Y este es demasiado preciado para lanzarlo a un volcán. ",
      "Ya está aquí el tesoro estacional de la primavera de 2024, que puedes comprar con fragmentos. Este tesoro incluye sets completamente nuevos para Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord y Nyx Assassin. También es posible desbloquear a Sir Mostacho Barrena, un mensajero que se aparece por las sendas con gemas prismáticas y etéreas aleatorias.",
      "Además, algunos de los sets que estaban disponibles en el tesoro de verano de 2022 se pueden comprar ahora directamente por 15 000 fragmentos cada uno como parte de la colección de sets clásicos a la venta en la tienda de fragmentos.",
      "[h3]Misiones estacionales y recompensas de clanes actualizadas[/h3]",
      "La actualización de hoy incluye también un nuevo conjunto de misiones de Dota Plus con las que afianzar tu reserva de fragmentos y obtener hasta 115 200 a lo largo de la temporada para conseguir nuevas reliquias y el tesoro estacional. Las recompensas de clanes también se han actualizado y los clanes con las puntuaciones más altas podrán disfrutar de nuevos emoticonos, espráis y ruedas de chat.",
      "[table]",
      "  [tr]",
      "    [th]Categoría de clan[/th]",
      "    [th]Recompensas[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Plata[/td]",
      "    [td][list]",
      "      [*]Emoticono: lion_bounce",
      "      [*]Emoticono: rainbow_phoenix",
      "      [*]Emoticono: riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Oro[/td]",
      "    [td][list]",
      "      [*]Espray: Aghanim - Empujón",
      "      [*]Espray: Bounty Hunter - Riquezas",
      "      [*]Espray: Hoodwink - Bellota",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platino[/td]",
      "    [td][list]",
      "      [*]Rueda de chat: «Что это?! Какая жесть!»",
      "      [*]Rueda de chat: «Ooooh, por dios!»",
      "      [*]Rueda de chat: «你行你行，你上你上»",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Presentamos los Laboratorios de Dota[/h2]",
      "Además del contenido de Dota Plus, con la actualización de hoy presentamos un conjunto de características experimentales, los Laboratorios de Dota, que estarán disponibles para todos los jugadores de Dota y nos permitirán seguir lanzando experimentos similares. Nos los pasamos muy bien pensando nombres como «Mejunjes Inestables» o «Chatarrería de Tinker», pero al final decidimos ponerle un nombre directo y que las características resulten interesantes por sí solas.",
      "Si cargas el menú de opciones, verás una pestaña nueva denominada «Laboratorios de Dota» (o «Dota Labs» temporalmente). Las características incluidas son experimentales y un poco más toscas que las funciones que solemos lanzar, por eso están en un menú especial y desactivadas por defecto. Los datos que han generado nuestras pruebas sobre estas características son variados y ambiguos. No sabemos exactamente si funcionan bien ni cómo mejorarlas sin que las usen jugadores de Dota de verdad, y por eso las estamos lanzando antes de tiempo a propósito, para que nos cuentes si merece la pena seguir desarrollándolas.",
      "El conjunto inicial de características de los Laboratorios de Dota incluye:",
      "[list]",
      "[*][b]Mapa superpuesto[/b]. Es similar al minimapa, pero es grande en lugar de pequeño, transparente en lugar de opaco y abarca toda la pantalla en lugar de aparecer solo en la esquina. Tenemos muchas dudas, por ejemplo (aunque hay muchas más): ¿Te resulta útil para tu estilo de juego? ¿Cómo lo usas? ¿Para qué te gustaría usarlo?",
      "[*][b]Asignación de filtros a teclas modificadoras[/b]. La selección de objetivos con comandos en entornos caóticos es todo un reto y hacer clic en el sitio equivocado puede ser desastroso. Dota hace todo lo que puede con las entradas que proporcionas, pero a veces parece que realmente le quieres lanzar Hoja de Laguna a un creep. Con esta nueva característica, puedes asignar teclas modificadoras para forzar la selección de enemigos, aliados, creeps o héroes como objetivos cuando las pulses. ¿Qué métodos para seleccionar objetivos son más y menos útiles en la práctica? ¿Nos hemos dejado algo?",
      "[*][b]Barra de vida de tu héroe más visible[/b]. Las peleas en equipo de Dota pueden ser caóticas y, a veces, cuesta seguirle la pista a tu héroe. Esta opción cambia de forma significativa el estilo y la visibilidad de la barra de vida de tu héroe. ¿Ayuda o crea todavía más caos visualmente?",
      "[/list]",
      "Somos totalmente conscientes de que algunas de estas características (y otras ideas que lleguen a los Laboratorios de Dota) se perfeccionarán y se lanzarán por completo, mientras que otras pueden desaparecer. Su destino depende de ti.",
      "Puede que te haga ilusión probarlas, pero a la vez te preocupe no saber cuánto van a durar. Nos consta que pasó algo similar cuando presentamos el apartado «Detrás de las sendas», pero después no pudimos actualizarlo con la frecuencia que se esperaba. ¡Es cierto! Por eso pensamos que la mejor forma de demostrar que tenemos intención de seguir invirtiendo a largo plazo en estas características es seguir invirtiendo a largo plazo también en esas otras. Así que aquí está la publicación de [url=https://www.dota2.com/newsentry/4115798034511159059]Detrás de las sendas[/url] de hoy."
    ],
    "commentcount": 370,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 6419,
    "votedowncount": 1023,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1715113653,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 6419,
  "votes_down": 1023,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}