{
  "gid": "4169840594114934858",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização do Dota+ da primavera de 2024 (e o Laboratório do Dota)",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684520,
  "rtime32_end_time": 1709688601,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "005df03fc8e0a1f0370db32eedf47f877aef119e.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684551
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1709324653
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709922508
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751133
      },
      {
        "strSteamID": "76561198239571404",
        "rtUpdated": 1709759103
      }
    ],
    "rt_migrated_time": 1709759079.849
  },
  "announcement_body": {
    "gid": "4169840594114934859",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Atualização do Dota+ da primavera de 2024 (e o Laboratório do Dota)",
    "posttime": 1709684551,
    "updatetime": 1709922508,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/e11198d52372bf87ada1c5495fe8ec9539716096.png[/img]",
      "[h2]Atualização sazonal do Dota+[/h2]",
      "Enquanto as flores da primavera começam a desabrochar, a equipe do Dota vai se lembrando dos velhos tempos, quando o mundo era novo e vibrante. Mas a equipe de tradução passou pela primavera há menos tempo, e as memórias outonais vão ainda mais longe. Quem poderia se esquecer daquelas subidas no pé de manga perto da ponte? Ou do roubo de cenouras e nabos na fazenda do velho Magote? Ou daquele anel que foi levado para Mordor e lançado nas profundezas ardentes da Montanha da Perdição, onde foi forjado? ",
      "[h3]Tesouro sazonal do Dota+[/h3]",
      "A última parte da nossa trilogia de memórias sazonais é especialmente relevante hoje, já que encontramos outro tesouro inestimável. E dessa vez ele é bom demais para ser jogado em um vulcão. ",
      "O Tesouro Sazonal de Primavera de 2024 está disponível e já pode ser adquirido em troca de fragmentos. Esse tesouro conta com novos conjuntos para o Disruptor, Dark Willow, Spectre, Chaos Knight, Doom, Earth Spirit, Underlord e Nyx Assassin. Você também pode receber o entregador \"Sr. Bigueira Broca Férrea\", que emerge nas trilhas portando gemas prismáticas e etéreas aleatórias.",
      "Também disponibilizamos conjuntos do Tesouro Veranil de 2022 para compra direta na seção de conjuntos clássicos da loja de fragmentos, por 15.000 fragmentos cada.",
      "[h3]Missões sazonais e recompensas de clãs atualizadas[/h3]",
      "A atualização de hoje também conta com um novo conjunto de missões para o Dota+, que ajuda a obter mais fragmentos e novas relíquias rumo ao Tesouro Sazonal — é possível obter até 115.200 fragmentos durante a temporada. As recompensas de clã também foram atualizadas, disponibilizando novos emoticons, pinturas e mensagens sonoras para clãs bem posicionados.",
      "[table]",
      "  [tr]",
      "    [th]Nível do clã[/th]",
      "    [th]Recompensas[/th]",
      "  [/tr]",
      "  [tr]",
      "    [td]Prata[/td]",
      "    [td][list]",
      "      [*]Emoticon: lion_bounce",
      "      [*]Emoticon: rainbow_phoenix",
      "      [*]Emoticon: riki_peaceout",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "     [td]Ouro[/td]",
      "    [td][list]",
      "      [*]Pintura: Aghanim — Empurrar!",
      "      [*]Pintura: Bounty Hunter — Riquezas",
      "      [*]Pintura: Hoodwink — Bolota",
      "    [/list][/td]",
      "  [/tr]",
      "  [tr]",
      "    [td]Platina[/td]",
      "    [td][list]",
      "      [*]Mensagem sonora: \"Что это?! Какая жесть!\"",
      "      [*]Mensagem sonora: \"Ooooh, por dios!\"",
      "      [*]Mensagem sonora: \"你行你行，你上你上\"",
      "    [/list][/td]",
      "  [/tr]",
      "[/table]",
      "[h2]Apresentando o Laboratório do Dota[/h2]",
      "Além do conteúdo do Dota+, a atualização de hoje inclui um conjunto de recursos experimentais, disponíveis para todos os jogadores de Dota, e uma nova forma de lançarmos outros experimentos: o Laboratório do Dota (pensamos em nomes divertidos, como \"Misturas Instáveis\" e \"Laboradota\", mas acabamos decidindo usar um nome simples e direto — afinal, são os recursos que devem chamar a sua atenção).",
      "Ao abrir o menu de opções, você encontrará a nova aba \"Laboratório\". Os recursos dessa aba são experimentais e menos polidos que os outros recursos que lançamos, portanto, eles ficam em um menu especial e desativados por padrão. Esses são recursos cujos testes internos produziram dados inconclusivos ou ambíguos. Não sabemos ao certo se são bons ou como melhorá-los sem que jogadores de Dota os usem em partidas reais, logo estamos lançando-os dessa forma para que vocês possam nos dizer se vale a pena continuarmos investindo neles.",
      "O conjunto inicial de recursos do Laboratório do Dota inclui:",
      "[list]",
      "[*][b]Mapa sobreposto[/b]: é como o minimapa, mas grande em vez de pequeno, transparente em vez de opaco e ocupa a tela toda em vez de ficar no canto. Temos várias dúvidas, incluindo mas não se limitando a: ele é útil para o seu estilo de jogo? Como você interage com ele? O que você gostaria que ele fizesse?",
      "[*][b]Teclas de filtragem[/b]: às vezes, pode ser desafiador usar comandos com alvos em ambientes caóticos, e um clique errado pode ser devastador. O Dota faz o melhor que pode com as suas entradas, mas às vezes pode parecer que você [i]realmente[/i] queria trucidar aquela criatura com a Lâmina Laguna. Este novo recurso permite que você vincule teclas modificadoras que, quando pressionadas, filtrarão os seus alvos selecionáveis a apenas inimigos, aliados, criaturas ou heróis. Na prática, quais formas de alvejamento são mais e menos úteis? Esquecemos de algo?",
      "[*][b]Alta visibilidade da barra de vida do seu herói[/b]: no Dota, batalhas entre equipes podem ser bem frenéticas, e às vezes é difícil acompanhar o seu herói no meio da muvuca. Esta opção altera significativamente o estilo e a legibilidade do nome do seu herói — e apenas dele. Isso ajuda ou atrapalha?",
      "[/list]",
      "Esperamos que alguns desses recursos (ou ideias futuras do Laboratório do Dota) amadureçam e tornem-se oficiais, enquanto outros podem ser removidos. Isso depende apenas de vocês.",
      "Alguns de vocês devem estar animados para experimentar essas novidades, mas com receio de que não continuaremos a usá-los daqui em diante. \"A última vez que vocês deram um nome para algo novo de Dota foi para o 'Nas Entretrilhas', e faz meses desde a última edição!\" Vocês estão certos! Achamos que a melhor forma de afirmar que planejamos continuar a investir a longo prazo aqui é continuar a investir a longo prazo acolá, então aproveitem a [url=https://www.dota2.com/newsentry/4115798034511159059]edição de hoje de \"Nas Entretrilhas\"[/url] também."
    ],
    "commentcount": 352,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686046_0",
      "ModAct_487176015_1709751546_4",
      "ModAct_487176015_1709760814_4",
      "ModAct_1428110219_1709923906_4"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "4288061352804809343",
    "event_gid": "4169840594114934858",
    "voteupcount": 4423,
    "votedowncount": 735,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804809343",
  "rtime32_last_modified": 1710287206,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709923906,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 4423,
  "votes_down": 735,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804809343",
  "clan_steamid_original": "103582791433224455"
}