{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus 2023-opdateringen er ude!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Frostivus 2023-opdateringen er ude!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Endnu en Frostivus er over os, og det betyder, at julemanden er vågnet op fra sit vinterdvale under det vinrøde Blodhav, som omgiver Frostivus Slot. Han har sendt legioner af kidnappede små nisser på arbejde i legetøjsminerne, spændt sine to frygtindgydende ulve Lumpo og Rupertus for knogleslæden og er sandsynligvis enten på taget af dit hus eller indeni det lige nu.",
      "Så hvis du har været artig, kan du forberede dig på at pynte op med nye og tilbagevendende kosmetiske Frostivus-genstande, en masse kvalitetsforbedringer i klienten, nye premiumsæt til Dota Plus og spilopdatering 7.35, og du kan læse om det alt sammen [url=https://www.dota2.com/frostivus2023]lige her[/url].",
      "Men hvis du ikke har været artig, har vi godt nyt til alle andre og dårligt nyt til dig, for det bliver et ordentligt blodbad i år. Du husker måske, at vi [url=https://www.dota2.com/newsentry/3692442542242977036]tilbage i september[/url] hev udelukkelseshammeren frem og permanent udelukkede 90.000 smurfkontoer. Siden da har vi fortsat med at investere i at holde øje med spilleres opførsel, både på den manuelle og den automatiske analysefront. I løbet af de sidste par uger har vi været endnu mere aggressive med udelukkelser, og vi har udelukket titusindvis af smurfkontoer alene i dag.",
      "Under The International var der nogle professionelle spillere, som kontaktede os for at snakke om deres smurfkontoer. Disse samtaler har fortsat, og der er bred enighed blandt professionelle spillere om, at udelukkelse af professionelle smurfkontoer gavner Dota-fællesskabet. Reglerne bør gælde for alle, og det vil de gøre fra nu af. Og spillere har også været uartige med andre ting end smurfing. Blandt andre tvivlsomme aktiviteter er nogle dårlige aktører meget ubehøvlede, når de spiller, og ødelægger kampe og går som følge deraf ned i opførselsscore, og så hyrer de folk til at få opførselsscoren op igen.",
      "Uanset [i]hvordan[/i] du har været uartig, så har vi holdt øje med dig (ikke mens du sov, bare rolig), og vi slår hårdt ned på det hele. Der vil blive uddelt straffe for alle ovenstående ting, inklusive reduktion af opførselsscorer – og i alvorlige tilfælde udelukkelse af hovedkontoer. ",
      "Som vi har sagt før, gør smurfing (og anden negativ adfærd) kampe dårligere, og vi ønsker at sikre, at dine kampe er så gode som muligt i det nye år. Så vi vil gerne ønske alle en [url=https://www.dota2.com/frostivus2023]glædelig Frostivus-opdatering![/url] Bortset fra smurfkontoerne, som nok ikke vil blive glade for de velfortjente stykker kul, der følger med opdateringen for dem.",
      "[b]Frostivus 2023-skattekiste:[/b]",
      "[list]",
      "[*]Hver kiste indeholder en af 30 genstande fordelt på 4 niveauer eller en kosmisk sjælden Baby Roshan-kurér.",
      "[*]Genstande fra samme niveau har samme sjældenhed.  Du modtager ikke dubletter fra hvert niveau, før du har modtaget hver genstand én gang.",
      "[*]Fem genstande fra det samme niveau kan byttes til en tilfældig genstand fra det næste niveau.",
      "[*]Den kosmisk sjældne genstand findes i 1 ud af 100.000 kister.  De andre kister indeholder en genstand fra et af de 4 niveauer.  Fra og med niveau 1 har hver genstand 10% chance for at blive opgraderet til næste niveau.",
      "[*]Når du åbner en kiste eller bytter en genstand til et højere niveau, er der en chance på 1 ud af 300 for at få en yderligere usædvanlig genstand – enten en kopi af genstanden eller, hvis det er et sæt, en af genstandene i sættet.  Hver usædvanlige genstand har en tilfældig særeffekt.  De tre effekter har samme sjældenhed.",
      "[/list]",
      "[b]Fejlrettelser:[/b]",
      "[list]",
      "[*]Rettede et problem, hvor Gem of True Sights nedkøling forblev fastfrosset, hvis genstanden blev droppet af en helt, som blev dræbt med Chronosphere.",
      "[*]Rettede et sjældent nedbrud med gestandskombinationer.",
      "[*]Rettede et problem, hvor en evne med fastfrosset nedkøling tøede for tidligt, hvis nedkølingen blev fastfrosset igen.",
      "[*]Rettede et problem, hvor evner med indbyggede styrkelser nogle gange ikke fik dem påført ved køb af Aghanim's Shard.",
      "[*]Rettede et problem, hvor skift af evner (eller anskaffelse af Aether Lens osv.) ikke opdaterede cirklen for kasterækkevidde, hvis den allerede var vist.",
      "[*]Rettede, at Chaos Knights Chaos Bolt-partikler nogle gange havde forkert placering.",
      "[*]Rettede, at Dawnbreakers Starbreaker gav immunitet overfor ren skade uden Aghanim's Shard.",
      "[*]Rettede Earthshakers Bindings of Deep Magma-sæt, så det viser de korrekte (nye) partikler for den nye stil (10-årsjubilæum), og partikler slettes korrekt ved udløb.",
      "[*]Rettede, at Hoodwinks visuelle kasteindikator for Bushwhack nogle gange fremhævede træer, der var uden for dens rækkevidde.",
      "[*]Rettede nogle animationsproblemer med Tusks Walrus PUNCH!",
      "[*]Rettede en fejl, hvor Vengeful Spirits Magic Missile med Aghanim's Shard kunne hoppe til usynlige fjender, som var immune overfor True Sight.",
      "[*]Rettede et problem med partiklerne for Voodoo Restoration på Witch Doctors udødelige våben Awaleb's Trundleweed.",
      "[*]Rettede fremhævning på den neutrale genstandsplads, så den kun fremhæves, når der er mindst én ledig polet i lageret, i stedet for en hvilken som helst genstand fra en holdkammerat.",
      "[*]Rettede et problem, hvor brug af en evne, når Alt blev holdt nede, også pingede.",
      "[*]Rettede, at levetiden for Wards og hidkaldte enheder overlappede med grænsefladen.",
      "[*]Rettede, at talentbeskrivelser nogle gange blev blokeret af genvejsnavne.",
      "[*]Rettede, at tårnnægtelser blev vist som chatbeskeder og ikke kamphændelser.",
      "[*]Rettede, at klistermærker blev vist som tilgængelige i arsenalet, selvom kapslen, som klistermærkerne var i, ikke var tilgængelig.",
      "[*]Rettede, at klistermærkekapsler fra afsluttede begivenheder blev vist som tilgængelige til at købe.",
      "[*]Rettede, at vinduet om modtagne genstande ikke viste globale genstande korrekt.",
      "[*]Rettede et problem i \"Ikke rangeret\", hvor markering af alle spiltilstande kunne gøre sektionen ubrugelig.",
      "[*]Rettede, at professionelle spilleres Steam-navn nogle gange blev vist i stedet for de korrekte navne.",
      "[*]Rettede, at lange navne løb over på historik- og kampstatistiksider.",
      "[*]Tilføjede en ekstra besked til dem, som skaber tilpassede spil i værkstedet, som endnu ikke har opdateret deres tilpassede modeller fra det forældede format før ModelDoc, som beskrevet i [url=https://www.dota2.com/springcleaning]forårsrengøringsopdateringen 2022[/url] og [url=https://www.dota2.com/newsentry/3659774959159800240]Dead Reckoning-opdateringen[/url].",
      "[/list]"
    ],
    "commentcount": 819,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "mod_require_rereview"
    ],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 7648,
    "votedowncount": 1292,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1703802309,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703279956,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7648,
  "votes_down": 1292,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}