{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "A atualização de Frostivus de 2023 chegou!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "A atualização de Frostivus de 2023 chegou!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Outro Frostivus chegou, o que significa que o Papai Cruel despertou da sua hibernação sob o Mar Sangrento que contorna o Castelo de Frostivus; enviou as suas legiões de crianças-goblin mineradoras de brinquedos para escavar as suas minas de brinquedos; acorrentou Lumpo e Rupertus, os seus lobos gigantes gêmeos dos olhos vermelhos, ao seu trenó de ossos; e provavelmente está em cima (ou mesmo dentro) da sua casa nesse instante.",
      "Se você está na lista dos comportados, prepare-se para enfeitar os seus corredores congelados com novos (e o retorno de alguns) cosméticos de Frostivus, várias melhorias para o cliente, novos conjuntos exclusivos para o Dota+ e a atualização de jogabilidade 7.35 — saiba mais sobre tudo isso clicando [url=https://www.dota2.com/frostivus2023]aqui[/url].",
      "Por outro lado, se você está na lista dos levados, nós temos más notícias para você, e boas para as outras pessoas — esse ano será um banho de sangue. Você deve se lembrar de [url=https://www.dota2.com/newsentry/3692442542242977036]setembro[/url], quando usamos o martelo do banimento para banir permanentemente 90.000 contas [i]smurfs[/i]. Desde então, continuamos investindo no monitoramento do comportamento dos jogadores, com análise manuais e também automáticas. Durante as últimas semanas, preparamos uma onda de banimento ainda mais agressiva, incluindo várias dezenas de milhares de contas [i]smurfs[/i] no dia de hoje.",
      "No International, alguns jogadores profissionais entraram em contato conosco para conversar sobre as suas contas [i]smurfs[/i]. Esses diálogos continuaram, e há um grande entendimento entre os profissionais sobre como o banimento dessas contas [i]smurfs[/i] seria uma grande vitória para comunidade do Dota: as regras devem ser aplicadas a todos, e, daqui em diante, elas serão. E a prática de [i]smurf[/i] não é a única travessura que alguns jogadores praticam. Entre outras escolhas questionáveis, algumas pessoas mal-intencionadas gostam de jogar como babacas, estragando partidas (e portanto perdendo nota comportamental) para em seguida contratar \"impulsionadores comportamentais\" para aumentá-la novamente.",
      "Independentemente de [i]qual[/i] foi a sua travessura, nós estivemos de olho (não enquanto você dorme, calma!) e estamos acabando com isso. Punições serão aplicadas para todos os casos acima, incluindo penalidades de nota comportamental — e, em casos mais graves, banimento da conta principal. ",
      "Como já falamos antes, a prática de [i]smurf[/i] (e outros comportamentos negativos) piora as partidas — e nós queremos garantir que todas as partidas sejam as melhores possíveis conforme caminhamos para um novo ano. Então gostaríamos de desejar a todos uma [url=https://www.dota2.com/frostivus2023]Feliz atualização de Frostivus[/url]! Menos para as contas [i]smurfs[/i], que acreditamos que não curtirão muito essas novidades enquanto saboreiam uma merecida sobremesa de carvão.",
      "[b]Baú de Tesouro de Frostivus de 2023:[/b]",
      "[list]",
      "[*]Cada baú contém um entre 30 itens divididos em quatro classes, ou um entregador Bebê Roshan cosmicamente raro.",
      "[*]Itens da mesma classe têm a mesma raridade.  Dentro de cada classe, você não receberá itens repetidos até abrir todos os disponíveis.",
      "[*]Cinco itens da mesma classe podem ser trocados por um item aleatório da classe superior.",
      "[*]O item cosmicamente raro está presente em baús em uma proporção de 1:100.000.  Os demais baús contêm um item de uma das quatro classes.  A partir da classe 1, cada item tem 10% de chance de ser aprimorado para a classe seguinte.",
      "[*]Ao abrir um baú ou trocar itens, há uma chance de 1:300 de receber um item adicional Incomum — seja uma cópia do item, ou, caso seja um conjunto, um de seus itens.  Cada item Incomum tem um efeito especial aleatório.  Os três efeitos têm a mesma raridade.",
      "[/list]",
      "[b]Correção de erros:[/b]",
      "[list]",
      "[*]Correção de problema que fazia com que, caso um herói fosse morto na Cronosfera e largasse uma Gema da Visão Verdadeira, o intervalo entre usos dela continuaria congelado.",
      "[*]Correção de travamento raro ao combinar itens.",
      "[*]Correção de problema que fazia com que, caso uma habilidade com o intervalo entre usos congelado fosse congelada novamente, ocorria um descongelamento precoce.",
      "[*]Correção de problema com habilidades com efeitos intrínsecos, que podiam não tê-los aplicados ao comprar um Fragmento de Aghanim.",
      "[*]Correção de problema com a exibição do círculo de alcance de uso, que não era atualizado ao alterar habilidades (ou montar uma Lente do Éter, por exemplo) caso já estivesse sendo exibido.",
      "[*]Chaos Knight: correção das partículas do Raio Caótico, que às vezes ficavam no lugar errado.",
      "[*]Dawnbreaker: correção de Quebra-Estrelas, que estava concedendo imunidade a dano puro sem o Fragmento de Aghanim.",
      "[*]Earthshaker: correção do conjunto \"Ligamentos do Magma Profundo\", para exibir as partículas corretas (novas) para o novo estilo (Aniversário de 10 Anos) e excluí-las corretamente ao expirar.",
      "[*]Hoodwink: correção do Enredamento, cuja retícula de uso às vezes realçava árvores fora da área de efeito.",
      "[*]Tusk: correção de alguns problemas de animação do Soco Morsal!",
      "[*]Vengeful Spirit: correção de problema com o Míssil Mágico aprimorado pelo Fragmento de Aghanim, que podia rebater para inimigos invisíveis imunes a Visão Verdadeira.",
      "[*]Witch Doctor: correção de problema com as partículas do Vudu Restaurador ao usar o Imortal Florescer de Awaleb.",
      "[*]Correção do destaque do compartimento de item neutro, para ser realçado somente caso haja ao menos uma ficha disponível no armário.",
      "[*]Correção de problema que fazia com que usar uma habilidade ao pressionar Alt também causava uma sinalização.",
      "[*]Correção de problema com os contadores de tempo de sentinelas e unidades invocadas, que estavam cortados na interface.",
      "[*]Correção de caos em que a descrição de talentos podia ser bloqueada pelos atalhos.",
      "[*]Correção da mensagem de negação de torres, que estava sendo exibida na conversa e não como um evento de combate.",
      "[*]Correção de adesivos que estavam sendo exibidos como disponíveis no arsenal mesmo quando a sua cápsula não estava disponível.",
      "[*]Correção da exibição de cápsulas de adesivos de eventos expirados, que estavam sendo exibidas como compráveis.",
      "[*]Correção da janela de notificação de recebimento de itens, que não estava exibindo itens globais corretamente.",
      "[*]Correção de problema com o modo casual, em que selecionar \"Exibir todos os modos\" podia inutilizar a seção.",
      "[*]Correção da exibição indevida de apelidos do Steam como nomes de alguns jogadores profissionais.",
      "[*]Correção de sobreposição de nomes longos nas páginas de histórico e estatísticas de batalha.",
      "[*]Adição de nova notificação para criadores de modos alternativos que não atualizaram os seus modelos personalizados usando o novo formato ModelDoc, conforme descrito na [url=https://www.dota2.com/springcleaning]atualização Limpando a Poeira de 2022[/url] e na [url=https://www.dota2.com/newsentry/3659774959159800240]atualização da Retaliação Mortal[/url].",
      "[/list]"
    ],
    "commentcount": 879,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 12621,
    "votedowncount": 1894,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1708470491,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12621,
  "votes_down": 1894,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}