{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "C'est parti pour Frostivus 2023 !",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "C'est parti pour Frostivus 2023 !",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "La saison de Frostivus est là ! Cela ne peut signifier qu'une chose : le Roi Fouettard, qui hibernait tranquillement sous la mer sanguinaire qui entoure le château de Frostivus, est sorti de son sommeil. Il a envoyé ses légions d'enfants gobelins mineurs de jouets exploiter ses mines de jouets, et il a attaché ses loups du Dire aux yeux rouges flamboyants, Lumpo et Rupertus, à son traineau osseux. À l'heure actuelle, il est probablement sur votre toit… ou dans votre maison.",
      "Alors, si vous êtes sur la liste des enfants sages, préparez-vous à retrouver de la déco festive ainsi que de nouveaux cosmétiques aux couleurs de Frostivus, et à découvrir une tonne d'améliorations de confort pour le client, de nouveaux ensembles Dota Plus et la mise à jour du gameplay 7.35. Pour tout savoir, [url=https://www.dota2.com/frostivus2023]rendez-vous ici[/url].",
      "Par contre, si vous n'avez pas été sage, tout le monde va pouvoir se réjouir de votre malheur : cette année va être un bain de sang. Vous souvenez-vous qu'[url=https://www.dota2.com/newsentry/3692442542242977036]en septembre[/url], nous avions employé les grands moyens et banni 90 000 comptes smurfs ? Nous avons depuis continué à déployer nos efforts dans la surveillance des comportements de comptes, à la fois de manière manuelle et automatique. Ces dernières semaines, nous avons entrepris une vague de bannissements encore plus agressive, dont plusieurs dizaines de milliers de comptes smurf bannis rien qu'aujourd'hui.",
      "Lors de The International, certains joueurs pros nous ont fait part de leurs comptes smurfs. Ces conversations se sont poursuivies, et il y a consensus parmi la communauté professionnelle que le bannissement de ces comptes constitue une amélioration pour la communauté Dota : la règle doit s'appliquer à tout le monde, et à partir de maintenant, c'est le cas. L'utilisation de comptes smurfs est loin d'être la seule vilaine chose que font certains joueurs et joueuses pas très sages. Entre autres activités douteuses, certaines personnes jouant à Dota ont des comportements inacceptables qui mènent à une mauvaise expérience de jeu pour les autres : leur note de conduite est alors dégradée, et elles font appel à des services pour l'augmenter à nouveau artificiellement.",
      "Quelles que soient vos [i]méthodes[/i] douteuses, nous vous surveillons de près (pas quand vous dormez, du calme) et nous ne tolérons plus aucun de ces comportements. Des sanctions seront appliquées pour toutes les actions décrites ci-dessus, y compris une dégradation de la note de conduite et, dans les cas graves, un bannissement du compte principal. ",
      "Comme nous l'avons déjà dit, les comptes smurfs (et tout autre comportement négatif) détériorent la qualité des matchs, et nous souhaitons que vos parties soient les meilleures possibles en cette période où l'on pense à la nouvelle année. Nous souhaitons donc à tout le monde une [url=https://www.dota2.com/frostivus2023]joyeuse mise à jour de Frostivus ![/url] Sauf aux comptes smurfs qui risquent de ne pas apprécier la nouvelle mise à jour tandis qu'ils s'étouffent sur leur dessert au gout de charbon drôlement mérité.",
      "[b]Coffre au trésor de Frostivus 2023[/b]",
      "[list]",
      "[*]Chaque coffre contient l'un des 30 items de la saison, répartis sur 4 niveaux, ou un coursier rarissime bébé Roshan.",
      "[*]Les items d'un même niveau ont la même rareté.  Vous ne recevrez pas d'items en double pour chaque niveau tant que vous n'aurez pas reçu chaque item au moins une fois.",
      "[*]Cinq items d'un même niveau peuvent être échangés contre un item aléatoire du niveau suivant.",
      "[*]L'item rarissime est contenu dans un coffre sur 100 000.  Les autres coffres contiennent un item de l'un des 4 niveaux.  À partir du niveau 1, chaque item a 10 % de chances de passer au niveau suivant.",
      "[*]Lorsque vous ouvrez un coffre ou que vous procédez à un échange, vous avez une chance sur 300 de recevoir un item inhabituel supplémentaire (soit une copie de l'item, soit, s'il s'agit d'un ensemble, l'un des items de cet ensemble).  Chaque item inhabituel bénéficie d'un effet spécial aléatoire.  Les trois effets ont la même rareté.",
      "[/list]",
      "[b]Cette mise à jour inclut également les corrections suivantes.[/b]",
      "[list]",
      "[*]Correction du problème suivant : quand une unité héroïque tuée dans la zone de Chronosphere lâchait Gem of True Sight, le temps de recharge de l'objet restait bloqué.",
      "[*]Correction d'un plantage rare provoqué par les combinaisons d'objets.",
      "[*]Correction du problème suivant : si le temps de recharge déjà mis en pause d'une capacité était remis en pause, il se réactivait trop rapidement.",
      "[*]Correction du problème suivant : dans certains cas, les effets positifs intrinsèques de capacités n'étaient pas appliqués à l'achat de l'Aghanim's Shard.",
      "[*]Correction du problème suivant : quand on changeait de capacité (ou que l'on obtenait un objet modifiant la portée d'incantation, comme Aether Lens), le périmètre de la portée d'incantation ne changeait pas s'il était déjà affiché.",
      "[*]Correction du problème suivant : les particules de Chaos Bolt de Chaos Knight apparaissaient parfois au mauvais endroit.",
      "[*]Correction du problème suivant : Starbreaker de Dawnbreaker conférait l'immunité contre les dégâts purs sans l'Aghanim's Shard.",
      "[*]Correction du problème suivant : le style du 10ᵉ anniversaire de l'ensemble « Magma abyssal » d'Earthshaker n'avait pas les bonnes particules, et les anciennes ne disparaissaient pas correctement à la fin de l'effet.",
      "[*]Correction du problème suivant : le réticule d'incantation pour Bushwack de Hoodwink mettait parfois en évidence les arbres en dehors de la zone d'effet.",
      "[*]Correction de certains problèmes relatifs à l'animation de Walrus Punch de Tusk.",
      "[*]Correction du problème suivant : avec l'Aghanim's Shard, Magic Missile de Vengeful Spirit pouvait rebondir sur des unités ennemies invisibles immunisées contre True Sight.",
      "[*]Correction d'un problème avec les particules de Voodoo Restoration de Witch Doctor qui se produisait quand l'item immortel « Plante curative d'Awaleb » était équipé.",
      "[*]Correction du problème suivant : l'emplacement de l'objet neutre était mis en évidence dès lors qu'un objet avait été déposé dans la réserve par l'équipe, même s'il ne s'agissait pas d'un jeton neutre.",
      "[*]Correction du problème suivant : quand on lançait une capacité tout en maintenant ALT, cela envoyait également un ping.",
      "[*]Correction du problème suivant : les chronomètres pour les Wards et les unités invoquées étaient tronqués sur le HUD.",
      "[*]Correction du problème suivant : les descriptions des talents étaient parfois cachées par les noms des raccourcis.",
      "[*]Correction du problème suivant : quand une tour était sacrifiée, un message était envoyé dans le chat au lieu d'être ajouté au journal d'évènements.",
      "[*]Correction du problème suivant : les autocollants s'affichaient comme disponibles dans l'armurerie alors que la capsule les contenant ne l'était pas forcément.",
      "[*]Correction du problème suivant : les capsules d'autocollants d'évènements terminés s'affichaient comme disponibles à l'achat.",
      "[*]Correction du problème suivant : la fenêtre contextuelle apparaissant quand l'on reçoit un item n'affichait pas correctement les items globaux.",
      "[*]Correction du problème suivant : en mode non classé, cocher l'option « Afficher tous les modes » pouvait rendre la section inutilisable.",
      "[*]Correction du problème suivant : parfois, le nom de profil Steam des pros s'affichait au lieu de leur vrai nom.",
      "[*]Correction du problème suivant : les noms longs dépassaient sur les pages de l'historique et des statistiques de bataille.",
      "[*]Ajout d'une notification supplémentaire pour les créateurs et créatrices de parties personnalisées dans le Workshop dont les modèles n'ont toujours pas été mis à jour et sont encore au format obsolète, comme décrit dans la [url=https://www.dota2.com/springcleaning]mise à jour du nettoyage de printemps 2022[/url] et la [url=https://www.dota2.com/newsentry/3659774959159800240]mise à jour Dead Reckoning[/url].",
      "[/list]"
    ],
    "commentcount": 871,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 11178,
    "votedowncount": 1767,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1705340693,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11178,
  "votes_down": 1767,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}