{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus 2023-oppdateringen er her!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Frostivus 2023-oppdateringen er her!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Nok en Frostivus er over oss, og det betyr at nissen har våknet fra dvalen sin under de vinmørke blodsjøene som omfavner Frostivus slott, har sendt legioner av bortførte nissebarn som leketøysgruvearbeidere for å grave i leketøysgruvene, spent de glødende, rødøyede tvillingulvene Lumpo og Rupertus til beinsleden og er sannsynligvis enten på toppen av huset ditt eller inni det akkurat nå.",
      "Så om du er på den snille listen, gjør deg klar for nye og gjeninnførte pyntegjenstander fra Frostivus, en haug med kvalitetsforderinger til klientfunksjoner, nye premiumsett i Dota Plus og spilloppdatering 7.35. Alt dette kan du lese mer om [url=https://www.dota2.com/frostivus2023]her[/url].",
      "På den andre siden, hvis du er på den slemme listen, har vi gode nyheter for alle andre og dårlig nytt for deg, for dette året kommer til å bli et blodbad. Du husker kanskje [url=https://www.dota2.com/newsentry/3692442542242977036]tilbake i september[/url], da vi tok frem hammeren og utestengte 90 000 smurfekontoer permanent. Siden den gang har vi fortsatt å investere i overvåkning av spilleratferd, både med manuell og automatisk analyse. I løpet av de siste ukene har vi iverksatt en enda mer aggressiv utestengelsesbølge, der titusenvis av smurfekontoer ble utestengt bare i dag.",
      "Under The International tok noen proffspillere kontakt med oss for å snakke om smurfekontoene sine. Disse diskusjonene har fortsatt, og proffene er generelt sett enige om at å utestenge profesjonelle smurfekontoer er positivt for Dota som et samfunn. Reglene bør gjelde for alle, og fremover kommer de til å gjøre det. Og smurfing er ikke engang det eneste slemme spillere finner på. Blant andre tvilsomme valg har noen urokråker oppført seg som fjols, sabotert kamper og mistet atferdspoeng som følge, for så å ansette folk til å få atferdspoengene opp igjen.",
      "Uansett [i]hvordan[/i] man har vært slem, så har vi fulgt med (ikke mens dere sover, slapp av), og vi slår ned på alt. Straff deles ut for alt ovenfor, inkludert reduksjon i atferdspoeng – og i grove tilfeller, utestengelse av hovedkontoer. ",
      "Som vi har sagt før så gjør smurfing (og annen negativ atferd) kamper verre, og vi har lyst til å sørge for at kamper blir så gode som mulig på nyåret. Så vi vil gjerne ønske alle en gledelig [url=https://www.dota2.com/frostivus2023]Frostivus-oppdatering![/url] Utenom smurfekontoer, som vi regner med ikke vil ha glede av oppdateringen mens de setter sine velfortjente, kullsmakende anretninger i halsen.",
      "[b]Frostivus-skattkiste 2023:[/b]",
      "[list]",
      "[*]Hver kiste inneholder en av 30 gjenstander fordelt på 4 kategorier eller en kosmisk sjelden Baby Roshan-kurer.",
      "[*]Gjenstander i samme kategori har samme sjeldenhet.  Du mottar ikke dupliserte gjenstander fra hver kategori inntil du har mottatt hver gjenstand en gang.",
      "[*]Fem gjenstander i samme kategori kan byttes inn mot en tilfeldig gjenstand fra neste kategori.",
      "[*]Den kosmisk sjeldne gjenstanden finnes i 1 av 100 000 kister.  Andre kister inneholder en gjenstand fra en av de 4 kategoriene.  Fra kategori 1 har hver gjenstand en 10 % sjanse til å oppgraderes til neste kategori.",
      "[*]Når man åpner en kiste eller bytte inn en gjenstand, så har man en sjanse på 1 til 300 for å motta en ytterligere uvanlig gjenstand – enten en kopi av gjenstanden, eller hvis den er et sett, én av gjenstandene i settet.  Hver uvanlige gjenstand har en tilfeldig spesiell effekt.  De tre effektene har lik sjeldenhet.",
      "[/list]",
      "[b]Feilrettinger:[/b]",
      "[list]",
      "[*]Fikset et problem som gjorde at Gem of True Sights nedkjøling forble frosset hvis den ble sluppet av en helt som ble drept i Chronosphere.",
      "[*]Fikset et sjeldent krasj med kombinasjon av gjenstander.",
      "[*]Fikset en feil der nedkjølingen opphørte for tidlig hvis en gjenstand med frosset nedkjøling, fikk nedkjølingen frosset igjen.",
      "[*]Fikset et problem der evner med iboende styrkelser kunne unnlate å få dem påført ved kjøp av Aghanim's Shard.",
      "[*]Fikset et problem der bytte av evner (eller å få Aether Lens osv.) ikke oppdaterte sirkelen for bruksrekkevidde hvis den allerede ble vist.",
      "[*]Fikset at partiklene til Chaos Knights Chaos Bolt av og til mistet plasseringen sin.",
      "[*]Fikset at Dawnbreakers Starbreaker av og til gav immunitet mot ren skade uten Aghanim's Shard.",
      "[*]Fikset settet Bindings of Deep Magma til Earthshaker slik at det viser riktige (nye) partikler for den nye stilen (tiårsjubileum) og at det sletter partikler ordentlig ved utløp.",
      "[*]Fikset at bruksindikatoren til Hoodwinks Bushwhack av og til belyste trær på utsiden av virkeområdet.",
      "[*]Fikset noen animasjonsproblemer med Tusks Walrus PUNCH!",
      "[*]Fikset en feil der Vengeful Spirits Magic Missile med Aghanim's Shard kunne hoppe over til usynlige fiender som var immune mot klarsyn.",
      "[*]Fikset et problem med Voodo Restoration-partiklene på Witch Doctors udødelige våpen Awalebs Trundleweed.",
      "[*]Fikset fremheving på den nøytrale gjenstandsplassen slik at den bare fremheves når det er minst én ledig mynt i forrådet, heller enn gjenstander fra en lagkamerat.",
      "[*]Fikset et problem som gjorde at bruk av en evne når man holder inne Alt også plinget.",
      "[*]Fikset at levetiden for varder og tilkalte enheter ble avskåret i grensesnittet.",
      "[*]Fikset at beskrivelser av talenter av og til ble blokkerte av navnene til hurtigtaster.",
      "[*]Fikset at berøvelser av tårn ble vist som samtalemeldinger heller enn kamphendelser.",
      "[*]Fikset at klistremerker ble vist som tilgjengelige i arsenalet selv om kapselen som inneholder klistremerkene, kanskje ikke er tilgjengelig.",
      "[*]Fikset at klistremerkekapsler fra avsluttede begivenheter ble vist som at de kunne kjøpes.",
      "[*]Fikset at sprettoppvinduet for mottatt gjenstand ikke viste globale gjenstander ordentlig.",
      "[*]Fikset et problem med spillmenyen til urangert der «Vis alle moduser» kunne føre til at seksjonen ble ubrukelig.",
      "[*]Fikset at profesjonelle spilleres Steam-navn av og til ble vist istedenfor riktig navn.",
      "[*]Fikset at lange navn fløt over i sidene for historikk og kampstatistikk.",
      "[*]La til ytterligere varsel for skapere av tilpassede spill i Workshopen som ikke enda har oppdatert tilpassede modeller bort fra det foreldede formatet før ModelDoc, som beskrevet i [url=https://www.dota2.com/springcleaning]vårrengjøringsoppdateringen 2022[/url] og i [url=https://www.dota2.com/newsentry/3659774959159800240]Dead Reckoning-oppdateringen[/url].",
      "[/list]"
    ],
    "commentcount": 871,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 11178,
    "votedowncount": 1767,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1705340693,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11178,
  "votes_down": 1767,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "3884981125532748792",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}