{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "È arrivato l'aggiornamento del Frostivus 2023!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "È arrivato l'aggiornamento del Frostivus 2023!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Un altro Frostivus è alle porte, il che significa che Babbo Spettrale si è risvegliato dal suo letargo nei Mari Sanguinari che circondano il Castello del Frostivus, ha inviato le sue legioni di goblin bambini a scavare nelle miniere di giocattoli, ha legato i lupi mannari Lumpo e Rupertus alla sua slitta d'ossa e probabilmente ora si trova sul tetto di casa tua o direttamente al suo interno.",
      "Se sei nella lista dei buoni, preparati ad accogliere lo spirito festivo con oggetti del Frostivus vecchi e nuovi, tantissime migliorie al client, nuovi set premium di Dota Plus e l'aggiornamento di gioco 7.35, con tutti i dettagli disponibili in [url=https://www.dota2.com/frostivus2023]questa pagina[/url].",
      "D'altro canto, se sei nella lista dei cattivi, abbiamo ottime notizie per tutti gli altri e pessime notizie per te, poiché quest'anno sarà un bagno di sangue. Forse ricorderai che [url=https://www.dota2.com/newsentry/3692442542242977036]lo scorso settembre[/url] abbiamo agito con il pugno di ferro e bandito in modo permanente 90.000 account smurf. Da allora abbiamo continuato a investire nel monitoraggio del comportamento dei giocatori, sia con analisi manuali che automatiche. Le ultime settimane hanno visto un'ondata di ban ancora più aggressiva della precedente, con decine di migliaia di account smurf banditi solamente nella giornata di oggi.",
      "Al The International, alcuni giocatori professionisti sono venuti da noi per parlarci dei loro account smurf. Da queste conversazioni abbiamo appreso che c'è un ampio consenso sul fatto che bandire gli account smurf dei giocatori professionisti sia vantaggioso per l'intera Comunità di Dota: le regole devono valere per tutti e d'ora in avanti sarà così. Tuttavia, lo smurfing non è l'unica monelleria dei giocatori. Tra le altre attività discutibili, alcuni malintenzionati scelgono di giocare in modo deplorevole, rovinando le partite e il loro punteggio di condotta, per poi incaricare altre persone di ripristinarlo con alcuni stratagemmi.",
      "Indipendentemente da [i]quale[/i] sia stata la tua marachella, ti abbiamo tenuto d'occhio (non mentre dormivi, tranquillo) e stiamo adottando le misure necessarie. Puniremo i giocatori per tutte le violazioni descritte sopra, anche attraverso penalità al punteggio di condotta e ban degli account principali nei casi più gravi. ",
      "Come detto in precedenza, lo smurfing (e altri comportamenti deleteri) peggiorano le partite, mentre il nostro obiettivo è garantire che le partite siano della migliore qualità possibile in vista del nuovo anno. Auguriamo a tutti un [url=https://www.dota2.com/frostivus2023]buon aggiornamento del Frostivus[/url], ad eccezione degli account smurf che probabilmente non apprezzeranno il loro benservito al sapore di carbone.",
      "[b] Scrigno del tesoro del Frostivus 2023: [/b]",
      "[list]",
      "[*]Ogni scrigno contiene uno dei 30 oggetti suddivisi su 4 livelli o un Corriere \"Roshan Bambino\" universalmente raro.",
      "[*]Gli oggetti dello stesso livello hanno la stessa rarità.  Non riceverai doppioni dello stesso livello finché non avrai ottenuto tutti gli oggetti di quel livello.",
      "[*]Cinque oggetti dello stesso livello possono essere scambiati con un oggetto casuale del livello successivo.",
      "[*]L'oggetto universalmente raro è contenuto in 1 scrigno su 100.000.  Gli altri scrigni contengono un oggetto di uno dei 4 livelli.  A partire dal livello 1, ogni oggetto ha una probabilità del 10% di passare al livello successivo.",
      "[*]Quando apri uno scrigno o scambi qualcosa per un oggetto di livello superiore, avrai una probabilità su 300 di ricevere un oggetto Insolito aggiuntivo, che può essere una copia dello stesso oggetto o, se si tratta di un set, uno degli oggetti di quel set.  Ogni oggetto Insolito ha un effetto speciale casuale.  I tre effetti hanno la stessa rarità.",
      "[/list]",
      "[b]Bug corretti:[/b]",
      "[list]",
      "[*]Risolto il problema per cui il tempo di ricarica della Gemma della Vera Visione rimaneva bloccato quando veniva fatta cadere da un Eroe ucciso nella Cronosfera.",
      "[*]Risolto un crash raro legato alla combinazione degli oggetti.",
      "[*]Risolto il problema per cui il tempo di ricarica bloccato di un'abilità si sbloccava troppo presto se veniva bloccato una seconda volta.",
      "[*]Risolto il problema per cui gli effetti positivi intrinseci di alcune abilità non potevano essere applicati dopo l'acquisto di un Frammento di Aghanim.",
      "[*]Risolto il problema per cui passare da un'abilità all'altra (od ottenere la Lente Eterea, ecc.) non aggiornava l'indicatore della gittata di lancio se questo era già visibile.",
      "[*]Risolto il problema per cui talvolta le particelle dell'abilità Dardo del caos di Chaos Knight si trovavano nel punto sbagliato.",
      "[*]Risolto il problema per cui l'abilità Schianto stellare di Dawnbreaker rendeva immuni al danno puro senza il Frammento di Aghanim.",
      "[*]Risolto il problema per cui il set \"I Vincoli del Nucleo Magmatico\" di Earthshaker non mostrava le (nuove) particelle del nuovo stile (decimo anniversario) e non le eliminava correttamente allo scadere dell'effetto.",
      "[*]Risolto il problema per cui talvolta il reticolo di lancio dell'abilità Imboscata di Hoodwink evidenziava gli alberi all'esterno dell'area d'effetto.",
      "[*]Risolti alcuni problemi di animazione con l'abilità Pugno del TRICHECO di Tusk.",
      "[*]Corretto un bug per cui l'abilità Missile magico di Vengeful Spirit con il Frammento di Aghanim rimbalzava contro i nemici invisibili immuni alla Vera visione.",
      "[*]Risolto un problema con le particelle dell'abilità Rigenerazione vudù sull'arma Immortale \"Fiore di Awaleb\".",
      "[*]Ora lo slot degli oggetti neutrali viene evidenziato soltanto se nella Scorta c'è almeno un gettone disponibile e non più un qualsiasi oggetto di un qualsiasi alleato.",
      "[*]Risolto il problema per cui lanciare un'abilità tenendo premuto ALT inviava anche una segnalazione in chat.",
      "[*]Risolto un problema di collisione con i timer dei Guardiani e delle Unità evocate nell'interfaccia.",
      "[*]Risolto il problema per cui talvolta le descrizioni dei talenti venivano nascoste dal nome dei tasti associati.",
      "[*]Risolto il problema per cui le negazioni delle Torri apparivano come messaggi di chat anziché eventi di combattimento.",
      "[*]Risolto il problema per cui alcuni adesivi risultavano disponibili nell'Arsenale anche se la capsula che li contiene non era disponibile.",
      "[*]Risolto il problema per cui le capsule di adesivi degli eventi passati risultavano acquistabili.",
      "[*]Risolto il problema per cui gli oggetti globali non venivano mostrati correttamente nelle notifiche degli oggetti ricevuti.",
      "[*]Risolto il problema nel menu della modalità non classificata per cui una sezione diventava inutilizzabile selezionando l'opzione \"Vedi tutte\".",
      "[*]Risolto il problema per cui talvolta veniva mostrato il nome del profilo di Steam dei giocatori professionisti anziché il nome corretto.",
      "[*]Risolto un problema di visualizzazione dei nomi più lunghi nelle pagine dello storico e delle statistiche di battaglia.",
      "[*]Aggiunta una notifica per gli autori delle modalità personalizzate nel Workshop che non hanno ancora aggiornato i propri modelli al nuovo formato ModelDoc, come descritto nell'[url=https://www.dota2.com/springcleaning]aggiornamento delle pulizie di primavera 2022[/url] e nell'[url=https://www.dota2.com/newsentry/3659774959159800240]aggiornamento del Giudizio Mortale[/url].",
      "[/list]"
    ],
    "commentcount": 819,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "mod_require_rereview"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 7648,
    "votedowncount": 1292,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1703802309,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703279956,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7648,
  "votes_down": 1292,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}