{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Chegou a atualização do Frostivus de 2023!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Chegou a atualização do Frostivus de 2023!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Temos mais um Frostivus à porta, o que significa que o Pai Espectral despertou da sua hibernação sob os tintos Mares Sangrentos que banham o Castelo de Frostivus; invocou as suas legiões de pequenos goblins raptados para trabalhar nas suas minas de brinquedos; prendeu os seus temíveis lobos Lumpo e Rupertus ao seu trenó fantasmagórico e é provável que esteja ou no teu telhado ou dentro da tua casa agora mesmo.",
      "Por isso, se estiveres na lista de crianças que se portaram bem este ano, prepara‑te para decorar a lareira com novos e antigos itens cosméticos de Frostivus, uma mão‑cheia de melhoramentos da qualidade geral do jogo, novos conjuntos premium do Dota Plus e a atualização de jogabilidade 7.34, sobre os quais podes ler [url=https://www.dota2.com/frostivus2023]aqui mesmo[/url].",
      "Mas se estiveres na lista dos que se portaram mal, temos boas notícias para todas as outras pessoas e más notícias para ti, porque este ano vai ser um massacre. Ainda te deves lembrar como, [url=https://www.dota2.com/newsentry/3692442542242977036]no passado mês de setembro[/url], banimos permanentemente 90 000 contas smurf. Desde então, continuámos a investir na monitorização do comportamento dos jogadores, tanto a nível manual como automático. Ao longo das últimas semanas, banimos agressivamente ainda mais contas, incluindo as dezenas de milhares de contas smurf que banimos só hoje.",
      "No International, alguns jogadores profissionais falaram connosco sobre as suas contas smurf. Essas conversas continuaram e a maioria dos profissionais parece concordar que banir contas smurf de jogadores profissionais é vantajoso para o Dota enquanto comunidade: as regras devem aplicar‑se a toda a gente e, a partir de hoje, assim aplicar‑se‑ão. E ter contas smurf não é a única marotice de muitos jogadores. Entre outras atividades duvidosas, alguns infratores jogam com um comportamento deplorável, estragam partidas e perdem pontuação de conduta só porque podem e, de seguida, pedem a outras pessoas para manipular e restaurar essa pontuação.",
      "Independentemente de [i]como[/i] a comunidade se portou mal este ano, temos estado de olho nos jogadores (não enquanto dormem, calma) e tomaremos medidas quanto a isso. Iremos punir os jogadores pelas infrações mencionadas acima, incluindo penalidades na pontuação de conduta e, em casos mais graves, banimentos de contas principais. ",
      "Como dissemos antes, smurfing (e outras atividades negativas) pioram as partidas e queremos garantir que as partidas dos jogadores sejam o mais agradáveis possível neste virar do ano. Portanto, gostaríamos de desejar a todos uma [url=https://www.dota2.com/frostivus2023]boa atualização de Frostivus[/url]! Exceto às contas smurf, que provavelmente não irão gostar dos merecidos pedaços de carvão que a atualização lhes vai trazer.",
      "[b]Tesouro de Frostivus 2023:[/b]",
      "[list]",
      "[*]Cada tesouro contém um de 30 itens divididos em 4 Categorias ou um estafeta Roshan Bebé Cosmicamente Raro.",
      "[*]Os itens da mesma Categoria têm uma probabilidade igual de sair.  Não irás receber itens repetidos de cada Categoria até receberes cada item uma vez.",
      "[*]Cinco itens da mesma Categoria podem ser convertidos num item aleatório da Categoria seguinte.",
      "[*]Um em cada 100 000 tesouros contém o item Cosmicamente Raro.  Os outros tesouros contêm um item de uma das quatro Categorias.  A partir da Categoria 1, cada item tem uma probabilidade de 10% de ser da Categoria seguinte.",
      "[*]Ao abrir um tesouro ou ao converter itens num novo, existe uma probabilidade de 1 em 300 de receberes um item Inusual adicional, que pode ser uma cópia do item ou, se for um conjunto, um dos itens desse conjunto.  Cada item Inusual tem um efeito especial aleatório.  Os três efeitos têm a mesma probabilidade de serem atribuídos.",
      "[/list]",
      "[b]Correções de bugs:[/b]",
      "[list]",
      "[*]Foi corrigido um caso em que, se um herói morto na Chronosphere largasse uma Gem of True Sight, o cooldown do item ficava congelado.",
      "[*]Foi corrigida uma falha crítica relacionada com combinações de itens.",
      "[*]Foi corrigido um caso em que, se o cooldown de uma habilidade com um cooldown congelado fosse congelado novamente, o cooldown era descongelado demasiado cedo.",
      "[*]Foi corrigido um caso em que habilidades com buffs intrínsecos não os podiam aplicar ao comprar um Aghanim's Shard.",
      "[*]Foi corrigido um caso onde a troca de habilidades (ou a aquisição de Aether Lens, etc.) não atualizava o círculo do alcance de uso se já estivesse visível.",
      "[*]Chaos Knight: foi corrigido um problema com partículas da habilidade Chaos Bolt, que podiam perder o seu local.",
      "[*]Dawnbreaker: foi corrigido um caso onde a habilidade Starbreaker concedia imunidade a dano puro sem um Aghanim's Shard.",
      "[*]Earthshaker: o conjunto Bindings of Deep Magma foi corrigido para apresentar as partículas (novas) corretas para o novo estilo (do 10.º aniversário) e para eliminar as partículas devidamente ao expirar.",
      "[*]Hoodwink: foi corrigido um problema com a habilidade Bushwhack, cuja retícula de uso podia destacar árvores fora da área de efeito.",
      "[*]Tusk: foram corrigidos alguns problemas de animação da habilidade Walrus PUNCH!",
      "[*]Vengeful Spirit: foi corrigido um bug com a interação de Magic Missile com Aghanim's Shard, cujo projétil podia ressaltar para inimigos imunes invisíveis ao efeito de visão verdadeira (True Sight).",
      "[*]Witch Doctor: foi corrigido um problema com as partículas da habilidade Voodoo Restoration na arma Imortal Awaleb's Trundleweed.",
      "[*]O compartimento para item neutro foi corrigido para apenas destacar quando existe, pelo menos, uma ficha livre na arca, em vez de qualquer item de qualquer companheiro de equipa.",
      "[*]Foi corrigido um caso onde a utilização de uma habilidade com a tecla Alt premida podia também resultar num alerta ping.",
      "[*]Foi corrigido um problema de apresentação de temporizadores de wards e unidades invocadas na interface.",
      "[*]Foram corrigidos casos de descrições de talentos bloqueadas por nomes de atalhos.",
      "[*]Foi corrigido um problema que fazia com que negações de torres aparecessem como mensagens de chat em vez de eventos de combate.",
      "[*]Foi corrigido um caso onde autocolantes apareciam como disponíveis no Arsenal, mesmo se a cápsula respetiva não estivesse disponível.",
      "[*]Foram corrigidos casos onde cápsulas de autocolantes de eventos passados apareciam como disponíveis para compra.",
      "[*]Foi corrigido um problema que impedia itens globais de aparecerem devidamente na notificação de itens recebidos.",
      "[*]Foi corrigido um problema no menu do modo Casual, onde era possível tornar uma secção inutilizável ao assinalar a opção \"Mostrar todos\".",
      "[*]Foram corrigidos casos onde era apresentado o nome de perfil Steam de jogadores profissionais em vez do nome correto.",
      "[*]Foram corrigidos casos de nomes que excediam os limites das páginas do histórico e das estatísticas de batalha.",
      "[*]Foi adicionada uma notificação para criadores de modos customizados do Workshop que ainda não atualizaram modelos antigos para o novo formato ModelDoc, como detalhado na [url=https://www.dota2.com/springcleaning]atualização de Limpeza de Primavera de 2022[/url] e a [url=https://www.dota2.com/newsentry/3659774959159800240]atualização Dead Reckoning[/url].",
      "[/list]"
    ],
    "commentcount": 871,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 11178,
    "votedowncount": 1767,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1705340693,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11178,
  "votes_down": 1767,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}