{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "De Frostivus-update van 2023 is beschikbaar!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1702598202
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "De Frostivus-update van 2023 is beschikbaar!",
    "posttime": 1702597627,
    "updatetime": 1703015246,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Frostivus staat weer voor de deur. Koning Kringle is ontwaakt uit zijn winterslaap onder de wijnkleurige Bloedzeeën rond Kasteel Frostivus. Hij heeft zijn legioenen ontvoerde goblinhulpjes aan het werk gezet in de speelgoedmijnen, heeft zijn bloeddorstige Dire-wolven Lumpo en Rupertus voor zijn slee gespannen en staat nu waarschijnlijk op je dak of in je huis.",
      "Als je op de lijst van de brave kindjes staat, kun je je op heel wat nieuwe en terugkerende Frostivus-versieringen verheugen. Daar komen nog een stapel andere cadeautjes bovenop: een boel kwaliteitsverbeteringen aan de client, nieuwe premiumsets voor Dota Plus en als klap op de Frostivus-vuurpijl ook nog gameplayupdate 7.35, waar je [url=https://www.dota2.com/frostivus2023]hier[/url] alles over kunt lezen.",
      "Maar als je op de lijst van de stoute kindjes staat, dan hebben we goed nieuws voor alle andere spelers en slecht nieuws voor jou, want dit jaar wordt het een bloedbad. Misschien kun je je herinneren dat we in [url=https://www.dota2.com/newsentry/3692442542242977036]september[/url] flink hebben huisgehouden en in één keer 90.000 smurfaccounts permanent hebben verbannen. We blijven het gedrag van spelers in de gaten houden, zowel handmatig als via automatische analyses. De afgelopen weken hebben we nog drastischer opgetreden. Dit resulteerde alleen vandaag al in de verbanning van tienduizenden smurfaccounts.",
      "Op The International spraken sommige pro-spelers ons aan over hun smurfaccounts. We hebben die gesprekken voortgezet en ook onder de pro's is er consensus dat het verbannen van smurfaccounts van pro-spelers een goede ontwikkeling is voor de Dota-community. De regels zouden voor iedereen hetzelfde moeten zijn – en vanaf nu is dat ook zo. En smurfen is niet het enige ondeugende waar spelers mee bezig zijn. Er zijn nog andere zaken aan de gang die ons de wenkbrauwen doen fronsen: sommige spelers verpesten wedstrijden met hun gedrag en verliezen daardoor punten op hun gedragsscore. Vervolgens huren ze andere gebruikers in ('farmers') om hun gedragsscore weer op te krikken.",
      "[i]Hoe[/i] je ook op de stoute lijst terecht bent gekomen, weet dat we je in de gaten houden (niet terwijl je slaapt, geen zorgen) en dat we maatregelen nemen. Al het voorgaande zal bestraft worden, onder meer met straffen op gedragsscores en in ernstige gevallen ook met accountverbanningen. ",
      "Zoals we al eerder zeiden: smurfen en ander negatief gedrag maken het er niet leuker op. En we willen maximaal speelplezier garanderen in het nieuwe jaar! Dus we wensen iedereen een [url=https://www.dota2.com/frostivus2023]Vrolijke Frostivus-update![/url] Behalve smurfaccounts. Zij kunnen de update waarschijnlijk iets minder waarderen, ondanks de extra verrassing die we voor hen hebben klaargezet.",
      "[b]Opgeloste problemen:[/b]",
      "[list]",
      "[*]Probleem opgelost waarbij de afkoeltijd van Gem of True Sight bevroren bleef als een gedode held hem liet vallen in de Chronosphere.",
      "[*]Zeldzame crash opgelost die zich voordeed bij het combineren van items.",
      "[*]Probleem opgelost waarbij het opnieuw bevriezen van een bevroren afkoeltijd van een vaardigheid kon resulteren in het voortijdig ontdooien ervan.",
      "[*]Probleem opgelost waarbij vaardigheden met buffs deze niet konden toepassen bij het kopen van Aghanim's Shard.",
      "[*]Probleem opgelost waarbij het weergegeven spreukbereik niet werd aangepast bij het wisselen van vaardigheden (of het verkrijgen van Aether Lens enz.).",
      "[*]Probleem opgelost waarbij deeltjes van Chaos Bolt van Chaos Knight soms op de verkeerde plaats verschenen.",
      "[*]Probleem opgelost waarbij Starbreaker van Dawnbreaker volledige schade-immuniteit opleverde zonder Aghanim's Shard.",
      "[*]De set Bindings of Deep Magma van Earthshaker toont nu de juiste (nieuwe) deeltjes van de nieuwe stijl (10e verjaardag). De deeltjes verdwijnen ook op het juiste moment.",
      "[*]Probleem opgelost waarbij bij het gebruik van Bushwhack van Hoodwink soms bomen buiten het effectgebied werden gemarkeerd.",
      "[*]Enkele animatieproblemen opgelost voor Walrus PUNCH! van Tusk.",
      "[*]Probleem opgelost waarbij de Magic Missile van Vengeful Spirit met Aghanim's Shard naar onzichtbare vijanden kon stuiteren die immuun zijn voor True Sight.",
      "[*]Probleem opgelost met de deeltjes van Voodoo Restoration op het onsterfelijke wapen Awaleb's Trundleweed van Witch Doctor.",
      "[*]Probleem opgelost met het markeren van het itemvak voor neutrale items, zodat dit vak alleen wordt gemarkeerd als er een fiche in de voorraad aanwezig is en niet meer bij ieder item van elk teamlid.",
      "[*]Probleem opgelost waarbij er ook een ping werd verzonden als er een vaardigheid werd gebruikt terwijl Alt werd ingedrukt.",
      "[*]Probleem opgelost waarbij de timers voor totale levensduur van wards en opgeroepen eenheden werden afgebroken in de HUD.",
      "[*]Probleem opgelost waarbij talentbeschrijvingen soms werden geblokkeerd door de namen van sneltoetsen.",
      "[*]Probleem opgelost waarbij afwijzingen van de toren werden weergegeven als chatberichten en niet als gevechtupdates.",
      "[*]Probleem opgelost waarbij stickers als beschikbaar werden weergegeven in het arsenaal, terwijl de capsule waarin de stickers zitten mogelijk niet beschikbaar is.",
      "[*]Probleem opgelost waarbij stickercapsules van afgelopen evenementen als te koop werden weergegeven.",
      "[*]Probleem opgelost waarbij algemene items niet correct werden weergegeven in de pop-up bij het ontvangen van een item.",
      "[*]Probleem opgelost met unranked spelen waarbij de optie om alle spelmodi weer te geven, ervoor kon zorgen dat de sectie niet meer gebruikt kon worden.",
      "[*]Probleem opgelost waarbij soms de Steam-profielnamen van professionele spelers werden weergegeven in plaats van hun juiste namen.",
      "[*]Probleem met te lange namen opgelost op de pagina's met de geschiedenis en de gevechtsstatistieken.",
      "[*]Nieuwe melding toegevoegd aan de Workshop voor ontwikkelaars van aangepaste spellen waarvan de modellen nog niet zijn overgezet naar ModelDoc, zoals beschreven in de [url=https://www.dota2.com/springcleaning]Voorjaarsschoonmaak-update van 2022 [/url] en de [url=https://www.dota2.com/newsentry/3659774959159800240]Dead Reckoning-update[/url].",
      "[/list]"
    ],
    "commentcount": 768,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "mod_require_rereview"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 5934,
    "votedowncount": 1083,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 2,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1703015247,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1702610296,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 5934,
  "votes_down": 1083,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}