{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "อัปเดต Frostivus 2023 มาแล้ว!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702597620,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1702597626
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "อัปเดต Frostivus 2023 มาแล้ว!",
    "posttime": 1702597627,
    "updatetime": 1702597627,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "เทศกาล Frostivus ใกล้มาถึงอีกครั้ง ซึ่งหมายความว่าราชาซานตาจิตป่วนได้ตื่นจากการจำศีลใต้ทะเลเลือดสีไวน์เข้มที่ห้อมล้อมปราสาท Frostivus อยู่ เขาส่งกองทัพตุ๊กตาก็อบลินน้อยนักขุดแร่ที่ลักพาตัวมาออกไปขุดเจาะในเหมืองของเล่นของเขา อีกทั้งยังจับหมาป่าโลกันตร์ตาแดงเรืองแสงคู่แฝดที่ชื่อ Lumpo กับ Rupertus มาเทียมรถเลื่อนโครงกระดูกของเขา และมีแนวโน้มว่าตอนนี้รถเลื่อนคันนั้นน่าจะอยู่บนหลังคาบ้านของคุณหรือไม่ก็ภายในบ้านแล้ว",
      "ดังนั้น หากคุณอยู่ในรายชื่อเด็กดีของเขา ก็เตรียมพบกับห้องโถงอันหนาวเหน็บที่ตกแต่งด้วยของตกแต่ง Frostivus ทั้งที่เป็นของใหม่และของเก่าที่หวนกลับมา พร้อมด้วยคุณสมบัติปรับปรุงเสริมความสะดวกมากมาย ชุดเซ็ตพรีเมียม Dota Plus ใหม่ ๆ และแพตช์เกมเพลย์ 7.35 โดยคุณสามารถอ่านรายละเอียดทั้งหมดได้[url=https://www.dota2.com/frostivus2023]ที่นี่[/url]",
      "แต่หากคุณอยู่ในรายชื่อเด็กดื้อ เราก็มีข่าวดีสำหรับคนอื่น ๆ และข่าวร้ายสำหรับคุณ เพราะปีนี้จะเป็นปีนองเลือด คุณอาจจำได้ว่า [url=https://www.dota2.com/newsentry/3692442542242977036]ย้อนกลับไปในเดือนกันยายน[/url] เราได้คว้าค้อนแบนบัญชีออกมา และแบนบัญชีสเมิร์ฟอย่างถาวรไปแล้ว 90,000 บัญชี นับแต่นั้นเป็นต้นมา เราได้ลงทุนติดตามพฤติกรรมของผู้เล่นอย่างต่อเนื่อง ทั้งในด้านการวิเคราะห์ด้วยตนเองและการวิเคราะห์แบบอัตโนมัติ ในช่วงสองสามสัปดาห์ที่ผ่านมา เราได้จัดการแบนบัญชีอย่างเข้มงวดยิ่งขึ้น และแค่วันนี้วันเดียว ก็แบนบัญชีสเมิร์ฟไปหลายหมื่นบัญชีแล้ว",
      "ในงาน The International ผู้เล่นมืออาชีพบางคนมาสะกิดไหล่เราเพื่อขอคุยเกี่ยวกับบัญชีสเมิร์ฟที่เกี่ยวข้องกับตน แม้เรายังคุยกันมาเรื่อย ๆ แต่มือโปรทั้งหลายก็เห็นตรงกันในวงกว้างว่าการแบนบัญชีสเมิร์ฟมืออาชีพถือเป็นชัยชนะของชุมชน Dota เพราะกฎควรมีผลบังคับใช้กับทุกคน และจากนี้ไปก็จะเป็นอย่างนั้น ว่าไปแล้วการสเมิร์ฟไม่ใช่กิจกรรมซุกซนอย่างเดียวที่ผู้เล่นจำนวนหนึ่งนิยมทำอยู่ ในบรรดาพฤติกรรมอื่น ๆ ที่เป็นปัญหานั้น ผู้เล่นนิสัยไม่ดีบางคนชอบเล่นเหมือนเด็กเกเร บ่อนทำลายเกม และจึงเสียคะแนนความประพฤติ แต่แล้วก็ไปว่าจ้างพวกนักฟาร์มคะแนนความประพฤติเพื่อกู้คะแนนให้กลับไปดีตามเดิม",
      "ไม่ว่าคุณจะซุกซนแค่[i]ไหน[/i]ก็ตาม ขอให้ทราบว่าเราจับตาดูคุณอยู่ (ไม่ใช่ในขณะที่คุณนอนหลับหรอก อย่ากลัวเลย) และเราจะถอนรากถอนโคนให้เกลี้ยง โดยจะส่งบทลงโทษตามความเหมาะสมกับพฤติกรรมทั้งหมดข้างต้น รวมถึงการหักคะแนนความประพฤติ — และในกรณีที่ร้ายแรง จะมีการแบนบัญชีหลักด้วย ",
      "ดังที่เรากล่าวไว้ก่อนหน้านี้ว่า การสเมิร์ฟ (และพฤติกรรมไม่ดีอื่น ๆ) ทำให้แมตช์แย่ลง และเราต้องการให้แน่ใจว่าคุณจะเล่นแมตช์ได้สนุกที่สุดเท่าที่จะเป็นไปได้ขณะที่เราจะก้าวเข้าสู่ปีใหม่นี้ ในที่สุดนี้ เราขออวยพรให้ทุกคน[url=https://www.dota2.com/frostivus2023]สุขสันต์กับอัปเดต Frostivus![/url] ยกเว้นบัญชีสเมิร์ฟที่เราเข้าใจว่า คงจะไม่เพลิดเพลินกับอัปเดตนี้เท่าไหร่ เพราะน่าจะสำลักขนมหวานรสถ่านหินที่คู่ควรกับพฤติกรรมเกเรของตนไม่ใช่น้อย",
      "[b]การแก้ไขจุดบกพร่อง:[/b]",
      "[list]",
      "[*]แก้ไขปัญหาที่หากฮีโร่ที่ถูกสังหารใน Chronosphere ทำ Gem of True Sight หล่น คูลดาวน์ของ Gem of True Sight จะยังคงถูกแช่แข็งอยู่",
      "[*]แก้ไขปัญหาการแครชซึ่งเกิดขึ้นไม่บ่อยนักเมื่อผสมไอเท็ม",
      "[*]แก้ไขปัญหาที่สกิลซึ่งมีคูลดาวน์ที่ถูกแช่แข็งอยู่แล้วแต่ถูกแช่แข็งคูลดาวน์ซ้ำอีก คูลดาวน์ดังกล่าวจะกลับสู่สภาพปกติเร็วเกินไป",
      "[*]แก้ไขปัญหาที่สกิลซึ่งมีบัฟในตัวอาจไม่แสดงผลเมื่อซื้อ Aghanim's Shard",
      "[*]แก้ไขปัญหาที่การเปลี่ยนสกิล (หรือได้รับ Aether Lens ฯลฯ) จะไม่อัปเดตวงระยะร่ายหากกำลังแสดงระยะอยู่แล้ว",
      "[*]แก้ไขปัญหาที่อนุภาค Chaos Bolt ของ Chaos Knight บางครั้งสูญเสียตำแหน่งของอนุภาค",
      "[*]แก้ไข Starbreaker ของ Dawnbreaker ที่มอบการป้องกันความเสียหายโดยตรงแม้ไม่มี Aghanim's Shard",
      "[*]แก้ไขชุด Bindings of Deep Magma ของ Earthshaker ให้แสดงอนุภาค (ใหม่) ที่ถูกต้องสำหรับรูปแบบใหม่ (ครบรอบ 10 ปี) และให้ลบอนุภาคอย่างถูกต้องเมื่อหมดเวลา",
      "[*]แก้ไข Bushwhack ของ Hoodwink ที่วงแสดงระยะบางครั้งไฮไลต์ต้นไม้ที่อยู่นอกพื้นที่สกิล",
      "[*]แก้ไขปัญหาต่าง ๆ เกี่ยวกับแอนิเมชัน Walrus PUNCH! ของ Tusk",
      "[*]แก้ไขข้อบกพร่องที่ Magic Missile อัปเกรดโดย Aghanim's Shard ของ Vengeful Spirit สามารถชิ่งไปยังศัตรูล่องหนที่ไม่สามารถเปิดเผยโดย True Sight ได้",
      "[*]แก้ไขปัญหาเกี่ยวกับอนุภาค Voodoo Restoration บนอาวุธ Immortal Awaleb's Trundleweed ของ Witch Doctor",
      "[*]แก้ไขการไฮไลต์ในช่องไอเท็มครีปป่าให้แสดงเฉพาะเมื่อมีเหรียญให้ใช้ในคลังเก็บของอย่างน้อย 1 เหรียญเท่านั้น แทนที่จะไฮไลต์เมื่อมีไอเท็มใดก็ตามจากเพื่อนร่วมทีม",
      "[*]แก้ไขปัญหาที่การร่ายสกิลขณะกดปุ่ม Alt ค้างจะทำให้ชี้เตือนไปด้วย",
      "[*]แก้ไขตัวจับเวลาอายุ Ward และยูนิตอัญเชิญที่ถูกตัดใน HUD",
      "[*]แก้ไขปัญหาที่บางครั้งชื่อของปุ่มลัดจะบังคำอธิบายทักษะพิเศษ",
      "[*]แก้ไขปัญหาที่เมื่อ Deny ป้อมจะแสดงเป็นข้อความแช็ตแทนที่จะเป็นข้อความรายละเอียดการต่อสู้",
      "[*]แก้ไขปัญหาที่แสดงสติกเกอร์เป็น \"พร้อมใช้งาน\" ในคลังแสง แม้ว่าแคปซูลที่มีสติกเกอร์เหล่านั้นอยู่อาจไม่พร้อมใช้งานก็ตาม",
      "[*]แก้ไขปัญหาที่มีการแสดงแคปซูลสติกเกอร์จากกิจกรรมที่สิ้นสุดลงไปแล้วว่าสั่งซื้อได้",
      "[*]แก้ไขปัญหาที่หน้าต่างป็อปอัปเมื่อได้รับไอเท็มไม่แสดงไอเท็มสภาพแวดล้อมอย่างถูกต้อง",
      "[*]แก้ไขปัญหาหน้าต่างเล่นเกมแบบไม่จัดอันดับ ซึ่งเมื่อคลิกเลือก \"แสดงโหมดเกมทั้งหมด\" อาจทำให้หน้าต่างไม่สามารถใช้งานได้",
      "[*]แก้ไขปัญหาที่บางครั้งมีการแสดงชื่อแทนตัวบน Steam ของผู้เล่นมืออาชีพ แทนที่จะแสดงชื่อที่ถูกต้อง",
      "[*]แก้ไขชื่อที่ยาวเกินพื้นที่บนหน้าประวัติและสถิติการต่อสู้",
      "[*]เพิ่มการแจ้งเตือนเพิ่มเติมให้แก่ผู้สร้างเกมแบบกำหนดเองในเวิร์กชอป ซึ่งยังไม่ได้อัปเดตโมเดลแบบกำหนดเองของตนให้ต่างจากรูปแบบ pre-ModelDoc ที่เลิกใช้แล้ว ตามที่อธิบายไว้ใน[url=https://www.dota2.com/springcleaning]อัปเดตเทศกาลเก็บกวาดฤดูใบไม้ผลิ 2022[/url] และ[url=https://www.dota2.com/newsentry/3659774959159800240]อัปเดตพิพากษ์มรณะ[/url]",
      "[/list]"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1702597628,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}