{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Nadszedł czas na Mroźny Festiwal 2023!",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Nadszedł czas na Mroźny Festiwal 2023!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Nadszedł kolejny Mroźny Festiwal, a to oznacza, że Mikołajowy Król przebudził się ze swojej hibernacji pod ciemnymi niczym wino Morzami Krwi otaczającymi zamek Mroźnego Festiwalu, wysłał swe legiony porwanych goblińskich dzieci kopiących zabawki, by kopały w jego kopalniach zabawek, zaprzągł do swoich kościanych sań bliźniaczą dwójkę mrokowilków o święcących, czerwonych oczach (Lumpo i Rupertusa) i prawdopodobnie jest na górze twojego domu lub nawet w jego środku właśnie teraz.",
      "A więc jeśli znaleźliście się na jego liście grzecznych graczy, to bądźcie gotowi na zimowe odświeżenie waszej garderoby nowymi i powracającymi przedmiotami ozdobnymi z Mroźnego Festiwalu, tonę funkcji usprawniających klienta gry, nowe zestawy premium Dota Plus i aktualizację rozgrywki 7.35. O wszystkim przeczytacie [url=https://www.dota2.com/frostivus2023]o tutaj[/url].",
      "Z drugiej strony, jeśli trafiliście na listę niegrzecznych graczy, mamy świetne wieści dla każdej innej osoby i nie do końca świetne dla was, bo ten rok będzie krwawą łaźnią. Zapewne pamiętacie [url=https://www.dota2.com/newsentry/3692442542242977036]nasz wpis z września[/url], w którym wspominaliśmy o wyjęciu młota z ładnym napisem „ban” i trwałym zablokowaniu 90 000 kont do smerfowania. Od tego czasu dalej poświęcaliśmy zasoby na monitorowanie zachowania graczy, zarówno po stronie ręcznej, jak i automatycznej analizy. W ciągu ostatnich kilku tygodni wywołaliśmy jeszcze bardziej agresywną falę blokad, w tym dziesiątek tysięcy kont do smerfowania zaledwie dzisiaj.",
      "Podczas The International niektórzy zawodnicy zgłosili się do nas, by porozmawiać o swoich kontach do smerfowania. Te rozmowy ciągnęły się dalej i pośród zawodników zapanowała powszechna zgoda, że zbanowanie ich kont używanych do tego celu to korzyść dla całej społeczności Dota 2. Zasady powinny tyczyć się każdego – i od teraz będą. Smerfowanie nie jest nawet jedyną niegrzeczną rzeczą, którą zajmowali się gracze – pośród innych wątpliwych wyborów, niektóre osoby o złych intencjach grały nieczysto, psując gry i tracąc przez to ocenę zachowania, a następnie wynajmując kogoś innego, by wyfarmił tę ocenę z powrotem.",
      "Niezależnie od tego [i]jak bardzo[/b] byliście niegrzeczni, to obserwowaliśmy was (nie, gdy spaliście, ochłońcie) i postanowiliśmy się z tym wszystkim rozprawić. Za wszystkie wyżej wymienione zachowania zostaną wymierzone kary, w tym kary do oceny zachowania. A w poważnych przypadkach nawet blokada głównego konta. ",
      "Tak jak mówiliśmy wcześniej, smerfowanie (i inne negatywne zachowanie) przyczynia się do gorszych meczów, a my, zmierzając ku nowemu rokowi, chcemy się upewnić, że wasze mecze będą tak dobre, jak tylko jest to możliwe. W związku z tym życzymy wszystkim [url=https://www.dota2.com/frostivus2023]wesołej aktualizacji Mroźnego Festiwalu![/url] Poza smerfom. One zasłużyły sobie na potrawkę o smaku węgla i może, gdy się nią zakrztuszą, to przemyślą swoje zachowanie.",
      "[b]Skrzynia Mroźnego Festiwalu 2023:[/b]",
      "[list]",
      "[*]Każda skrzynia zawiera 1 z 30 przedmiotów rozdzielonych między 4 stopnie lub kosmicznie rzadkiego kuriera (malutkiego Roshana).",
      "[*]Przedmioty tego samego stopnia mają tę samą rzadkość.  Nie otrzymacie duplikatów przedmiotów z danego stopnia do czasu, aż zdobędziecie każdy przedmiot.",
      "[*]Pięć przedmiotów z tego samego stopnia można wymienić na losowy przedmiot kolejnego stopnia.",
      "[*]Kosmicznie rzadki przedmiot znajduje się w 1 na 100 000 skrzyń.  Pozostałe skrzynie zawierają przedmiot z jednego z 4 stopni.  Zaczynając od 1. stopnia, każdy przedmiot ma 10% szansy na awans na kolejny stopień.",
      "[*]Podczas otwierania skrzyni lub wymiany 5 przedmiotów na 1 wyższego stopnia istnieje szansa 1 na 300 na otrzymanie dodatkowego niezwykłego przedmiotu – kopii przedmiotu lub, jeśli jest to zestaw, jednego z przedmiotów w tym zestawie.  Każdy niezwykły przedmiot ma losowy efekt specjalny.  Te 3 efekty są tej samej rzadkości.",
      "[/list]",
      "[b]Poprawki błędów:[/b]",
      "[list]",
      "[*]Naprawiono problem, w którym czas oczekiwania przedmiotu Gem of True Sight zatrzymywał się, jeśli bohater posiadający ten przedmiot został zabity w obszarze działania umiejętności Chronosphere.",
      "[*]Naprawiono rzadko występujący błąd z łączeniem przedmiotów powodujący nieoczekiwane zamknięcie gry.",
      "[*]Naprawiono problem, w którym umiejętność z zatrzymanym czasem oczekiwania wznawiała ten czas zbyt szybko, jeśli spróbowano zatrzymać ten czas ponownie.",
      "[*]Naprawiono problem, w którym nieodłączne premie z umiejętności mogły nie być nakładane, jeśli zakupiono Aghanim's Shard.",
      "[*]Naprawiono problem, w którym przełączenie umiejętności (lub zdobycie przedmiotu Aether Lens itd.) mogło nie aktualizować oznaczenia zasięgu rzutu czaru, jeśli to oznaczenie już było wyświetlane.",
      "[*]Naprawiono błąd powodujący, że efekty cząsteczkowe umiejętności Chaos Bolt od Chaos Knighta czasami gubiły swoją lokalizację.",
      "[*]Naprawiono błąd powodujący, że umiejętność Starbreaker od Dawnbreaker zapewniała niewrażliwość na pełne obrażenia bez ulepszenia jej przez Aghanim's Shard.",
      "[*]Sprawiono, że zestaw Wiązania Głębinowej Magmy dla Earthshakera pokazuje od teraz prawidłowe (nowe) cząsteczki dla nowego stylu (z okazji 10. rocznicy gry) oraz że prawidłowo usuwa cząsteczki po wygaśnięciu.",
      "[*]Naprawiono błąd powodujący, że podgląd rzutu umiejętności Bushwack od Hoodwink czasami podświetlał drzewa znajdujące się poza obszarem działania.",
      "[*]Naprawiono pewne problemy z animacjami umiejętności Walrus PUNCH! od Tuska.",
      "[*]Naprawiono błąd powodujący, że umiejętność Magic Missile od Vengeful Spirit po ulepszeniu przez Aghanim's Shard mogła odbijać się w kierunku niewidzialnych wrogów niewrażliwych na efekt True Sight.",
      "[*]Naprawiono problem z efektami cząsteczkowymi umiejętności Voodoo Restoration od Witch Doctora dla broni wiekopomnego zestawu Wlekorośl Awaleba.",
      "[*]Sprawiono, by podświetlanie w miejscu na neutralny przedmiot aktywowało się tylko, jeśli w schowku jest przynajmniej jeden wolny żeton (zamiast przy dowolnym przedmiocie od dowolnego sojusznika).",
      "[*]Naprawiono błąd powodujący, że rzucenie umiejętności z przytrzymanym klawiszem Alt powodowało także ping.",
      "[*]Naprawiono błąd powodujący, że zegary odmierzające czas trwania wardów i przywoływanych jednostek były ucinane w interfejsie.",
      "[*]Naprawiono błąd powodujący, że opisy talentów były czasami blokowane przez nazwy skrótów klawiszowych.",
      "[*]Naprawiono błąd powodujący, że dobicia wież pojawiały się jako wiadomości na czacie zamiast jako wydarzenia w rejestrze rozgrywki.",
      "[*]Naprawiono błąd powodujący, że naklejki były wyświetlane jako dostępne w zbrojowni, mimo że pojemnik zawierający te naklejki mógł nie być dostępny.",
      "[*]Naprawiono błąd powodujący wyświetlanie pojemników z naklejkami z zakończonych wydarzeń jako dostępne w sprzedaży.",
      "[*]Naprawiono błąd powodujący, że powiadomienie o otrzymanych przedmiotach nie wyświetlało poprawnie przedmiotów globalnych.",
      "[*]Naprawiono problem z menu wybory gry nierankingowej, w którym kliknięcie opcji „Pokaż wszystkie tryby” sprawiało, że nie dało się korzystać z całego menu.",
      "[*]Naprawiono błąd powodujący okazjonalne wyświetlanie pseudonimów zawodowych graczy na Steam zamiast ich imion i nazwisk.",
      "[*]Naprawiono błąd powodujący, że długie pseudonimy wychodziły poza przeznaczone dla nich miejsce na stronach historii i statystyk bitewnych.",
      "[*]Dodano kolejne powiadomienie dla autorów niestandardowych gier w warsztacie, którzy nie zaktualizowali jeszcze swoich niestandardowych modeli z przestarzałego formatu używanego przed ModelDoc. Wspominaliśmy o tym podczas aktualizacji [url=https://www.dota2.com/springcleaning]Wiosenne Porządki 2022[/url] oraz [url=https://www.dota2.com/newsentry/3659774959159800240]Porachunki Umarłych[/url].",
      "[/list]"
    ],
    "commentcount": 882,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 13051,
    "votedowncount": 1949,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1710280826,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 13051,
  "votes_down": 1949,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}