{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Das Update „Frostivus 2023“ ist da",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Das Update „Frostivus 2023“ ist da",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Es ist wieder einmal soweit: Frostivus steht vor der Tür. Das bedeutet, dass König Krampus aus seinem Winterschlaf unter dem weinroten Blutmeer, das die Burg Frostivus umgibt, erwacht ist. Er hat seine Legionen entführter Koboldkinder zum Schürfen in die Spielzeugminen geschickt, seine beiden rotäugigen Schattenwölfe Lumpo und Rupertus an seinen Knochenschlitten gespannt und befindet sich wahrscheinlich gerade entweder auf oder in Ihrem Haus.",
      "Wenn Ihr Name also auf der Liste der artigen Spieler steht, dann dürfen Sie sich drauf freuen, dass wir Ihnen neue und wiederkehrende kosmetische Gegenstände, etliche Verbesserungen am Spielerlebnis, neue Premium-Sets für Dota Plus und das Gameplay-Update 7.35 unter den Weihnachtsbaum legen (all dies können Sie [url=https://www.dota2.com/frostivus2023]hier[/url] genauer nachlesen).",
      "Wenn Sie hingegen auf der Liste der unartigen Spieler stehen, haben wir gute Nachrichten für alle anderen und schlechte Nachrichten für Sie: Dieses Jahr gibt es ein Blutbad. Vielleicht erinnern Sie sich daran, dass wir [url=https://www.dota2.com/newsentry/3692442542242977036]im September[/url] den Bannhammer geschwungen und 90.000 Smurfaccounts dauerhaft gesperrt haben. Seitdem haben wir das Spielerverhalten sowohl manuell als auch automatisch weiter beobachtet und analysiert. In den vergangenen Wochen haben wir eine noch massivere Bannwelle durchgeführt und allein heute mehrere zehntausend Smurfaccounts gesperrt.",
      "Bei The International kamen einige Profispieler auf uns zu, um über ihre Smurfaccounts zu sprechen. Diese Gespräche wurden fortgeführt und unter den Profispielern herrscht weitgehend Konsens darüber, dass die Sperrung von Profispieler-Smurfaccounts ein Gewinn für die Dota-Community ist: Die Regeln sollten für alle gelten – und das werden sie von nun an auch. Abgesehen davon ist Smurfen noch nicht einmal die einzige Unart, die Spieler an den Tag legen. Neben anderen fragwürdigen Entscheidungen spielen einige schwarze Schafe wie Idioten. Sie ruinieren Partien und verlieren dadurch Verhaltenswertungspunkte, um dann andere Spieler anzuheuern, die den Service anbieten, sie wieder nach oben zu bringen.",
      "Unabhängig davon, [i]auf welche Weise[/i] Sie unartig waren, wir haben Sie beobachtet (ohne Ihre Privatsphäre zu verletzen, keine Sorge). Und wir gehen hart dagegen vor. Für alle oben genannten Punkte werden Strafen verhängt, darunter auch der Abzug von Verhaltenswertungspunkten und in schwerwiegenden Fällen auch die Sperrung des Hauptaccounts. ",
      "Wie wir hinreichend erklärt haben, verschlechtert Smurfen (und anderes negatives Verhalten) die Qualität der Partien. Wir wollen sicherstellen, dass Sie im neuen Jahr die bestmöglichen Erfahrungen mit Ihren Partien sammeln. In diesem Sinne wünschen wir allen Spielern viel Spaß mit dem [url=https://www.dota2.com/frostivus2023]Frostivus-Update![/url] Smurfaccounts sind natürlich ausgenommen, aber wir gehen davon aus, dass diese Spieler sich ohnehin nicht über das Update freuen werden, da sie an ihrer wohlverdienten Kohle zu knabbern haben.",
      "[b]Frostivus-Schatz 2023:[/b]",
      "[list]",
      "[*]Jeder Schatz enthält einen von 30 auf vier Stufen verteilten Gegenständen oder den kosmisch seltenen Kurier „Lebkuchen Baby-Roshan“.",
      "[*]Gegenstände derselben Stufe sind von derselben Seltenheit.  Sie erhalten keine doppelten Gegenstände aus jeder Stufe, bis Sie jeden Gegenstand einmal erhalten haben.",
      "[*]Fünf Gegenstände derselben Stufe können für einen zufälligen Gegenstand der nächsthöheren Stufe eingetauscht werden.",
      "[*]Der kosmisch seltene Kurier ist in 1 von 100.000 Schätzen enthalten.  Andere Schätze enthalten einen Gegenstand aus einer der vier Stufen.  Ab Stufe 1 beträgt die Chance, einen Gegenstand der nächsthöheren Stufe zu erhalten, jeweils 10 %.",
      "[*]Beim Öffnen eines Schatzes oder der Aufwertung von Gegenständen haben Sie eine Chance von 1:300, um einen zusätzlichen ungewöhnlichen Gegenstand zu erhalten, entweder als neues Exemplar dieses Gegenstands oder, wenn dieser Teil eines Sets ist, als zufälligen Gegenstand dieses Sets.  Jeder ungewöhnliche Gegenstand hat einen zufälligen Spezialeffekt.  Die drei Effekte sind von gleicher Seltenheit.",
      "[/list]",
      "[b]Fehlerbehebungen:[/b]",
      "[list]",
      "[*]Fehler behoben, durch den die Abklingzeit von Gem of True Sight eingefroren blieb, wenn dieser von einem in Chronosphere getöteten Helden fallen gelassen wurde.",
      "[*]Seltener Absturz behoben, der beim Kombinieren von Gegenständen auftrat.",
      "[*]Fehler behoben, durch den eine Abklingzeit früher abklang, wenn diese nach erstmaligem Einfrieren erneut eingefroren wurde.",
      "[*]Fehler behoben, durch den die einhergehenden Stärkungseffekte von bestimmten Fähigkeiten nach erhaltenem Splitterbonus ggf. nicht angewendet wurden.",
      "[*]Fehler behoben, durch den der Indikator für die Zauberreichweite bei Wechselfähigkeiten (oder beim Kauf von Aether Lens usw.) nicht aktualisiert wurde, wenn dieser bereits angezeigt wurde.",
      "[*]Fehler behoben, durch den die Partikeleffekte von Chaos Knights Chaos Bolt gelegentlich nicht an der korrekten Stelle angezeigt wurden.",
      "[*]Fehler behoben, durch den Dawnbreakers Starbreaker Immunität gegenüber reinem Schaden auch ohne den Splitterbonus gewährte.",
      "[*]Fehler behoben, durch den die falschen Partikeleffekte für den Stil „10. Jubiläum“ des Gegenstandssets „Kämpfer des Tiefenmagmas“ für Earthshaker angezeigt wurden. Partikeleffekte werden nun auch wieder korrekt ausgeblendet.",
      "[*]Fehler behoben, durch den der Indikator für Hoodwinks Bushwhack gelegentlich Bäume außerhalb des Wirkungsbereichs hervorhob.",
      "[*]Einige Animationsprobleme mit Tusks Walrus PUNCH! behoben.",
      "[*]Fehler behoben, durch den Vengeful Spirits Magic Missile mit Splitterbonus auf unsichtbare, nicht durch Klarsicht aufdeckbare Gegner überspringen konnte.",
      "[*]Fehler behoben, durch den die Partikeleffekte von Voodoo Restoration für Witch Doctors Immortal-Gegenstand „Awalebs Wunderkraut“ nicht ordnungsgemäß dargestellt wurden.",
      "[*]Fehler behoben, durch den der Slot für neutrale Gegenstände hervorgehoben wurde, obwohl keine Marke im Lager verfügbar war.",
      "[*]Fehler behoben, der durch das Wirken einer Fähigkeit mit gedrückter ALT-Taste einen Ping auslöste.",
      "[*]Fehler behoben, durch den der Timer für die Lebensdauer von Wards und beschworenen Einheiten im HUD abgeschnitten dargestellt wurde.",
      "[*]Problem behoben, durch das die Beschreibungen von Talenten gelegentlich durch die Taste für deren Auswahl überdeckt wurden.",
      "[*]Fehler behoben, durch den die Meldung beim Denyen von Türmen als Chatnachricht anstatt als Schlachtenevent angezeigt wurde.",
      "[*]Fehler behoben, durch den Aufkleber im Arsenal als käuflich angezeigt wurden, obwohl die zugehörige Aufkleberkapsel bereits nicht mehr erhältlich war.",
      "[*]Fehler behoben, durch den Aufkleberkapseln von früheren Events als käuflich angezeigt wurden.",
      "[*]Fehler behoben, durch den das Pop-up-Fenster für neue Gegenstände globale Gegenstände nicht ordnungsgemäß anzeigte.",
      "[*]Problem behoben, durch das die Auswahl aller Optionen unter „Alle Spielmodi anzeigen“ in der nicht gewerteten Spielsuche weitere Interaktionen blockierte.",
      "[*]Fehler behoben, durch den gelegentlich der aktuelle Steam-Name statt des registrierten Turniernamens von Profispielern angezeigt wurde.",
      "[*]Problem behoben, durch das zu lange Bezeichnungen im Tab „Verlauf“ und „Schlachtenstatistik“ den ihnen zugeteilten Platz überschritten.",
      "[*]Zusätzliche Benachrichtigung für Workshop-Autoren benutzerdefinierter Spiele hinzugefügt, die ihre benutzerdefinierten Modelle noch vom veralteten und hin zum neuen ModelDoc-Format aktualisiert haben, wie im [url=https://www.dota2.com/springcleaning]Blog zum Frühjahrsputz 2022[/url] und im [url=https://www.dota2.com/newsentry/3659774959159800240]Update „Die Rache der Toten“[/url] beschrieben.",
      "[/list]"
    ],
    "commentcount": 871,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 11178,
    "votedowncount": 1767,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1705340693,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11178,
  "votes_down": 1767,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "3884981125532748792",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}