{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Η ενημέρωση Frostivus 2023 είναι εδώ!",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Η ενημέρωση Frostivus 2023 είναι εδώ!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Άλλο ένα Frostivus πλησιάζει και αυτό σημαίνει ότι ο Βασιλιάς Kringle βγήκε από τη χειμερία νάρκη του, κάτω από την πορφυρή Ματωμένη Θάλασσα που περιτριγυρίζει το Κάστρο Frostivus. Έστειλε τις λεγεώνες παιχνιδωρύχων του, που απαρτίζονταν από απαχθέντα παιδιά γκόμπλιν, να αρχίσουν το σκάψιμο στα παιχνιδωρυχεία του. Έδεσε τους δίδυμους κοκκινομάτηδες ανταρόλυκούς του, Lumpo και Rupertus, στο οστέινο έλκηθρό του και το πιο πιθανό είναι ότι αυτήν τη στιγμή βρίσκεται είτε πάνω ή μέσα στο σπίτι σας.",
      "Οπότε, αν είστε στη λίστα του με τα φρόνιμα παιδιά, ετοιμαστείτε να στολίσετε με νέα και παλιά κοσμητικά αντικείμενα Frostivus, πάρα πολλές βελτιώσεις ποιότητας ζωής στην εφαρμογή, νέα premium σετ Dota Plus και την ενημέρωση παιχνιδιού 7.35. Μπορείτε να διαβάσετε όλες τις σχετικές πληροφορίες [url=https://www.dota2.com/frostivus2023]εδώ[/url].",
      "Από την άλλη, αν είστε στη λίστα του με τα άτακτα παιδιά, έχουμε υπέροχα νέα για όλους τους άλλους και άσχημα νέα για εσάς, καθώς αυτή η χρόνια πρόκειται να εξελιχθεί σε λουτρό αίματος. Ίσως θυμάστε ότι [url=https://www.dota2.com/newsentry/3692442542242977036]τον Σεπτέμβριο[/url], αποκλείσαμε μόνιμα 90.000 λογαριασμούς που έκαναν σμέρφινγκ. Έκτοτε, συνεχίζουμε να επενδύουμε στην παρακολούθηση της συμπεριφοράς των παικτών, με αυτόματους και μη τρόπους. Τις τελευταίες εβδομάδες, προχωρήσαμε σε ένα ακόμα πιο επιθετικό κύμα αποκλεισμών, με δεκάδες χιλιάδες λογαριασμούς σμέρφινγκ να αποκλείονται μόνο σήμερα.",
      "Στο The International, μας προσέγγισαν ορισμένοι επαγγελματίες παίκτες για να μας μιλήσουν για τους δικούς τους λογαριασμούς σμέρφινγκ. Αυτές οι συζητήσεις συνεχίζονται και οι επαγγελματίες παίκτες συμφωνούν ότι ο αποκλεισμός των λογαριασμών σμέρφινκ τους αποτελεί νίκη για την κοινότητα του Dota: Οι κανόνες θα πρέπει να ισχύουν για όλους και αυτό θα συμβαίνει από εδώ και στο εξής. Το σμέρφινγκ δεν είναι το μόνο πράγμα που κάνουν οι άτακτοι παίκτες. Μεταξύ άλλων επιλογών αμφιβόλου ποιότητας, κάποια κακόβουλα άτομα παίζουν σαν βλάκες, χαλάνε αγώνες και χάνουν βαθμολογία συμπεριφοράς και, στη συνέχεια, προσλαμβάνουν άλλους χρήστες για να την αυξήσουν εκ μέρους τους.",
      "Ανεξαρτήτως του [i]πώς[/i] ήσασταν άτακτοι, εμείς σας παρακολουθούμε (όχι ενώ κοιμάστε, ηρεμήστε) και καταπολεμούμε όλα αυτά τα φαινόμενα. Θα επιβληθούν τιμωρίες για όλα τα παραπάνω, μεταξύ των οποίων ποινές βαθμολογίας συμπεριφοράς και, σε σοβαρές περιπτώσεις, αποκλεισμοί των κύριων λογαριασμών. ",
      "Όπως έχουμε ξαναπεί, το σμέρφινγκ (και άλλες αρνητικές συμπεριφορές) χειροτερεύουν τους αγώνες και θέλουμε να διασφαλίσουμε ότι οι αγώνες σας θα είναι όσο καλύτεροι γίνεται, καθώς οδεύουμε προς τη νέα χρονιά. Έτσι, θα θέλαμε να ευχηθούμε σε όλους [url=https://www.dota2.com/frostivus2023]Καλή Ενημέρωση Frostivus![/url] Εκτός από τους λογαριασμούς σμέρφινγκ, οι οποίοι υποθέτουμε δεν θα απολαύσουν την ενημέρωση καθώς προσπαθούν να ξεροκαταπιούν τα καρβουνιασμένα μελομακάρονα που τους αξίζουν.",
      "[b]Σεντούκι Θησαυρού Frostivus 2023:[/b]",
      "[list]",
      "[*]Κάθε σεντούκι περιέχει ένα από τα 30 αντικείμενα, τα οποία είναι χωρισμένα σε 4 βαθμίδες, ή έναν κοσμικά σπάνιο μεταφορέα Baby Roshan.",
      "[*]Τα αντικείμενα της ίδιας βαθμίδας έχουν την ίδια σπανιότητα.  Μέχρι να αποκτήσετε κάθε αντικείμενο μία φορά, δεν θα λαμβάνετε διπλά αντικείμενα από κάθε βαθμίδα.",
      "[*]Πέντε αντικείμενα της ίδιας βαθμίδας μπορούν να ανταλλαχθούν με ένα τυχαίο αντικείμενο της επόμενης βαθμίδας.",
      "[*]1 σεντούκι σε κάθε 100.000 εμπεριέχει το κοσμικά σπάνιο αντικείμενο.  Τα υπόλοιπα σεντούκια περιέχουν ένα αντικείμενο από μία από τις 4 βαθμίδες.  Ξεκινώντας από τη βαθμίδα 1, κάθε αντικείμενο έχει πιθανότητα 10% να αναβαθμιστεί στην επόμενη βαθμίδα.",
      "[*]Όταν ανοίγετε ένα σεντούκι ή ανταλλάσσετε ένα αντικείμενο, οι πιθανότητες να λάβετε ένα επιπλέον ασυνήθιστο αντικείμενο (είτε αντίγραφο του αντικειμένου ή αν πρόκειται για σετ, ένα από τα αντικείμενα του σετ) είναι 1 στις 300.  Κάθε ασυνήθιστο αντικείμενο διαθέτει ένα τυχαίο ειδικό εφέ.  Τα τρία εφέ έχουν την ίδια σπανιότητα.",
      "[/list]",
      "[b]Διορθώσεις σφαλμάτων:[/b]",
      "[list]",
      "[*]Διορθώθηκε πρόβλημα όπου εάν κάποιος ήρωας που σκοτωνόταν στο Chronosphere, έριχνε Gem of True Sight, η επαναφόρτιση του Gem παρέμενε παγωμένη.",
      "[*]Διορθώθηκε σπάνιο σφάλμα με συνδυασμούς αντικειμένων.",
      "[*]Διορθώθηκε πρόβλημα όπου όταν η επαναφόρτιση μια ικανότητας πάγωνε εκ νέου, ξεπάγωνε πρόωρα.",
      "[*]Διορθώθηκε πρόβλημα όπου οι ικανότητες με εγγενείς επαυξήσεις δεν μπορούσαν να τις εφαρμόσουν εάν είχε αγοραστεί το Aghanim's Shard.",
      "[*]Διορθώθηκε πρόβλημα όπου η αλλαγή ικανοτήτων (ή η απόκτηση Aether Lens κλπ.) δεν ενημέρωνε τον κύκλο βεληνεκούς εκτέλεσης, εάν εμφανιζόταν ήδη.",
      "[*]Διορθώθηκε πρόβλημα όπου τα σωματίδια Chaos Bolt του Chaos Knight ορισμένες φορές έχαναν τη θέση τους.",
      "[*]Διορθώθηκε πρόβλημα όπου το Starbreaker της Dawnbreaker παρείχε ατρωσία καθαρής ζημιάς χωρίς Aghanim's Shard.",
      "[*]Διορθώθηκε το σετ Bindings of Deep Magma του Earthshaker για να εμφανίζει τα σωστά (νέα) σωματίδια του νέου στιλ (της 10ης επετείου) και για να διαγράφει σωστά τα σωματίδια κατά τη λήξη τους.",
      "[*]Διορθώθηκε πρόβλημα όπου η ένδειξη εκτέλεσης του Bushwhack της Hoodwink ορισμένες φορές επεσήμαινε δέντρα εκτός της περιοχής επίδρασης.",
      "[*]Διορθώθηκαν ορισμένα προβλήματα κίνησης με το Walrus PUNCH! του Tusk.",
      "[*]Διορθώθηκε σφάλμα όπου το Magic Missile με Aghanim's Shard της Vengeful Spirit αναπηδούσε προς αόρατους εχθρούς με ατρωσία σε διόραση.",
      "[*]Διορθώθηκε πρόβλημα με τα σωματίδια Voodoo Restoration στο Immortal όπλο Awaleb's Trundleweed του Witch Doctor.",
      "[*]Διορθώθηκε η επισήμανση της υποδοχής ουδέτερου αντικείμενου, ώστε να φωτίζεται μόνο όταν υπάρχει τουλάχιστον μία δωρεάν μάρκα στο απόθεμα, αντί με οποιοδήποτε αντικείμενο από οποιονδήποτε συμπαίκτη.",
      "[*]Διορθώθηκε πρόβλημα όπου η εκτέλεση μιας ικανότητας με το Alt πατημένο προκαλούσε επίσης και ping.",
      "[*]Διορθώθηκε πρόβλημα όπου τα χρονόμετρα διάρκειας ζωής για ματάκια και κλητευμένες μονάδες περικόπτονταν στη διεπαφή.",
      "[*]Διορθώθηκε πρόβλημα όπου οι περιγραφές ταλέντων μερικές φορές εμποδίζονταν από ονόματα πλήκτρων συντόμευσης.",
      "[*]Διορθώθηκε πρόβλημα όπου οι αρνήσεις Πύργου εμφανίζονταν ως μηνύματα συνομιλίας αντί για συμβάντα μάχης.",
      "[*]Διορθώθηκε πρόβλημα όπου τα αυτοκόλλητα εμφανίζονταν ως διαθέσιμα στο Οπλοστάσιο, ακόμα και όταν η κάψουλα που τα περιείχε δεν ήταν διαθέσιμη.",
      "[*]Διορθώθηκε πρόβλημα όπου οι κάψουλες αυτοκόλλητων από παρελθοντικά συμβάντα εμφανίζονταν με δυνατότητα αγοράς.",
      "[*]Διορθώθηκε πρόβλημα όπου το αναδυόμενο παράθυρο «Λήφθηκε αντικείμενο» δεν εμφάνιζε σωστά τα καθολικά αντικείμενα.",
      "[*]Διορθώθηκε πρόβλημα με το παιχνίδι χωρίς κατάταξη όπου όταν επιλεγόταν το «Εμφάνιση όλων των τύπων», η ενότητα δεν μπορούσε να χρησιμοποιηθεί.",
      "[*]Διορθώθηκε πρόβλημα όπου μερικές φορές εμφανίζονταν τα ονόματα περσόνας Steam των επαγγελματιών παικτών αντί για τα σωστά τους ονόματα.",
      "[*]Διορθώθηκε πρόβλημα όπου τα μεγάλα ονόματα υπερέβαιναν τα όρια των σελίδων «Ιστορικό» και «Στατιστικά μάχης».",
      "[*]Προστέθηκε επιπλέον ειδοποίηση για τους συγγραφείς προσαρμοσμένου παιχνιδιού του Εργαστηρίου που δεν έχουν ενημερώσει ακόμα τα προσαρμοσμένα μοντέλα τους, ώστε να μην χρησιμοποιούν τη μορφή πριν το ModelDoc που έχει αποσυρθεί. Η αλλαγή είχε ανακοινωθεί στην [url=https://www.dota2.com/springcleaning]ενημέρωση Ανοιξιάτικο καθάρισμα 2022[/url] και την [url=https://www.dota2.com/newsentry/3659774959159800240]ενημέρωση Dead Reckoning[/url].",
      "[/list]"
    ],
    "commentcount": 882,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 13051,
    "votedowncount": 1949,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1710280826,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 13051,
  "votes_down": 1949,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}