{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Megérkezett a 2023-as Frostivus frissítés!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Megérkezett a 2023-as Frostivus frissítés!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Elérkezett egy újabb Frostivus, ami azt jelenti, hogy Rémapó felébredt téli álmából a Frostivus kastélyt körülvevő borvörös Vértenger mélyéről; elküldte elrabolt goblin-gyermek játékbányászokból álló légióit bányászni a játékbányáiba; csontszánja elé kötötte Lumpót és Rupertust, a vörös szemű iker-rémfarkasait; és valószínűleg épp vagy a házad tetején van, vagy bent a házadban.",
      "Szóval, ha a jók listáján vagy, készülj fagyos termeidet feldíszíteni az új és visszatérő Frostivus díszítőkkel, rengeteg kényelmi funkcióval a klienshez, új Dota Plusz prémium szettekkel és a 7.35-ös játékmenet-frissítéssel, amelyek mindegyikéről [url=https://www.dota2.com/frostivus2023]itt olvashatsz[/url].",
      "Ha viszont a rosszak listáján vagy, akkor mindenki másnak van egy remek hírünk, neked meg egy rossz, mert ez az év vérfürdő lesz. Talán emlékszel rá, amikor [url=https://www.dota2.com/newsentry/3692442542242977036]még szeptemberben[/url] elővettük a tiltókalapácsunkat, és véglegesen kitiltottunk 90 000 smurf fiókot. Azóta tovább folytattuk a játékosok viselkedésének felügyeletét, mind a manuális, mind az automatikus elemzési fronton. Az elmúlt pár hétben még agresszívabb tiltóhullámba kezdtünk, ami csak ma több tízezer smurf fiók kitiltását jelentette.",
      "A The Internationalen néhány profi játékos felkeresett minket, és beszélt nekünk a smurf fiókjáról. E beszélgetések folytatódtak, és a profik között széles körű egyetértés van a tekintetben, hogy a profi smurf fiókok kitiltásával a Dota, mint közösség, nyer. A szabályoknak mindenkire vonatkozniuk kell, és mostantól fognak is. És a smurfölés nem is az egyetlen csúnya dolog, amiben a játékosok sántikálnak. Más megkérdőjelezhető döntések mellett, néhány rossz szereplő bunkó módon játszik, elrontva a játékot, és emiatt viselkedési pontszámot veszítve, majd viselkedési pontszám farmolókat bérel fel pontszáma újbóli felhozására.",
      "Függetlenül attól, hogy [i]hogyan[/i] rosszalkodtál, figyeltünk téged (nyugi, nem alvás közben), és most mindenkire lecsapunk. A fentiek mindegyikéért büntetések lesznek kiosztva; viselkedési pontszám büntetések, súlyos esetekben pedig a fő fiókok kitiltása. ",
      "Mint korábban említettük, a smurfölés (és más negatív viselkedés) rontja a meccseket, és biztosítani akarjuk, hogy a meccseid a lehető legjobbak legyenek, ahogy az új év felé tartunk. Így szeretnénk mindenkinek [url=https://www.dota2.com/frostivus2023]boldog Frostivus frissítést[/url] kívánni, a smurf fiókok kivételével, akikről feltételezzük, nem fogják élvezni a frissítést, miközben torkukon akad a jól megérdemelt, szénízű igazságdesszertjük.",
      "[b]Frostivus 2023 Kincsesláda:[/b]",
      "[list]",
      "[*]Minden láda tartalmaz egyet a 30, 4 szintre elosztott tárgy közül, vagy egy Kozmikusan ritka Kicsi Roshan futárt.",
      "[*]Az azonos szinthez tartozó tárgyak ugyanolyan ritkaságúak.  Addig nem kapsz duplikált tárgyakat az egyes szintekről, amíg minden tárgyat egyszer meg nem kaptál.",
      "[*]Öt ugyanolyan szintű tárgy beváltható a következő szint egy véletlenszerű tárgyára.",
      "[*]A Kozmikusan ritka tárgy 100 000 ládából 1-ben található.  A többi láda a 4 szint egyikéből tartalmaz egy tárgyat.  Az 1. szinttel kezdve minden tárgynak 10% esélye van következő szintűvé válni.",
      "[*]Láda kinyitásakor vagy tárgy magasabbra cserélésekor egy a háromszázhoz az esély arra, hogy egy további Rendkívüli tárgyat kapj – vagy még egyet a tárgyból, vagy ha szett, akkor egy tárgyat abból a szettből.  Minden Rendkívüli tárgynak van egy véletlenszerű különleges effektje.  A három effekt azonos ritkaságú.",
      "[/list]",
      "[b]Hibajavítások:[/b]",
      "[list]",
      "[*]Javítottunk egy hibát, aminél ha egy Chronosphere-ben megölt hős elejtett egy Gem of True Sightot, akkor annak újratöltődési ideje befagyott marad.",
      "[*]Javítottunk egy ritka összeomlást tárgyegyesítéskor.",
      "[*]Javítottunk egy hibát, aminél ha egy képesség befagyott újratöltődési ideje újra befagyott, akkor túl hamar oldódott fel.",
      "[*]Javítottunk egy esetet, aminél a belső erősítésekkel rendelkező képességek nem alkalmazták azokat Aghanim's Shard vásárlásakor.",
      "[*]Javítottunk egy hibát, aminél a képességek átváltása (vagy az Aether Lens megszerzése stb.) nem frissítették a varázslási távolságot, ha az már meg volt jelenítve.",
      "[*]Javítottuk, hogy Chaos Knight Chaos Bolt részecskéi néha elvesztették a helyüket.",
      "[*]Javítottuk, hogy Dawnbreaker Starbreakerje Aghanim's Shard nélkül is tiszta sebzésimmunitást adott.",
      "[*]Javítottuk Earthshaker A Mély Magma Kötelékei szettjét, hogy a helyes (új) részecskéket mutassa az új (10. évfordulós) stílushoz, és megfelelően törölje a részecskéket a lejáratkor.",
      "[*]Javítottuk, hogy Hoodwink Bushwhack képességének célzásjelzője néha hatóterületen kívüli fákat is megjelölt.",
      "[*]Javítottunk néhány animációs problémát Tusk Walrus PUNCH! képességénél.",
      "[*]Javítottunk egy hibát, aminél Vengeful Spirit Aghanim's Shardos Magic Missile-ja láthatatlan, igazlátásra immunis ellenségekre tudott pattanni.",
      "[*]Javítottunk egy hibát Witch Doctor Awaleb Görgőfüve Halhatatlan fegyverén a Voodoo Restoration részecskékkel.",
      "[*]Javítottuk, hogy a semleges tárgyhely csak akkor kerüljön kiemelésre, ha legalább egy szabad zseton van a talonban, nem pedig bármely tárgynál, bármely csapattárstól.",
      "[*]Javítottunk egy hibát, aminél képesség varázslása az Alt lenyomva tartása mellett pinget is küldött.",
      "[*]Javítottuk, hogy a wardok és idézett egységek élet-visszaszámlálója a HUD-ban le volt vágva.",
      "[*]Javítottuk, hogy az Adottságleírásokat néha eltakarták a gyorsbillentyűk nevei.",
      "[*]Javítottuk, hogy a toronybeáldozás csevegésüzenetként jelent meg, nem pedig harci eseményként.",
      "[*]Javítottuk, hogy a Fegyvertárban matricák jelentek meg elérhetőként, miközben a matricákat tartalmazó kapszula nem volt elérhető.",
      "[*]Javítottuk, hogy véget ért események matricakapszulái megvásárolhatóként jelentek meg.",
      "[*]Javítottuk, hogy a Kapott tárgyak felugró ablak nem megfelelően jelenítette meg a globális tárgyakat.",
      "[*]Javítottunk egy hibát a Rangsorolatlan játékban, ahol az Összes mód mutatása beállítás bejelölése használhatatlanná tehette a szakaszt.",
      "[*]Javítottuk, hogy néha a profi játékosok Steames profilnevei voltak láthatók a helyes nevek helyett.",
      "[*]Javítottuk, hogy az Előzmények és a Csatastatisztika oldalakon túlcsordultak a hosszú nevek.",
      "[*]További értesítést küldtünk a Műhely egyedi játék készítőinek, akik még nem frissítették egyedi modelljeiket a ModelDoc előtti kivezetett formátumról, ahogy arról a [url=https://www.dota2.com/springcleaning]2022-es Tavaszi Nagytakarítás frissítésben[/url] és a [url=https://www.dota2.com/newsentry/3659774959159800240]Dead Reckoning frissítésben[/url] írtunk.",
      "[/list]"
    ],
    "commentcount": 879,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 12621,
    "votedowncount": 1894,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1708470491,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12621,
  "votes_down": 1894,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}