{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus 2023 -päivitys on täällä!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus 2023 -päivitys on täällä!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Frostivus on jälleen täällä, mikä tarkoittaa, että juhlakunkku on herännyt talviunestaan Frostivuksen linnaa ympäröivän viinimarjamehunvärisen verimeren alta, lähettänyt legioonansa siepatut maahislapset kaivamaan lelukaivoksiinsa, kiinnittänyt punasilmäiset petosusikaksosensa Lumpon ja Rupertuksen luiseen rekeensä ja on luultavasti kotisi katolla tai jopa sen sisäpuolella juuri nyt.",
      "Joten jos olet ollut tarpeeksi kiltti, tulet varmasti löytämään pakkasen puremasta eteisestä uusia ja vanhoja Frostivus-teeman kosmeettisia esineitä, paljon käyttökokemusta parantavia asiakasohjelmaominaisuuksia, uusia Dota Plus Premium-kokoelmia ja pelipäivityksen 7.35. Kaikki tarpeellinen tieto löytyy [url=https://www.dota2.com/frostivus2023]täältä[/url].",
      "Jos taas olet unohtanut olla kiltti, meillä on hyviä uutisia kaikille muille ja huonoja uutisia sinulle: vuodesta tulee verilöyly. Saatat muistaa, että [url=https://www.dota2.com/newsentry/3692442542242977036]syyskuussa[/url] otimme tiukan asenteen pelikieltojen antamisen suhteen ja annoimme pysyvän pelikiellon 90 000 smurffitilille. Sen jälkeen olemme jatkaneet panostamista pelaajien käyttäytymisen seurantaan sekä manuaalisen että automaattisen analyysin avulla. Viime viikkojen aikana olemme harjoittaneet entistä aggressiivisempaa pelikieltopolitiikkaa, jonka seurauksena olemme antaneet useita kymmeniä tuhansia smurffitilikieltoja pelkästään tänään.",
      "The Internationalissa jotkut ammattilaispelaajat ottivat meihin yhteyttä keskustellakseen smurffitileistään. Neuvottelut ovat jatkuneet, ja ammattilaisten keskuudessa vallitsee laaja yksimielisyys siitä, että pro-smurffitilien kieltäminen on voitto Dota-yhteisölle. Sääntöjen tulisi koskea kaikkia, ja tästä lähtien ne koskevatkin. Smurffaus ei ole edes ainoa tuhma asia, johon pelaajat ryhtyvät. Muiden kyseenalaisten valintojen ohella jotkut pilaavat pelejä olemalla törkeitä ja menettävät käyttäytymispisteitä sen takia, minkä jälkeen he palkkaavat kolmannen osapuolen henkilöitä nostamaan käyttäytymispisteensä takaisin hyväksyttävälle tasolle.",
      "Huolimatta siitä, [i]mitä[/i] tuhmaa olet puuhannut, olemme seuranneet sinua (ei hätää, emme kuitenkaan nukkuessasi) ja ryhdymme asian edellyttämiin toimenpiteisiin. Rangaistuksia jaetaan kaikista edellä mainituista, mukaan lukien käyttäytymispisterangaistukset – ja vakavissa tapauksissa se tarkoittaa päätilin porttikieltoa. ",
      "Kuten aiemmin mainittiin, smurffaus (ja muu negatiivinen käyttäytyminen) pilaa otteluita, ja tavoitteena on varmistaa, että ottelut olisivat mahdollisimman hyviä tulevana vuonna. Haluamme siis toivottaa kaikille [url=https://www.dota2.com/frostivus2023]hyvää Frostivus-päivitystä![/url] Paitsi smurffitileille, jotka oletettavasti eivät nauti päivityksestä, koska niiden omistajat tukehtuvat hyvin ansaittuihin hiilenmakuisiin jälkiruokiinsa.",
      "[b]Frostivus 2023 -aarrearkku[/b]",
      "[list]",
      "[*]Jokainen arkku sisältää yhden 30 esineestä, jotka on jaettu neljään tasoon, tai kosmisen harvinaisen Roshan-vauva-kuriirin.",
      "[*]Samantasoiset esineet ovat yhtä harvinaisia.  Et voi saada kaksoiskappaleita miltään tasolta ennen kuin olet saanut jokaisen kyseisen tason esineen kerran.",
      "[*]Viisi saman tason esinettä voidaan vaihtaa satunnaiseen esineeseen seuraavalta tasolta.",
      "[*]Kosminen harvinainen esine löytyy yhdestä laatikosta 100 000 laatikkoa kohti.  Muut arkut sisältävät esineen satunnaiselta tasolta neljästä.  Ensimmäisestä tasosta alkaen jokaisella esineellä on 10 % mahdollisuus olla kyseistä tasoa korkeampi.",
      "[*]Kun avaat arkun tai vaihdat esineeseen, on yksi mahdollisuus 300:sta saada ylimääräinen epätavallinen esine – joko kopio esineestä tai, jos kyse on kokoelmasta, jokin kyseisen kokoelman esineistä.  Jokaisella epätavallisella esineellä on satunnainen erikoistehoste.  Kaikki kolme tehostetta ovat yhtä harvinaisia.",
      "[/list]",
      "[b]Bugikorjaukset[/b]",
      "[list]",
      "[*]Korjattiin ongelma, jossa Chronospheressa kuolleesta sankarista saadun Gem of True Sightin latausaika oli pysähtynyt.",
      "[*]Korjattiin harvinainen esineiden yhdistelemisen aiheuttama kaatuminen.",
      "[*]Korjattiin ongelma, jossa kyvyn pysäytetty latausaika aktivoitui uudelleen odotettua aiemmin, jos se pysäytettiin toistamiseen.",
      "[*]Korjattiin ongelma, jossa kykyihin liitettyjä vahvistuksia ei otettu käyttöön Aghanim's Shardia ostettaessa.",
      "[*]Korjattiin ongelma, jossa kykyjen vaihtaminen (tai käyttöetäisyyttä nostavan esineen, kuten Aether Lensin hankkiminen) ei päivittänyt käyttöetäisyysympyrää, jos se oli jo näkyvissä.",
      "[*]Korjattiin ongelma, jossa Chaos Knightin Chaos Bolt -hiukkaset näkyivät joskus väärässä sijainnissa.",
      "[*]Korjattiin ongelma, jossa Dawnbreakerin Starbreaker antoi immuniteetin puhtaalle vahingolle ilman Aghanim's Shardia.",
      "[*]Korjattiin Earthshakerin Syvän kivisulan siteet -kokoelma näyttämään oikeat (uudet) hiukkaset uudelle kymmenvuotistyylille ja kadottamaan ne silloin, kun niiden kuuluukin.",
      "[*]Korjattiin virhe, jossa Hoodwinkin Bushwackin vaikutusalueympyrä saattoi korostaa alueen ulkopuolella olevia puita.",
      "[*]Korjattiin Tuskin Walrus PUNCHIIN liittyviä animaatio-ongelmia.",
      "[*]Korjattiin virhe, jossa Vengeful Spiritin Shard-päivitetty Magic Missile saattoi kimmota Slarkin Shadow Dancen tai Smoke of Deceitin avulla näkymättömiin vihollisiin.",
      "[*]Korjattiin Witch Doctorin Awalebin ihmeyrtti -esineeseen liittyvä Voodoo Restorationin hiukkasongelma.",
      "[*]Korjattiin neutraaliesinesäilö näyttämään uusien esineiden saatavuutta vain silloin, kun säilössä on vähintään yksi vapaa poletti (eikä silloin, kun siellä on mikä tahansa joukkuetoverin esine).",
      "[*]Korjattiin virhe, jossa kyvyn käyttäminen Alt-näppäimen ollessa pohjassa käytti samalla karttamerkkiä.",
      "[*]Korjattiin virhe, jossa wardien ja kutsuttujen hahmojen elinaika saattoi joskus kadota käyttöliittymän alle.",
      "[*]Korjattiin virhe, jossa taitopäivitysten tekstit saattoivat peittyä tasopäivitysnäppäinten alle.",
      "[*]Korjattiin virhe, jossa tornin epääminen näkyi chat-viestinä taistelutapahtuman sijaan.",
      "[*]Korjattiin virhe, jossa tarra saattoi näkyä saatavilla asevarastossa, vaikka kyseisen tarran sisältävä kapseli ei olisikaan ollut saatavilla.",
      "[*]Korjattiin virhe, jossa päättyneen tapahtuman tarra saattoi näkyä edelleen ostettavissa.",
      "[*]Korjattiin virhe, jossa uuden esineen löytämisikkuna ei näyttänyt pelikenttä- ja käyttöliittymäesineitä oikein.",
      "[*]Korjattiin ongelma, jossa tavallisen pelin Näytä kaikki pelitilat -valinta saattoi tehdä osiosta käyttökelvottoman.",
      "[*]Korjattiin virhe, jossa ammattilaispelaajien Steam-tilin nimi näkyi ammattilaisnimen sijaan.",
      "[*]Korjattiin ongelma, jossa pitkät nimet leikkautuivat historia- ja taistelutilastosivuilla.",
      "[*]Lisättiin ilmoitus Workshopin mukautettujen pelien tekijöille, jotka eivät ole vielä päivittäneet mukautettuja malleja vanhentuneesta muodosta ennen ModelDocia, kuten on kuvattu [url=https://www.dota2.com/springcleaning]vuoden 2022 Kevätsiivous-päivityksessä[/url] ja [url=https://www.dota2.com/newsentry/3659774959159800240]Dead Reckoning -päivityksessä[/url].",
      "[/list]"
    ],
    "commentcount": 879,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 12621,
    "votedowncount": 1894,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1708470491,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12621,
  "votes_down": 1894,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}