{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualizarea Frostivus 2023 a sosit!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualizarea Frostivus 2023 a sosit!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023/?l=romanian][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Frostivus ne bate din nou la ușă, ceea ce înseamnă că King Kringle s-a trezit din locul în care hiberna, de sub Mările Sângerii care înconjoară Castelul Frostivus. Acesta și-a trimis legiunile de copii spiriduși mineri la minele sale de jucării. Totodată, i-a înhămat pe cei doi lupi ai săi înflăcărați cu ochi roșiatici, Lumpo și Rupertus, la sania sa osoasă și a plecat la drum. Cel mai probabil, acum se află pe acoperișul casei tale sau deja înăuntrul acesteia.",
      "Așa că dacă te afli pe lista celor cuminți, pregătește-te să-ți împodobești bradul cu accesorii Frostivus noi și de la edițiile anterioare, o mulțime de îmbunătățiri pentru experiența de joc, seturi premium noi pentru Dota Plus și actualizarea de joc 7.35. Informațiile despre toate cele menționate anterior sunt disponibile pe [url=https://www.dota2.com/frostivus2023?l=romanian]această pagină web[/url].",
      "Pe de altă parte, dacă te numeri printre cei neascultători, avem vești bune pentru toți ceilalți și vești proaste pentru tine, deoarece anul acesta va fi un masacru. Probabil îți amintești că [url=https://www.dota2.com/newsentry/3692442542242977036?l=romanian]în septembrie[/url] am scos de la păstrare ciocanul de interdicții și am aplicat interdicții permanente pentru 90.000 de conturi de smurf. Am continuat să monitorizăm comportamentele jucătorilor, folosind atât mijloace manuale, cât și automate. În ultimele săptămâni, am aplicat un număr și mai mare de interdicții, iar printre conturile vizate s-au numărat zeci de mii de conturi de smurf numai astăzi.",
      "Pe parcursul campionatului The International, câțiva dintre jucătorii profesioniști ne-au contactat pentru a purta o conversație despre conturile acestora de smurf. Acele conversații au continuat, iar majoritatea jucătorilor profesioniști au fost de acord că aplicarea unor interdicții asupra conturilor de smurf ale profesioniștilor reprezintă o victorie pentru comunitatea de Dota: regulile ar trebui să fie valabile pentru toată lumea, iar, de acum încolo, așa se va întâmpla. Iar activitatea de smurfing nu este singura fărădelege la care iau parte jucătorii. Printre persoanele care desfășoară activități îndoielnice se numără și cele cu rele intenții, care au un comportament inadecvat și strică experiența de joc a celorlalți. Ca urmare, scorul comportamental al acestor utilizatori scade, dar aceștia apelează la alte persoane pentru a-i ajuta să-și îmbunătățească scorul comportamental.",
      "Indiferent de [i]felul[/i] în care te-ai dovedit neascultător, am stat cu ochii pe tine (nu și când dormeai, calmează-te) și vom lua măsuri împotriva tuturor activităților menționate. Pedepsele vor fi acordate pentru toate activitățile menționate mai sus, iar printre pedepse se numără și penalizările pentru scorul comportamental. În cazurile mai serioase, vor fi aplicate interdicții contului principal. ",
      "După cum am menționat mai sus, smurfingul (și alte comportamente negative) au un impact negativ asupra meciurilor, iar noi vrem să ne asigurăm că meciurile tale sunt cât mai bune cu putință pe parcurs ce ne apropiem de noul an. Așa că am dori să le urăm tuturor o [url=https://www.dota2.com/frostivus2023?l=romanian]actualizare fericită de Frostivus![/url] Cu excepția celor care au conturi de smurf, care nu se vor bucura de actualizare pentru că se vor îneca mâncând prăjiturile cu aromă de cărbune pe care le merită din plin.",
      "[b]Frostivus 2023 Treasure Chest:[/b]",
      "[list]",
      "[*]Fiecare cufăr conține unul dintre cele 30 de obiecte, care sunt împărțite în 4 categorii, sau un curier cosmic de rar Baby Roshan.",
      "[*]Obiectele din cadrul unei categorii au aceeași raritate.  Nu vei primi dubluri pentru o categorie până nu vei obține toate obiectele din categoria respectivă.",
      "[*]Cinci obiecte din aceeași categorie pot fi convertite într-un obiect aleatoriu din categoria următoare.",
      "[*]Șansa de a obține obiectul cosmic de rar este de 1 la 100.000 de cufere.  Celelalte cufere conțin un obiect dintr-una din cele patru categorii.  Începând de la prima categorie, fiecare obiect are o șansă de 10% să facă parte din următoarea categorie.",
      "[*]Atunci când deschizi un cufăr sau folosești obiectele pentru a obține unul mai bun, există o șansă de 1 la 300 de a obține un obiect Unusual aleatoriu: fie o copie a obiectului, fie, dacă este vorba de un set, unul dintre obiectele setului.  Fiecare obiect Unusual are un efect special aleatoriu.  Cele trei efecte disponibile sunt de aceeași raritate.",
      "[/list]",
      "[b]Remedieri de erori:[/b]",
      "[list]",
      "[*]A fost remediat faptul că atunci când un erou era ucis într-o instanță de Chronosphere și pierdea Gem of True Sight, repausul obiectului rămânea blocat.",
      "[*]A fost remediată o cădere rară privind combinarea obiectelor.",
      "[*]A fost remediat faptul că, dacă o abilitate care avea repausul blocat avea din nou repausul blocat, acesta ar fi fost deblocat mai devreme decât ar fi trebuit.",
      "[*]A fost remediat faptul că abilitățile cu efecte pozitive intrinseci nu puteau să aplice efectele dacă eroul achiziționa Aghanim's Shard.",
      "[*]A fost remediat faptul că acțiunea de comutare a abilităților (sau obținerea obiectului Aether Lens etc.) nu actualiza cercul privind distanța de invocare dacă acesta era deja afișat.",
      "[*]A fost remediat faptul că particulele abilității Chaos Bolt a lui Chaos Knight apăreau uneori într-o locație greșită.",
      "[*]A fost remediat faptul că abilitatea Starbreaker a eroinei Dawnbreaker oferea imunitate la daunele pure, chiar și fără Aghanim's Shard.",
      "[*]A fost remediat faptul că setul Bindings of Deep Magma al lui Earthshaker nu afișa corect particulele (noi) pentru noul stil (a 10-a aniversare) și faptul că particulele vechi nu dispăreau atunci când efectul se încheia.",
      "[*]A fost remediat faptul că reticulul de invocare al abilității Bushwhack a eroinei Hoodwink evidenția uneori copacii aflați în afara zonei de efect.",
      "[*]Au fost remediate câteva probleme privind animațiile abilității Walrus PUNCH! a lui Tusk.",
      "[*]A fost remediată o eroare din cauza căreia versiunea îmbunătățită de Aghanim's Shard a instanței de Magic Missile a eroinei Vengeful Spirit putea să sară către inamicii invizibili care erau imuni împotriva vederii veritabile.",
      "[*]A fost remediată o problemă privind particulele abilității Voodoo Restoration aferente armei Immortal Awaleb's Trundleweed a lui Witch Doctor.",
      "[*]A fost remediat faptul că slotul pentru obiectul neutru nu era evidențiat atunci când era disponibil cel puțin un jeton în depozit, ci era evidențiat atunci când orice coechipier depozita un obiect în depozit.",
      "[*]A fost remediat faptul că, dacă tasta Alt era apăsată în timp ce o abilitate era invocată, acest fapt determina și generarea unei alerte de tip ping.",
      "[*]Au fost remediate probleme vizuale din interfață privind timpul de existență rămas al wardurilor și unităților invocate.",
      "[*]A fost remediat faptul că descrierile talentelor erau uneori ascunse de numele tastelor rapide.",
      "[*]A fost remediat faptul că acțiunea de sacrificare a unui turn era afișată în chat în loc să fie afișată ca un eveniment în jurnalul de luptă.",
      "[*]A fost remediat faptul că abțibildurile erau afișate ca fiind disponibile în arsenal, chiar dacă respectiva capsulă cu abțibilduri nu era disponibilă.",
      "[*]A fost remediat faptul că erau afișate ca fiind disponibile pentru achiziție capsulele cu abțibilduri aferente evenimentelor care s-au încheiat deja.",
      "[*]A fost remediat faptul că mesajul pop-up privind obiectele primite nu era afișat corect pentru obiectele globale.",
      "[*]A fost remediat faptul că selectarea opțiunii „Afișează toate modurile” pentru meciurile necontorizate putea face secțiunea inutilizabilă.",
      "[*]A fost remediat faptul că uneori, pentru jucătorii profesioniști, erau afișate pseudonimele de pe Steam în locul numelor corecte.",
      "[*]A fost remediat faptul că numele lungi erau excedentare pe paginile din istoric și în statisticile de luptă.",
      "[*]A fost adăugată o notificare suplimentară pentru creatorii de moduri de joc personalizate din atelier cu privire la faptul că nu și-au actualizat încă modelele personalizate de la vechiul format ModelDoc, așa cum este descris în [url=https://www.dota2.com/springcleaning?l=romanian]actualizarea curățeniei de primăvară 2022[/url] și în [url=https://www.dota2.com/newsentry/3659774959159800240?l=romanian]actualizarea Dead Reckoning[/url].",
      "[/list]"
    ],
    "commentcount": 879,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 12621,
    "votedowncount": 1894,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1708470491,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12621,
  "votes_down": 1894,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}