{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Cập nhật Frostivus 2023 đến rồi đây!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Cập nhật Frostivus 2023 đến rồi đây!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Một mùa Frostivus nữa đã đến với chúng ta, và điều đó có nghĩa là Đức vua Kringle đã tỉnh dậy sau giấc ngủ đông dưới lòng Biển Máu sẫm màu rượu chát, bao bọc lâu đài Frostivus. Ngài cử quân đoàn tiểu yêu bị bắt cóc để đào hầm mỏ đồ chơi của ngài; rồi thắng hai con sói hung hãn mắt đỏ rừng rực Lumpo và Rupertus vào cỗ xe trượt bằng xương; và ngay lúc này đây, ngài có thể đang ở trên nóc nhà hoặc có khi là bên trong ngôi nhà của bạn rồi đó.",
      "Cho nên, nếu bạn nằm trong danh sách bé ngoan của ngài, hãy chuẩn bị trang hoàng hội trường băng giá với các vật phẩm trang trí Frostivus cũ mới có đủ, vô số tính năng phần mềm chất như nước cất, bộ vật phẩm cao cấp Dota Plus mới và cập nhật lối chơi 7.35, đọc tất tần tật [url=https://www.dota2.com/frostivus2023]ngay tại đây[/url].",
      "Ngược lại, nếu bạn là bé hư, thì chúng tôi có tin tốt cho mọi người và tin dữ cho bạn đây, vì năm nay sẽ tắm trong bể máu. Bạn có nhớ [url=https://www.dota2.com/newsentry/3692442542242977036]vào tháng 9 rồi[/url], chúng tôi đã giơ búa thanh trừng và cấm vĩnh viễn 90.000 tài khoản smurf không? Từ dạo đó, chúng tôi tiếp tục đầu tư vào giám sát hành vi người chơi, trên cả phương diện phân tích thủ công và tự động. Trong vài tuần qua, chúng tôi đẩy mạnh làn sóng cấm chơi, chỉ tính hôm nay đã có hàng ngàn tài khoản smurf bị đày ra đảo.",
      "Tại The International, vài người chơi chuyên nghiệp đã liên hệ chúng tôi về các tài khoản smurf của họ. Chúng tôi vẫn đang tiếp tục thảo luận, và những người chơi chuyên nghiệp có sự đồng thuận rằng cấm tài khoản smurf là việc làm đúng đắn cho cộng đồng Dota. Luật nên áp dụng cho tất cả mọi người, kể từ giờ trở đi sẽ là như vậy. Tài khoản smurf không phải là trò đùa dại duy nhất từ người chơi đâu. Trong số những trò nghịch đáng ngờ khác, vài kẻ xấu đang giả khờ, để rồi phá hỏng trò chơi và mất điểm hành vi, sau đó thuê dân cày để kéo điểm hành vi lên lại.",
      "Bất kể [i]bạn nghịch phá thế nào[/i], chúng tôi vẫn theo sát bạn (không phải lúc bạn ngủ, cứ bình tĩnh) và chúng tôi sẽ xử đẹp tất cả trò hư đó. Hình phạt sẽ được áp dụng cho tất cả những điều trên, bao gồm phạt về điểm hành vi - và trong trường hợp nghiêm trọng, cấm tài khoản chính. ",
      "Như đã nói trước đó, smurf (và những hành vi xấu khác) gây ảnh hưởng tiêu cực tới trận đấu, và chúng tôi muốn đảm bảo các bạn có trải nghiệm chơi tốt nhất trước thềm năm mới. Vậy nên, chúc mọi người một mùa [url=https://www.dota2.com/frostivus2023]cập nhật Frostivus vui vẻ![/url] Trừ các tài khoản smurf không thể tận hưởng niềm vui này đâu, vì sẽ không nuốt nổi mấy món gạch đá tráng miệng đắng nghét đáng đời.",
      "[b]Hòm kho báu Frostivus 2023:[/b]",
      "[list]",
      "[*]Mỗi hòm chứa một trong 30 vật phẩm chia làm 4 bậc, hoặc một thú vận chuyển Baby Roshan với độ hiếm hy hữu.",
      "[*]Vật phẩm cùng bậc có độ hiếm ngang nhau.  Bạn sẽ không nhận vật phẩm trùng từ mỗi bậc cho đến khi đã nhận mỗi món một lần.",
      "[*]Năm vật phẩm cùng bậc có thể dùng để đổi lấy một vật phẩm ngẫu nhiên từ bậc tiếp theo.",
      "[*]Vật phẩm hiếm hy hữu chỉ có 1 trong 100000 kho báu.  Các hòm kho báu khác chứa một vật phẩm từ một trong các món của bậc 4.  Bắt đầu từ bậc 1, mỗi vật phẩm có 10% cơ hội nâng lên bậc tiếp theo.",
      "[*]Khi mở một hòm hoặc đổi nâng lên bậc tiếp theo, có 1 trong 300 cơ hội để nhận thêm vật phẩm có phẩm chất 'Lạ thường' -- dưới dạng bản sao của vật phẩm đó, hoặc nếu là bộ vật phẩm, thì một món trong bộ đó.  Mỗi vật phẩm 'Lạ thường' sẽ ngẫu nhiên một hiệu ứng đặc biệt.  Cả ba hiệu ứng đều có độ hiếm như nhau.",
      "[/list]",
      "[b]Các lỗi sửa:[/b]",
      "[list]",
      "[*]Sửa trường hợp nếu tướng bị giết trong Chronosphere đánh rơi Gem of True Sight, thời gian hồi của vật phẩm vẫn bị đóng băng",
      "[*]Sửa lỗi ngắt đột ngột hiếm gặp khi kết hợp vật phẩm",
      "[*]Sửa trường hợp nếu kỹ năng đang có thời gian hồi đóng băng bị đóng băng lần nữa, thời gian hồi sẽ trở lại bình thường sớm hơn dự tính",
      "[*]Sửa lỗi kỹ năng không thể áp dụng các bổ trợ nội tại khi mua Aghanim's Shard",
      "[*]Sửa lỗi khi đổi kỹ năng (hoặc khi nhận Aether Lens, v.v.) không thay đổi tầm thi triển nếu nó đang được hiển thị",
      "[*]Sửa hiệu ứng hạt Chaos Bolt của Chaos Knight đôi lúc đánh mất vị trí của chúng",
      "[*]Sửa lỗi Starbreaker của Dawnbreaker cho phép miễn nhiễm sát thương thuần trong khi không cần Aghanim's Shard",
      "[*]Sửa bộ vật phẩm Bindings of Deep Magma của Earthshaker để hiện đúng hiệu ứng hạt (mới) cho kiểu dáng mới (kỷ niệm 10 năm) và xóa hiệu ứng hạt đúng cách khi hết hạn",
      "[*]Sửa tâm ngắm thi triển Bushwhack của Hoodwink đôi lúc làm nổi bật cây nằm ngoài phạm vi hiệu lực",
      "[*]Sửa vài lỗi cử động Walrus PUNCH! của Tusk",
      "[*]Sửa lỗi Magic Missile của Vengeful Spirit với Aghanim's Shard có thể nảy tới kẻ địch tàng hình miễn nhiễm với hiệu ứng nhìn tàng hình",
      "[*]Sửa lỗi về hiệu ứng hạt Voodoo Restoration của Witch Doctor khi dùng vũ khí bất biệt Awaleb's Trundleweed",
      "[*]Sửa cách làm sáng ô trang bị rừng để chỉ sáng lên khi có ít nhất một token rừng có thể dùng trong kho đồ, thay vì có bất kỳ trang bị nào từ đồng đội",
      "[*]Sửa lỗi khi vận pháp mà giữ phím Alt cũng sẽ ping",
      "[*]Sửa đồng hồ đếm thời gian tồn tại của mắt và đơn vị triệu hồi bị cắt trong giao diện",
      "[*]Sửa lỗi phần mô tả khách mời đôi khi bị chặn bởi tên phím tắt",
      "[*]Sửa thông báo chối bỏ trụ hiện dưới dạng tin nhắn thay vì sự kiện giao tranh",
      "[*]Sửa lỗi hình dán hiện dưới dạng có sẵn trong kho đồ, mặc dù gói chứa hình dán đó có thể không còn mua được",
      "[*]Sửa gói hình dán của sự kiện đã kết thúc hiện dưới dạng mua được",
      "[*]Sửa thông báo \"Nhận vật phẩm\" không hiện đúng cách cho vật phẩm chung",
      "[*]Sửa lỗi khi chọn \"Hiện mọi chế độ\" trong \"Đấu thường\" sẽ khiến mục này không dùng được",
      "[*]Sửa lỗi đôi khi hiển thị tên biệt danh Steam của người chơi chuyên nghiệp thay vì tên đúng",
      "[*]Sửa lỗi tràn chữ trong trang lịch sử và thông số trận đấu khi tên quá dài",
      "[*]Thêm thông báo bổ sung dành cho tác giả màn chơi tùy biến trong Workshop chưa cập nhật các mô hình tùy chỉnh để ngừng sử dụng định dạng cũ (trước ModelDoc) không còn được hỗ trợ, như mô tả trong [url=https://www.dota2.com/springcleaning]Cập nhật dọn dẹp mùa xuân 2022[/url] và [url=https://www.dota2.com/newsentry/3659774959159800240]Bản cập nhật Dead Reckoning[/url]",
      "[/list]"
    ],
    "commentcount": 879,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 28,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 12621,
    "votedowncount": 1894,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1708470491,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12621,
  "votes_down": 1894,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}