{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Обновлението Frostivus 2023 е тук!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Обновлението Frostivus 2023 е тук!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Поредният Frostivus наближава. А това значи, че King Kringle се е пробудил от зимния си сън под мрачните като вино Кървави морета, заобикалящи замъка Frostivus. След туй е изпратил своите легиони от отвлечени гоблини миньори да копаят в неговите мини за детски играчки. После е закачил своите злокобни вълци близнаци с блестящи червени очи, Lumpo и Rupertus, към неговата шейна от кости. И вероятно вече е връз или вътре в къщата Ви точно сега.",
      "Ето защо ако сте в неговия списък с добрички потребители, пригответе се мразовитите Ви помещения да бъдат украсени с нови и завръщащи се козметични Frostivus артикули, купища характеристики за подобряване на жизнения стандарт в клиента, нови премиум Dota Plus набори и игралното обновление 7.35. Можете да прочетете относно всичко това [url=https://www.dota2.com/frostivus2023]точно тук[/url].",
      "От друга страна, ако сте в списъка на палавите потребители, имаме страхотни новини за всички останали и лоши за Вас, защото тази година ще бъде кръвопролитна. Може би си спомняте, че [url=https://www.dota2.com/newsentry/3692442542242977036]през септември[/url] извадихме чука за забрани и наложихме перманентни такива на 90 000 „смърф“ акаунта. Оттогава насам продължихме да влагаме ресурси в това да наблюдаваме поведението на играчите. Правим това на фронтовете за ръчен и автоматичен анализ. През последните няколко седмици бяхме ангажирани с още по-агресивна вълна от забрани. Тя включваше множество десетки хиляди наложени забрани на „смърф“ акаунти само за днес.",
      "На The International някои професионални играчи се свързаха с нас, за да говорят относно своите „смърф“ акаунти. Тези разговори продължиха и има общ консенсус сред професионалистите. А той е, че налагането на забрани на професионалните „смърф“ акаунти е победа за Dota 2 като общност. Правилата трябва да важат за всекиго и оттук насетне това ще бъде така. А „смърфването“ дори не е единственото палаво нещо, с което играчите се захващат. Измежду другите съмнителни избори, някои лоши деятели играят като будали, съсипват мачовете и губят от своята поведенческа оценка поради това. А след това наемат „фермери“ за поведенческа оценка, така че пак да я доведат до предходната ѝ стойност.",
      "Независимо от това [i]по какъв начин[/i] сте били палави, ние Ви наблюдаваме (не докато спите, успокойте се) и предприемаме стриктни мерки срещу всеки способ. Ще бъдат раздавани наказания за всичко от гореупоменатото. Това включва наказания за поведенческата оценка, а в сериозни случаи и налагане на забрана на основния акаунт. ",
      "Както казахме и преди, „смърфването“ (редом с останалото отрицателно поведение) влошава мачовете, а ние искаме да се уверим, че игрите Ви са възможно най-добри, докато навлизаме в новата година. И така, бихме искали да пожелаем на всички [url=https://www.dota2.com/frostivus2023]весело изкарване във Frostivus обновлението[/url]! С изключение на „смърф“ акаунтите, които допускаме, че няма да се насладят на обновлението, докато им присядат заслужените обилни десерти с въглищен вкус.",
      "[b]Frostivus 2023 сандък със съкровище:[/b]",
      "[list]",
      "[*]Всеки сандък съдържа един от 30 артикула, разделени в 4 поредици, или космически рядък Baby Roshan куриер;",
      "[*]Артикулите от същата поредица разполагат с еднаква рядкост.  Няма да получавате дубликати от никоя поредица, докато не разполагате с всеки артикул по веднъж;",
      "[*]Пет артикула от същата поредица могат да бъдат разменени за произволен такъв от следваща;",
      "[*]Космически редкият артикул се намира в 1 от 100 000 сандъка.  Другите сандъци съдържат артикул от една от 4-те поредици.  Считано от поредица 1, всеки артикул има 10% шанс за подобряване до следващата такава;",
      "[*]Когато отваряте сандък или разменяте артикул, има шанс 1 от 300 да получите допълнителен необичаен артикул. Това може да е копие на получавания или ако е набор, един от артикулите в него.  Всеки необичаен артикул разполага с произволен специален ефект.  Трите ефекта разполагат с еднаква рядкост.",
      "[/list]",
      "[b]Поправки на неизправности:[/b]",
      "[list]",
      "[*]Поправен е проблем, при който ако даден герой, убит в Chronosphere, пуснеше Gem of True Sight, времето за изчакване на Gem of True Sight оставаше замразено;",
      "[*]Поправени е рядък срив с комбинирането на предмети;",
      "[*]Поправен е проблем, при който ако дадено умение, чието време за изчакване е било замразено, отново стане такова, то щеше да се размрази прекалено рано;",
      "[*]Поправен е проблем, при който способностите с присъщи бъфове можеше да доведе до неуспешното им прилагане при закупуването на Aghanim's Shard;",
      "[*]Поправен е проблем, при който превключването на умения (или придобиването на Aether Lens и т.н.) не обновяваше окръжността на обсега за изпълняване, ако тя вече беше изобразявана;",
      "[*]Chaos Knight: Chaos Bolt — поправено е, че частиците понякога губеха своето местонахождение;",
      "[*]Dawnbreaker: Starbreaker — поправено е, че предоставяше имунитет срещу същински щети без Aghanim's Shard;",
      "[*]Earthshaker: Bindings of Deep Magma — наборът е поправен, така че да показва правилните (нови) частици за новия стил (X годишнина). Също така е поправено уместно да изтрива частиците при изтичане;",
      "[*]Hoodwink: Bushwhack — поправено е, че мерникът за прицелване понякога отличаваше дървета извън площта на ефекта;",
      "[*]Tusk: Walrus PUNCH! — поправени са няколко проблема с анимациите;",
      "[*]Vengeful Spirit: Magic Missile с Aghanim's Shard — поправена е неизправност, при която можеше да отскочи към невидими врагове, имащи имунитет срещу True Sight;",
      "[*]Witch Doctor: Awaleb's Trundleweed — поправен е проблем с частиците за Voodoo Restoration на Immortal оръжието;",
      "[*]Поправено е отличаването на слота за неутрални предмети. Това вече трябва да става само когато има поне един свободен жетон в скривалището, вместо при някакъв предмет от някой съотборник;",
      "[*]Поправен е проблем, при който изпълняването на умение със задържан Alt клавиш също пингваше;",
      "[*]Поправени са броячите за продължителността на живота на Wards и призованите единици, които бяха изрязани в проекционния дисплей;",
      "[*]Поправено е, че описанията на талантите, понякога бяха блокирани от имена на бързите клавиши;",
      "[*]Поправено е, че отказванията на кули се появяваха като чат съобщения, вместо като бойни събития;",
      "[*]Поправени са стикерите, които се показваха като достъпни в „Оръжейната“, въпреки че съдържащата ги капсула може да не е налична;",
      "[*]Поправено е показването на капсули със стикери от приключили събития като такива, които могат да бъдат закупени;",
      "[*]Поправено е, че изскачащият прозорец за получени артикули не показваше правилно глобалните такива;",
      "[*]Поправен е проблем с пускането на мачове без класиране, при който отметката на „Показване на всички режими“ можеше да направи секцията неизползваема;",
      "[*]Поправено е, че понякога се показваха Steam прякорите на професионалните играчи вместо правилните имена;",
      "[*]Поправено е, че дългите имена препълваха страниците с „История“ и „Бойни статистики“;",
      "[*]Добавено е допълнително известие за творците на персонализирани игри в работилницата. То ще бъде показвано на онези от тях, които все още не са обновили своите персонализирани модели от оттегления формат, предхождащ ModelDoc, както е описано в [url=https://www.dota2.com/springcleaning]обновлението „Пролетно почистване“ през 2022[/url] и [url=https://www.dota2.com/newsentry/3659774959159800240]обновлението „Мъртвешка разплата“[/url].",
      "[/list]"
    ],
    "commentcount": 879,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 12621,
    "votedowncount": 1894,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1708470491,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12621,
  "votes_down": 1894,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}