{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Začíná Frostivus 2023",
  "event_type": 14,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Začíná Frostivus 2023",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Znovu nastal čas Frostivusu neboli čas sváteční, což znamená, že se Zimní král (někdy si nechává říkat také King Kringle) probudil ze svého spánku pod vínově rudou hladinou Červeného moře, vyslal své legie gobliních horníků kutat do hračkových dolů, zapřáhl své kostěné saně za zlovlky Lumpa a Ruperta a s největší pravděpodobností už také přistál na Vaší střeše.",
      "Pokud jste byli celý rok hodní, nemáte se čeho bát. Dostanete nové i staronové kosmetické předměty, tunu užitečných vylepšení hry, nové prémiové sety v programu Dota Plus a herní aktualizaci 7.35. Všechno jsme to rozepsali na [url=https://www.dota2.com/frostivus2023]této stránce[/url].",
      "Na druhou stranu, pokud jste zlobili, máme skvělé zprávy. Ne pro Vás, pro všechny ostatní. Pro Vás máme hodně špatné zprávy. Jak si možná vzpomínáte, [url=https://www.dota2.com/newsentry/3692442542242977036]v září[/url] jsme vytáhli banovací kladivo a permanentně zabanovali 90 000 smurfovacích účtů. Tím jsme však neskončili a nadále jsme monitorovali chování hráčů, jak prostřednictvím manuální, tak automatické analýzy. I díky tomu jsme ostatně v uplynulých několika týdnech vypustili ještě agresivnější vlnu banů, která například jenom dnes utopila desítky tisíc smurfů.",
      "Ohledně smurfovacích účtů se na nás během šampionátu The International obrátilo také několik profesionálních hráčů, a až na výjimky se s námi shodli, že banování profesionálních smurfovacích účtů je krok správným směrem: pravidla by se měla vztahovat na všechny hráče a od teď už budou. A mimochodem, ať jste v obraze, smurfování je pouhou špičkou ledovce nápadů zlobivých hráčů a v poslední době se například rozmáhá nešvar, že hráči, kteří kažením zápasů přišli o skóre chování, najímají „farmáře skóre“ pro jeho opětovné vytažení do přípustných hodnot.",
      "Ať už jste ale zlobili [i]jakkoli[/i], věřte, že jsme to viděli (kamery v bytě nehledejte, máme jiné zdroje) a spravedlnost si Vás najde. Tresty budou začínat u penalizací skóre chování (méně závažné prohřešky) a končit až u permanentních banů hlavních účtů (velmi vážné prohřešky). ",
      "Říkáme to dnes a znovu, smurfování (a další nevhodné chování) zhoršuje kvalitu zápasů, a my chceme tu kvalitu od nového roku co nejvíce pozvednout. Takže přejeme hezké svátky a doufáme, že si všichni užijete [url=https://www.dota2.com/frostivus2023]Frostivus[/url]! Teda kromě smurfů, těm přejeme leda tak uhlí pod stromečkem a kapra plného kostí.",
      "[b]Truhla Frostivus 2023 Treasure Chest:[/b]",
      "[list]",
      "[*]Každá truhla obsahuje jeden z 30 předmětů rozdělených do čtyř hodností. Krutopřísně vzácnou odměnu pak zastává kurýr Gingerbread Baby Roshan.",
      "[*]Předměty stejné hodnosti jsou stejně vzácné,  a dokud z jedné hodnosti nezískáte všechny předměty, nemohou se opakovat.",
      "[*]Pět předmětů stejné hodnosti lze vylepšit na náhodný předmět následující vyšší hodnosti.",
      "[*]Krutopřísně vzácná odměna se ukrývá v každé 100 000. truhle.  Všechny ostatní truhly obsahují předmět z jedné ze čtyř nižších hodností.  Počínaje 1. hodností má každá truhla 10% šanci na to, že její předmět bude pocházet z následující vyšší hodnosti.",
      "[*]Vždy, když otevřete truhlu nebo vylepšíte předměty na vyšší úroveň, máte šanci 1 ku 300, že obdržíte bonusový Unusual předmět – buďto kopii předmětu získaného z truhly, nebo v případě setů jeden z předmětů získaného setu.  Každý Unusual předmět má náhodně přiřazený speciální efekt,  přičemž všechny tři dostupné efekty jsou stejně vzácné.",
      "[/list]",
      "[b]Opravy chyb:[/b]",
      "[list]",
      "[*]Byl opraven problém, kvůli kterému se mohlo stát, že když hrdina zabitý v kopuli schopnosti Chronosphere (Faceless Void) upustil předmět Gem of True Sight, cooldown tohoto předmětu zůstal zmrazený",
      "[*]Byl opraven vzácný pád hry spojený s kombinováním předmětů",
      "[*]Byl opraven problém, kvůli kterému se mohlo stát, že pokud měla schopnost zmrazený cooldown a došlo k jejímu dalšímu zmrazení, cooldown se spustil dříve, než měl",
      "[*]Byl opraven problém se schopnostmi s vnitřními buffy, které nemusely být aplikovány po zakoupení předmětu Aghanim’s Shard",
      "[*]Byl opraven problém, kvůli kterému přepnutí schopnosti (nebo získání předmětu Aether Lens apod.) neaktualizovalo již zobrazený ukazatel rozsahu",
      "[*]Byly opraveny částicové efekty schopnosti Chaos Bolt (Chaos Knight), které se mohly ztratit",
      "[*]Byla opravena schopnost Starbreaker (Dawnbreaker), která poskytovala imunitu vůči neredukovanému poškození i bez předmětu Aghanim’s Shard",
      "[*]Byl opraven set Bindings of Deep Magma pro Earthshakera, aby zobrazoval správné částicové efekty nového stylu (toho k 10. výročí hry) a vhodně odstraňoval částicové efekty po smrti hrdiny",
      "[*]Byl opraven ukazatel rozsahu schopnosti Bushwhack (Hoodwink), který někdy zvýrazňoval i stromy mimo rozsah",
      "[*]Bylo opraveno několik problémů s animacemi se schopností Walrus PUNCH! (Tusk)",
      "[*]Byla opravena chyba, kvůli které mohla schopnost Magic Missile (Vengeful Spirit) se Shardem přeskočit na neviditelné nepřátele imunní vůči odhalení schopností True Sight",
      "[*]Byl opraven problém s částicovými efekty schopnosti Voodoo Restoration (Witch Doctor) u Immortal předmětu Awaleb's Trundleweed",
      "[*]Byl opraven slot pro neutrální předmět, aby byl zvýrazňován pouze, pokud je ve skrýši alespoň jeden volný žeton (doteď byl zvýrazňován vždy, když byl do skrýše poslán libovolný předmět)",
      "[*]Byl opraven problém, kvůli kterému použití schopnosti při držení klávesy Alt vyústilo také v pingnutí",
      "[*]Byly opraveny odpočty do vypršení Ward a vyvolaných jednotek, které mohly být useknuty",
      "[*]Byly opraveny popisy talentů, které mohly být překryty klávesovými zkratkami",
      "[*]Byly opraveny denye věží, které se zobrazovaly jako zprávy v chatu namísto zpráv o bojové události",
      "[*]Byly opraveny samolepky, které se ve zbrojnici zobrazovaly jako dostupné, ačkoli jejich kapsle už dostupná nebyla",
      "[*]Bylo opraveno zobrazování kapslí se samolepkami z ukončených událostí jako dostupných k zakoupení",
      "[*]Bylo opraveno vyskakovací okno s obdrženými předměty, které nezobrazovalo správně globální předměty",
      "[*]Byl opraven problém s vyhledáváním nehodnocených zápasů, kdy se mohlo stát, že po kliknutí na možnost „Zbylé módy“ přestala fungovat celá nabídka",
      "[*]Byla opravena chyba, kvůli které mohli být profesionální hráči zobrazeni se jmény ze služby Steam namísto „soutěžních“ jmen",
      "[*]Bylo opraveno přetékání delších názvů na stránkách „Historie“ a „Bitevní statistiky“",
      "[*]Bylo přidáno upozornění pro tvůrce uživatelských módů, které se zobrazí, pokud jejich modely stále vyžadují přechod na nový formát ModelDoc (viz [url=https://www.dota2.com/springcleaning]aktualizace Spring Cleaning 2022[/url] a [url=https://www.dota2.com/newsentry/3659774959159800240]aktualizace Dead Reckoning[/url])",
      "[/list]"
    ],
    "commentcount": 882,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 19,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 13051,
    "votedowncount": 1949,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1710280826,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 13051,
  "votes_down": 1949,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}