{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "¡Ya está aquí la actualización de Frostivus 2023!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198093408953",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1702598202
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "¡Ya está aquí la actualización de Frostivus 2023!",
    "posttime": 1702597627,
    "updatetime": 1703015246,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Se acerca otro Frostivus, y eso significa que Santa Claus ha despertado de su hibernación bajo los mares de sangre oscuros como el vino que rodean al castillo de Frostivus; envió a sus legiones de duendes mineros de juguete a cavar en sus minas de juguetes; conectó a sus lobos gemelos de ojos rojos brillantes, Lumpo y Rupertus, a su trineo de huesos; y es probable que esté volando por encima de tu casa o dentro de ella ahora mismo.",
      "Así que si no estás en su lista de niños buenos, prepárate para decorar tus pasillos congelados con el regreso de los nuevos cosméticos de Frostivus, muchísimas características para facilitar el desempeño del cliente, los nuevos sets Premium de Dota Plus, y el parche de jugabilidad 7.35. Puedes leer sobre todo esto [url=https://www.dota2.com/frostivus2023]aquí[/url].",
      "Por otro lado, si estás en la lista de niños malos, tenemos grandes noticias para todos los demás y malas noticias para ti, porque este año va a ser un baño de sangre. Puede que recuerdes que, [url=https://www.dota2.com/newsentry/3692442542242977036]el pasado mes de septiembre[/url], nos pusimos serios con los bloqueos y bloqueamos de forma permanente 90 000 cuentas de [i]smurf[/i]. Desde entonces, seguimos trabajando en mejorar la vigilancia del comportamiento de los jugadores con análisis tanto automáticos como manuales. En las últimas semanas, hemos llevado a cabo una ola de bloqueos aún más agresiva, que incluye miles de cuentas de [i]smurf[/i] bloqueadas solo en el día de hoy.",
      "En The International, algunos jugadores profesionales se comunicaron con nosotros para hablar sobre sus cuentas de [i]smurf[/i]. Esas conversaciones han continuado, y existe un gran acuerdo entre los profesionales de que prohibir las cuentas de [i]smurf[/i] es una victoria tanto para Dota como para la comunidad: las reglas deberían aplicarse a todos, y de ahora en adelante, así será. Y el [i]smurfing[/i] ni siquiera es lo único malo que los jugadores están haciendo. Entre otras opciones cuestionables, algunos malos jugadores están jugando con malas intenciones, arruinando juegos y perdiendo puntuación de comportamiento debido a ello, para luego contratar a otros usuarios que los ayuden a recuperar sus puntuaciones.",
      "Independientemente de [i]qué[/i] tan malo hayas sido, te hemos estado observando (no mientras duermes, cálmate) y estamos tomando medidas drásticas contra todo esto. Se impondrán castigos por todo lo descrito anteriormente, incluyendo penalizaciones de puntos de comportamiento y, en los casos más graves, bloqueos de las cuentas principales. ",
      "Como lo hemos dicho antes, el [i]smurfing[/i] (y otros comportamientos negativos) empeoran las partidas, y queremos asegurarnos de que tus partidas sean lo mejor posible a medida en que nos acercamos a un nuevo año. Así que nos gustaría desearles a todos una [url= https://www.dota2.com/frostivus2023]¡Feliz actualización de Frostivus! [/url] Excepto a las cuentas de los [i]smurfs[/i], que suponemos que no disfrutarán de la actualización, ya que se ahogarán con sus merecidos postres con sabor a carbón.",
      "[b]Corrección de errores:[/b]",
      "[list]",
      "[*]Se corrigió un problema por el cual si un héroe moría en la Cronoesfera, dejaba caer la Gema de Visión Verdadera, cuyo tiempo de recarga permanecía congelado.",
      "[*]Se corrigió un error poco común con las combinaciones de artículos.",
      "[*]Se corrigió un problema que hacía que si una habilidad con un tiempo de recarga congelado se congelaba de nuevo, se descongelaba antes de lo previsto.",
      "[*]Se corrigió un error que podía provocar que las habilidades con potenciadores intrínsecos no se aplicaran al comprar el Fragmento de Aghanim.",
      "[*]Se corrigió un problema por el que al cambiar de habilidades (o al obtener Lente Etérea, etc.) no actualizaba el círculo del rango de lanzamiento si este ya aparecía.",
      "[*]Se corrigió que las partículas de Rayo del Caos de Chaos Knight a veces perdieran su ubicación.",
      "[*]Se corrigió que Quebrantaestrellas de Dawnbreaker proporcionara inmunidad de daño puro sin el Fragmento de Aghanim.",
      "[*]Se corrigió el set Ornamentos del Magma Profundo de Earthshaker para que se muestren las partículas correctas (nuevas) en el estilo nuevo (del 10.º aniversario) y se eliminen correctamente cuando caduque.",
      "[*]Se corrigió la retícula lanzada por Emboscada de Hoodwink que a veces resalta árboles fuera del área de efecto.",
      "[*]Se corrigieron algunos problemas de animación con ¡Puñetazo de Morsa! de Tusk.",
      "[*]Se corrigió un error por el que Misil Mágico de Vengeful Spirit con el Fragmento de Aghanim podía rebotar en enemigos invisibles inmunes a Visión Verdadera.",
      "[*]Se corrigió un problema con las partículas de la habilidad Restauración Vudú y el arma inmortal Flor Milagrosa de Awaleb de Witch Doctor.",
      "[*]Se corrigió el espacio de objetos neutrales para que solo se resalte cuando haya al menos una ficha libre en la reserva, en lugar de cualquier objeto de cualquier compañero de equipo.",
      "[*]Se corrigió un error por el que al lanzar una habilidad con la tecla \"Alt\" presionada también hacía un ping.",
      "[*]Se corrigieron los contadores del tiempo de vida de los guardianes y las unidades invocadas, que aparecían cortados en el HUD.",
      "[*]Se corrigió que las descripciones de talentos algunas veces estaban bloqueadas por nombres de teclas de acceso rápido.",
      "[*]Se corrigió que la denegación de torres apareciera como mensaje de chat en vez de como evento de combate.",
      "[*]Se corrigieron las calcomanías que aparecían como disponibles en la Armería, incluso cuando la cápsula correspondiente no lo estaba.",
      "[*]Se corrigió que las cápsulas de calcomanías de eventos finalizados se pudieran comprar.",
      "[*]Los objetos globales ya aparecen correctamente en las notificaciones de objetos recibidos.",
      "[*]Se corrigió un problema al jugar \"No clasificatoria\" por el que al hacer clic en \"Mostrar todos los modos\" podía hacer que la sección no se pudiera utilizar.",
      "[*]Se corrigió que a veces se mostraran los nombres de las personas de Steam de los jugadores profesionales en lugar de los nombres correctos.",
      "[*]Se corrigieron los nombres largos que no cabían en las páginas del historial y de las estadísticas de batalla.",
      "[*]Se agregó una notificación adicional para autores de juegos personalizados en el Workshop que no hayan actualizado todavía sus modelos personalizados, para que no utilicen el formato obsoleto anterior a ModelDoc, como se describe en la [url=https://www.dota2.com/springcleaning]Actualización de Limpieza de Primavera 2022[/url] y la [url=https://www.dota2.com/newsentry/3659774959159800240]Actualización del Juicio Mortal[/url].",
      "[/list]"
    ],
    "commentcount": 768,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "mod_require_rereview"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 5934,
    "votedowncount": 1083,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 2,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1703015247,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1702610296,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 5934,
  "votes_down": 1083,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}