{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Началось Холодрыжество 2023 года!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Началось Холодрыжество 2023 года!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Настало очередное Холодрыжество, а это значит, что Скелет Мороз очнулся от спячки под тёмными как вино Морями крови, окружающими холодрыжеский замок... отправил легионы похищенных им детей-гоблинов в игрушечные копи за подарками... запряг в свои костяные сани сверкающих красными глазами близнецов-лютоволков Лумпо и Рупертуса... и уже приземлился на крышу вашего дома или даже проник в него.",
      "Если вы вели себя хорошо, приготовьтесь украсить свою ёлку новыми и классическими холодрыжескими аксессуарами, кучей улучшений клиента, новыми премиум-наборами для Dota Plus и обновлением 7.35 — обо всём этом можно прочитать [url=https://www.dota2.com/frostivus2023]вот здесь[/url].",
      "Если же вы вели себя плохо, то у нас есть отличные новости для всех остальных и плохие новости для вас — в этом году нас ждёт кровавая бойня. Возможно, вы помните, что [url=https://www.dota2.com/newsentry/3692442542242977036]в сентябре[/url] мы достали бан-молот и навсегда заблокировали 90 000 смурф-аккаунтов. С тех пор мы продолжали не только лично следить за поведением игроков, но и анализировать их действия с помощью автоматизированных систем. В последние несколько недель прошла ещё одна, более агрессивная волна блокировок, включающая десятки тысяч аккаунтов, заблокированных сегодня.",
      "На The International некоторые профессиональные игроки обсуждали с нами свои смурф-аккаунты. Эти обсуждения продолжились, и профессионалы достигли взаимного согласия: блокировка их смурфов-аккаунтов улучшает сообщество Доты. Правила должны распространяться на всех, и теперь так и будет. И смурфинг — это не единственное сомнительное занятие. Помимо прочего, некоторые нарушители портят игры другим и теряют порядочность, а потом нанимают других людей, чтобы поднять её обратно.",
      "Вне зависимости от того, [i]чем именно[/i] вы провинились, мы следили за вами (но, разумеется, не за тем, как вы спите), и сегодня мы принимаем строгие меры. Все вышеперечисленные нарушения будут наказываться, в том числе снижением порядочности, а в самых серьёзных случаях — блокировкой основных аккаунтов. ",
      "Как мы уже говорили, смурфинг (и другое негативное поведение) портит игру, и мы хотим, чтобы в преддверии Нового года играть было как никогда приятно. Так что желаем всем [url=https://www.dota2.com/frostivus2023]счастливого холодрыжеского обновления[/url]! Всем, кроме смурф-аккаунтов, которые вряд ли будут довольны своими более чем заслуженными подарками.",
      "[b]Холодрыжеский сундук 2023 года:[/b]",
      "[list]",
      "[*]Каждый сундук содержит один из 30 предметов, разделённых на 4 разряда, или чрезвычайно редкого курьера-Рошанчика.",
      "[*]Предметы одного и того же разряда имеют одинаковую редкость.  Вы не начнёте получать дубликаты предметов определённого разряда, пока не получите все предметы в нём.",
      "[*]Пять предметов одного разряда можно обменять на случайный предмет следующего разряда.",
      "[*]Чрезвычайно редкий предмет содержится в 1 из 100 000 сундуков.  Остальные сундуки содержат предмет одного из четырёх разрядов.  У предмета каждого разряда, начиная с первого, есть шанс в 10% улучшиться до следующего разряда.",
      "[*]Открывая сундук или обменивая предметы, вы с вероятностью 1 к 300 можете получить дополнительный необычный предмет — либо копию полученного обычного предмета, либо, если вы получили набор, копию одного из предметов оттуда.  У каждого необычного предмета есть один из трёх случайных особых эффектов.  Их редкость одинаковая.",
      "[/list]",
      "[b]Исправления:[/b]",
      "[list]",
      "[*]Исправлена ошибка, из-за которой перезарядка Gem of True Sight, потерянного погибшим под действием Chronosphere героем, застывала.",
      "[*]Устранена причина редкого сбоя, происходившего при комбинировании предметов.",
      "[*]Исправлена ошибка, из-за которой повторная заморозка перезарядки способности с замороженной перезарядкой приводила к тому, что заморозка заканчивалась слишком рано.",
      "[*]Исправлена ошибка, из-за которой встроенные эффекты способностей не накладывались при покупке Aghanim's Shard.",
      "[*]Исправлена ошибка, из-за которой переключение способностей (или покупка Aether Lens и т. п.) не обновляло индикатор дальности применения, если он уже отображался.",
      "[*]Исправлена ошибка, из-за которой эффекты частиц Chaos Bolt у Chaos Knight иногда отображались не в том месте.",
      "[*]Исправлена ошибка, из-за которой Starbreaker у Dawnbreaker давала невосприимчивость к чистому урону без Aghanim's Shard.",
      "[*]Исправлена ошибка, из-за которой у набора Bindings of Deep Magma для Earthshaker не отображались правильные (новые) частицы для юбилейного стиля и неправильно удалялись частицы, действие которых закончилось.",
      "[*]Исправлена ошибка, из-за которой указатель способности Bushwhack у Hoodwink иногда подсвечивал деревья вне зоны действия.",
      "[*]Решены различные проблемы c анимацией способности Walrus PUNCH! у Tusk.",
      "[*]Исправлена ошибка, из-за которой снаряд Magic Missile у Vengeful Spirit с Aghanim's Shard мог отскочить в невидимого врага, невосприимчивого к раскрытию невидимости.",
      "[*]Исправлена ошибка с эффектами частиц Voodoo Restoration у Witch Doctor с Immortal-предметом Awaleb's Trundleweed.",
      "[*]Теперь ячейка нейтрального предмета подсвечивается, только когда в тайнике есть хотя бы один неиспользованный жетон, а не любой предмет любого союзника.",
      "[*]Исправлена ошибка, из-за которой применение способности с зажатой клавишей Alt также отправляло сигнал.",
      "[*]Исправлена ошибка, из-за которой таймеры существования вардов и призываемых существ обрезались в интерфейсе.",
      "[*]Исправлена ошибка, из-за которой иконки горячих клавиш перекрывали описания талантов.",
      "[*]Теперь добивание союзной башни отображается как игровое событие, а не как сообщение в чате.",
      "[*]Исправлена ошибка, из-за которой в арсенале некоторые наклейки отображались как доступные, хотя капсула с ними уже недоступна.",
      "[*]Исправлена ошибка, из-за которой капсулы с наклейками закончившихся событий отображались как доступные для покупки.",
      "[*]Исправлена ошибка, из-за которой во всплывающих уведомлениях неправильно отображались общие предметы.",
      "[*]Исправлена ошибка, из-за которой нажатие на кнопку «Показать все режимы» в разделе поиска обычной игры приводило к тому, что этим меню было невозможно пользоваться.",
      "[*]Исправлена ошибка, из-за которой иногда вместо никнейма профессионального игрока отображалось его имя в Steam.",
      "[*]Исправлена ошибка, из-за которой слишком длинные имена выходили за пределы интерфейса на страницах истории и боевой статистики.",
      "[*]Добавлено новое оповещение для авторов пользовательских режимов в мастерской Dota 2, которые не перевели свои модели из устаревшего формата в ModelDoc. Подробнее мы упоминали об этом в обновлениях [url=https://www.dota2.com/springcleaning]«Весенняя уборка 2022»[/url] и [url=https://www.dota2.com/newsentry/3659774959159800240]«Смертная расплата»[/url].",
      "[/list]"
    ],
    "commentcount": 871,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 11178,
    "votedowncount": 1767,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1705340693,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11178,
  "votes_down": 1767,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}