{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "¡Ya está aquí la actualización de la Fiesta de la Escarcha de 2023!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702597620,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1702597626
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "¡Ya está aquí la actualización de la Fiesta de la Escarcha de 2023!",
    "posttime": 1702597627,
    "updatetime": 1702597627,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Se acerca otra Fiesta de la Escarcha y eso quiere decir que Kringle King ha despertado de su sueño invernal bajo los mares de sangre oscuros como el vino que rodean el Castillo de la Escarcha. Envió a sus legiones de duendes mineros raptados a cavar en las minas de juguetes, ató a sus temibles lobos gemelos Lumpo y Rupertus al trineo de huesos, y es probable que ahora mismo esté volando por encima de tu casa o se haya metido dentro.",
      "Así que, si te has portado bien, prepárate para decorarlo todo con los cosméticos nuevos y antiguos de la Fiesta de la Escarcha y para un montón de mejoras de la calidad del juego en el cliente, así como nuevos sets Premium de Dota Plus y el parche de jugabilidad 7.35, sobre los que te contamos todos los detalles [url=https://www.dota2.com/frostivus2023]aquí[/url].",
      "En cambio, si no te portaste bien, tenemos grandes noticias para todos menos para ti, porque este año va a ser una masacre. Puede que recuerdes que, [url=https://www.dota2.com/newsentry/3692442542242977036]el pasado mes de septiembre[/url], nos pusimos serios con los bloqueos y bloqueamos de forma permanente 90 000 cuentas de [i]smurf[/i]. Desde entonces, hemos seguido apostando por vigilar el comportamiento de los jugadores con análisis tanto automáticos como manuales. En las últimas semanas, hemos llevado a cabo una ronda de bloqueos aún más agresiva, con decenas de miles de cuentas de [i]smurf[/i] bloqueadas solo en el día de hoy.",
      "Durante The International, algunos jugadores profesionales se pusieron en contacto con nosotros para hablar de sus cuentas de [i]smurf[/i]. Hemos seguido hablando con ellos y la gran mayoría está de acuerdo en que el bloqueo de las cuentas de [i]smurf[/i] de los jugadores profesionales es positivo para la comunidad de Dota: las reglas deben aplicarse a todos por igual y, a partir de ahora, así será. Y el [i]smurfing[/i] no es ni siquiera la única gamberrada a la que se dedican los jugadores. Entre otras ideas poco recomendables, hay quienes están jugando como zopencos, arruinando partidas y perdiendo puntos de comportamiento por el camino, para luego contratar a otros usuarios que les ayuden a recuperar sus puntuaciones.",
      "Hemos estado vigilando muy de cerca (sin pasarnos, claro) todos estos comportamientos y vamos a tomar las medidas necesarias. Se impondrán castigos por todo lo descrito anteriormente, incluyendo penalizaciones de puntos de comportamiento y, en los casos más graves, bloqueos de las cuentas principales. ",
      "Como ya mencionamos anteriormente, tanto el [i]smurfing[/i] como otros comportamientos negativos arruinan las partidas y, de cara al próximo año, queremos que todos disfrutéis al máximo cuando jugáis. Así que, ¡[url=https://www.dota2.com/frostivus2023]feliz actualización de la Fiesta de la Escarcha[/url] a todos!, excepto a las cuentas de [i]smurf[/i], que suponemos que no podrán disfrutar de la actualización mientras se atragantan con sus merecidos pedruscos de carbón dulce.",
      "[b]Errores corregidos:[/b]",
      "[list]",
      "[*]Se corrigió un error por el cual, si un héroe moría en la Cronoesfera y soltaba una Gema de Visión Verdadera, el tiempo de recarga de la gema se quedaba congelado.",
      "[*]Se corrigió un bloqueo poco habitual que se producía al combinar artículos.",
      "[*]Se corrigió un problema por el cual, cuando se volvía a congelar el tiempo de recarga de una habilidad que ya lo tenía congelado, el tiempo de recarga se descongelaba antes de lo previsto.",
      "[*]Se corrigió un problema por el cual los efectos intrínsecos de las habilidades no se aplicaban correctamente al comprar el Fragmento de Aghanim.",
      "[*]Se corrigió un problema por el cual, al cambiar de habilidad (o al obtener la Lente Etérea, etc.), no se actualizaba el círculo del alcance de lanzamiento si ya estaba visible.",
      "[*]Se corrigieron las partículas del Rayo del Caos de Chaos Knight, que a veces aparecían en el lugar erróneo.",
      "[*]La habilidad Quebrantaestrellas de Dawnbreaker ya no otorga inmunidad al daño puro sin el Fragmento de Aghanim.",
      "[*]Se corrigió el set Ornamentos del Magma Profundo de Earthshaker para que se muestren las partículas correctas (nuevas) en el estilo nuevo (del 10.º aniversario) y se eliminen correctamente cuando caduque.",
      "[*]Se corrigió la retícula del lanzamiento de la habilidad Emboscada de Hoodwink, que a veces resaltaba árboles que estaban fuera del área de efecto.",
      "[*]Se corrigieron algunos problemas en la animación del ¡PUÑETAZO de Morsa! de Tusk.",
      "[*]Se corrigió un fallo por el cual el Misil Mágico de Vengeful Spirit con el Fragmento de Aghanim podía rebotar a enemigos invisibles inmunes a Visión Verdadera.",
      "[*]Se corrigió un problema relacionado con las partículas de la habilidad Restauración Vudú y el arma inmortal Flor Milagrosa de Awaleb de Witch Doctor.",
      "[*]Se corrigió el espacio de objetos neutrales para que solo aparezca resaltado cuando hay por lo menos una ficha libre en la reserva, en lugar de cualquier objeto de un compañero.",
      "[*]Se corrigió un problema por el cual, al lanzar una habilidad mientras se pulsaba la tecla «Alt», se creaba también una indicación.",
      "[*]Se corrigieron los contadores del tiempo de vida de los guardianes y las unidades invocadas, que aparecían cortados en el HUD.",
      "[*]Los nombres de las teclas rápidas ya no aparecen encima de las descripciones de los talentos.",
      "[*]Las denegaciones de torres ya no aparecen como mensajes de chat en lugar de como eventos de combate.",
      "[*]Se corrigieron las pegatinas que se mostraban como disponibles en la armería cuando la cápsula correspondiente no lo estaba.",
      "[*]Se corrigieron las cápsulas de pegatinas de eventos ya concluidos para que no parezca que aún se pueden comprar.",
      "[*]Los objetos globales ya se muestran correctamente en las notificaciones de objetos recibidos.",
      "[*]Se corrigió un problema por el cual, al jugar partidas no clasificatorias y seleccionar «Mostrar todos los modos», no era posible seguir utilizando la sección en algunos casos.",
      "[*]Se corrigieron los casos en los que se mostraba el nombre del perfil de Steam de los jugadores profesionales en lugar del nombre correcto.",
      "[*]Se corrigieron los nombres largos que no cabían en las páginas del historial y de las estadísticas de batalla.",
      "[*]Se añadió otra notificación para los creadores de modos personalizados del Workshop que aún estén usando el formato obsoleto anterior a ModelDoc en sus modelos personalizados, tal como se describe en la [url=https://www.dota2.com/springcleaning]Actualización de Limpieza General de 2022[/url] y en la [url=https://www.dota2.com/newsentry/3659774959159800240]Actualización del Juicio Mortal[/url].",
      "[/list]"
    ],
    "commentcount": 0,
    "tags": [],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1702597628,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}