{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Оновлення «Мороздво 2023» вже тут!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Оновлення «Мороздво 2023» вже тут!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Наближається ще одне Мороздво, а значить Король Мороз прокинувся від сплячки в темних глибинах Кривавих морів навколо Замку Мороздва. Він послав легіони викрадених ним гобленят до іграшкових копалень за подарунками, запряг у свої кістяні сани Люмпо й Рупертуса, темнововків-близнюків із сяючими червоними очима, і, напевне, вже десь на даху вашого будинку або й усередині.",
      "Тож якщо ви в його списку слухняних, готуйтеся прикрашати свої морозні хати новими й старими мороздвяними принадами, безліччю покращень клієнта, новими преміальними наборами Dota Plus та ігроладним оновленням 7.35. Про все це ви можете докладно прочитати [url=https://www.dota2.com/frostivus2023]ось тут[/url].",
      "З іншого боку, якщо ви в списку неслухняних, то маємо гарні новини не для вас і погані новини для вас, адже цей рік буде дуже кровопролитним. Можливо, ви пригадуєте, що у [url=https://www.dota2.com/newsentry/3692442542242977036]вересні[/url] ми дістали блокувальний молот і назавжди заблокували 90 000 смурф-акаунтів. Відтоді ми продовжували стежити за поведінкою гравців як вручну, так і за допомогою автоматичного аналізу. Упродовж кількох минулих тижнів ми здійснили ще агресивнішу хвилю блокувань, включно з блокуванням багатьох десятків тисяч смурф-акаунтів лише сьогодні.",
      "На The International деякі професійні гравці обговорювали з нами свої смурф-акаунти. Ці обговорення продовжилися і професіонали погодилися, що блокування смурфів професійних гравців покращить спільноту Dota. Правила повинні стосуватися всіх, тож надалі так і буде. Використання смурфів — це не єдина погана річ серед гравців. Серед іншого деякі порушники грають як нікчеми, руйнують ігри іншим і через це втрачають оцінку поведінки. А потім наймають інших людей, щоби ті підняли їм оцінку назад.",
      "Незалежно від того [i]як саме[/i] ви завинили, ми стежили за вами (не турбуйтеся, не тоді, коли ви спали) й тепер суворо займемося цим. Усі згадані вище порушення будуть каратися, включно зі штрафами оцінки поведінки, а в особливо серйозних випадках — блокуванням основних акаунтів. ",
      "Як ми вже казали, смурфи та інші види негативної поведінки роблять матчі гіршими, а ми хочемо, щоби ваші матчі в новому році були якнайкращими. Тож бажаємо всім [url=https://www.dota2.com/frostivus2023]щасливого мороздвяного оновлення![/url] За винятком смурф-акаунтів, які не зможуть ним насолодитися, бо гризуть свої чесно заслужені десерти зі смаком вугілля.",
      "[b]Скриня з мороздвяними скарбами 2023:[/b]",
      "[list]",
      "[*]Кожна скриня містить один із 30 предметів, розподілених між 4 ступенями, або ж космічно рідкісного кур’єра Малюка Рошана.",
      "[*]Предмети одного ступеня мають однакову рідкісність.  Ви не отримаєте дублікатів предметів одного ступеня, доки не отримаєте кожен предмет один раз.",
      "[*]П’ять предметів одного ступеня можна обміняти на випадковий предмет вищого ступеня.",
      "[*]Космічно рідкісний предмет міститься в одній зі 100 000 скринь.  Інші скрині містять предмет з одного з 4 ступенів.  Предмет кожного ступеня, починаючи з першого, має 10% шансу покращитися до вищого ступеня.",
      "[*]Коли ви відкриваєте скриню або обмінюєте предмет, то маєте шанс (1 із 300) отримати додатковий чудний предмет — або копію предмета, або, якщо це набір, то один із предметів цього набору.  У кожного чудного предмета є випадковий особливий ефект.  Існує три варіанти ефектів, але їхня рідкісність однакова.",
      "[/list]",
      "[b]Виправлення помилок:[/b]",
      "[list]",
      "[*]Виправлено помилку, через яку завмирала зарядка Самоцвіту істинного зору (Gem of True Sight), якщо той випадав із героя, вбитого у Хроносфері (Chronosphere).",
      "[*]Виправлено рідкісний збій через поєднання предметів.",
      "[*]Виправлено помилку, через яку повторне завмирання зарядки здібності, яка вже мала завмерлу зарядку, призводило до передчасного завершення завмирання.",
      "[*]Виправлено помилку, через яку вбудовані ефекти здібностей не застосовувалися після придбання Уламка Аґаніма.",
      "[*]Виправлено помилку, через яку перемикання здібностей або отримання Ефірних лінз (Aether Lens) тощо не оновлювало коло дальності чаклування, якщо воно вже показувалося.",
      "[*]Виправлено помилку, через яку ефекти часток Удару хаосу (Chaos Bolt) Лицаря Хаосу іноді показувалися в не тому місці.",
      "[*]Виправлено помилку, через яку Зорелам (Starbreaker) Світанкової давав імунітет до абсолютної шкоди без Уламка Аґаніма.",
      "[*]Виправлено помилку, через яку в наборі «Bindings of Deep Magma» для Землетруса не показувалися правильні нові частки для ювілейного стилю й неправильно вилучалися частки, термін дії яких сплив.",
      "[*]Виправлено помилку, через яку вказівник здібності Лісова засідка (Bushwhack) у Каптурниці іноді виділяв дерева за межами дії ефекту.",
      "[*]Виправлено деякі помилки анімації здібності Під дихало! (Walrus PUNCH!) Бивня.",
      "[*]Виправлено помилку, через яку Магічний снаряд (Magic Missile) Мстивої Душі з Уламком Аґаніма міг відскочити до невидимих ворогів з імунітетом до істинного зору.",
      "[*]Виправлено помилку з ефектами часток Вуду-відновлення (Voodoo Restoration) у нетлінній зброї «Awaleb's Trundleweed».",
      "[*]Тепер ланка нейтрального предмета виділяється, тільки якщо в сховку є хоча б один невикористаний жетон, а не будь-який предмет будь-якого союзника.",
      "[*]Виправлено помилку, через яку застосування здібності із затисненою клавішею Alt також надсилало сигнал.",
      "[*]Виправлено помилку, через яку таймери вардів та прикликаних істот обрізувалися в інтерфейсі.",
      "[*]Виправлено помилку, через яку назви гарячих клавіш іноді перекривали описи талантів.",
      "[*]Тепер добивання союзної вежі показується як ігрова подія, а не як повідомлення в чаті.",
      "[*]Виправлено помилку, через яку деякі наліпки в зброярні показувалися як доступні, хоча капсула з ними була вже недоступна.",
      "[*]Виправлено помилку, через яку капсули з наліпками завершених подій показувалися як доступні для придбання.",
      "[*]Виправлено помилку, через яку в спливних повідомленнях неправильно показувалися глобальні предмети.",
      "[*]Виправлено помилку, через яку натискання на кнопку «Показати всі режими» в розділі пошуку нерейтингових ігор робило цей розділ непридатним до використання.",
      "[*]Виправлено помилку, через яку іноді замість псевдоніма професійного гравця показувався його псевдонім у Steam.",
      "[*]Виправлено помилку, через яку занадто довгі імена виходили за межі інтерфейсу на сторінках історії та бойової статистики.",
      "[*]Додано сповіщення для авторів нестандарних ігор майстерні, які ще не перейшли із застарілого формату на новий ModelDoc, про що писалося в оновленні [url=https://www.dota2.com/springcleaning]«Весняне прибирання Dota 2022»[/url] та оновленні [url=https://www.dota2.com/newsentry/3659774959159800240]«Смертельна відплата»[/url].",
      "[/list]"
    ],
    "commentcount": 879,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 12621,
    "votedowncount": 1894,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1708470491,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12621,
  "votes_down": 1894,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}