{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "The Frostivus 2023 Update is Here!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198000613142",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1702598202
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "The Frostivus 2023 Update is Here!",
    "posttime": 1702597627,
    "updatetime": 1703279372,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Another Frostivus is upon us, and that means King Kringle has awakened from his hibernation under the wine-dark Blood Seas surrounding Frostivus Castle; sent his legions of abducted goblin-child toy miners to dig in his toy mines; hooked up his twin glowing red-eyed direwolves Lumpo and Rupertus to his bone sleigh; and is likely either on top of your house or inside of it right now.",
      "So if you’re on his Nice List, prepare to have your frosty halls decked with new and returning Frostivus cosmetics, a ton of quality-of-life client features, new Dota Plus premium sets, and gameplay patch 7.35, all of which you can read all about [url=https://www.dota2.com/frostivus2023]right here[/url].",
      "On the other hand, if you’re on the Naughty List, we’ve got great news for everybody else and bad news for you, because this year is gonna be a bloodbath. You might remember [url=https://www.dota2.com/newsentry/3692442542242977036]back in September[/url], we got out the ban hammer and permanently banned 90,000 smurf accounts. Since then, we've continued to invest in player behavior monitoring, on both the manual and automatic analysis fronts. Over the last few weeks, we've engaged in an even more aggressive ban wave, including many tens of thousands of smurf account bans today alone.",
      "At The International, some pro players reached out to us to talk about their smurf accounts. Those conversations have continued, and there’s broad agreement amongst pros that banning pro smurf accounts is a win for Dota as a community: The rules should apply to everybody, and from now on they will. And smurfing isn’t even the only naughty thing players are getting up to. Amongst other questionable choices, some bad actors are playing like jerks, ruining games and losing behavior score because of it, then hiring behavior score farmers to drive it back up.",
      "Regardless of [i]how[/i] you’ve been naughty, we've been watching you (not while you're sleeping, calm down) and we’re cracking down on all of it. Punishments will be handed out for all of the above, including behavior score penalties — and in serious cases, main account bannings. ",
      "As we’ve said before, smurfing (and other negative behavior) makes matches worse, and we want to make sure your matches are as good as possible as we head into the new year. So we’d like to wish everyone a [url=https://www.dota2.com/frostivus2023]Happy Frostivus Update![/url] Except smurf accounts, who we assume will not enjoy the update as they choke on their richly-deserved coal-flavored just desserts.",
      "[b]Frostivus 2023 Treasure Chest:[/b]",
      "[list]",
      "[*]Each chest contains one of 30 items split across 4 Tiers, or a Cosmically Rare Baby Roshan courier.",
      "[*]Items of the same Tier have equal rarity.  You will not receive duplicate items from each Tier until you have received each item once.",
      "[*]Five items from the same Tier can be traded up for a random item from the next Tier.",
      "[*]The Cosmically Rare item is contained in 1 out of 100000 chests.  Other chests contain an item from one of the 4 Tiers.  Starting with Tier 1, each item has a 10% chance to upgrade to the next Tier.",
      "[*]When opening a chest or trading up for an item, there is a 1 out of 300 chance to receive an additional Unusual item -- either a copy of the item, or if it is a set, one of the items in that set.  Each Unusual item has a random special effect.  The three effects have equal rarity.",
      "[/list]",
      "[b]Bug Fixes:[/b]",
      "[list]",
      "[*]Fixed an issue where if a hero killed in Chronosphere dropped Gem of True Sight, the Gem's cooldown would remain frozen",
      "[*]Fixed a rare crash with item combines",
      "[*]Fixed an issue where if an ability with a frozen cooldown had its cooldown frozen again, it would unfreeze too early",
      "[*]Fixed an issue where abilities with intrinsic buffs could fail to have them applied when purchasing Aghanim's Shard",
      "[*]Fixed an issue where switching abilities (or gaining Aether Lens etc.) wouldn't update the cast range circle if it was already being displayed",
      "[*]Fixed Chaos Knight's Chaos Bolt particles sometimes losing their location",
      "[*]Fixed Dawnbreaker's Starbreaker providing pure damage immunity without Aghanim's Shard",
      "[*]Fixed Earthshaker's Bindings of Deep Magma set to show the correct (new) particles for the new (10th Anniversary) style and to properly delete particles on expiration",
      "[*]Fixed Hoodwink's Bushwhack cast reticule sometimes highlighting trees outside the area of effect",
      "[*]Fixed some animation issues with Tusk's Walrus PUNCH!",
      "[*]Fixed a bug where Vengeful Spirit's Magic Missile with Aghanim's Shard could bounce to  invisible enemies immune to True Sight",
      "[*]Fixed an issue with the Voodoo Restoration particles on Witch Doctor's Awaleb's Trundleweed Immortal weapon",
      "[*]Fixed highlighting on the Neutral Item Slot to only highlight when there is at least one free token in the stash, rather than any item from any teammate",
      "[*]Fixed an issue where casting an ability with Alt held down would also ping",
      "[*]Fixed lifetime timers for wards and summoned units being clipped in the HUD",
      "[*]Fixed talent descriptions sometimes being blocked by hotkey names",
      "[*]Fixed Tower denies appearing as chat messages rather than as combat events",
      "[*]Fixed stickers showing as available in Armory even though the capsule containing the stickers might not be available",
      "[*]Fixed showing sticker capsules from ended events as purchasable",
      "[*]Fixed Item Received popup not showing global items properly",
      "[*]Fixed an issue with Play Unranked where ticking Show All Modes could make the section unusable",
      "[*]Fixed sometimes showing pro players' Steam persona names instead of the correct names",
      "[*]Fixed long names overflowing in History and Battle Stats pages",
      "[*]Added an additional notification for Workshop custom game authors that have not yet updated their custom models away from the deprecated pre-ModelDoc format, as described in the [url=https://www.dota2.com/springcleaning]2022 Spring Cleaning update[/url] and the [url=https://www.dota2.com/newsentry/3659774959159800240]Dead Reckoning Update[/url]",
      "[/list]"
    ],
    "commentcount": 799,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "mod_require_rereview"
    ],
    "language": 0,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 6747,
    "votedowncount": 1172,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1703279373,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703015468,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 6746,
  "votes_down": 1172,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}