{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "Frostivus 2023-uppdateringen är här!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Frostivus 2023-uppdateringen är här!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Det är dags för Frostivus igen, vilket innebär att julsnubben vaknat upp från sin dvala under det mörkröda Blodhavet som omringar Frostivusslottet. Han har skickat ut sina kidnappade små nissar till att gräva i leksaksgruvorna och kopplat sina rödögda jättevargar Lumpo och Rupertus till bensläden. Antagligen befinner de sig just nu på ditt tak eller i ditt hus.",
      "Om du varit snäll i år kan du förbereda dig på att få pynta till det med nya och återvändande kosmetiska föremål för Frostivus, massor av kvalitetsförbättringar för klienten, nya premiumset för Dota Plus samt speluppdateringen 7.35. Du kan läsa om allt detta [url=https://www.dota2.com/frostivus2023]här[/url].",
      "Om du å andra sidan har varit stygg har vi toppennyheter till alla andra och sämre nyheter till dig – räkna med ett blodbad i år. Du kanske minns att [url=https://www.dota2.com/newsentry/3692442542242977036]vi i september[/url] tog fram avstängningshammaren och stängde av 90 000 smurfkonton permanent. Sedan dess har vi fortsatt att satsa på övervakning av spelaruppförande, både vad gäller manuell och automatisk analys. Under de senaste veckorna har vi engagerat oss i en ännu mer aggressiv avstängningsvåg, inklusive många tiotusentals avstängningar av smurfkonton bara idag.",
      "Under The International kontaktade några proffsspelare oss för att prata om sina smurfkonton. Dessa samtal har fortsatt, och det finns bred enighet bland proffsen om att det är en vinst för Dota som gemenskap att förbjuda proffssmurfkonton: Reglerna bör gälla för alla, och från och med nu kommer de att göra det. Smurfing är inte det enda stygga folk håller på med. Bland andra tvivelaktiga aktiviteter finns de som uppför sig illa när de spelar och förstör matcher och därmed förlorar uppförandepoäng, för att sedan anlita folk till att få upp poängen igen.",
      "Oavsett [i]hur[/i] du har varit stygg har vi hållit koll på dig (inte medan du sover, ta det lugnt) och vi slår ner på allt. Påföljder ges för alla ovanstående beteenden, inklusive uppförandepoängavdrag – och i allvarliga fall avstängningar av huvudkonton. ",
      "Som vi har sagt tidigare, smurfing (och annat negativt beteende) gör matcherna sämre, och vi vill se till att dina matcher är så bra som möjligt när vi går in i det nya året. Så vi vill önska er alla en [url=https://www.dota2.com/frostivus2023]Glad Frostivus-uppdatering![/url] Förutom smurfkonton, som vi antar inte kommer att njuta av uppdateringen när de kvävs av de kolstycken de gjort sig förtjänta av.",
      "[b]Frostivus 2023 – skattkista:[/b]",
      "[list]",
      "[*]Varje kista innehåller ett av 30 föremål uppdelade på fyra nivåer, eller en kosmiskt sällsynt Baby Roshan-kurir.",
      "[*]Föremål på samma nivå är lika sällsynta.  Du kommer inte att få dubbletter av föremål från varje nivå förrän du har mottagit varje föremål en gång.",
      "[*]Fem föremål från samma nivå kan bytas mot ett slumpmässigt föremål från nästa nivå.",
      "[*]Det kosmiskt sällsynta föremålet finns i 1 av 100 000 kistor.  Andra kistor innehåller ett föremål från en av de fyra nivåerna.  Från och med nivå 1 har varje föremål 10 % chans att uppgradera till nästa nivå.",
      "[*]När du öppnar en kista eller byter mot ett föremål, finns det en chans på 1 av 300 att få ytterligare ett sällsynt föremål -- antingen en kopia av föremålet, eller om det är ett set, ett av föremålen i det setet.  Varje sällsynt föremål har slumpmässiga specialeffekter.  De tre effekterna är lika sällsynta.",
      "[/list]",
      "[b]Buggfixar:[/b]",
      "[list]",
      "[*]Åtgärdade ett problem som gjorde att om en hjälte som dödades i Chronosphere släppte Gem of True Sight, så frös juvelens cooldown fast.",
      "[*]Åtgärdade en sällsynt krasch vid föremålskombinationer.",
      "[*]Åtgärdade ett problem som gjorde att om en förmåga med en fastfrusen cooldown fick sin cooldown fryst igen, så frigjordes den för tidigt.",
      "[*]Åtgärdade ett problem där förmågor med inbyggda buffar inte kunde appliceras vid köp av Aghanim's Shard.",
      "[*]Åtgärdade ett problem där byte av förmågor (eller anskaffning av Aether Lens osv.) inte uppdaterade räckvidden om den redan visades.",
      "[*]Åtgärdade att partiklarna från Chaos Knights Chaos Bolt ibland hamnade fel.",
      "[*]Åtgärdade att Dawnbreakers Starbreaker gav immunitet mot ren skada utan Aghanim's Shard.",
      "[*]Åtgärdade så att Earthshakers Bindings of Deep Magma visar rätt (nya) partiklar för den nya (jubileums-)stilen och så att partiklarna raderas som de ska vid upphörande.",
      "[*]Åtgärdade att indikatorn för Hoodwinks Bushwhack ibland markerade träd utanför effektområdet.",
      "[*]Åtgärdade några animationsproblem med Tusks Walrus PUNCH!.",
      "[*]Åtgärdade en bugg där Vengeful Spirits Magic Missile med Aghanim's Shard kunde studsa till osynliga fiender immuna mot True Sight.",
      "[*]Åtgärdade ett problem med Voodoo Restoration-partiklarna på Witch Doctors odödliga vapen Awaleb's Trundleweed.",
      "[*]Åtgärdade så att markeringen av platsen för neutrala föremål bara markerades när det finns minst en ledig pollett i förrådet, istället för vilket föremål som helst från vilken lagkamrat som helst.",
      "[*]Åtgärdade ett problem där användning av en förmåga med Alt nedtryckt också pingade.",
      "[*]Åtgärdade att livstidstimers för wards och framkallade enheter överlappade med gränssnittet.",
      "[*]Åtgärdade att talangbeskrivningar ibland blockerades av snabbtangentsnamn.",
      "[*]Åtgärdade att tornnekanden visades som chattmeddelanden istället för stridshändelser.",
      "[*]Åtgärdade klistermärken som visades som tillgängliga i vapenförrådet även om kapseln som innehåller klistermärkena kanske inte var tillgänglig.",
      "[*]Åtgärdade att klistermärkeskapslar från avslutade event visades som köpbara.",
      "[*]Åtgärdade att popup-fönstret för mottaget föremål inte visade globala föremål korrekt.",
      "[*]Åtgärdade ett problem med Spela orankad där markering av Visa alla lägen kunde göra sektionen oanvändbar.",
      "[*]Åtgärdade att proffsspelarnas Steam-namn ibland visades istället för korrekt namn.",
      "[*]Åtgärdade att långa namn inte fick plats på historik- och stridsstatistiksidorna.",
      "[*]Lade till ytterligare en avisering för skapare av anpassade spel i workshoppen som ännu inte har uppdaterat sina anpassade modeller bort från det föråldrade formatet som gällde innan ModelDoc, vilket beskrivs i [url=https://www.dota2.com/springcleaning]Vårstädningsuppdateringen 2022[/url] och [url=https://www.dota2.com/newsentry/3659774959159800240]Dead Reckoning-uppdateringen[/url].",
      "[/list]"
    ],
    "commentcount": 879,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 12621,
    "votedowncount": 1894,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1708470491,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 12621,
  "votes_down": 1894,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}