{
  "gid": "3884981125532748791",
  "clan_steamid": "103582791433224455",
  "event_name": "2023 Frostivus Güncellemesi Çıktı!",
  "event_type": 14,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1702598160,
  "rtime32_end_time": 1702602001,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198166130601",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "22be4ece0013e6a79ccc4e4203a2f5f643378010.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1702426305
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1702588704
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1703802309
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1702588464
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1703015246
      },
      {
        "strSteamID": "76561198000613142",
        "rtUpdated": 1703279372
      }
    ]
  },
  "announcement_body": {
    "gid": "3884981125532748792",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "2023 Frostivus Güncellemesi Çıktı!",
    "posttime": 1702597627,
    "updatetime": 1703802309,
    "body": [
      "[url=https://www.dota2.com/frostivus2023][img]{STEAM_CLAN_IMAGE}/3703047/22be4ece0013e6a79ccc4e4203a2f5f643378010.png[/img][/url]",
      "Başka bir Frostivus daha bizlerle. Bu, Kral Kringle'ın Frostivus Kalesi'nin etrafındaki şarap gibi koyu Kanlı Deniz'in altındaki uykusundan uyandığı, küçük goblin madencilerinden oluşan lejyonlarını oyuncak madenlerine gönderdiği, iki korkunç kurt Lump ve Rupert'ı kemik kızağına bağladığı ve büyük olasılıkla çoktan evinizin çatısında olduğu veya içeriye girdiği anlamına geliyor.",
      "Eğer uslular listesindeyseniz yeni ve önceki dönemden Frostivus kozmetiklerine, birçok kullanım kolaylığı özelliğine, yeni Dota Plus premium setlerine ve tamamını [url=https://www.dota2.com/frostivus2023]buradan[/url] okuyabileceğiniz 7.35 oynanış yamasına kendinizi hazırlayın.",
      "Öte yandan yaramazlar listesindeyseniz, herkes için iyi sizin için kötü bir haberimiz var: Bu yıl ortalık kan gölüne dönecek. [url=https://www.dota2.com/newsentry/3692442542242977036]Geçtiğimiz Eylül ayında[/url], adaletin tokmağını vurduk ve kalıcı olarak 90.000 smurf hesabı banladık. O zamandan beri oyuncu davranışlarını hem manuel hem de otomatik analiz kaynaklarıyla incelemeye devam ettik. Geçtiğimiz birkaç hafta içinde daha agresif yasak dalgaları uyguladık ve bugün bile on binlerce smurf hesabı yasakladık.",
      "The International'da bazı profesyonel oyuncular kendi smurf hesapları hakkında konuşmak için bize ulaştı. Bu görüşmeler devam etti ve profesyonel oyuncuların da smurf hesaplarının yasaklanmasının Dota topluluğu için bir kazanç olduğu konusunda fikir birliği oluştu. Kurallar herkes için geçerli olmalıdır ve artık öyle olacak. Ve Smurf'lük oyuncuların yaptığı tek yaramazlık değildi. Diğer şüpheli faaliyetlerin yanı sıra, bazı kötü oyuncuların bilerek kötü oynayarak oyunları berbat ettiği ve bunun sonucunda davranış puanı kaybettiği, daha sonra da davranış puanını yükseltmek için bu işi meslek hâline getirenlerle anlaşarak puanlarını yükselttiği tespit edildi.",
      "[i]Ne kadar[/i] yaramazlık yapmış olursanız olun, gözümüz üzerinizde (uyurken değil, endişelenmeyin) ve bunların üstüne gitmeye devam edeceğiz. Yukarıda belirtilenlerin tümü, davranış puanlarının azaltılması ve ciddi durumlarda hesap yasaklanması da dâhil olmak üzere cezalandırılacaktır. ",
      "Daha önce de belirttiğimiz gibi, smurf'lük (ve diğer olumsuz davranışlar) maç deneyimini kötü etkiliyor ve yeni yıla girerken maçlarınızın mümkün olduğunca iyi olduğundan emin olmak istiyoruz. Artık [url=https://www.dota2.com/frostivus2023]Frostivus güncellemesinin[/url] tadını çıkarabilirsiniz! Smurf hesapları hariç tabii. Bu hesapların hak ettikleri ve adalet tadı veren tatlılarla boğulurken, güncellemenin tadını çıkaramayacağını düşünüyoruz.",
      "[b]Frostivus 2023 Hazine Sandığı:[/b]",
      "[list]",
      "[*]Her sandık, 4 seviyeye bölünmüş 30 eşyadan birini veya kozmik derecede nadir bir Bebek Roshan kuryesini içerir.",
      "[*]Aynı seviyedeki eşyalar eşit nadirliğe sahiptir.  Her seviyedeki bütün eşyaları bir kez alana kadar aynı seviyeden aynı eşyayı almayacaksınız.",
      "[*]Aynı seviyedeki beş eşya, bir üst seviyedeki rastgele bir eşyayla takas edilebilir.",
      "[*]Her 100 bin sandıktan 1 tanesi kozmik derecede nadir eşya içerir.  Diğer sandıklar 4 seviyeden birinden bir eşya içerir.  1. seviyeden başlayarak, her eşyanın bir sonraki seviyeye yükselme şansı %10'dur.",
      "[*]Bir sandık açarken veya bir eşyayı takas ederken, ek bir olağan dışı eşya alma şansı 300'de 1'dir (eşyanın kopyası veya set ise o setteki eşyalardan biri).  Her olağan dışı eşyanın rastgele bir özel efekti vardır.  Üç efekt de eşit nadirliğe sahiptir.",
      "[/list]",
      "[b]Hata Düzeltmeleri:[/b]",
      "[list]",
      "[*]Chronosphere'de öldürülen bir kahraman Gem of True Sight'ı düşürdüğünde Gem'in dolum süresinin takılı kalması düzeltildi.",
      "[*]Eşyaları birleştirirken nadir görülen bir çökme düzeltildi.",
      "[*]Dondurulmuş dolum süresine sahip bir yeteneğin yeniden dondurulması durumunda, dolum süresinin zamanından önce başlamasına neden olan bir hata düzeltildi.",
      "[*]Aghanim's Shard'ı satın aldıktan sonra mevcut güçlendirmelere sahip yeteneklere uygulanmamasına neden olan sorun düzeltildi.",
      "[*]Bir yeteneği değiştirmenin (veya bir Aether Lens vb. edinmenin) hâlihazırda görüntülenen menzil göstergesini güncellememesi düzeltildi.",
      "[*]Chaos Knight'ın Chaos Bolt parçacıklarının bazen farklı konumlarda belirmesi düzeltildi.",
      "[*]Dawnbreaker'ın Starbreaker yeteneğinin Aghanim's Shard olmadan saf hasar bağışıklığı vermesi düzeltildi.",
      "[*]Earthshaker'ın Derin Magmanın Parçaları setinin, yeni (10. Yıl Dönümü) tarzı için doğru (yeni) parçacıkları göstermemesi ve süreleri dolduğunda parçacıkların düzgün şekilde kaybolmaması düzeltildi.",
      "[*]Hoodwink'in Bushwhack kullanım göstergesinin bazen etki alanı dışındaki ağaçları vurgulaması düzeltildi.",
      "[*]Tusk'ın Walrus PUNCH'ı ile ilgili bazı animasyon sorunları düzeltildi.",
      "[*]Vengeful Spirit'in Magic Missile yeteneğinin Aghanim's Shard'la birlikte Gerçek Görüş'ten etkilenmeyen görünmez düşmanlara sıçrayabilmesine neden olan bir hata düzeltildi.",
      "[*]Witch Doctor'un Awaleb'in Maskesi ölümsüz silahındaki Voodoo Restoration parçacıklarıyla ilgili bir sorun düzeltildi.",
      "[*]Tarafsız eşya yuvasının takım arkadaşından gelen herhangi bir eşya yerine yalnızca zulada en az bir kullanılmayan jeton varsa vurgulanması düzeltildi.",
      "[*]Alt tuşu basılıyken bir yetenek kullanıldığında ping de gönderilmesi düzeltildi.",
      "[*]Gözlerin ve çağrılan birimlerin kalan sürelerinin arayüzle çakışması düzeltildi.",
      "[*]Klavye kısayollarının bazen hüner açıklamalarının üzerinde görünmesi düzeltildi.",
      "[*]Kule reddetmesinin bir savaş etkinliği yerine sohbet mesajı olarak görünmesi düzeltildi.",
      "[*]Çıkartmaları içeren kapsül mevcut olmasa bile çıkartmaların Cephanelik'te mevcut olarak gösterilmesi düzeltildi.",
      "[*]Sona eren etkinliklerdeki çıkartma kapsüllerinin satın alınabilir olarak gösterilmesi düzeltildi.",
      "[*]Eşya Alındı penceresinin genel eşyalar için düzgün bir şekilde gösterilmemesi düzeltildi.",
      "[*]Derecesiz Oyna sekmesinde Tüm Modları Göster butonuna tıklandığında tüm bölümün kullanılmaz hâle gelmesine neden olan bir hata düzeltildi.",
      "[*]Profesyonel oyuncuların Steam profili adlarının bazen doğru adları yerine görünmesi düzeltildi.",
      "[*]Uzun isimlerin Geçmiş ve Savaş İstatistikleri sayfalarında taşması düzeltildi.",
      "[*]Özel modellerini henüz [url=https://www.dota2.com/springcleaning]2022 Bahar Temizliği güncellemesinde[/url] ve [url=https://www.dota2.com/newsentry/3659774959159800240]Ölülerin İntikamı güncellemesinde[/url] açıklanan kullanımdan kaldırılmış ModelDoc öncesi formattan çıkarmamış olan atölye özel oyun yapımcıları için ek bir bildirim eklendi.",
      "[/list]"
    ],
    "commentcount": 871,
    "tags": [
      "ModAct_1415588329_1702598101_0",
      "mod_reviewed",
      "ModAct_1415588329_1702599830_0",
      "ModAct_1434573178_1702610295_4",
      "ModAct_1400956464_1703015467_4",
      "ModAct_873083815_1703279956_4",
      "ModAct_1415588329_1703803388_4"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "4038104133462947300",
    "event_gid": "3884981125532748791",
    "voteupcount": 11178,
    "votedowncount": 1767,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4038104133462947300",
  "rtime32_last_modified": 1705340693,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1703803389,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 11178,
  "votes_down": 1767,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4038104133462947300",
  "clan_steamid_original": "103582791433224455"
}