{
  "gid": "536597286667419796",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025 — Takvim ve Format",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743540840,
  "rtime32_end_time": 1743544440,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1743456596
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1743540888
      }
    ]
  },
  "announcement_body": {
    "gid": "536597286667419797",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025 — Takvim ve Format",
    "posttime": 1743540889,
    "updatetime": 1743540889,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png[/img]",
      "Arenalar farklı olabilir, yıldız oyuncular değişebilir, her yıl yeni takımlar yükselirken bazıları aynı performansı gösteremeyebilir. Ancak tüm bu değişikliklere rağmen bir şey aynıdır: The International, dünyanın en iyi Dota takımının bütün engelleri aşarak ve tüm zorlukların üstesinden gelerek ismini Şampiyonların Kalkanı'na kazıma mücadelesini sergileyen bir etkinlik olmaya devam ediyor.",
      "İlk TI, Almanya'nın Köln şehrindeki GamesCom fuarında düzenlenen beş günlük bir etkinlikti. O zamandan bu yana Valve, on yılı aşkın süredir The International'ı düzenliyor. Bu sürede [url=https://www.dota2.com/newsentry/3675555405719286536]kabin tasarımı[/url] ve [url=https://www.dota2.com/newsentry/4247544173402144047]sponsorluklardan[/url] turnuva tasarımına ait detaylara kadar her yıl yeni şeyler öğrendik. Her yıl geçmiş deneyimlerimizden en iyi şekilde yararlanarak etkinliğimizi daha da iyi hâle getirecek yeni fikirleri keşfetmeye çalışıyoruz.",
      "Biletler yakında satışa sunulacağı için (detaylar aşağıda), bu yılki turnuvanın formatını açıklamak istiyoruz.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/7e72a4e737be03f6468f1d7b41eee975a435ee5c.png[/img]",
      "[h2]The International'a Doğru[/h2]",
      "Bu yıl, [i]her bir maçın[/i] önem taşıdığı ve takımların ve seyircilerin bunu açıkça görebildiği bir sistem oluşturmaya karar verdik. Bunu, turnuvanın stratejisini şekillendiren ve dünya çapındaki taraftarların her yıl keyif aldığı grup aşaması maçlarından ödün vermeden yapmak istedik. Bu yeni format aynı zamanda, önceki yıllarda görülen sıralı mücadele usulü sistemde bireysel maçların pek bir öneminin olmaması veya sadece başka takımlar için önemli olması sorunun da önüne geçmek için tasarlandı.",
      "Bu yıl, The International'a Doğru beş rauntluk bir İsviçre sistemi eşleştirmeyle başlıyor: İlk üç gün boyunca on altı takım aynı seri sonuçlarına sahip diğer takımlara karşı üç raunt hâlinde gerçekleşen maçlarda oynayacak (2 galibiyeti ve 0 mağlubiyeti olan bir takıma karşı 2 galibiyeti ve 0 mağlubiyeti olan bir takım, 1 galibiyeti ve 3 mağlubiyeti olan bir takıma karşı 1 galibiyeti ve 3 mağlubiyeti olan bir takım vb.). Dördüncü seriyi kazanan takım otomatik olarak The International'a yükselecek; dördüncü mağlubiyet ise elenme ile sonuçlanacak.",
      "İsviçre sistemi üzerinden oynanan beş raunt sonunda, dört galibiyeti olan üç takım The International'daki yerini garanti altına alacak, dört mağlubiyeti olan üç takım ise elenecek. Geriye kalan on takım, en güçlülerin en zayıflarla karşılaştığı özel bir eleme turunda mücadele edecek ve kazanan beş takım The International'a yükselirken kaybeden beş takım elenecek.",
      "İsviçre sisteminin kendine özgü zorlukları olduğu için taraftarların favori takımlarının ne zaman oynayacağını önceden bilmelerini ve galibiyet sayısı mağlubiyet sayısından fazla olan hiçbir takımın üst üste iki seri oynamak zorunda kalmamasını sağlamaya özen gösterdik (Gecenin son maçını oynayan takımın sabahın ilk maçını oynamaması dâhil).",
      "The International'a Doğru, İsviçre sistemi rauntlarla eleme turu dâhil olmak üzere 4 Eylül Perşembe gününden 7 Eylül Pazar gününe kadar sürecek. The International'a Doğru, davet edilen on altı takımdan sekizini eleyecek, kalan sekiz takım ise The International arenasına yükselecek.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/de252c0a7a04c4d3828c5205541b1f843e0b2117.png[/img]",
      "[h2]The International[/h2]",
      "The International 11 Eylül Perşembe günü başlayacak ve dört günün ardından, 14 Eylül Pazar günü Büyük Final ile sona erecek. The International'a Doğru turnuvasından yükselen sekiz takım, Barclays Arena'da binlerce taraftarın önünde Şampiyonların Kalkanı için mücadele edecek.",
      "Bu sekiz takım The International'a Doğru turnuvasındaki performanslarına göre sıralanarak (en iyiler ve en kötüler) standart, çift elemeli bir formatta üst grupta başlayacak. Tüm karşılaşmalar üç maç üzerinden oynanırken Büyük Final beş maç üzerinden oynanacak.",
      "[h2]Biletler[/h2]",
      "The International tek günlük biletleri ve çok günlük bilet paketleri 15 Nisan Salı günü TSİ 11.00'de [url=https://www.axs.com/]AXS üzerinden[/url] satışa sunulacak. Orada görüşmek için sabırsızlanıyoruz."
    ],
    "commentcount": 0,
    "tags": [],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "598522845445771232",
    "event_gid": "536597286667419796",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522845445771232",
  "rtime32_last_modified": 1743540889,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522845445771232",
  "clan_steamid_original": "103582791433224455"
}