{
  "gid": "536597286667419796",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025 — Turnierplan und Format",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743540840,
  "rtime32_end_time": 1743544440,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1743456596
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1743540888
      }
    ]
  },
  "announcement_body": {
    "gid": "536597286667419797",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025 — Turnierplan und Format",
    "posttime": 1743540889,
    "updatetime": 1743540889,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png[/img]",
      "Die Arenen wechseln, neue Starspieler treten ins Rampenlicht und aufstrebende Teams verdrängen bekannte Namen aus dem Kreis der Favoriten. Doch während sich vieles ändert, bleibt eines konstant: The International bleibt eine Reisechronik des besten Dota-Teams der Welt, das jedes Hindernis überwindet, jede Herausforderung meistert und am Ende siegreich seinen Namen in die Ägäis eingraviert.",
      "The International fand zum ersten Mal 2011 über fünf Tage während der gamescom in Köln statt. Das ist über ein Jahrzehnt her und Valve hat seitdem viel als Veranstalter gelernt: [url=https://www.dota2.com/newsentry/3675555405719286536]Wie man die perfekte schalldichte Kabine baut[/url], [url=https://www.dota2.com/newsentry/4247544173402144047]Werbung und Sponsoren organisiert[/url] oder das Turnier selbst ausrichtet. Jedes Jahr berücksichtigen wir die Fehler und Erfolge der Vergangenheit und probieren gleichzeitig neue Variationen aus, die möglicherweise noch besser funktionieren.",
      "Da der Ticketverkauf für The International 2025 in der Barclays Arena in Hamburg bald beginnt (Details siehe unten), möchten wir vor diesem Hintergrund das diesjährige Turnierformat vorstellen.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/7e72a4e737be03f6468f1d7b41eee975a435ee5c.png[/img]",
      "[h2]Der Weg zu The International[/h2]",
      "Wir hatten uns für dieses Jahr vorgenommen, eine Struktur zu schaffen, durch die bei [i]jeder einzelnen Partie[/i] etwas auf dem Spiel steht – und dass dies sowohl den Teams als auch den Zuschauern sofort klar wird. Dabei wollten wir jedoch nicht auf die vielen spannenden Partien verzichten, die das Turnier bereits in der Gruppenphase prägen. Gleichzeitig sollte das neue Format Probleme vermeiden, die wir in den vergangenen Jahren beobachtet haben: Viele Partien während des Rundenturniers spielten überhaupt keine Rolle oder waren nur für Teams von Bedeutung, die zum Zuschauen verdammt waren.",
      "Dieses Jahr beginnt Der Weg zu The International mit fünf Runden nach dem Schweizer System. In den ersten drei Tagen spielen sechzehn Teams im Format Best-of-Three gegen andere Teams mit derselben Serienbilanz (ein 2:0-Team tritt gegen ein anderes 2:0-Team an, ein 1:3-Team tritt gegen ein anderes 1:3-Team usw.). Ein Team mit vier Siegen steigt automatisch zu The International auf, ein Team mit vier Niederlagen scheidet aus.",
      "Innerhalb von fünf Runden nach dem Schweizer System sichern sich drei Teams mit vier Siegen ihren Platz in The International und drei Teams mit vier Niederlagen scheiden endgültig aus. Die zehn verbleibenden Teams treten in einer speziellen Ausscheidungsrunde (stärkste gegen schwächste) gegeneinander an, um die verbleibenden fünf Plätze für The International unter sich auszumachen.",
      "Das Schweizer System garantiert einzigartige Herausforderungen, und wir haben besonders darauf geachtet, dass Fans im Voraus wissen, wann ihre Lieblingsteams spielen, und kein siegreiches Team zwei Serien hintereinander spielen muss (dazu zählen auch das letzte Spiel des Tages und das erste Spiel am nächsten Morgen).",
      "Der Weg zu The International läuft von Donnerstag, dem 4. September, bis Sonntag, den 7. September, und umfasst die Runden nach dem Schweizer System sowie die darauffolgende Ausscheidungsrunde. Insgesamt scheiden dabei acht der sechzehn eingeladenen Teams aus, während die besten acht Teams zu The International vorrücken.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/de252c0a7a04c4d3828c5205541b1f843e0b2117.png[/img]",
      "[h2]The International[/h2]",
      "The International beginnt am Donnerstag, den 11. September 2025, und läuft vier Tage lang in der Barclays Arena in Hamburg. Den Höhepunkt bildet das Finale am Sonntag, den 14. September 2025. Acht Teams werden live in der Arena vor Tausenden Fans um die Ägis kämpfen.",
      "Basierend auf ihren Leistungen während des Weges zu The International treffen die vier besten Teams im oberen Bracket im Doppel-K.-o.-System jeweils auf die vier schwächeren Teams. Alle Partien werden im Format Best-of-Three ausgetragen, mit Ausnahme des Finales mit Best-of-Five.",
      "[h2]Tickets[/h2]",
      "Tages- und Mehrtagestickets für The International stehen ab Dienstag, den 15. April um 10:00 Uhr MESZ auf [url=https://www.axs.com/]AXS[/url] zum Verkauf. Wir sehen uns in Hamburg!"
    ],
    "commentcount": 2,
    "tags": [],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "598522845445771232",
    "event_gid": "536597286667419796",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522845445771232",
  "rtime32_last_modified": 1743540890,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522845445771232",
  "clan_steamid_original": "103582791433224455"
}