{
  "gid": "536597286667419796",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025 — Programma en format",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743540840,
  "rtime32_end_time": 1743544440,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1743456596
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1743540888
      }
    ]
  },
  "announcement_body": {
    "gid": "536597286667419797",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025 — Programma en format",
    "posttime": 1743540889,
    "updatetime": 1743540889,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png[/img]",
      "De arena's zien er misschien anders uit, er zijn misschien steeds nieuwe sterspelers en elk jaar staan er weer nieuwe teams aan de top, terwijl andere van hun voetstuk vallen. Maar hoeveel er ook verandert, één ding blijft altijd hetzelfde: The International blijft een kroniek van dezelfde ongelofelijke reis, waarbij we de spelers van het beste Dota-team ter wereld volgen terwijl ze alle hindernissen overwinnen, alle uitdagingen het hoofd bieden en uiteindelijk als overwinnaars hun namen in de Aegis mogen kerven.",
      "De allereerste TI was een vijfdaags evenement dat tussen alle actie van de gamescom in Keulen werd gespeeld. Inmiddels organiseert Valve The International al meer dan tien jaar en ieder jaar leren we er weer iets bij. Alles van [url=https://www.dota2.com/newsentry/3675555405719286536]cabine-ontwerpen[/url] tot [url=https://www.dota2.com/newsentry/4247544173402144047]sponsoring[/url] en specifieke details rond de opzet van het toernooi. Elk jaar proberen we de beste dingen van voorgaande edities te behouden en blijven we zoeken naar nieuwe variaties die misschien nóg beter werken.",
      "Nu de tickets bijna in de verkoop gaan (details daarover volgen hieronder), willen we graag iets meer vertellen over de format van het evenement van dit jaar.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/7e72a4e737be03f6468f1d7b41eee975a435ee5c.png[/img]",
      "[h2]De weg naar The International[/h2]",
      "We wilden dit jaar een structuur creëren waarbij [i]elke wedstrijd[/i] belangrijk was en waarbij het voor de teams en kijkers duidelijk was wat er precies op het spel stond. Het was onze ambitie om daarbij de enorme hoeveelheid aan eerste, toernooibepalende wedstrijden te behouden, zodat fans van de groepsfase daar ook dit jaar uitgebreid van kunnen genieten. Tegelijkertijd was het de bedoeling dat de nieuwe format een einde zou maken aan de problemen die we in de afgelopen jaren hebben gezien, waarbij sommige groepswedstrijden er eigenlijk niet meer toe deden of alleen van belang waren voor teams die niet zelf aan de wedstrijd meededen.",
      "De weg naar The International begint dit jaar met vijf rondes van best of three, volgens het Zwitserse toernooisysteem: de eerste drie dagen spelen zestien teams steeds tegen andere tegenstanders met hetzelfde aantal gewonnen of verloren wedstrijden (dus een team met een winst-verliesbalans van 2:0, speelt tegen een ander team dat 2:0 staat, een team met een balans van 1:3, speelt tegen een ander team dat 1:3 staat, etc.). Als een team de vierde wedstrijd in de serie wint, gaat dat team rechtstreeks door naar The International. Teams die vier keer verliezen zijn geëlimineerd.",
      "Na de vijf rondes volgens het Zwitserse systeem gaan de drie teams met vier overwinningen door naar The International en de drie teams met vier verloren wedstrijden zijn uitgeschakeld. De tien overgebleven teams nemen het tegen elkaar op in een speciale eliminatieronde (sterkste teams tegen de zwakste), waarna de vijf winnaars doorgaan naar The International en de vijf verliezers afvallen.",
      "Zwitserse toernooien hebben hun eigen unieke uitdagingen en we hebben er alles aan gedaan om ervoor te zorgen dat fans van tevoren kunnen zien wanneer hun favoriete teams spelen. We zorgen er ook voor dat geen enkel winnend team ooit twee series na elkaar hoeft te spelen (en dat geldt ook voor de laatste wedstrijd van de avond gevolgd door de eerste wedstrijd de volgende ochtend).",
      "De weg naar The International loopt van donderdag 4 september tot en met zondag 7 september, inclusief beide Zwitserse rondes en de daaropvolgende eliminatierondes. Tijdens de weg naar The International worden acht van de zestien uitgenodigde teams geëlimineerd en de andere acht gaan door naar het strijdtoneel van The International.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/de252c0a7a04c4d3828c5205541b1f843e0b2117.png[/img]",
      "[h2]The International[/h2]",
      "The International begint op donderdag 11 september, waarna er vier dagen van wedstrijden losbarsten met als hoogtepunt de grote finale op zondag 14 september. De acht teams die na 'De weg naar The International' zijn doorgegaan, nemen het in de Barclays Arena in Hamburg tegen elkaar op om voor de ogen van duizenden fans om de Aegis te strijden.",
      "Alle acht teams gaan van start in de winnaarsronde van een standaard dubbele-eliminatie-toernooi, ingedeeld op basis van de uitslagen van De weg naar The International (hoogste tegen laagste). Alle wedstrijden zijn best of three, behalve de grote finale, die met best of five bepaald wordt.",
      "[h2]Tickets[/h2]",
      "Tickets voor The International zijn verkrijgbaar voor losse dagen of als ticketbundels voor meerdere dagen. Alle tickets zijn vanaf 10 u. 's ochtends (UTC+2) op dinsdag 15 april [url=https://www.axs.com/]te koop op AXS[/url]. We kunnen niet wachten om je daar te zien."
    ],
    "commentcount": 171,
    "tags": [
      "mod_reviewed",
      "ModAct_1425147233_1743543002_0"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "598522845445771232",
    "event_gid": "536597286667419796",
    "voteupcount": 1888,
    "votedowncount": 138,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522845445771232",
  "rtime32_last_modified": 1743623045,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743543003,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 1888,
  "votes_down": 138,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522845445771232",
  "clan_steamid_original": "103582791433224455"
}