{
  "gid": "536597286667419796",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025 — Programul și formatul",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743540840,
  "rtime32_end_time": 1743544440,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1743456596
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1743540888
      }
    ]
  },
  "announcement_body": {
    "gid": "536597286667419797",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025 — Programul și formatul",
    "posttime": 1743540889,
    "updatetime": 1743540889,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png[/img]",
      "De-a lungul timpului, arenele și cei mai buni jucători se pot schimba, iar noi echipe reușesc să persevereze în fiecare an, în timp ce altele părăsesc lumina reflectoarelor. Deși au loc multe schimbări, un singur lucru rămâne constant: The International rămâne o cronică a parcursului celei mai bune echipe de Dota din lume care reușește să depășească toate obstacolele, să sfideze toate provocările și să câștige trofeul Aegis of Champions.",
      "Prima ediție a campionatului The International a fost un eveniment care s-a desfășurat pe o perioadă de cinci zile la GamesCom, în Köln. De atunci, Valve a organizat noi ediții ale campionatului The International pentru mai bine de un deceniu și, în fiecare an, am învățat noi lucruri: de la [url=https://www.dota2.com/newsentry/3675555405719286536?l=romanian]designul cabinelor[/url] și [url=https://www.dota2.com/newsentry/4247544173402144047?l=romanian]sponsorizări[/url] până la detalii specifice privind formatul campionatului. În fiecare an, încercăm să fructificăm cele mai bune decizii anterioare și să căutăm în același timp oportunități de a încerca noi variații care s-ar putea dovedi și mai utile.",
      "Așadar, având în vedere că biletele vor fi puse în vânzare în curând (mai multe detalii mai jos), ne-am dorit să oferim mai multe informații despre formatul campionatului din acest an.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/7e72a4e737be03f6468f1d7b41eee975a435ee5c.png[/img]",
      "[h2]Drumul către The International[/h2]",
      "Ne-am propus ca pentru acest an să creăm o structură în care [i]fiecare meci[/i] să conteze, iar mizele acestor meciuri să fie clare pentru echipe și spectatori. De asemenea, nu ne-am dorit să ne abatem prea mult de la fundamentele campionatului și să renunțăm la meciurile care definesc parcursul echipelor în cadrul campionatului și pe care fanii fazei grupelor le îndrăgesc în fiecare an. Totodată, noul format trebuia să evite problemele pe care le-am observat în anii precedenți, în care echipele jucau fiecare cu fiecare câte un meci, iar meciurile acestea nu contau deloc sau puteau fi definitorii pentru alte echipe decât cele implicate în meci.",
      "Anul acesta, „Drumul către The International” va începe cu o fază cu cinci runde în sistem elvețian: de-a lungul primelor trei zile, șaisprezece echipe vor juca serii de câte 3 meciuri împotriva altor echipe cu rezultate identice (o echipă cu 2 victorii și 0 înfrângeri va înfrunta o altă echipă cu 2 victorii și 0 înfrângeri, o echipă cu o victorie și 3 înfrângeri va înfrunta o altă echipă cu o victorie și 3 înfrângeri etc.). Echipele care reușesc să câștige 4 serii de meciuri își vor asigura automat un loc pentru The International. Echipele care pierd 4 serii de meciuri vor fi eliminate.",
      "După cele cinci runde în sistem elvețian, trei echipe cu patru victorii vor avea un loc asigurat pentru The International, în timp ce trei echipe vor fi eliminate. Cele zece echipe rămase se vor confrunta într-o rundă specială de eliminare (cele mai puternice echipe vor juca împotriva celor mai slabe), iar cele cinci echipe victorioase își vor asigura și ele un loc pentru The International, în timp ce cele cinci echipe înfrânte vor părăsi competiția.",
      "Formatele elvețiene vin cu provocări unice, așa că ne-am asigurat că fanii pot ști dinainte când joacă echipele lor preferate și că nicio echipă cu un record de victorii nu va fi nevoită să joace două serii de meciuri la rând (inclusiv ultima serie de meciuri a unei nopți care să fie urmată dimineața de o primă serie de meciuri).",
      "„Drumul către The International” va începe joi, pe 4 septembrie, și se va încheia duminică, pe 7 septembrie. Această etapă va include atât rundele în sistem elvețian, cât și rundele eliminatorii. În urma acestei etape, opt dintre cele șaisprezece echipe invitate vor fi eliminate, iar celelalte opt echipe rămase vor urma să se confrunte în arenă în cadrul etapei „The International”.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/de252c0a7a04c4d3828c5205541b1f843e0b2117.png[/img]",
      "[h2]The International[/h2]",
      "The International va începe joi, pe 11 septembrie, și se va desfășura în arenă pe o perioadă de patru zile care va culmina cu finalele care se vor disputa duminică, pe 14 septembrie. Cele opt echipe care vor avansa din etapa „Drumul către The International” vor concura pentru trofeul Aegis of Champions la Barclays Arena în fața a mii de fani.",
      "Toate cele opt echipe vor începe într-o grupă superioară și vor juca într-un format cu dublă eliminare, seriile de meciuri urmând să fie stabilite în baza rezultatelor din etapa „Drumul către The International” (echipele cele mai bune vor juca împotriva echipelor mai slabe). În cadrul fiecărei serii de meciuri se vor disputa 3 partide, cu excepția marii finale, în care echipa câștigătoare va fi determinată în urma unei serii de meciuri de tip „3 din 5”.",
      "[h2]Bilete[/h2]",
      "Biletele pentru o singură zi sau pentru mai multe zile pentru campionatul The International [url=https://www.axs.com/]vor fi puse în vânzare pe AXS[/url] marți, 15 aprilie, începând cu ora 11:00 (UTC+3). Abia așteptăm să te vedem!"
    ],
    "commentcount": 418,
    "tags": [
      "mod_reviewed",
      "ModAct_1425147233_1743543002_0"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "598522845445771232",
    "event_gid": "536597286667419796",
    "voteupcount": 11307,
    "votedowncount": 1005,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522845445771232",
  "rtime32_last_modified": 1746063335,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743543003,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 11308,
  "votes_down": 1005,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597286667419797",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}