{
  "gid": "536597286667419796",
  "clan_steamid": "103582791433224455",
  "event_name": "Program og format for The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743540840,
  "rtime32_end_time": 1743544440,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1743456596
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1743540888
      }
    ]
  },
  "announcement_body": {
    "gid": "536597286667419797",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Program og format for The International 2025",
    "posttime": 1743540889,
    "updatetime": 1743540889,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png[/img]",
      "Arenaerne er forskellige, stjernespillerne ændrer sig, og hvert år stiger nye hold til tops, mens andre forlader rampelyset. Men selvom mange ting ændrer sig, er én ting altid det samme: The International er en fortælling om den samme rejse, der følger det bedste Dota-hold i verden, når de overkommer hver eneste forhindring, hver eneste udfordring og ridser deres navne ind i Aegis.",
      "Den første TI-turnering varede i fem dage og fandt sted på GamesCom i Køln. Valve har siden afholdt The International i mere end 10 år, og hvert år har vi lært nye ting – lige fra [url=https://www.dota2.com/newsentry/3675555405719286536]båsedesign[/url] til [url=https://www.dota2.com/newsentry/4247544173402144047]sponsorer[/url] til specifikke detaljer ved turneringsformat. Hvert år forsøger vi at tage de bedste dele fra tidligere beslutninger, samtidigt med at vi ser efter muligheder for at prøve nogle variationer, som måske vil fungere endnu bedre.",
      "Så eftersom billetsalget starter snart (detaljer nedenfor), tænkte vi, at vi ville gennemgå dette års turneringsformat.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/7e72a4e737be03f6468f1d7b41eee975a435ee5c.png[/img]",
      "[h2]Vejen til The International[/h2]",
      "I år har vi sat os for at lave en struktur, således at [i]hver eneste kamp[/i] har betydning, og at dette er tydeligt for både holdene og seerne. Vi ønskede at gøre dette uden at miste de mange grundlæggende, meta-afgørende kampe i turneringen, som fans af gruppefasen elsker hvert år. Og samtidigt skulle det nye format undgå de problemer, som vi har oplevet i tidligere år, hvor individuelle alle-mod-alle-kampe ikke havde betydning overhovedet eller kun havde betydning for hold, som ikke var med i kampen.",
      "I år starter Vejen til The International med en schweizerturnering over 5 runder: I løbet af de første tre dage spiller 16 hold bedst af tre kampe mod andre hold med samme serieresultat (et 2-0-hold møder et andet 2-0-hold, et 1-3-hold møder et andet 1-3-hold osv.). En fjerde sejr gør, at holdet automatisk går videre til The International – et fjerde nederlag gør, at holdet bliver elimineret.",
      "Efter fem runders schweizerturnering er de tre hold med fire sejre sikret en plads i The International, og de tre hold med fire nederlag er elimineret. De 10 tilbageværende hold mødes i en særlig elimineringsrunde (de stærkeste mod de svageste), hvor de fem vindere går videre til The International, og de fem tabere bliver elimineret.",
      "Der er unikke udfordringer ved schweizerturneringsformatet, og vi har taget særlige hensyn for at sikre, at fans på forhånd ved, hvornår deres yndlingshold spiller, og at ingen hold med en sejrsrække nogensinde skal spille to serier i træk (inklusive sidste kamp om aftenen efterfulgt af første kamp om morgenen).",
      "Vejen til The International løber fra torsdag d. 4. september til og med søndag d. 7. september, inklusive begge schweizerturneringer og de efterfølgende elimineringsrunder. I alt elimineres otte af de 16 inviterede hold på Vejen til The International, og de andre otte hold går videre til The Internationals arena.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/de252c0a7a04c4d3828c5205541b1f843e0b2117.png[/img]",
      "[h2]The International[/h2]",
      "The International starter torsdag d. 11. september og foregår i arenaen i fire dage indtil højdepunktet med finalen søndag d. 14. september. De otte hold, som går videre fra Vejen til The International, kommer til at konkurrere om Aegis i Barclays Arena foran tusindvis af fans.",
      "Alle otte hold starter i øvre gruppe med almindelig dobbelteliminering, seedet baseret på resultaterne i Vejen til The International (højeste mod laveste). Alle kampe er bedst af tre, bortset fra finalen, som er bedst af fem.",
      "[h2]Billetter[/h2]",
      "Endags- og flerdagsbilletter til The International sættes [url=https://www.axs.com/]til salg på AXS[/url] kl. 10 tirsdag d. 15. april. Vi glæder os til at se jer!"
    ],
    "commentcount": 8,
    "tags": [],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "598522845445771232",
    "event_gid": "536597286667419796",
    "voteupcount": 1,
    "votedowncount": 1,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522845445771232",
  "rtime32_last_modified": 1743540934,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522845445771232",
  "clan_steamid_original": "103582791433224455"
}