{
  "gid": "536597286667419796",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025 — Programação e formato",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743540840,
  "rtime32_end_time": 1743544440,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1743456596
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1743540888
      }
    ]
  },
  "announcement_body": {
    "gid": "536597286667419797",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025 — Programação e formato",
    "posttime": 1743540889,
    "updatetime": 1743540889,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png[/img]",
      "As arenas podem ser diferentes, as estrelas podem mudar, e novas equipes podem tomar o lugar de outras entre as melhores a cada ano. Contudo, um elemento permanece constante: o International continua sendo uma crônica da mesma jornada, seguindo a melhor equipe de Dota 2 do mundo enquanto conquista cada obstáculo, supera cada desafio e grava o nome dos seus membros na Égide.",
      "A edição inaugural do TI durou cinco dias, sediada no salão de exposições da gamescom, na cidade alemã de Colônia. Desde então, por mais de uma década, a Valve tem organizado o International todos os anos, sempre aprendendo coisas novas — incluindo como [url=https://www.dota2.com/newsentry/3675555405719286536]arquitetar as cabines dos jogadores[/url], [url=https://www.dota2.com/newsentry/4247544173402144047]regulamentar onde os patrocinadores podem ser exibidos[/url] e definir os detalhes do torneio em si. Ano após ano, tentamos usar as melhores decisões anteriores e buscar oportunidades de experimentar algumas variações que podem funcionar ainda melhor.",
      "Portanto, com o iminente início das vendas dos ingressos (detalhes abaixo), gostaríamos de falar com vocês sobre o formato do torneio deste ano.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/7e72a4e737be03f6468f1d7b41eee975a435ee5c.png[/img]",
      "[h2]O Caminho para o International[/h2]",
      "A nossa meta para esta edição é criar uma estrutura em que [i]todas as partidas[/i] sejam importantes, e que essa importância esteja clara para as equipes e os espectadores. Queríamos fazer isso sem jogar fora toda a ação da fase de grupos, com partidas fundamentais que costumam definir o meta do torneio, adorada por fãs mundo afora. Ao mesmo tempo, o novo formato precisava evitar problemas de outras edições, em que certas partidas na fase de pontos corridos não significavam nada ou afetavam apenas as equipes que não estavam na disputa.",
      "Neste ano, o Caminho para o International começa com uma fase no sistema suíço em cinco etapas: ao longo dos três primeiros dias, dezesseis equipes disputarão melhores de três (Md3) contra outras equipes com o mesmo histórico de Md3 no torneio (ou seja, uma equipe que venceu duas Md3 e não perdeu nenhuma enfrentará outra equipe na mesma situação, uma equipe que venceu uma Md3 e perdeu três enfrentará outra que venceu uma e perdeu três, e por aí vai). As equipes que vencerem quatro Md3 avançarão automaticamente para o International, enquanto aquelas que perderem quatro Md3 serão eliminadas.",
      "Após cinco rodadas, as três equipes com quatro vitórias garantirão uma vaga no International, enquanto as três com quatro derrotas darão adeus ao torneio. As dez equipes restantes se enfrentarão em uma fase eliminatória especial, em que cada equipe com três vitórias e duas derrotas enfrentará uma das equipes com duas vitórias e três derrotas.",
      "O sistema suíço tem os seus pontos fracos, e tomamos cuidado para garantir que os fãs saibam com antecedência quando as suas equipes favoritas jogarão, e que nenhuma equipe com mais vitórias que derrotas precise jogar duas Md3 consecutivas (incluindo a última partida de um dia seguida da primeira partida do dia seguinte).",
      "O Caminho para o International ocorrerá do dia 4 ao dia 7 de setembro, abrangendo tanto a fase do sistema suíço quanto a fase eliminatória. No total, o Caminho para o International eliminará metade das dezesseis equipes convidadas. As outras oito avançarão para a arena do International.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/de252c0a7a04c4d3828c5205541b1f843e0b2117.png[/img]",
      "[h2]International[/h2]",
      "O International começa no dia 11 de setembro (quinta-feira) e terá duração de quatro dias, culminando na Grande Final no dia 14 de setembro (domingo). As oito equipes sobreviventes do Caminho para o International competirão pela Égide na Barclays Arena diante de milhares de fãs.",
      "Todas as oito equipes começam na chave superior em um formato mata-mata de dupla eliminação, distribuídas com base no desempenho durante o Caminho para o International. Todas as séries serão melhores de três, exceto a Grande Final, que será uma melhor de cinco.",
      "[h2]Ingressos[/h2]",
      "Os ingressos do International para um e vários dias [url=https://www.axs.com/]começarão a ser vendidos na AXS[/url] a partir das 5h do dia 15 de abril (horário de Brasília). Nos vemos lá."
    ],
    "commentcount": 455,
    "tags": [
      "mod_reviewed",
      "ModAct_1425147233_1743543002_0"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "598522845445771232",
    "event_gid": "536597286667419796",
    "voteupcount": 13286,
    "votedowncount": 1225,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522845445771232",
  "rtime32_last_modified": 1746780195,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743543003,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 13286,
  "votes_down": 1225,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522845445771232",
  "clan_steamid_original": "103582791433224455"
}