{
  "gid": "536597286667419796",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025 – Πρόγραμμα και μορφή",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743540840,
  "rtime32_end_time": 1743544440,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1743456596
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1743540888
      }
    ]
  },
  "announcement_body": {
    "gid": "536597286667419797",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025 – Πρόγραμμα και μορφή",
    "posttime": 1743540889,
    "updatetime": 1743540889,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png[/img]",
      "Οι αρένες μπορεί να είναι διαφορετικές, οι πρωταγωνιστές μπορεί να αλλάζουν… Και κάθε χρονιά ανέρχονται νέες ομάδες ενώ άλλες κατεβαίνουν από το βάθρο τους. Όμως, αν και αλλάζουν πολλά, ένα πράγμα παραμένει σταθερό: Το The International εξακολουθεί να αποτελεί χρονικό του ίδιου ταξιδιού, όπου ακολουθούμε την καλύτερη ομάδα Dota στον κόσμο στην πορεία της να επιβληθεί απέναντι σε κάθε εμπόδιο, να ξεπεράσει κάθε πρόκληση και να χαράξει το όνομά της στο Aegis of Champions.",
      "Το πρώτο-πρώτο The International ήταν μια πενθήμερη εκδήλωση που διοργανώθηκε στον εκθεσιακό χώρο του gamescom στην Κολωνία. Πάνε πάνω από δέκα χρόνια από τότε που η Valve ξεκίνησε να διοργανώνει το The International και κάθε χρονιά μαθαίνουμε νέα πράγματα: τα πάντα, από [url=https://www.dota2.com/newsentry/3675555405719286536]σχεδιασμό θαλάμων[/url] και [url=https://www.dota2.com/newsentry/4247544173402144047]χορηγίες[/url] μέχρι συγκεκριμένες λεπτομέρειες για τον σχεδιασμό του τουρνουά. Κάθε χρονιά προσπαθούμε να κρατήσουμε τα καλύτερα κομμάτια από αποφάσεις προηγούμενων ετών, ψάχνοντας παράλληλα ευκαιρίες να δοκιμάσουμε κάποιες παραλλαγές που μπορεί να πάνε ακόμα καλύτερα.",
      "Οπότε, με τα εισιτήρια να διατίθενται σύντομα προς πώληση (λεπτομέρειες παρακάτω), θα θέλαμε να σας ενημερώσουμε σχετικά με τη μορφή του φετινού τουρνουά.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/7e72a4e737be03f6468f1d7b41eee975a435ee5c.png[/img]",
      "[h2]Ο Δρόμος προς το The International[/h2]",
      "Φέτος, επιδιώξαμε να φτιάξουμε μια δομή όπου θα διακυβεύονται πολλά σε [i]κάθε αγώνα[/i] και θέλαμε τα διακυβεύματα αυτά να είναι ξεκάθαρα στις ομάδες και τους θεατές. Θέλαμε να το κάνουμε αυτό χωρίς να χάσουμε τον τεράστιο αριθμό παιχνιδιών που είναι θεμελιώδη και καθορίζουν το τουρνουά μέσα από στρατηγικές και τακτικές –κάτι που απολαμβάνουν κάθε χρονιά οι φαν στη φάση των ομίλων. Και, την ίδια στιγμή, από τη νέα μορφή του τουρνουά έπρεπε να λείπουν προβλήματα που είδαμε τα προηγούμενα χρόνια, όπου μεμονωμένα εκ περιτροπής (round robin) παιχνίδια δεν είχαν καμία απολύτως σημασία ή είχαν μόνο για τις ομάδες που δεν συμμετείχαν στον αγώνα.",
      "Φέτος, ο Δρόμος προς το The International ξεκινά με έναν όμιλο πέντε γύρων ελβετικού συστήματος: Τις τρεις πρώτες ημέρες, δεκαέξι ομάδες θα παίξουν αγώνες στις 2 νίκες (best of 3) εναντίον άλλων ομάδων με το ίδιο αποτέλεσμα σειράς (μια ομάδα που κέρδισε 2–0 θα παίξει ενάντια σε μια άλλη ομάδα που κέρδισε 2–0, μια ομάδα που έχασε 1–3 θα παίξει ενάντια σε μια άλλη ομάδα που έχασε 1–3 κτλ.). Αν μια ομάδα επιτύχει τέσσερις νίκες σε μια σειρά αγώνων, τότε θα προκριθεί αυτόματα στο The International. Με τέσσερις ήττες, η ομάδα θα αποκλειστεί.",
      "Μετά από πέντε γύρους ελβετικού συστήματος, οι τρεις ομάδες με τέσσερις νίκες θα έχουν εξασφαλίσει τη θέση τους στο The International και οι τρεις ομάδες με τις τέσσερις ήττες θα έχουν αποκλειστεί. Οι δέκα ομάδες που απομένουν θα αναμετρηθούν η μία με την άλλη σε έναν ειδικό γύρο αποκλεισμού (οι πιο ισχυροί εναντίον των πιο αδύναμων), με τους πέντε νικητές να προκρίνονται στο The International και τους πέντε ηττημένους να αποκλείονται.",
      "Το ελβετικό σύστημα έχει κάποιες ιδιαίτερες προκλήσεις και έχουμε καταβάλει κάθε προσπάθεια ώστε να διασφαλίσουμε ότι οι φαν θα γνωρίζουν εκ των προτέρων πότε παίζουν οι αγαπημένες τους ομάδες, καθώς επίσης και ότι καμία ομάδα που έχει ρεκόρ νικών δεν θα χρειαστεί να παίξει σε δύο διαδοχικούς αγώνες (σε αυτό συμπεριλαμβάνεται και το τελευταίο παιχνίδι της ημέρας που ακολουθείται από το πρώτο παιχνίδι το πρωί της επομένης).",
      "Ο Δρόμος προς το The International θα διεξαχθεί από την Πέμπτη 4 Σεπτεμβρίου έως την Κυριακή 7 Σεπτεμβρίου και θα συμπεριλαμβάνει τόσο τους γύρους ελβετικού συστήματος όσο και τους γύρους αποκλεισμού που θα ακολουθήσουν. Συνολικά, στον Δρόμο προς το The International θα αποκλειστούν οκτώ από τις δεκαέξι προσκεκλημένες ομάδες, ενώ οι άλλες οκτώ θα προκριθούν στην αρένα για το The International.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/de252c0a7a04c4d3828c5205541b1f843e0b2117.png[/img]",
      "[h2]The International[/h2]",
      "Το The International ξεκινά την Πέμπτη 11 Σεπτεμβρίου και θα διεξαχθεί στην αρένα για τέσσερις ημέρες, με αποκορύφωμα τους Μεγάλους Τελικούς που θα διεξαχθούν την Κυριακή 14 Σεπτεμβρίου. Οι οκτώ ομάδες που θα προκριθούν από τον Δρόμο προς το The International θα αναμετρηθούν για το Aegis of Champions στο Barclays Arena, μπροστά σε χιλιάδες φαν.",
      "Και οι οκτώ ομάδες ξεκινούν στον Άνω Όμιλο ενός τυπικού ομίλου διπλού αποκλεισμού, με τις ομάδες να κατατάσσονται βάσει των επιδόσεων στον Δρόμο προς το The International (οι ομάδες με τις υψηλότερες επιδόσεις εναντίον αυτών με τις χαμηλότερες). Όλοι οι αγώνες είναι σε 2 νίκες (best of 3), εκτός από τον Μεγάλο Τελικό που είναι σε 3 νίκες (best of 5).",
      "[h2]Εισιτήρια[/h2]",
      "Τα εισιτήρια μίας ημέρας και τα πακέτα εισιτηρίων πολλαπλών ημερών για το The International θα διατίθενται [url=https://www.axs.com/]προς πώληση στο AXS[/url] από την Τρίτη 15 Απριλίου, στις 11 π.μ. ώρα Ελλάδας. Ανυπομονούμε να σας δούμε εκεί!"
    ],
    "commentcount": 455,
    "tags": [
      "mod_reviewed",
      "ModAct_1425147233_1743543002_0"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "598522845445771232",
    "event_gid": "536597286667419796",
    "voteupcount": 13284,
    "votedowncount": 1225,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522845445771232",
  "rtime32_last_modified": 1746779898,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743543003,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 13286,
  "votes_down": 1225,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597286667419797",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}