{
  "gid": "536597286667419796",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025: programmazione e formato",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743540840,
  "rtime32_end_time": 1743544440,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1743456596
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1743540888
      }
    ]
  },
  "announcement_body": {
    "gid": "536597286667419797",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025: programmazione e formato",
    "posttime": 1743540889,
    "updatetime": 1743540889,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png[/img]",
      "Arene diverse, probabilmente anche diversi fuoriclasse... Ogni anno nascono nuove squadre e altre subiscono battute d'arresto. Nonostante i cambiamenti, una cosa rimane invariata: il The International rappresenta ancora la storia della migliore squadra di Dota al mondo, che conquista tutti gli ostacoli, supera ogni sfida e incide i nomi dei suoi membri sull'Egida dei Campioni.",
      "In origine il TI era un evento di cinque giorni, ospitato nell'area espositiva della GamesCom di Colonia. Valve organizza il The International da oltre un decennio e ogni anno abbiamo imparato qualcosa di nuovo, dalla [url=https://www.dota2.com/newsentry/3675555405719286536]progettazione delle cabine[/url] alle [url=https://www.dota2.com/newsentry/4247544173402144047]sponsorizzazioni[/url] fino ai dettagli specifici della progettazione dei tornei. Ogni anno continuiamo a fare tesoro delle esperienze passate e a esplorare nuove idee per migliorare l'evento.",
      "A questo proposito, vorremmo spiegare il formato del torneo di quest'anno, prima che i biglietti vengano messi a breve in vendita (vedi le informazioni qui sotto).",
      "[img]{STEAM_CLAN_IMAGE}/3703047/7e72a4e737be03f6468f1d7b41eee975a435ee5c.png[/img]",
      "[h2]Il Cammino per il The International[/h2]",
      "Quest'anno abbiamo deciso di creare una struttura in cui [i]ogni singola partita[/i] avesse una chiara posta in gioco, sia per le squadre che per il pubblico. Volevamo raggiungere questo obiettivo senza rinunciare alle numerose partite decisive che definiscono la strategia del torneo e che i tifosi apprezzano ogni anno durante la fase a gironi. Allo stesso tempo, il nuovo formato è stato pensato per evitare le insidie degli anni precedenti, quando alcune partite individuali del girone all'italiana non avevano alcun impatto, o erano importanti solo per le squadre non coinvolte.",
      "Quest'anno, la strada verso il The International inizia con un girone a sistema svizzero a cinque turni: nei primi tre giorni, sedici squadre si sfideranno al meglio di tre partite contro altre squadre con lo stesso punteggio di serie (una squadra che ha vinto due partite e non ne ha persa nessuna (2:0) giocherà contro un'altra squadra che ne ha vinte due e non ne ha persa nessuna (2:0), una squadra che ha vinto una partita e ne ha perse tre (1:3) giocherà contro una squadra che ne ha persa una e ne ha vinte tre (1:3), e così via). Una quarta vittoria in serie qualificherà automaticamente la squadra al The International. La quarta sconfitta comporterà l'eliminazione.",
      "Dopo cinque turni del sistema svizzero, le tre squadre con quattro vittorie si saranno assicurate un posto al The International, mentre le tre squadre con quattro sconfitte verranno eliminate. Le dieci squadre rimaste si sfideranno in uno speciale girone eliminatorio, che metterà i più forti contro i più deboli. Le cinque squadre vincitrici si qualificheranno per il The International, mentre le cinque squadre perdenti saranno eliminate.",
      "Il sistema svizzero è particolarmente impegnativo e abbiamo fatto in modo che i tifosi sappiano in anticipo quando giocano le loro squadre preferite, e che nessuna squadra con un record vincente sia costretta a giocare due serie di partite di seguito, compresa l'ultima partita della sera seguita dalla prima del mattino.",
      "Il Cammino per il The International si svolgerà da giovedì 4 a domenica 7 settembre e comprenderà sia il sistema svizzero che i successivi gironi a eliminazione diretta. In totale, il Cammino per il The International eliminerà otto delle sedici squadre invitate, mentre le restanti otto accederanno all'arena per il The International.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/de252c0a7a04c4d3828c5205541b1f843e0b2117.png[/img]",
      "[h2]The International[/h2]",
      "Il The International inizierà giovedì 11 settembre e si svolgerà nell'arena per quattro giorni, culminando nella finalissima di domenica 14 settembre. Le otto squadre che si sono qualificate durante il Cammino per il The International si contenderanno l'Egida alla Barclays Arena di Amburgo, davanti a migliaia di tifosi.",
      "Tutte le otto squadre iniziano nel girone superiore in un girone standard a doppia eliminazione, assegnato in base alle prestazioni durante il Cammino per il The International (le \"migliori\" contro le \"peggiori\"). Tutte le partite si giocano al meglio di tre, fatta eccezione per la finalissima, che si gioca al meglio di cinque.",
      "[h2]Biglietti[/h2]",
      "I biglietti giornalieri e i pacchetti plurigiornalieri per il The International saranno in vendita [url=https://www.axs.com/]su AXS[/url] a partire dalle 10:00 di martedì 15 aprile. Ti aspettiamo con ansia!"
    ],
    "commentcount": 455,
    "tags": [
      "mod_reviewed",
      "ModAct_1425147233_1743543002_0"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "598522845445771232",
    "event_gid": "536597286667419796",
    "voteupcount": 13285,
    "votedowncount": 1225,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522845445771232",
  "rtime32_last_modified": 1746779962,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743543003,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 13286,
  "votes_down": 1225,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597286667419797",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}