{
  "gid": "536597286667419796",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025 — расписание и формат",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743540840,
  "rtime32_end_time": 1743544440,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1743456596
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1743540888
      }
    ]
  },
  "announcement_body": {
    "gid": "536597286667419797",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025 — расписание и формат",
    "posttime": 1743540889,
    "updatetime": 1743540889,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png[/img]",
      "Одна арена уступает место другой, звёздные игроки приходят и уходят, и каждый год всё новые и новые команды добиваются успеха и терпят неудачи. Но даже когда меняется многое, The International остаётся хроникой путешествия, в ходе которого лучшая команда мира по Доте преодолевает каждое препятствие, превозмогает все испытания и высекает на Эгиде имена чемпионов.",
      "Первый TI длился пять дней и проходил на выставке GamesCom в Кёльне. С тех пор минуло уже больше десяти лет, и Valve продолжает проводить The International, с каждым годом узнавая всё больше: о [url=https://www.dota2.com/newsentry/3675555405719286536]конструкции кабинок[/url], [url=https://www.dota2.com/newsentry/4247544173402144047]требованиях к рекламе[/url], отдельных составляющих турнирного дизайна и многом другом. Раз за разом мы стараемся использовать самые успешные из прошлых решений и в то же время стремимся попробовать идеи, которые могут сделать чемпионат ещё лучше.",
      "Учитывая, что билеты скоро поступят в продажу (подробнее об этом ниже), мы хотели бы познакомить вас с турнирным форматом этого года.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/7e72a4e737be03f6468f1d7b41eee975a435ee5c.png[/img]",
      "[h2]Дорога на The International[/h2]",
      "В этом году нашей целью было создать такую структуру, в которой [i]совершенно каждый матч[/i] несёт за собой последствия, понятные командам и зрителям. Мы не хотели отказываться от огромного числа матчей, формирующих тренды турнира и каждый год радующих фанатов группового этапа. В то же время новый формат должен решить проблемы прошлых лет, когда при соревновании по круговой системе отдельные игры не влияли ни на что — либо влияли только на другие команды.",
      "В этом году «Дорога на The International» начнётся с пятираундовой сетки по швейцарской системе: в первые три дня шестнадцать команд будут играть матчи до двух побед против соперников с аналогичным счётом (например, если коллектив победил в двух матчах, он встретится с командой, показавшей такой же результат). Команды, выигравшие четыре матча, автоматически проходят на The International, а проигравшие четыре матча — выбывают.",
      "После пяти раундов по швейцарской системе три команды с четырьмя победами гарантируют себе место на The International, а три команды с четырьмя поражениями покинут турнир. Оставшиеся десять коллективов сойдутся в особом туре (сильнейшие против слабейших), где пять победивших команд пройдут на The International, а пять проигравших — завершат своё участие.",
      "У швейцарских форматов есть уникальные сложности, и мы позаботились о том, чтобы фанаты заранее знали, когда играют их любимчики, и чтобы ни одной команде с выигрышным счётом не пришлось играть два матча подряд (в том числе последний матч вечером и первый матч утром).",
      "«Дорога на The International», включающая в себя матчи по швейцарской системе и тур на выбывание, начнётся 4 сентября, в четверг, и завершится 7 сентября, в воскресенье. После неё восемь из шестнадцати приглашённых команд покинут соревнование, а оставшиеся попадут на арену, где и состоится The International.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/de252c0a7a04c4d3828c5205541b1f843e0b2117.png[/img]",
      "[h2]The International[/h2]",
      "The International начнётся 11 сентября, в четверг, и продлится четыре дня, а завершающий его гранд-финал состоится 14 сентября, в воскресенье. Восемь команд, прошедших «Дорогу на The International», сразятся за Эгиду на «Барклейс-арене» перед тысячами фанатов.",
      "Все восемь команд начинают в верхней части стандартной сетки с выбыванием после двух поражений, а их распределение будет зависеть от результатов «Дороги на The International» (лучшие будут играть против худших). Гранд-финал играется до трёх побед, а остальные матчи — до двух.",
      "[h2]Билеты[/h2]",
      "Однодневные и многодневные билеты на The International поступят в продажу на сайте [url=https://www.axs.com/]AXS[/url] в 11:00 15 апреля по московскому времени. Мы с нетерпением ждём встречи с вами."
    ],
    "commentcount": 455,
    "tags": [
      "mod_reviewed",
      "ModAct_1425147233_1743543002_0"
    ],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "598522845445771232",
    "event_gid": "536597286667419796",
    "voteupcount": 13284,
    "votedowncount": 1225,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522845445771232",
  "rtime32_last_modified": 1746779898,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1743543003,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 13286,
  "votes_down": 1225,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "536597286667419797",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}