{
  "gid": "536597286667419796",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025: Programa y formato",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1743540840,
  "rtime32_end_time": 1743544440,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1743456596
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1743540888
      }
    ]
  },
  "announcement_body": {
    "gid": "536597286667419797",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025: Programa y formato",
    "posttime": 1743540889,
    "updatetime": 1743540889,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/6c52d654ed6cf25f7e3f548e729c93c86e414aa7.png[/img]",
      "Las arenas pueden ser distintas, los mejores jugadores pueden cambiar, y cada año surgirán equipos nuevos, mientras que otros decaen. Mientras que muchas cosas cambian, algo permanece constante, el hecho de que The International sigue siendo una crónica de la misma trayectoria: el recorrido del mejor equipo del mundo de Dota hasta poner sus nombres en la Égida después de superar cada obstáculo y todos los desafíos.",
      "El evento original de The International fue un evento de cinco días, presentado en la gamescom de Colonia, Alemania. Valve ha sido anfitrión de The International por más de una década desde entonces, y cada año aprendemos cosas nuevas: desde el [url=https://www.dota2.com/newsentry/3675555405719286536]diseño de cabinas[/url] hasta [url=https://www.dota2.com/newsentry/4247544173402144047]patrocinios[/url] para especificar los detalles del diseño del torneo. Cada año intentamos capturar lo mejor de las decisiones anteriores, a la vez que exploramos variantes que podrían funcionar aún mejor.",
      "Con la venta de boletos a punto de comenzar (consulta los detalles a continuación), queremos contarte sobre el formato del torneo de este año.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/7e72a4e737be03f6468f1d7b41eee975a435ee5c.png[/img]",
      "[h2]El camino a The International[/h2]",
      "Este año, creamos un formato en el que [i]cada una de las partidas[/i] tenga sus implicaciones, y que esas implicaciones fueran obvias para los jugadores y los espectadores. Quisimos hacer esto sin perder la enorme cantidad de partidas fundamentales que definen la fase de grupos cada año. Y a la vez, este nuevo formato era necesario para evitar problemas que vimos surgir los años anteriores, donde las partidas con formato \"todos contra todos\" eran intrascendentes o solamente generaban interés en los equipos que no participaban en ellas.",
      "Este año, El camino a The International arranca con una fase de cinco rondas del sistema suizo: con el paso de los primeros tres días, 16 equipos se enfrentarán en una serie al mejor de 3 partidas contra otros equipos con los mismos resultados de la serie, por ejemplo: un equipo cuyo resultado sea 2-0 se enfrentará a otro equipo con el mismo resultado; un equipo cuyo resultado sea 1-3 se enfrentará a otro equipo cuyo resultado sea 1-3, y así sucesivamente. Los equipos que obtengan cuatro victorias pasarán automáticamente a The International, mientras que una cuarta derrota hará que el equipo quede eliminado.",
      "Después de cinco rondas con el sistema suizo, los tres equipos con cuatro victorias tendrán un lugar asegurado en The International y serán eliminados aquellos equipos con cuatro derrotas. Los 10 equipos restantes se volverán a enfrentar en una ronda de eliminación especial (los más fuertes contra los más débiles) con los cinco ganadores asegurando un puesto a The International, y los cinco perdedores serán eliminados.",
      "El formato suizo cuenta con retos únicos y hemos puesto mucha atención al cuidado de los fanáticos para asegurarnos de que sepan de antemano cuando sus equipos favoritos estén jugando, y que ningún equipo con un registro de victorias tenga que jugar dos series de partidas al hilo (incluyendo la última partida de la noche seguida por la primera partida de la mañana).",
      "El camino a The International será del jueves 4 de septiembre al domingo 7 de septiembre e incluye las partidas del sistema suizo y la siguiente ronda de eliminaciones. En resumen, El camino a The International eliminará a ocho de los 16 equipos invitados y los otros ocho se abrirán camino hacia la arena para The International.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/de252c0a7a04c4d3828c5205541b1f843e0b2117.png[/img]",
      "[h2]The International[/h2]",
      "The International comienza el jueves 11 de septiembre y se llevará a cabo en la arena durante cuatro días, culminando con la gran final el domingo 14 de septiembre. Los ocho equipos que avancen desde El camino a The International competirán por la Égida en Barclays Arena frente a miles de fanáticos.",
      "Los ocho equipos empiezan a jugar en el grupo de ganadores con un formato estándar de eliminación doble y con una asignación de enfrentamientos basada en los resultados de El camino a The International, que enfrenta a los mejores contra los peores. Todas las partidas son al mejor de tres, con excepción de la gran final, que será al mejor de cinco.",
      "[h2]Boletos[/h2]",
      "Los boletos para un solo día y los paquetes de boletos para varios días de The International [url=https://www.axs.com/]estarán listos para su venta en AXS[/url] el martes 15 de abril a partir de la 1:00 a. m. (hora del Pacífico). Esperamos verte ahí."
    ],
    "commentcount": 2,
    "tags": [],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "598522845445771232",
    "event_gid": "536597286667419796",
    "voteupcount": 0,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598522845445771232",
  "rtime32_last_modified": 1743540890,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598522845445771232",
  "clan_steamid_original": "103582791433224455"
}