{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Marii campioni ai turneului The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Marii campioni ai turneului The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Felicitări echipei Team Spirit, marea campioană a turneului The International 2023 și a doua echipă care a revendicat The Aegis pentru a doua oară. Această echipă de temut a pierdut doar două runde de-a lungul întregului turneu, iar în marea finală s-a impus cu un scor de 3-0, asigurându-și astfel titlul de cea mai bună echipă de Dota din lume.",
      "[b]Drumul către The International - Faza grupelor[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Drumul către The International[/url] a început cu o serie de 8 victorii consecutive pentru Team Spirit, reușind să se impună cu scorul de 2-0 împotriva echipelor 9pandas, SMG, Entity și Evil Geniuses în faza grupelor. Nici runda de meciuri pentru determinarea grupei inferioare și a celei superioare nu a fost diferită, deoarece Team Spirit a reușit să-și revină în prima partidă după ce Shopify Rebellion a obținut un avantaj la început, iar în cele din urmă și-a asigurat o altă victorie cu scorul de 2-0 în drumul către faza eliminatorie.",
      "[b]Drumul către The International - Faza eliminatorie[/b]",
      "Prima provocare a turneului pentru Team Spirit a reprezentat-o confruntarea cu Virtus.pro, deoarece echipa din urmă a reușit să obțină rapid o victorie în prima partidă, forțând echipa Team Spirit să joace mai atent. Următoarea partidă a fost un adevărat măcel. În ciuda faptului că Team Spirit a condus în prima parte a meciului, echipa a pierdut conducerea, urmând în cele din urmă să se repună pe picioare și să obțină victoria necesară pentru disputarea celei de-a treia partide. VP a reușit să reziste în partida decisivă până în minutul 30, chiar dacă nu a obținut niciun avantaj, dar în cele din urmă, Team Spirit a preluat controlul și a reușit să obțină victoria, asigurându-și puțină odihnă binemeritată înainte de evenimentul principal care s-a desfășurat la Climate Pledge Arena.",
      "[b]The International[/b]",
      "Prima adversară pentru Team Spirit din cadrul evenimentului principal a fost Team Liquid, o echipă cu o performanță puternică și consistentă de-a lungul turneului, care era hotărâtă să avanseze până în finală și să obțină trofeul mult râvnit, punând capăt unei serii dezamăgitoare de poziții secunde pe podium. Team Spirit a pus presiune asupra jucătorilor de Support și Core ai echipei Team Liquid în prima partidă, dar Team Liquid nu s-a lăsat mai prejos și a reușit să se impună decisiv în a doua partidă. Team Liquid a reușit apoi să obțină un mic avantaj în mijlocul celei de-a treia partide, dar Team Spirit a depășit deficitul de ucideri pentru a-și crea propriul avantaj inegalabil, câștigând astfel partida decisivă. În urma acestei victorii, Team Spirit a urmat să se confrunte cu LGD Gaming, un adversar de temut care a pierdut o singură partidă de-a lungul turneului.",
      "Primul meci a fost un măcel adevărat care s-a încheiat după 76 de minute de joc. LGD a jucat foarte agresiv la început, dar Team Spirit a reușit să facă față cu brio provocării și a preluat controlul în cele din urmă. LGD Gaming a tot încercat să reobțină controlul, dar Team Spirit i-a spulberat toate șansele și a reușit să obțină victoria. LGD Gaming a pierdut astfel prima partidă din cadrul evenimentului principal. Team Spirit a dominat încă de la bun început cea de-a doua partidă, reușind să obțină un avantaj care i-a forțat pe cei de la LGD Gaming să se predea. După o prezență dezamăgitoare la Singapore în 2022, Team Spirit a arătat că și-a revenit în formă odată cu avansarea în marea finală.",
      "Adversarul care a urmat a fost echipa de temut Gaimin Gladiators, cea care a făcut ravagii în campionatele majore din acest an și care a abordat un stil agresiv în fazele timpurii ale partidelor, reușind să spulbere speranțele multora dintre echipele din grupa inferioară.",
      "Din păcate pentru echipa Gaimin Gladiators și fanii acesteia, Team Spirit a avut propriile planuri pentru a termina rapid cu adversarii săi. A avut un prim meci relativ rapid, obținând un avantaj mare de aur și ucideri, care nu avea cum altfel să se termine decât printr-un GG. A doua partidă s-a dovedit a fi mai incertă; Gaimin Gladiators a obținut mici reușite împotriva Team Spirit, dar echipa din urmă a dominat sfârșitul partidei și a obținut a doua victorie din seria de meciuri. ",
      "Gaimin Gladiators n-a vrut să renunțe fără a lupta până la capăt și a reușit să obțină un avantaj in faza timpurie a celei de-a treia partide. Dar după ce s-a ajuns la 30 de minute de joc, până și Dota Plus a crezut că Gaimin Gladiators avea o șansă de 95% de a forța disputarea unui al patrulea meci... dar mișcările de trupe, vederea asupra hărții și coordonarea echipei Team Spirit a făcut ca acea șansă de 5% să se transforme într-o revenire spectaculoasă, spulberând orice speranță a echipei Gaimin Gladiators și câștigând marea finală cu scorul de 3-0. Team Spirit a câștigat astfel al doilea trofeu Aegis în decurs de trei ani și a reușit să-l aducă pe jucătorul Larl în clubul campionilor. Cu un talent individual incredibil și joc de echipă fenomenal, Team Spirit și-a consolidat locul în istoria Dota 2 ca fiind echipa câștigătoare a turneului The International 2023.",
      "Drept simbol suprem al acestei victorii importante, numele acestor jucători vor fi gravate pentru totdeauna pe trofeul Aegis of Champions:",
      "[b]2023 - Team Spirit[/b]",
      "[list]",
      "[*] Ilya „Yatoro雨” Muliarchuk",
      "[*] Denis „Larl” Sigitov",
      "[*] Magomed „Collapse” Khalilov",
      "[*] Myroslav „Mira” Kolpakov",
      "[*] Yaroslav „Miposhka” Naidenov",
      "[/list]",
      "[b]Retrospectivă[/b]",
      "Dacă ai pierdut vreun meci al turneului sau dorești să retrăiești momentele incredibile ale acestui turneu, accesează [url=https://www.youtube.com/user/dota2]canalul Dota 2 de YouTube[/url] pentru a putea urmări reluările întregului turneu, inclusiv conținutul de divertisment difuzat între meciuri. De asemenea, o mulțime de fotografii de la eveniment sunt disponibile pe [url=https://www.instagram.com/dota2]contul Dota 2 de Instagram[/url] și [url=https://www.flickr.com/photos/dota2ti/]contul Dota 2 de Flickr[/url].",
      "Am dori să mulțumim tuturor jucătorilor, realizatorilor și tuturor celor din comunitatea Dota care ne-au susținut și au contribuit la desfășurarea acestui eveniment extraordinar. The International reprezintă punctul culminant al fiecărui sezon competițional și, fără sprijinul fiecăruia dintre voi, nimic nu ar fi fost posibil. Sperăm că ți-a plăcut turneul de anul acesta la fel de mult ca și nouă.",
      "[b]Sărbătorirea campionilor[/b]",
      "Capsulele cu ediția specială a abțibildurilor cu campioni sunt disponibile acum spre achiziție pentru Team Spirit. Fiecare capsulă conține un abțibild cu Yatoro雨, Larl, Collapse, Mira, Miposhka sau Team Spirit. 50% din toate încasările generate vor fi direcționate către Team Spirit.",
      "[b]Compendiul The International[/b]",
      "Mai ai de finalizat niște provocări și revendicat niște recompense în compendiul The International 2023? Nu te panica. Mai ai încă două săptămâni pentru a-ți atinge obiectivele înainte ca acest compendiu să fie retras pe 16 noiembrie. Pune în aplicare noile tale strategii preferate de la TI și vei termina toate provocările în cel mai scurt timp posibil."
    ],
    "commentcount": 588,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20877,
    "votedowncount": 1657,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1708463138,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20877,
  "votes_down": 1657,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}