{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Les grands vainqueurs de The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Les grands vainqueurs de The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Félicitations à Team Spirit, grande championne de The International 2023 et deuxième équipe à remporter deux fois l'Aegis. Cette équipe redoutable n'a perdu que deux matchs lors du tournoi, et elle s'est imposée 3 à 0 lors de la grande finale, méritant ainsi le titre de meilleure équipe de Dota du monde.",
      "[b]La route vers The International : phase de groupes[/b]",
      "Team Spirit avait annoncé la couleur lors de la phase de groupes de [url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]la route vers The International[/url] en s'imposant 2 à 0 contre 9pandas, SMG, Entity et Evil Geniuses. La phase de distribution des équipes n'a pas dérogé à la règle : Team Spirit a subi des pertes précoces lors de son premier match contre Shopify Rebellion, avant de se reprendre pour remporter la victoire une nouvelle fois 2 à 0 et de se qualifier pour la phase des éliminatoires.",
      "[b]La route vers The International : phase des éliminatoires[/b]",
      "Premier vrai coup dur du tournoi pour Team Spirit, qui se fait rapidement maitriser par Virtus.pro, mettant en péril l'équipe jusqu'alors invaincue. Le match suivant est particulièrement sanglant. Malgré un avantage en début de partie, Team Spirit subit un revers avant de finalement retrouver la force nécessaire pour permettre un troisième match décisif. VP se défend bec et ongles pendant 30 minutes, mais Spirit parvient à prendre le contrôle de la partie en anéantissant toute l'équipe en fin de match. Team Spirit, victorieuse, profite alors d'un repos bien mérité avant d'entrer dans l'arène du Climate Pledge Arena pour l'évènement principal.",
      "[b]The International[/b]",
      "Le premier match voit s'affronter Team Spirit et la puissante Team Liquid qui est bien décidée à se frayer un chemin jusqu'à la finale et ne veut plus se contenter de sa sempiternelle deuxième place. Team Spirit martyrise les Supports et les Cores de Liquid lors du premier match, mais Liquid riposte avec une performance magistrale lors de la deuxième rencontre. Malgré une légère avance de Liquid au milieu du troisième match et un nombre de victimes moins important, Spirit remonte la pente au point de devenir insurmontable et de s'assurer une victoire décisive. L'heure est venue d'affronter LGD Gaming, un adversaire de taille qui n'avait à ce stade de la compétition perdu qu'un seul match.",
      "Le premier match a fait rage pendant 76 minutes. LGD se montre agressif très tôt, mais Team Spirit tient bon avant de prendre le dessus. LGD tente alors à plusieurs reprises de se reprendre, mais Spirit ne se laisse pas faire et inflige à LGD leur première défaite lors de l'évènement principal. Lors du match suivant, Spirit s'impose rapidement puis ne cesse de gagner en puissance, forçant LGD à abdiquer. Après une performance décevante à Singapour en 2022, Team Spirit signe un retour en force et se fraie un chemin jusqu'aux finales.",
      "Leurs adversaires : les dangereux Gaimin Gladiators, l'équipe qui a balayé les tournois majeurs de cette année et dont les tactiques brutales en début de partie avaient déjà réduit à néant les espoirs de beaucoup d'équipes du groupe inférieur.",
      "Malheureusement pour Gamin et leurs fans, Team Spirit avait un plan pour déjouer leur stratégie. Elle accumule les victimes et l'or sans attendre, ne laisse à GG aucune chance de faire un retour et plie le premier match en relativement peu de temps. La deuxième partie est plus serrée. Gaimin Gladiators prend légèrement l'avantage plusieurs fois, mais ce n'est pas suffisant pour arrêter Team Spirit, qui finit par dominer complètement la fin du match et remporter sa deuxième victoire de la série. ",
      "N'étant pas du genre à abandonner sans se battre, Gaimin Gladiators parvient à prendre l'avantage dès le début du troisième match. Au bout de 30 minutes, même Dota Plus donne GG gagnant à 95 % ! Mais c'est sans compter sur le dynamisme, la vision et la coordination de Team Spirit, qui transforme ces 5 % en un incroyable retournement de situation, mettant GG au tapis 3 à 0 et clôturant cette finale. Team Spirit remporte son deuxième Aegis en trois ans et donne à Larl, son spécialiste de la lane du milieu, son premier titre. Grâce aux talents incroyables de chaque joueur et à sa cohésion exceptionnelle, Team Spirit marquera l'histoire de Dota 2 en tant qu'ultime équipe survivante de The International 2023.",
      "Porteurs du symbole ultime de victoire, ces noms seront gravés éternellement sur l'Aegis of Champions :",
      "[b]2023 − Team Spirit[/b]",
      "[list]",
      "[*] Illya « Yatoro雨 » Mulyarchuk",
      "[*] Denis « Larl » Sigitov",
      "[*] Magomed « Collapse » Khalilov",
      "[*] Myroslav « Mira » Kolpakov",
      "[*] Yaroslav « Miposhka » Naidenov",
      "[/list]",
      "[b]Pour revoir toute l'action[/b]",
      "Si vous avez raté des moments du tournoi, ou si vous voulez simplement revivre les moments forts et actions les plus incroyables, rendez-vous sur la [url=https://www.youtube.com/user/dota2]chaine YouTube de Dota 2[/url]. Vous y trouverez les rediffusions de tous les matchs, ainsi que tout le contenu des intermèdes. Vous trouverez aussi une pile de photos de l'évènement sur les comptes [url=https://www.instagram.com/dota2]Instagram[/url] et [url=https://www.flickr.com/photos/dota2ti/]Flickr[/url] de Dota 2.",
      "Merci à toutes les équipes, aux personnalités et à toute la communauté de Dota d'avoir suivi l'évènement et d'y avoir donné vie. The International est le point culminant de la saison compétitive, et sans le soutien de chacune et chacun d'entre vous, rien de tout cela ne serait possible. Nous espérons que vous avez apprécié le tournoi de cette année autant que nous.",
      "[b]Célébrons les champions[/b]",
      "Des capsules d'autocollants à l'effigie des champions sont disponibles à l'achat. Chaque capsule contient un autocollant à l'effigie de Yatoro雨, Larl, Collapse, Mira, Miposhka, ou Team Spirit. La moitié des recettes récoltées est directement reversée à Team Spirit.",
      "[b]Compendium de The International[/b]",
      "Il vous reste des défis à relever et des récompenses du Compendium de The International 2023 à récupérer ? Pas de panique. Il vous reste deux semaines pour atteindre vos objectifs avant la fin du Compendium, le 16 novembre. Inspirez-vous des stratégies utilisées lors du tournoi et vous les achèverez en un rien de temps."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "3731854745514680600",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}