{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Чемпіони The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Чемпіони The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Вітаємо переможців The International 2023 — команду Team Spirit, що стала другою в історії, хто виборов Еґіду двічі. Грізний склад цієї команди програв лише дві гри за весь турнір і здобув вирішальну перемогу із рахунком 3:0 у ґранд-фіналі, виборовши почесний титул найкращої команди Dota у світі.",
      "[b]Шлях до The International — груповий етап[/b]",
      "Цьогорічні переможці розпочали свій [url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Шлях до The International[/url] із домінування на груповому етапі, обігравши 9pandas, SMG, Entity та Evil Geniuses із рахунком 2:0. Раунд посіву засвідчив продовження переможної ходи Team Spirit, що витримала початковий натиск Shopify Rebellion у першій грі та зрештою обіграла останню із рахунком 2:0 на шляху до плей-оф.",
      "[b]Шлях до The International — плей-оф[/b]",
      "Далі володарі Еґіди зустріли перше реальне випробування на цьому турнірі, швидко програвши Virtus.pro першу гру, що змусило Team Spirit по-справжньому зібратися з силами. Під час наступної гри, що перетворилася на криваве бойовище, Team Spirit зі змінним успіхом перехоплювала ініціативу та врешті-решт спромоглася взяти гору. Розпочалася третя гра, під час перших 30 хвилин якої панував паритет, але далі Team Spirit почала домінувати, не залишивши жодних шансів Virtus.pro та повністю знищивши цю команду у пізній грі. Після заслуженого відпочинку на переможців чекав груповий етап на арені «Клаймат Пледж» (Climate Pledge Arena).",
      "[b]The International[/b]",
      "Першим супротивником Team Spirit на головному етапі стала стабільно потужна Team Liquid, що намагалася пробитися до ґранд-фіналу й позбутися свого прокляття другого місця. У першій грі Team Spirit тиснула на ворожих героїв підтримки й замучила їхніх героїв основи, але Team Liquid спромоглася взяти ефектний реванш у другій грі. У середині третьої гри Team Liquid здобули незначну перевагу, але після початково меншої кількості вбивств Team Spirit спромоглися перехопити ініціативу та стали дійсно нездоланними. Після цього вирішального матчу на переможців чекала сутичка із сильним складом LGD Gaming, який на той момент програв лише одну гру.",
      "Перша гра тривала аж 76 хвилин і розпочалася з агресивного натиску LGD, але Team Spirit вистояла та почала поступово домінувати. Гравці LGD намагалися відступати, та даремно — на них чекала їхня перша поразка на головному етапі. З самого початку другої гри панувала Team Spirit, яка посилила свою перевагу та знищила LGD. Хоч сінгапурський виступ гравців Team Spirit у 2022 році був невдалим, вони довели, що набули оптимальної форми на шляху до ґранд-фіналу.",
      "Їхній суперник — Gaimin Gladiators — небезпечна команда, що пронеслася цьогорічними великими турнірами зі своєю тактикою напористої ранньої гри, вже встигла розтрощити всі надії чималої кількості команд нижньої сітки.",
      "Однак, на жаль для цієї команди та її шанувальників, у Team Spirit були власні плани щодо долі свого опонента в ранній грі: перший матч завершився доволі швидко з великою перевагою у золоті й убивствах, не залишивши Gaimin Gladiators шансів на відповідь. У другому матчі сили були рівнішими, і Gaimin Gladiators навіть мала невелику перевагу, але Team Spirit вдалося повністю домінувати в пізній грі — так рахунок серії став 2:0. ",
      "Gaimin Gladiators не мали наміру здаватися без бою та перемагали на початку третього матчу (на 30-ту хвилину навіть розрахунок Dota Plus показував, що вони мають 96% шансу на перемогу, яка б дозволила їм зіграти ще 4-й матч), але рух, бачення й координація дій Team Spirit виявилися сильнішими за будь-які прогнози. У результаті Team Spirit переконливо перемогли в ґранд-фіналі з рахунком 3:0 і вдруге отримали Еґіду за три роки поспіль, а їхній гравець центральної лінії — «Larl» — уперше потрапив до клубу чемпіонів. Завдяки неймовірним особистим якостям і зірковій командній грі Team Spirit закріпила за собою місце в історії Dota 2 як чемпіонів The International 2023.",
      "Імена цих остаточних переможців назавжди залишаться на Еґіді чемпіонів — абсолютному символі перемоги. Ось вони:",
      "[b]2023 — Team Spirit[/b]",
      "[list]",
      "[*] Ілля «Yatoro雨» Мулярчук",
      "[*] Дєніс «Larl» Сігітов",
      "[*] Магомед «Collapse» Халілов",
      "[*] Мирослав «Mira» Колпаков",
      "[*] Ярослав «Miposhka» Найденов",
      "[/list]",
      "[b]Озираючись назад[/b]",
      "Якщо ви пропустили щось на турнірі або просто бажаєте повторно переглянути найзахопливіші моменти, перейдіть до [url=https://www.youtube.com/user/dota2]YouTube-каналу Dota 2[/url], де можна знайти повтори всіх матчів, зокрема трансляції між матчами. А на сторінках Dota 2 в [url=https://www.instagram.com/dota2]Instagram[/url] і [url=https://www.flickr.com/photos/dota2ti/]Flickr[/url] можна знайти безліч фотографій із турніру.",
      "Ми хотіли б подякувати гравцям, талантам і всім у спільноті Dota за те, що допомогли втілити це свято в життя. The International — це завершальний етап змагального сезону. Без вашої підтримки він би ніколи не відбувся. Сподіваємося, що вам сподобався цьогорічний турнір не менше, ніж нам.",
      "[b]Вшанування чемпіонів[/b]",
      "Уже можна придбати капсули з наліпками спеціального чемпіонського видання Team Spirit. Кожна капсула містить одну наліпку з Yatoro 雨, Larl, Collapse, Mira, Miposhka чи Team Spirit. 50% від продажів буде перераховано безпосередньо Team Spirit.",
      "[b]Компендіум The International[/b]",
      "Досі не виконали всі випробування? Не отримали всі нагороди за компендіум The International 2023? Не панікуйте. У вас ще є два тижні, щоб це зробити: компендіум буде діяти до 16 листопада. Застосуйте одну зі своїх нових улюблених стратегій, яку підгледіли на TI, — і завершите все тільки так!"
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}