{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "De grote kampioenen van The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "De grote kampioenen van The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Wij feliciteren Team Spirit, de grote kampioenen van The International 2023 en daarmee het tweede team ooit dat de Aegis twee keer mocht opeisen. Dit beruchte vijftal verloor slechts twee wedstrijden in het hele toernooi en bekroonde hun prestaties met een beslissende 3-0 overwinning in de finale, waarmee ze hun plaats als beste Dota-team ter wereld wisten veilig te stellen.",
      "[b]De groepsfase van De weg naar The International 2023[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]De weg naar The International[/url] begon met een overdonderende 8-0 zege van Spirit: ze stapelden in de groepsfase hun 2-0 overwinningen op tegen 9pandas, SMG, Entity en Evil Geniuses. De plaatsingsronde verliep op dezelfde manier. Team Spirit moest wat vroege missers incasseren in de eerste wedstrijd tegen Shopify Rebellion, maar kon daarna met een 2-0 overwinning hun weg naar de play-offs voortzetten.",
      "[b]De play-offs van De weg naar The International 2023[/b]",
      "Voor Team Spirit was dit meteen de eerste grote test van het toernooi: Virtus.pro behaalde een snelle winst in de eerste wedstrijd en zat daarmee Spirit op de hielen. De volgende wedstrijd werd een bloederige bedoening waarin Spirit een mooie voorsprong ook weer verloor, en uiteindelijk toch de overwinning en een derde wedstrijd kon afdwingen. VP slaagde er 30 minuten lang in de wedstrijd te domineren, helaas zonder hun voorsprong te verzilveren. Hierna nam Spirit de controle van de wedstrijd weer over en zette de knijptang op VP. Spirit bezegelde de serie met een late teamuitroeiing van VP: het pad naar het hoofdpodium van de Climate Pledge Arena lag nu wijd open.",
      "[b]The International[/b]",
      "De eerste tegenstander van Team Spirit op het hoofdpodium van de Arena was het ijzersterke Team Liquid. Na een hartverscheurend aantal keer tweede te eindigen, wilden ze daar nu dringend verandering in brengen. In de eerste wedstrijd moesten zowel de supports als de cores van Liquid het ontgelden, maar het team vocht terug en wist een spectaculaire overwinning te behalen in de tweede wedstrijd. Liquid wist een kleine voorsprong te behouden tot de helft van de derde wedstrijd, maar daarna sloeg de balans om. Spirit stapelde het aantal kills snel op en begon te bouwen aan een niet in te halen voorsprong. Ze wonnen de beslissende wedstrijd en bepaalden daarmee de opstelling voor de volgende ronde: een knallende confrontatie met de krachtpatsers van LGD Gaming, die tot dan toe nog maar één wedstrijd verloren hadden.",
      "De eerste wedstrijd was een ware knokpartij van 76 minuten. LGD was vroeg in de wedstrijd agressief, maar Team Spirit hield goed stand en wist daarna de controle over de wedstrijd in handen te krijgen. LGD bleef steeds terugvechten, maar Spirit maakte korte metten met hun kansen en bezorgde LGD hun eerste verlies op het hoofdpodium. De tweede wedstrijd verliep vanaf het begin in het voordeel van Spirit. Ze bleven hun voorsprong gestaag uitbouwen en LGD kon uiteindelijk niet anders dan opgeven. Na een teleurstellend optreden in Singapore in 2022, was Team Spirit dit jaar in topvorm en lieten ze er geen twijfel over bestaan dat niets ze zou weerhouden van de grote finale.",
      "Hun tegenstanders waren de altijd gevaarlijke Gaimin Gladiators. Een team dat dit jaar ijzersterk was tijdens de Major-toernooien en dat al veel teams in de verliezersronde naar huis had gestuurd dankzij hun speltactiek om vroeg in het spel de harde confrontaties niet uit de weg te gaan.",
      "Helaas voor Gaimin en hun fans, was Team Spirit ook vastberaden om de winst op hun naam te schrijven en wisten ze de eerste wedstrijd vrij snel te winnen. Met veel meer goud en kills aan de kant van Team Spirit, kreeg GG gewoon geen kans meer om terug te komen. Bij de tweede wedstrijd liepen beide teams iets gelijker op en kreeg Gaimin Gladiators de kans om af en toe een kleine voorsprong op te bouwen, totdat Team Spirit helemaal loskwam en het eind van het spel volledig domineerde. Zo kwam de stand op een overtuigende 2-0. ",
      "Maar Gaimin Gladiators gaf de strijd niet op en kreeg vroeg in de derde wedstrijd de leiding in handen. Na 30 minuten dacht Dota Plus zelfs dat GG 95% kans had om een vierde wedstrijd af te dwingen ... maar het samenspel, de visie en teamcoördinatie van Team Spirit zorgden ervoor dat die 5% kans werd omgetoverd in een geweldige comeback. Ze walsten volledig over GG heen en wonnen met 3-0 de grote finale, waarmee ze voor de tweede keer in drie jaar de Aegis wisten te bemachtigen én waarmee Larl, die op het middelste pad te vinden is, werd ingehuldigd in de kampioensclub. Dankzij hun ongelofelijke individuele talenten en hun schitterende teamwork, kon Team Spirit hun plek in de geschiedenis van Dota 2 definitief opeisen als het overwinnende team op The International 2023.",
      "Als het ultieme symbool van hun overwinning zullen deze namen voor altijd in de Aegis of Champions worden gegraveerd:",
      "[b]2023 - Team Spirit[/b]",
      "[list]",
      "[*] Ilya 'Yatoro雨' Mulyarchuk",
      "[*] Denis 'Larl' Sigitov",
      "[*] Magomed 'Collapse' Khalilov",
      "[*] Miroslav 'Mira' Kolpakov",
      "[*] Yaroslav 'Miposhka' Naidenov",
      "[/list]",
      "[b]Terugblik[/b]",
      "Als je een gedeelte van het toernooi hebt gemist of gewoon nog eens wilt nagenieten van alle ongelofelijke momenten en actie, ga dan naar het [url=https://www.youtube.com/user/dota2]YouTube-kanaal van Dota 2[/url], waar je herhalingen kunt vinden van het hele toernooi, inclusief de uitzendingen tussen de wedstrijden. Je kunt ook een overzicht vinden van de vele foto's van het evenement op onze [url=https://www.instagram.com/dota2]Dota 2-Instagram[/url] en [url=https://www.flickr.com/photos/dota2ti/]Dota 2-flickr[/url].",
      "We willen graag alle spelers, al het talent en de hele Dota-community bedanken voor hun bijdrage om dit evenement tot een groot feest te maken. The International is de bekroning van het competitieseizoen en dit was allemaal niet mogelijk geweest zonder jullie steun. We hopen dat jullie net zoveel van het toernooi hebben genoten als wij.",
      "[b]Vier de kampioenen[/b]",
      "Er zijn nu speciale capsules met kampioensstickers te koop voor Team Spirit. In iedere capsule vind je een sticker met Yatoro雨, Larl, Collapse, Mira, Miposhka of alle leden van Team Spirit erop. 50% van de opbrengst gaat rechtstreeks naar Team Spirit.",
      "[b]Compendium van The International[/b]",
      "Heb je nog een paar uitdagingen en beloningen te gaan in het compendium voor The International van 2023? Geen zorgen. Je hebt nog twee weken om al je doelen te bereiken voordat het compendium op 16 november wordt afgesloten. Probeer eens een paar nieuwe strategieën die je van de TI hebt afgekeken en je hebt de buit gegarandeerd snel binnen."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "3731854745514680600",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}