{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "The International – Οι Μεγάλοι Πρωταθλητές",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International – Οι Μεγάλοι Πρωταθλητές",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Συγχαρητήρια στους Team Spirit, τους Μεγάλους Πρωταθλητές του The International 2023 και τη δεύτερη μόλις ομάδα που κατάφερε να κατακτήσει δύο φορές το Aegis of Champions. Η τρομερή πεντάδα έχασε μόνο δύο παιχνίδια καθ' όλη τη διάρκεια του τουρνουά και τερμάτισε με καθοριστική νίκη 3-0 στον Μεγάλο Τελικό, με την οποία εδραίωσε τη θέση της ως η καλύτερη ομάδα Dota στον κόσμο.",
      "[b]Ο δρόμος προς το The International – Φάση Ομίλων[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Ο δρόμος προς το The International[/url] ξεκίνησε με ένα θεαματικό 8-0 από τους Team Spirit, καθώς η ομάδα κέρδισε 2-0 τους 9pandas, SMG, Entity και Evil Geniuses στη Φάση Ομίλων. Ο επόμενος γύρος δεν είχε διαφορά, καθώς οι Team Spirit υπέστησαν μερικές απώλειες νωρίς στο πρώτο παιχνίδι με τους Shopify Rebellion, αλλά ανέτρεψαν τα δεδομένα με μία ακόμα νίκη 2-0, στο δρόμο τους για τα Πλέι-οφ.",
      "[b]Ο δρόμος προς το The International – Πλέι-οφ[/b]",
      "Εκεί, αντιμετώπισαν την πρώτη τους μεγάλη δοκιμασία του τουρνουά, καθώς οι Virtus.pro κατόρθωσαν μια γρήγορη νίκη στο πρώτο παιχνίδι και έφεραν τους Team Spirit προ της ήττας. Ο επόμενος αγώνας ήταν μια αιματηρή μάχη, όπου οι Team Spirit πήραν αλλά τελικά έχασαν ένα σημαντικό προβάδισμα, πριν ανακτήσουν ξανά την ορμή τους και πάνε σε τρίτο παιχνίδι. Οι VP κατόρθωσαν να κρατήσουν τον αγώνα αμφίρροπο για 30 λεπτά, παρότι δεν πήραν ποτέ το προβάδισμα. Όταν όμως οι Team Spirit πήραν τον έλεγχο, στρίμωξαν τους VP στον χάρτη και σφράγισαν το σερί, εξαλείφοντας την ομάδα στο τέλος του παιχνιδιού. Έτσι, μπόρεσαν να ξεκουραστούν λίγο, πριν συνεχίσουν την πορεία τους στην κύρια εκδήλωση του Climate Pledge Arena.",
      "[b]The International[/b]",
      "Ο πρώτος αντίπαλος των Team Spirit στην κύρια εκδήλωση ήταν οι πολύ αποδοτικοί Team Liquid, οι οποίοι ήθελαν να χαράξουν τη δική τους μεγάλη πορεία προς τους τελικούς και να σπάσουν την κατάρα της δεύτερης θέσης. Οι Team Spirit δεν άφησαν σε ησυχία τους παίκτες υποστήριξης των Team Liquid και τραμπούκισαν τους παίκτες πυρήνα τους στο πρώτο παιχνίδι, κάτι που τους χάρισε τη νίκη, αλλά οι Team Liquid πολέμησαν θεαματικά και κέρδισαν το δεύτερο παιχνίδι. Έπειτα, οι Team Liquid κατόρθωσαν ίσα ίσα ένα μικρό προβάδισμα στη μέση του τρίτου παιχνιδιού, αλλά οι Team Spirit ξεπέρασαν τη διαφορά σκοτωμών και έχτισαν το δικό τους ανυπέρβλητο προβάδισμα, κερδίζοντας τον καθοριστικό αγώνα και θέτοντας τα θεμέλια για τη σύγκρουσή τους με τους πανίσχυρους LGD Gaming, μια τρομερή ομάδα που είχε χάσει και αυτή μόνο έναν αγώνα μέχρι εκείνη τη στιγμή στο τουρνουά.",
      "Το πρώτο παιχνίδι ήταν μια ατελείωτη μάχη 76 λεπτών. Οι LGD ξεκίνησαν δυναμικά, αλλά οι Team Spirit τους συγκράτησαν και τελικά επικράτησαν. Οι LGD προσπαθούσαν συνεχώς να επανέλθουν, αλλά οι Team Spirit έκοψαν τα φτερά τους και προκάλεσαν την πρώτη ήττα των LGD στην κύρια εκδήλωση. Το δεύτερο παιχνίδι φάνηκε από την αρχή ότι άνηκε στους Team Spirit, καθώς έχτισαν σταθερά το προβάδισμά τους και ανάγκασαν τους LGD να παραδοθούν. Μετά από μια απογοητευτική εμφάνιση στη Σιγκαπούρη το 2022, οι Team Spirit έδειξαν ότι ανέκτησαν τη φόρμα τους, καθώς μπήκαν με τα μπούνια στους Μεγάλους Τελικούς.",
      "Οι αντίπαλοί τους ήταν οι επικίνδυνοι Gaimin Gladiators, η πεντάδα που σάρωσε τα φετινά τουρνουά Major και διέλυσε τις ελπίδες πολλών ομάδων του Κάτω Ομίλου με τις τακτικές πίεσής της.",
      "Δυστυχώς για τους Gaimin Gladiators και τους φαν τους, οι Team Spirit ήθελαν και αυτοί να αποτελειώσουν τους εχθρούς τους. Κέρδισαν το πρώτο παιχνίδι αρκετά γρήγορα, χτίζοντας ένα τεράστιο προβάδισμα χρυσού και σκοτωμών που δεν άφηνε κανένα περιθώριο ανατροπής στους GG. Το δεύτερο παιχνίδι ήταν πιο αμφίρροπο, με τους Gaimin Gladiators να κερδίζουν μερικά μικρά προβαδίσματα, μέχρι που οι Team Spirit έκαναν την ανατροπή και κυριάρχησαν στο τέλος του παιχνιδιού, με προβάδισμα 2-0. ",
      "Οι Gaimin Gladiators δεν παρέδωσαν τα όπλα και κατάφεραν να επικρατήσουν από νωρίς στο τρίτο παιχνίδι. Μέχρι το 30ο λεπτό, ακόμα και το Dota+ πίστευε ότι οι GG έχουν 95% πιθανότητα να πάνε σε τέταρτο παιχνίδι… αλλά με τις κινήσεις, την όραση και τον συντονισμό τους, οι Team Spirit άδραξαν την ευκαιρία του 5% και τη μετέτρεψαν σε μια συγκλονιστική ανατροπή, ισοπεδώνοντας τους GG με 3-0 στους Μεγάλους Τελικούς και εξασφαλίζοντας το δεύτερο Aegis of Champions σε τρία χρόνια. Επίσης, καλωσόρισαν τον παίκτη μέσης τους, τον Larl, στο κλαμπ των πρωταθλητών. Μέσα από το απίστευτο ατομικό ταλέντο και την εκπληκτική ομαδική συνεργασία, οι Team Spirit εδραίωσαν τη θέση τους στην ιστορία του Dota 2 ως η τελευταία ομάδα που παρέμεινε στο The International 2023.",
      "Έχοντας κατακτήσει το απόλυτο σύμβολο της νίκης, τα ονόματά τους θα χαραχτούν για πάντα πάνω στο Aegis of Champions:",
      "[b]2023 – Team Spirit[/b]",
      "[list]",
      "[*] Illya «Yatoro雨» Mulyarchuk",
      "[*] Denis «Larl» Sigitov",
      "[*] Magomed «Collapse» Khalilov",
      "[*] Myroslav «Mira» Kolpakov",
      "[*] Yaroslav «Miposhka» Naidenov",
      "[/list]",
      "[b]Αναδρομή[/b]",
      "Αν χάσατε μέρος του τουρνουά ή απλά θέλετε να ξαναζήσετε τις απίστευτες στιγμές και τους αγώνες, μεταβείτε στο [url=https://www.youtube.com/user/dota2]YouTube του Dota 2[/url], για να βρείτε επαναλήψεις ολόκληρου του τουρνουά, συμπεριλαμβανομένου του περιεχομένου μεταξύ παιχνιδιών. Μπορείτε επίσης να βρείτε ένα σύνολο φωτογραφιών από τη διοργάνωση στο [url=https://www.instagram.com/dota2]Instagram του Dota 2[/url] και στο [url=https://www.flickr.com/photos/dota2ti/]flickr του Dota 2[/url].",
      "Θα θέλαμε να ευχαριστήσουμε όλους τους παίκτες, τα ταλέντα και όλα τα μέλη της Κοινότητας Dota που βοήθησαν για άλλη μία φορά να πραγματοποιηθεί αυτός ο εορτασμός. Το The International είναι η κορυφαία στιγμή της ανταγωνιστικής σεζόν και, χωρίς την υποστήριξη όλων, δεν θα ήταν δυνατή η πραγματοποίησή του. Ελπίζουμε να απολαύσατε το φετινό τουρνουά όσο και εμείς.",
      "[b]Τιμήστε τους πρωταθλητές[/b]",
      "Οι κάψουλες αυτοκόλλητων ειδικής έκδοσης πρωταθλητών είναι διαθέσιμες για αγορά για τους Team Spirit. Κάθε κάψουλα περιέχει ένα αυτοκόλλητο με τους Yatoro雨, Larl, Collapse, Mira, Miposhka ή τους Team Spirit. Το 50% όλων των πωλήσεων πηγαίνει απευθείας στους Team Spirit.",
      "[b]Το Compendium του The International[/b]",
      "Σας απομένουν ακόμα προκλήσεις και ανταμοιβές στο Compendium του The International 2023; Μην πανικοβάλλεστε. Έχετε ακόμα δύο εβδομάδες για να πετύχετε τους στόχους σας, πριν ολοκληρωθεί το Compendium στις 17 Νοεμβρίου. Αξιοποιήστε μερικές από τις αγαπημένες νέες στρατηγικές που μάθατε από το TI και θα τα καταφέρετε στο άψε σβήσε."
    ],
    "commentcount": 588,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20877,
    "votedowncount": 1657,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1708463138,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20877,
  "votes_down": 1657,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}