{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Wielcy mistrzowie The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Wielcy mistrzowie The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Gratulacje dla Team Spirit, wielkich mistrzów The International 2023 i jednocześnie dopiero drugiej drużyny w historii, która zdobyła Egidę dwukrotnie. Ta siejąca postrach ekipa przegrała zaledwie 2 mecze podczas całego turnieju, kończąc z decydującym wynikiem 3:0 podczas swojego występu w wielkim finale, który zapewnił jej tytuł najlepszej drużyny w Dota 2 na świecie.",
      "[b]Droga do The International – faza grupowa[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Droga do The International[/url] rozpoczęła się pokazem dominacji ze strony Team Spirit z wynikiem 8:0, kiedy to zgarnęli serię zwycięstw z wynikiem 2:0 w fazie grupowej przeciwko 9Pandas, Team SMG, Entity oraz Evil Geniuses. Runda rozstawienia niczym się nie różniła, bo Team Spirit przetrzymało nieco cięgów od Shopify Rebellion we wczesnej fazie gry nr 1, zanim zwycięsko odmaszerowało z kolejną serią zakończoną wynikiem 2:0 na swojej drodze do play-offów.",
      "[b]Droga do The International – play-offy[/b]",
      "Podczas tego etapu drużyna TS stawiła czoła pierwszemu poważnemu wyzwaniu turnieju, kiedy to Virtus.pro zgarnęło szybkie zwycięstwo w grze nr 1 i dla odmiany postawiło TS na gorszej pozycji, spowalniając ich marsz po zwycięstwo. Kolejny mecz był krwawą jatką, podczas której Team Spirit najpierw zdobyło, a następnie straciło znaczącą przewagę, jednak ostatecznie odzyskało impet i zmusiło drużyny do rozegrania gry nr 3. W decydującym meczu drużynie Virtus.pro udało się prowadzić równą grę przez 30 minut, mimo że ani razu nie wyszli na prowadzenie. Jednakże potem Team Spirit przejęło kontrolę, zgniatając VP i zapewniając sobie zwycięstwo zabójstwem całej ich drużyny w późnej fazie gry, co pozwoliło TS udać się na zasłużony odpoczynek, by przygotować się do końcowego etapu turnieju, tym razem już na głównej scenie na Climate Pledge Arena.",
      "[b]The International[/b]",
      "Pierwszym przeciwnikiem Team Spirit na głównej scenie było nietracące ani na chwilę tchu Team Liquid, które chciało swoją własną długą serią zwycięstw wkroczyć do finałów, by przerwać rozpaczliwe pasmo wyników stawiających je na drugim miejscu. Team Spirit nękało graczy wsparcia Team Liquid i znęcało się nad ich graczami głównymi w wyraźnie jednostronnej pierwszej grze, ale Team Liquid w oszałamiający sposób stawiło opór i wywalczyło sobie zwycięstwo w drugim meczu. TL następnie wyszarpało niewielką przewagę w okolicy półmetka gry nr 3, jednak TS uporało się z niedoborem zabójstw i przejęło niezachwiane prowadzenie, prowadząc do zwycięstwa w decydującym meczu i przygotowując grunt pod starcie z mocarnym LGD Gaming – budzącym grozę składem, który do tej pory przegrał tylko jeden mecz.",
      "Pierwsza gra była 76-minutową rozróbą. Drużyna LGD Gaming z początku była agresywna, ale Team Spirit nie ustępowało na krok, z czasem przejmując kontrolę. LGD raz za razem dawał się we znaki, ale Team Spirit zniweczył ich szanse na zwycięstwo, przesądzając o pierwszej porażce LGD na głównej scenie. Druga rozgrywka od samego początku należała już do Team Spirit, które konsekwentnie powiększało swoją przewagę i zmusiło LGD Gaming do przyznania się do porażki. Po rozczarowującym występie w Singapurze w 2022 roku drużyna Team Spirit pokazała, że wróciła do szczytowej formy i szturmem wdarła się do wielkiego finału.",
      "Jej przeciwnikiem było groźne Gaimin Gladiators, czyli ekipa, która wyrżnęła w pień konkurencję podczas tegorocznych Majorów, a której brawurowa i bezpardonowa taktyka rozgrywki we wczesnych etapach meczów rozbiła w drobny mak nadzieje na wygraną wielu drużyn z dolnej drabinki.",
      "Niestety dla Gaimin Gladiators i ich fanów tak się nieszczęśliwie złożyło, że Team Spirit miało własne plany co do tego, jak szybko uporać się ze swoimi wrogami – udało się to TS dzięki stosunkowo szybkiej pierwszej grze, kiedy to zdobyli ogromną przewagę w złocie i liczbie zabójstw, co zamknęło Gaimin Gladiators wszelkie drogi na powrót do walki. W drugiej grze szala przechylała się na korzyść jednej i drugiej drużyny raz za razem – Gaimin Gladiators miało niewielką przewagę w kilku momentach aż do chwili, kiedy nastąpił przełom i Team Spirit zupełnie zdominowało późną fazę rozgrywki, w zdecydowany sposób zwiększając swoje prowadzenie w spotkaniu na 2:0. ",
      "Gaimin Gladiators nie zamierzało poddać się bez walki i we wczesnej fazie trzeciej rozgrywki uzyskało pewną przewagę. Przed wybiciem 30 minut na zegarze gry nawet Dota Plus przyznawała GG 95% szans na wymuszenie gry nr 4... Jednak dzięki swojemu poruszaniu się, wizji i koordynacji zespołowej TS wykorzystało pozostałe 5% i przekuło je w oszałamiający powrót na prowadzenie, masakrując GG z wynikiem 3:0 w wielkim finale i zapewniając sobie swoją drugą Egidę w ciągu ostatnich 3 lat oraz powitało swojego gracza środka, Larla, w klubie mistrzów. Dzięki wyjątkowemu talentowi poszczególnych graczy i wybitnej grze zespołowej Team Spirit zapisało swoją pozycję na kartach historii Dota 2 jako ostatnia drużyna stojąca zwycięsko na polu bitwy na The International 2023.",
      "Imiona, nazwiska i pseudonimy dzierżących ostateczny symbol zwycięstwa na zawsze pozostaną wyryte na Egidzie Czempionów.",
      "[b]2023 – Team Spirit:[/b]",
      "[list]",
      "[*] Ilja „Yatoro雨” Mularczuk,",
      "[*] Dienis „Larl” Sigitow,",
      "[*] Magomied „Collapse” Chaliłow,",
      "[*] Myrosław „Mira” Kołpakow,",
      "[*] Jarosław „Miposhka” Najdionow.",
      "[/list]",
      "[b]Spoglądając w przeszłość[/b]",
      "Jeśli przegapiliście którąkolwiek część turnieju lub po prostu pragniecie przeżyć te niesamowite chwile i rozgrywki na nowo, skierujcie się na [url=https://www.youtube.com/user/dota2]kanał Dota 2 na YouTube[/url], gdzie znajdziecie powtórki z całego turnieju, włączając w to zawartość transmisji obecną w przerwach między grami. Możecie także znaleźć zbiór zdjęć z zakończenia wydarzenia na kontach Dota 2 w serwisach [url=https://www.instagram.com/dota2]Instagram[/url] i [url=https://www.flickr.com/photos/dota2ti/]Flickr[/url].",
      "Chcielibyśmy podziękować wszystkim graczom, prezenterom i całej społeczności Dota 2 za wcielenie tej uroczystości w życie. The International to wydarzenie zwieńczające sezon rywalizacji, a bez wsparcia od wszystkich nie byłoby ono możliwe. Mamy nadzieję, że tegoroczny turniej przypadł wam do gustu równie mocno jak nam.",
      "[b]Niech żyją wielcy mistrzowie[/b]",
      "Pojemniki z naklejką ze specjalnej edycji mistrzów dla Team Spirit są już dostępne w sprzedaży. Każdy pojemnik zawiera jedną naklejkę przedstawiającą Yatoro雨, Larla, Collapse'a, Mirę, Miposhkę lub Team Spirit. 50% środków z każdej sprzedaży trafia bezpośrednio do Team Spirit.",
      "[b]Kompendium The International[/b]",
      "Czy nadal macie jakieś wyzwania do dokończenia i nagrody do odebrania z Kompendium The International 2023? Bez paniki. Macie dwa tygodnie na realizację swoich celów, zanim Kompendium zostanie zamknięte 16 listopada. Spróbujcie odwzorować wasze ulubione strategie rozgrywki z TI, a wszystko z waszej listy odhaczycie w mgnieniu oka."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}