{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "The International Şampiyonu",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "The International Şampiyonu",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "The International 2023 Şampiyonu ve Aegis'i iki kez kazanan ikinci takım olan Team Spirit'i tebrik ederiz. Bu korku veren takım tüm turnuva boyunca yalnızca iki maç kaybetti. Büyük Finali 3-0'lık belirleyici bir performansla tamamlayarak dünyanın en iyi Dota takımı olarak yerini garantiledi.",
      "[b]The International'a Doğru - Grup Aşaması[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]The International'a Doğru[/url], Team Sprit'in grup aşamasında 9Pandas, SMG, Entity ve Evil Geniuses'ı 2-0'lık serilerle yenerek 8-0'lık üstün bir skor elde etmesiyle başladı. Dağılım turu da farklı değildi. Team Spirit, birinci oyunda Shopify Rebellion'a karşı bazı erken kayıplar vermesine rağmen 2-0'lık bir seri zaferi daha kazanıp elemelere doğru ilerledi.",
      "[b]The International'a Doğru - Elemeler[/b]",
      "Elemelerde turnuvanın ilk büyük sınavıyla karşı karşıya kaldılar; Virtus.pro birinci oyunda hızlı bir galibiyet elde ederek Spirit'i değişiklik yapmaya zorladı. Sonraki maç, Spirit'in büyük bir farkla öne geçtikten sonra bu farkı kaybettiği, ardından ivmeyi geri kazanıp üçüncü oyunun oynanmasını sağladığı kanlı bir mücadeleydi. VP, hiç öne geçemese de maçı 30 dakika boyunca dengede tutmayı başardı, ancak bundan sonra Spirit kontrolü ele geçirdi. VP'ye fırsat vermeden seriyi uzun süren bir oyunun sonunda tüm takımı yok ederek kapattılar ve Climate Pledge Arena'daki ana sahneye çıkmadan önce dinlenmeyi hak ettiler.",
      "[b]The International[/b]",
      "Team Spirit'in ana sahnedeki ilk rakibi, güçlü ve istikrarlı bir şekilde ilerleyen Team Liquid oldu. Team Liquid finallerde başarılı olarak daha önce elde ettiği ikinciliklerin üzüntüsünü gidermek istiyordu. Team Spirit, birinci oyunda Liquid'in desteklerini bastırdı ve taşıyıcılarına zorbalık yaptı, ancak Liquid, muhteşem bir gösteriyle karşılık verdi ve ikinci oyunu kazandı. Liquid daha sonra üçüncü oyunun ortasında küçük bir fark yaratmayı başardı, ancak Spirit öldürme açığını kapattı ve kendi aşılmaz liderliğini oluşturarak güçlü LGD Gaming ile kapışmak üzere önemli bir galibiyet elde etti. Bu noktada, göz korkutucu bir kadrosu olan LGD Gaming de yalnızca tek bir maç kaybetmişti.",
      "Birinci maç 76 dakikalık bir mücadeleydi. LGD agresif başladı ancak Team Spirit sağlam durdu ve kontrolü ele almaya başladı. LGD öne geçmek için uğraşmaya devam etti ancak Spirit buna izin vermedi ve LGD'ye ana sahnedeki ilk yenilgisini yaşattı. İkinci oyun başından beri Spirit'indi çünkü avantajı sürekli korudular ve LGD'yi çekilmeye zorladılar. 2022'de Singapur'da hayal kırıklığı yaratan bir performansın ardından Team Spirit, Büyük Finallere girerken en iyi formuna kavuştuğunu gösterdi.",
      "Rakipleri, tehlikeli Gaimin Gladiators, bu yılın Major turnuvalarını silip süpüren ve oyunun erken safhalarındaki direkt taktikleriyle pek çok alt grup takımının umudunu yerle bir eden takımdı.",
      "Gaimin ve hayranları için üzücü olan, Team Spirit'in kısa sürede düşmanlarının işini bitirmek için kendi planlarının olmasıydı. Birinci oyunu nispeten hızlı bir maçla kazanıp büyük bir altın ve öldürme üstünlüğü elde ederek GG'nin geri dönüşü için hiçbir yol bırakmadılar. İkinci oyun daha çekişmeli bir mücadeleye sahne oldu. Gaimin Gladiators, küçük bir farkla öne geçti fakat Team Spirit ilerleyen safhalarda oyuna tamamen hakim oldu ve seride 2-0 öne geçti. ",
      "Gaimin Gladiators'ın savaşmadan pes etmeye niyeti yoktu ve üçüncü oyunu erkenden kontrol etmeye başladı. 30. dakikaya gelindiğinde Dota+ bile GG'nin dördüncü oyuna zorlamak için %95 şansa sahip olduğunu düşündü... Ancak Team Spirit'in hareketi, vizyonu ve takım koordinasyonu kalan %5 şansı değerlendirdi ve bunu çarpıcı bir geri dönüşe dönüştürerek GG'yi 3-0 mağlup etti. Üç yıl içinde ikinci Aegis'ini kazanan Team Spirit, orta kulvar oyuncusu Larl'ı da şampiyonlar kulübüne kabul etmiş oldu. Team Spirit, hem inanılmaz bireysel yetenekler hem de muhteşem takım oyunu sayesinde The International 2023'te ayakta kalan son takım olarak Dota 2 tarihindeki yerini sağlamlaştırdı.",
      "Zaferin nihai sembolünü kazanan takım üyelerinin adları sonsuza kadar Şampiyonların Kalkanı'nın üzerinde yer alacak:",
      "[b]2023 - Team Spirit[/b]",
      "[list]",
      "[*] Ilya \"Yatoro雨\" Mulyarchuk",
      "[*] Denis \"Larl\" Sigitov",
      "[*] Magomed \"Collapse\" Khalilov",
      "[*] Myroslav \"Mira\" Kolpakov",
      "[*] Yaroslav \"Miposhka\" Naidenov",
      "[/list]",
      "[b]Turnuvaya Genel Bakış[/b]",
      "Turnuvanın kaçırdığınız kısımları olduysa veya inanılmaz anları ve taktikleri tekrar izlemek istiyorsanız [url=https://www.youtube.com/user/dota2]Dota 2 YouTube kanalına[/url] giderek oyunlar arasındaki yayın içerikleri de dâhil olmak üzere turnuvanın tamamının tekrarlarını bulabilirsiniz. Ayrıca, [url=https://www.instagram.com/dota2]Dota 2 Instagram[/url] ve [url=https://www.flickr.com/photos/dota2ti/]Dota 2 flickr[/url] üzerinden etkinliğe ait çeşitli fotoğrafları bulabilirsiniz.",
      "Bu kutlamayı yeniden düzenlememize yardımcı oldukları için tüm oyunculara, katkıda bulunanlara ve Dota topluluğunun tüm üyelerine tekrar teşekkür ederiz. The International, rekabetçi sezonun en önemli etkinliğidir ve bu etkinliği herkesin desteği olmadan yapmamız mümkün olamazdı. Bu seneki turnuvadan en az bizim kadar keyif almış olduğunuzu umuyoruz.",
      "[b]Şampiyonların Anısına[/b]",
      "Team Spirit için özel Şampiyon sürümü çıkartma kapsülleri satışta. Her kapsülde Yatoro雨, Larl, Collapse, Mira, Miposhka veya Team Spirit'i içeren bir çıkartma bulunur. Satışlardan elde edilen gelirin %50'si doğrudan Team Spirit'e gider.",
      "[b]The International Dergisi[/b]",
      "The International 2023 Dergisinde hâlâ tamamlamanız gereken bazı mücadeleler ve almanız gereken ödüller mi var? Endişelenmeyin. Dergi 16 Kasım'da sona ermeden önce hedeflerinize ulaşmak için iki haftanız daha var. En sevdiğiniz yeni TI stratejilerinizi kullanın ve her şeyi kısa sürede tamamlayın."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}