{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Campioni del The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Campioni del The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Congratulazioni a Team Spirit, campioni del The International 2023 e seconda squadra a conquistare l'Egida per ben due volte. Questa temibile squadra ha perso solo due partite nell'intero torneo, finendo con una prestazione decisiva di 3-0 nella finalissima e assicurandosi il titolo di migliore squadra di Dota al mondo.",
      "[b]Il Cammino per il The International - Fase a gironi[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Il Cammino per il The International[/url] ha avuto inizio con una schiacciante vittoria per 8-0 di Team Spirit, che ha successivamente conseguito vittorie per 2-0 contro 9pandas, SMG, Entity e Evil Geniuses nella fase a gironi. Il round di piazzamento è stato simile e, sebbene Team Spirit abbia commesso alcuni errori iniziali nella prima partita contro Shopify Rebellion, è riuscita a farsi strada verso i playoff con un'altra vittoria per 2-0.",
      "[b]Il Cammino per il The International - Playoff[/b]",
      "Qui ha affrontato il primo grosso ostacolo del torneo, quando Virtus.pro ha ottenuto una rapida vittoria nella prima partita e, una volta tanto, ha messo Team Spirit alle strette. La partita successiva è stata una lotta all'ultimo sangue in cui Team Spirit ha inizialmente guadagnato e poi perso un vantaggio considerevole prima di recuperare terreno e vincere una terza partita. Sebbene non sia mai andata in vantaggio, Virtus.pro si è difesa con le unghie e con i denti per 30 minuti, fino a quando Team Spirit è riuscita a prendere il controllo del gioco spazzando via l'intera squadra alla fine della partita. Team Spirit, vittoriosa, si è poi goduta un meritato riposo prima di salire sul palco della Climate Pledge Arena per l'evento principale.",
      "[b]The International[/b]",
      "Il primo avversario di Team Spirit sul palco principale è stata la sempre fortissima Team Liquid, che stava cercando di arrivare alle finali per cancellare una straziante serie di secondi posti. Team Spirit ha soffocato i Support di Liquid e ha maltrattato i suoi Core nella prima partita, ma Liquid ha risposto con una prestazione magistrale vincendo la seconda partita. Liquid è poi riuscita a ottenere un piccolo vantaggio a metà della terza partita, ma Team Spirit ha superato il proprio deficit di uccisioni fino a costruire un insormontabile vantaggio, vincendo la partita decisiva per preparare il terreno per uno scontro con la potente LGD Gaming, una formazione temibile che fino a quel momento aveva perso una sola partita.",
      "La prima partita è stata una lotta durata 76 minuti. LGD è stata aggressiva sin dall'inizio, ma Team Spirit ha tenuto duro prima di iniziare a prendere il controllo. LGD ha provato più volte a riprendersi, ma Team Spirit non glielo ha permesso, infliggendole la prima sconfitta sul palco principale. Team Spirit ha dominato la seconda partita fin dall'inizio, aumentando costantemente il proprio vantaggio e costringendo LGD ad arrendersi. Dopo la prestazione deludente a Singapore nel 2022, Team Spirit ha dimostrato di aver riacquistato la massima forma irrompendo con decisione nella finalissima.",
      "Il suo avversario: la pericolosa Gaimin Gladiators, la squadra che ha vinto i tornei Major di quest'anno e le cui tattiche dirette a inizio partita avevano già infranto le speranze di molte squadre del girone inferiore.",
      "Purtroppo per Gaimin e i suoi fan, Team Spirit aveva un piano per sventare la loro strategia: ha accumulato vittime e oro senza indugio, non ha dato a GG alcuna possibilità di rimonta e ha chiuso la prima partita in un tempo relativamente breve. La seconda partita si è rivelata una sfida \"tira e molla\", con Gaimin Gladiators che ha ottenuto alcuni piccoli vantaggi prima che Team Spirit si scatenasse per dominare completamente la fine della partita e portarsi in vantaggio per 2-0. ",
      "Non intenzionata a cedere senza combattere, Gaimin Gladiators è riuscita a dominare l'inizio della terza partita. Nei primi 30 minuti, anche Dota+ pensava che GG avesse una probabilità del 95% di arrivare alla quarta partita... ma il movimento, la visione e la coordinazione di Team Spirit hanno trasformato quel 5% rimanente in una straordinaria rimonta, demolendo GG con 3-0 nella finalissima, assicurandosi la seconda Egida in tre anni e dando il benvenuto al Mid Larl nel club dei campioni. Grazie all'incredibile talento individuale e allo straordinario gioco di squadra, Team Spirit ha consolidato il proprio posto nella storia di Dota 2 come ultima squadra rimasta in gara al The International 2023.",
      "Come portatori del simbolo supremo della vittoria, questi nomi saranno per sempre incisi sull'Egida dei Campioni:",
      "[b]2023 - Team Spirit[/b]",
      "[list]",
      "[*] Illya \"Yatoro雨\" Mulyarchuk",
      "[*] Denis \"Larl\" Sigitov",
      "[*] Magomed \"Collapse\" Khalilov",
      "[*] Myroslav \"Mira\" Kolpakov",
      "[*] Yaroslav \"Miposhka\" Naidenov",
      "[/list]",
      "[b]Guardando al passato[/b]",
      "Se ti sei perso una parte del torneo o vuoi semplicemente rivivere i momenti e le giocate incredibili durante le partite, visita il [url=https://www.youtube.com/user/dota2]canale YouTube di Dota 2[/url], dove troverai l'intero torneo e tutti i contenuti trasmessi tra una partita e l'altra. Inoltre, puoi trovare una gran quantità di foto dell'evento sul [url=https://www.instagram.com/dota2]canale Instagram di Dota 2[/url] e sulla [url=https://www.flickr.com/photos/dota2ti/]pagina Flickr di Dota 2[/url].",
      "Vorremmo ringraziare tutti i giocatori, i talenti e tutta la comunità di Dota per aver contribuito a dare vita a questa celebrazione. Il The International è il momento più importante della stagione competitiva, e niente di tutto questo sarebbe possibile senza il sostegno di tutti. Ci auguriamo che ti sia divertito al torneo di quest'anno quanto noi.",
      "[b]Celebriamo i Campioni[/b]",
      "La serie speciale di adesivi dei Campioni per Team Spirit è ora disponibile per l'acquisto. Ogni capsula contiene un adesivo di Yatoro雨, Larl, Collapse, Mira, Miposhka o del Team Spirit al completo. Il 50% di tutte le vendite viene devoluto direttamente a Team Spirit.",
      "[b]Il Compendio del The International[/b]",
      "Hai ancora delle sfide da completare e delle ricompense da riscattare nel Compendio del The International 2023? Niente panico! Hai ancora due settimane di tempo per raggiungere i tuoi obiettivi, prima che il Compendio si concluda il 16 novembre. Tira fuori alcune delle tue nuove strategie del TI preferite e avrai tutto sotto controllo in un batter d'occhio."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}