{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Campeones absolutos de The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Campeones absolutos de The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Enhorabuena a Team Spirit, segundo equipo en conseguir la Égida por segunda vez y campeones absolutos de The International 2023. El temible equipo cedió tan solo dos partidas a lo largo de todo el torneo, rematándolo con un decisivo 3 a 0 en la gran final y garantizándose así el título de mejor equipo de Dota del mundo.",
      "[b]El camino a The International - Fase de grupos[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]El camino a The International[/url] comenzó con un aplastante 8‑0 por parte de Spirit, tras derrotar 2‑0 a 9pandas, SMG, Entity y Evil Geniuses en la fase de grupos. La ronda de clasificación fue bastante similar y, a pesar de los reveses iniciales contra Shopify Rebellion en la primera partida, Team Spirit terminó su trayectoria hacia las eliminatorias con otro 2‑0.",
      "[b]El camino a The International - Eliminatorias[/b]",
      "En esta fase, se enfrentaron al primer gran reto del torneo. Virtus.pro se hizo rápidamente con la victoria en la primera partida y puso por fin a prueba a Team Spirit. El siguiente encuentro fue un baño de sangre en el que Team Spirit consiguió una ventaja considerable, aunque luego terminó perdiéndola, y volvió a coger carrerilla hasta forzar una tercera partida. VP siguió el ritmo durante media hora, a pesar de no llegar nunca a colocarse en cabeza, hasta que Team Spirit tomó las riendas, asfixió a VP y cerró la serie liquidando al equipo en el último momento, lo cual les permitió disfrutar de un merecido descanso antes de que llegase su turno en el Climate Pledge Arena.",
      "[b]The International[/b]",
      "El primer contrincante de Team Spirit en el escenario principal fue el consagrado Team Liquid, que venía preparado para arrasar en su camino hacia la final y quitarse el mal sabor de boca de tantos segundos puestos. Team Spirit acosó a los apoyos de Team Liquid e intimidó a los jugadores principales, aplastándolos en la primera partida, pero Liquid se defendió con un juego espectacular hasta hacerse con la victoria en la segunda partida. Team Liquid consiguió hacerse con una pequeña ventaja hacia la mitad de la tercera partida, pero Team Spirit empezó a acumular víctimas, creando una delantera insuperable y haciéndose con la partida decisiva que sellaría el posterior enfrentamiento con el poderoso LGD Gaming, cuya temida plantilla solo había perdido una partida hasta ese momento.",
      "La primera partida se convirtió en una pelea de 76 minutos de duración. LGD empezó la partida de forma agresiva, pero Team Spirit no se amilanó y empezó a ponerse al mando. A pesar de seguir luchando, Spirit no lo permitió, y LGD tuvo que aceptar su primera derrota en el escenario principal. Team Spirit dominó la segunda partida desde el principio, haciéndose con la ventaja poco a poco hasta que LGD no tuvo más remedio que rendirse. Tras la decepcionante actuación del año pasado en Singapur, Team Spirit demostró volver a estar en plena forma plantándose en la gran final.",
      "Se enfrentaban a los peligrosos Gaimin Gladiators, equipo que arrasó en los majors de este año y cuyas atrevidas tácticas al inicio de las partidas habían destrozado ya las esperanzas de muchos equipos del grupo de perdedores.",
      "Por desgracia para Gaimin Gladiators y sus fans, Team Spirit no tenía intención de ponérselo fácil a sus enemigos y se hicieron bastante rápidamente con la primera partida, consiguiendo una delantera de oro y víctimas a la que GG simplemente no pudo hacer frente. La segunda partida estuvo más reñida, y Gaimin Gladiators se hizo con una pequeña delantera varias veces, pero Team Spirit terminó por dominar en los momentos finales hasta conseguir un contundente 2 a 0. ",
      "Gaimin Gladiators no podía rendirse tan fácilmente y dominó a sus rivales en la primera parte de la tercera partida. Al cabo de media hora, hasta Dota Plus creía que GG tenía un 95 % de posibilidades de forzar una cuarta partida, pero los desplazamientos, la visión y la coordinación de Team Spirit arrebataron el 5 % restante y lo convirtieron en una remontada impresionante, derribando a GG en la gran final con un 3‑0 que les garantizó su segunda Égida en tres años y la entrada del central Larl en el club de campeones. Gracias al impresionante talento individual y a un estelar juego en equipo, Team Spirit consolidó su puesto en la historia de Dota 2 como el mejor equipo de The International 2023.",
      "Como abanderados del símbolo supremo del triunfo, estos nombres quedarán inscritos para siempre en la Égida de los Campeones:",
      "[b]2023 - Team Spirit[/b]",
      "[list]",
      "[*] Illia «Yatoro雨» Muliarchuk",
      "[*] Denis «Larl» Sigitov",
      "[*] Magomed «Collapse» Khalilov",
      "[*] Myroslav «Mira» Kolpakov",
      "[*] Yaroslav «Miposhka» Naidenov",
      "[/list]",
      "[b]Momentos para el recuerdo[/b]",
      "Si te perdiste alguna parte del torneo o simplemente quieres revivir los increíbles momentos y jugadas, visita el [url=https://www.youtube.com/user/dota2]canal de Dota 2 en YouTube[/url], donde podrás encontrar repeticiones de todo el torneo, incluido el contenido retransmitido entre las partidas. También encontrarás un montón de fotos del evento en la cuenta de [url=https://www.instagram.com/dota2]Instagram de Dota 2[/url] y en el álbum de [url=https://www.flickr.com/photos/dota2ti/]flickr de Dota 2[/url].",
      "Nos gustaría dar las gracias a todos los jugadores, talentos e integrantes de la comunidad de Dota por ayudarnos a darle vida a este gran evento. The International es el momento culminante de la temporada competitiva y, sin todo vuestro apoyo, nada de esto sería posible. Esperamos que hayáis disfrutado del torneo de este año tanto como nosotros.",
      "[b]En honor a los campeones[/b]",
      "Ya está a la venta la edición especial de las cápsulas de pegatinas de los campeones, Team Spirit. Cada cápsula contiene una pegatina de Yatoro雨, Larl, Collapse, Mira, Miposhka o Team Spirit. El 50 % de todas las ventas se destina directamente a Team Spirit.",
      "[b]Compendio de The International[/b]",
      "¿Todavía te faltan desafíos por completar y recompensas que reclamar en el Compendio de The International 2023? No te agobies. El Compendio está disponible hasta el 16 de noviembre, así que tienes dos semanas más para conseguir tus objetivos. Pon en práctica lo que hayas aprendido durante The International y lo completarás todo en un periquete."
    ],
    "commentcount": 470,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 14641,
    "votedowncount": 1048,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1700130181,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 14641,
  "votes_down": 1048,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}