{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Los grandes campeones de The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Los grandes campeones de The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Felicidades a Team Spirit, campeones de The International 2023, siendo apenas el segundo equipo en conquistar la Égida por segunda vez. Este temible escuadrón solo perdió dos partidas en todo el torneo, terminando con un decisivo triunfo 3-0 en la Gran Final para asegurar su lugar como el mejor equipo de Dota del mundo.",
      "[b]El Camino a The International - Fase de grupos[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]El Camino a The International[/url] comenzó con un dominante 8-0 por parte de Spirit, mientras acumulaban victorias de 2-0 en sus series contras 9pandas, SMG, Entity y Evil Geniuses en la fase de grupos. La ronda de clasificaciones no iba a ser distinta, ya que Team Spirit tuvo que soportar algunos golpes tempranos por parte de Shopify Rebellion en la primera partida antes de marcharse con otra victoria 2-0 en su camino hacia las eliminatorias.",
      "[b]El Camino a The International - Eliminatorias[/b]",
      "Ahí, se enfrentaron a su primera prueba de importancia del torneo, mientras que Virtus.pro obtuvo una rápida victoria en la primera partida poniendo a Spirit en desventaja por primera vez. La siguiente partida fue un asunto sangriento en el que Spirit construyó y perdió una ventaja considerable antes de recuperar impulso para forzar una tercera partida. VP logró mantenerse durante 30 minutos, a pesar de nunca obtener una ventaja, pero después de eso, Spirit tomó el control, asfixiando a VP y sellando la serie con una barrida de equipo al final de la partida para ganar un merecido descanso antes de avanzar hacia el escenario principal en el Climate Pledge Arena.",
      "[b]The International[/b]",
      "El primer oponente de Team Spirit en el escenario principal fue el consistentemente fuerte Team Liquid, que buscaba abrirse paso hacia la final para borrar una racha desgarradora de resultados de segundo lugar. Team Spirit hostigó a los apoyos de Liquid y provocó a sus jugadores principales en una barrida en la primera partida, pero Liquid respondió con un rendimiento espectacular para ganar la segunda partida. Luego, Liquid se las ingenió para obtener una ligera ventaja por la senda central en la tercera partida, pero Spirit revirtió un déficit de víctimas para lograr una ventaja insuperable, ganando la partida decisiva y completar el escenario para un enfrentamiento con el poderoso LGD Gaming, con una intimidante alineación que apenas había perdido una sola de sus partidas hasta ese momento.",
      "La primera partida fue una batalla de 76 minutos. LGD fue agresivo desde el inicio, pero Team Spirit se mantuvo firme antes de empezar a tomar el control. LGD continuó luchando, pero Spirit anuló sus oportunidades, propinándole a LGD su primera derrota en el escenario principal. Team Spirit dominó la segunda partida desde el principio, obteniendo la ventaja poco a poco hasta que LGD no tuvo más remedio que rendirse. Después de una decepcionante participación en Singapur en 2022, Team Spirit demostró que estaba nuevamente en su mejor forma al abrirse paso hacia la Gran Final.",
      "Sus oponentes: los peligrosos Gaimin Gladiators, la escuadra que barrió este año con los torneos Major y cuyas tácticas de ataques directos desde el inicio del juego ya habían hecho pedazos las esperanzas de tantos equipos en el grupo perdedor.",
      "Desafortunadamente para Gaimin y sus fans, Team Spirit tenía sus propios planes para acabar con sus rivales; se impusieron en una relativamente rápida primera partida, acumulando grandes cantidades de oro y víctimas, de manera que a GG no le quedó ninguna posibilidad de recuperarse. La segunda partida estuvo más disputada, con Gaimin Gladiators obteniendo algunas pequeñas ventajas antes de que Team Spirit contraatacara para dominar completamente el final de la partida, obteniendo una ventaja de 2-0 en la serie. ",
      "Pero Gaimin Gladiators se mantuvo en la lucha y se las arregló para tomar el control de la tercera partida desde el inicio. Durante 30 minutos, hasta Dota+ pensaba que GG tenía un 95 % de posibilidades de pasar a una cuarta partida... pero el movimiento, la visión y la coordinación de equipo de Team Spirit tomó ventaja de ese 5 % de posibilidades y lo convirtió en una asombrosa recuperación, aplastando 3-0 a GG en la Gran Final para asegurar su segunda Égida en tres años y darle la bienvenida a su jugador de la senda central, Larl, al club de los campeones. Gracias a un increíble talento individual y a un juego en equipo estelar, Team Spirit se aseguró su lugar en la historia de Dota 2 como el último equipo en pie en The International 2023.",
      "Como portadores del símbolo definitivo de la victoria, sus nombres estarán grabados para siempre en la Égida de los Campeones:",
      "[b]2023 - Team Spirit[/b]",
      "[list]",
      "[*] Illya \"Yatoro雨\" Mulyarchuk",
      "[*] Denis \"Larl\" Sigitov",
      "[*] Magomed \"Collapse\" Khalilov",
      "[*] Myroslav \"Mira\" Kolpakov",
      "[*] Yaroslav \"Miposhka\" Naidenov",
      "[/list]",
      "[b]Una mirada hacia el pasado[/b]",
      "Si te perdiste de alguna parte del torneo o simplemente quieres revivir las jugadas y los momentos increíbles, visita el [url=https://www.youtube.com/user/dota2]canal de YouTube de Dota 2[/url], donde podrás encontrar las grabaciones del torneo completo, incluyendo el contenido de retransmisión entre las partidas. También puedes encontrar muchísimas fotografías del evento en el [url=https://www.instagram.com/dota2]Instagram de Dota 2[/url] y en el álbum de [url=https://www.flickr.com/photos/dota2ti/]flickr de Dota 2[/url].",
      "Queremos agradecer a todos los jugadores, talentos y a toda la comunidad de Dota por ayudarnos a darle vida a esta celebración. The International es el momento culminante de la temporada competitiva y nada de esto sería posible sin todo el apoyo recibido. Esperamos que hayas disfrutado del torneo de este año tanto como nosotros.",
      "[b]Celebrando a los campeones[/b]",
      "Las cápsulas de calcomanías de la edición especial de los campeones de Team Spirit ya están a la venta. Cada cápsula contiene una calcomanía de Yatoro雨, Larl, Collapse, Mira, Miposhka o de Team Spirit. El 50 % de las ventas van directamente para Team Spirit.",
      "[b]Compendio de The International[/b]",
      "¿Aún te quedan retos por completar y recompensas que reclamar en el Compendio de The International 2023? No entres en pánico. Tienes dos semanas más para cumplir tus objetivos antes de que se cierre el Compendio el 16 de noviembre. Pon en práctica algunas de tus estrategias favoritas aprendidas durante The International y lo completarás en muy poco tiempo."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "3731854745514680600",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}