{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "The International -mestarit",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "The International -mestarit",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Onnittelut The International 2023 -turnauksen voittajalle, Team Spiritille. Se on kautta aikain toinen joukkue, joka on napannut TI-voiton kahteen kertaan. Team Spiritin hurja kokoonpano hävisi turnauksen aikana vain kaksi peliä, nappasi finaalissa voiton tuloksella 3–0 ja todisti olevansa maailman paras Dota-joukkue.",
      "[b]Road to The International – lohkovaihe[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Road to The International[/url] käynnistyi Team Spiritin voittoputkella. 9pandas, SMG, Entity ja Evil Geniuses saivat tuta, kun Team Spirit päihitti ne tuloksin 2–0. Sijoituskierros jatkui samaa rataa. Shopify Rebellion oli aluksi kova vastus, mutta Team Spirit nappasi lopulta jälleen voiton kotiin tuloksella 2–0.",
      "[b]Road to The International – pudotuspelit[/b]",
      "Pudotuspeleissä Team Spirit joutui ensimmäistä kertaa kova kovaa vastaan, kun Virtus.pro nappasi ensimmäisen pelin voiton ja pakotti Spiritin panemaan taktiikan uusiksi. Toinen ottelu oli kamppailujen kamppailu. Team Spirit oli ensin johtoasemissa, joutui sitten altavastaajaksi ja teki ihmepaluun, nappasi voiton ja siten kolmannen pelin Virtus.prota vastaan. Kolmannessa ottelussa VP ei saanut napattua johtoasemaa, mutta onnistui pelaamaan melkein puoli tuntia, ennen kuin Spirit hyppäsi puikkoihin. Se päihitti Virtus.pron, päätti sarjan joukkuetapolla ja sai ansaitun tauon ennen Climate Pledge Arenan päälavalle astumista.",
      "[b]The International[/b]",
      "Team Spiritin ensimmäinen vastustaja päälavalla oli vahvuudestaan tunnettu Team Liquid, joka havitteli finaalipaikkaa pitkän kakkossijaputken päätteeksi. Team Spirit piinasi Liquidin support- ja core-sankareita voitokkaassa ensimmäisessä ottelussa, mutta Liquid näytti kyntensä ja vei kakkospelin kotiin. Liquid onnistui saamaan pienen johdon kolmannen pelin puolivälissä, mutta Spirit taisteli entistä urheammin alakynnestä huolimatta ja siirtyi ylivoimaiseen johtoon. Se voitti ratkaisevan ottelun ja jatkoi matkaansa. Seuraavana vastassa oli LGD Gaming, kova kokoonpano, joka oli siihen mennessä hävinnyt vasta yhden ottelun.",
      "Ensimmäinen peli oli 76 minuuttia kestävä kahakka. LGD oli aluksi iskussa, mutta Team Spirit piti pintansa ja siirtyi etuasemiin. LGD oli kovana ja pysyi pelissä, mutta Spirit teki toiveista tyhjää ja tarjoili LGD:lle ensimmäisen tappion päälavalla. Spirit johti kakkospeliä ensimetreistä ja jyräsi tasatahtia eteenpäin, kunnes LGD lopulta luovutti. Singaporessa edellisvuonna pettynyt Team Spirit todisti olevansa huippuvedossa ja nappasi finaalipaikan.",
      "Vaarallinen vastustajajoukkue, Gaimin Gladiators oli vetänyt voittoputken majoreissa ja nostanut alemmassa lohkossa jo monen joukkueen tien pystyyn määrätietoisella taktiikallaan.",
      "Gaimin Gladiators -fanien ikäväksi Team Spiritillä oli omat suunnitelmansa. Se teki vihollisista selvää keräämällä valtavat määrät kultaa ja tappoja. GG oli neuvoton, ja Spirit vei ensimmäisen ottelun voiton. Toinen peli oli tasavertaisempi. Gaimin Gladiators onnistui olemaan välillä johtoasemissa, ennen kuin Team Spirit jyräsi loppupelin ja nappasi toisen otteluvoiton. ",
      "Gaimin Gladiators ei antautunut suosiolla, vaan otti alussa kolmannen ottelun haltuunsa. 30 minuutin kohdalla jopa Dota Plus uskoi, että Gaimin Gladiatorseilla oli 95 %:n mahdollisuus voittoon ja siten neljänteen otteluun. Mutta Team Spiritin vauhti, visio ja koordinointi tuhosivat GG:n mahdollisuudet uskomattomalla vastaiskulla. Team Spirit voitti finaalin 3–0 ja nappasi Mestareiden merkin jo toisen kerran kolmen vuoden sisään, ja keskilinjaa pelannut Larl liittyi Dota-mestareiden joukkoon. Team Spiritin erinomaiset yksilösuoritukset ja loistava tiimipeli vahvistivat joukkueen paikan Dota 2 -historiassa vuoden 2023 The Internationalin voittajana.",
      "Mestareiden merkkiin kirjataan ikiajoiksi seuraavat voittajien nimet:",
      "[b]2023 – Team Spirit[/b]",
      "[list]",
      "[*] Ilya \"Yatoro雨\" Mulyarchuk",
      "[*] Denis \"Larl\" Sigitov",
      "[*] Magomed \"Collapse\" Khalilov",
      "[*] Myroslav \"Mira\" Kolpakov",
      "[*] Yaroslav \"Miposhka\" Naidenov",
      "[/list]",
      "[b]Katsaus menneeseen[/b]",
      "Jos osa turnauksesta meni ohi tai haluaisit kokea jännittävät hetket ja huimat pelit uudelleen, mene [url=https://www.youtube.com/user/dota2]Dota 2:n YouTube-kanavalle[/url], josta löytyvät sekä koko turnaus että lähetykset pelien välissä. Kuvia tapahtumasta löytyy Dota 2:n [url=https://www.instagram.com/dota2]Instagramista[/url] ja [url=https://www.flickr.com/photos/dota2ti/]flickristä[/url].",
      "Haluamme kiittää kaikkia pelaajia, juontajia ja Dota-yhteisön jäseniä mahtavan tapahtuman toteutumisesta. The International on kisakauden kruunaus, joka ei olisi mahdollista ilman jokaisen tukea. Toivottavasti nautit tämän vuoden turnauksesta yhtä paljon kuin me.",
      "[b]Mestareiden kunniaksi[/b]",
      "Team Spirit -tarrakapselien mestaruusversiot ovat nyt ostettavissa. Jokainen kapseli sisältää yhden tarran (Yatoro雨, Larl, Collapse, Mira, Miposhka tai Team Spirit). Puolet tuotoista menee suoraan Team Spiritille.",
      "[b]The International -turnauskirja[/b]",
      "Jäikö The International 2023 -turnauskirjasta haasteita tekemättä ja palkintoja lunastamatta? Ei huolta. Sinulla on vielä kaksi viikkoa aikaa suorittaa turnauskirjan tehtävät, ennen kuin se päättyy 16.11. Kokeile The Internationalista tuttuja strategioita, niin saat homman pakettiin tuossa tuokiossa."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "3731854745514680600",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}