{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Campeões do International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Campeões do International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Parabéns à Team Spirit, Grande Campeã do International 2023 e a segunda equipe a levantar a Égide mais de uma vez. Esse esquadrão temível perdeu apenas duas partidas em todo o torneio — terminando com um 3 a 0 decisivo na Grande Final para garantir o seu título de melhor equipe de Dota do mundo.",
      "[b]O Caminho para o International — Fase de Grupos[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]O Caminho para o International[/url] da Spirit começou com uma fase de grupos invicta, vencendo de 2 a 0 contra as equipes 9pandas, SMG, Entity e Evil Geniuses. A fase de chaveamento não foi diferente: a Team Spirit teve um início difícil na primeira partida contra a Shopify Rebellion, mas deu a volta por cima e avançou para o mata-mata com outra vitória de 2 a 0.",
      "[b]O Caminho para o International — Mata-Mata[/b]",
      "Lá, eles enfrentaram o seu primeiro grande teste do torneio, quando a Virtus.pro conquistou uma vitória rápida na primeira partida e enfim fez a Spirit sentir o gosto da desvantagem. A partida seguinte foi um banho de sangue, onde a Spirit criou uma liderança e sofreu um revés, mas conseguiu recuperar o ímpeto para forçar uma terceira partida. A VP conseguiu segurar as pontas na decisão por 30 minutos, apesar de nunca ter conquistado a liderança, mas logo depois a Spirit assumiu o controle, estrangulando a VP e encerrando a série com uma eliminação completa da equipe inimiga nos minutos finais da partida — conquistando um merecido descanso antes de continuarem a jornada no palco principal da Climate Pledge Arena.",
      "The International ",
      "A primeira adversária da Team Spirit no palco principal foi a consagrada Team Liquid, que buscava trilhar o seu próprio caminho até a final e dar fim a uma sequência dolorosa de vice-campeonatos. A Team Spirit atormentou os suportes e intimidou os demais jogadores da Liquid, levando a primeira partida nas costas, mas a Liquid revidou de forma espetacular e garantiu a segunda. Então, a Liquid conseguiu arrancar uma pequena liderança no meio da terceira partida, mas a Spirit superou um déficit de vítimas para montar a sua própria vantagem insuperável, vencendo a partida decisiva e avançando para confrontar a poderosa LGD Gaming — cuja escalação intimidadora havia perdido apenas uma partida até aquele momento.",
      "A primeira partida foi uma briga formidável de 76 minutos. A LGD começou agressiva, mas a Team Spirit se manteve firme antes de começar a assumir o controle. Com isso, a LGD tentou várias vezes se recuperar, mas a Spirit não permitiu, causando a primeira derrota da LGD no palco principal. A Spirit dominou a segunda partida desde o início, ganhando vantagem constante e forçando a LGD a se render. Após um resultado decepcionante em Singapura no ano passado, a Team Spirit mostrou que recuperou a sua forma ao chegar à Grande Final.",
      "A sua adversária: a perigosa Gaimin Gladiators, cujo esquadrão fez a limpa nos Majors do ano e cujas táticas agressivas no início das partidas já haviam destruído as esperanças de muitas equipes da chave inferior.",
      "Porém, para a infelicidade da Gaimin e dos seus fãs, a Team Spirit tinha um plano para dar a volta nos seus inimigos — ela levou a primeira partida de forma acelerada, liderando em patrimônio e vítimas com tanta folga que não havia como a GG virar. A segunda partida foi mais acirrada, com a Gaimin Gladiators obtendo algumas pequenas vantagens até a Team Spirit revidar e dominar os minutos finais, conquistando uma vantagem de 2 a 0 na série. ",
      "Porém, a Gaminin Gladiators não planejava desistir sem lutar, tomando a dianteira no início da terceira partida. Aos 30 minutos, até mesmo o Dota+ acreditava que a GG tinha 96% de chance de forçar uma quarta partida... mas a movimentação, visão e coordenação da Team Spirit transformaram os 4% em uma virada impressionante, destruindo a GG por 3 a 0 na Grande Final para conquistar a sua segunda Égide e trazer Larl, da trilha do meio, para o clube dos campeões. Com um incrível talento individual e um jogo em equipe excepcional, a Team Spirit consolidou o seu lugar na história do Dota 2 como a última sobrevivente do TI 2023.",
      "Como portadores do símbolo supremo da vitória, esses nomes estarão para sempre inscritos na Égide dos Campeões:",
      "[b]2023 — Team Spirit[/b]",
      "[list]",
      "[*] Illia \"Yatoro雨\" Muliarchuk",
      "[*] Denis \"Larl\" Sigitov",
      "[*] Magomed \"Collapse\" Khalilov",
      "[*] Myroslav \"Mira\" Kolpakov",
      "[*] Yaroslav \"Miposhka\" Naidenov",
      "[/list]",
      "[b]Olhando para trás[/b]",
      "Caso tenha perdido alguma parte do torneio, ou queira reviver os momentos e jogadas incríveis, acesse o [url=https://www.youtube.com/user/dota2]canal do Dota 2 no YouTube[/url], para encontrar reprises do torneio completo, inclusive transmissões de conteúdo entre partidas. Você também pode encontrar um estoque de fotos do evento no [url=https://www.instagram.com/dota2]Instagram do Dota 2[/url] e [url=https://www.flickr.com/photos/dota2ti/]Flickr do Dota 2[/url].",
      "Gostaríamos de agradecer a todos os jogadores, personalidades e todos na Comunidade do Dota por nos ajudarem a dar vida a essa comemoração. O International é o momento culminante da temporada competitiva e, sem o apoio de todos, nada disso seria possível. Esperamos que tenham curtido o torneio deste ano tanto quanto nós.",
      "[b]Comemore os campeões[/b]",
      "Os adesivos da edição especial dos campeões — Team Spirit — já estão disponíveis para compra. Cada cápsula contém um adesivo de Yatoro雨, Larl, Collapse, Mira, Miposhka ou do logotipo da Team Spirit. 50% da receita vai diretamente para a Team Spirit.",
      "[b]Compêndio do International[/b]",
      "Ainda há desafios para concluir e recompensas para resgatar no Compêndio do International 2023? Não priemos cânico! Você ainda tem duas semanas para atingir as suas metas antes que o Compêndio acabe, em 16 de novembro. Use algumas das estratégias que aprendeu durante o TI e você certamente terminará tudo em um piscar de olhos."
    ],
    "commentcount": 588,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20877,
    "votedowncount": 1657,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1708463138,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20877,
  "votes_down": 1657,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}