{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "ผู้ชนะเลิศ The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "ผู้ชนะเลิศ The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "ขอแสดงความยินดีกับ Team Spirit ที่ครองตำแหน่งผู้ชนะเลิศ The International 2023 และเป็นเพียงทีมที่สองในประวัติศาสตร์ที่สามารถคว้า Aegis ไปครอบครองได้ถึงสองครั้ง ทีมที่น่าสะพรึงกลัวทีมนี้แพ้ไปเพียงแค่ 2 เกมเท่านั้นตลอดทัวร์นาเมนต์ และจบลงด้วยสถิติที่น่าทึ่งคือ 3-0 ในรอบชิงชนะเลิศ ทำให้คว้าตำแหน่งทีม Dota ที่แข็งแกร่งที่สุดในโลกไปได้",
      "[b]เส้นทางสู่ The International - รอบแบ่งกลุ่ม[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]เส้นทางสู่ The International[/url] เริ่มต้นขึ้นด้วยชัยชนะแบบขาดลอย 8-0 ของ Team Spirit โดยเอาชนะไปได้ 2-0 ในแต่ละซีรีส์ในรอบแบ่งกลุ่ม เหนือคู่แข่งคือ 9pandas, SMG, Entity และ Evil Geniuses ส่วนในรอบกำหนดสายการแข่งขัน Team Spirit ก็สามารถโต้ตอบการจู่โจมของ Shopify Rebellion ในเกมที่หนึ่งได้ ก่อนที่จะคว้าชัยชนะในอีกซีรีส์หนึ่งด้วยคะแนน 2-0 เพื่อก้าวสู่รอบตัดเชือก",
      "[b]เส้นทางสู่ The International - รอบตัดเชือก[/b]",
      "ในรอบนี้ Team Spirit ต้องเผชิญกับการทดสอบครั้งหนักหน่วงเป็นครั้งแรกในทัวร์นาเมนต์ เมื่อพ่ายแพ้ Virtus.pro ไปอย่างรวดเร็วในเกมที่หนึ่ง ซึ่งทำให้ Team Spirit ต้องกลับมาเป็นฝ่ายไล่ตาม แมตช์ต่อมาเป็นการปะทะกันอย่างดุเดือดเลือดสาด เมื่อ Team Spirit สูญเสียคะแนนทั้งหมดที่ทำนำไปก่อนในตอนแรก ก่อนที่จะพลิกกลับมาเอาชนะได้จนต้องแข่งขันกันในเกมที่สาม Virtus.pro ยืนหยัดต่อสู้ในแมตช์ชี้ชะตานี้ได้อย่างสูสีถึง 30 นาที แม้ว่าจะไม่เคยมีคะแนนนำเลยตลอดแมตช์ แต่หลังจากนั้น Team Spirit ก็เข้าคุมเกมได้สำเร็จ โดยไล่ล่า Virtus.pro และคว้าชัยชนะในซีรีส์นี้ไปได้ด้วยการกวาดล้างทั้งทีมในตอนท้ายแมตช์ ทำให้ได้เวลาพักอย่างที่สมควรจะได้รับ ก่อนที่จะเข้าสู่การแข่งขันหลักที่ Climate Pledge Arena",
      "[b]The International[/b]",
      "คู่ต่อสู้ทีมแรกของ Team Spirit ในงานแข่งหลักคือ Team Liquid ซึ่งมีความแข็งแกร่งเสมอต้นเสมอปลาย และมุ่งมั่นที่จะเข้าสู่รอบชิงชนะเลิศให้ได้ เพื่อลบล้างความผิดหวังที่ตกเป็นอันดับสองมาหลายครั้ง Team Spirit เอาชนะ Team Liquid ไปได้อย่างขาดลอยในเกมที่หนึ่ง แต่ Team Liquid ก็โต้กลับและเอาชนะเกมที่สองไปได้อย่างงดงาม ในเกมที่สาม Team Liquid ทำคะแนนนำไปได้เล็กน้อยในช่วงกลางแมตช์ แต่ Team Spirit ฟื้นตัวกลับมาได้ด้วยการทำคะแนนนำโด่งจนอีกทีมตามไม่ทัน และกำชัยชนะในเกมสุดท้ายไปได้เพื่อมุ่งหน้าสู่การปะทะกันกับทีมยักษ์ใหญ่จาก LGD Gaming ซึ่งเป็นคู่ต่อสู้ที่น่าเกรงขามและในขณะนั้นพ่ายแพ้มาเพียงแค่แมตช์เดียวเท่านั้น",
      "เกมที่หนึ่งเป็นการห้ำหั่นกันยาวนานถึง 76 นาที LGD รุกหนักตั้งแต่ต้น แต่ Team Spirit ก็ยืนหยัดสู้ไม่ถอยก่อนที่จะเริ่มเข้าคุมเกม LGD ยังคงรุกกลับอย่างต่อเนื่อง แต่ Team Spirit สกัดโอกาสของ LGD ไว้ได้ ส่งให้ LGD พ่ายแพ้เกมที่หนึ่งของการแข่งขันหลัก เกมที่สองเป็นเกมของ Team Spirit ตั้งแต่เริ่มต้น Team Spirit สร้างความได้เปรียบอย่างต่อเนื่องและบังคับให้ LGD ต้องถอนตัวออกไป หลังจากทำผลงานได้อย่างน่าผิดหวังที่สิงคโปร์ในปี 2022 Team Spirit แสดงให้เห็นแล้วว่าพวกเขาสามารถฟื้นตัวกลับมาท็อปฟอร์มได้อีกครั้ง เมื่อบุกเข้าสู่รอบชิงชนะเลิศได้สำเร็จ",
      "คู่ต่อสู้ของพวกเขา: Gaimin Gladiators ที่แสนอันตราย ทีมที่กวาดล้างทัวร์นาเมนต์เมเจอร์ของปีนี้ และเป็นทีมที่ใช้ยุทธวิธีใส่คู่ต่อสู้ตั้งแต่ช่วงต้นเกมซึ่งทำลายความหวังของทีมสายล่างให้แตกสลายไปแล้วหลายทีม",
      "ขอแสดงความเสียใจกับ Gaimin Gladiators และแฟน ๆ ของทีม เพราะ Team Spirit วางแผนไว้แล้วที่จะจัดการกับศัตรูด้วยระยะเวลาอันสั้น — จึงปิดเกมที่หนึ่งและคว้าชัยชนะไปอย่างรวดเร็ว พร้อมสะสมโกลด์และจำนวนการสังหารนำไปไกลจนไม่เหลือช่องทางให้ Gaimin Gladiators มีโอกาสกลับมาได้ เกมที่สองเป็นเกมที่รุกตอบโต้กันไปมากันมากขึ้น โดย Gaimin Gladiators ได้รับคะแนนนำไปก่อนเล็กน้อย ก่อนที่ Team Spirit จะบุกทะลุทะลวงครอบครองช่วงท้ายเกมไปได้อย่างสมบูรณ์และขึ้นนำไปด้วยชัยชนะ 2-0 ในซีรีส์ ",
      "แต่ Gaimin Gladiators ไม่ยอมสยบให้ง่าย ๆ โดยไม่ต่อสู้จนถึงที่สุด และสามารถยึดเกมที่สามมาได้แต่เนิ่น ๆ พอถึงนาทีที่ 30 แม้แต่ Dota+ ยังคิดว่า Gaimin Gladiators มีโอกาสบังคับให้ต้องเล่นเกมที่สี่ถึง 95%... แต่ Team Spirit กลับคว้าโอกาสอีก 5% นั้นมาพลิกเกมได้อย่างน่าทึ่งด้วยไหวพริบ วิสัยทัศน์ และการประสานงานในทีม จึงถล่ม Gaimin Gladiators ไปได้ 3-0 ในรอบชิงชนะเลิศ คว้า Aegis ไปครองเป็นครั้งที่สองในรอบสามปีและต้อนรับ Larl ผู้เล่นเลนกลางของทีมสู่สโมสรแชมเปี้ยน ด้วยพรสวรรค์อันน่าทึ่งของผู้เล่นรายบุคคลและการเล่นเป็นทีมอันยอดเยี่ยม ทำให้ Team Spirit ได้รับตำแหน่งประวัติศาสตร์ Dota 2 ในฐานะทีมสุดท้ายที่ยืนหยัดได้ใน The International 2023",
      "ในฐานะผู้กำชัยชนะสูงสุด นามเหล่านี้จะถูกจารึกลงใน Aegis of Champions ไปตลอดกาล:",
      "[b]2023 - Team Spirit[/b]",
      "[list]",
      "[*] Illya \"Yatoro雨\" Mulyarchuk",
      "[*] Denis \"Larl\" Sigitov",
      "[*] Magomed \"Collapse\" Khalilov",
      "[*] Myroslav \"Mira\" Kolpakov",
      "[*] Yaroslav \"Miposhka\" Naidenov",
      "[/list]",
      "[b]ย้อนกลับไปดู[/b]",
      "หากคุณพลาดส่วนใดของทัวร์นาเมนต์ หรือแค่อยากรับชมช่วงเวลาหรือการเล่นที่น่าทึ่งอีกครั้ง โปรดไปที่[url=https://www.youtube.com/user/dota2]ช่อง YouTube ของ Dota 2[/url] ซึ่งคุณสามารถดูรีเพลย์ของทั้งทัวร์นาเมนต์ได้ รวมถึงเนื้อหาการถ่ายทอดสดในระหว่างการแข่งขันด้วย นอกจากนี้คุณยังสามารถดูประมวลภาพจากการแข่งขันนี้ได้ที่ [url=https://www.instagram.com/dota2]Dota 2 Instagram[/url] และ [url=https://www.flickr.com/photos/dota2ti/]Dota 2 Flickr[/url] อีกด้วย",
      "เราขอขอบคุณผู้เล่น นักพากย์ และทุกคนในชุมชน Dota ที่ช่วยกันทำให้การเฉลิมฉลองครั้งนี้เป็นจริง The International เป็นจุดสูงสุดของฤดูกาลแข่งขัน และจะเกิดขึ้นไม่ได้เลยหากไม่ได้รับการสนับสนุนจากทุกคน เราหวังว่าคุณจะสนุกเร้าใจไปกับทัวร์นาเมนต์ปีนี้มากพอ ๆ กับเรา",
      "[b]เฉลิมฉลองผู้ชนะเลิศ[/b]",
      "ขณะนี้แคปซูลสติกเกอร์ผู้ชนะเลิศสุดพิเศษสำหรับ Team Spirit พร้อมให้สั่งซื้อแล้ว แต่ละแคปซูลมีสติกเกอร์ 1 ชิ้นที่นำเสนอ Yatoro雨, Larl, Collapse, Mira, Miposhka หรือ Team Spirit โดยที่ 50% ของยอดขายจะนำไปมอบให้กับ Team Spirit โดยตรง",
      "[b]Compendium The International[/b]",
      "ยังมีความท้าทายที่คุณต้องบรรลุให้สำเร็จและรางวัลที่ต้องไขว่คว้าใน Compendium สำหรับ The International 2023 ใช่หรือไม่? อย่าตื่นตกใจ คุณมีเวลาอีก 2 สัปดาห์ที่จะบรรลุเป้าหมายก่อนที่ Compendium จะสิ้นสุดลงในวันที่ 16 พฤศจิกายน เวลาแปซิฟิก งัดกลยุทธ์ใหม่ ๆ ที่คุณชื่นชอบจาก TI ออกมาใช้ แล้วคุณก็จะคว้าสิ่งที่ต้องการมาเก็บไว้ได้อย่างรวดเร็วแน่ ๆ"
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}