{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Vítězové šampionátu The International 2023",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Vítězové šampionátu The International 2023",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Gratulujeme týmu Spirit, vítězům šampionátu The International 2023, a teprve druhému týmu v historii, který pozvedl nejcennější trofej nad hlavu víc než jedenkrát. Tato hrůzu nahánějící skvadra prohrála za celý šampionát pouhé dvě hry a ve velkém finále si přesvědčivým výsledkem 3–0 zajistila místo mezi nejlepšími týmy v historii.",
      "[b]Skupinová fáze[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Cestu na The International[/url], konkrétně její skupinovou fázi, zahájil tým Spirit s dominantním skóre 8–0, jelikož se mu podařilo bezchybně přehrát týmy 9pandas, SMG, Entity a Evil Geniuses. Kolo s nasazením pak dopadlo obdobně, neboť tým Spirit nerozhodil ani dravější nástup týmu Shopify Rebellion v první hře a vítězstvím 2–0 si zajistil jednoznačný postup do playoff.",
      "[b]Playoff[/b]",
      "Zde čekala minulé i budoucí šampiony první velká zkouška – tým Virtus.pro v rychlém sledu ovládl první hru série a zahnal tým Spirit do pomyslného kouta. Ve druhé hře šly tedy veškeré zábrany stranou a tým Spirit v krvavé bitvě získal, ztratil a finálně znovu získal náskok, který přetavil ve třetí hru. I v té se tým VP držel zuby nehty a 30 minut se vše zdálo vyrovnané, ale jakmile tým Spirit přešel do skutečného útoku, už nebyl k zastavení a „vymydlení“ (nejvhodnější popis, věřte nám) celého nepřátelského týmu ke konci hry jen stvrdilo jeho nárok na zasloužený odpočinek před hlavní událostí v hale Climate Pledge Arena.",
      "[b]Hlavní událost[/b]",
      "Prvním soupeřem týmu Spirit byl na hlavní události (tzn. během posledního víkendu šampionátu) konzistentně kvalitní tým Liquid, který po sáhodlouhé šňůře stříbrných medailí doufal ve zlaté vykoupení. Minimálně zpočátku se však jeho ambice zdály nereálné, protože tým Spirit nenechal hrdinům týmu Liquid prostor ani k nadechnutí. Ve druhé hře se nicméně karty obrátily, tým Liquid zvítězil, a dokonce i ve třetí hře si získal drobný náskok, který dal jeho fanouškům naději. Bohužel pro ně netrvalo dlouho a tým Spirit převzal vedení, které ho katapultovalo do semifinálového zápasu proti týmu LGD Gaming, taktéž skoro neporazitelnému gigantovi letošního šampionátu.",
      "První hru pak nelze shrnout jinak než 76 minut trvající přetahovanou, při níž tým LGD nasadil agresivní start, ale tým Spirit si ho stále držel na dohled a nakonec ho předehnal. Tým LGD se následně několikrát pokusil vrátit do vedení, nicméně ani jeden z těchto pokusů nevyšel a čínský favorit utrpěl bolestivou porážku, která pokračovala i ve druhé hře, v níž už rozjetý tým Spirit nenechal nic náhodě a náskok si pohlídal hned od začátku. Pokud do této chvíle někdo pochyboval, nyní bylo jasno – tým Spirit se po loňském zklamání v Singapuru dostal zpět do formy a od trofeje ho dělil poslední krok.",
      "A finálový oponent? Nikdo jiný než obávaný tým Gaimin Gladiators, který posbíral zlato hned v několika nedávných turnajích a šampionátech a jehož brutálně rychlé taktiky ukončily sny všech zbývajících týmů ve skupině poražených.",
      "Naneštěstí pro hráče i fandy týmu Gaimin Gladiators, tým Spirit měl v záloze své vlastní trumfy, které mu v první hře zajistily nepřekonatelný náskok ve zlaťácích a zabitích, a tým GG se relativně rychle sesypal. Druhá hra už byla vyrovnanější a tým Gaimin Gladiators měl chvíli navrch, jenže pak došlo na pozdní fázi a tým Spirit znovu utekl, čímž navýšil stav série na 2–0. ",
      "Zkušení válečníci z týmu Gaimin Gladiators ale ani poté nehodlali odejít bez boje a ve třetí hře se pevně chytli otěží. Dokonce i graf pravděpodobnosti výhry programu Dota Plus ukazoval kolem třicáté minuty pro tým GG 96% šanci na vynucení čtvrté hry... nicméně tým Spirit skrze pohyby, dohled a sehranost svého mančaftu chytil i ten nesmírně malý zbytek naděje za pačesy a předvedl vysloveně šampionský comeback, který završil jeho nádhernou cestu za druhou trofejí Aegis of Champions v rozmezí tří let a do klubu těch nejlepších z nejlepších přidal nového „midaře“ Larla – dovednosti jednotlivců se spojily s taktikou celku a tým Spirit se stal vítězem šampionátu The International 2023.",
      "A jelikož překonali všechny překážky a dosáhli ultimátního vítězství, jména těchto hráčů budou navždy vyryta do trofeje Aegis of Champions:",
      "[b]2023 – Team Spirit[/b]",
      "[list]",
      "[*] Illia „Yatoro雨\" Muliarchuk",
      "[*] Denis „Larl\" Sigitov",
      "[*] Magomed „Collapse“ Khalilov",
      "[*] Myroslav „Mira“ Kolpakov",
      "[*] Yaroslav „Miposhka“ Naidenov",
      "[/list]",
      "[b]Ohlédnutí za šampionátem[/b]",
      "Pokud jste prošvihli nějaký zápas šampionátu nebo si jen chcete připomenout některé z jeho neuvěřitelných momentů, navštivte [url=https://www.youtube.com/user/dota2]kanál Dota 2 na YouTube[/url], kde najdete kompletní archiv záznamů včetně obsahu vysílaného mezi zápasy. Na [url=https://www.instagram.com/dota2]Instagramu[/url] a [url=https://www.flickr.com/photos/dota2ti/]Flickru[/url] také nabízíme album všech fotek.",
      "Závěrem děkujeme hráčům, uvaděčům a prostě všem členům komunity hry Dota 2 za to, že nám pomohli uskutečnit další ročník šampionátu The International. Tohle vyvrcholení celoročního snažení by bez Vás nebylo možné a doufáme, že jste si ho užili alespoň jako my.",
      "[b]Samolepky šampionů[/b]",
      "Ode dneška jsou ve hře také dostupné speciální samolepky šampionů z týmu Spirit, přičemž každá kapsle obsahuje jednu samolepku hráče Yatoro雨, Larl, Collapse, Mira nebo Miposhka, případně samolepku s logem týmu. Jako vždy samozřejmě platí, že polovinu výtěžku z prodejů obdrží přímo hráči.",
      "[b]Přehled šampionátu[/b]",
      "Zbývají Vám v Přehledu šampionátu The International 2023 ještě nějaké výzvy k dokončení a odměny k vyzvednutí? Nemusíte panikařit. Ještě máte celé dva týdny (tedy do 16. listopadu) na to dohnat všechny své resty. A kdo ví, možná když zkusíte nějakou taktiku okoukanou od profíků, půjde to snáze!"
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 19,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}