{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "A The International bajnokai",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "A The International bajnokai",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Gratulálunk a Team Spiritnek, a The International 2023 bajnokának, amely mindössze a második olyan csapat, amely kétszer szerezte meg az Égiszt. Ez a félelmetes csapat az egész bajnokság alatt csak két játékot veszített, határozott 3:0-ás teljesítménnyel végezve a döntőben, hogy bebiztosítsa helyét a világ legjobb Dota csapataként.",
      "[b]A The Internationalig vezető út – Csoportkör[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]A The Internationalig vezető út[/url] egy domináns 8:0-ás eredménnyel kezdődött a Team Spirittől, ahogy a csoportkörben 2:0-ás győzelemsorozatot aratott a 9pandas, az SMG, az Entity, és az Evil Geniuses fölött. Nem történt ez másként a kiemelési körben sem, ahogy a Team Spirit az első játékban elszenvedett néhány leszedést a Shopify Rebelliontől, mielőtt egy másik 2:0-ás sorozatgyőzelemmel továbbmasírozott volna a rájátszásba.",
      "[b]A The Internationalig vezető út – Rájátszás[/b]",
      "Itt szembesültek a bajnokság első nagy tesztjével, mivel a Virtus.pro gyors győzelmet aratott az első játékban, a változatosság kedvéért meghátrálásra kényszerítve a Spiritet. A következő meccs véres csata volt, amelyben a Spirit jelentős előnyt épített fel, majd vesztett el, mielőtt visszanyerte lendületét egy harmadik meccs kikényszerítésére. A VP-nek 30 percig sikerült szoros döntetlenen tartania a meccset, annak ellenére, hogy sohasem szerzett előnyt, de azután a Spirit átvette az irányítást, elfojtva a VP-t, és egy játék végi csapatirtással ellopta a sorozatot, hogy némi jól megérdemelt pihenést szerezve robogjon tovább a Climate Pledge Arena nagyszínpadára.",
      "[b]The International[/b]",
      "A Team Spirit első ellenfele a nagyszínpadon a folyamatosan erős Team Liquid volt, akik maguk is igyekeztek a döntőbe jutni, hogy elfelejtessék a szívszorító második helyes sorozatukat. A Team Spirit a Liquid támogatóinak gyötrésével és alap játékosainak megfélemlítésével letolta az első mecset, de a Liquid egy látványos bemutatóval vágott vissza a második meccs megszerzésére. A Liquidnek ezután a harmadik meccs közepére sikerült kiharcolnia egy kis előnyt, de a Spirit az öléshátrányát leküzdve behozhatatlan előnyt épített, ezzel megszerezve a döntő meccset, és megalapozva a terepet az erős LGD Gaminggel való összecsapáshoz – egy félelmetes felállással, amely csak egyetlen meccset vesztett eddig a pontig.",
      "Az első meccs egy 76 percen át tartó bunyó volt. Az LGD már az elején agresszív volt, de a Team Spirit szilárdan tartotta magát, mielőtt elkezdte átvenni az irányítást. Az LGD egyre próbált visszakapaszkodni, de a Spirit felnyársalta az esélyeiket, ezzel az LGD első vereségét okozva a nagyszínpadon. A második játék kezdettől a Spirité volt, mivel stabilan építették előnyüket, és kikényszerítették az LGD vereségét. A csalódást keltő 2022-es szingapúri szereplésük után a Team Spirit megmutatta, hogy visszanyerték csúcsformájukat, ahogy beviharzottak a döntőbe.",
      "Ellenfelük: a veszélyes Gaimin Gladiators, az a csapat, amely végigsöpört az idei Major bajnokságokon, és akiknek a játék elején alkalmazott nyílt taktikája már oly sok alsó ágas csapat reményeit szétzúzta.",
      "A Gaimin és a rajongóik számára sajnos a Team Spiritnek megvoltak a saját tervei arra, hogy gyorsan végezzenek az ellenfeleikkel – megszöktek egy viszonylag gyors első meccsel, hatalmas arany- és öléselőnyt építve ki, amely nem hagyott utat a GG visszatérésére. A második meccs inkább oda-vissza küzdelemnek bizonyult: a Gaimin Gladiators szerzett néhány kisebb előnyt, mielőtt a Team Spirit áttört, hogy teljesen uralja a meccs második felét, és 2-0-ás sorozatelőnyt szerezzen. ",
      "Nem akarván harc nélkül vereséget szenvedni, a Gaimin Gladiatorsnak a harmadik meccsen hamar sikerült megszereznie a vezetést. A harmincadik percre már a Dota Plusz is azt gondolta, hogy a GG-nek 95%-os esélye van egy negyedik meccs kikényszerítésére... de a Team Spirit mozgása, látásmódja és csapatkoordinációja megragadta azt az 5%-os esélyt, és lenyűgöző visszatéréssé változtatta. 3-0-ra tarolta le a GG-t a döntőben, hogy megszerezze a második Égiszét három év alatt, és üdvözölje középső vonali játékosát, Larlt a bajnokok klubjában. Hihetetlen egyéni tehetségek és kiváló csapatjáték révén a Team Spirit bebetonozta helyét a Dota 2 történetében, az utolsó állva maradt csapatként a The International 2023-on.",
      "A győzelem végső szimbólumának birtokosaiként e nevek vésetnek rá örökre a Bajnokok Égiszére:",
      "[b]2023 – Team Spirit[/b]",
      "[list]",
      "[*] Illia „Yatoro雨” Muliarchuk",
      "[*] Denis „Larl” Sigitov",
      "[*] Magomed „Collapse” Khalilov",
      "[*] Myroslav „Mira” Kolpakov",
      "[*] Yaroslav „Miposhka” Naidenov",
      "[/list]",
      "[b]Visszatekintés[/b]",
      "Ha lemaradtál a bajnokság valamelyik részéről, vagy csak szeretnéd újra átélni a hihetetlen pillanatokat és játékokat, menj a [url=https://www.youtube.com/user/dota2]Dota 2 YouTube csatornájára[/url], ahol megtalálhatod a teljes bajnokság visszajátszásait, köztük a meccsek közti közvetítési tartalmakat is. Találsz egy csomó fotót is az eseményről a [url=https://www.instagram.com/dota2]Dota 2 Instagram[/url] és a [url=https://www.flickr.com/photos/dota2ti/]Dota 2 Flickr[/url] oldalán.",
      "Szeretnénk megköszönni az összes játékosnak, közreműködőnek és a Dota közösség minden tagjának, hogy segítettek életre kelteni ezt az ünnepet. A The International a versenyszezont megkoronázó pillanat, és mindenki támogatása nélkül mindez nem jöhetett volna létre. Reméljük, te is annyira élvezted az idei bajnokságot, mint mi.",
      "[b]Ünnepeld a bajnokokat![/b]",
      "A különleges, bajnoki kiadású Team Spirit matricakapszulák már megvásárolhatók. Mindegyik kapszula egy matricát tartalmaz Yatoro雨, Larl, Collapse, Mira, Miposhka játékosokat vagy a Team Spiritet bemutatva. Az összes eladás 50%-a közvetlenül a Team Spirithez kerül.",
      "[b]The International Összefoglaló[/b]",
      "Van még néhány teljesítendő kihívásod és felveendő jutalmad a The International 2023 Összefoglalóban? Ne ess pánikba. Van még két heted céljaid elérésére, mielőtt az Összefoglaló november 16-án véget ér. Húzz elő néhányat kedvenc új TI stratégiáidból, és pillanatok alatt minden sínen lesz."
    ],
    "commentcount": 588,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20877,
    "votedowncount": 1657,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1708463138,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20877,
  "votes_down": 1657,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}