{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Vinderne af The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Vinderne af The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Tillykke til Team Spirit, vinderne af The International 2023, som er det andet hold nogensinde, der har gjort krav på Aegis for anden gang. Dette frygtsomme hold tabte kun to kampe i hele turneringen og endte med en afgørende præstation på 3-0 i storfinalen for at sikre deres plads som det bedste Dota-hold i verden.",
      "[b]Vejen til The International – Gruppefasen[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Vejen til The International[/url] begyndte med en dominerende præstation på 8-0 fra Team Spirit, da de vandt 2-0 over 9pandas, SMG, Entity og Evil Geniuses i gruppefasen. Det samme gjaldt i seedrunden, da Team Spirit udholdt nogle tidlige heltedrab til Shopify Rebellion i første kamp, før de igen endte med en sejr på 2-0 på vej til slutspillet.",
      "[b]Vejen til The International – Slutspillet[/b]",
      "I slutspillet oplevede de deres første store udfordring i turneringen, da Virtus.pro snuppede en hurtig sejr i første kamp og satte Team Spirit på prøve for en gangs skyld. Kampen efter var en blodig affære, hvor Team Spirit opbyggede og mistede en betydelig føring, før de igen fik styr på momentummet og tvang serien til tredje kamp. Selvom VP aldrig tog føringen, lykkedes det dem at holde kampen lige i 30 minutter, men derefter overtog Team Spirit kontrollen og holdt VP ude, hvilket førte til en sejr med et sent holddrab og en velfortjent pause, før Team Spirit skulle spille i hovedbegivenheden i Climate Pledge Arena.",
      "[b]The International[/b]",
      "Team Spirits første modstander i hovedturneringen var de velpræsterende spillere fra Team Liquid, som selv prøvede at nå til finalen for at rette op på en hjerteskærende tidligere række af andenpladser. Team Spirit hærgede Team Liquids support-spillere og plagede deres core-spillere i en ensidig første kamp, men Team Liquid kæmpede sig tilbage med en spektakulær præstation i anden kamp. Midt i tredje kamp lykkedes det for Team Liquid at opnå en mindre føring, men Team Spirit overkom drabsforskellen og opbyggede deres egen uovervindelige føring, tog sejren og skulle efterfølgende møde de mægtige spillere fra LGD Gaming, som hidtil kun havde tabt en enkelt kamp.",
      "Første kamp varede hele 76 minutter. LGD var aggressive tidligt i kampen, men Team Sprit holdt godt fast, før de selv begyndte at overtage styringen. LGD kæmpede fortsat igen, men Team Spirit satte en kæp i hjulet for dem og tog første sejr i hovedbegivenheden. Team Spirit gjorde krav på anden kamp fra starten, da de stille og roligt opbyggede en fordel og tvang LGD til at kaste håndklædet i ringen. Efter en skuffende optræden i Singapore i 2022 viste Team Spirit, at de igen var i topform, da de stormede ind i storfinalen.",
      "Deres modstandere: de farlige Gaimin Gladiators – holdet, som havde banet sig vej gennem dette års Major-turneringer, og hvis direkte taktik tidligt i kampene havde knust håbet hos så mange hold i de nedre grupper.",
      "Desværre for Gaimin Gladiators og deres fans havde Team Spirit deres egne planer om at besejre dem hurtigt. De vandt over dem relativt hurtigt i første kamp, idet de opbyggede en kæmpe guld- og drabsfordel, som Gaimin Gladiators ikke kunne overvinde. Anden kamp viste sig at være mere frem og tilbage. Gaimin Gladiators opbyggede små fordele i kampen, før det lykkedes for Team Spirit at bryde igennem og dominere den sene del af kampen med en 2-0 føring i serien. ",
      "Gaimin Gladiators gav sig ikke og overtog den tidlige fase af tredje kamp. Efter 30 minutter var selv Dota Plus overbevist om, at Gaimin Gladiators havde 95% chance for at vinde kampen... men Team Spirits bevægelse, udsyn og holdkoordinering udnyttede de resterende 5% og skabte et fantastisk comeback, som overvandt Gaimin Gladiators i storfinalen med 3-0 og sikrede Team Spirits anden Aegis på tre år og samtidig bød mid-spilleren Larl velkommen til vinderklubben. Ved hjælp af både utroligt individuelt talent og fremragende holdspil satte Team Spirit sig spor i Dota 2's historie som det sidste tilbageværende hold i The International 2023.",
      "Som indehavere af det ultimative symbol på sejr vil disse navne for altid være indgraveret på Aegis of Champions:",
      "[b]2023 – Team Spirit[/b]",
      "[list]",
      "[*] Illia \"Yatoro雨\" Muliarchuk",
      "[*] Denis \"Larl\" Sigitov",
      "[*] Magomed \"Collapse\" Khalilov",
      "[*] Myroslav \"Mira\" Kolpakov",
      "[*] Yaroslav \"Miposhka\" Naidenov",
      "[/list]",
      "[b]Tilbageblik[/b]",
      "Hvis du gik glip af noget i turneringen, eller du bare vil gense nogle af de fantastiske øjeblikke, kan du gå til [url=https://www.youtube.com/user/dota2]Dota 2's YouTube-kanal[/url]. Her kan du se hele turneringen, inklusive indhold, som blev sendt mellem kampene. Du kan også finde en masse billeder fra begivenheden på [url=https://www.instagram.com/dota2]Dota 2's Instagram[/url] og [url=https://www.flickr.com/photos/dota2ti/]Dota 2's flickr[/url].",
      "Vi vil gerne takke alle spillerne, talenterne og alle i Dota-fællesskabet for at have været med til at bringe denne fest til live. The International er et højdepunkt i konkurrencesæsonen, og det havde ikke været muligt uden jeres støtte. Vi håber, at I nød årets turnering lige så meget, som vi gjorde.",
      "[b]Fejr vinderne[/b]",
      "De særlige vinderklistermærkekapsler er nu tilgængelige med Team Spirit. Hver kapsel indeholder ét klistermærke med enten Yatoro雨, Larl, Collapse, Mira, Miposhka eller Team Spirit. 50% af indtægterne går direkte til Team Spirit.",
      "[b]Kompendiet til The International[/b]",
      "Har du stadig udfordringer at gennemføre og belønninger at indløse i kompendiet til The International 2023? Bare rolig. Du har to uger mere til at nå dine mål, før kompendiet slutter den 16. november. Brug nogle af dine foretrukne nye taktikker fra TI, og så har du det hele gennemført på ingen tid."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "3731854745514680600",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}