{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Vinnerne av The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Vinnerne av The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Gratulerer til Team Spirit – vinnerne av The International 2023, og det andre laget som har gjort krav på Aegis to ganger. Denne fryktinngytende troppen tapte kun to kamper under hele turneringen – og avsluttet med et avgjørende 3–0 i finalen for å sikre seg plassen som det beste Dota-laget i verden.",
      "[b]Veien til The International – gruppespillet[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Veien til The International[/url] begynte med en overveldende 8–0 fra Spirit, da de seiret 2–0 over 9pandas, SMG, Entity og Evil Geniuses i gruppespillet. Seedingrunden ble ikke annerledes, da Team Spirit måtte tåle noen tidlige drap fra Shopify Rebellion i den første kampen, før de marsjerte videre med nok en seier på 2–0 på veien mot sluttspillet.",
      "[b]Veien til The International – sluttspillet[/b]",
      "Her møtte de sin første store utfordring under turneringen da Virtus.pro tok en rask seier i første kamp og fikk Spirit på defensiven. Kampen som fulgte var en blodig affære der Spirit bygget opp og mistet en betydelig tetposisjon før de tok seg inn igjen og tvang frem en tredje kamp. VP klarte å slå fra seg i 30 minutter i den tredje kampen, selv om de aldri tok ledelsen, men så tok Spirit over kontrollen – overrumplet VP og avsluttet serien med en utradering sent i kampen og kunne ta seg en velfortjent hvil før veien gikk videre til finalespillet i Climate Pledge Arena.",
      "[b]The International[/b]",
      "Team Spirits første motstander i finalespillet var Team Liquid, som selv kjempet beinhardt for å få slutt på en hjerteskjærende rekke med andreplasser. Team Spirit utførte gjentatte angrep på Liquids støttehelter, og knuste kjerneheltene i den første kampen, men Liquid slo tilbake i storslagen stil og vant den andre kampen. Liquid klarte deretter å krafse seg til ledelsen ved midten av tredje kamp, men Spirit overvant drapsunderskuddet for å bygge opp til sin egen uslåelige lederposisjon, og brukte den avgjørende kampen til å sette i stand for en konfrontasjon med mektige LGD Gaming – en skremmende oppstilling som frem til da kun hadde tapt en eneste kamp.",
      "Første kamp varte i 76 minutter. LGD var aggressive tidlig, men Team Spirit holdt linjen og tok deretter kontroll. LGD fortsatte med motangrep, men Spirit slo gjennom og gav LGD sitt første tap i finalespillet. Den andre kampen gikk til Spirit helt fra begynnelsen. De bygget jevnt opp en fordel og tvang LGD til å gi opp. Etter en skuffende opptreden i Singapore i 2022 viste Team Spirit at de er i toppform igjen da de stormet inn i finalen.",
      "Motstanderne var de farlige Gaimin Gladiators – et lag som dominerte i årets majorturneringer, og med taktikk tidlig i kamper som allerede hadde knust håpene til mange lag i lavere grupper.",
      "Uheldigvis for Gaimin og fansene til Gaimin, så hadde Team Spirit sine egne planer for å raskt gjøre kål på motstandere – de stakk av med en relativt rask første kamp der de bygget opp en enorm fordel i gull og drap som GG ikke hadde noen som helst mulighet til å komme tilbake fra. Den andre kampen gikk mer frem og tilbake, og Gaimin Gladiators klarte å bygge seg opp noen få små ledelser før Team Spirit knuste gjennom og dominerte fullstendig mot slutten av kampen, og tok en imponerende seier på 2–0. ",
      "Gaimin Gladiators gav seg ikke, og klarte å ta kontroll på den tredje kampen tidlig. Etter 30 minutter regnet til og med Dota+ at GG hadde en 95 % sjanse til å tvinge frem en fjerde kamp … men Team Spirits bevegelse, sikt og koordinasjon gjorde nytte av de resterende 5 % og snudde om hele kampen, og moste GG 3–0 i finalen for å sikre sin andre Aegis på tre år, og ønske Larl velkommen i mesterklubben. Gjennom både utrolige individuelle talenter og spektakulært lagspill tok Team Spirit plassen i Dota 2s historie som det siste laget igjen under The International 2023.",
      "Som innehavere av det ultimate symbolet på seier skal disse navnene for alltid være gravert på Aegis of Champions:",
      "[b]2023 – Team Spirit[/b]",
      "[list]",
      "[*] Illia «Yatoro雨» Muliarchuk",
      "[*] Denis «Larl» Sigitov",
      "[*] Magomed «Collapse» Khalilov",
      "[*] Myroslav «Mira» Kolpakov",
      "[*] Yaroslav «Miposhka» Naidenov",
      "[/list]",
      "[b]Tilbakeblikk[/b]",
      "Hvis du gikk glipp av noe i turneringen, eller bare vil oppleve de utrolige øyeblikkene på nytt, kan du ta turen til [url=https://www.youtube.com/user/dota2]Dota 2s YouTube-kanal[/url], der du finner repriser av hele turneringen, deriblant innhold fra mellom kampene. Du kan også finne en rekke bilder fra turneringen på [url=https://www.instagram.com/dota2]Dota 2s Instagram[/url] og [url=https://www.flickr.com/photos/dota2ti/]Dota 2s flickr[/url].",
      "Vi har lyst til å takke alle spillerne, ekspertene og alle i Dota-samfunnet for å ha hjulpet til med å gi liv til denne feiringen. The International er høydepunktet i konkurransesesongen, og det hadde ikke vært mulig uten alle dere. Vi håper at du satte pris på årets turnering like mye som oss.",
      "[b]Feir mesterne[/b]",
      "Spesielle mesterklistremerkekapsler for Team Spirit kan nå kjøpes. Hver kapsel inneholder ett klistremerke med Yatoro雨, Larl, Collapse, Mira, Miposhka eller Team Spirit. 50 % av inntektene fra salg går direkte til Team Spirit.",
      "[b]The International-kompendiet[/b]",
      "Har du forstatt noen utfordringer å fullføre og belønninger å løse inn i kompendiet for The International 2023? Ingen grunn til panikk. Du har to uker til på deg til å oppnå målene dine før kompendiet tar slutt 16. november. Bruk noen av de nye strategiene fra TI og gjør deg ferdig på null komma niks."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "3731854745514680600",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}