{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "The International — шампионите от гранд финала",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "The International — шампионите от гранд финала",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Поздравления на Team Spirit, шампионите от гранд финала на The International 2023 и едва вторият отбор, заявил Aegis of Champions повторно. Този страховит отряд изпусна победата само в две игри през целия турнир, финиширайки с решително представяне от 3 — 0 в гранд финалите, за да си подсигури мястото като най-добрия Dota 2 отбор в света.",
      "[b]Пътят към The International — групов етап[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Пътят към The International[/url] започна с доминиращо представяне от 8 — 0 на Team Spirit, тъй като те натрупаха победни поредици от 2 — 0 над 9pandas, Team SMG, Entity и Evil Geniuses в груповия етап. Отсяващият рунд не беше по-различен. Team Spirit понесоха няколко ранни набези от Shopify Rebellion през първата игра, преди да отпрашат с поредна победна поредица от 2 — 0 по пътя си към плейофите.",
      "[b]Пътят към The International — плейофи[/b]",
      "Там те се изправиха пред своето първо голямо изпитание на турнира. За разлика от останалите отбори, Virtus.Pro сграбчиха бърза победа в първата игра, принуждавайки Team Spirit най-сетне да се почувстват притиснати. Следващият мач беше кървава разпра, в която Team Spirit натрупаха и загубиха значителна преднина, преди да си възвърнат инерцията, за да наложат провеждането на трета игра. Virtus.Pro успяха да удържат решителния мач за близо 30 минути, въпреки че така и не поведоха, но след това Team Spirit поеха контрол над ситуацията — потушавайки Virtus.Pro и скрепявайки поредица с помитане на целия отбор в края на играта. Така си спечелиха малко заслужена почивка, преди да излязат на основната сцена в арената Climate Pledge.",
      "[b]The International[/b]",
      "Първият опонент на Team Spirit на основната сцена беше неизменно силният Team Liquid, които искаха да направят своя собствен победен пробег към финалите, за да затрият сърцераздирателната поредица от резултати, поставящи ги на второ място. Team Spirit изтормозиха поддържащите и малтретираха основните играчи на Team Liquid, премазвайки ги в първия мач. Но Team Liquid отвърнаха на удара със зрелищно представяне, вземайки втория мач. След това Team Liquid успяха да издрапат малка преднина до средата на третата игра, но Team Spirit преодоля дефицита на убийства, така че постепенно да развият своя собствена непреодолима преднина. Така Team Spirit взеха решаващия мач, подготвяйки сцената за сблъсък с могъщите LGD Gaming, чийто смущаващ състав беше изпуснал победата само в един-единствен мач до този момент от събитието.",
      "Първата игра беше 76-минутна кавга. LGD Gaming бяха агресивни отрано, но Team Spirit отстояваха непоколебимо, преди да започнат да поемат контрол. LGD Gaming продължиха да драпат обратно, но Team Spirit разпердушиниха техните шансове, връчвайки на LGD Gaming първата им загуба на основната сцена. Втората игра принадлежеше на Team Spirit от самото начало, тъй като те неотклонно развиваха предимство и принудиха LGD Gaming да отстъпят. След разочароващо представяне в Сингапур през 2022, Team Spirit показаха, че са си възвърнали върховата форма, като щурмуваха с уверена стъпка в гранд финалите.",
      "Техните опоненти бяха опасните Gaimin Gladiators. Отборът, който помете тазгодишните Major турнири и чиято дръзка тактика в началото на играта вече беше разбила надеждите на много състави от долните скоби.",
      "За нещастие на Gaimin Gladiators и техните почитатели, Team Spirit имаха свои собствени планове да се справят набързо с неприятелите си. Team Spirit отпрашиха със сравнително бърза първа игра, като развиха огромен запас от злато и убийства, което не остави никаква възможност за завръщане чрез предаване с „GG“ („Добра игра“) в чата. Втората игра по-скоро беше оспорвано противопоставяне. Gaimin Gladiators спечелваха малки преднини, преди Team Spirit да си проправят път, така че напълно да доминира в края на играта, вземайки внушителна преднина от 2 — 0 в поредицата. ",
      "Gaimin Gladiators нямаше да се дадат без бой и така отрано успяха да завземат третата игра. До 30-та минута дори според Dota Plus имаше 95% шанс Team Spirit да се предадат с „GG“ („Добра игра“), принуждавайки съревнованието да достигне до четвърта игра… Но придвижването, видимостта над картата и отборната координация на Team Spirit сграбчиха този 5% шанс и го превърнаха в зашеметяващо завръщане, пристигайки като валяк до „GG“ („Добра игра“) в чата от Gaimin Gladiators. Така победиха с 3 — 0 в гранд финалите, за да си осигурят своя втори Aegis of Champions в рамките на три години и да приветстват своя играч от средната алея, Larl, в клуба на шампионите. Посредством невероятен индивидуален талант и превъзходна отборна игра, Team Spirit затвърдиха своето място в историята на Dota 2 като последния оцелял отбор през The International 2023.",
      "Като предвестители на абсолютния победен символ, тези имена ще бъдат навеки изписани върху Aegis of Champions:",
      "[b]2023 — Team Spirit[/b]",
      "[list]",
      "[*] Илия „Yatoro雨“ Мулярчук;",
      "[*] Денис „Larl“ Сигитов;",
      "[*] Магомед „Collapse“ Кхалилов;",
      "[*] Мирослав „Mira“ Колпаков;",
      "[*] Ярослав „Miposhka“ Найденов.",
      "[/list]",
      "[b]Поглед назад[/b]",
      "Ако сте пропуснали някоя част от турнира или просто искате пак да преживеете невероятните моменти и проигравания, упътете се към [url=https://www.youtube.com/user/dota2]Dota 2 YouTube канала[/url]. Там можете да намерите повторения за целия турнир, включително съдържанието от предаването между игрите. Също така можете да намерите купища снимки от събитието в [url=https://www.instagram.com/dota2]Dota 2 Instagram[/url] и [url=https://www.flickr.com/ снимки/dota2ti/]Dota 2 Flickr[/url].",
      "Бихме искали да благодарим на всички играчи, таланти и всеки от Dota 2 общността за това, че спомогнаха да осъществим този празник. The International е коронният миг на съревнователния сезон и без подкрепата на всички нищо от това не би било възможно. Надяваме се, че тазгодишният турнир Ви е харесал толкова, колкото и на нас.",
      "[b]Ознаменувайте шампионите[/b]",
      "Специалното издание на капсулите с шампионски стикери вече е достъпно за Team Spirit. Всяка капсула съдържа един стикер, включващ Yatoro雨, Larl, Collapse, Mira, Miposhka или Team Spirit. 50% от приходите при всички продажби отиват директно към Team Spirit.",
      "[b]The International Compendium[/b]",
      "Все още са Ви останали няколко предизвикателства за завършване и награди за заявяване в The International 2023 Compendium? Не се паникьосвайте. Разполагате с още две седмици, за да постигнете целите си, преди Compendium да достигне своя завършек на 16 ноември. Вкарайте в действие някои от любимите си нови TI стратегии и ще опаткате всичко за нула време."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "3731854745514680600",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}