{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Os grandes campeões do International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Os grandes campeões do International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Parabéns à Team Spirit, a grande equipa campeã do International 2023 e a segunda equipa na História a conquistar a Égide duas vezes. Este temível esquadrão perdeu apenas duas partidas durante todo o torneio, culminando num decisivo 3 a 0 na grande final que assegurou o seu lugar como a melhor equipa de Dota do mundo.",
      "[b]O Caminho para o International – Fase de grupos[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]O Caminho para o International[/url] começou com um dominante 8 a 0 para a Team Spirit, depois de a equipa conseguir um resultado de 2 a 0 contra as equipas 9pandas, SMG, Entity e Evil Geniuses na fase de grupos. A ronda de distribuição não foi diferente: a Team Spirit sofreu algumas perdas no início da primeira partida contra a Shopify Rebellion, mas conseguiu dar a volta e acabou por assegurar outra vitória de 2 a 0 no caminho para os playoffs.",
      "[b]O Caminho para o International – Playoffs[/b]",
      "Nesta fase, a equipa enfrentou o seu primeiro grande teste do torneio, quando a Virtus.pro conseguiu uma vitória rápida na primeira partida, obrigando a Team Spirit a esforçar‑se ainda mais. A partida seguinte foi um banho de sangue, na qual a Team Spirit começou a dominar e foi arrasada, embora tenha acabado por recuperar o lanço para forçar uma terceira partida. A VP conseguiu controlar a partida decisiva durante 30 minutos, apesar de nunca ter assegurado a liderança, mas a Team Spirit assumiu o controlo pouco depois, travando a VP e fechando a série com uma limpeza arrasadora da equipa nos últimos minutos da partida. E assim, a Team Spirit conquistou um merecido descanso antes de continuar a sua jornada para o palco principal da Climate Pledge Arena.",
      "[b]The International[/b]",
      "A primeira adversária da Team Spirit no evento principal foi a Team Liquid, que sempre foi consistente ao demonstrar a sua força e ansiava dar tudo por tudo até à final para interromper uma série dolorosa de segundos e terceiros lugares em campeonatos anteriores. A Team Spirit atormentou os Supports e intimidou os Cores da Team Liquid numa primeira partida arrasadora, mas a Team Liquid ripostou com jogadas espetaculares que lhe garantiram a vitória na segunda partida. De seguida, a Team Liquid conseguiu arrancar uma breve liderança no meio da terceira partida, mas a Team Spirit superou um défice de vítimas e assegurou uma vantagem insuperável, vencendo a partida decisiva e avançando para enfrentar a intimidante LGD Gaming, que tinha perdido apenas uma partida até àquele ponto.",
      "A primeira partida foi uma batalha de 76 minutos. A LGD foi agressiva no início, mas a Team Spirit manteve‑se firme até começar a assumir o controlo. Os membros da LGD tentaram recuperar, mas a Team Spirit eliminou cada oportunidade para tal, resultando na primeira derrota da LGD no evento principal. A segunda partida foi dominada pela Team Spirit desde o início, que ganhou vantagem constantemente e obrigou a LGD a desistir. Depois de um resultado dececionante em Singapura no TI 2022, a Team Spirit demonstrou que recuperou o seu vigor ao chegar à grande final.",
      "Os seus adversários: Gaimin Gladiators, a equipa que fez uma limpeza nos Majors deste ano e cujas táticas agressivas no início das partidas destruíram as esperanças de muitas equipas do grupo inferior.",
      "Infelizmente para os gladiadores e os seus fãs, a Team Spirit também tinha táticas agressivas e a equipa conseguiu uma vitória rápida na primeira partida, acumulando uma vantagem em ouro e vítimas tal, que não deu oportunidade à Gaimin Gladiators de se recuperar. A segunda partida provou ser mais renhida, com a Gaimin Gladiators a conquistar algumas pequenas vantagens, até que a Team Spirit deu a volta e dominou por completo o resto da partida, ficando assim na frente com um resultado de 2 a 0 na série. ",
      "Não querendo desistir sem dar luta, os jogadores da Gaimin Gladiators conseguiram dominar o início da terceira partida. Aos 30 minutos, até o Dota Plus considerava que havia uma probabilidade de 95% de a GG forçar uma quarta partida... mas o movimento, a visão e a coordenação de equipa da Team Spirit agarrou nesses 5% e transformou‑os numa reviravolta épica, dizimando a Gaimin Gladiators por 3 a 0 na grande final para conquistar assim a sua segunda Égide em três anos e trazer Larl, o seu novo mid‑laner, para o clube dos campeões. Graças ao seu talento individual incrível e jogo em equipa excecional, a Team Spirit consolidou o seu lugar na História do Dota 2 como a equipa campeã do International 2023.",
      "Os nomes destes novos detentores do derradeiro símbolo do triunfo ficarão para sempre gravados na Égide dos Campeões:",
      "[b]2023 – Team Spirit[/b]",
      "[list]",
      "[*] Illia \"Yatoro雨\" Muliarchuk",
      "[*] Denis \"Larl\" Sigitov",
      "[*] Magomed \"Collapse\" Khalilov",
      "[*] Myroslav \"Mira\" Kolpakov",
      "[*] Yaroslav \"Miposhka\" Naidenov",
      "[/list]",
      "[b]Em retrospetiva[/b]",
      "Caso tenhas perdido o torneio ou apenas queiras reviver momentos e partidas incríveis, acede ao [url=https://www.youtube.com/user/dota2]canal no YouTube do Dota 2[/url], onde podes encontrar as repetições de todo o torneio, incluindo os comentários transmitidos entre as partidas. Também podes encontrar várias fotografias do evento no [url=https://www.instagram.com/dota2]Instagram do Dota 2[/url] e no [url=https://www.flickr.com/photos/dota2ti/]Flickr do Dota 2[/url].",
      "Gostaríamos de agradecer a todos os jogadores, talentos e à comunidade do Dota por ajudarem a dar vida a esta celebração. O International é o culminar da temporada competitiva e, sem o apoio de todos, nada disto seria possível. Esperamos que tenhas desfrutado do torneio deste ano, tanto como nós.",
      "[b]A celebração dos campeões[/b]",
      "Estão agora disponíveis versões especiais de Campeão dos autocolantes da Team Spirit. Cada cápsula contém um autocolante de Yatoro雨, Larl, Collapse, Mira, Miposhka ou da Team Spirit. 50% dos lucros obtidos irão diretamente para a equipa.",
      "[b]Compêndio do International[/b]",
      "Ainda tens alguns desafios por completar e recompensas por reclamar no Compêndio do International 2023? Não te preocupes. Tens mais duas semanas para alcançares os teus objetivos antes do fim do Compêndio, a 16 de novembro. Saca de algumas das tuas novas estratégias favoritas do TI e vais ver que tratas de tudo num instante."
    ],
    "commentcount": 470,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 14642,
    "votedowncount": 1047,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1700130415,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 14641,
  "votes_down": 1048,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}