{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Чемпионы The International 2023",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Чемпионы The International 2023",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Поздравляем команду Team Spirit с чемпионством на The Internatioal 2023. Эта победа делает состав второй командой, сумевшей завоевать Эгиду дважды. Эти ребята проиграли всего в двух играх за весь турнир, завершив своё победоносное шествие в гранд-финале с идеальным счётом 3:0, подтверждая звание лучшей команды по Доте в мире.",
      "[b]«Дорога на The International» — Групповой этап[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]«Дорогу на The International»[/url] Team Spirit начала с невероятного счёта 8:0, всухую победив всех соперников по группе: 9pandas, SMG, Entity и Evil Geniuses. В раунде посева ничего не изменилось, и Shopify Rebellion, несмотря успешную агрессию в начале первой игры, не сохранили темп и пали, принеся Team Spirit в копилку очередную победу со счётом 2:0 на пути в плей-офф.",
      "[b]«Дорога на The International» — Плей-офф[/b]",
      "Здесь команду ожидало первое серьёзное испытание: Virtus.pro сумели урвать победу в первой игре, заставив Team Spirit в кои-то веки играть в роли догоняющего. В последующей игре команды устроили настоящую бойню, в которой Team Spirit сумела как набрать, так и потерять заметное преимущество, но всё же вернула контроль над картой и свела исход матча к третьей игре. В решающей игре VP на протяжении 30 минут держались под натиском Team Spirit, несмотря на отставание по ресурсам, но в определённый момент команда «драконов» всё же заперла VP на базе и разгромила в финальной битве. Этой победой Team Spirit заслужили себе ценный период отдыха перед продолжением выступления на стадионе Climate Pledge Arena.",
      "[b]The International[/b]",
      "Первым соперником Team Spirit на главной сцене стала стабильно сильная команда Team Liquid, горевшая желанием успешно пройти до гранд-финала и прервать свою череду вторых мест на турнирах. В первой игре Team Spirit просто уничтожили соперника, изнурив их игроков поддержки и задавив игроков основы, но во второй игре Team Liquid дали отпор и эффектно завоевали победу. В начале третьей игры Team Liquid сумели захватить небольшое преимущество в центре, но Team Spirit преодолели недостаток совершённых убийств и опередили соперника в других аспектах игры, завершив матч в свою пользу. Впереди их ждала битва с титанами из LGD Gaming, которые и сами до этого проиграли только в одной игре.",
      "Первая игра затянулась на 76 минут. LGD показали раннюю агрессию, но Team Spirit выдержали их натиск и взяли игру в свои руки. Несмотря на рьяное сопротивление LGD, Team Spirit всё же подняли их на рога и добились первого поражения LGD на главной сцене. Вторая игра с первых секунд шла в пользу Team Spirit, и они продолжили размеренно накапливать преимущество до тех пор, пока LGD не были вынуждены сдаться. После разочарования на The International 2022 в Сингапуре Team Spirit уверенно заняли место в гранд-финале и наглядно показали, что с ними стоит считаться.",
      "Вторым финалистом оказалась команда Gaimin Gladiators — опасные соперники, одержавшие победу на всех мейджорах этого года и разрушившие немало надежд команд из нижней сетки своим невероятным напором в ранней игре.",
      "К несчастью для Gaimin Gladiators и их фанатов, у Team Spirit были свои взгляды на доминирование в ранней игре. В первой игре «драконы» не оставили соперникам ни шанса, мгновенно накопив огромное преимущество по золоту и убийствам. Вторая игра уже не была столь односторонней: Gaimin Gladiators несколько раз вырывались вперёд, но в итоге Team Spirit перехватили контроль и увеличили разрыв в матче до 2:0. ",
      "Gaimin Gladiators не собирались сдаваться без боя, так что начало третьей игры было в их пользу. На 30 минуте игры даже инструмент Dota Plus предсказывал, что с вероятностью в 95% GG победят, и мы увидим четвёртую игру... Но передвижения, обзор и слаженность Team Spirit позволили им зацепиться за оставшиеся 5% и полностью перевернуть игру, разгромив Gaimin Gladiators в гранд-финале со счётом 3:0. В итоге четыре «дракона» получили своё второе чемпионство за три года, а игрок центра Larl вступил в клуб обладателей Эгиды. Невероятный талант каждого из членов команды и их отличная сыгранность навсегда закрепили Team Spirit в истории Доты в качестве чемпионов The International 2023.",
      "Вот они, завоеватели почётнейшей награды, чьи имена навсегда войдут в историю и попадут на саму Эгиду чемпионов:",
      "[b]2023 — Team Spirit[/b]",
      "[list]",
      "[*] Илья Yatoro雨 Мулярчук",
      "[*] Денис Larl Сигитов",
      "[*] Магомед Collapse Халилов",
      "[*] Мирослав Mira Колпаков",
      "[*] Ярослав Miposhka Найдёнов",
      "[/list]",
      "[b]Взгляд назад[/b]",
      "Если вы пропустили какую-то часть турнира или просто хотите вновь пережить невероятные моменты, отправляйтесь на [url=https://www.youtube.com/user/dota2]канал Dota 2 на YouTube[/url], где вы найдёте записи всего турнира, включая видео, показанные между матчами. Кроме того, на официальных страницах Dota 2 в [url=https://www.instagram.com/dota2]Instagram[/url] и [url=https://www.flickr.com/photos/dota2ti/]Flickr[/url] вы найдёте множество фотографий с турнира.",
      "Мы хотели бы поблагодарить всех игроков, работников студии и всё сообщество Доты за то, что они помогли воплотить этот праздник в жизнь. The International — это кульминация соревновательного сезона, и без вашей поддержки он был бы невозможен! Мы надеемся, что турнир этого года принёс вам не меньше удовольствия, чем нам.",
      "[b]Чествование чемпионов[/b]",
      "Уже доступна капсула с особыми чемпионскими наклейками команды Team Spirit. В ней содержатся наклейки как с логотипом команды, так и с её игроками: Yatoro雨, Larl, Collapse, Mira и Miposhka. Команда получает 50% от продаж каждой капсулы.",
      "[b]Компендиум The International[/b]",
      "У вас в компендиуме остались невыполненные испытания и неполученные награды? Не волнуйтесь. У вас есть время выжать из него максимум, ведь компендиум будет действовать ещё две недели — до 16 ноября. Не забудьте задействовать увиденные на TI стратегии, и испытания завершатся в два счёта."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}