{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Vinnarna av The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Vinnarna av The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Grattis till Team Spirit, stormästarna av The International 2023, och det andra laget någonsin att göra anspråk på Aegis två gånger. Denna skräckinjagande trupp förlorade bara två matcher under hela turneringen – och avslutade med en avgörande 3–0-prestation i finalen, vilket säkrade deras plats som det bästa Dota-laget i världen.",
      "[b]Vägen till The International – gruppspelet[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Vägen till The International[/url] inleddes med en dominerande 8–0-uppvisning av Spirit, då de vann 2–0 serievinster över 9pandas, SMG, Entity och Evil Geniuses i gruppspelet. Seedningsrundan följde samma spår – Team Spirit fick utstå några tidiga dåd från Shopify Rebellion i den första matchen innan de tog hem ytterligare en 2–0-serieseger på sin väg mot slutspelet.",
      "[b]Vägen till The International – slutspelet[/b]",
      "Där stod de inför sitt första stora test under turneringen, då Virtus.pro tog hem en snabb seger i den första matchen, vilket för omväxlingens skull tvingade Team Spirit upp på tå. Den efterföljande matchen var en blodig affär där Spirit byggde upp och förlorade en rejäl ledning innan de kom i kapp och kunde tvinga till sig en tredje match. VP lyckades att hålla ställningarna i 30 minuter i den avgörande matchen, även fast de aldrig tog ledningen, men sedan tog Spirit kontrollen. VP fråntogs alla möjligheter steg för steg och Spirit förseglade segern genom att slå ut hela deras lag. Sedan fick de vila lite innan de intog huvudscenen i Climate Pledge Arena.",
      "[b]The International[/b]",
      "Team Spirits första motståndare på huvudscenen var det konsekvent starka Team Liquid, som var ute efter att ge allt för att ta sig till finalen för att kunna glömma en rad hjärtskärande andraplatsresultat. Team Spirit attackerade gång på gång Liquids supporthjältar och trakasserade deras corehjältar i den första matchen, men Liquid slog tillbaka på storslaget vis och tog hem match nummer två. Liquid lyckades sedan skrapa ihop till en liten ledning i mitten av den tredje matchen, men Spirit övervann underskottet av kills och byggde upp en oövervinnerlig ledning som avgjorde matchen. Därnäst väntande en sammandrabbning med imponerande LGD Gaming. Deras laguppställning hade så långt bara förlorat en enda match.",
      "Den första matchen varade i 76 minuter. LGD var aggressiva i ett tidigt skede, men Team Spirit stod stadiga innan de började ta över kontrollen. LGD kämpade tillbaka med näbbar och klor men Spirit lät sig inte besegras och LGD förlorade för första gången på huvudscenen. Spirit ägde match nummer två från början. Sakta men säkert byggde de upp ett övertag och tvingade LGD att ge sig. Efter en nedslående uppvisning i Singapore 2022 visade Team Spirit att de hade återtagit toppformen när de stormade in i den stora finalen.",
      "Deras motståndare: de farliga Gaimin Gladiators, truppen som sopade huset rent under årets majorturneringar och vars där fick ni-taktik redan hade krossat förhoppningarna hos så många lag i den nedre gruppen.",
      "Tyvärr för Gaimin och deras fans, så hade Team Spirit egna planer på att inte spendera alltför mycket tid med sina fiender. Match nummer ett var över relativt fort – Spirit samlade på sig guld och kills tills det inte fanns någon återvändo för GG. Under match två var segern inte lika självklar. Gaimin Gladiators tog några knappa ledningar innan Team Spirit slog sig igenom och dominerade den senare delen av matchen, vilket ledde till en 2–0-ledning. ",
      "Gaimin Gladiators tänkte inte ge sig utan kamp och tog kontrollen över den tredje matchen i ett tidigt skede. Efter 30 minuter trodde till och med Dota+ att GG hade 95 % chans att tvinga fram en fjärde match ... men Team Spirits förflyttning, sikt och koordination av laget tog chansen på 5 % och förvandlade den till en slående comeback och de fullkomligt mejade ned GG med en 3–0-seger i storfinalen. Därmed säkrade de sin andra Aegis på tre år och fick välkomna Larl till mästarklubben. Genom både otrolig individuell talang och fantastiskt lagspel befäste Team Spirit sin plats i Dota 2-historien som det sista laget kvar på scenen under The International 2023.",
      "Som innehavare av den ultimata segersymbolen, kommer dessa namn att för evigt etsas in på Aegis of Champions:",
      "[b]2023 – Team Spirit[/b]",
      "[list]",
      "[*] Illia ”Yatoro雨” Muliarchuk",
      "[*] Denis ”Larl” Sigitov",
      "[*] Magomed ”Collapse” Khalilov",
      "[*] Myroslav ”Mira” Kolpakov",
      "[*] Yaroslav ”Miposhka” Naidenov",
      "[/list]",
      "[b]En tillbakablick[/b]",
      "Om du missade någon del av turneringen, eller om du helt enkelt vill återuppleva de mest otroliga ögonblicken, gå till [url=https://www.youtube.com/user/dota2]Dota 2:s YouTube-kanal[/url]. Där hittar du repriser från turneringen, inklusive sändningsinnehållet mellan matcherna. Det finns dessutom en mängd bilder från eventet på [url=https://www.instagram.com/dota2]Dota 2:s instagram[/url] och [url=https://www.flickr.com/photos/dota2ti/]Dota 2:s flickr[/url].",
      "Vi vill tacka alla spelare, talanger och alla i Dotas gemenskap för att de hjälpte till att göra detta firande möjligt. The International är tävlingssäsongens höjdpunkt, och utan allas stöd skulle inget av detta kunna ske. Vi hoppas att ni gillade årets turnering lika mycket som vi gjorde.",
      "[b]Fira mästarna[/b]",
      "Särskilda mästarklistermärkeskapslar för Team Spirit finns tillgängliga för köp. Varje kapsel innehåller ett klistermärke med Yatoro雨, Larl, Collapse, Mira, Miposhka eller Team Spirit. 50 % av all försäljning går direkt till Team Spirit.",
      "[b]The International-kompendiet[/b]",
      "Har du fortfarande några utmaningar att slutföra och belöningar att göra anspråk på i kompendiet för The International 2023? Oroa dig inte. Du har två veckor på dig att nå dina mål innan kompendiet upphör den 16 november. Använd några av de nya TI-strategierna så fixar du det på nolltid."
    ],
    "commentcount": 588,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20877,
    "votedowncount": 1657,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1708463138,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20877,
  "votes_down": 1657,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}