{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Die Champions von The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Die Champions von The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Herzlichen Glückwunsch an Team Spirit, die Champions von The International 2023. Damit sind sie auch das bislang zweite Team, das die Ägis zum zweiten Mal für sich beanspruchen konnte. Dieses furchteinflößende Team verlor während des gesamten Turniers nur zwei Partien und sicherte sich im großen Finale mit einem eindeutigen Ergebnis von 3–0 den Titel des besten Dota-Teams der Welt.",
      "[b]Der Weg zu The International – Gruppenphase[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Der Weg zu The International[/url] begann mit einem dominanten Auftritt von Team Spirit und mit insgesamt 8–0 auf der Anzeigetafel. Sie konnten die Begegnungen der Gruppenphase gegen 9Pandas, SMG, Entity und Evil Geniuses mit jeweils 2–0 für sich entscheiden. Die Platzierungsbegegnung verlief ähnlich. Und obwohl Team Spirit in der ersten Partie gegen Shopify Rebellion einige frühe Patzer unterliefen, konnten sie sich mit einem weiteren 2–0-Sieg den Weg in die Play-offs ebnen.",
      "[b]Der Weg zu The International – Play-offs[/b]",
      "Dort wurden sie zum ersten Mal in diesem Turnier auf die Probe gestellt, als Virtus.pro die erste Partie mit einem schnellen Sieg für sich entschied und Team Spirit somit in Bedrängnis brachte. Die folgende Partie war eine erbitterte Schlacht, in der Team Spirit einen beträchtlichen Vorsprung aufbaute und wieder verspielte, bevor sie schließlich das Momentum zurückgewinnen und eine dritte Partie erzwingen konnten. Virtus.pro schaffte es, diese hart umkämpfte Partie 30 Minuten lang offenzuhalten, obwohl sie sich nie einen Vorsprung erarbeiten konnten. Doch dann übernahm Team Spirit die Kontrolle. Sie begannen, Virtus.pro allmählich zu zermürben und besiegelten deren Schicksal mit einer kompletten Teamauslöschung im Endspiel. Danach erhielten sie eine wohlverdiente Pause, bevor es auf der Hauptbühne in der Climate Pledge Arena ans Eingemachte ging.",
      "[b]The International[/b]",
      "Der erste Gegner von Team Spirit auf der Hauptbühne war das konstant starke Team Liquid, das sich selbst für das Finale qualifizieren wollte, um eine Reihe schmerzlicher Zweitplatzierungen wettzumachen. Team Spirit setzte Team Liquids Supports massiv unter Druck und schikanierte ihre Carrys in einer tonangebenden ersten Partie, allerdings kämpfte sich Team Liquid mit einer spektakulären Leistung in der zweiten Partie zurück. Bis zur Mitte der dritten Partie gelang es Team Liquid, einen kleinen Vorsprung zu erspielen, doch konnte sich Team Spirit trotz eines Kill-Defizits zurückkämpfen und schließlich einen unüberwindbaren Vorsprung erringen. Damit war der Weg frei für ein Duell mit dem Schwergewicht LGD Gaming, das zu diesem Zeitpunkt erst eine einzige Partie verloren hatte.",
      "Die erste Partie war eine 76 Minuten lange Schlammschlacht. LGD Gaming zeigte sich von Anfang an kämpferisch, doch Team Spirit hielt stand und übernahm die Kontrolle. Zwar kämpfte sich LGD immer wieder zurück, doch ließ sich Team Spirit nicht aus der Ruhe bringen und bescherte LGD Gaming die erste Niederlage auf der Hauptbühne. Die zweite Partie stand von Anfang an im Zeichen von Team Spirit, die sich kontinuierlich einen Vorsprung erspielten und LGD Gaming zur Aufgabe zwangen. Nach einem enttäuschenden Auftritt in Singapur im Jahr 2022 zeigte Team Spirit mit dem Einzug ins große Finale, dass sie wieder zu ihrer Topform zurückgefunden hatten.",
      "Ihre Gegner waren die gefürchteten Gaimin Gladiators. Dieses Team hatte bereits alle diesjährigen Major-Turniere gewonnen und mit seiner aggressiven Spielweise die Hoffnungen vieler Teams im unteren Bracket zunichtegemacht.",
      "Unglücklicherweise für Gaimin Gladiators und ihre Fans hatte Team Spirit eigene Pläne, um mit ihren Gegnern kurzen Prozess zu machen. Sie gewannen die erste Partie recht schnell, indem sie einen riesigen Gold- und Kill-Vorsprung aufbauten, der Gaimin Gladiators keine Chance auf ein Comeback ließ. In der zweiten Partie war es ein Hin und Her, bei dem die Gaimin Gladiators ein paar Mal knapp in Führung gingen, bevor Team Spirit schließlich die Oberhand gewann und die Begegnung nun souverän mit 2–0 anführte. ",
      "Die Gaimin Gladiators wollten sich jedoch nicht kampflos geschlagen geben und übernahmen früh die Kontrolle in der dritten Partie. Nach 30 Minuten glaubte sogar der Dota-Plus-Assistent, dass Gaimin Gladiators eine 95%ige Chance hatte, eine vierte Partie zu erzwingen – aber Spirit machte sich mit seinen Bewegungen, seiner Weitsicht und seiner Teamkoordination diese 5%ige Chance zunutze und verwandelte sie in ein atemberaubendes Comeback. Gaimin Gladiators wurden letztlich im großen Finale mit 3–0 überrollt. Team Spirit sicherte sich somit seine zweite Ägis in drei Jahren und hieß seinen Mid-Spieler Larl im Club der Champions willkommen. Durch unglaubliches individuelles Talent und hervorragendes Teamwork sicherte sich Team Spirit seinen Platz in der Geschichte von Dota 2 als das beste Team bei The International 2023.",
      "Als Träger des ultimativen Siegessymbols sollen diese Namen für immer auf der Ägis der Champions zu lesen sein:",
      "[b]Team Spirit 2023[/b]",
      "[list]",
      "[*] Illia „Yatoro雨“ Muliarchuk",
      "[*] Denis „Larl“ Sigitov",
      "[*] Magomed „Collapse“ Khalilov",
      "[*] Myroslav „Mira“ Kolpakov",
      "[*] Yaroslav „Miposhka“ Naidenov",
      "[/list]",
      "[b]Ein Blick zurück[/b]",
      "Falls Sie Begegnungen des Turniers verpasst haben oder einige der unglaublichen Spielmomente erneut erleben möchten, können Sie sich auf dem [url=https://www.youtube.com/user/dota2]YouTube-Kanal von Dota 2[/url] Aufnahmen des gesamten Turniers sowie der Zeit zwischen den Begegnungen anschauen. Auf [url=https://www.instagram.com/dota2]Instagram[/url] und [url=https://www.flickr.com/photos/dota2ti/]flickr[/url] können Sie auch zahlreiche Fotos vom Event sehen.",
      "Wir möchten uns bei allen Spielern, Talenten und der gesamten Dota-Community dafür bedanken, dass wir dieses Event erneut gemeinsam erleben durften. The International ist der krönende Abschluss der Wettkampfsaison und ohne die Unterstützung aller wäre dies alles nicht möglich. Wir hoffen, dass Ihnen das diesjährige Turnier ebenso viel Freude bereitet hat wie uns.",
      "[b]Ein Hoch auf die Champions[/b]",
      "Besondere Aufkleberkapseln der Champions sind jetzt für Team Spirit erhältlich. Jede Kapsel enthält einen Aufkleber von Yatoro雨, Larl, Collapse, Mira, Miposhka oder dem Teamlogo von Team Spirit. 50 % aller Erlöse aus dem Verkauf fließen direkt an Team Spirit.",
      "[b]Das Kompendium zu The International[/b]",
      "Haben Sie im Kompendium zu The International 2023 noch einige Herausforderungen zu bewältigen und Belohnungen einzulösen? Kein Grund zur Panik. Sie haben noch zwei Wochen Zeit, um Ihre Ziele zu erreichen, bevor das Kompendium am 16. November endet. Holen Sie einfach einige Ihrer neuen Lieblingsstrategien von TI aus der Trickkiste und Sie werden im Handumdrehen alles erledigt haben."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ClanAnnouncement",
  "gidfeature": "3731854745514680600",
  "gidfeature2": null,
  "clan_steamid_original": "103582791433224455"
}