{
  "gid": "3731854745514680599",
  "clan_steamid": "103582791433224455",
  "event_name": "Nhà vô địch The International",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1698861240,
  "rtime32_end_time": 1698864840,
  "comment_count": 0,
  "creator_steamid": "76561198042665686",
  "last_update_steamid": "76561198026904882",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "c46bb21992914989e08cd1db26447bcb7ec6e7a2.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 150,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "library_spotlight": true,
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1698730051
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1698852700
      },
      {
        "strSteamID": "76561199119053960",
        "rtUpdated": 1698861271
      },
      {
        "strSteamID": "76561198026904882",
        "rtUpdated": 1699280141
      }
    ],
    "rt_migrated_time": 1699280088.323
  },
  "announcement_body": {
    "gid": "3731854745514680600",
    "clanid": "3703047",
    "posterid": "76561198042665686",
    "headline": "Nhà vô địch The International",
    "posttime": 1698861274,
    "updatetime": 1699280141,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/04db0e2af5e77d1d501e46d48b7b86e0a173c421.jpg[/img]",
      "Xin chúc mừng Team Spirit, nhà vô địch giải đấu The International 2023 và đội thứ hai có đặc quyền chạm Aegis hai lần. Đội hình đáng sợ này chỉ thua đúng hai trận trong cả toàn bộ giải đấu — kết thúc với một trận thắng 3-0 thuyết phục tại chung kết tổng để giành lấy vị thế đội Dota xuất sắc nhất thế giới.",
      "[b]Đường tới The International - Vòng bảng[/b]",
      "[url=https://www.dota2.com/esports/ti12/watch/15728/70/game1vod]Đường tới The International[/url] mở ra với màn tung hoành áp đảo 8-0 từ Team Spirit, liên tục thắng 2-0 khi giáp mặt 9pandas, SMG, Entity, và Evil Geniuses tại vòng bảng. Trận xếp hạt giống cũng không ngoại lệ, Team Spirit chịu đòn đầu trận một để rồi đè bẹp Shopify Rebellion, ấn định chiến thắng 2-0 và sải bước vào vòng loại.",
      "[b]Đường tới The International - Vòng loại trực tiếp[/b]",
      "Tại đây, họ đã gặp màn thử thách lớn đầu tiên của giải, với việc Virtus.pro giành một chiến thắng chóng vánh tại trận một, buộc Team Spirit phải gồng mình thay đổi. Trận tiếp theo là màn giao tranh đẫm máu, Team Spirit giành rồi lại mất một lợi thế đáng kể trước khi lấy lại đà để đưa ván đấu tới trận thứ ba. VP giằng co trận đấu trong 30 phút, dù chưa bao giờ chiếm được lợi thế, nhưng sau khi Team Spirit kiểm soát cục diện — bóp nghẹt VP và chốt sêri với màn cho lên bảng cả đội vào cuối trận, từ đấy giành được chút thời gian nghỉ ngơi xứng đáng trước khi tiếp tục cuộc chơi tại sân thi đấu chính ở Climate Pledge Arena.",
      "[b]The International[/b]",
      "Đối thủ đầu tiên của Team Spirit tại sự kiện chính là Team Liquid với phong độ mạnh ổn định. Đây là đội tìm đường bơi đến chặng chung kết để xóa đi chuỗi kết quả về nhì đầy đắng lòng. Team Spirit khuấy đảo dàn hỗ trợ của Liquid, bắt nạt tướng core và càn quét không thương tiếc trong trận đầu, nhưng Liquid phản đòn bằng màn trình diễn ngoạn mục để thắng trận hai. Liquid sau đó có một lợi thế nhỏ vào giữa trận ba, nhưng Spirit vượt chênh lệch điểm giết để gầy dựng một lợi thế không tưởng, giành lấy chiến thắng tại trận quyết định để chuẩn bị đại chiến với LGD Gaming — một đội hình sừng sỏ chỉ biết nếm mùi thua một lần cho tới thời điểm này.",
      "Trận đầu là một pha tả xung hữu đột dài 76 phút. LGD đầu trận cực kỳ hung hăng, nhưng Team Spirit trụ vững trước khi bắt đầu kiểm soát trận đấu. LGD dù thế vẫn cố gắng gượng, nhưng Spirit đâm thủng cơ hội, xiên thẳng LGD với trận thua đầu tiên trong vòng sự kiện chính. Trận hai thì Spirit đã chiếm thế thượng phong ngay từ đầu, từ từ phát triển lợi thế và buộc LGD giơ tay đầu hàng. Sau màn trình diễn đầy thất vọng ở Singapore vào 2022, Team Spirit giờ cho thấy họ đã trở về phong độ đỉnh cao khi băng băng tiến vào chung kết tổng.",
      "Đối thủ: Gaimin Gladiators đầy nguy hiểm, đội này đã càn quét các giải đấu Major trong năm và chiến thuật đánh phủ đầu ngay khi vào trận đã đập tan biết bao hy vọng của các đội nhánh dưới.",
      "Không may cho Gaimin lẫn các fan của họ, Team Spirit đã có kế hoạch để làm gỏi nhanh kẻ thù — và khép lại trận đầu khá nhanh, tích lũy vàng lẫn mạng giết quá khủng, đổ bê tông chặn cửa lội ngược dòng của GG. Trận thứ hai bắt đầu kiểu ăn miếng trả miếng, Gaimin Gladiators dẫn đầu một chút trước khi Team Spirit bứt phá và áp đảo giai đoạn tàn trận, giành lấy lợi thế 2-0 đầy bản lĩnh. ",
      "Không để bản thân dễ dàng hạ gục, Gaimin Gladiators nắm được ưu thế sớm trong trận ba. Tới phút 30, dù Dota+ dự đoán GG có 95% cơ hội để bước vào trận thứ tư... nhưng lợi thế tầm nhìn, bài di chuyển khéo léo của Team Spirit, cùng với lối chơi đồng đội đã biến 5% cơ hội thành màn lội ngược dòng đầy sửng sốt, đè bẹp GG với tỉ số 3-0 tại chung kết tổng để lần thứ hai đạt được Aegis chỉ trong ba năm, và chào mừng tuyển thủ đường giữa Larl vào câu lạc bộ nhà vô địch. Bằng cả tài năng cá nhân phi thường và lối chơi đồng đội xuất sắc, Team Spirit đã củng cố vị trí của họ trong lịch sử Dota 2 với tư cách đội cuối cùng trụ lại tại giải The International 2023.",
      "Với thành tích đạt được biểu tượng chiến thắng tối thượng, những cái tên sau đây sẽ mãi mãi được khắc lên Aegis of Champions:",
      "[b]2023 - Team Spirit[/b]",
      "[list]",
      "[*] llya \"Yatoro雨\" Muliarchuk",
      "[*] Denis \"Larl\" Sigitov",
      "[*] Magomed \"Collapse\" Khalilov",
      "[*] Myroslav \"Mira\" Kolpakov",
      "[*] Yaroslav \"Miposhka\" Naidenov",
      "[/list]",
      "[b]Nhìn lại[/b]",
      "Nếu bạn bỏ lỡ phần nào của giải đấu, hay chỉ muốn sống lại những khoảnh khắc và các màn thi đấu ngoạn mục, hãy ghé qua [url=https://www.youtube.com/user/dota2]kênh YouTube Dota 2[/url] để tìm bản phát lại cho toàn bộ giải đấu, bao gồm nội dung phát sóng giữa các trận. Bạn cũng có thể tìm thấy kho ảnh sự kiện trên tài khoản [url=https://www.instagram.com/dota2]Instagram Dota 2[/url] và [url=https://www.flickr.com/photos/dota2ti/]flickr Dota 2[/url].",
      "Chúng tôi xin cảm ơn tất cả người chơi, khách mời, và mọi thành viên của cộng đồng Dota vì đã góp phần hiện thực hóa sự kiện này. The International đánh dấu thời khắc đăng quang sau một mùa cạnh tranh khốc liệt; tất cả sẽ không thể xảy ra nếu thiếu sự hỗ trợ của mọi người. Hy vọng các bạn đã tận hưởng giải đấu năm nay thật trọn vẹn như chúng tôi vậy.",
      "[b]Vinh danh nhà vô địch[/b]",
      "Gói hình dán đặc biệt phiên bản nhà vô địch cho Team Spirit đã mở bán. Mỗi gói sẽ bao gồm một hình dán có ảnh Yatoro雨, Larl, Collapse, Mira, Miposhka, hoặc Team Spirit. 50% doanh số sẽ chuyển trực tiếp tới Team Spirit.",
      "[b]Compendium của The International[/b]",
      "Vẫn còn thử thách phải hoàn thành và phần thưởng có thể nhận trong Compendium của giải The International 2023? Đừng hoảng. Bạn còn đến những hai tuần để hoàn thành mục tiêu trước khi Compendium kết thúc vào 16/11. Đem mấy chiêu bài chiến thuật TI mới mà bạn yêu thích ra và chốt kèo chiến thắng ngay và liền nhé."
    ],
    "commentcount": 587,
    "tags": [
      "mod_reviewed",
      "ModAct_1400956464_1698864246_0",
      "ModAct_1428002267_1699281267_4"
    ],
    "language": 28,
    "hidden": 0,
    "forum_topic_id": "3946902262252448591",
    "event_gid": "3731854745514680599",
    "voteupcount": 20493,
    "votedowncount": 1631,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1698861240,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "3946902262252448591",
  "rtime32_last_modified": 1705325624,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1699281268,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 20493,
  "votes_down": 1631,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "3946902262252448591",
  "clan_steamid_original": "103582791433224455"
}