{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Vinnerne av The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Vinnerne av The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Gratulerer til Team Falcons, vinnere av The International 2025! Etter et år med blandede resultater fløy Team Falcons endelig til Aegis of Champions i Hamburg – ved å klore, klamre og kverne seg gjennom en av de tøffeste maratonene vi noensinne har sett i The International. Av 10 serier var det kun tre som var en ensidig affære. Alle de andre kampene ble en utfordring, inkludert finalen på fem kamper.",
      "Falcons etablerte seg tidlig med seire 2–1 mot Nemesis og Tundra. Den første virkelige utfordringen kom mot Xtreme Gaming i et basketak på tre timer. Falcons tapte omsider, men motstandsevnen deres var klar og tydelig. Deretter feide de Team Liquid av banen 2–0, men den påfølgende serien mot Tidebound gikk ikke like rolig for seg. Falcons tapte, og plutselig stod de på randen til å bli slått ut. Motstanderen i utslagsrunden? Team Spirit – favorittlaget i turneringen. Resultatet? En overbevisende 2–0 fra Falcons sendte de flerårige mesterne på dør. Team Falcons fikk luft under vingene akkurat i tide for sluttspillet.",
      "De åpnet i Barclays Arena med å ta revansj mot Tidebound 2–0. Mot BB Team tapte Falcons første kamp. I stedet for å spille trygt, satset de på offensive heltevalg for å vinne kamp to. I den tredje kampen fikk Falcons kjapt kvelertak på BB. PVISION var de neste. Falcons måtte ta imot smertefull juling i første kamp, men klarte å stikke av med andre kampen til utligning. Som kronen på verket i tredje kamp, sikret Falcons finalebilletten ved å levere en timelang triumf som fikk publikum opp av stolene.",
      "For å kunne gjøre krav på Aegis of Champions på finaledagen måtte Team Falcons slå et av lagene som hadde slått dem. Xtreme Gaming hadde overlevd en intens finale i det nedre sluttspillet for å legge til rette for en passende omkamp. Xtreme filleristet Falcons i den første kampen. Falcons svarte med en imponerende seier i neste kamp. Den tredje kampen var jevn – helt til en lagutslettende helomvending skubbet Falcons inn i et hull, så de nå lå under 1–2. De klorte seg tilbake i fjerde kamp for å avverge utslag og presset seieren til en femte kamp.",
      "I den avgjørende kampen slapp Falcons løs en nedbrytende kombinasjon i kampens hete, og fra det 15. minutt og utover tok de kontroll over kartet. Xtreme Gaming gjorde et heltemodig forsøk på å forsvare seg, men ble til slutt overmannet av Team Falcons helter som knuste elden – og gjorde krav på Aegis of Champions.",
      "Som innehavere av det ultimate symbolet på seier skal disse navnene for alltid være gravert på Aegis of Champions:",
      "[b]2025 – Team Falcons[/b]",
      "[list]",
      "[*]Oliver «skiter» Lepko",
      "[*]Stanislav «Malr1ne» Potorak",
      "[*]Ammar «AMMAR_THE_F» Alassaf",
      "[*]Andreas «Cr1t-» Nielsen",
      "[*]Jingjun «Sneyking» Wu",
      "[/list]",
      "[b]Tilbakeblikk[/b]",
      "Som Dota i seg selv, er The International en imponerende blanding av flerfoldige bevegende deler. Alle fans som jublet i arenaen, alle fantasioppstillinger og forutsigelser fra alle verdens hjørner, alle strategierklæringer som kom fra tryggheten i ditt eget hjem, produksjonsstaben som la til rette for showet, og selvsagt spillerne som konkurrerte fra båsene – alt kom sammen til en utrolig spesiell hendelse som vi er beæret over å være en del av. ",
      "Som alltid har vi lyst til å takke alle spillerne, ekspertene og alle i Dota-samfunnet for å ha hjulpet til med å gi liv til denne globale feiringen. Hvis du gikk glipp av noe i turneringen, eller bare vil se de utrolige øyeblikkene på nytt, kan du ta turen til [url=https://www.youtube.com/user/dota2]Dota 2s YouTube-kanal[/url], der du finner repriser av hele showet. Du kan også finne en rekke bilder fra turneringen på [url=https://www.instagram.com/dota2/]Dota 2s Instagram[/url] og [url=https://www.flickr.com/photos/dota2ti/]Dota 2s flickr[/url].",
      "[b]Feir mesterne[/b]",
      "Spesielle mesterklistremerkekapsler for Team Falcons kan nå kjøpes. Hver kapsel inneholder ett klistremerke med skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking eller Team Falcons. 50 % av inntektene fra salg går direkte til Team Falcons.",
      "[b]Pakk opp belønningene dine[/b]",
      "Og som forutsigelsene til alle sammen kan ha lagt merke til, var utfallet av årets The International bitte litt … uforutsigbart. Så det er bra at belønningene deles ut i forhold til alle andre. Om du så befinner deg blant topp 100 med utrolige 31 560+ poeng eller «bare» er blant topp 15 % med hardt opptjente 8280+, kan du gå inn i klienten for å motta belønningene dine torsdag den 18. september.",
      "[b]Nytt kosmisk heltegods[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "The International er kanskje over, men den kosmiske prakten fra årets begivenhet trenger aldri å ta slutt, fordi vi har 17 helt nye temasett – med udødelige gjenstander, personaer og mer – å svøpe heltene i. Hver skatt inneholder et sett til Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin eller Lina, samt sjansen for et sjeldent sett til Tinker, Ogre Magi, Luna eller Earthshaker. Settet til Earthshaker har til og med heltens arkana Planetfall, som vender tilbake for første gang. Hopp inn i spillet og sjekk alt sammen."
    ],
    "commentcount": 181,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 1994,
    "votedowncount": 159,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758115705,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 1991,
  "votes_down": 159,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}