{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "ผู้ชนะเลิศ The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "ผู้ชนะเลิศ The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]ขอแสดงความยินดีกับ Team Falcons ที่ครองตำแหน่งผู้ชนะเลิศ The International 2025 จากผลงานที่ขึ้น ๆ ลง ๆ มาตลอดทั้งปี ในที่สุด Team Falcons ก็บินพุ่งทะยานไปคว้า Aegis of Champions ที่เมืองฮัมบูร์กได้สำเร็จ — ด้วยการตะเกียกตะกายต่อสู้อย่างสุดกำลังจนคว้าชัยในการแข่งขันอันทรหดที่สุดครั้งหนึ่งในประวัติศาสตร์ The International พวกเขาเอาชนะคู่แข่งอย่างราบคาบได้เพียง 3 ซีรีส์เท่านั้น จากทั้งหมด 10 ซีรีส์ ส่วนซีรีส์ที่เหลือนั้นห้ำหั่นกันจนครบยก รวมถึงรอบชิงชนะเลิศที่ต้องเล่นกันยาวถึง 5 เกม",
      "Team Falcons สร้างชื่ออย่างรวดเร็วด้วยการคว้าชัยชนะ 2-1 เหนือ Nemesis และ Tundra โดยพวกเขาฟอร์มสะดุดครั้งแรกในการต่อสู้อันแสนยาวนานกว่าสามชั่วโมงกับ Xtreme Gaming แม้ว่า Team Falcons จะพ่ายแพ้ไปในที่สุด แต่พวกเขาก็ได้แสดงให้เห็นถึงความมุ่งมั่นอย่างเด่นชัด จากนั้นพวกเขาก็กำราบ Team Liquid ไปได้ 2-0 แต่ซีรีส์ถัดมาที่ต้องพบกับ Tidebound นั้นทำให้พวกเขาต้องระส่ำระสาย Team Falcons เป็นฝ่ายพ่ายแพ้และจวนเจียนจะตกรอบ ทีมคู่ต่อสู้ของพวกเขาในรอบคัดออกน่ะเหรอ? Team Spirit ซึ่งเป็นทีมตัวเต็งของทัวร์นาเมนต์ ผลการแข่งขัน? Team Falcons เอาชนะไปแบบขาดลอย 2-0 ส่งผลให้ยอดทีมที่รักษาฟอร์มแข็งแกร่งมาโดยตลอดต้องเก็บกระเป๋ากลับบ้านไป Team Falcons แผ่สยายปีกในงานแข่งหลักได้อย่างทันท่วงที",
      "พวกเขาเปิดตัวที่ Barclays Arena ด้วยการล้างตา: เอาชนะ Tidebound ไปได้อย่างราบคาบ 2-0 Falcon พ่ายเกมแรกที่พบกับ BB Team แต่แทนที่จะเล่นแบบปลอดภัย พวกเขาเลือกดราฟต์อย่างดุดันเพื่อเอาชนะในเกมที่สอง ในเกมที่สาม Team Falcons ต้อนทีม BB จนมุมอย่างรวดเร็ว สำหรับแมตช์ถัดไปที่ปะทะกับ PVISION นั้น Team Falcons ต้องพบกับความพ่ายแพ้ในเกมแรกไปอย่างเจ็บปวด แต่พลิกกลับมาเอาชนะได้ในเกมที่สองทำให้กลับมาเสมอกัน Team Falcons ตอกฝาโลงในเกมที่สามคว้าตั๋วผ่านเข้ารอบชิงชนะเลิศด้วยชัยชนะที่กินเวลาไปกว่าหนึ่งชั่วโมงท่ามกลางเสียงเชียร์ของผู้ชมที่ส่งเสียงกึกก้องให้กับสิ่งที่เกิดขึ้นบนเวที",
      "การจะคว้า Aegis of Champions มาครองในวันชี้ขาดให้ได้นั้น Team Falcons ต้องเอาชนะอีกหนึ่งทีมที่เคยยัดเยียดความปราชัยให้พวกเขามาก่อน Xtreme Gaming ฝ่าฟันรอบชิงสายล่างอย่างดุเดือดเพื่อมาพบกันอีกครั้ง ในเกมแรก Xtreme Gaming ถล่ม Falcons ไปอย่างราบคาบ แต่ Falcons ก็ตอบโต้อย่างสาสมได้ทันทีในเกมถัดมา เกมที่สามดูเหมือนจะสูสีกัน — จนกระทั่งเกิดจังหวะตัดสินเกมที่ทำให้ Team Falcons ตายทั้งทีมและต้องตกเป็นฝ่ายตามหลัง 1-2 พวกเขาตามตีตื้นได้ในเกมที่สี่และบีบให้ต้องตัดสินกันในเกมที่ห้า",
      "ในเกมตัดสินชี้ขาด Team Falcons เลือกดราฟต์ที่แข็งแกร่งและใช้คอมโบที่สร้างความปั่นป่วนได้เป็นอย่างมาก โดยพวกเขาสามารถควบคุมทั้งแผนที่ได้อย่างเบ็ดเสร็จตั้งแต่นาทีที่ 15 Xtreme Gaming พยายามตั้งรับกันอย่างเต็มที่แล้ว แต่สุดท้าย Team Falcons ก็โฉบกระชากฮีโร่ศัตรูมาสังหารอย่างดุดันและทุบทำลาย Ancient ลงได้สำเร็จ — และคว้า Aegis of Champions ไปครองได้สำเร็จ",
      "ในฐานะผู้ครอบครองสัญลักษณ์แห่งชัยชนะอันยิ่งใหญ่ นามเหล่านี้จะถูกจารึกไว้บน Aegis of Champions ไปตลอดกาล:",
      "[b]2025 - Team Falcons[/b]",
      "[list]",
      "[*]Oliver \"skiter\" Lepko",
      "[*]Stanislav \"Malr1ne\" Potorak",
      "[*]Ammar \"AMMAR_THE_F\" Alassaf",
      "[*]Andreas \"Cr1t-\" Nielsen",
      "[*]Jingjun \"Sneyking\" Wu",
      "[/list]",
      "[b]ย้อนกลับไปดู[/b]",
      "เช่นเดียวกับ Dota เอง The International นั้นเป็นการผสมผสานอย่างน่าทึ่งขององค์ประกอบมากมาย แฟน ๆ ทุกคนที่ส่งเสียงเชียร์ในสนาม ทีมแฟนตาซีและการทายผลทั่วโลก การวิเคราะห์กลยุทธ์จากในบ้านอันแสนปลอดภัยของคุณ ทีมงานเบื้องหลังที่สร้างสรรค์งาน และแน่นอนเหล่าผู้เล่นที่แข่งขันกันในบูธ — ทั้งหมดนี้รวมกันเป็นกิจกรรมสุดพิเศษที่พวกเราภูมิใจที่ได้ร่วมเป็นส่วนหนึ่งของงาน ",
      "และเช่นเคย เราขอขอบคุณผู้เล่น นักพากย์ และทุกคนในชุมชน Dota ที่ช่วยกันทำให้การเฉลิมฉลองทั่วโลกครั้งนี้เป็นจริง หากคุณพลาดส่วนใดของทัวร์นาเมนต์ หรือแค่อยากรับชมการเล่นที่น่าทึ่งอีกครั้ง โปรดไปที่[url=https://www.youtube.com/user/dota2]ช่อง YouTube ของ Dota 2[/url] ซึ่งคุณสามารถดูรีเพลย์ของทั้งทัวร์นาเมนต์ได้ นอกจากนี้คุณยังสามารถดูประมวลภาพจากการแข่งขันนี้ได้ที่ [url=https://www.instagram.com/dota2/]Dota 2 Instagram[/url] และ [url=https://www.flickr.com/photos/dota2ti/]Dota 2 Flickr[/url] อีกด้วย",
      "[b]เฉลิมฉลองผู้ชนะเลิศ[/b]",
      "ขณะนี้แคปซูลสติกเกอร์ผู้ชนะเลิศสุดพิเศษสำหรับ Team Falcons พร้อมให้สั่งซื้อแล้ว แต่ละแคปซูลมีสติกเกอร์ 1 ชิ้นที่นำเสนอ skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking หรือ Team Falcons โดยที่ 50% ของยอดขายจะนำไปมอบให้กับ Team Falcons โดยตรง",
      "[b]แกะกล่องรางวัลของคุณ[/b]",
      "ทุกคนคงสังเกตได้จากสายการแข่งขันของตนเองว่าผลการแข่งขัน The International ปีนี้ค่อนข้าง...พลิกโผ แต่โชคดีที่รางวัลแฟนตาซีตัดคะแนนกันแบบอิงกลุ่ม ไม่ว่าคุณจะติด 100 อันดับแรกด้วยคะแนนอันน่าทึ่งกว่า 31,560 คะแนน หรือเป็นเพียงหนึ่งในกลุ่มอันดับสูงสุด 15% แรกที่ได้คะแนนมาอย่างยากลำบากกว่า 8,280 คะแนน คุณก็สามารถเข้าเกมเพื่อรับรางวัลได้ในวันพฤหัสบดีที่ 18 กันยายนนี้",
      "[b]สมบัติ Cosmic Heroes' Hoard ใหม่[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "The International อาจจะจบลงแล้ว แต่ของที่ระลึกธีมจักรวาลของงานในปีนี้จะไม่มีวันสิ้นสุด เพราะเรามีชุดเซ็ตไอเท็มพิเศษใหม่ทั้งหมด 17 ชุดเซ็ต — มาพร้อมไอเท็ม Immortal, รูปลักษณ์ และอื่น ๆ อีกมากมาย — สำหรับสวมใส่ให้กับฮีโร่ตัวโปรดของคุณ สมบัติแต่ละชิ้นจะบรรจุชุดเซ็ตสำหรับ Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin หรือ Lina รวมทั้งโอกาสที่จะได้เพิ่มชุดเซ็ตหายาก Tinker, Ogre Magi, Luna หรือ Earthshaker อีกด้วย ชุดเซ็ต Earthshaker ยังรวมถึงไอเท็ม Arcana ของฮีโร่ \"Planetfall\" ที่กลับมาอีกครั้งเป็นครั้งแรก เข้าเกมเพื่อดูรายละเอียดทั้งหมดกันได้เลย"
    ],
    "commentcount": 224,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2958,
    "votedowncount": 241,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758141288,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2955,
  "votes_down": 241,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}