{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Чемпіони The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Чемпіони The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Вітаємо переможців The International 2025 — команду Team Falcons. Після року виступів зі змінним успіхом Team Falcons нарешті досягли переможних вершин Еґіди чемпіонів у Гамбурґу. Вони повзли, чіплялися та пробивалися до своєї цілі, зрештою подолавши один із найтриваліших марафонів за весь час існування The International. З усіх 10 своїх матчів вони виграли всуху лише 3, а в кожному другому матчі було зіграно максимальну кількість ігор (5 у ґранд-фіналі).",
      "Team Falcons упевнено розпочали свій шлях перемогою над Nemesis і Tundra з рахунком 2:1. Проблеми почалися, коли вони зустрілися з Xtreme Gaming: майбутні чемпіони зрештою програли в тригодинній сутичці, але їхня стійкість була дуже помітною. Далі вони знищили Team Liquid із рахунком 2:0, однак наступний матч із Tidebound виявився значно хаотичнішим: Team Falcons програли, і тепер на горизонті був раунд на вибування. Кого вони там зустріли? Фаворитів турніру — Team Spirit. Яким був результат? 2:0. Відправивши одну з найсильніших команд додому, окрилені успіхом Team Falcons полетіли на головний етап.",
      "Свій перший матч на «Баркліс-арені» вони почали з помсти, всуху обігравши Tidebound. Зустрівшись далі з BB Team, вони програли першу гру, але, обираючи героїв для другої, вони віддали перевагу агресивній стратегії замість обережної, що принесло їм перемогу на цій мапі. А вже в третій грі Falcons швидко придушили всі потуги своїх суперників. Далі їм зустрілася команда PVISION: після болісної поразки в першій грі вони зрівняли рахунок у другій і вийшли переможцями із третьої, що тривала цілу годину під шалене ревіння натовпу. Ось так Team Falcons забезпечили собі місце в ґранд-фіналі.",
      "Коли настав останній день The International, між Team Falcons й Еґідою чемпіонів стояла лише одна єдина команда, що їх перемогла. Xtreme Gaming пройшли напружений фінал нижньої сітки, і тепер Team Falcons мали всі шанси на належний реванш. Однак у першій грі Falcons були розтрощені. У другій грі значно сильнішими вже були майбутні чемпіони. Третя гра виглядала рівною, доки Xtreme Gaming не повбивали всіх ворожих героїв, що й вирішило долю команд на цій мапі. Програючи з рахунком 1:2, Team Falcons дали бій у четвертій грі та уникнули вибування. Настав час п’ятої, вирішальної гри.",
      "Два обрані знерухомлювачі — герої підтримки — забезпечили Falcons повний контроль над мапою ще з 15 хвилини, тож попри відважний захист герої та Древній команди Xtreme Gaming не встояли перед потужним натиском Team Falcons — вони вибороли Еґіду чемпіонів.",
      "Імена цих остаточних переможців назавжди залишаться на Еґіді чемпіонів — абсолютному символі перемоги. Ось вони:",
      "[b]2025 — Team Falcons[/b]",
      "[list]",
      "[*]Олівер «skiter» Лепко",
      "[*]Станіслав «Malr1ne» Поторак",
      "[*]Аммар «AMMAR_THE_F» Аль-Ассаф",
      "[*]Андреас «Cr1t-» Нільсен",
      "[*]Цзінцзюнь «Sneyking» У",
      "[/list]",
      "[b]Озираючись назад[/b]",
      "Як і сама Dota, The International — це всеохопна суміш незліченних рухливих частин. Кожен активний шанувальник на арені, кожен склад фантазі-команди та кожен прогноз зі всього світу, всі стратегічні поради, зроблені з домашнього дивана, працівники, які створили шоу, і, звичайно, гравці, котрі змагалися на арені — все це робить внесок до неймовірно особливої події, в якій ми маємо честь взяти участь. ",
      "Як завжди, ми хотіли б подякувати гравцям, талантам і всім у спільноті Dota за те, що допомогли втілити це глобальне свято в життя. Якщо ви пропустили щось на турнірі або просто бажаєте повторно переглянути найзахопливіші моменти, перейдіть до [url=https://www.youtube.com/user/dota2]YouTube-каналу Dota 2[/url], де можна знайти всі повтори. А на сторінках Dota 2 в [url=https://www.instagram.com/dota2]Instagram[/url] і [url=https://www.flickr.com/photos/dota2ti/]Flickr[/url] можна знайти безліч фотографій із турніру.",
      "[b]Вшанування чемпіонів[/b]",
      "Уже можна придбати капсули з наліпками спеціального чемпіонського видання Team Falcons. Кожна капсула містить одну наліпку зі skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking чи Team Falcons. 50% від продажів буде перераховано безпосередньо Team Falcons.",
      "[b]Розпакуйте свої нагороди[/b]",
      "Ваші прогнози на турнір уже мали вам показати, що цьогорічний The International був дещо… непередбачуваним. Тож добре, що нагороди за фентезі визначаються за процентилем. Незалежно від того, чи ви серед 100 найкращих із приголомшливими 31560+ очками, чи «просто» потрапили до 15% найкращих зі своїми тяжко заробленими 8280+ очками, саме час зайти в клієнт і забрати свої нагороди цього четверга, 18 вересня.",
      "[b]Нова космічна скарбниця героїв[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "The International завершився, але космічна атмосфера цьогорічної події не завершиться ніколи, бо маємо 17 цілковито нових тематичних наборів для героїв, що містять нетлінні предмети, персони та інше. Кожна скарбниця містить набір для Винищувача Духів, Еніґми, Порожнечого Духа, Древнього Привида, Мірани, Зевса, Фенікса, Свена, Кришталевої Діви, Безликого, Марсі, Фантомної Вбивці або Ліни, а також шанс додатково отримати рідкісний набір для Механіка, Огра-Мага, Луни чи Землетруса. Набір для Землетруса містить навіть таємний предмет Планетопад, що повертається вперше. Застрибуйте в гру, щоби переглянути весь асортимент."
    ],
    "commentcount": 203,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2472,
    "votedowncount": 203,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758128660,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2467,
  "votes_down": 202,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}