{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025 – Οι Μεγάλοι Πρωταθλητές",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025 – Οι Μεγάλοι Πρωταθλητές",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Συγχαρητήρια στους Team Falcons, τους μεγάλους πρωταθλητές του The International 2025. Μετά από έναν χρόνο με ανάμεικτα αποτελέσματα, οι Team Falcons κατάφεραν να ανελιχθούν στην κορυφή και να κατακτήσουν το Aegis of Champions στο Αμβούργο, μετά από μια σκληρή μάχη όπου πάλεψαν με νύχια και με δόντια σε έναν από τους πιο σκληρούς μαραθώνιους που έχει δει ποτέ το The International. Από τις δέκα σειρές αγώνων τους, μόλις τρεις ήταν σαρωτικές νίκες. Όλες οι υπόλοιπες αναμετρήσεις κράτησαν αρκετά, όπως και ο Μεγάλος Τελικός, που κρίθηκε στα πέντε παιχνίδια.",
      "Οι Falcons ξεχώρισαν από νωρίς με νίκες 2–1 επί των Nemesis και των Tundra. Το πρώτο τους στραβοπάτημα σημειώθηκε ενάντια στους Xtreme Gaming, σε μια σκληρή αναμέτρηση διάρκειας τριών ωρών. Οι Falcons εντέλει υπέκυψαν, ωστόσο η αντοχή τους δεν πέρασε απαρατήρητη. Στη συνέχεια, διέλυσαν τους Team Liquid με 2–0, αλλά η επόμενη σειρά αγώνων ενάντια στους Tidebound ήταν πολύ πιο ταραχώδης. Οι Falcons ηττήθηκαν και, ξαφνικά, ο αποκλεισμός ξεπρόβαλε απειλητικά. Ο αντίπαλός τους στον γύρο αποκλεισμού; Οι Team Spirit, το φαβορί του τουρνουά. Το αποτέλεσμα; Ένα ξεκάθαρο 2-0 από τους Falcons, που έδειξαν στον πανίσχυρο αντίπαλο την πόρτα της εξόδου. Οι Team Falcons άνοιξαν τα φτερά τους πάνω στην ώρα για την Κύρια Εκδήλωση.",
      "Άνοιξαν την αυλαία στο Barclays Arena παίρνοντας τη ρεβάνς: ένα σαρωτικό 2–0 ενάντια στους Tidebound. Εναντίον των BB Team, οι Falcons έχασαν στον πρώτο αγώνα. Αντί να παίξουν συντηρητικά, πόνταραν σε ένα επιθετικό ρόστερ για να κερδίσουν το δεύτερο παιχνίδι. Στο τρίτο παιχνίδι, οι Falcons επικράτησαν γρήγορα έναντι των BB. Οι PVISION ήταν οι επόμενοι. Οι Falcons δέχθηκαν ένα οδυνηρό πλήγμα στο πρώτο παιχνίδι, αλλά επικράτησαν στο δεύτερο, ισοφαρίζοντας έτσι το σετ. Για να σφραγίσουν τη νίκη στο τρίτο παιχνίδι, οι Falcons κέρδισαν το εισιτήριό τους για τον Μεγάλο Τελικό προσφέροντας ένα θριαμβευτικό θέαμα μίας ώρας, που ξεσήκωσε το κοινό με όσα συνέβαιναν επί σκηνής.",
      "Για να αποκτήσουν το Aegis of Champions την τελευταία μέρα, οι Team Falcons έπρεπε να κερδίσουν τη μόνη άλλη ομάδα που τους είχε νικήσει. Οι Xtreme Gaming επιβίωσαν από έναν σκληρό τελικό στον Κάτω Όμιλο και θα ακολουθούσε ένας αγώνας μπαράζ αντάξιος των περιστάσεων. Στο πρώτο παιχνίδι, οι Xtreme διέλυσαν τους Falcons. Οι Falcons απάντησαν αμέσως με μια εκπληκτική σαρωτική νίκη στο επόμενο παιχνίδι. Το τρίτο παιχνίδι φαινόταν ισορροπημένο, μέχρι που μια ανατρεπτική εξάλειψη ομάδας διαμόρφωσε τη σειρά αγώνων στο 1–2 και έφερε τους Falcons σε δυσμενή θέση. Πάλεψαν σκληρά στο τέταρτο παιχνίδι για να αποφύγουν τον αποκλεισμό και να οδηγήσουν τη σειρά στον καθοριστικό πέμπτο αγώνα.",
      "Στον καθοριστικό αγώνα, το ισχυρό ρόστερ από τους Falcons έριξε έναν ακατανίκητο συνδυασμό στη μάχη και από το 15ο λεπτό και μετά πήραν τον έλεγχο του χάρτη. Οι Xtreme Gaming έκαναν γενναία προσπάθεια στην άμυνα, αλλά στο τέλος οι Team Falcons συνέτριψαν τους εχθρικούς ήρωες και ισοπέδωσαν το Αρχαίο. Το Aegis of Champions ήταν δικό τους.",
      "Έχοντας κατακτήσει το απόλυτο σύμβολο της νίκης, τα ονόματά τους θα χαραχτούν για πάντα πάνω στο Aegis of Champions:",
      "[b]2025 – Team Falcons[/b]",
      "[list]",
      "[*]Oliver «skiter» Lepko",
      "[*]Stanislav «Malr1ne» Potorak",
      "[*]Ammar «AMMAR_THE_F» Alassaf",
      "[*]Andreas «Cr1t-» Nielsen",
      "[*]Jingjun «Sneyking» Wu",
      "[/list]",
      "[b]Αναδρομή[/b]",
      "Όπως και το ίδιο το Dota, το The International είναι ένας εντυπωσιακός και σύνθετος συνδυασμός αμέτρητων πραγμάτων. Κάθε φαν που πανηγυρίζει στην αρένα, κάθε ρόστερ εικονικού πρωταθλήματος και κάθε πρόβλεψη που γίνεται σε όλον τον κόσμο, όλες οι δηλώσεις στρατηγικής που γίνονται από την ασφάλεια του σπιτιού σας, το προσωπικό της παραγωγής που χτίζει το σόου και, φυσικά, οι παίκτες που αγωνίζονται στους θαλάμους… Όλα αυτά συνθέτουν μια απίστευτα ξεχωριστή διοργάνωση, στην οποία είναι τιμή μας να συμμετέχουμε. ",
      "Όπως πάντα, θα θέλαμε να ευχαριστήσουμε όλους τους παίκτες, τα ταλέντα και τα μέλη της κοινότητας Dota, που βοήθησαν να πάρει αυτός ο παγκόσμιος εορτασμός σάρκα και οστά. Αν χάσατε μέρος του τουρνουά ή απλώς θέλετε να δείτε ξανά τους απίστευτους αγώνες, μεταβείτε στο κανάλι του [url=https://www.youtube.com/user/dota2]YouTube του Dota 2[/url], όπου θα βρείτε επαναλήψεις από ολόκληρη τη διοργάνωση. Μπορείτε επίσης να βρείτε ένα σύνολο φωτογραφιών από τη διοργάνωση στο [url=https://www.instagram.com/dota2/]Instagram του Dota 2[/url] και στο [url=https://www.flickr.com/photos/dota2ti/]flickr του Dota 2[/url].",
      "[b]Τιμήστε τους πρωταθλητές[/b]",
      "Είναι πλέον διαθέσιμες για αγορά οι κάψουλες αυτοκόλλητων ειδικής έκδοσης πρωταθλητών για τους Team Falcons. Κάθε κάψουλα περιέχει ένα αυτοκόλλητο με τους skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking ή τους Team Falcons. Το 50% όλων των πωλήσεων θα πάει απευθείας στους Team Falcons.",
      "[b]Ξετυλίξτε τις ανταμοιβές σας[/b]",
      "Όπως μπορεί να παρατήρησαν όλοι στους ομίλους τους, το αποτέλεσμα του The International φέτος ήταν λιγάκι… απρόβλεπτο. Βοηθάει, λοιπόν, που οι ανταμοιβές του Εικονικού Πρωταθλήματος ταξινομούνται σε καμπύλη. Είτε είστε στους κορυφαίους 100, έχοντας συλλέξει το εκπληκτικό σύνολο των 31.560+ πόντων, ή «απλά» στο κορυφαίο 15% με 8.280+ πόντους που κερδίσατε με κόπο, μπορείτε να κατευθυνθείτε στην εφαρμογή για να αποκτήσετε τα βραβεία σας αυτήν την Πέμπτη 18 Σεπτεμβρίου.",
      "[b]Νέος θησαυρός: Cosmic Heroes' Hoard[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "Το The International μπορεί να έχει τελειώσει, ωστόσο τα κοσμικά παρελκόμενα της φετινής διοργάνωσης δεν χρειάζεται να τελειώσουν ποτέ, επειδή έχουμε 17 ολοκαίνουρια θεματικά σετ αντικειμένων με Immortal, Περσόνες και άλλα, για να «ντύσετε» τους ήρωές σας. Κάθε θησαυρός περιέχει ένα σετ για τον Spirit Breaker, τον Enigma, τον Void Spirit, τον Ancient Apparition, τη Mirana, τον Zeus, τον Phoenix, τον Sven, την Crystal Maiden, τον Faceless Void, τη Marci, τον Phantom Assassin ή τη Lina, καθώς και την πιθανότητα να προστεθεί επίσης ένα σπάνιο σετ για τον Tinker, τον Ogre Magi, τη Luna ή τον Earthshaker. Το σετ του Earthshaker περιέχει επίσης το Arcana Planetfall του ήρωα, που επιστρέφει για πρώτη φορά. Μπείτε στο παιχνίδι για να δείτε την πλήρη γκάμα."
    ],
    "commentcount": 223,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2946,
    "votedowncount": 241,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758140720,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2943,
  "votes_down": 240,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}