{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Les grands vainqueurs de The International",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Les grands vainqueurs de The International",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Félicitations aux membres de Team Falcons, grands vainqueurs de The International 2025. Après une année de résultats mitigés, Team Falcons s'est surpassée pour conquérir l'Aegis of Champions à Hambourg en se battant bec et ongles tout le long d'un marathon comptant parmi les plus difficiles que The International ait jamais connu. Sur les dix séries que l'équipe a disputées, elle n'en a gagné que trois sans perdre un match. Elle a dû tenir la distance dans toutes les autres, y compris lors de la grande finale de cinq matchs.",
      "Les Falcons se sont imposés très tôt avec des victoires de 2 à 1 contre Nemesis et Tundra. Le premier accroc est arrivé contre Xtreme Gaming dans un combat épique de trois heures. Les Falcons sont finalement tombés, mais l'équipe a fait montre d'une persistance à toute épreuve. Ils ont ensuite éliminé Team Liquid facilement sur un 2-0, mais la série suivante contre Tidebound a été beaucoup plus tumultueuse. Avec la défaite des Falcons, la menace de l'élimination planait soudain sur l'équipe. Et qui était leur prochain adversaire lors du tour éliminatoire ? Team Spirit, l'équipe favorite du tournoi. Le résultat ? 2-0 : une punition des Falcons contre le mastodonte de toujours, qui a dû faire ses bagages. Team Falcons a trouvé ses marques juste à temps pour l'évènement principal.",
      "L'équipe est arrivée au Barclays Arena en ayant soif de revanche et s'est débarrassée sèchement de Tidebound avec un 2-0. Contre BB Team, les Falcons ont perdu le premier match, mais au lieu de jouer la prudence, l'équipe a misé sur une sélection agressive qui lui a permis de remporter le deuxième match. Lors du troisième face-à-face, les Falcons ont rapidement mis BB à genoux. Puis ce fut le tour de PVISION. Les Falcons ont dû d'abord encaisser une lourde défaite avant d'emporter le deuxième match pour l'égalisation. Ils ont décroché leur billet pour la grande finale en remportant la série avec un troisième match triomphal de plus d'une heure devant une foule en délire.",
      "Pour remporter l'Aegis of Champions lors de la dernière journée, Team Falcons devrait vaincre la seule autre équipe qui l'avait battue. Xtreme Gaming avait survécu à une intense finale du groupe inférieur pour prendre sa place dans un deuxième face-à-face mérité. Dans le premier match, Xtreme a dépecé les Falcons. Team Falcon a répliqué sur-le-champ en imposant une défaite cuisante à son adversaire lors du match suivant. Le troisième match semblait à égalité, jusqu'à ce que l'annihilation de l'équipe entière pousse les Falcons au bord du précipice avec un score de série de 1-2. Ils ont réussi à remonter la pente dans le quatrième match pour éviter l'élimination et forcer la tenue d'un cinquième match décisif.",
      "Pour le dernier match, les Falcons ont monté une escouade solide qui, à partir de la 15ᵉ minute, a pris le contrôle de la carte en déchainant un combo dévastateur dans la bagarre. Xtreme Gaming s'est défendue férocement, mais c'est en fin de compte Team Falcons qui a taillé en pièces les héros ennemis pour anéantir l'Ancient, et c'est à elle que revient l'Aegis of Champions.",
      "Porteurs du symbole ultime de victoire, ces noms seront gravés éternellement sur l'Aegis of Champions :",
      "[b]2025 - Team Falcons[/b]",
      "[list]",
      "[*]Oliver « skiter » Lepko",
      "[*]Stanislav « Malr1ne » Potorak",
      "[*]Ammar « AMMAR_THE_F » Alassaf",
      "[*]Andreas « Cr1t- » Nielsen",
      "[*]Jingjun « Sneyking » Wu",
      "[/list]",
      "[b] Rétrospective [/b]",
      "Comme Dota lui-même, The International est le résultat d'une impressionnante mécanique de pièces mobiles. Depuis les fans qui encouragent et applaudissent les équipes dans la salle, en passant par les compositions fantasy et les pronostics réalisés partout dans le monde, ainsi que les proclamations stratégiques prononcées dans le confort de votre salon, jusqu'au personnel de la production qui monte le spectacle et, bien sûr, les joueurs pros qui concourent dans les cabines, tout cela contribue à créer un évènement incroyable auquel nous sommes honorés de participer. ",
      "Comme toujours, merci à toutes les équipes, aux personnalités et à toute la communauté de Dota d'avoir suivi cet évènement mondial et d'y avoir donné vie. Si vous avez raté des moments du tournoi, ou si vous voulez simplement revoir les actions les plus incroyables, rendez-vous sur la [url=https://www.youtube.com/user/dota2]chaine YouTube de Dota 2[/url] : vous y trouverez des rediffusions de tout l'évènement. Vous trouverez aussi de nombreuses photos du spectacle et de la compétition sur les comptes [url=https://www.instagram.com/dota2]Instagram[/url] et [url=https://www.flickr.com/photos/dota2ti/]flickr[/url] de Dota 2.",
      "[b]Célébrons les champions[/b]",
      "Des capsules d'autocollants à l'effigie des champions sont disponibles à l'achat. Chaque capsule contient un autocollant à l'effigie de Malr1ne, AMMAR_THE_F, Sneyking, ou Team Falcons. La moitié des recettes récoltées est directement reversée à Team Falcons.",
      "[b]Déballez vos récompenses[/b]",
      "Comme tout le monde l'a peut-être remarqué, le résultat de The International cette année était un tant soit peu… imprévisible. Heureusement, les récompenses du jeu Fantasy sont attribuées selon une courbe. Que vous fassiez partie du top 100 avec plus de 31 560 points, ou que vous vous situiez « seulement » dans les 15 % des participants et participantes qui ont durement gagné plus de 8 280 points, dirigez-vous dans votre client pour récupérer vos récompenses, ce jeudi 18 septembre.",
      "[b]Nouveau butin héroïque cosmique[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "The International est terminé, mais le thème cosmique de l'évènement de cette année ne disparaitra pas par la force des choses. Nous proposons en effet 17 ensembles d'items inédits en commémoration, avec des trésors immortels, des persona et plus encore, pour habiller vos héros et héroïnes préférés. Chaque trésor contient un ensemble pour Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin ou Lina, ainsi qu'une rare chance d'obtenir un ensemble pour Tinker, Ogre Magi, Luna ou Earthshaker. L'ensemble d'Earthshaker comprend même l'Arcane « Chute de la planète », qui revient pour la toute première fois. Entrez dans le jeu pour en découvrir l'intégralité."
    ],
    "commentcount": 230,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 3040,
    "votedowncount": 249,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758145650,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 3040,
  "votes_down": 249,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}