{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025 Şampiyonu",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025 Şampiyonu",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]The International 2025 şampiyonu Team Falcons'ı tebrik ediyoruz. Değişken sonuçlarla geçen bir yılın ardından Team Falcons, The International'daki en zorlu maratonlardan birinde verdiği büyük mücadele ve çabanın ardından nihayet Hamburg'da Şampiyonların Kalkanı'na ulaşabildi. On seriden sadece üçünü tek bir maç bile kaybetmeden kazandılar. Beş maçlık büyük final de dâhil olmak üzere diğer tüm maçlar çekişmeli geçti.",
      "Team Falcons, Nemesis ve Tundra'ya karşı 2-1'lik galibiyetle erken üstünlük sağladı. İlk aksiliği Xtreme Gaming'e karşı üç saat süren uzun mücadele sonucunda yaşadılar. Team Falcons bu maçı kaybetmiş olsa da mücadeleci ruhları gözlerden kaçmadı. Ardından Team Liquid'i 2-0 yendiler fakat Tidebound'a karşı oynadıkları seri çok daha şiddetli geçti. Team Falcons yenilerek bir anda elenme tehlikesiyle karşı karşıya kaldı. Peki eleme turundaki rakipleri kimdi? Turnuvanın favori takımı Team Spirit. Sonuç ne oldu? Team Falcons, 2-0'lık net bir galibiyetle istikrarlı bir şekilde üstünlüğünü koruyan takımı eledi. Team Falcons tam zamanında kanatlanarak ana aşamaya çıkmayı başardı.",
      "Barclays Arena'ya rövanş maçıyla giriş yaparak Tidebound'u 2-0'lık skorla mağlup ettiler. Team Falcons, BB Team'e karşı oynadığı ilk maçı kaybetti. İkinci maçı kazanmak için riskten kaçınmak yerine agresif bir strateji uygulamayı seçtiler. Üçüncü maçta Team Falcons, BB Team üzerinde büyük bir baskı kurarak maçın kontrolünü tamamen ele geçirdi. Bir sonraki rakipleri PVISION takımıydı. İlk maçta ağır bir hücumla karşılaşan Team Falcons, ikinci maçta toparlanarak beraberliği yakaladı. Team Falcons serinin son maçında, taraftarların coşkuyla izlediği bir saatlik maçın ardından galibiyeti alarak Büyük Final'e yükselmeyi başardı.",
      "Son günde, Team Falcons'ın Şampiyonların Kalkanı'nı kazanmak için kendilerini mağlup eden bir takımı yenmesi gerekiyordu. Xtreme Gaming, zorlu bir alt grup finalinden çıkarak rövanş maçına çıkmayı başardı. Xtreme Gaming ilk maçta rakibi Team Falcons'ı ezip geçti. Team Falcons, bir sonraki maçta karşılık vererek onlara ağır bir yenilgi tattırdı. Başa baş giden üçüncü maçta Xtreme Gaming rakiplerini yok ederek 2-1'lik üstünlük sağladı. Team Falcons dördüncü maçta oyunu çevirerek elenmekten kurtuldu ve kazananı belirlemek üzere beşinci maça çıktılar.",
      "Kazananı belirleyecek bu maçta Teams Falcons güçlü kahraman seçimleriyle yıkıcı bir kombo yaparak 15. dakika sonrasında haritanın kontrolünü ele geçirdi. Xtreme Gaming rakibine cesurca karşı koysa da Team Falcons düşman kahramanlarını yerle bir ederek Şampiyonların Kalkanı'nı almayı hak etti.",
      "Zaferin nihai sembolünü kazanan takım üyelerinin adları sonsuza kadar Şampiyonların Kalkanı'nın üzerinde yer alacak:",
      "[b]2025 - Team Falcons[/b]",
      "[list]",
      "[*]Oliver \"skiter\" Lepko",
      "[*]Stanislav \"Malr1ne\" Potorak",
      "[*]Ammar \"AMMAR_THE_F\" Alassaf",
      "[*]Andreas \"Cr1t-\" Nielsen",
      "[*]Jingjun \"Sneyking\" Wu",
      "[/list]",
      "[b]Turnuvaya Genel Bakış[/b]",
      "Dota'nın kendisi gibi The International da sayısız değişken faktörden oluşan etkileyici bir oluşumdur. Arenada tezahürat eden taraftarlar, dünyanın dört bir yanından yapılan fantezi kadroları ve tahminler, evdeki izleyicilerin sunduğu taktikler, gösteriyi hazırlayan prodüksiyon ekibi ve elbette kabinlerde mücadele eden oyuncular; tüm bunlar parçası olmaktan onur duyduğumuz inanılmaz derecede özel bir etkinlik yaratıyor. ",
      "Her zaman olduğu gibi, bu dünya çapındaki kutlamayı yeniden düzenlememize yardımcı oldukları için tüm oyunculara, ekip üyelerine ve Dota topluluğundaki herkese tekrar teşekkür ederiz. Turnuvanın kaçırdığınız kısımları olduysa veya inanılmaz anları tekrar izlemek istiyorsanız [url=https://www.youtube.com/user/dota2]Dota 2 YouTube kanalına[/url] giderek gösterinin tamamının tekrarlarını bulabilirsiniz. Ayrıca, [url=https://www.instagram.com/dota2/]Dota 2 Instagram[/url] ve [url=https://www.flickr.com/photos/dota2ti/]Dota 2 flickr[/url] üzerinden etkinliğe ait çeşitli fotoğrafları bulabilirsiniz.",
      "[b]Şampiyonların Anısına[/b]",
      "Team Falcons için özel Şampiyon sürümü çıkartma kapsülleri satışta. Her kapsülde skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking veya Team Falcons'ın yer aldığı bir çıkartma bulunuyor. Satışlardan elde edilen gelirin %50'si doğrudan Team Falcons'a gider.",
      "[b]Ödüllerinizi Açın[/b]",
      "Herkesin tahminlerinden de belli olduğu üzere The International'ın bu yılki sonucu biraz... tahmin edilemezdi. Neyse ki fantezi ödülleri yüzdelik dilimlere göre belirleniyor. 31560+ puanla ilk 100'e girmiş ya da zar zor kazandığınız 8280+ puanla \"sadece\" ilk %15'e girmiş olsanız da, 18 Eylül Perşembe günü istemciye girerek ödüllerinizi alabilirsiniz.",
      "[b]Yeni Kozmik Kahraman Ganimeti[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "The International sona ermiş olabilir ancak bu yılki etkinliğin kozmik cazibesi kaybolmayacak, çünkü en sevdiğiniz kahramanlar için ölümsüz eşyalar, kişilikler ve daha fazlasını içeren 17 yeni, özel temalı setimiz var. Her hazine Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin veya Lina için bir set içerir. Ayrıca nadir bir Tinker, Ogre Magi, Luna veya Earthshaker seti kazanma şansı da sunar. Earthshaker seti, tanıtılmasından bu yana ilk kez yeniden sunulan \"Gezegene İniş\" gizemli eşyasını da içeriyor. Tüm koleksiyona göz atmak için hemen oyuna girin."
    ],
    "commentcount": 208,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2573,
    "votedowncount": 212,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758131836,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2574,
  "votes_down": 212,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}