{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Vinnarna av The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Vinnarna av The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Grattis till Team Falcons, vinnarna av The International 2025! Efter ett år med blandade resultat nådde Team Falcons äntligen toppen och Aegis of Champions i Hamburg – genom en benhård kamp i ett av de grymmaste maraton som The International någonsin har skådat. Av tio serier var det bara tre där de fick full pott. Alla andra matcher blev utdragna, inklusive finalen med sina fem matcher.",
      "Falcons etablerade sig tidigt med 2–1-segrar över Nemesis och Tundra. Deras första farthinder kom mot Xtreme Gaming, i en långdragen kamp på tre timmar. Falcons föll slutligen, men deras motståndskraft var tydlig. Därefter utplånade de Team Liquid med en 2–0-seger, men den följande serien mot Tidebound var betydligt mer turbulent. Falcons förlorade, och plötsligt var eliminering nära förestående. Och vilka väntade i utslagsrundan? Team Spirit, favoritlaget i turneringen. Resultatet? Falcons segrade med 2–0, vilket skickade hem det ständiga kraftpaketet. Team Falcons fick luft under vingarna precis i tid till huvudeventet.",
      "De startade kvartsfinalen på Barclays Arena revanschlystna och besegrade Tidebound med 2–0. Falcons förlorade den första matchen mot BB Team. Istället för att spela säkert satsade de på offensiva hjälteval för att vinna den andra matchen. I match tre tog Falcons snabbt strypgrepp på BB. Därefter väntade PVISION. Falcons led svåra kval i den första matchen, men tog hem den andra och jämnade ut resultatet. Som grädde på moset i den tredje matchen säkrade Falcons sin biljett till slutfinalen genom att leverera en timmes lång triumf som fick publiken på fötterna.",
      "Den sista dagen stod bara ett lag mellan Team Falcons och Aegis of Champions, och det var ett av de två lag som besegrat dem på vägen till The International. Xtreme Gaming hade överlevt en intensiv final i den nedre gruppen och var redo för en returmatch. I den första matchen blev Falcons slagna i spillror av Xtreme. Falcons svarade direkt med en imponerande seger i nästa match. Match tre verkade jämn – tills Xtreme avgjorde matchen genom att slå ut hela Team Falcons. Nu var Falcons i ett 1–2-underläge. De kämpade sig tillbaka i match fyra för att undvika eliminering och tvinga fram ett avgörande genom en femte match.",
      "I den avgörande kampen släppte Falcons lös en ödeläggande kombination av hjältar i stridens hetta, och från och med den 15:e minuten tog de kontroll över kartan. Xtreme Gaming bjöd på en tapper försvarsinsats, men till slut övermannade Team Falcons fiendens hjältar och krossade Ancient – och Aegis of Champions var deras.",
      "Som innehavare av den ultimata segersymbolen ska följande namn för evigt ristas in på Aegis of Champions:",
      "[b]2025 – Team Falcons[/b]",
      "[list]",
      "[*]Oliver ”skiter” Lepko",
      "[*]Stanislav ”Malr1ne” Potorak",
      "[*]Ammar ”AMMAR_THE_F” Alassaf",
      "[*]Andreas ”Cr1t-” Nielsen",
      "[*]Jingjun ”Sneyking” Wu.",
      "[/list]",
      "[b]En tillbakablick[/b]",
      "Liksom själva Dota består The International av en vördnadsbjudande blandning av otaliga rörliga delar. Varje fan som hejar på i arenan, varje fantasilaguppställning och förutsägelse som görs runt om i världen, alla strategiförslag som görs från hemmets trygga vrå, produktionspersonalen som bygger upp showen och naturligtvis spelarna som tävlar i båset – allt bidrar till ett otroligt speciellt event som vi är hedrade att få delta i. ",
      "Som alltid vill vi tacka alla spelare och talanger samt alla i Dotas gemenskap för att ni hjälpte till att göra detta firande möjligt. Om du missade någon del av turneringen eller om du helt enkelt vill återuppleva de mest otroliga ögonblicken, kan du gå till [url=https://www.youtube.com/user/dota2]Dota 2:s YouTube-kanal[/url] där det går att se repriser från hela turneringen. Det finns dessutom en mängd bilder från eventet på [url=https://www.instagram.com/dota2/]Dota 2:s Instagram[/url] och [url=https://www.flickr.com/photos/dota2ti/]Dota 2:s flickr[/url].",
      "[b]Fira mästarna[/b]",
      "Särskilda mästarklistermärkeskapslar för Team Falcons finns att köpa. Varje kapsel innehåller ett klistermärke med skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking eller Team Falcons. 50 % av intäkterna går direkt till Team Falcons.",
      "[b]Packa upp dina belöningar[/b]",
      "Som alla kanske har märkt var resultatet av The International i år en aning ... oförutsägbart. Så det är bra att belöningarna delas ut baserat på allas resultat. Oavsett om du är bland de 100 bästa med otroliga 31 560 poäng eller mer, eller ”bara” någon bland de 15 % bästa med dina surt förvärvade 8 280 poäng eller mer, kan du hämta dina priser i klienten torsdagen den 18 september.",
      "[b]Ny skatt: Cosmic Heroes’ Hoard[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "Även om The International är över, behöver inte de kosmiska föremålen från årets event ta slut. Vi har 17 helt nya föremålsset med specialtema – med odödliga föremål, personor och mer – som du kan svepa in dina favorithjältar i. Varje skatt innehåller ett set för Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin eller Lina. Dessutom finns chansen att lägga till ett sällsynt set för Tinker, Ogre Magi, Luna eller Earthshaker. Earthshaker-setet innehåller till och med hjältens arcana Planetfall, som återvänder för första gången. Ge dig in i spelet och kolla in hela utbudet."
    ],
    "commentcount": 228,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2979,
    "votedowncount": 242,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758142228,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2974,
  "votes_down": 242,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}