{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Campeões do International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Campeões do International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Parabéns à Team Falcons, Grande Campeã do International 2025. Após um ano de altos e baixos, a Team Falcons enfim conquistou a Égide dos Campeões em Hamburgo — com garras e unhas, em uma das maratonas mais árduas já vistas no International. Das dez séries disputadas, apenas três foram de zero. Todas as outras batalhas foram até o fim, incluindo uma Grande Final com cinco partidas.",
      "A Falcons se consolidou logo no início, com vitórias de 2 a 1 sobre a Nemesis e Tundra. O primeiro tropeço aconteceu contra a Xtreme Gaming, em uma longa disputa de três horas. No fim, acabou derrotada, mas mostrou toda a sua resiliência. Em seguida eliminou a Team Liquid por 2 a 0, mas a série seguinte, contra a Tidebound, foi muito mais turbulenta. A Falcons perdeu e, de repente, a eliminação batia à porta. A adversária na rodada eliminatória? Nada mais que a favorita do torneio: Team Spirit. O resultado? Um 2 a 0 de respeito da Falcons, que mandou a potência perene de volta para casa. A Team Falcons havia recuperado as suas asas bem a tempo da fase principal.",
      "Ela estreou na Barclays Arena lavando a alma: uma varrida de 2 a 0 em cima da Tidebound. Já contra a BB Team, a Falcons perdeu a primeira partida. Longe de jogar com cautela, foram para cima com uma escalação agressiva e levaram a segunda. Na terceira, a Falcons dominou rapidamente a BB, deixando-a sem saída. A próxima foi a PVISION. A Falcons apanhou feio na primeira partida, mas deu o troco na segunda e deixou tudo igual. Na decisiva terceira partida, a Falcons garantiu a vaga na Grande Final após uma disputa de mais uma hora, levando o público ao delírio.",
      "Mas para finalmente levantar a Égide dos Campeões, a Team Falcons precisava vencer justamente a única outra equipe que havia conseguido derrotá-la. A Xtreme Gaming sobreviveu a uma intensa final da chave inferior para garantir uma revanche à altura. Na primeira partida, a Xtreme trucidou a concorrência, o que teve uma resposta imediata da Falcons, que deu uma surra impressionante na partida seguinte. A terceira partida estava equilibrada, até que a Xtreme matou toda a equipe inimiga e deixou a partida ao seu favor, culminando em uma vantagem de 2 a 1 na série. Mas a Falcons lutou com unhas e dentes na quarta partida para evitar a eliminação e forçar a quinta e decisiva.",
      "Na última partida, a Falcons apostou em uma forte escalação de heróis que garantiu uma sinergia disruptiva, e a partir dos 15 minutos passaram a dominar o mapa. A Xtreme Gaming resistiu bravamente na defesa, mas, no final, a Team Falcons avançou contra os heróis adversários e destruiu o Ancestral — garantindo a Égide dos Campeões.",
      "Como portadores do símbolo supremo da vitória, esses nomes estarão para sempre inscritos na Égide dos Campeões:",
      "[b]2025 — Team Falcons[/b]",
      "[list]",
      "[*]Oliver \"skiter\" Lepko",
      "[*]Stanislav \"Malr1ne\" Potorak",
      "[*]Ammar \"AMMAR_THE_F\" Alassaf",
      "[*]Andreas \"Cr1t-\" Nielsen",
      "[*]Jingjun \"Sneyking\" Wu",
      "[/list]",
      "[b]Olhando para trás[/b]",
      "Assim como o próprio Dota, o International é uma combinação impressionante de inúmeros fatores. Cada fã torcendo na arena, cada escalação dos sonhos e palpite feito ao redor do mundo, todas as proclamações de estratégia feitas da segurança da sua casa, a equipe de produção que monta o torneio e, claro, os jogadores competindo nas cabines — tudo isso resulta em um evento incrivelmente especial do qual temos a honra de participar. ",
      "Como sempre, gostaríamos de agradecer a todos os jogadores, personalidades e à comunidade do Dota por nos ajudarem a dar vida a essa comemoração global. Caso tenha perdido alguma parte do torneio, ou queira reviver as jogadas incríveis, acesse o [url=https://www.youtube.com/user/dota2]canal do Dota 2 no YouTube[/url] para encontrar reprises de todo o torneio. Você também pode encontrar um estoque de fotos do evento no [url=https://www.instagram.com/dota2]Instagram do Dota 2[/url] e [url=https://www.flickr.com/photos/dota2ti/]Flickr do Dota 2[/url].",
      "[b]Comemore os campeões[/b]",
      "Os adesivos da edição especial dos campeões — Team Falcons — já estão disponíveis para compra. Cada cápsula contém um adesivo de skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking ou do logotipo da Team Falcons. 50% da receita vai diretamente para a Team Falcons.",
      "[b]Desembrulhe as suas recompensas[/b]",
      "Como os palpites de todos vocês devem ter apontado, o International deste ano foi um pouco... imprevisível. Sorte que as recompensas do Dota dos Sonhos são concedidas comparativamente. Esteja você entre os 100 melhores com incríveis 31.560+ pontos, ou \"apenas\" entre os 15% melhores com os seus suados 8.280+, você poderá abrir o cliente e resgatar as suas recompensas nesta quinta-feira, 18 de setembro.",
      "[b]Novo Tesouro Heroico Cósmico[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "O International até pode ter acabado, mas a cosmicidade do evento deste ano não precisa acabar nunca, pois temos 17 novos conjuntos temáticos inéditos — contando com Imortais, personas e mais — para embelezar os seus heróis favoritos. Cada tesouro contém um conjunto para o Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin ou Lina, além de uma chance adicional de obter conjuntos raros para o Tinker, Ogre Magi, Luna ou Earthshaker. Inclusive, o conjunto para o Earthshaker inclui o Arcano do herói, Domínio Planetar, que retorna pela primeira vez. Entre no jogo e confira todas as opções."
    ],
    "commentcount": 199,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2392,
    "votedowncount": 195,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758126089,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2384,
  "votes_down": 194,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}