{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Die Champions von The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Die Champions von The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Herzlichen Glückwunsch an Team Falcons, die Champions von The International 2025. Nach einem Jahr mit Höhen und Tiefen fand Team Falcons zum richtigen Zeitpunkt seine Bestform in Hamburg und konnte nach einem der aufreibendsten Turniere in der Geschichte Dotas die Ägis der Champions erringen. Die Champions gewannen nur drei ihrer zehn Serien, ohne eine Partie abzugeben. Jeder andere Schlagabtausch ging über die volle Distanz, inklusive des Best-of-Five-Finales gegen Xtreme Gaming.",
      "Team Falcons gelang mit zwei 2:1-Siegen gegen Team Nemesis und Tundra Esports ein starker Turnierstart. Es folgte eine Niederlage gegen Xtreme Gaming, denen es gelang, skiter & Co in einem dreistündigen Play-off-Marathon niederzuringen. Obwohl Team Falcons letztlich den Kürzeren zog, war die Hartnäckigkeit von skiter, Malr1ne, AMMAR_THE_F, Cr1t- und Sneyking nicht zu übersehen. Das musste Team Liquid in der nächsten Partie mit 2:0 schmerzlich erfahren. Mehr Widerstand leistete anschließend Team Tidebound. Team Falcons steckte eine weitere Niederlage ein und plötzlich drohte das Aus. Und wer wartete in der Ausscheidungsrunde? Der Turnierfavorit Team Spirit! Das Ergebnis? Nach zwei Partien stand Team Falcons als Sieger fest und ein hoch eingeschätztes Team Spirit konnte seine Koffer packen. Die Falken hatten ihre Flügel gespreizt und sich eine Landung auf der Hauptbühne der Hamburger Barclays Arena verdient.",
      "Im Viertelfinale des Oberen Bracket gelang mit 2:0 die Revanche gegen Team Tidebound. Die erste Partie gegen BB Team endete in einer Niederlage. Team Falcons ließ sich davon jedoch nicht einschüchtern und nach einer aggressiven Heldenauswahl war das Ergebnis der zweiten Partie 1:1. In der entscheidenden dritten Partie hatte Team Falcons schnell Oberwasser und zog mit fliegenden Fahnen ins Finale des Oberen Bracket ein. Dort wartete PVISION. Die Schützlinge von Coach Kurtis „Aui_2000“ Ling mussten zunächst eine schmerzliche Niederlage einstecken, ehe sie in der zweiten Partie mit einem 1:1 den Ausgleich erzielten. In der ausgeglichenen dritten Partie sicherte sich Team Falcons den direkten Weg ins Finale, wobei der einstündige, entscheidende Kampf auf der Hauptbühne die Halle zum Beben brachte.",
      "Zwischen Team Falcons und der Ägis der Champions stand jetzt nur noch ein Team, welches jedoch auf dem Weg zu The International gezeigt hatte, wie Team Falcons zu schlagen ist. Xtreme Gaming hatte ein intensives Finale im Unteren Bracket gegen PVISION überlebt, und war bereit für das große Finale, denn in der ersten Partie hatte Team Falcons keine Chance. Partie Nummer zwei wiederum entpuppte sich als ein Spaziergang für die späteren Sieger. Beide Teams konnten anschließend die dritte Partie ausgeglichener gestalten – bis Xtreme Gaming mit der vollständigen Auslöschung des Gegners die Oberhand gewann und eine 2:1-Führung erzielte. In der vierten Partie schlug Team Falcons umgehend zurück und erzwang eine entscheidende fünfte Partie.",
      "Bei der letzten Heldenauswahl sicherte sich Team Falcons mit Naga Siren und Medusa eine unsterbliche Kombo und übernahm ab der 15. Minute die Kontrolle über die Karte. Xtreme Gaming leistete tapfer Abwehr, aber am Ende stürmte Team Falcons unaufhaltsam die Basis der Radiant und zerschmetterte den Ancient – die Ägis der Champions gehörte ihnen.",
      "Als Träger des ultimativen Siegessymbols sollen diese Namen für immer auf der Ägis der Champions zu lesen sein:",
      "[b]Team Falcons 2025[/b]",
      "[list]",
      "[*]Oliver „skiter“ Lepko",
      "[*]Stanislav „Malr1ne“ Potorak",
      "[*]Ammar „AMMAR_THE_F“ Alassaf",
      "[*]Andreas „Cr1t-“ Nielsen",
      "[*]Jingjun „Sneyking“ Wu",
      "[/list]",
      "[b]Ein Blick zurück[/b]",
      "Wie Dota selbst ist The International ein beeindruckendes Werk aus unzähligen beweglichen Teilen. Jeder jubelnde Fan in der Arena, jeder Fantasy-Kader, jede Prognose, jeder Ratschlag von Strategen, die zu Hause auf ihrem Sofa sitzen, jeder Mitarbeiter des Produktionsteams und natürlich jeder Spieler, der in den schalldichten Kabinen auf der Hauptbühne sein Bestes gibt – sie alle kommen für ein fantastisches Event zusammen. Und für Valve ist es eine Ehre, dazuzugehören. ",
      "Wir möchten uns bei allen Spielern, Talenten und der gesamten Dota-Community dafür bedanken, dass wir The International erneut gemeinsam erleben durften. Falls Sie Partien des Turniers verpasst haben oder einige der unglaublichen Spielmomente erneut erleben möchten, können Sie sich auf dem [url=https://www.youtube.com/user/dota2]YouTube-Kanal von Dota 2[/url] Aufnahmen des gesamten Turniers anschauen. Auf [url=https://www.instagram.com/dota2]Instagram[/url] und [url=https://www.flickr.com/photos/dota2ti/]flickr[/url] können Sie auch zahlreiche Fotos vom Event ansehen.",
      "[b]Ein Hoch auf die Champions[/b]",
      "Besondere Aufkleberkapseln der Champions sind jetzt für Team Falcons erhältlich. Jede Kapsel enthält einen Aufkleber von skiter, Malr1ne, AMMAR_THE_F, Cr1t- und Sneyking oder das Teamlogo von Team Falcons. 50 % aller Erlöse aus dem Verkauf fließen direkt an Team Falcons.",
      "[b]Enthüllen Sie Ihre Belohnungen[/b]",
      "Wie jeder beim Blick auf die eigenen Prognosen feststellen musste, war der Ausgang von The International dieses Jahr … ein wenig unvorhersehbar. Glücklicherweise wird bei der Ausschüttung der Fantasy-Belohnungen die Leistung aller Teilnehmer insgesamt berücksichtigt. Egal, ob Sie mit unglaublichen 31 560 oder mehr Punkten unter den Top 100 gelandet sind oder mit Ihren hart verdienten 8280 oder mehr Punkten „nur“ zu den besten 15 Prozent gehören, Sie können am Donnerstag, dem 18. September, im Client Ihre Preise abholen.",
      "[b]Neu: Kosmischer Heldenschatz[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "Die Internationale mag vorbei sein, aber die kosmische Faszination des diesjährigen Events muss niemals enden. Denn wir haben 17 brandneue Gegenstandssets – darunter Immortal-Gegenstände und Personas – für Ihre Lieblingshelden vorbereitet. Jeder Schatz enthält ein Set für Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin und Lina sowie die Möglichkeit, ein seltenes Set für Tinker, Ogre Magi, Luna oder Earthshaker hinzuzufügen. Das Set für Earthshaker beinhaltet sogar den erstmals zurückkehrenden Arkana-Gegenstand „Planetentod“. Fahren Sie am besten gleich Ihren Client hoch, starten Sie Dota 2 und schauen Sie sich das gesamte Angebot an!"
    ],
    "commentcount": 211,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2649,
    "votedowncount": 216,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758134175,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2639,
  "votes_down": 216,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}