{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Marii campioni ai turneului The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Marii campioni ai turneului The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Felicitări Team Falcons, marea campioană a turneului The International 2025. După un an plin de suișuri și coborâșuri, Team Falcons a reușit în cele din urmă să câștige trofeul Aegis of Champions în Hamburg, dând dovadă de multă determinare într-unul dintre cele mai dificile maratoane din istoria campionatului The International. Din cele zece manșe jucate, Team Falcons a reușit să se impună categoric doar în trei dintre acestea. În cazul celorlalte confruntări, a fost necesară disputarea tuturor meciurilor pentru determinarea câștigătoarei, inclusiv disputarea a 5 meciuri în marea finală.",
      "Team Falcons s-a impus în primele două manșe cu un scor de 2-1 împotriva echipelor Nemesis și Tundra. Prima poticnire a echipei a avut loc în confruntarea cu Xtreme Gaming, o luptă intensă care a durat trei ore. Team Falcons a fost înfrântă în cele din urmă, însă perseverența echipei nu a trecut neobservată. În următoarea confruntare, aceasta s-a impus categoric cu un scor de 2-0 împotriva celor de la Team Liquid, însă manșa următoare disputată cu Tidebound s-a dovedit a fi una mult mai dificilă. Team Falcons a pierdut, iar odată cu această înfrângere a venit și riscul de eliminare din cadrul competiției. Care avea să fie adversara din runda eliminatorie? Team Spirit, echipa favorită a turneului. Rezultatul? 2-0 pentru Falcons, rezultat care i-a trimis acasă pe maeștrii de la Team Liquid. Team Falcons și-a recăpătat astfel puterile la momentul potrivit pentru a avansa în etapa principală a campionatului.",
      "Prima manșă de la Barclays Arena a celor de la Team Falcons avea să fie una de revanșă, care s-a încheiat cu o victorie categorică: un scor de 2-0 împotriva celor de la Tidebound. În fața celor de la BB Team, Team Falcons a pierdut primul meci. În cel de-al doilea meci, în loc să meargă la sigur, membrii echipei s-au aventurat cu o selecție de eroi agresivă și au reușit să câștige meciul. În al treilea meci, Team Falcons i-a redus rapid la tăcere pe cei de la BB Team. Ulterior a urmat confruntarea cu PVISION. Team Falcons a avut parte de o înfrângere dureroasă în primul meci, dar s-a redresat în cel de-al doilea și a restabilit egalitatea la nivel de scor general. În cel de-al treilea meci care avea să fie unul decisiv, Team Falcons a luptat din răsputeri pentru a-și asigura un loc în marea finală, reușind să triumfe în urma meciului care a durat mai bine de o oră și care a dus publicul în extaz.",
      "Pentru a revendica trofeul Aegis of Champions în ultima zi, Team Falcons avea să înfrângă singura echipă rămasă împotriva căreia pierduse anterior. Xtreme Gaming a făcut față finalei intense din grupa inferioară pentru a ajunge să dispute o revanșă pe măsură în marea finală. În primul meci, Xtreme Gaming le-a dat lecții celor de la Team Falcons. Team Falcons nu s-a lăsat însă mai prejos și s-a impus categoric în meciul al doilea. Cel de-al treilea meci părea să fie unul echilibrat, până în momentul în care Xtreme Gaming a reușit să răpună întreaga echipă adversă și să câștige meciul. Team Falcons și-a revenit în cel de-al patrulea meci pentru a evita eliminarea și a forța disputarea celui de-al cincilea meci.",
      "În meciul decisiv, Team Falcons a venit cu o selecție puternică de eroi și a dezlănțuit o forță devastatoare pe câmpul de luptă, reușind în minutul 15 să preia controlul asupra hărții. Xtreme Gaming a încercat să țină piept cu vitejie provocărilor ce au urmat, dar, în cele din urmă, Team Falcons a reușit să-și zdrobească adversarii și să distrugă ancientul, asigurându-și astfel trofeul Aegis of Champions.",
      "Drept simbol suprem al acestei victorii importante, numele acestor jucători vor fi gravate pentru totdeauna pe trofeul Aegis of Champions:",
      "[b]2025 – Team Falcons[/b]",
      "[list]",
      "[*]Oliver „skiter” Lepko",
      "[*]Stanislav „Malr1ne” Potorak",
      "[*]Ammar „AMMAR_THE_F” Alassaf",
      "[*]Andreas „Cr1t-” Nielsen",
      "[*]Jingjun „Sneyking” Wu",
      "[/list]",
      "[b]Retrospectivă[/b]",
      "Asemenea jocului Dota, The International este un amestec impresionant de factori aflați în armonie. Toți fanii care-și aclamă echipele în arenă, toate formațiile Fantasy și pronosticurile realizate la nivel mondial, toate declarațiile strategice făcute din siguranța propriei locuințe, echipa de producție care se ocupă de întregul spectacol și, desigur, jucătorii care concurează în cabine contribuie la acest eveniment incredibil de special la care suntem onorați să luăm parte. ",
      "Ca întotdeauna, am dori să le mulțumim din nou tuturor jucătorilor, realizatorilor și celor din comunitatea Dota care ne-au susținut și au făcut posibilă această sărbătorire mondială. Dacă ai ratat vreun meci sau dorești să vezi din nou momentele fantastice ale acestui turneu, accesează [url=https://www.youtube.com/user/dota2]canalul Dota 2 de YouTube[/url] pentru a putea urmări reluările întregului turneu. De asemenea, o mulțime de fotografii de la eveniment sunt disponibile pe [url=https://www.instagram.com/dota2/]contul Dota 2 de Instagram[/url] și [url=https://www.flickr.com/photos/dota2ti/]contul Dota 2 de Flickr[/url].",
      "[b]Sărbătorirea campionilor[/b]",
      "Capsulele cu ediția specială a abțibildurilor cu campioni sunt disponibile acum spre achiziție pentru Team Falcons. Fiecare capsulă conține un abțibild cu skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking sau Team Falcons. 50% din toate încasările generate vor fi distribuite direct către Team Falcons.",
      "[b]Bucură-te de recompense[/b]",
      "După cum toată lumea a observat, campionatul de anul acesta a fost unul imprevizibil. Totuși, este un lucru bun că recompensele Fantasy sunt distribuite în funcție de performanța fiecăruia. Fie că te afli printre primii 100 de jucători care au reușit să strângă un număr surprinzător de peste 31.561 de puncte sau „doar” te afli printre cei mai buni 15% cu peste 8.280 de puncte obținute cu greu, accesează clientul joi, 18 septembrie, pentru a-ți revendica premiile.",
      "[b]Noua comoară Cosmic Heroes' Hoard[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "Chiar dacă această ediție a campionatului The International a luat sfârșit, tema sa cosmică din acest an trebuie să dăinuie pentru totdeauna. Din acest motiv, astăzi lansăm această comoară cu 17 seturi de obiecte complet noi, printre care se numără seturi Immortal, Persona și multe altele pentru eroii tăi preferați. Fiecare comoară conține un set pentru Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin sau Lina, dar și șansa de a obține un set bonus rar pentru Tinker, Ogre Magi, Luna sau Earthshaker. Setul pentru Earthshaker conține inclusiv obiectul Arcana „Planetfall” al eroului, acesta revenind pentru prima dată. Acestea fiind spuse, pornește jocul pentru a descoperi noul conținut."
    ],
    "commentcount": 209,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2616,
    "votedowncount": 216,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758133376,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2614,
  "votes_down": 216,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}