{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Чемпионы The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Чемпионы The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Поздравляем команду Team Falcons — чемпионов The International 2025. В течение последнего года команда выступала с переменным успехом, но всё же завоевала титул чемпионов в Гамбурге, расцарапав и расклевав всех противников, которых они повстречали в одном из самых безжалостных марафонов в истории The International. Из десяти матчей только три они выиграли вчистую. Остальные сражения подзатянулись, а в гранд-финале команде пришлось сыграть пять игр.",
      "«Соколы» сразу заявили о себе, одержав победы над командами Nemesis и Tundra со счётом 2:1. С первыми трудностями они столкнулись в трёхчасовой борьбе против Xtreme Gaming: в итоге команда Falcons проиграла, но во всей красе показала свою стойкость. Затем они разгромили Team Liquid со счётом 2:0, но следующий матч против Tidebound доставил им немало проблем. «Соколы» проиграли и внезапно оказались под угрозой вылета. Кто же стал их соперником в матче на выбывание? Team Spirit — фавориты турнира. Каким был результат? Победа Falcons со счётом 2:0. Извечные тяжеловесы отправились паковать чемоданы, а победа над ними окрылила будущих чемпионов к началу основного этапа.",
      "Свою игру на «Барклейс-арене» они начали с реванша, одержав победу над Tidebound со счётом 2:0. Противостояние «Соколов» с BB Team ознаменовалось поражением в первой игре. Вместо того чтобы проявить осторожность, они прибегли к агрессивному подбору героев, чтобы выиграть вторую. Ну а в третьей Falcons быстро расправились с соперниками. Следующими на их пути оказались PVISION. «Соколы», потерпев сокрушительное поражение в первой игре, во второй сумели сравнять счёт, а в третьей сражались целый час, чтобы под ликование публики вырвать победу в матче и обеспечить себе путёвку в гранд-финал.",
      "Чтобы завоевать Эгиду чемпионов в последний день, Team Falcons нужно было одолеть единственную команду, которая их обыграла. Xtreme Gaming вышли победителями из напряжённого финала нижней сетки, чтобы дать соперникам достойный реванш. В первой игре Xtreme разгромили Falcons. В следующей Falcons нанесли сокрушительное поражение в ответ. Третья игра казалась равной, пока ход матча не был переломлен убийством всех «Соколов». Со счётом 1:2 они оказались на грани поражения. В четвёртой игре им удалось выкарабкаться из ситуации, избежать выбывания и навязать решающую пятую игру.",
      "В последней игре Falcons пустили в бой сильную обезвреживающую комбинацию героев и уже с 15-й минуты взяли карту под свой контроль. Xtreme Gaming мужественно оборонялись, но в конце концов Team Falcons пробились сквозь вражеских героев и уничтожили Древнего. Эгида чемпионов по праву досталась сильнейшим.",
      "Вот они, завоеватели почётнейшей награды, чьи имена навсегда войдут в историю и попадут на саму Эгиду чемпионов:",
      "[b]2025 год — Team Falcons[/b]",
      "[list]",
      "[*]Оливер skiter Лепко",
      "[*]Станислав Malr1ne Поторак",
      "[*]Аммар AMMAR_THE_F аль-Ассаф",
      "[*]Андреас Cr1t- Нильсен",
      "[*]Цзинцзюнь Sneyking У",
      "[/list]",
      "[b]Взгляд назад[/b]",
      "The International, как и сама Дота, представляет собой грандиозную смесь бесчисленных переменных. Каждый болельщик на арене, каждый созданный фэнтези-состав и сделанный прогноз, каждое заявление о стратегии, высказанное дома перед экраном, ответственная за шоу студия, и, конечно же, соревнующиеся в кабинках игроки — всё вместе складывается в неповторимое мероприятие, в котором нам выпала честь участвовать. ",
      "Как всегда, мы хотели бы поблагодарить всех игроков, работников студии и всё сообщество Доты за то, что они помогли воплотить этот всемирный праздник в жизнь. Если вы пропустили какую-то часть турнира или просто хотите пересмотреть невероятные моменты, отправляйтесь на [url=https://www.youtube.com/user/dota2]канал Dota 2 на YouTube[/url], где вы найдёте записи всего шоу. Кроме того, на официальных страницах Dota 2 в [url=https://www.instagram.com/dota2/]Instagram[/url] и [url=https://www.flickr.com/photos/dota2ti/]Flickr[/url] есть множество фотографий с турнира.",
      "[b]Чествование чемпионов[/b]",
      "Уже доступна капсула с особыми чемпионскими наклейками команды Team Falcons. В ней содержится наклейка с логотипом команды Team Falcons либо с одним из её игроков: skiter, Malr1ne, AMMAR_THE_F, Cr1t- или Sneyking. Команда получает 50% от продаж каждой капсулы.",
      "[b]Получите свои награды[/b]",
      "Как наверняка заметили ваши сетки прогнозов, результаты The International этого года были... непредсказуемыми. Хорошо, что награды выдаются за то, что вы показали себя лучше, чем другие. Независимо от того, вошли вы в первую сотню с ошеломляющим результатом в 31 560 и более очков или «всего лишь» вошли в 15% лучших, тяжёлым трудом заработав 8 280 и более очков, 18 сентября вы получите свои призы, как только откроете клиент игры.",
      "[b]Новая сокровищница Cosmic Heroes' Hoard[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "The International закончился, но космический антураж события никуда не уходит, потому что мы приготовили 17 специальных тематических наборов предметов (среди них — Immortal-предметы, личности и не только), в которые вы сможете одеть своих любимых героев. В каждой сокровищнице есть набор для Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin или Lina, а также шанс получить редкие награды для Tinker, Ogre Magi, Luna или Earthshaker. А в наборе для Earthshaker впервые в истории игры возвращается Arcana-предмет Planetfall. Заходите в игру и оцените всю коллекцию."
    ],
    "commentcount": 228,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 8,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 3016,
    "votedowncount": 246,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758144088,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 3016,
  "votes_down": 246,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}