{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Đội vô địch giải The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Đội vô địch giải The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Xin chúc mừng Team Falcons, đội vô địch giải đấu The International 2025. Sau một năm với nhiều kết quả trái chiều, Team Falcons cuối cùng đã vươn cánh tới Aegis of Champions tại Hamburg — bằng cách cào cấu, và vật lộn trong cuộc đua marathon khắc nghiệt nhất The International từ trước đến nay. Trong loạt mười trận, họ chỉ thắng ba trận áp đảo. Tất cả trận khác đều hết sức trầy vi tróc vảy, bao gồm trận chung kết tổng với năm trận đấu.",
      "Falcons đã khẳng định vị thế ngay từ đầu với chiến thắng 2-1 trước Nemesis và Tundra. Vấp ngã đầu tiên là cuộc giằng co khốc liệt kéo dài 3 giờ với Xtreme Gaming. Falcons cuối cùng dù gục ngã, nhưng đã chứng minh toàn bộ sức chịu đựng của mình. Sau đó, họ đã đánh bại Team Liquid 2-0, nhưng chuỗi trận tiếp theo đối đầu Tidebound còn giông tố hơn nhiều. Falcons thua cuộc, và bất ngờ phải đối mặt với nguy cơ bị loại. Đối thủ tiếp theo trong vòng đấu loại? Team Spirit, ứng viên vô địch của giải đấu. Kết quả là? Màn chốt hạ 2-0 từ Team Falcons đã khiến đội tuyển mạnh lâu năm phải khăn gói rời sân. Những chú ó Falcons đã tìm kịp đôi cánh cho sân khấu chính.",
      "Họ đã báo thù Tidebound với tỷ số 2-0 trong trận mở màn tại Barclays Arena. Rồi khi đương đầu BB Team, Team Falcons thua trận đầu tiên. Thay vì chơi an toàn, họ đã hướng tới chiến thuật chọn tướng áp đảo để giành chiến thắng trong trận thứ hai. Trong trận ba, Team Falcons nhanh chóng đưa BB vào thế khóa chặt đường thở. Sau đó là tới lượt PVISION. Team Falcons đã chịu đựng pha đè bẹp đau đớn trong trận đầu, nhưng sau đó càn quét trong trận tiếp theo để gỡ hòa tỉ số. Kết thúc trong trận thứ ba, Falcons bấm thẳng tấm vé tới Chung kết tổng bằng cách giành chiến thắng ngoạn mục trong trận đấu dài một giờ, khiến đám đông hò reo theo dõi sự kiện trên sân khấu.",
      "Để giành lấy Aegis of Champions trong ngày cuối cùng, Team Falcons sẽ phải đánh bại một trong hai đội đã từng đè bẹp họ. Xtreme Gaming đã vượt qua trận chung kết nhánh dưới đầy cam go để chuẩn bị cho màn tái đấu kẻ tám lạng, người nửa cân. Trong trận đầu tiên, Xtreme đã xẻ miếng Falcons. Falcons đáp trả với pha đánh toang trong trận tiếp theo. Trận thứ ba có vẻ cân tài cân sức — cho tới khi một pha càn quét cả đội đã đẩy Team Falcons tới thế thua 1-2. Họ đã bấu víu trong trận bốn để tránh bị loại và gồng mình vào trận thứ năm phân định ngôi vô địch.",
      "Trong trận quyết định, lựa chọn đội hình mạnh mẽ của Falcons đã tung ra combo gián đoạn đột phá vào cuộc chiến, và từ phút 15 trở đi họ đã giành kiểm soát toàn bản đồ. Xtreme Gaming đã nỗ lực ngoan cường để phòng thủ, nhưng cuối cùng Team Falcons đã xé toạc đội hình tướng địch và phá nát Ancient — thế là Aegis of Champions đã thuộc về đội thắng cuộc.",
      "Với thành tích đạt được biểu tượng chiến thắng tối thượng, những cái tên sau đây sẽ mãi mãi được khắc lên Aegis of Champions:",
      "[b]2025 - Team Falcons[/b]",
      "[list]",
      "[*]Oliver \"skiter\" Lepko",
      "[*]Stanislav \"Malr1ne\" Potorak",
      "[*]Ammar \"AMMAR_THE_F\" Alassaf",
      "[*]Andreas \"Cr1t-\" Nielsen",
      "[*]Jingjun \"Sneyking\" Wu",
      "[/list]",
      "[b]Nhìn lại[/b]",
      "Như chính trò chơi Dota, giải đấu The International là sự kết hợp đầy thán phục từ vô số mảnh ghép khác nhau. Mỗi một người hâm mộ reo hò tại khán đài, từng đội hình và dự đoán Fantasy trên khắp thế giới, mọi lời luận bàn chiến lược hùng hồn trong căn nhà an yên, đội ngũ sản xuất chương trình, và tất nhiên các tuyển thủ tranh tài trong buồng đấu — tất cả cùng tạo nên một sự kiện phi thường mà chúng tôi vinh dự được tham gia. ",
      "Như thường lệ, chúng tôi xin cảm ơn tất cả tuyển thủ, khách mời, và hết thảy cộng đồng Dota đã góp phần hiện thực hóa sự kiện toàn cầu này. Nếu bạn bỏ lỡ phần nào của giải đấu, hay chỉ muốn xem lại những trận đấu ngoạn mục, hãy ghé qua [url=https://www.youtube.com/user/dota2]kênh YouTube Dota 2[/url] để tìm bản phát lại cho toàn bộ giải đấu. Bạn có thể tìm thấy kho ảnh sự kiện trên tài khoản [url=https://www.instagram.com/dota2/]Instagram Dota 2[/url] và [url=https://www.flickr.com/photos/dota2ti/]flickr Dota 2[/url].",
      "[b]Vinh danh đội vô địch[/b]",
      "Gói hình dán đặc biệt phiên bản đội vô địch cho Team Falcons đã mở bán. Mỗi gói sẽ bao gồm một hình dán có ảnh skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking, hoặc Team Falcons. 50% doanh số sẽ chuyển trực tiếp tới Team Falcons.",
      "[b]Mở gói phần thưởng[/b]",
      "Như mọi người có thể đã nhận thấy, kết quả giải đấu The International năm nay có chút... khó đoán. Nên phương pháp tính điểm cho phần thưởng Fantasy đã được điều chỉnh. Dù bạn nằm trong top 100 với số điểm 31.560+ đầy kinh ngạc, hay \"chỉ\" thuộc nhóm 15% cày cuốc vất vả để có hơn 8.280 điểm, cứ mạnh dạn mở phần mềm trò chơi để nhận thưởng vào thứ Năm ngày 18/09.",
      "[b]Của báu quần hùng cấp thiên hà mới[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "The International đã khép lại, nhưng các cạm bẫy thiên hà thuộc sự kiện năm nay chưa kết thúc, vì chúng tôi vừa ra mắt 17 bộ vật phẩm mới toanh cho chủ đề đặc biệt này — bao gồm trang bị bất diệt, nhân cách và nhiều nữa — tha hồ lên đồ cho các nhân vật tướng bạn yêu thích. Mỗi kho báu chứa một bộ cho Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin, hoặc Lina, cùng cơ hội để rinh luôn bộ vật phẩm hiếm cho Tinker, Ogre Magi, Luna, hoặc Earthshaker. Bộ của Earthshaker thậm chí còn kèm theo Arcana Planetfall, lần đầu tái xuất. Nhảy vào chơi ngay để khám phá tất tần tật nhé."
    ],
    "commentcount": 203,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 28,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2457,
    "votedowncount": 202,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758128351,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2456,
  "votes_down": 202,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}