{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Тържествените шампиони на The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Тържествените шампиони на The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Поздравления към Team Falcons, тържествените шампиони на The International 2025. След година от смесени резултати, Team Falcons най-сетне се извиси до Aegis of Champions в Хамбург, драпайки с нокти, боричкайки се и преодолявайки изтощителни премеждия по време на един от най-решителните маратони, които някога сме виждали на The International. От десетте им поредици, само три бяха победи с чисто помитане. Всяка друга битка упорито продължаваше чак до горчивия завършек, включително и гранд финал от пет игри.",
      "Team Falcons се установиха отрано при победи с 2 — 1 над Nemesis и Tundra. Първата им спънка настъпи срещу Xtreme Gaming в тричасова интензивна кавга. В крайна сметка Team Falcons паднаха, но тяхната издръжливост беше изявена напълно. След това пометоха Team Liquid с 2 — 0, но последвалата поредица срещу Tidebound беше много по-бурна. Team Falcons загубиха и внезапно елиминацията надвисваше над тях. Опонентите им в елиминационния рунд? Не кой да е, а Team Spirit, фаворитите на турнира. Резултатът? Изявление от 2 — 0 за Team Falcons, което запрати незатихващата мощ на опозицията обратно към дома им. Team Falcons бяха окрилени тъкмо навреме за главната сцена.",
      "Те откриха представянето си в Барклейкард арена с мъст. Победа с 2 — 0 над Tidebound. Срещу BB Team, Team Falcons изпуснаха първия мач. Вместо да играят на сигурно, те склониха към агресивен подбор, за да спечелят втория мач. В третия, Team Falcons бързо поставиха BB Team в задушаваща хватка. PVISION бяха следващите. Team Falcons абсорбираха болезнено потъпкване в първия мач, но се отърсиха във втория, за да изравнят набора. За капак на вечерта в третия мач, Team Falcons си осигуриха билет за гранд финала, като предоставиха едночасов триумф, при който тълпата гръмогласно реагираше на събитията по сцената.",
      "С цел да заявят Aegis of Champions през финалния ден, Team Falcons трябваше да разгромят единствения друг отбор, който ги беше бил. Xtreme Gaming бяха оцелели в напрегнат финал от долната скоба, за да установят подобаващ реванш. В първия мач, Xtreme Gaming разпердушиниха Team Falcons на парчета. Team Falcons веднага отвърнаха със зашеметяващ тупаник в следващия мач. Третият мач изглеждаше равностоен, докато преобръщащо играта отборно помитане не изтласка Team Falcons в пропаст от 1 — 2 за поредицата. Те издрапаха обратно в четвъртия мач, за да предотвратят елиминацията и да наложат решаващ пети двубой.",
      "В решителния мач, силният подбор от Team Falcons отприщи разрушителна комбинация в свадата и от 15 минута нататък те поеха контрола над картата. Xtreme Gaming положиха доблестни усилия за отбрана, но в крайна сметка Team Falcons нахлуха в базата на вражеските герои и разбиха Ancient… А така заявиха Aegis of Champions.",
      "Като предвестители на абсолютния победен символ, тези имена ще бъдат навеки изписани върху Aegis of Champions:",
      "[b]2025 — Team Falcons[/b]",
      "[list]",
      "[*]Оливър „skiter“ Лепко;",
      "[*]Станислав „Malr1ne“ Поторак;",
      "[*]Аммар „AMMAR_THE_F“ Ал-Асаф;",
      "[*]Андреас „Cr1t-“ Нийлсен;",
      "[*]Джингджун „Sneyking“ Ву.",
      "[/list]",
      "[b]Поглед назад[/b]",
      "Подобно на самата Dota 2, The International е вдъхновяваща смесица от безчет движещи се части. Всеки почитател ликуващ на арената. Всеки състав във въображаемата лига и всяка прогноза, направени по цял свят. Всички стратегически прокламации, направени от уюта на собствения Ви дом. Продуцентският персонал, който изгражда представлението. А разбира се и играчите, съревноваващи се в кабините. Всичко това допринася за едно невероятно специално събитие, в което за нас е чест да участваме. ",
      "Както винаги, бихме искали да благодарим на всички играчи, таланти и всеки от Dota 2 общността за това, че спомогнаха да осъществим този глобален празник. Ако сте пропуснали някоя част от турнира или просто искате пак да гледате удивителните проигравания, упътете се към [url=https://www.youtube.com/user/dota2]Dota 2 YouTube канала[/url]. Там можете да намерите повторения за цялото представление. Също така можете да намерите находки от снимки от събитието в [url=https://www.instagram.com/dota2/]Dota 2 Instagram[/url] и [url=https://www.flickr.com/ снимки/dota2ti/]Dota 2 Flickr[/url].",
      "[b]Ознаменувайте шампионите[/b]",
      "Специалното издание на капсулите с шампионски стикери вече е достъпно за Team Falcons. Всяка капсула съдържа един стикер, включващ skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking или Team Falcons. 50% от приходите при всички продажби ще отиват директно към Team Falcons.",
      "[b]Разопаковайте своите награди[/b]",
      "Както вероятно всички са забелязали по отношение на прогнозите за своите скоби, изходът от тазгодишния The International беше някак… непредсказуем. Ето защо е добре, че наградите за въображаемата лига се предоставят спрямо останалите. Независимо дали сте във върховите 100 с изумителните 31 560+ точки или „просто“ някой във върховите 15% с трудоемко спечелените си 8 280+, можете да се упътите към игралния клиент, за да получите наградите си този четвъртък, 18 септември.",
      "[b]Ново Heroes' Hoard — Cosmic 2025 съкровище[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "The International може да е приключил, но космическите украшения на тазгодишното събитие нивга не е нужно да свършват, защото имаме 17 съвсем нови набори с артикули на специална тематика. Това включва Immortal артикули, личности и още други, с които да обгърнете любимите си герои. Всяко съкровище съдържа набор за Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin или Lina, както и шанса да добави рядък такъв за Tinker, Ogre Magi, Luna или Earthshaker. Наборът за Earthshaker дори включва Planetfall Arcana артикула за героя, който се завръща за пръв път. Впуснете се в играта, за да проверите пълният шир от благини."
    ],
    "commentcount": 223,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2946,
    "votedowncount": 241,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758140720,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2943,
  "votes_down": 240,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}