{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Vítězové šampionátu The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Vítězové šampionátu The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Gratulujeme týmu Falcons, novopečeným vítězům šampionátu The International 2025! Po roce lepších i horších výsledků tahle skvadra konečně naplno roztáhla svá pomyslná křídla a v německém Hamburku si doletěla pro trofej Aegis of Champions. Nutno ovšem dodat, že to byl jeden z nejnáročnějších vzestupů v historii šampionátu a jenom tři z deseti zápasů byly jednoznačné – ve všech ostatních včetně velkého finále se bojovalo vždy až do poslední minuty.",
      "Tým Falcons zahájil svoji cestu výhrami 2–1 nad týmy Nemesis a Tundra, ale pak přišla tříhodinová lítá bitva proti týmu Xtreme Gaming. Falcons ji nakonec prohráli, nicméně soupeřům nedali nic zadarmo. Následná série proti týmu Liquid dopadla jasně 2–0 ve prospěch týmu Falcons, a teprve tým Tidebound budoucí šampiony skutečně převálcoval. Najednou hrozilo vyřazení. Rozhodující soupeř? Tým Spirit, favorit šampionátu. A výsledek? Ukázková výhra 2–0 vytáhla Falcons výš a Spirit srazila k zemi.",
      "Hlavní část šampionátu v hale Barclays Arena otevřel tým Falcons pomstou: rozmetáním týmu Tidebound 2–0. Proti týmu BB poté sice zelení sokoli přišli o první hru, ale namísto bezpečné strategie vzali ve druhé hře agresivní soupisku hrdinů a nečekaná převaha se přelila i do třetí hry. Další, kdo stál v cestě, byl tým PVISION. Tým Falcons proti němu nejprve utrpěl bolestivou porážku v první hře, avšak jako vždy se oklepal a ve druhé hře skóre srovnal. Poslední hra této série následně trvala hodinu a Falcons si v ní za bouřlivého potlesku publika zajistili místo ve velkém finále.",
      "Trofej byla na dosah, jenže tým Falcons čekala ještě poslední zkouška. Porazit jediný zbývající tým, který jim do téhle chvíle ukázal záda – Xtreme Gaming přežili napínavé finále skupiny poražených a plní adrenalinu nastoupili do „skutečného“ finále, což dokázala hned první hra, kdy tým Falcons ani nepustili ke slovu. Falcons však oplatili stejnou mincí a bylo srovnáno. Třetí hra už byla méně jednoznačná. Nebo alespoň do týmového masakru, který dostal Xtreme Gaming do vedení 2–1. Modří ale správně tuší, že Falcons nehodili ručník do ringu a naopak srovnali na 2–2.",
      "V poslední hře šampionátu pak šly veškeré zábrany stranou a tým Falcons vytáhl kombo hrdinů, se kterým od 15. minuty dominoval mapě. Xtreme Gaming se statečně bránili, ale prohra byla nevyhnutelná – Falcons postupně dobývali základnu, až se dostali k Ancientovi a jeho zničením si zajistili titul nejlepšího týmu světa.",
      "A jelikož překonali všechny překážky a dosáhli ultimátního vítězství, jména těchto hráčů budou navždy vyryta do trofeje Aegis of Champions:",
      "[b]2025 – Team Falcons[/b]",
      "[list]",
      "[*]Oliver „skiter“ Lepko",
      "[*]Stanislav „Malr1ne“ Potorak",
      "[*]Ammar „AMMAR_THE_F“ Alassaf",
      "[*]Andreas „Cr1t-“ Nielsen",
      "[*]Jingjun „Sneyking“ Wu",
      "[/list]",
      "[b]Ohlédnutí za šampionátem[/b]",
      "Stejně jako Dota samotná, i šampionát The International je jako strojek plný vzájemně propojených koleček, takže každý fanoušek přímo v hale, každý hráč laborující doma nad Fantasy soupiskou a tipy na vítěze, každý pracovník pomáhající zajistit bezproblémový průběh a pochopitelně také každý profík je bezpodmínečně důležitý pro to, aby byl šampionát tak úžasný, jaký ho známe a jakého máme tu čest být součástí. ",
      "Jako vždy tedy z celého srdce děkujeme hráčům, uvaděčům a prostě všem členům komunity hry Dota 2 za to, že nám pomohli s letošním šampionátem The International. Pokud jste prošvihli nějaký zápas nebo si jen chcete připomenout některé z jeho neuvěřitelných momentů, navštivte [url=https://www.youtube.com/user/dota2]kanál Dota 2 na YouTube[/url], kde najdete kompletní archiv záznamů. Na [url=https://www.instagram.com/dota2/]Instagramu[/url] a [url=https://www.flickr.com/photos/dota2ti/]Flickru[/url] také nabízíme album všech fotek.",
      "[b]Samolepky šampionů[/b]",
      "Ode dneška jsou ve hře také dostupné speciální samolepky šampionů z týmu Falcons, přičemž každá kapsle obsahuje jednu samolepku hráče skiter, Malr1ne, AMMAR_THE_F, Cr1t- nebo Sneyking, případně samolepku s logem týmu. Samozřejmě platí, že polovinu výtěžku z prodejů obdrží přímo hráči.",
      "[b]Odměny pro diváky[/b]",
      "Jak jste si mohli všimnout, výsledek letošního ročníku šampionátu byl krapet nepředvídatelný. Je proto dobře, že odměny za soutěž Fantasy týmů a tipovací soutěž mají velký rozptyl, a ať už se Vám podařilo procpat mezi stovku nejlepších s 31 560 a více body, nebo jste horko těžko skončili ve vrchních 15 % s 8 280 a více body, od čtvrtka 18. září si ve hře můžete vyzvednout své ceny.",
      "[b]Nová truhla Heroes' Hoard[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "The International 2025 je sice historií, ale jeho „mezihvězdné“ téma pokračuje díky 17 zbrusu novým setům, v nichž nechybí Immortal předměty, persony a mnohem víc. Kosmická truhla Heroes' Hoard konkrétně obsahuje sety pro Spirit Breakera, Enigmu, Void Spirita, Ancient Apparitiona, Miranu, Zeuse, Phoenixe, Svena, Crystal Maiden, Faceless Voida, Marci, Phantom Assassin a Linu, které doplňují vzácné sety pro Tinkera, Ogre Magiho, Lunu a Earthshakera. Poslední jmenovaný navíc zahrnuje také Arcana předmět Planetfall, jehož návrat ve hvězdách mnozí dychtivě vyhlíželi. Tak schválně, co z truhly získáte Vy!"
    ],
    "commentcount": 200,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 19,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2428,
    "votedowncount": 199,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758127147,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2423,
  "votes_down": 199,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}