{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Vinderne af The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Vinderne af The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Tillykke til Team Falcons, vindere af The International 2025. Efter et år med blandede resultater nåede Team Falcons endelig til toppen og tilkæmpede sig Aegis of Champions i Hamborg gennem benhård kamp i et af de mest grusomme maratonløb, som The International nogensinde har set. Ud af deres ti kampe var der kun tre, som gik som smurt. Alle andre kampe talte ned til det sidste minut, inklusive en femkampsfinale.",
      "Falcons etablerede sig tidligt med en 2-1-sejr over Nemesis og Tundra. Deres første bekneb kom mod Xtreme Gaming i en tre timers langtrukken kamp. Falcons tabte i sidste ende, men deres modstandsdygtighed var tydelig. Derefter slog de benene væk under Team Liquid med en 2-0-sejr, men den følgende serie mod Tidebound var meget mere turbulent. Falcons tabte, og pludselig hang eliminering som en truende sort sky over dem. Og modstanderen i elimineringsrunden? Team Spirit, turneringens storfavoritter. Resultatet? En 2-0-sejr fra Falcons, som sendte det flerårige kraftværk hjem. Team Falcons fandt deres vinger lige i tide til hovedbegivenheden.",
      "De startede i Barclays Arena med hævn: en 2-0-sejr over Tidebound. Derefter tabte Falcons deres første kamp mod BB Team. I stedet for at spille det sikkert satsede de offensivt for at sikre en sejr eller to. I den tredje kamp tog Falcons hurtigt BB i et kvælertag. PVISION var det næste hold i rækken. Falcons led et smertefuldt nederlag i første kamp, men nåede så at stikke af med sejren i anden kamp, så sættet blev udlignet. Som kronen på værket i tredje kamp indløste Falcons deres billet til finalen ved at levere en timelang triumf, som fik publikum op af stolene.",
      "For at gøre endeligt krav på Aegis of Champions på den sidste dag skulle Team Falcons besejre det eneste hold, der tidligere havde slået dem. Xtreme Gaming havde overlevet en intens finale i den nedre gruppe og var klar til en passende omkamp. I den første kamp rev Xtreme Falcons fra hinanden. Falcons svarede igen med en fantastisk sejr i den efterfølgende kamp. Tredje kamp virkede som en mere ligevægtig kamp – lige indtil Xtremes holdudslettende angreb skubbede Falcons ned i et 1-2-hul. De kæmpede sig vej tilbage i fjerde kamp, afværgede eliminering og tvang Xtreme til en afgørende femte kamp.",
      "I den afgørende kamp slap Falcons en ødelæggende kombination af helte ud i kampen, og efter det første kvarter af kampen overtog de kontrollen over banen. Xtreme Gaming gjorde en tapper indsats i forsvaret, men til sidst rev Team Falcons modstandernes helte fra hinanden, smadrede deres Ancient og gjorde dermed krav på Aegis of Champions.",
      "Som indehavere af det ultimative symbol på sejr vil disse navne for altid være indgraveret på Aegis of Champions:",
      "[b]2025 – Team Falcons[/b]",
      "[list]",
      "[*]Oliver \"skiter\" Lepko",
      "[*]Stanislav \"Malr1ne\" Potorak",
      "[*]Ammar \"AMMAR_THE_F\" Alassaf",
      "[*]Andreas \"Cr1t-\" Nielsen",
      "[*]Jingjun \"Sneyking\" Wu",
      "[/list]",
      "[b]Tilbageblik[/b]",
      "Ligesom selve Dota er The International en ærefrygtindgydende blanding af utallige bevægelige dele. Hver fan, der jubler i arenaen, hver fantasiopstilling og forudsigelse, der laves rundt om i verden, alle strategiske proklamationer, som laves inden for hjemmets fire vægge, produktionspersonalet, der bygger showet, og selvfølgelig spillerne, der konkurrerer i båsene – tilsammen udgør det hele en utrolig særlig begivenhed, som vi er beærede over at deltage i. ",
      "Som altid vil vi gerne takke alle spillerne, talenterne og alle i Dota-fællesskabet for at have været med til at bringe denne verdensomspændende fest til live. Hvis du gik glip af noget i turneringen, eller du bare vil gense nogle af de fantastiske øjeblikke, kan du gå til [url=https://www.youtube.com/user/dota2]Dota 2's YouTube-kanal[/url]. Her kan du gense hele showet. Du kan også finde et væld af billeder fra begivenheden på [url=https://www.instagram.com/dota2/]Dota 2's Instagram[/url] og [url=https://www.flickr.com/photos/dota2ti/]Dota 2's flickr[/url].",
      "[b]Fejr vinderne[/b]",
      "De særlige vinderklistermærkekapsler med Team Falcons kan købes nu. Hver kapsel har et klistermærke med skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking eller Team Falcons. 50% af indtægterne går direkte til Team Falcons.",
      "[b]Luk op for dine belønninger[/b]",
      "Som alles grupper måske har bemærket, var resultatet af The International i år en smule... uforudsigeligt. Så det er en god ting, at belønningerne for fantasispillet uddeles baseret på alles resultater. Uanset om du er i top-100 med et forbløffende resultat på over 31.560 point eller \"bare\" kom blandt de bedste 15% med dine hårdt tjente 8.280+ point, kan du smutte over i klienten og indløse dine præmier torsdag d. 18. september.",
      "[b]Ny kosmisk helteskat[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "Selvom The International er forbi, behøver de kosmiske genstande ved dette års begivenhed aldrig at få en ende, for vi har 17 helt nye genstandssæt i særlige temaer: udødelige genstande, personaer og meget mere, som du kan pakke dine yndlingshelte ind i. Hver skat indeholder et sæt til Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin eller Lina, samt chancen for at tilføje et sjældent Tinker-, Ogre Magi-, Luna- eller Earthshaker-sæt. Earthshaker-sættet inkluderer endda heltens Planetfall-arcana, som vender tilbage for første gang. Hop ind i spillet for at se hele udvalget."
    ],
    "commentcount": 195,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2300,
    "votedowncount": 188,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758123702,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2293,
  "votes_down": 187,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}