{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "I vincitori assoluti del The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "I vincitori assoluti del The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Congratulazioni al Team Falcons, campione assoluto del The International 2025. Dopo un anno di risultati alterni, il Team Falcons ha spiccato il volo verso l'Egida dei Campioni ad Amburgo, combattendo con gli artigli e coi denti e superando una delle maratone più dure a cui abbiamo mai assistito al The International. Delle dieci serie giocate, solo tre sono state vittorie facili. Negli altri incontri la battaglia si è protratta a lungo, inclusa una finalissima di cinque partite.",
      "Il Team Falcons ha lasciato il segno fin dall'inizio, vincendo 2-1 contro Nemesis e Tundra. Il primo passo falso è avvenuto contro Xtreme Gaming, in una partita durata tre ore. Alla fine, il Team Falcons è stato confitto, ma la resilienza dimostrata ha brillato in tutta la sua forza. Successivamente ha spazzato via Team Liquid con un 2-0, ma la serie successiva contro Tidebound è stata molto più turbolenta. I Falcons hanno perso e, tutto d'un tratto, l'eliminazione aleggiava su di loro. Chi li aspettava nel round a eliminazione? Team Spirit, i favoriti del torneo. Il risultato? Una vittoria 2-9 per i Falcons che ha mandato a casa i perenni vincitori. Il Team Falcons ha ritrovato le ali giusto in tempo per il palco principale.",
      "È entrato in scena alla Barclays Arena con sete di vendetta: un 2-0 secco contro Tidebound. Poi, contro BB Team, i Falcons hanno perso la prima partita. Invece di giocare sul sicuro, si sono affidati a una selezione aggressiva per vincere la seconda partita. Nella terza partita, i Falcons hanno messo rapidamente in difficoltà i BB. Poi è stata la volta di PVISION. I Falcons hanno subito un colpo doloroso nella prima partita, ma nella seconda partita sono andati via lisci per pareggiare i conti. A completamento della serie di vittorie, nella terza partita i Falcons si sono aggiudicati il biglietto per la finalissima, regalando un trionfo durato un'ora che ha fatto infiammare la folla di fronte allo spettacolo in scena.",
      "Per conquistare l'Egida dei Campioni nell'ultimo giorno, il Team Falcons doveva sconfiggere l'unica altra squadra che li aveva battuti. Xtreme Gaming era sopravvissuta a un'intensa finale del girone inferiore per preparare una rivincita adeguata. Nella prima partita, Xtreme ha fatto a pezzi i Falcons. I Falcons hanno risposto subito con un'incredibile vittoria in quella successiva. La terza partita sembrava alla pari, fino a quando una mossa decisiva non ha causato la sconfitta dei Falcons per 1-2. Hanno recuperato nella quarta partita per evitare l'eliminazione e ottenere una quinta partita decisiva.",
      "Nella partita decisiva, una potente selezione dei Falcons ha scatenato una combo dirompente nella mischia e dal minuto 15 in poi hanno preso il controllo della mappa. Xtreme Gaming ha compiuto un coraggioso sforzo difensivo, ma alla fine i Team Falcons hanno fatto a pezzi gli Eroi nemici e hanno distrutto l'Antico, conquistando l'Egida dei Campioni.",
      "Come portatori del simbolo supremo della vittoria, questi nomi saranno per sempre incisi sull'Egida dei Campioni:",
      "[b]2025 - Team Falcons[/b]",
      "[list]",
      "[*]Oliver \"skiter\" Lepko",
      "[*]Stanislav \"Malr1ne\" Potorak",
      "[*]Ammar \"AMMAR_THE_F\" Alassaf",
      "[*]Andreas \"Cr1t-\" Nielsen",
      "[*]Jingjun \"Sneyking\" Wu",
      "[/list]",
      "[b]Guardando al passato[/b]",
      "Come lo stesso Dota, il The International è un insieme mozzafiato di innumerevoli ingranaggi che si muovono in sintonia. Tutti i tifosi nell'arena, tutti i roster e i pronostici del FantaDota in tutto il mondo, tutte le strategie studiate nel calduccio di casa, lo staff di produzione che mette in piedi lo spettacolo e, naturalmente, i giocatori che gareggiano negli stand: tutto questo contribuisce a creare un evento incredibilmente speciale a cui siamo onorati di prendere parte. ",
      "Come sempre, vorremmo ringraziare tutti i giocatori, i talenti e tutta la Comunità di Dota per aver contribuito a dare vita a questa celebrazione globale. Se ti sei perso una parte del torneo o vuoi semplicemente guardare di nuovo le giocate entusiasmanti durante le partite, visita il [url=https://www.youtube.com/user/dota2]canale YouTube di Dota 2[/url], dove troverai l'intero spettacolo. Inoltre, puoi trovare una gran quantità di foto dell'evento sul [url=https://www.instagram.com/dota2/]canale Instagram di Dota 2[/url] e sulla pagina[url=https://www.flickr.com/photos/dota2ti/]pagina Flickr di Dota 2[/url].",
      "[b]Celebriamo i Campioni[/b]",
      "La serie speciale di adesivi dei Campioni per Team Falcons è ora disponibile per l'acquisto. Ogni capsula contiene un adesivo di skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking o di Team Falcons. Il 50% di tutte le vendite verrà devoluto direttamente a Team Falcons.",
      "[b]Scarta le tue ricompense[/b]",
      "Come tutti avranno notato, il risultato del The International quest'anno è stato alquanto... imprevedibile. Quindi è un bene che le ricompense del FantaDota siano calcolate in base ai risultati di tutti. Che tu sia tra i primi 100 con oltre 31.560 punti, o \"solo\" nel 15% con più di 8.280 punti guadagnati duramente, giovedì 18 settembre puoi andare sul client e riscattare i tuoi premi.",
      "[b]Nuovo tesoro del Bottino Cosmico degli Eroi[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "Il The International è terminato, ma l'incanto cosmico di quest'edizione non deve mai avere fine, perché abbiamo 17 nuovissimi set di oggetti a tema speciale, tra cui Immortali, Personaggi e altro ancora, per adornare i tuoi Eroi preferiti. Ogni tesoro contiene un set per Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin o Lina, oltre alla possibilità di aggiungere al mix un raro set per Tinker, Ogre Magi, Luna o Earthshaker. Il set per Earthshaker include anche l'oggetto Arcano \"Dominio Planetario\" dell'Eroe, che ritorna per la prima volta. Entra nel gioco per vedere tutte le novità."
    ],
    "commentcount": 195,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2283,
    "votedowncount": 185,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758123138,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2283,
  "votes_down": 185,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}