{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Wielcy mistrzowie The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Wielcy mistrzowie The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Gratulacje dla Team Falcons, wielkich mistrzów The International 2025. Po roku pełnym wzlotów i upadków Team Falcons w końcu wzbił się na szczyt i sięgnął po Egidę Chempionów w Hamburgu — pokonując jeden z najtrudniejszych maratonów, jaki kiedykolwiek miał miejsce na The International. Spośród dziesięciu spotkań tylko trzy zakończyły się szybkim zwycięstwem. Każda walka była wyczerpująca, łącznie ze składającym się z pięciu gier wielkim finałem.",
      "Falcons szybko ugruntowali swoją pozycję, pokonując Nemesis i Tundra 2:1. Ich pierwsze potknięcie miało miejsce w trzygodzinnej mordędze przeciwko Xtreme Gaming. Ostatecznie Falcons przegrali, ale dali nam pokaz swojej wytrzymałości. Następnie rozsmarowali Team Liquid 2:0, ale kolejny mecz przeciwko Tidebound był już o wiele bardziej burzliwy. Falcons przegrali, a na horyzoncie jawiło się widmo eliminacji. Ich przeciwnik w rundzie eliminacyjnej? Team Spirit, faworyci turnieju. Wynik? 2:0 dla Falcons, wynik, który sprawił, że wieloletnia potęga pożegnała się z zawodami. Team Falcons odzyskał wiatr w skrzydłach w samą porę przed głównym wydarzeniem.",
      "Otworzyli swój występ na Barclays Arena z impetem: zmiatając Tidebound 2:0. Z kolei w meczu przeciwko BB Team przegrali pierwszą grę. Zamiast rozegrać to bezpiecznie, postawili na agresywny wybór bohaterów i wygrali drugą grę. Trzecia gra zakończyła się dla Falcons szybkim przyparciem BB do muru. Następna była drużyna PVISION. Falcons ponieśli bolesną porażkę w pierwszej grze, za to odkuli się w drugiej, czym wyrównali bilans meczu. Zwieńczając trzecią grę i zapewniając sobie przepustkę do wielkiego finału, Falcons odnieśli triumf po godzinnej batalii, która wywoływała niemałe poruszenie wśród publiczności oglądającej wydarzenie na scenie.",
      "By zdobyć Egidę Czempionów ostatniego dnia, Team Falcons musieli wygrać z jedyną drużyną, która zdołała ich pokonać. Xtreme Gaming przetrwało intensywny finał dolnej drabinki, by wykreować stosowny rewanż. W pierwszej grze Xtreme Gaming rozszarpali Team Falcons na kawałki, na co Falcons natychmiast odpowiedzieli oszałamiającymi bęckami w kolejnej. Trzecia gra sprawiała wrażenie wyrównanej – aż do chwili, gdy decydujące o grze wybicie całej drużyny wpędziło Team Falcons w tarapaty z wynikiem 1:2. „Sokoły” powróciły w czwartej grze, by odeprzeć eliminację i wymusić piątą grę decydującą o spotkaniu.",
      "W decydującej walce mocne wybory ze strony Falcons wyzwoliły w jej ferworze niszczycielskie połączenie, a od piętnastej minuty przejęli kontrolę nad mapą. Xtreme Gaming bronili się dzielnie, ale ostatecznie Team Falcons nie oszczędzili wrogich bohaterów i zniszczyli Starożytnego – zdobywając Egidę Chempionów.",
      "Imiona, nazwiska i pseudonimy dzierżących ostateczny symbol zwycięstwa na zawsze pozostaną wyryte na Egidzie Czempionów.",
      "[b]2025 – Team Falcons[/b]",
      "[list]",
      "[*]Oliver „skiter” Lepko",
      "[*]Stanislav „Malr1ne” Potorak",
      "[*]Ammar „AMMAR_THE_F” Alassaf",
      "[*]Andreas „Cr1t-” Nielsen",
      "[*]Jingjun „Sneyking” Wu",
      "[/list]",
      "[b]Spoglądając w przeszłość[/b]",
      "Podobnie jak sama Dota, The International jest budzącą podziw mieszanką niezliczonych, ruchomych elementów. Każdy fan kibicujący na arenie, każdy skład marzeń i typowania z całego świata, wszystkie strategiczne porady ogłaszane z ciepła własnego domu, ekipa produkcyjna, która tworzy wydarzenie i oczywiście gracze rywalizujący w kabinach – wszystko to składa się na niesamowicie wyjątkowe wydarzenie, w którym wzięcie udziału jest dla nas zaszczyceniem. ",
      "Jak zawsze, chcielibyśmy podziękować wszystkim graczom, prezenterom i całej społeczności Dota 2 za wcielenie tej globalnej uroczystości w życie. Jeśli przegapiliście którąkolwiek część turnieju lub po prostu pragniecie ponownie zobaczyć te niesamowite zagrania, skierujcie się na [url=https://www.youtube.com/user/dota2]kanał Dota 2 na YouTube[/url], gdzie znajdziecie powtórki z całego wydarzenia. Możecie także znaleźć zbiór zdjęć z wydarzenia na kontach Dota 2 w serwisach [url=https://www.instagram.com/dota2]Instagram[/url] i [url=https://www.flickr.com/photos/dota2ti/]Flickr[/url].",
      "[b]Niech żyją wielcy mistrzowie[/b]",
      "Pojemniki z naklejką ze specjalnej edycji mistrzów dla Team Falcons są już dostępne w sprzedaży. Każdy pojemnik zawiera jedną naklejkę przedstawiającą skitera, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking lub Team Falcons. 50% środków z każdej sprzedaży trafia bezpośrednio do Team Falcons.",
      "[b]Rozpakujcie nagrody[/b]",
      "Jak zapewne zauważyliście, wynik tegorocznego The International był nieco… nieprzewidywalny. Dobrze więc, że nagrody ligi marzeń są przyznawane stopniowo. Niezależnie od tego, czy znaleźliście się w pierwszej setce z imponującą liczbą 31 560+ punktów, czy „tylko” jesteście w pierwszych 15% z ciężko zarobionymi 8280+ punktami, możecie udać się do klienta gry, by odebrać nagrody w najbliższy czwartek, 18 września.",
      "[b]Nowe Kosmiczne Bogactwa Bohaterów[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "Mistrzostwa The International dobiegły końca, ale kosmiczne atrakcje tegorocznego wydarzenia nie kończą się, bo mamy 17 zupełnie nowych, tematycznych zestawów przedmiotów (zawierających wiekopomne przedmioty, persony i wiele więcej) w które możecie wyposażyć swoich ulubionych bohaterów. Każdy skarb zawiera zestaw dla Spirit Breakera, Enigmy, Void Spirita, Ancient Apparition, Mirany, Zeusa, Phoenixa, Svena, Crystal Maiden, Faceless Voida, Marci, Phantom Assassin lub Liny, a także oferuje szansę na rzadki zestaw dla Tinkera, Ogre Magi, Luny lub Earthshakera. Zestaw Earthshakera zawiera nawet arkana „Kosmogrom”, powracającą po raz pierwszy. Wskoczcie do gry, by zapoznać się z pełną ofertą."
    ],
    "commentcount": 214,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2799,
    "votedowncount": 231,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758137257,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2799,
  "votes_down": 231,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}