{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025 -mestarit",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025 -mestarit",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Onneksi olkoon, Team Falcons, The International 2025 -turnauksen voitosta! Vaihtelevasti sujuneen vuoden jälkeen Team Falcons kohosi lopulta Mestareiden merkin voittajaksi Hampurissa. Voittoja raapimalla, vähä vähältä etenemällä ja jauhamalla he etenivät mestaruuteen, joka jää historiaan yhtenä TI:n sisukkaimmista maratonsuorituksista. Falconsin kymmenestä ottelusarjasta vain kolmessa voitto irtosi selvin lukemin. Kaikki muut kamppailut pelattiin pitkän kaavan kautta, viiteen peliin venynyt finaali mukaan lukien.",
      "Turnauksen alussa Falcons piti tahtipuikon hallussaan 2–1-voitoilla Nemesiksestä ja Tundrasta. Ensimmäiseksi kompastuskiveksi muodostui Xtreme Gaming kolme tuntia kestäneessä intensiivisessä ottelussa. Falcons hävisi sen lopulta, mutta antoi sitkeydellään myrskyvaroituksen. Seuraavassa ottelussa Team Liquid taipui suoraan 2–0, mutta sen jälkeen vastaan tullut Tidebound osoittautui paljon tiukemmaksi vastukseksi. Falcons kärsi tappion ja yhtäkkiä tiimin jatko turnauksessa oli vaarassa. Ja kuka tulikaan vastaan karsintakierroksella? Team Spirit, turnauksen voittajasuosikki. Miten ottelussa kävi? Falconsin 2–0-voitto lähetti kestomenestyjät kotiin. Team Falcons nousi siivilleen juuri sopivasti pääturnausta varten.",
      "Barclays Arena näki kostoretken, kun Falcons voitti Tideboundin suoraan 2–0. Seuraavalla kierroksella Falcons hävisi ensimmäisen pelin BB Teamille. Toisessa pelissä ei varmisteltu, vaan aggressiivinen sankarivalinta auttoi Falconsin voittoon. Kolmannessa pelissä Falcons laittoi BB:n nopeasti ahtaalle. Tätä seurasi ottelusarja PVISIONia vastaan. Ensimmäisessä pelissä tuli köniin, mutta Falcons tasoitti sarjan toisen pelin voitolla. Yleisö osoitti haltioituneena suosiota seuratessaan Falconsin tunnin kestänyttä voittokulkua kolmannessa pelissä, joka toi joukkueelle finaalipaikan.",
      "Turnauksen loppuhuipennuksessa Team Falcons tarvitsi Mestareiden merkin nappaamiseen voiton ainoasta sen päihittäneestä joukkueesta. Vastaan tuli Xtreme Gaming, joka oli kiivaan taiston jälkeen selvinnyt alemman jatkolohkon finaalin voittajaksi. Ensimmäisessä pelissä Xtreme vei Falconsia kuin litran mittaa. Seuraavassa pelissä Falcons kuitenkin vastasi samalla mitalla. Kolmas peli eteni tasaisena taistona, kunnes kaikki tappanut hyökkäys käänsi pelin suunnan ja ajoi Falconsin 1–2-pakkorakoon sarjassa. He saivat kuitenkin kaavittua voiton neljännessä pelissä ja venytettyä finaalisarjan ratkaisevaan viidenteen peliin.",
      "Ratkaisupelissä Falconsin hyvin suunnitellut sankarivalinnat antoivat sille tuhoisan yhdistelmän, jonka ansiosta se otti kartan haltuunsa 15 peliminuutin jälkeen. Xtreme Gaming puolusti urhoollisesti, mutta lopulta Team Falcons tappoi viholliset, murskasi muinaislinnoituksen ja otti Mestareiden merkin nimiinsä.",
      "Mestareiden merkkiin kirjataan ikiajoiksi seuraavat voittajien nimet:",
      "[b]2025 – Team Falcons[/b]",
      "[list]",
      "[*]Oliver \"skiter\" Lepko",
      "[*]Stanislav \"Malr1ne\" Potorak",
      "[*]Ammar \"AMMAR_THE_F\" Alassaf",
      "[*]Andreas \"Cr1t-\" Nielsen",
      "[*]Jingjun \"Sneyking\" Wu.",
      "[/list]",
      "[b]Katsaus menneeseen[/b]",
      "Dotan itsensä tavoin The International on valtava voimannäyte, joka koostuu lukemattomista liikkuvista osista. Jokainen areenalle saapunut fani, eri puolilla maailmaa koottu fantasialiiga ja tehty fantasiaveikkaus, kotisohvalla kudotut strategiat, show'n kasaamisesta vastuussa oleva tuotantotiimi sekä luonnollisesti kopeissa kilpailevat pelaajat – kaikki nämä palaset yhdessä aikaansaavat ainutlaatuisen tapahtuman, jossa meillä on kunnia olla mukana. ",
      "Kuten aina, haluamme kiittää kaikkia pelaajia, juontajia ja Dota-yhteisön jäseniä mahtavan maailmanlaajuisen tapahtuman toteutumisesta. Jos osa turnauksesta meni ohi tai haluat vain kokea jännittävät hetket ja huimat pelit uudelleen, löydät turnauksen kaikki pelit [url=https://www.youtube.com/user/dota2]Dota 2:n YouTube-kanavalta[/url]. Lisäksi Dota 2:n [url=https://www.instagram.com/dota2/]Instagram-tililtä[/url] ja [url=https://www.flickr.com/photos/dota2ti/]flickristä[/url] löytyy lukuisia kuvia tapahtumasta.",
      "[b]Mestareiden kunniaksi[/b]",
      "Team Falcons -tarrakapselien mestaruusversiot ovat nyt ostettavissa. Jokainen kapseli sisältää tarran, jossa esiintyy joko skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking tai Team Falcons. Puolet tuotoista menee suoraan Team Falconsille.",
      "[b]Lunasta palkintosi[/b]",
      "Kuten kaikki veikkauksia tehneet saivat huomata, tämän vuoden The Internationalin tulokset olivat... lievästi sanottuna arvaamattomia. Niinpä on hyvä, että fantasiapalkinnot porrastetaan. Olitpa yksi sadasta parhaasta ällistyttävällä yli 31 560 pisteen saaliilla tai kuulut \"pelkästään\" 15 prosentin kärkijoukkoon työn ja tuskan takana olleella yli 8 280 pisteellä, palkinnot ovat lunastettavissa asiakasohjelmassa torstaina 18.9.",
      "[b]Uusi Kosmisten sankareiden saalis[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "The International on ohi tältä vuodelta, mutta sen ei tarvitse tarkoittaa kosmisten esineiden loppumista. 17 täysin uutta erikoisteemaista esinekokoelmaa tarjoaa suosikkisankareillesi uutta kuosia ja kudetta – mukana on kuolemattomia esineitä, persoonia ja paljon muuta. Jokainen aarre pitää sisällään kokoelman Spirit Breakerille, Enigmalle, Void Spiritille, Ancient Apparitionille, Miranalle, Zeukselle, Phoenixille, Svenille, Crystal Maidenille, Faceless Voidille, Marcille, Phantom Assassinille tai Linalle sekä mahdollisuuden harvinaiseen kokoelmaan Tinkerille, Ogre Magille, Lunalle tai Earthshakerille. Earthshakerin kokoelmaan kuuluu jopa sankarin ensimmäistä kertaa paluun tekevä Planeettatuhon salatieteellinen esine. Koko valikoima löytyy pelistä."
    ],
    "commentcount": 228,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2972,
    "votedowncount": 242,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758142009,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2974,
  "votes_down": 242,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}