{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "A The International 2025 bajnokai",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "A The International 2025 bajnokai",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Gratulálunk a Team Falconsnak, a The International 2025 bajnokának! Egy évnyi vegyes eredmény után a Team Falcons végül a Bajnokok Égiszéig szárnyalt Hamburgban – foggal-körömmel harcolva, és átdarálva magát a valaha látott legdurvább The Internationalen. Tíz párosításukból csak hármat hoztak le vesztett játék nélkül. Az összes többi csata hosszúra nyúlt, beleértve az ötmeccses döntőt.",
      "A Falcons hamar megszilárdította pozícióját a Nemesis és a Tundra feletti 2-1-es győzelmével. Az első botlásuk az Xtreme Gaming ellen következett be, egy háromórás öldöklés során. A Falcons végül elbukott, de ellenálló-képességük teljes mértékben megmutatkozott. Ez után 2-0-ra lesöpörték a Team Liquidet, de a Tidebound elleni következő sorozatuk már sokkal viharosabb volt. A Falcons veszített, és hirtelen a kiesés fenyegette őket. Az ellenfelük a kieséses körben? A Team Spirit, a bajnokság favoritja. Az eredmény? A Falcons 2-0-s domináns győzelme, amely hazaküldte a mindig brutálisan erős csapatot. A Team Falcons épp időben kapott szárnyra a főszínpadi szerepléshez.",
      "Bosszúra éhesen nyitottak a Barclays Arenában: 2-0-ra lesöpörték a Tideboundot. A Falcons a BB Team ellen elvesztette az első játékot. Ahelyett, hogy biztosra mentek volna, belementek egy agresszív draftbe, hogy megnyerjék a második játékot. A harmadik játékban a Falcons gyorsan sarokba szorította a BB Teamet. Majd a PVISION következett. A Falcons az első játékban fájdalmas csapást szenvedett, de a második játékban elhúztak, és egyenlítettek. A sorozat megkoronázásaként a harmadik játékban a Falcons egy olyan egyórás küzdelem után diadalmaskodva jelentkezett be a döntőbe, amelynek színpadi eseményeire a tömeg hangos üvöltéssel reagált.",
      "A Bajnokok Égiszének megszerzéséhez az utolsó napon a Team Falconsnak a másik őket megverő csapatot is le kellett győznie. Az Xtreme Gaming egy intenzív alsó ági döntőt élt túl egy méltó visszavágó előkészítésére. Az első játékban az Xtreme darabokra szedte a Falconst. A Falcons a következőben egy elképesztő lezúzással válaszolt. A harmadik játék kiegyenlítettnek tűnt, egészen addig, amíg a Falcons egy sorsfordító csapatlesöprés után 1-2-es sorozathátrányba nem került. A negyedik játékban visszaküzdötték magukat, hogy elkerüljék a kiesést, és kikényszerítsenek egy sorsdöntő ötödik játékot.",
      "A mindent eldöntő játékban a Falcons erős draftje egy zavaró kombót engedett szabadjára a küzdelemben, és a 15. perctől kezdve átvették az irányítást a pálya fölött. Az Xtreme Gaming vitézül védekezett, de a Team Falcons végül belemart az ellenséges hősökbe, szétzúzta az Őst – és ezzel megszerezték a Bajnokok Égiszét.",
      "A győzelem végső szimbólumának birtokosaiként e nevek vésetnek rá örökre a Bajnokok Égiszére:",
      "[b]2025 – Team Falcons[/b]",
      "[list]",
      "[*]Oliver \"skiter\" Lepko",
      "[*]Stanislav \"Malr1ne\" Potorak",
      "[*]Ammar \"AMMAR_THE_F\" Alassaf",
      "[*]Andreas \"Cr1t-\" Nielsen",
      "[*]Jingjun \"Sneyking\" Wu",
      "[/list]",
      "[b]Visszatekintés[/b]",
      "Mint maga a Dota, a The International is számtalan mozgó alkatrész elképesztő keveréke. Minden rajongó, aki az arénában drukkol, minden világszerte megtett fantasy felállás és tipp, az összes stratégiai kijelentés, amit otthonod biztonságából teszel, a műsort készítő stáb, és persze a fülkékben versenyző játékosok – mindez egy hihetetlenül különleges eseményt eredményez, amelyben megtiszteltetés számunkra részt venni. ",
      "Mint mindig, szeretnénk megköszönni az összes játékosnak, közreműködőnek és a Dota közösség minden tagjának, hogy segítettek életre kelteni ezt a globális ünnepet. Ha lemaradtál a bajnokság valamelyik részéről, vagy csak szeretnéd újranézni a bámulatos meccseket, menj a [url=https://www.youtube.com/user/dota2]Dota 2 YouTube csatornájára[/url], ahol visszajátszásokat találsz az egész műsorról. Találsz egy csomó fotót is az eseményről a [url=https://www.instagram.com/dota2/]Dota 2 Instagram[/url] és a [url=https://www.flickr.com/photos/dota2ti/]Dota 2 Flickr[/url] oldalán.",
      "[b]Ünnepeld a bajnokokat![/b]",
      "A különleges, bajnoki kiadású Team Falcons matricakapszulák már megvásárolhatók. Mindegyik kapszula egy matricát tartalmaz skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking játékosokat vagy a Team Falconst bemutatva. Az összes eladás 50%-a közvetlenül a Team Falconshoz kerül.",
      "[b]Csomagold ki jutalmaidat[/b]",
      "Ahogy azt mindenki ágtippjei megtapasztalták, az idei The International kimenetele egy kicsit... kiszámíthatatlan volt. Szóval jó, hogy a Fantasy jutalmak egy görbe alapján vannak osztályozva. Akár a legjobb 100-ban vagy lenyűgöző 31 560+ ponttal, akár „csak” a legjobb 15%-ban vagy valaki a nehezen megszerzett 8280+ pontoddal, szeptember 18-án, csütörtökön bejelentkezhetsz a kliensbe átvenni a nyereményeidet.",
      "[b]Új Kozmikus Hősök Zsákmánya Kincs[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "Bár a The International véget ért, az idei esemény kozmikus kellékeinek sosem kell véget érniük, hiszen van 17 vadonatúj, különleges témájú tárgyszettünk, köztük Halhatatlanok, hősavatárok és egyebek, amelyekbe beöltöztetheted kedvenc hőseidet. Mindegyik kincs tartalmaz egy szettet Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin vagy Lina számára, valamint lehetőséget egy ritka Tinker, Ogre Magi, Luna vagy Earthshaker szett hozzáadására. Az Earthshaker szett tartalmazza a Földet Érés Titokzatost is, amely most először tér vissza. Ugorj be a játékba, hogy megnézd a teljes kínálatot."
    ],
    "commentcount": 198,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2375,
    "votedowncount": 191,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758125590,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2373,
  "votes_down": 190,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}