{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Campeones absolutos de The International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Campeones absolutos de The International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Enhorabuena a Team Falcons, campeones absolutos de The International 2025. Después de un año con resultados dispares, Team Falcons al final se alzó con la Égida de los Campeones en Hamburgo, usando garras y dientes para superar una de las finales maratonianas más reñidas jamás vistas en The International. Solo arrasó en tres de sus diez series. En las demás, la batalla se alargó, incluyendo la serie de la gran final con sus cinco partidas.",
      "Team Falcons se hizo notar pronto con sus victorias de 2-1 sobre Nemesis y Tundra. El primer tropiezo fue contra Xtreme Gaming durante una pelea interminable de tres horas. Al final, Team Falcons salió derrotado pero sacó a la luz su capacidad de resistencia. A continuación, derrotó con claridad a Team Liquid con un 2-0; pero la serie siguiente contra Tidebound fue mucho más turbulenta. Team Falcons perdió y, de repente, surgió la posibilidad de ser eliminados del torneo. ¿Quiénes iban a ser sus rivales en la ronda eliminatoria? Team Spirit, los favoritos del torneo. ¿Y cuál fue el resultado? Team Falcons sacó pecho y con un 2-0 eliminó del torneo un equipo de élite, Team Spirit. Team Falcons había recuperado su mejor juego justo a tiempo para estar entre los ocho mejores que se disputarían la final.",
      "Empezaron esa fase en el Barclays Arena con la venganza de arrasar a Tidebound con un 2-0. Luego contra BB Team, Team Falcons perdió la primera partida. Y en lugar de jugar a lo seguro, una selección de héroes agresivos les permitió ganar la segunda partida. En la tercera, Team Falcons empezó rápidamente a abrumar a BB Team. Su siguiente rival, PVISION. Team Falcons sufrió una derrota dolorosa en la primera partida, pero luego se desquitó con una victoria para igualar la serie. Resolvió la tercera partida de la serie con una victoria que tardó en llegar una hora y cuyos eventos levantaron el clamor de los espectadores dándole a Team Falcons, finalmente, el pase a la gran final.",
      "Para poder hacerse con la Égida de los Campeones el último día, Team Falcons todavía tenía que vencer al único otro equipo que lo había derrotado. Por su lado, Xtreme Gaming había superado una final intensa en el grupo de perdedores y venía preparado para repetir el enfrentamiento. En la primera partida, Xtreme Gaming arrasó a Team Falcons. Team Falcons se desquitó en la segunda partida infligiéndole una derrota impresionante. La tercera partida empezó igualada, hasta que una pelea de las que terminan con todos los héroes del equipo dio un giro drástico y metió a Team Falcons en el aprieto de perder por 1-2 en una serie al mejor de cinco. En la cuarta partida se recuperó y evitó la eliminación forzando jugar una quinta partida para definir el vencedor.",
      "En la partida decisiva, Team Falcons eligió un grupo de héroes que se convirtió en una combinación rompedora en la refriega, y después de los primeros 15 minutos se hicieron con el control del mapa. Xtreme Gaming defendió con valentía, pero al final Team Falcons arrasó a los héroes enemigos y tiró abajo el Ancestro de sus rivales para hacerse con la Égida de los Campeones.",
      "Como abanderados del símbolo supremo del triunfo, estos nombres quedarán inscritos para siempre en la Égida de los Campeones:",
      "[b]2025 - Team Falcons[/b]",
      "[list]",
      "[*]Oliver «skiter» Lepko",
      "[*]Stanislav «Malr1ne» Potorak",
      "[*]Ammar «AMMAR_THE_F» Alassaf",
      "[*]Andreas «Cr1t-» Nielsen",
      "[*]Jingjun «Sneyking» Wu",
      "[/list]",
      "[b]Momentos para el recuerdo[/b]",
      "Al igual que Dota, The International es una combinación impresionante de innumerables factores. Los fans que aplauden en el estadio, cada una de las predicciones y alineaciones Fantasía pronosticadas en todo el mundo, las apuestas estratégicas realizadas tranquilamente desde vuestras casas, el personal de producción que da vida al escenario y, por supuesto, los jugadores que compiten desde sus cabinas... todo ello contribuye a crear un evento muy especial en el que nos sentimos orgullosos de participar. ",
      "Como siempre, nos gustaría dar las gracias a todos los jugadores, talentos e integrantes de la comunidad de Dota por ayudarnos a darle vida a este gran evento global. Si te perdiste algún momento del torneo, o simplemente quieres volver a ver las increíbles jugadas, visita el [url=https://www.youtube.com/user/dota2]canal de Dota 2 en YouTube[/url], donde podrás encontrar repeticiones de todo el evento. También encontrarás un montón de fotos del evento en la [url=https://www.instagram.com/dota2/]cuenta de Dota 2 en Instagram[/url] y en el [url=https://www.flickr.com/photos/dota2ti/]álbum de Dota 2 en flickr[/url].",
      "[b]En honor a los campeones[/b]",
      "Ya está a la venta la edición especial de las cápsulas de pegatinas de los campeones, Team Falcons. Cada cápsula contiene una pegatina de skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking o Team Falcons. El 50 % de todas las ventas irá directamente a Team Falcons.",
      "[b]Descubre tus recompensas[/b]",
      "Como se puede ver en las predicciones de grupos de todos los fans, este año el resultado de The International fue un poco... impredecible. Así que no viene mal que las recompensas de Fantasía se clasifiquen usando una curva. El jueves 18 de septiembre puedes abrir el cliente de Dota y reclamar tus premios, ya sea que estés entre los 100 mejores con unos impresionantes 31 560 puntos o más, o en el 15 % con esos 8280 puntos o más fruto de tu esfuerzo.",
      "[b]Nuevo Tesoro Heroico Cósmico[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "Puede que The International haya terminado, pero los adornos cósmicos del evento de este año no terminan con el evento, pues tenemos 17 sets de artículos con temas especiales totalmente nuevos, que incluyen artículos inmortales, personajes y mucho más, para adornar a tus héroes favoritos. Cada tesoro incluye un set para Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin o Lina, y la oportunidad de conseguir un set raro para Tinker, Ogre Magi, Luna o Earthshaker. El set de Earthshaker también incluye el arcano Caída Planetaria, que regresa por primera vez. Entra en el juego para ver todos esos artículos."
    ],
    "commentcount": 209,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2605,
    "votedowncount": 215,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758133020,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2605,
  "votes_down": 215,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}