{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "Os campeões do International 2025",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Os campeões do International 2025",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Parabéns à Team Falcons, a equipa campeã do International 2025. Após um ano de altos e baixos, a Team Falcons finalmente conquistou a Égide dos Campeões, em Hamburgo, com muita garra e esforço numa das maratonas mais difíceis que o International já viu. Das suas dez séries, apenas três foram ganhas sem disputa. Todas as outras batalhas foram até ao limite, incluindo uma Grande Final de cinco partidas.",
      "A Team Falcons cedo mostrou ao que vinha, com um 2-1 frente a Nemesis e Tundra. O primeiro percalço chegou ao defrontar a Xtreme Gaming, numa longa partida que durou três horas. A Team Falcons acabou por perder, mas a sua perseverança ficou à vista de todos. De seguida, a equipa eliminou a Team Liquid por 2-0; contudo, a série seguinte contra a Tidebound foi muito mais turbulenta. A Team Falcons foi derrotada e, de repente, avizinhava-se o perigo de eliminação. E qual foi o seu adversário na ronda de eliminação? A Team Spirit, a favorita a ganhar o torneio. E qual foi o resultado? Um atestado de competência da Team Falcons, que, com um 2-0, superiorizou-se à superpotência soberana. A Team Falcons levantou voo mesmo a tempo de subir ao palco principal.",
      "Começou com uma desforra na Barclays Arena: um 2-0 contundente contra a Tidebound. Frente à BB Team, a Falcons tropeçou na primeira partida. Em vez de jogar pelo seguro, recorreu a uma seleção agressiva para vencer a segunda partida. Chegada a terceira partida, a Team Falcons tinha a BB Team pelo pescoço. Seguiu-se a PVISION. A Falcons absorveu uma investida dolorosa na primeira partida, mas recuperou na segunda para chegar à igualdade. Para alcançar a remontada na terceira partida, a Falcons assinou a sua passagem para a Grande Final ao fim de uma hora, com um triunfo que levou ao rubro o público que assistia ao que se desenrolava no palco.",
      "Para reclamar para si a Égide dos Campeões no último dia, a Team Falcons teria de derrotar a única outra equipa que a tinha vencido. A Xtreme Gaming sobreviveu a uma intensa final do grupo inferior, a tempo de um reencontro prometedor. Na primeira partida, a Xtreme trucidou a Falcons. A Falcons deu resposta pronta com uma ofensiva impressionante na partida seguinte. A terceira partida parecia equilibrada, até ao momento em que todos os heróis da Falcons foram mortos, levando a uma vantagem de 2‑1 para a Xtreme. Mas a Falcons deu tudo por tudo na quarta partida para fugir à eliminação e obrigar a uma quinta partida decisiva.",
      "No ponto decisivo, uma seleção de peso da Falcons lançou uma combinação desorientante que permitiu alcançar o controlo do mapa a partir dos 15 minutos. A Xtreme Gaming bateu-se à defesa com valentia, mas, chegado o fim, foi a Team Falcons quem devastou os heróis adversários e deitou por terra o Ancient, para assim reclamar para si a Égide dos Campeões.",
      "Os nomes destes novos detentores do derradeiro símbolo do triunfo ficarão para sempre gravados na Égide dos Campeões:",
      "[b]2025 - Team Falcons[/b]",
      "[list]",
      "[*]Oliver \"skiter\" Lepko",
      "[*]Stanislav \"Malr1ne\" Potorak",
      "[*]Ammar \"AMMAR_THE_F\" Alassaf",
      "[*]Andreas \"Cr1t-\" Nielsen",
      "[*]Jingjun \"Sneyking\" Wu",
      "[/list]",
      "[b]Uma retrospetiva[/b]",
      "Tal como o Dota, o International é uma impressionante mistura de inúmeras partes em harmonia. Os fãs a torcer na arena, as equipas de sonho e prognósticos feitos por esse mundo fora, as táticas proferidas pelos espectadores em casa, a equipa de produção que prepara o espetáculo e, claro, os jogadores a competir nas cabines. Tudo isto resulta num evento incrivelmente especial no qual temos a honra de participar. ",
      "Como sempre, gostaríamos de agradecer a todos os jogadores, talentos e fãs do Dota por ajudarem a dar vida a esta celebração global. Caso tenhas perdido o torneio ou apenas queiras ver outra vez as incríveis jogadas, visita o [url=https://www.youtube.com/user/dota2]canal no YouTube do Dota 2[/url], onde podes encontrar as repetições de todo o espetáculo. Também podes encontrar várias fotografias do evento no [url=https://www.instagram.com/dota2/]Instagram do Dota 2[/url] e no [url=https://www.flickr.com/photos/dota2ti/]Flickr do Dota 2[/url].",
      "[b]A celebração dos campeões[/b]",
      "Estão agora disponíveis versões especiais de Campeão dos autocolantes da Team Falcons. Cada cápsula contém um autocolante de skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking ou da Team Falcons. 50% de todas as receitas revertem diretamente para a Team Falcons.",
      "[b]Desembrulha as tuas recompensas[/b]",
      "Como muitos podem ter reparado, o resultado do International deste ano foi um pouco... imprevisível. Dito isto, ainda bem que as recompensas do Dota de Sonho são atribuídas proporcionalmente. Quer estejas entre os 100 melhores com mais de uns estupendos 31560 pontos ou \"apenas\" entre os 15% melhores com cerca de 8280 pontos, podes abrir o jogo e reclamar os teus prémios esta quinta‑feira, dia 18 de setembro.",
      "[b]Novo tesouro: Cosmic Heroes' Hoard[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "O International pode ter terminado, mas o aparato cósmico do evento deste ano nunca precisa de desaparecer, porque temos 17 conjuntos inéditos com temas especiais — com itens Imortais, Personas e mais — para equipares nos teus heróis favoritos. Cada tesouro contém um conjunto para Ancient Apparition, Crystal Maiden, Enigma, Faceless Void, Marci, Mirana, Phantom Assassin, Lina, Phoenix, Spirit Breaker, Sven, Void Spirit ou Zeus, com uma pequena probabilidade de conter um conjunto raro adicional para Earthshaker, Luna, Ogre Magi ou Tinker. O conjunto para o Earthshaker até inclui o item Arcano \"Planetfall\" para o herói, que está de regresso pela primeira vez. Abre já o jogo para veres todas as novidades."
    ],
    "commentcount": 199,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 2415,
    "votedowncount": 198,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758126829,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 2412,
  "votes_down": 197,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}