{
  "gid": "509591543575741517",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025 Grand Champions",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1758062520,
  "rtime32_end_time": 1758065940,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "4ba13ce440c2d97294b14560cfcf46a3f1b113be.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1758058177
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1758058366
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1758062559
      }
    ],
    "automatically_push_updated_source": true
  },
  "announcement_body": {
    "gid": "509591543575741518",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025 Grand Champions",
    "posttime": 1758062560,
    "updatetime": 1758062560,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4ba13ce440c2d97294b14560cfcf46a3f1b113be.png[/img]Congratulations to Team Falcons, Grand Champions at The International 2025. After a year of mixed results, Team Falcons finally soared to the Aegis of Champions in Hamburg — by clawing, scrapping, and grinding through one of the grittiest marathons The International has ever seen. Of their ten series, only three were sweeps. Every other battle went the distance, including a five-game Grand Final.",
      "Falcons established themselves early with 2-1 wins over Nemesis and Tundra. Their first stumble came against Xtreme Gaming in a three-hour slugfest. Falcons ultimately fell, but their resilience was on full display. Next, they wiped away Team Liquid 2-0, but the following series against Tidebound was much more turbulent. Falcons lost, and suddenly elimination was looming. Their opponent in the elimination round? Team Spirit, the tournament favorites. The Result? A 2-0 statement from Falcons that sent the perennial powerhouse packing. Team Falcons had found their wings just in time for the main stage.",
      "They opened in Barclays Arena with a vengeance: a 2-0 sweep over Tidebound. Against BB Team, Falcons dropped the first match. Instead of playing it safe, they leaned into an aggressive draft to win game two. In game three, Falcons quickly put BB into a chokehold. PVISION was next. Falcons absorbed a painful stomp in game one, but rolled away with game two to even the set. To cap it off in game three, Falcons punched their ticket to the Grand Final by delivering an hour-long triumph that had the crowd roaring at the events on stage.",
      "To claim the Aegis of Champions on the final day, Team Falcons would need to defeat the only other team that had beaten them. Xtreme Gaming had survived an intense lower bracket final to set up a fitting rematch. In the first game, Xtreme carved Falcons apart. Falcons answered right back with a stunning beatdown in the next one. Game three seemed evenly matched — until a game-turning team wipe pushed Falcons into a 1-2 series hole. They clawed back in game four to stave off elimination and force a decisive game five.",
      "In the decider, a strong draft from Falcons unleashed a disruptive combo into the fray, and from minute 15 onward they took control of the map. Xtreme Gaming made a valiant effort at defense, but in the end Team Falcons tore into the enemy heroes and smashed down the Ancient — and the Aegis of Champions was theirs to claim.",
      "As bearers of the ultimate symbol of victory, these names shall forever be inscribed upon the Aegis of Champions:",
      "[b]2025 - Team Falcons[/b]",
      "[list]",
      "[*]Oliver \"skiter\" Lepko",
      "[*]Stanislav \"Malr1ne\" Potorak",
      "[*]Ammar \"AMMAR_THE_F\" Alassaf",
      "[*]Andreas \"Cr1t-\" Nielsen",
      "[*]Jingjun \"Sneyking\" Wu",
      "[/list]",
      "[b]Looking Back[/b]",
      "Like Dota itself, The International is an awe-inspiring mixture of countless moving parts. Every fan cheering in the arena, every fantasy roster and prediction made around the world, all the strategy proclamations made from the safety of your own home, the production staff that builds the show, and of course the players competing in the booths — it all adds up to an incredibly special event that we're honored to take part in. ",
      "As always, we would like to thank all of the players, talent, and everyone in the Dota community for helping bring this global celebration to life. If you missed any of the tournament, or just want to rewatch the amazing plays, head over to the [url=https://www.youtube.com/user/dota2]Dota 2 YouTube channel[/url], where you can find replays of the entire show. You can also find a trove of photos from the event over on the [url=https://www.instagram.com/dota2/]Dota 2 Instagram[/url] and [url=https://www.flickr.com/photos/dota2ti/]Dota 2 flickr[/url].",
      "[b]Celebrate the Champions[/b]",
      "Special Champion edition sticker capsules are now available for purchase for Team Falcons. Each capsule contains one sticker featuring skiter, Malr1ne, AMMAR_THE_F, Cr1t-, Sneyking, or Team Falcons. 50% of all sales will go directly to Team Falcons.",
      "[b]Unwrap Your Rewards[/b]",
      "As everyone's brackets may have noticed, the outcome of The International this year was a touch...unpredictable. So it's a good thing Fantasy Rewards are graded on a curve. Whether you're in the Top 100 with an astonishing 31560+ points, or \"just\" someone in the Top 15% with your hard-earned 8280+, you can head into the client to claim your prizes this Thursday, September 18.",
      "[b]New Cosmic Heroes' Hoard Treasure[/b]",
      "[img]{STEAM_CLAN_IMAGE}/3703047/2b1c4ca00864f50bcfab09a102a256edf4f1ddff.png[/img]",
      "The International may be over, but the cosmic trappings of this year's event need never end, because we've got 17 all-new special-themed item sets — featuring Immortals, Personas, and more — to wrap your favorite heroes in. Each treasure contains a set for Spirit Breaker, Enigma, Void Spirit, Ancient Apparition, Mirana, Zeus, Phoenix, Sven, Crystal Maiden, Faceless Void, Marci, Phantom Assassin, or Lina, as well as the chance to add a rare Tinker, Ogre Magi, Luna, or Earthshaker set into the mix. The Earthshaker set even includes the hero's Planetfall Arcana, returning for the first time. Jump into the game to check out the full spread."
    ],
    "commentcount": 10,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1758062676_0"
    ],
    "language": 0,
    "hidden": 0,
    "forum_topic_id": "592908590021346029",
    "event_gid": "509591543575741517",
    "voteupcount": 27,
    "votedowncount": 2,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "592908590021346029",
  "rtime32_last_modified": 1758062869,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1758062676,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 21,
  "votes_down": 2,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "592908590021346029",
  "clan_steamid_original": "103582791433224455"
}