{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "The International: Gói vật phẩm và dự đoán",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International: Gói vật phẩm và dự đoán",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]Gói vật phẩm đội và khách mời The International[/h3][p]The International cận kề: Toàn bộ 16 đội sẵn sàng để đến Đức, và chúng tôi vừa thông báo đầy đủ đội hình khách mời, bình luận viên trong trò chơi. Như bản thân Dota, The International là sự kiện toàn cầu, với thành viên đội tuyển đến từ hơn 30 quốc gia và lực lượng khách mời đại diện cho nhiều quốc gia khác nữa.[/p][p]Nhằm vinh danh những tuyển thủ và cá nhân này, năm nay chúng tôi tiếp tục truyền thống của The International là giới thiệu các gói người ủng hộ cho đội tuyển và khách mời trong trò chơi. Mỗi gói gồm nội dung tạo bởi đội tuyển hoặc khách mời liên quan, bao gồm màn hình chờ, hình dán, lời thoại, và nhiều nữa. 50% doanh số sẽ được chuyển trực tiếp tới đội tuyển hoặc khách mời, năm nay, thêm 30% từ mỗi gói ủng hộ được bán sẽ góp thẳng vào tổng tiền thưởng giải đấu.[/p][p]The International có bốn ngôn ngữ phát sóng chính, nhưng vẫn không đủ để tiếp cận tới từng người chơi Dota ở mọi nơi. Người hâm mộ khắp nơi trên thế giới tụ hội để ủng hộ cộng đồng nước nhà bằng ngôn ngữ [i]của họ[/i] và vì thế đây là lần đầu tiên chúng tôi thêm các gói ủng hộ cho một vài cộng đồng phát sóng. Chúng tôi đã thêm vài cộng đồng phát sóng với lượng khán giả đông nhất cho năm nay, bao gồm tiếng Bồ Đào Nha (Brazil), Filipino, và Ukraina. (Tương tự gói khách mời đơn lẻ, 50% sẽ được chuyển đến nhóm liên quan và thêm 30% vào tổng tiền thưởng).[/p][p]Bạn có thể duyệt xem tất cả gói đội tuyển cũng như khách mời từ menu chính. Cho dù đó là để ủng hộ tuyển thủ, bình luận viên, hay cộng đồng mình yêu thích, hay chỉ đơn thuần săn tìm lời thoại hay nhất, thì đây chính là cơ hội của bạn.[/p][p][/p][h3]Trận đấu và giải thưởng[/h3][p]Đấu trường chuyên nghiệp thế là đủ rồi: Giờ hãy nói về bạn nào.[/p][p]Hàng triệu người hâm mộ bước vào The International với, e hèm, những định kiến vững chãi như núi đá. Khu vực nào khủng nhất? Lý do thật tại sao các pro cứ chọn tướng với 16% tỷ lệ thắng? Earthshaker được buff đủ chưa?[/p][p]Điều tuyệt vời hơn cả việc biết mình đúng chính là chỉ ra cho người sai rằng mình luôn đúng. Với ý đồ đó, chúng tôi đã mang những tính năng đình đám nhất từ Compendium The International của vài năm gần đây và ra mắt miễn phí đến tất cả người chơi Dota: Bạn có thể trải nghiệm Fantasy và dự đoán ngay lúc này, bao gồm bảng xếp hạng để so sánh với bè bạn cũng như toàn thể cộng đồng Dota. [/p][p]\"Nhưng\", bạn khiếu nại rằng, \"bảng xếp hạng chỉ là phong độ nhất thời, đẳng cấp dự đoán chính xác của tôi phải được khắc ghi mãi mãi\". Chúng tôi xin ghi nhận. Đó là lý do tại sao năm nay chúng tôi xin giới thiệu Tyrian Regalia, một bộ sưu tầm các vật phẩm Bất diệt được trang hoàng lại dưới màu sắc của International năm nay. Không đem bán buôn được đâu nhé: Các vật phẩm này gắn liền với tài khoản và tặng thưởng riêng cho những nhà bói toán dự đoán hàng đầu cũng như quản lý Fantasy đỉnh cao. Nếu muốn sở hữu, thì bạn phải chiến thắng.[/p][p]Với tinh thần thể thao cạnh tranh công bằng, chúng tôi cũng đã cấm hơn 75000 tài khoản trao đổi trận thắng, đấu lệch trình, và các đối tượng xấu khác. Dù ở trình độ chơi nào, Dota luôn là trò chơi có trải nghiệm tốt nhất khi thi đấu công bằng.[/p][p][/p][h3]Tóm gọn lại[/h3][p]Chỉ vài tuần nữa là đến The International. Dù là để cổ vũ cho đội tuyển yêu thích, hoặc đọ trình với hàng triệu người hâm mộ khác, hay chỉ tò mò xem trận đấu sẽ ra sao, chúng tôi hoan nghênh chào đón bạn. Hẹn gặp bạn khi trận đấu bắt đầu.[/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 28,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}