{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "The International: pacchetti e previsioni",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International: pacchetti e previsioni",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]Pacchetti delle squadre e dei talenti del The International[/h3][p]Il The International si avvicina. Le sedici squadre partecipanti si stanno preparando per andare in Germania e noi abbiamo appena annunciato all'interno del gioco il roster completo dei talenti che appariranno sullo schermo. Come Dota, il The International è un evento globale, con squadre i cui giocatori provengono da oltre trenta stati e talenti che ne rappresentano ancora di più.[/p][p]Per seguire la tradizione e come riconoscimento a questi giocatori e talenti, anche quest'anno il The International offrirà pacchetti di supporto alle squadre e ai talenti all'interno del gioco. Ogni pacchetto include contenuti creati dalla squadra o dai talenti corrispondenti, come schermate di caricamento, adesivi, frasi e molto altro ancora. Il 50% di ogni vendita va direttamente alla squadra o al talento e, quest'anno, l'ulteriore 30% di ogni vendita di pacchetti dei tifosi andrà a formare il montepremi del torneo.[/p][p]Il The International viene trasmesso in quattro lingue, ma ciò non basta a coprire tutto il pubblico dei giocatori di Dota presenti nel mondo. I fan di tutto il pianeta si riuniscono per sostenere le loro comunità locali nella [i]loro[/i] lingua, e così per la prima volta abbiamo aggiunto anche dei pacchetti per i tifosi per alcune trasmissioni che interessano le comunità più importanti. Quest'anno abbiamo selezionato alcune delle trasmissioni delle comunità con il pubblico più vasto, tra cui quelle in lingua portoghese brasiliana, filippina e ucraina. Come per i pacchetti dei talenti individuali, il 50% di tutte le vendite andrà al gruppo in questione e il 30% al montepremi del torneo.[/p][p]Puoi esplorare tutti i pacchetti delle squadre e dei talenti dal menu principale. Questa è la tua occasione per trovare il tuo giocatore preferito, il tuo commentatore preferito, la tua comunità preferita o la frase che ti piace di più.[/p][p][/p][h3]Partite e ricompense[/h3][p]Basta parlare di professionisti: parliamo di te.[/p][p]Milioni di fan assistono al The International con convinzioni, diciamo, incrollabili. Quale regione è più forte? Qual è il vero motivo per cui i giocatori professionisti continuano a scegliere quell'Eroe con una percentuale di vittorie del 16%? Earthshaker è stato potenziato a sufficienza?[/p][p]L'unica cosa migliore dell'avere ragione è poter dimostrare a tutti quelli che avevano torto che tu avevi comunque ragione. Tenendo presente questo, abbiamo raccolto le funzionalità più popolari del Compendio del The International degli ultimi anni e le metteremo a disposizione di tutti i giocatori di Dota gratuitamente. Il FantaDota e i pronostici sono già disponibili e includono classifiche per consentirti di confrontarti con i tuoi amici o con l'intera Comunità di Dota. [/p][p]A questo puoi rispondere che le classifiche sono temporanee e che preferiresti che durassero per sempre. Ti capiamo, e per questo motivo, quest'anno introduciamo le Regalie di Tiro, una collezione di oggetti Immortali rivisitati per celebrare il colore del The International di quest'anno. Non sono oggetti in vendita, ma sono associati all'account come ricompensa esclusiva assegnata a chi effettua le migliori previsioni e ai manager di FantaDota. Se le vuoi, l'unica via è la vittoria.[/p][p]Per garantire una competizione equa, abbiamo anche bloccato oltre 75.000 malintenzionati coinvolti nello scambio di vittorie, smurfing e altri tipi di frodi. Dota è un gioco che, a qualsiasi livello, è più divertente se si gioca in condizioni di parità.[/p][p][/p][h3]In sintesi[/h3][p]Mancano solo poche settimane al The International. Che tu sia qui per tifare le tue squadre preferite, per confrontare le tue abilità con quelle dei milioni di fan presenti tra il pubblico o per vedere come si concludono le partite, siamo felici di averti con noi. Ci vediamo allo scoccare del torneo.[/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}