{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "The International — прогнози и комплекти",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International — прогнози и комплекти",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]The International комплекти за отбори и таланти[/h3][p]The International наближава. Всичките шестнадесет отбора са готови да се отправят към Германия, а ние току-що анонсирахме пълния състав от талантите, които ще коментират в играта. Подобно на самата Dota 2, The International е глобално дело, с отборни членове, произхождащи от повече от тридесет държави, и коментаторски таланти представляващи още повече.[/p][p]Отдавайки признание на тези играчи и личности, тази година продължаваме традицията от The International да предлагаме комплекти за привържениците на отбори и таланти в играта. Всеки комплект включва съдържание, създадено от въпросния отбор или талант. Това съдържание включва екрани при зареждане, стикери, гласови реплики и още други. 50% от всяка продажба отиват директно към отбора или таланта. А тази година допълнителни 30% от всяка продажба на комплект за привърженици ще отиват към наградния фонд на турнира.[/p][p]The International разполага с предавания на четири официални езика, но дори това не е достатъчно, за да достигнем до Dota 2 играчите навсякъде. Почитателите по целия свят се събират, за да подкрепят своите местни общности на [i]техния[/i] език. И така за пръв път също добавихме комплекти на привържениците за някои от по-големите обществени предавания. Избрахме няколко от обществените предавания с най-голяма аудитория през тази година, включително бразилски португалски, филипински и украински. Както и при индивидуалните комплекти за таланти, 50% отиват към въпросната група, а допълнителни 30% към наградния фонд.[/p][p]Можете да прегледате всички комплекти за отбори и таланти от главното меню. Независимо дали разполагате с любим играч, водещ/коментатор, общност или издирвате най-добрата гласова реплика, сега е Вашата благоприятна възможност.[/p][p][/p][h3]Игри и награди[/h3][p]Стига толкова дрънканици относно професионалистите. Нека да поговорим за Вас.[/p][p]Милиони почитатели отиват на The International с… Нека да речем, силно изразени становища. Кой регион е най-силен? Каква е истинската причина професионалистите да продължават да избират този герой с 16% успеваемост? Дали Earthshaker е бил достатъчно подсилен?[/p][p]Единственото по-хубаво нещо от това да сте прави, е да можете да покажете на всички останали, които са грешали, колко прави винаги сте били. Имайки това предвид, взехме най-популярните характеристики от The International Compendium през последните няколко години и ги правим достъпни безплатно за всеки Dota 2 играч: въображаемата лига и прогнозите са достъпни в момента и включват класации, така че да можете да се сравнявате със своите приятели и цялата Dota 2 общност. [/p][p]„Но“, ще кажете Вие, „тези класации са временни, а моята правота трябва да трае навеки.“ Чуваме Ви. Ето защо тази година също представяме и Tyrian Regalias, колекция от Immortal артикули, префасонирани за тазгодишното цветово оформление на The International. Те не са за продан. Тези артикули, заключени към акаунта, са ексклузивни награди за предсказващите потребители с най-висок ранг и управителите на въображаеми лиги. Ако ги искате, единственият курс е победата.[/p][p]В духа на честното съревнование също наложихме забрани на над 75 000 търговци на победи, „смърф“ акаунти и други лоши дейци. При всички нива на умение, Dota 2 е заглавие, в което най-добрата наслада идва с равнопоставеност на бойното поле.[/p][p][/p][h3]За завършек[/h3][p]The International е само след две седмици. Независимо дали сте тук, за да ликувате за любимите си отбори, а може би сте тук, за да премерите уменията си срещу милионите други почитатели в аудиторията или просто сте тук, за да гледате как се развиват мачовете, радваме се да Ви посрещнем. Ще се видим, когато игрите стартират.[/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}