{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "The International: lotes y predicciones",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International: lotes y predicciones",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]Lotes de los talentos y equipos de The International[/h3][p]Se acerca The International: los dieciséis equipos viajarán a Alemania y acabamos de anunciar la alineación completa de talentos que aparecerán en pantalla en el juego. Al igual que en Dota, The International es un evento mundial, con equipos participantes provenientes de más de treinta países y con talentos que representan incluso más lugares.[/p][p]En reconocimiento a estos jugadores y personalidades, este año continuamos con la tradición de The International de ofrecer lotes de talento y de club de seguidores del equipo dentro el juego. Cada lote incluye contenido creado por el equipo o talento en cuestión, el cual incluye pantallas de carga, calcomanías, líneas de voz y más. El 50 % de las ganancias va directamente al equipo o talento, y este año, un 30 % adicional de las ganancias de cada lote de club de seguidores del equipo irá a la bolsa de premios del torneo.[/p][p]The International cuenta con cuatro idiomas oficiales para su retransmisión, pero incluso así, no es suficiente para llegar a toda la audiencia de jugadores de Dota en el mundo. Los fans de todo el mundo se reúnen para apoyar a sus comunidades locales en [i]su[/i] idioma, y por primera vez, también agregamos lotes de club de seguidores para algunas de las comunidades más importantes. Este año, elegimos algunas de las retransmisiones de las comunidades con audiencias más grandes, incluyendo portugués brasileño, filipino y ucraniano. Al igual que con los lotes de talentos individuales, el 50 % de las ganancias se destina al grupo en cuestión y el 30 %, a la bolsa de premios.[/p][p]Puedes explorar todos los lotes de equipos y talentos desde el menú principal.  Esta es tu oportunidad para encontrar a tu jugador favorito, a tu comentarista favorito, tu comunidad favorita o la línea de voz que más te guste.[/p][p][/p][h3]Partidas y recompensas[/h3][p]Ya estuvo bueno de hablar de los profesionales: es hora de hablar de ti.[/p][p]Millones de fans asisten a The International con, digamos, opiniones muy firmes. ¿Cuál es la región más fuerte? ¿Cuál es la razón real por la que los profesionales seleccionan a ese héroe con una tasa de victorias del 16 %? ¿Se mejoró lo suficiente a Earthshaker?[/p][p]Lo único mejor que tener la razón es poderle demostrar a todo el mundo quién estaba equivocado y qué tanta razón tenías. Con eso en mente, tomamos las características más populares del Compendio de The International de los años pasados y las pondremos a la disposición de todos los jugadores de Dota de forma gratuita: Las predicciones y Liga Fantasía ya están disponibles, e incluyen tablas de clasificación para que te compares con tus amigos y la comunidad completa de Dota. [/p][p]Dirías, \"pero estas tablas de clasificación son temporales y el hecho de tener la razón necesita quedar plasmado para siempre\". Te escuchamos. Es por eso que este año presentamos el Atavío de Tiria, una colección de objetos inmortales adaptados al diseño de The International de este año. Estos objetos no están disponibles para su venta, ya que son recompensas exclusivas para aquellos con las mejores predicciones y los administradores de Liga Fantasía. Si los quieres, la única forma para obtenerlos es la victoria.[/p][p]Para mantener una competencia justa, también vetamos a más de 75 000 cuentas de [i]smurf[/i] involucradas en el tráfico de victorias y a otros tramposos. Sin importar tu nivel de experiencia, Dota se disfruta más bajo igualdad de condiciones.[/p][p][/p][h3]En resumen[/h3][p]Faltan un par de semanas para The International. Sin importar que estés aquí para apoyar a tus equipos favoritos, para mostrar tus habilidades contra millones de fans en la audiencia, o que solo estés aquí para ver las partidas, estamos encantados de contar contigo. ¡Nos vemos cuando inicien las partidas![/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}