{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "The International: Pakete und Prognosen",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International: Pakete und Prognosen",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]The International – Team- und Talentpakete[/h3][p]The International steht vor der Tür. Sechzehn Teams treten ihre Reise nach Deutschland an, und wir haben gerade die vollständige Liste der Talente im Spiel bekannt gegeben. The International ist wie Dota selbst eine internationale Angelegenheit.",
      "Die Teammitglieder stammen aus über dreißig Ländern, und die Talente repräsentieren noch mehr.[/p][p]In Anerkennung und zur Unterstützung aller Teilnehmer setzen wir eine beliebte Tradition von The International fort und bieten auch dieses Jahr Team- und Talentpakete im Spiel an. Jedes Paket enthält vom jeweiligen Team oder Talent erstellte Inhalte, wie Ladebildschirme, Aufkleber, Sprüche und mehr. 50 % der Erlöse gehen wie bisher direkt an das Team oder Talent. Dieses Jahr fließen jedoch zusätzlich 30 % jedes Paketverkaufs in das Preisgeld des Turniers.[/p][p]The International wird in vier Sprachen übertragen, doch diese reichen bei Weitem nicht aus, um alle Dota-Spieler weltweit zu erreichen. Überall auf der Welt kommen Fans zusammen, um ihre Dota-Community in ihrer eigenen Sprache zu unterstützen. Dementsprechend haben wir Unterstützerpakete für einige der größten Communitys hinzugefügt. Für diese Pakete haben wir die Community-Übertragungen mit dem größten Publikum ausgewählt, darunter brasilianisches Portugiesisch, Philippinisch und Ukrainisch. (Wie bei den einzelnen Talentpaketen gehen 50 % der Erlöse an die jeweilige Gruppe und weitere 30 % fließen in das Preisgeld.)[/p][p]Sie können alle Team- und Talentpakete im Hauptmenü von Dota durchstöbern. Unabhängig davon, ob Sie Ihren Lieblingsspieler, Lieblingskommentator oder Ihre Lieblings-Community unterstützen oder einfach nur den besten Spruch finden möchten, jetzt ist Ihre Chance![/p][p][/p][h3]Partien und Belohnungen[/h3][p]Soviel zu den Profis – nun zu Ihnen.[/p][p]Millionen von Fans besuchen The International mit klaren Ansichten. Welche Region hat die besten Spieler? Warum wählen Profis immer wieder den Helden mit einer miserablen Gewinnrate von 16 %? Wurde Earthshaker ausreichend gestärkt?[/p][p]Recht haben ist gut, noch besser ist es jedoch, dies alle im Nachhinein wissen zu lassen. Vor diesem Hintergrund haben wir die beliebtesten Funktionen der letzten Jahre aus dem Kompendium übernommen und stellen sie jetzt allen Dota-Spielern kostenlos zur Verfügung: Prognosen und die Fantasy-Herausforderung sind ab sofort verfügbar und umfassen Bestenlisten, sodass Sie sich mit Ihren Freunden und der gesamten Dota-Community vergleichen können. [/p][p]Jetzt sagen Sie vielleicht: „Die Bestenlisten sind Schall und Rauch. Ich will, dass auf ewig festgehalten wird, wie recht ich hatte.“ Keine Sorge, genau deshalb führen wir die Tyrischen Insignien ein, eine Sammlung von Immortal-Gegenständen im Design der diesjährigen The International. Diese Gegenstände stehen nicht zum Verkauf, sondern sind stattdessen an die Accounts der bestplatzierten Prognostiker und Fantasy-Manager gebunden. Der Sieg ist also der einzige Weg zum Besitz.[/p][p]Im Sinne eines fairen Wettbewerbs haben wir außerdem über 75 000 Accounts gesperrt, die am Handel mit gewonnenen Partien, Smurfing und anderen böswilligen Aktivitäten beteiligt waren. Dota macht grundsätzlich am meisten Spaß, wenn alle Spieler unter den gleichen Voraussetzungen antreten.[/p][p][/p][h3]Zusammenfassung[/h3][p]Die International ist nur noch ein paar Wochen entfernt. Egal, ob Sie hier sind, um Ihr Lieblingsteam anzufeuern, Ihre Dota-Expertise mit der von Millionen anderer Fans zu messen oder Sie sich einfach nur die Partien ansehen wollen – wir freuen uns auf Sie. Bis bald![/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}