{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "The International: pakiety i typowanie",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International: pakiety i typowanie",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]Pakiety drużyn i ekspertów The International[/h3][p]The International nadchodzi wielkimi krokami! Wszystkie 16 drużyn uda się do Niemiec, a my właśnie ogłosiliśmy pełen skład ekspertów w grze. Tak jak sama Dota 2, The International to rzecz światowej wagi, gdzie członkowie drużyn pochodzą z ponad 30 krajów, a eksperci reprezentują ich jeszcze więcej.[/p][p]W uznaniu dla tych graczy oraz osobistości podtrzymujemy w tym roku tradycję The International polegającą na oferowaniu pakietów kibica drużyn oraz ekspertów w grze. Każdy z nich zawiera treści stworzone przez rzeczoną drużynę lub eksperta, włączając w to ekrany ładowania, naklejki, kwestie głosowe i nie tylko. 50% z każdej sprzedaży trafia bezpośrednio do danej drużyny lub eksperta, a w tym roku dodatkowe 30% z każdej sprzedaży pakietu kibica powędruje do turniejowej puli nagród.[/p][p]The International jest transmitowane oficjalnie w 4 językach, ale nawet to nie wystarczy, by dotrzeć do graczy Dota 2 w każdym miejscu. Fani we wszystkich zakątkach świata zbierają się, by wspierać swoje lokalne społeczności w [i]swoim[/i] języku, więc po raz pierwszy dodaliśmy pakiety kibica także dla niektórych z większych transmisji społeczności. Wybraliśmy kilka transmisji społeczności z największą liczbą odbiorców w tym roku, włączając w to te w języku brazylijskim portugalskim, filipińskim oraz ukraińskim. Tak jak w przypadku indywidualnych pakietów ekspertów, 50% trafia do danej grupy, a dodatkowe 30% wędruje do puli nagród.[/p][p]Możecie przeglądać wszystkie pakiety drużyn oraz ekspertów z poziomu głównego menu. Niezależnie od tego, czy macie swojego ulubionego gracza, prezentera, społeczność, czy też zasadzacie się na najlepszą kwestię głosową, to wasza szansa jest właśnie teraz.[/p][p][/p][h3]Gry i nagrody[/h3][p]Starczy już o zawodowcach – pomówmy teraz o was.[/p][p]Miliony fanów udaje się na The International z, powiedzmy, mocno wyrobionymi opiniami. Który region jest najmocniejszy? Jaka jest rzeczywista przyczyna tego, że zawodowcy w kółko wybierają tego bohatera z 16% wygranych? Czy Earthshakerowi wystarczająco podbili staty?[/p][p]Lepsza od posiadania racji jest tylko możliwość pokazania wszystkim, co się mylili, jak bardzo mieliście od zawsze rację. Mając to na uwadze, wzięliśmy najpopularniejsze funkcje z Kompendium The International z ostatnich kilku lat i udostępniamy je każdemu graczowi Dota 2 za darmo. Liga marzeń oraz typowania są dostępne już teraz i zawierają rankingi, byście mogli porównywać się ze znajomymi oraz całą społecznością gry. [/p][p]Ale… – bąkacie – te tabele wyników są chwilowe, a moja racja musi trwać wiecznie. I tu was słyszymy. Właśnie dlatego w tym roku wprowadzamy także Tyriańskie Regalia stanowiące zbiór wiekopomnych przedmiotów przerobionych w barwach tegorocznego The International. Nie są na sprzedaż. Te przypisane do konta przedmioty to ekskluzywne nagrody dla czołowych ekspertów od typowań oraz ligi marzeń. Jeśli ich pragniecie, to jedyną do nich drogą jest zwycięstwo.[/p][p]W duchu uczciwej rywalizacji zbanowaliśmy także ponad 75 000 graczy zmawiających się co do wygranych, smerfujących, a także innych wykazujących się nieprawidłowym zachowaniem. Na wszystkich szczeblach Dota 2 to gra, która daje najwięcej frajdy, gdy odbywa się na równych zasadach.[/p][p][/p][h3]Podsumowanie[/h3][p]Do The International pozostało zaledwie parę tygodni. Niezależnie od tego, czy jesteście tu, by kibicować swoim ulubionym drużynom, czy zmierzyć się na poziom umiejętności z milionami innych graczy wśród publiczności, czy nawet przybywacie tylko po to, żeby zobaczyć, jaki przebieg obiorą gry, to cieszymy się, że jesteście z nami. Do zobaczenia na rozpoczęciu meczów.[/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}