{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "The International: ชุดรวมและการทายผล",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International: ชุดรวมและการทายผล",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]ชุดรวมทีมและผู้เชี่ยวชาญ The International[/h3][p]The International ใกล้เข้ามาแล้ว: ทั้ง 16 ทีมเตรียมพร้อมมุ่งหน้าสู่เยอรมนี และตอนนี้เราก็เพิ่งประกาศรายชื่อผู้เชี่ยวชาญทั้งหมดบนหน้าจอในเกม เช่นเดียวกับ Dota เอง The International นั้นเป็นมหกรรมระดับโลก โดยมีสมาชิกทีมมาจากกว่า 30 ประเทศ และเหล่าผู้เชี่ยวชาญที่เป็นตัวแทนจากประเทศต่าง ๆ อีกมากมาย[/p][p]เพื่อเป็นการยกย่องผู้เล่นและดาวเด่นในวงการเหล่านี้ ในปีนี้เรายังคงสานต่อธรรมเนียมของ The International ด้วยการนำเสนอชุดรวมสนับสนุนทีมและผู้เชี่ยวชาญในเกมต่อไป ชุดรวมแต่ละชุดประกอบด้วยเนื้อหาที่สร้างโดยทีมและผู้เชี่ยวชาญดังกล่าว ประกอบด้วยหน้าจอโหลด สติกเกอร์ ประโยคเสียง และอีกมากมาย โดย 50% ของยอดขายทั้งหมดจะมอบให้กับทีมหรือผู้เชี่ยวชาญโดยตรง และในปีนี้ รายได้เพิ่มเติมอีก 30% จากยอดขายชุดรวมผู้สนับสนุนแต่ละชุดจะถูกนำไปสมทบเป็นเงินรางวัลรวมของการแข่งขัน[/p][p]The International มีการถ่ายทอดสดอย่างเป็นทางการในสี่ภาษา แต่นั่นก็ยังไม่เพียงพอที่จะเข้าถึงผู้เล่น Dota ในทุกที่ แฟน ๆ ทั่วโลกต่างรวมตัวกันเพื่อสนับสนุนชุมชนท้องถิ่นด้วยภาษา[i]ของตนเอง[/i] นี่จึงเป็นครั้งแรกที่เราได้เพิ่มชุดรวมผู้สนับสนุนสำหรับการถ่ายทอดสดของชุมชนขนาดใหญ่บางส่วนด้วยเช่นกัน เราได้เลือกการถ่ายทอดสดของชุมชนบางส่วนที่มีผู้ชมมากที่สุดในปีนี้ ประกอบด้วยภาษาโปรตุเกส (บราซิล) ภาษาฟิลิปปินส์ และภาษายูเครน (เช่นเดียวกับชุดรวมผู้เชี่ยวชาญ รายได้ 50% จะมอบให้กับกลุ่มบุคคลดังกล่าว และอีก 30% จะถูกนำไปสมทบเป็นเงินรางวัลรวม)[/p][p]คุณสามารถเปิดหาชุดรวมทีมและชุดรวมผู้เชี่ยวชาญทั้งหมดได้จากเมนูหลัก ไม่ว่าจะเป็นผู้เล่นที่คุณชื่นชอบ นักพากย์ที่คุณชื่นชอบ ชุมชนที่คุณชื่นชอบ หรือคุณเพียงแค่กำลังตามล่าหาประโยคเสียงที่ดีที่สุด ตอนนี้โอกาสเป็นของคุณแล้ว[/p][p][/p][h3]เกมและของรางวัล[/h3][p]เราพูดถึงผู้เชี่ยวชาญมาเยอะแล้ว: ตอนนี้เรามาพูดถึงคุณกันดีกว่า[/p][p]แฟน ๆ นับล้านหลั่งไหลเข้าชม The International ด้วยความคิดเห็นอันหนักแน่น ภูมิภาคใดแข็งแกร่งที่สุด? อะไรคือเหตุผลที่แท้จริงที่เหล่าผู้เล่นมืออาชีพเลือกฮีโร่ตัวนั้นทั้ง ๆ ที่มีอัตราชนะเพียงแค่ 16%? Earthshaker ถูกบัฟมากพอแล้วหรือยัง?[/p][p]มีเพียงสิ่งเดียวที่ดีกว่าการเป็นฝ่ายถูก คือการที่สามารถแสดงให้ทุกคนที่เคยคิดผิดได้เห็นว่าคุณนั้นเป็นฝ่ายถูกมาโดยตลอด ด้วยเหตุนี้ เราจึงนำคุณสมบัติยอดนิยมที่สุดจาก Compendium ของ The International ในช่วงหลายปีที่ผ่านมา และเปิดให้ผู้เล่น Dota ทุกคนใช้งานได้ฟรี: การทายผลและแฟนตาซีพร้อมให้ใช้งานแล้วในขณะนี้ โดยมาพร้อมกับกระดานผู้นำเพื่อให้คุณสามารถเปรียบเทียบตนเองกับเพื่อนและชุมชน Dota ทั้งหมดได้ [/p][p]\"แต่\" คุณกล่าว \"กระดานผู้นำเหล่านี้เป็นแค่เรื่องชั่วคราว แต่ความถูกต้องของฉันต้องคงอยู่ตลอดไป\" เรารับฟังเสียงของคุณ นั่นจึงเป็นเหตุผลที่ในปีนี้เราได้เปิดตัว Tyrian Regalia ซึ่งเป็นชุดสะสมไอเท็ม Immortal ที่ได้รับการรังสรรค์ใหม่ในธีมสีของ The International ประจำปีนี้ ไอเท็มเหล่านี้ไม่ได้มีไว้ขาย เพราะไอเท็มจะล็อกไว้กับบัญชีและเป็นรางวัลพิเศษสำหรับเหล่านักทำนายและผู้จัดการทีมแฟนตาซีที่ได้อันดับต้น ๆ เท่านั้น หากคุณอยากได้ไอเท็มเหล่านี้ หนทางเดียวก็คือชัยชนะเท่านั้น[/p][p]ด้วยจิตวิญญาณแห่งการแข่งขันที่ยุติธรรม เราได้แบนผู้เล่นที่ล็อกผลผลัดกันแพ้ชนะ ผู้เล่นสเมิร์ฟ และผู้เล่นที่มีพฤติกรรมไม่เหมาะสมในลักษณะอื่น ๆ ไปแล้วกว่า 75,000 ราย Dota เป็นเกมที่สนุกที่สุดเมื่อแข่งขันอย่างเท่าเทียมกันในทุกระดับการเล่น[/p][p][/p][h3]ปิดท้าย[/h3][p]The International กำลังจะมาถึงในอีกไม่กี่สัปดาห์ข้างหน้า ไม่ว่าคุณจะมาเชียร์ทีมโปรดของคุณ หรือเพื่อเปรียบเทียบทักษะของคุณกับแฟน ๆ อีกหลายล้านคนที่รับชม หรือแค่มาเพื่อชมการแข่งขัน เราก็ยินดีที่คุณได้มีส่วนร่วม แล้วพบกันเมื่อการแข่งขันเริ่มขึ้นนะ[/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}