{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "The International: pachete și pronosticuri",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International: pachete și pronosticuri",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]The International – pachetele echipelor și realizatorilor[/h3][p]The International se apropie: toate cele șaisprezece echipe sunt gata să vină în Germania, iar noi avem plăcerea de a anunța acum lista completă a realizatorilor de transmisiuni. Asemenea jocului Dota, The International este un fenomen internațional, membrii echipelor profesioniste provenind din peste treizeci de țări, în timp ce realizatorii provin din și mai multe țări.[/p][p]În semn de recunoștință pentru jucători și personalități, anul acesta continuăm tradiția campionatului The International de a oferi în joc pachete de fan club cu echipele și realizatorii participanți. Fiecare pachet include conținut creat de echipa sau realizatorul respectiv, inclusiv ecrane de încărcare, abțibilduri, replici și multe altele. 50% din încasările generate de aceste pachete vor merge direct către echipele și realizatorii aferenți și, în acest an, 30% din încasări vor fi redirecționate către fondul de premiere al campionatului.[/p][p]The International va oferi difuzări oficiale în patru limbi, dar, în ciuda acestui fapt, acestea nu sunt suficiente pentru a ne adresa jucătorilor de Dota de pretutindeni. Cu toții știm că fani din întreaga lume se reunesc pentru a-și sprijini comunitățile locale în limba [i]lor[/i], iar, în acest sens, adăugăm pentru prima dată pachete de fan club de difuzare pentru unele dintre cele mai mari comunități. Am selectat câteva dintre transmisiunile comunitare cu cele mai mari audiențe de anul acesta, printre care transmisiuni din Brazilia, Filipine și Ucraina. (Ca în cazul pachetelor individuale ale realizatorilor, 50% din încasările generate vor merge către grupul respectiv, iar 30% către fondul de premiere.)[/p][p]Poți găsi toate pachetele echipelor și realizatorilor în meniul principal. Indiferent dacă ai un jucător preferat, un crainic preferat, o comunitate preferată sau doar cauți cea mai bună replică vocală pentru chat, acum este șansa ta.[/p][p][/p][h3]Meciuri și recompense[/h3][p]Destul despre profesioniști, așa că hai să vorbim despre restul comunității.[/p][p]Milioane de fani intră în polemici în fiecare an pe tema campionatului The International: „Care e cea mai puternică regiune?” „Care-i adevăratul motiv pentru care jucătorii profesioniști continuă să aleagă acel erou cu un procentaj de câștig de doar 16%?” „Oare a primit Earthshaker suficiente îmbunătățiri?”[/p][p]Singurul lucru mai plăcut decât să ai dreptate în cazul unor astfel discuții contradictorii este să le demonstrezi tuturor cât de mult s-au înșelat și că tu ai avut întotdeauna dreptate. Drept urmare, am preluat cele mai populare caracteristici ale compendiului The International din ultimii ani, iar anul acesta le facem disponibile gratuit pentru toți jucătorii de Dota: provocarea Fantasy și pronosticurile sunt disponibile din acest moment, iar acestea includ clasamente, astfel încât să îți poți compara rezultatele cu cele ale prietenilor și ale întregii comunități Dota. [/p][p]„Dar aceste clasamente sunt temporare, iar dovada corectitudinii mele ar trebui să fie veșnică.” Ei bine, avem vești bune pentru tine. Din acest an oferim Tyrian Regalia, o colecție de obiecte Immortal recreate în culorile ediției de anul acesta a campionatului The International. Acestea nu sunt de vânzare: obiectele în cauză sunt asociate permanent unui cont și sunt acordate celor mai pricepuți la pronosticuri, dar și celor mai buni manageri de echipe Fantasy. Dacă dorești să le obții, singura ta cale este victoria.[/p][p]În spiritul fairplayului, am aplicat interdicții unui număr de peste 75.000 de conturi implicate în activități de manipulare a victoriilor, smurfing și alte activități ilicite. Indiferent de nivelul de aptitudini, Dota este un joc care este cu mult mai distractiv atunci când toți joacă corect.[/p][p][/p][h3]În rezumat[/h3][p]Doar două săptămâni ne despart de The International. Indiferent că vrei să-ți susții echipele preferate, să-ți compari aptitudinile cu cele ale milioanelor de fani din public sau să urmărești parcursul competițional, ne bucurăm că ești alături de noi. Ne vedem la campionat![/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}