{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "Pacotes e prognósticos do International",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Pacotes e prognósticos do International",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]Pacotes de equipas e talentos do International[/h3][p]O International está próximo: todas as 16 equipas estão prontas para rumar à Alemanha e acabámos de anunciar o plantel de talentos participantes no jogo. Como o próprio Dota, o International é um fenómeno global que conta com membros de equipas que remontam a mais de 30 países e talentos a representar muitos mais.[/p][p]Em reconhecimento destes jogadores e personalidades, este ano vamos continuar a tradição do International de disponibilizar pacotes das equipas e talentos no jogo. Cada pacote consiste de conteúdo criado pela equipa ou talento em questão, incluindo ecrãs de loading, autocolantes, mensagens de voz e muito mais. 50% do valor de cada venda destina‑se diretamente à respetiva equipa ou talento e, este ano, 30% do valor de cada pacote vendido será somado ao prémio total.[/p][p]O International é transmitido em quatro idiomas oficiais, mas nem isso é suficiente para alcançar os jogadores do Dota espalhados pelo globo. Por todo o mundo, fãs juntam-se para apoiar as suas comunidades locais nos [i]seus[/i] idiomas e, pela primeira vez, adicionámos pacotes para algumas das maiores transmissões comunitárias. Este ano, selecionámos algumas das transmissões de comunidades com o maior número de espectadores, incluindo as do Brasil, das Filipinas e da Ucrânia. (Tal como acontece com os pacotes de talentos individuais, 50% do valor de cada venda reverte a favor do grupo em questão e 30% é somado ao prémio total.)[/p][p]Podes explorar os pacotes de todas as equipas e talentos no menu principal. Quer tenhas um jogador favorito, um comentador favorito, uma comunidade favorita, ou estejas só à procura da melhor mensagem de voz, agora é a tua oportunidade.[/p][p][/p][h3]Partidas e recompensas[/h3][p]Deixemos os profissionais de lado: agora vamos falar sobre ti.[/p][p]Milhões de fãs chegam ao International, há que dizê-lo, com opiniões muito convictas. Qual das regiões é a mais forte? Qual é a verdadeira razão que leva os pros a escolher constantemente aquele herói com uma taxa de vitórias de 16%? O Earthshaker levou buffs que cheguem?[/p][p]A única coisa melhor do que ter razão é poder mostrar a outros o quão errado estavam e como tu sempre tiveste toda a razão do mundo. E, com isso em mente, escolhemos as funcionalidades mais populares do Compêndio do International nos últimos anos e vamos disponibilizá-las gratuitamente para todos os jogadores do Dota. Dota de Sonho e Prognósticos estão já disponíveis e incluem tabelas de liderança, para que te possas comparar com os teus amigos e com toda a comunidade do Dota. [/p][p]\"Mas esperem lá,\" dizes tu, \"estas tabelas são temporárias e a minha «eu⁠-⁠disse⁠-⁠que⁠-⁠tinha⁠-⁠razãozice» tem de durar para sempre\". É, nós entendemos. Por isso mesmo, este ano vamos introduzir a Tyrian Regalia, que é uma coleção de itens Imortais recriados na cor alusiva a esta edição do International. Não estão à venda: estes itens, que ficam associados à conta uma vez obtidos, são recompensas exclusivas para os melhores prognosticadores e managers do Dota de Sonho. Se os queres, tens como único meio a vitória.[/p][p]E, no espírito do \"fair play\", também banimos mais de 75 000 contas envolvidas em manipulação de vitórias, smurfing e outras atividades ilícitas. Seja qual for o nível de jogo, o Dota é um jogo que é mais divertido quando todos estão em pé de igualdade.[/p][p][/p][h3]Resumindo[/h3][p]Faltam poucas semanas para o International. Quer estejas aqui para apoiar as tuas equipas favoritas, medir forças com os milhões de outros fãs no público, ou só para assistir às partidas, é um prazer ter-te connosco. Vemo-nos quando as partidas começarem.[/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}