{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "The International: lotes y predicciones",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International: lotes y predicciones",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]Lotes de los talentos y equipos de The International[/h3][p]Se acerca The International. Los dieciséis equipos participantes están preparándose para ir a Alemania, y nosotros acabamos de anunciar dentro del juego la plantilla completa de talentos de la retransmisión oficial. Como Dota, The International es un evento global, con equipos cuyos jugadores vienen de más de treinta países y con talentos que representan aún más lugares.[/p][p]Para seguir la tradición, y como reconocimiento a esos jugadores y talentos, este año The International también va a ofrecer lotes de apoyo a equipos y talentos dentro del juego. Cada lote incluye contenido creado por el equipo o talento correspondiente, como pantallas de carga, pegatinas, líneas de voz y mucho más. El 50 % de todas las ventas se destina directamente a ese equipo o talento, y un 30 % de cada lote de apoyo se destina al fondo de premios del torneo.[/p][p]The International se retransmite en cuatro idiomas, y ni siquiera eso es suficiente para llegar a todos los jugadores de Dota. Fans de todo el mundo se reúnen para apoyar a sus comunidades locales en [i]su[/i] idioma y, por esa razón, hemos añadido por primera vez lotes de apoyo a las retransmisiones para algunas de las comunidades más importantes. Este año, hemos elegido las retransmisiones de algunas de las comunidades con mayor número de espectadores, como la comunidad brasileña, la filipina o la ucraniana. Al igual que con los lotes de talentos individuales, el 50 % de todas las ventas se destina al grupo en cuestión y el 30 %, al fondo de premios del torneo.[/p][p]Puedes explorar todos los lotes de equipos y talentos desde el menú principal. Esta es tu oportunidad para encontrar a tu jugador favorito, al comentarista favorito, tu comunidad favorita o la línea de voz que más te guste.[/p][p][/p][h3]Partidas y recompensas[/h3][p]Ya basta de hablar de los profesionales: hablemos de ti.[/p][p]Millones de fans asisten a The International con opiniones —digamos— muy firmes. ¿Qué región es más fuerte? ¿Cuál es la verdadera razón por la que los jugadores profesionales siguen eligiendo a ese héroe con un porcentaje de victorias del 16 %? ¿Se ha mejorado lo suficiente a Earthshaker?[/p][p]Lo único mejor que tener la razón es poder demostrarles a todos los que estaban equivocados que siempre has tenido la razón. Teniendo eso en cuenta, hemos recopilado las características más populares del Compendio de The International de los últimos años y las vamos a poner a disposición de todos los jugadores de Dota de forma gratuita. La Liga Fantasía y las predicciones ya están disponibles, e incluyen tablas de clasificación para que puedas compararte con tus amigos, o con toda la comunidad de Dota. [/p][p]Pero, como ya sabes, las tablas de clasificación son temporales y seguramente te gustaría tener la razón para siempre. Lo vamos a tener en cuenta. Por eso, este año presentamos las Galas Tirias, una colección de artículos inmortales adaptados al diseño de The International de este año. Estos artículos no están a la venta, sino que se asocian como recompensa exclusiva a las cuentas de los mánagers de la Liga Fantasía y de quienes realicen las mejores predicciones. Si los quieres, la única forma de conseguirlos es la victoria.[/p][p]Para una competición justa, también hemos bloqueado a más de 75 000 traficantes de victorias, involucrados en smurfing y otros tramposos. Dota es un juego que, a cualquier nivel, se disfruta más si se está en igualdad de condiciones.[/p][p][/p][h3]En resumen[/h3][p]Solo quedan unas semanas para The International. Tanto si estás aquí para animar a tus equipos favoritos como para demostrar tus habilidades contra los millones de fans del público o simplemente para ver cómo se definen las partidas, nos alegramos de contar contigo. Nos vemos cuando empiece el torneo.[/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}