{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "The International: Πακέτα και προβλέψεις",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International: Πακέτα και προβλέψεις",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]The International – Πακέτα ομάδων και ταλέντων[/h3][p]Το The International πλησιάζει: Και οι 16 ομάδες είναι έτοιμες να ταξιδέψουν στη Γερμανία και εμείς μόλις ανακοινώσαμε ολόκληρο το ρόστερ ταλέντων εντός παιχνιδιού. Όπως και το ίδιο το Dota, το The International είναι παγκόσμια υπόθεση, με τα μέλη των ομάδων να προέρχονται από περισσότερες από 30 χώρες και τα ταλέντα να εκπροσωπούν ακόμη περισσότερες.[/p][p]Σε αναγνώριση αυτών των παικτών και προσωπικοτήτων, φέτος συνεχίζουμε την παράδοση του The International όπου προσφέρουμε πακέτα υποστηρικτών ομάδων και ταλέντων εντός παιχνιδιού. Κάθε πακέτο διαθέτει περιεχόμενο που έχει δημιουργηθεί από την εν λόγω ομάδα ή ταλέντο και περιλαμβάνει εικόνες φόρτωσης, αυτοκόλλητα, φωνητικές ατάκες και πολλά άλλα. Το 50% κάθε πώλησης πηγαίνει απευθείας στην ομάδα ή το ταλέντο και, φέτος, ένα επιπλέον 30% από κάθε πώληση πακέτου υποστηρικτών θα πάει στο χρηματικό έπαθλο για το τουρνουά.[/p][p]Το The International έχει μεταδόσεις σε τέσσερις επίσημες γλώσσες, αλλά ακόμα και αυτό δεν είναι αρκετό για να καλύψει τους απανταχού παίκτες του Dota. Σε ολόκληρο τον κόσμο, οι φαν μαζεύονται για να υποστηρίξουν τις κοινότητες της περιοχής τους στη [i]δική τους[/i] γλώσσα και, έτσι, για πρώτη φορά, προσθέσαμε επίσης πακέτα υποστηρικτών για κάποιες από τις μεγαλύτερες μεταδόσεις κοινοτήτων. Επιλέξαμε κάποιες από τις μεταδόσεις κοινοτήτων με το μεγαλύτερο κοινό φέτος, μεταξύ των οποίων τα πορτογαλικά Βραζιλίας, τα φιλιππινέζικα και τα ουκρανικά. (Όπως και με τα πακέτα κάθε ταλέντου, το 50% πηγαίνει στην εν λόγω ομάδα και ένα επιπλέον 30% στο χρηματικό έπαθλο.)[/p][p]Μπορείτε να δείτε όλα τα πακέτα ομάδων και ταλέντων από το κύριο μενού. Είτε έχετε κάποιον αγαπημένο παίκτη, αγαπημένο εκφωνητή, αγαπημένη κοινότητα ή απλά ψάχνετε την καλύτερη φωνητική ατάκα, αυτή είναι η ευκαιρία σας.[/p][p][/p][h3]Αγώνες και ανταμοιβές[/h3][p]Αρκετά με τους επαγγελματίες, ας μιλήσουμε για εσάς.[/p][p]Εκατομμύρια φαν πηγαίνουν στο The International με, ας πούμε, έντονες απόψεις. Ποια περιοχή είναι η πιο ισχυρή; Ποιος είναι ο πραγματικός λόγος για τον οποίον οι επαγγελματίες επιμένουν να επιλέγουν εκείνον τον ήρωα που έχει ποσοστό νίκης 16%; Ενισχύθηκε αρκετά ο Earthshaker στην τελευταία ενημέρωση;[/p][p]Το μόνο καλύτερο από το να έχει κανείς δίκιο, είναι να μπορεί να δείξει σε όλους όσους είχαν άδικο πόσο δίκιο είχε εξαρχής. Με αυτό υπόψη, πήραμε τα πιο δημοφιλή χαρακτηριστικά των τελευταίων χρόνων από το Compendium του The International και τα κάνουμε διαθέσιμα σε κάθε παίκτη Dota δωρεάν: το Εικονικό Πρωτάθλημα και οι Προβλέψεις είναι τώρα διαθέσιμα και περιλαμβάνουν πίνακες κατάταξης, για να συγκριθείτε με τους φίλους σας και ολόκληρη την κοινότητα του Dota. [/p][p]«Αλλά», θα πείτε, «αυτοί οι πίνακες κατάταξης είναι προσωρινοί και το δίκιο μου πρέπει να διαρκέσει για πάντα». Καταλαβαίνουμε. Γι' αυτό, φέτος, εισάγουμε το Tyrian Regalia, μια συλλογή αντικειμένων Immortal που επανασχεδιάστηκαν για να ταιριάζουν με το χρώμα του φετινού The International. Δεν είναι προς πώληση: Αυτά τα κλειδωμένα αντικείμενα προορίζονται αποκλειστικά ως ανταμοιβές για τους κορυφαίους στις Προβλέψεις και στο Εικονικό Πρωτάθλημα. Εάν τα θέλετε, ο μόνος δρόμος είναι η νίκη.[/p][p]Στο πνεύμα του δίκαιου ανταγωνισμού, αποκλείσαμε επίσης πάνω από 75.000 χρήστες που αντάλλαζαν νίκες, έκαναν σμέρφινγκ και επεδείκνυαν κακόβουλη συμπεριφορά. Σε όλα τα επίπεδα αγώνων, το Dota είναι πολύ καλύτερο όταν παίζεται επί ίσοις όροις.[/p][p][/p][h3]Εν κατακλείδι[/h3][p]Το The International απέχει μόλις μερικές εβδομάδες. Είτε υποστηρίζετε τις αγαπημένες σας ομάδες είτε δοκιμάζετε τις ικανότητές σας ενάντια στους εκατομμύρια άλλους φαν που βρίσκονται στο κοινό είτε απλά παρακολουθείτε την εξέλιξη των αγώνων, χαιρόμαστε πολύ που είστε εδώ. Θα σας δούμε όταν αρχίσουν οι αγώνες.[/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}