{
  "gid": "536608520511946809",
  "clan_steamid": "103582791433224455",
  "event_name": "Bundles et pronostics pour The International",
  "event_type": 13,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1755645060,
  "rtime32_end_time": 1755649801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1753314138
      },
      {
        "strSteamID": "76561199116514547",
        "rtUpdated": 1753304056
      },
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1755645077
      },
      {
        "strSteamID": "76561197978027217",
        "rtUpdated": 1755220859
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1755298045
      }
    ]
  },
  "announcement_body": {
    "gid": "536608520511946810",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Bundles et pronostics pour The International",
    "posttime": 1755645078,
    "updatetime": 1755645078,
    "body": [
      "[h3][img src=\"{STEAM_CLAN_IMAGE}/3703047/dbb7bac9ad68bb5a060869e3b815782d5d2fdc1e.jpg\"][/img][/h3][p][/p][h3]The International : bundles des équipes et des personnalités[/h3][p]The International approche ! Les seize équipes s'apprêtent à se rendre en Allemagne, et nous venons d'annoncer en jeu le tableau intégral des talents de l'évènement. Comme Dota, The International a une dimension planétaire : ses équipes réunissent des membres originaires de plus de trente pays, et la scène accueille des talents d'horizons encore plus divers.[/p][p]En hommage à ces équipes et à ces personnalités, nous poursuivons cette année la tradition de The International en proposant en jeu des bundles des équipes et des personnalités aux fans. Chaque bundle contient du contenu créé par l'équipe ou la personnalité en question : écrans de chargement, autocollants, répliques, et plus encore. La moitié de chaque vente de bundle sera versée directement à l'équipe ou à la personnalité en question, et cette année 30 % du montant des ventes de bundle intègrera la cagnotte du tournoi.[/p][p]The International propose des diffusions dans quatre langues officielles, mais cela reste insuffisant pour inclure la communauté Dota mondiale. Dans le monde entier, les fans se rassemblent pour soutenir leur communauté Dota locale dans [i]leur propre[/i] langue. Pour la première fois, nous avons ajouté des bundles de fan pour certaines des diffusions de communauté les plus importantes. Nous avons sélectionné quelques-unes des diffusions de communauté les plus regardées cette année, notamment en portugais brésilien, en philippin et en ukrainien. (Tout comme pour les bundles de personnalité, 50 % des ventes sont reversées à l'équipe en question et 30 % supplémentaires à la cagnotte.)[/p][p]Vous pouvez parcourir tous les bundles d'équipe et de personnalité depuis le menu principal. Que vous ayez un joueur ou joueuse préférée, un canal de diffusion préféré, une communauté préférée, ou que vous cherchiez simplement une réplique du tonnerre, c'est la bonne occasion.[/p][p][/p][h3]Jeux et récompenses[/h3][p]Les pros, c'est bien, mais parlons plutôt de vous.[/p][p]Des millions de fans abordent The International avec, disons, des opinions bien arrêtées. Quelle région vaincra ? Pourquoi, dans le fond, les pros continuent de choisir cette unité héroïque avec un taux de victoire de 16 % ? Le bonus accordé à Earthshaker était-il suffisant ?[/p][p]Avoir la certitude d'avoir raison est une chose, mais pouvoir montrer à tous ceux qui étaient dans l'erreur que vous aviez raison depuis le début, c'en est une autre. Dans cette optique, nous avons pris les fonctionnalités les plus populaires du Compendium de The International des dernières années et les avons mises gratuitement à la disposition de toute la communauté Dota : les ligues fantasy et les pronostics sont disponibles dès maintenant, et ils comprennent aussi les classements pour que vous puissiez vous comparer à vos contacts et à toute la communauté Dota. [/p][p]Pourtant, me direz-vous, ces classements sont temporaires et votre légitimité doit durer éternellement. Soit. C'est pourquoi cette année, nous présentons également les insignes Tyrians, une collection d'objets immortels relookés aux couleurs de l'évènement The International de cette année. Ils ne sont pas à vendre : ces objets exclusifs sont restreints aux comptes gérant des ligues fantasy hors du commun ou faisant des pronostics de haut niveau. S'ils vous font envie, il n'existe qu'un moyen de les obtenir : remporter la victoire.[/p][p]Dans un esprit de compétition équitable, nous avons également banni plus de 75 000 comptes qui s'adonnent au win trading, le smurfing et autres activités malveillantes. À tout niveau, Dota est un jeu qui se savoure mieux dans des conditions équitables.[/p][p][/p][h3]En conclusion[/h3][p]The International aura lieu dans quelques semaines seulement. Que vous soyez là pour encourager vos équipes préférées, pour affronter les millions d'autres fans dans la compétition ou pour suivre le déroulement des matchs, nous sommes ravis de vous accueillir. À très bientôt ![/p][p][/p]"
    ],
    "commentcount": 437,
    "tags": [
      "mod_reviewed",
      "ModAct_1426387032_1755645556_0"
    ],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "598535552010030355",
    "event_gid": "536608520511946809",
    "voteupcount": 5736,
    "votedowncount": 944,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 1,
  "ignore_count": 0,
  "forum_topic_id": "598535552010030355",
  "rtime32_last_modified": 1756105448,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1755645556,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 19660709,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 5736,
  "votes_down": 944,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598535552010030355",
  "clan_steamid_original": "103582791433224455"
}