{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "สอดส่องลอดเลน: เล่นดีไม่มี DoS",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "สอดส่องลอดเลน: เล่นดีไม่มี DoS",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]ยินดีต้อนรับกลับสู่บล็อก “สอดส่องลอดเลน” ซึ่งจะให้สมาชิกทีมพัฒนาของเรามาเล่าเรื่องราวอุปสรรค การแก้ไขข้อบกพร่อง และเรื่องค้นพบโดยบังเอิญสนุก ๆ บางครั้งที่พบขณะเราพัฒนาเกมที่ไม่เหมือนใครอย่าง Dota[/i]",
      "นี่คือเรื่องราวเกี่ยวกับอินเทอร์เน็ต และเหตุที่อินเทอร์เน็ตไม่ทำงานได้ตามที่ควร รวมถึงตอนที่อินเทอร์เน็ตทำงานได้ ยกเว้นบางทีที่ใช้งานไม่ได้ ซึ่งเป็นเรื่องราวเกี่ยวกับเหตุที่อินเทอร์เน็ตหยุดทำงานสำหรับลูกค้าของเรา และวิธีที่เราลงมือแก้ไขปัญหานี้",
      "อินเทอร์เน็ตเป็นพรมแดนที่ค่อนข้างป่าเถื่อนมากกว่าที่เราเชื่อกันทั่วไป หากคุณลองก้าวออกจากขอบเขตปลอดภัยที่มีการยืนยันตัวตนแบบสองปัจจัยและคุกกี้ที่เชื่อถือได้ของคุณแล้ว อาจพบได้ว่าอินเทอร์เน็ตอันกว้างใหญ่นั้นเป็นดั่งดินแดนป่าเถื่อนที่เต็มไปด้วยชาวเกรียนมากมายที่มาพร้อมกับความชั่วร้าย ซึ่งก็เปี่ยมไปด้วยความสามารถที่จะทำให้ชีวิตของคุณน่าสังเวชเลยทีเดียว ด้วยเหตุเพียงแค่เพราะอยากเกรียน",
      "ย้อนกลับไปในปี 2014 วิธีที่ชาวเกรียนเหล่านั้นใช้เป็นหลักก็คือการโจมตีโดยปฏิเสธการให้บริการแบบกระจาย (DDoS) ซึ่งคำว่า “แบบกระจาย” หมายถึงโฮสต์อินเทอร์เน็ตจำนวนมหาศาลจะรับส่งข้อมูลมากมายไปยัง IP เป้าหมายอย่างประสงค์ร้ายเพื่อทำให้สแต็กเครือข่ายรับมือไม่ไหว โดยเรียกว่าเป็นการโจมตีด้วยปริมาณ และไม่ได้มีเจตนาพยายามเข้าไปในเครือข่าย เพียงแต่พยายามทำให้บริการไม่สามารถใช้งานได้ หรือถ้าเรียกแบบทางการก็คือ “ปฏิเสธการให้บริการ” ซึ่งการปฏิเสธการให้บริการแบบกระจายนี้จะส่งผลให้ผู้คนจริงที่ต้องการใช้บริการจริง ๆ โดนเบียดเสียดโดยการรับส่งข้อมูลหนาแน่น",
      "ปัญหาของการโจมตี DDoS ก็คือในช่วงปลายปี 2014 การโจมตีเหล่านี้ไม่ได้กระทำโดยแฮกเกอร์อาชญากรระดับโลกที่ต้องมีวุฒิการศึกษาด้านวิทยาการคอมพิวเตอร์ขั้นสูง แต่ใครก็ตามที่สามารถทำได้โดยการจ่ายค่าบริการหรือบอทเพื่อทำการโจมตี และเหตุผลที่คนจะอยากทำการโจมตีนี้ก็เดาได้ไม่ยาก แม้บางคนอยากทำเพื่อเกรียนขำ ๆ แต่ก็มีคนที่มีแรงจูงใจชัดเจน: การโจมตี DDoS เป็นวิธีหยุดการแข่งขันที่คุณหรือคนที่คุณเชียร์กำลังแพ้อยู่ได้อย่างแน่นอน ทำให้การโจมตีนี้ไม่ได้เป็นเหตุป่วนเป็นครั้งคราวอีกต่อไป แต่กลายเป็นการจู่โจมแบบชัดเจนต่อเกมที่ผู้เล่นแข่งขัน",
      "ในช่วงเดือนแรก ๆ ของปี 2015 เราพบว่าการโจมตี DDoS ต่อ Dota และ CS:GO มีจำนวนเพิ่มขึ้นอย่างมาก โดยบริษัทอื่น ๆ ก็รายงานว่ามีการโจมตีเพิ่มขึ้นอย่างมากเช่นกัน อยู่ดี ๆ ก็มีคนที่ทำให้ใครก็ได้สามารถทำการโจมตีนี้ง่ายอย่างมาก",
      "ในเดือนสิงหาคมปี 2015 การแข่งขัน The International ต้องหยุดชะงักด้วยการโจมตี DDoS แม้ว่าผู้เล่นมืออาชีพที่แข่งขันในแมตช์จะไม่ได้รับผลกระทบ แต่ทีมถ่ายทอดสดไม่สามารถเข้าร่วมแมตช์เพื่อพากย์หรือวิเคราะห์เกมได้เป็นเวลานานกว่า 2 ชั่วโมง ก่อให้เกิดปัญหาเมื่อส่งสตรีมออกไปสำหรับออกอากาศทางโทรทัศน์ อยู่ดี ๆ ผู้เล่นก็แข่งขันเหมือนอยู่ในความว่างเปล่า นี่เป็นการแข่งขันเกมระดับมืออาชีพที่มีผู้ชมหลายล้านคนและมีเงินเดิมพันหลายล้านดอลลาร์สหรัฐ และถูกขัดจังหวะโดยใครก็ไม่รู้ที่มีโปรแกรมราคา 5 ดอลลาร์ ซึ่งเป็นปัญหาที่ Valve ไม่สามารถเพิกเฉยได้",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "เราลองใช้วิธีแก้ปัญหาหลายรูปแบบเพื่อจัดการกับการโจมตี DDoS ก่อนที่จะลงเอยกับวิธีแก้ไขปัญหาที่ได้ผล ในตอนแรก เราพยายามกรองการรับส่งข้อมูลด้วยสวิตช์เครือข่ายที่มีประสิทธิภาพ แต่ก็น่าเสียดายที่การกรองประเภทนี้นำมาปรับใช้กับการรับส่งข้อมูลเกมได้ยาก เซิร์ฟเวอร์เกมปกติแล้วจะได้รับข้อมูล UDP (User Datagram Protocol) ที่ไม่ได้ร้องขอจากที่อยู่ IP แปลกปลอม ลองนึกภาพว่าคุณมีที่ทำการไปรษณีย์ซึ่งกรองจดหมายขยะที่คุณไม่ต้องการออกให้ แล้วคราวนี้ลองนึกว่าอาชีพของคุณคือนักเขียนคอลัมน์ถามตอบ และคุณได้รับจดหมายที่ถูกต้องจริง ๆ อย่างมหาศาลจากคนแปลกหน้าต่าง ๆ ตลอดเวลา ที่ทำการไปรษณีย์ไม่รู้ว่าอะไรคือจดหมายขยะสำหรับคุณ และอะไรไม่ใช่ นั่นแหละคือลักษณะของข้อมูลรับส่งที่เซิร์ฟเวอร์เกมต้องรับมือ นอกจากนี้ IP ต้นทางในแพ็กเก็ต UDP ก็ไม่ได้รับการรักษาความปลอดภัยและสามารถปลอมแปลงได้ง่าย ที่ทำการไปรษณีย์ของเราไม่สามารถดูได้แม้แต่ที่อยู่ผู้ส่งบนซองจดหมายสำหรับเป็นข้อมูลช่วยตัดสินใจ เพราะว่าคนส่งจดหมายขยะปลอมแปลงข้อมูลนี้ได้",
      "ปกติแล้ว Steam ต้องจัดส่งเนื้อหาเกมในปริมาณมาก และได้สร้างเครือข่ายขนาดใหญ่สำหรับส่งข้อมูลดังกล่าว  เราได้ใช้ประโยชน์จากเครือข่ายนี้อยู่แล้วเพื่อรับส่งข้อมูลเกมผ่านลิงก์เฉพาะ ใช้การเชื่อมต่อแบบเพียร์ที่ดี ทำให้มั่นใจว่ามีการใช้แนวทางปฏิบัติด้านวิศวกรรมเครือข่ายที่ดีที่สุด ฯลฯ ซึ่งช่วยให้ค่าปิงของผู้เล่นต่ำลง แต่ไม่ได้ป้องกันการโจมตี DDoS ปัญหาคือโปรโตคอล UDP นั้นไม่ปลอดภัย ดังนั้นแม้ว่าเรามีเครือข่ายของตัวเอง แต่มันก็ไม่เป็นส่วนตัว",
      "ในการป้องกันไม่ให้ผู้โจมตีใช้เครือข่ายของเราเองเพื่อโจมตีเซิร์ฟเวอร์ของเรา เราจำเป็นต้องควบคุมและรักษาความปลอดภัยให้ทางเข้าทุกทาง เราดำเนินการดังกล่าวโดยสร้างพร็อกซีสำหรับการรับส่งข้อมูลเกม เพื่อนำส่งแพ็กเก็ตข้อมูลทุกหน่วยไปทั่วเครือข่ายผ่านทางรีเลย์ ตอนนี้เมื่อไคลเอนต์ต้องการสื่อสารกับเซิร์ฟเวอร์เกม ก็จะต้องดำเนินการผ่านรีเลย์ที่ทำหน้าที่ทั้งรับรองความถูกต้องและเป็นพร็อกซีในการรับส่งข้อมูลนั้นไปยังเซิร์ฟเวอร์เกม ซึ่งหมายความว่าจะมีการซ่อนที่อยู่ IP ของเซิร์ฟเวอร์ไว้เสมอ ดังนั้นผู้โจมตีก็ไม่ทราบว่าจะโจมตีที่ไหนแน่",
      "หากใช้ที่ทำการไปรษณีย์แบบดั้งเดิมเป็นตัวอย่างในการเปรียบเทียบ ก็เหมือนนักส่งสแปมไม่มีที่อยู่ให้ใช้เพื่อส่งจดหมายขยะอีกต่อไป นักส่งสแปมอาจส่งจดหมายไปยังที่ทำการไปรษณีย์ทุกแห่งในพื้นที่และขอให้ส่งต่อให้ แต่หากไม่ได้รับการอนุญาต ที่ทำการไปรษณีย์ก็จะไม่ส่งให้ (ยิ่งไปกว่านั้น ที่ทำการไปรษณีย์ก็คงสงสัยว่าทำไมถึงมีคนพยายามส่งจดหมาย 100,000 ฉบับให้คนคนเดียว)",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "แต่คนพวกนี้จะโจมตีรีเลย์เลยไม่ได้หรือ? ในทางเทคนิคแล้ว สามารถทำได้ แต่เรามีรีเลย์จำนวนไม่จำกัด และสร้างขึ้นมาเพื่อให้ถูกโจมตีโดยเฉพาะ \"รีเลย์\" เป็นเพียงคำอีกคำหนึ่งสำหรับคอมพิวเตอร์ที่ใช้งานซอฟต์แวร์ คุณสามารถโจมตีหรือทำให้ออฟไลน์ได้ แต่เราออกแบบมาตรการขึ้นมาโดยคำนึงถึงสมมติฐานดังกล่าวอยู่แล้ว หากลูกค้าพยายามเล่นเกมและขาดการติดต่อกับรีเลย์หนึ่ง ก็จะแค่เปลี่ยนไปใช้รีเลย์อื่น รีเลย์เป็นเหมือนเป้าหลายร้อยตัวที่กระจัดกระจายไปทั่วโลกโดยมีจุดประสงค์เดียวคือการปกป้องเซิร์ฟเวอร์เกม (ที่จริงการกำจัดรีเลย์นั้นยากกว่าที่คิด เพราะได้รับการออกแบบมาเป็นอย่างดี และจัดวางไว้ในส่วนที่เฉพาะเจาะจงของเครือข่าย ดังนั้นแม้ว่าจะสร้างขึ้นมาเพื่อให้ทำให้ออฟไลน์ แต่เราก็ยังไม่เคยสูญเสียรีเลย์ใด ๆ ไปเลย)",
      "วิธีแก้ไขนั้นเรียบง่ายแต่ใช้ได้ผล ก่อนหน้านี้หากมีใครต้องการขัดจังหวะเกม ก็แค่ต้องใช้งานจนเซิร์ฟเวอร์เกมเกมเดียวรับมือไม่ไหว (ซึ่งทำได้ไม่ยากเลย) แต่ตอนนี้เรียกได้ว่าจะต้องใช้งานหนักทั้งศูนย์ข้อมูล ซึ่งทำได้ยากกว่ามาก แต่มีการโจมตีทั้งศูนย์ข้อมูลนี้ให้สามารถสำเร็จได้หรือไม่? มีแน่นอน มีการโจมตีที่สามารถทำให้สำเร็จโดยใครก็ตามออนไลน์ที่สามารถซื้อได้ด้วยราคา 5 ดอลลาร์หรือไม่? ไม่มี คนส่วนใหญ่ไม่มีเงินพอที่จะสามารถซื้อการโจมตีที่ซับซ้อนระดับนี้ได้",
      "เมื่อจัดทำระบบใหม่นี้ขึ้นมาและเปิดใช้งาน เราก็เกิดไอเดียบรรเจิดขึ้นมาว่า: หากเราควบคุมเครือข่ายส่วนตัวของเราเอง เราก็ไม่ต้องสนใจใยดีว่าอินเทอร์เน็ตจะทำงานเป็นปกติหรือเปล่า เราสามารถใช้ระบบนี้เพื่อช่วยให้ลูกค้าได้รับประสบการณ์การเล่นที่ดียิ่งขึ้นไปอีก หากใช้อินเทอร์เน็ตปกติ เมื่อคุณส่งแพ็กเก็ตจากที่อยู่ IP หนึ่งไปยังอีกที่อยู่หนึ่ง เส้นทางที่คุณใช้จะถูกกำหนดโดยโปรโตคอลเกตเวย์ภายนอก (Border Gateway Protocol หรือ BGP) ซึ่งเป็นอัลกอริธึมกำหนดเส้นทางที่จะตัดสินใจว่า แพ็กเก็ตของคุณจะเดินทางข้ามเครือข่ายอย่างไร โดยที่คุณไม่มีทางเลือกเส้นทางที่อัลกอริธึมจะเลือก",
      "แต่ด้วยเครือข่ายส่วนตัวเสมือนที่ประกอบด้วยรีเลย์และศูนย์ข้อมูลทั่วโลกหลายร้อยแห่ง เราจึงสามารถเลือกเส้นทางของเราเองจากไคลเอนต์ไปยังเซิร์ฟเวอร์เกมได้ ซึ่งมักจะเป็นทางลัดที่เร็วกว่าเส้นทางเริ่มต้น หากคุณใช้ Steam Datagram Relay (SDR) โอเวอร์เลย์ Steam จะแสดงเวลาปิงของคุณและเส้นทางที่เรามอบให้คุณ เพื่อให้คุณดูได้ด้วยตัวเองว่ามีการเพิ่มประสิทธิภาพอย่างไร",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "คุณสมบัติที่เริ่มต้นในรูปวิธีที่ปกป้องเซิร์ฟเวอร์เกม Dota นั้นได้พัฒนาไปเกินกว่าที่ใคร ๆ อาจคาดหวังไว้ เครือข่าย SDR นำส่งแพ็กเก็ตได้มากถึง 140M และ 550GBit ต่อวินาทีเป็นประจำ เรามีรีเลย์ในศูนย์ข้อมูล 31 แห่งที่มีขีดความสามารถมากกว่า 5TBit สิ่งที่เราเรียกว่า Steam Datagram Relay ในตอนนี้ไม่เพียงแค่ป้องกันการโจมตีแบบ DDoS เท่านั้น แต่ยังเพิ่มการเชื่อมต่อและลดค่าปิงให้กับลูกค้า Dota ทุกคนด้วย รีเลย์ดังกล่าวไม่เพียงแค่ทำหน้าที่เพื่อ Dota เท่านั้น แต่ยังทำเพื่อเกมทุกเกมบน Steam ที่ต้องการใช้ประโยชน์จากรีเลย์ดังกล่าวอีกด้วย",
      "เราหวังว่าคุณจะสนุกกับการสอดส่องลอดเลนของ Dota อีกครั้งนะ คราวนี้ค่อนข้างหนักไปทางเทคนิค จึงขอขอบคุณที่ทนอ่านจนจบ! และโปรดอย่าลังเลที่จะแจ้งให้เราทราบว่าคุณต้องการให้เรานำเสนอเรื่องอะไรต่อไป"
    ],
    "commentcount": 278,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 9,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 5433,
    "votedowncount": 295,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1710287207,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 5433,
  "votes_down": 295,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}