{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "開発こぼれ話：サービス拒否攻撃は受け付けません",
  "event_type": 28,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "開発こぼれ話：サービス拒否攻撃は受け付けません",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]ブログ連載「開発こぼれ話」へようこそ。この連載では、Dotaチームがこのユニークなゲームの開発中に遭遇した課題、バグ修正、偶然起こったうれしい出来事などを紹介していきます。[/i]",
      "今回紹介するのは、インターネットというのは思いどおりにいくこともあれば、思いどおりにいかないこともあるというお話です。 Dotaプレイヤーがインターネットにアクセスできなくなった経緯と、それを私たちがどのように修正したかについて紹介します。",
      "インターネットというのは、私たちが思っている以上に荒涼とした未開の領域です。 2要素認証と信頼できるCookieの安全圏の外には、荒野が広がっているように思えるかもしれません。そこには悪意のある攻撃者による、でたらめな荒らし行為が蔓延しており、特に理由もなく、単にそうしたいからというだけであなたの人生をかなり悲惨なものにする可能性があります。",
      "2014年に、荒らしに使用されていた手法は分散型サービス拒否（DDoS）攻撃でした。 「分散型」とは、多数のインターネットホストが、ネットワークスタックに負荷をかけようとして、特定のターゲットIPに悪意を持ってトラフィックを一斉に送り込むことを指します。 これはボリューム攻撃と呼ばれ、その目的はネットワークへの侵入ではありません。 単にサービスを妨害しようとしているだけです。 分散型サービス拒否攻撃とは、正規のサービスを求める正当なユーザーが悪質なトラフィックによって締め出されることを意味します。",
      "DDoS攻撃に関して特徴的だったのは、2014年後半まで、高度なコンピューターサイエンスの学位を持つスーパーハッカーによるデータ窃盗がなかったことです。 DDoS攻撃は、単にそれをしたい人がサービスやボットにお金を払うことで実行されていました。 そして、その理由は明らかでした。 純粋に荒らしを楽しむためだけに行為に及ぶ人もいましたが、一方で、自分または自分が応援する誰かが負けているマッチを強制終了させる確実な方法としてDDoS攻撃が使われていたのです。 これはもはや、時折見られる問題ではなくなりました。 プレイヤーが競い合うあらゆるゲームにおいて、あからさまな攻撃になりつつありました。",
      "2015年初めの数か月までに、DotaとCS:GOに対するDDoS攻撃の大幅な増加が見られ、他の企業も同様の報告をしています。 誰かの手によって、突然こうした攻撃が誰でも簡単にできるようになったのです。",
      "2015年8月、The InternationalがDDoS攻撃によって妨害されました。 試合に出場していたプロ選手への影響はありませんでしたが、2時間以上にわたり、実況者がマッチにアクセスできず、実況や解説が不可能となりました。 ストリーミングをテレビ放送として送信することが問題になりました。 選手たちは突如、遮断された環境でプレイすることになったのです。 何百万人もの人が観戦する、何百万ドルの賞金が懸かったプロのゲームイベントが、5ドルのソフトウェアを使うどこかの誰かによって妨害されたのです。 これは弊社が無視できない問題でした。",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "DDoS攻撃への効果的な対処方法を見つけだすまでに、いくつかの方法を試しました。 まず、強力なネットワークスイッチでトラフィックのフィルタリングを試みました。 残念ながら、ゲームトラフィックに対してこのタイプのフィルタリングを行うには本質的な困難が伴います。 ゲームサーバーはその性質上、一方的に送信されるUDP（ユーザーデータグラムプロトコル）トラフィックを任意のIPアドレスから受信します。 例えば、不要な郵便物を取り除いてくれる郵便局があると想像してみてください。 そして、あなたの仕事が人生相談コラムニストであり、見知らぬ人から相談の手紙が常に大量に届くと仮定してみてください。 その場合、郵便局ではどれがあなたにとって迷惑な郵便物なのかを見分けることができません。 ゲームサーバーへのトラフィックはこの状況に似ています。 さらに、UDPパケットのソースIPは保護されていないため、簡単にスプーフィングに利用される可能性があります。 迷惑な郵便物の送信者は住所を偽造するため、郵便局は封筒の差出人住所を手がかりにすることさえできないのです。",
      "Steamはゲームコンテンツの多くを配信しており、そのための大規模なネットワークを構築しています。  すでにこのネットワークを利用して、専用リンク経由でゲームトラフィックを処理し、良好なピアリング接続を取得し、ネットワークエンジニアリングのベストプラクティスを確実に活用するようにしてきました。 これにより、プレイヤーのping時間を低く抑えられましたが、DDoS攻撃を防ぐことはできませんでした。 問題は、UDPプロトコルが安全ではないことです。そのため、私たちは独自のネットワークを持っていましたが、プライベートではありませんでした。",
      "攻撃者が私たちのネットワークを使用して私たちのサーバーを攻撃するのを防ぐには、すべての入り口を制御し、セキュリティで保護する必要がありました。 これを実現するために、ゲームトラフィック用のプロキシを作成し、ネットワークを介して送信されるすべてのデータパケットをリレー経由でルーティングしました。 そのため、クライアントがゲームサーバーと通信する際に、それを認証し、プロキシ経由でゲームサーバーにトラフィックを送信するリレーを介して通信する必要がありました。 これは、サーバーのIPアドレスが常に隠蔽されていることを意味し、攻撃者はどこを攻撃すればよいのかまったくわかりませんでした。",
      "先ほどの郵便局のたとえで言うと、スパム送信者が迷惑な郵便物を送るための住所がなくなりました。 スパム送信者は地域内のすべての郵便局に送り付け、配達を依頼することはできますが、許可がなければ郵便局は配達してくれません。 （さらに、誰かが1つの宛先に10万通もの手紙を送ろうとしていれば、郵便局は少し不審に思うでしょう。）",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "でも、リレーを攻撃することはできなかったのでしょうか？ 厳密には可能でした。 しかし、基本的にリレーは数限りなくあり、これらは攻撃を受けることを前提に構築しました。 「リレー」とは、ソフトウェアを実行しているコンピューターを意味する別名に過ぎません。 攻撃することもオフラインにすることもできますが、プロトコルはそれを前提に設計されています。 クライアントがゲームをプレイしようする際にリレーとの通信が途絶えたら、別のリレーに切り替わるだけです。 リレーは、ゲームサーバーを守るという一つの目的を持って世界中に散在する何百ものゲームの駒のようなものです。 （ちなみに、リレーを妨害するのは意外と大変です。 リレーは非常にうまく設計されており、ネットワークの特定の部分に配置されているため、オフラインにできるように構築されているものの、弊社でリレーを失ったことは一度もありません。）",
      "解決策は単純なものの効果的でした。 以前は、誰かがゲームを妨害したい場合、1つのゲームサーバーを圧倒するだけで済みました（簡単に妨害できました）。 しかし現在は、データセンター全体を圧倒する必要があり、ハードルがはるかに高くなりました。 それでもこのような妨害を実現できる攻撃があるかというと、 もちろんあります。 では、誰もがオンラインで5ドルでできる攻撃はあるでしょうか？ いいえ、ありません。 これほど洗練された攻撃は、多くの人が安価に行えるものではありませんでした。",
      "この新しいシステムが稼働し始めたときに、私たちは、こうひらめきました。「独自のプライベートネットワークを管理すれば、通常のインターネットの仕組みに依存する必要はなくなる。 これを利用して、顧客体験をさらに向上することができるのではないか」と。 通常のインターネットでは、あるIPアドレスから別のIPアドレスにパケットを送信するとき、使用するルートはボーダーゲートウェイプロトコル（BGP）によって決定されます。 これは、パケットがネットワーク上をどのように移動するかを決定するルーティングアルゴリズムであり、ユーザーがルートを選択することはできません。",
      "しかし、何百ものグローバルリレーとデータセンターで構成される仮想プライベートネットワークでは、基本的にクライアントからゲームサーバーまでのルートを自分で選択することができます。多くの場合、デフォルトのルートよりも高速なショートカットになります。 Steamデータグラムリレー（SDR）を使用している場合は、Steamオーバレイにping時間と提供されているルートが表示されるため、どのように最適化されるかを確認することができます。",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Dotaのゲームサーバーを保護する方法として始まった機能は、誰もが予想していた以上のものになりました。 SDRネットワークが通常提供するデータ量は、毎秒最大140Mパケットおよび550ギガビットです。 弊社は、5TB以上の容量を持つ31のデータセンターにリレーを設置しています。 現在Steamデータグラムリレーと呼ばれているこのネットワークは、DDoS攻撃から保護するだけでなく、接続性を向上させ、すべてのDotaユーザーのpingを下げます。 そして、これはDotaだけでなく、このネットワークを活用したいSteam上のすべてのゲームに対して行われます。",
      "今回の「開発こぼれ話」を楽しんでいただけたでしょうか。 今回はかなり技術的な内容でした。最後まで読んでいただきありがとうございます！ 次に取り上げてほしい内容があれば、お気軽にご連絡ください。"
    ],
    "commentcount": 313,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 10,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 7705,
    "votedowncount": 475,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1715113657,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7705,
  "votes_down": 475,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}