{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Vonalak közt: Lenyomjuk a túlterheléses támadást",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Vonalak közt: Lenyomjuk a túlterheléses támadást",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Üdv ismét a „Vonalak közt” blogon, amelyben fejlesztőcsapatunk tagjai végigvezetnek néhány olyan kihíváson, hibajavításon és esetenkénti szerencsés véletlenen, amikkel egy olyan egyedi játék készítése közben találkozunk, mint a Dota.[/i]",
      "Ez egy történet az internetről, és arról, hogy nem úgy működik, ahogy kellene, amikor egyáltalán működik, kivéve, amikor nem működik. Ez egy történet arról, hogy az internet hogyan szűnt meg működni a vásárlóinknak, és hogyan javítottuk meg azt.",
      "Az internet sokkal inkább vad határvidék, mint amennyire gondoljuk róla. Elhagyva a kétlépcsős hitelesítés és megbízható sütik biztonságos menedékét, igazi kis vadont találsz odakint, tele trollokkal, akiknek megvan a rosszindulata, és egyre inkább a képessége is arra, hogy igencsak nyomorúságossá tegyék az életed pusztán azért, mert képesek rá.",
      "2014-ben az e trollok által használt módszer az elosztott túlterheléses támadás (DDoS) volt. Az „elosztott” a nagyszámú internetes számítógépre utal, amelyek rosszindulatúan forgalommal árasztanak el egy bizonyos cél IP-címet a hálózati verem túlterhelésére. Ezt mennyiségi támadásnak nevezik, és a célja nem a hálózatba bejutás. Csak megpróbálják gátolni a működését. A túlterhelés azt jelenti, hogy a rosszindulatú forgalom elnyomja azokat a szabályszerű felhasználókat, akik tényleg el akarják érni a szolgáltatást.",
      "A DDoS támadásokkal az volt a probléma, hogy 2014 végére már nem magas számítástechnikai végzettséggel rendelkező adatlopó szuperhackerek követték el őket. Nagyjából bárki el tudott követni ilyet, aki hajlandó volt megfizetni egy szolgáltatást vagy botot, hogy elvégezze neki. És elég nyilvánvaló, miért. Bár egyesek örömmel tették pusztán a vandalizmus okán, másoknak volt indítéka: egy DDoS támadás biztos módja volt egy olyan meccs leállításának, amelyben te, vagy valaki, akinek szurkoltál, vesztésre állt. Ez már nem csak alkalmankénti kellemetlenség volt. Kezdett kimondottan támadássá válni minden olyan játék ellen, amelyben versengtek.",
      "2015 első hónapjaira óriási növekedést tapasztaltunk a Dota és a CS:GO elleni DDoS támadásokban, és más cégek is óriási ugrást jeleztek. Valaki nagyon hirtelen nagyon megkönnyítette ezt bárkinek.",
      "2015 augusztusában a The Internationalt DDoS támadásokkal zavarták meg. Bár a meccsen játszó profikat ez nem érintette, a közvetítők több mint két órán keresztül nem tudtak bejutni a meccsekre az események mélyreható, lépésről lépésre közvetítéséhez. Problémássá vált a közvetítés televíziós adásként történő továbbítása. A játékosok hirtelen légüres térben játszottak. Ez egy hivatásos játékrendezvény volt, amit milliók néztek, és ahol több millió dollár volt a tét, és random alakok valami öt dolláros szoftverrel zavarták meg. Olyan probléma volt, amit a Valve nem hagyhatott figyelmen kívül.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Több megoldást próbáltunk ki a DDoS támadások kezelésére, mielőtt eljutottunk egyhez, amely működött. Kezdetben egy erős hálózati elosztóval próbáltuk szűrni a forgalmat. Sajnos az ilyen fajta szűrést játékforgalomnál eredendően nehéz elvégezni. A játékszerverek sajátossága, hogy tetszőleges IP-címekről fogadnak kéretlen UDP (User Datagram Protocol) forgalmat. Képzeld el, hogy van egy postahivatalod, ami kiszűri neked a kéretlen levélszemetet. És aztán képzeld el, hogy tanácsadó rovatvezető vagy, aki folyamatosan tonnaszám kapja a valódi leveleket véletlenszerű idegenektől. A postahivatal nem tudja, mi levélszemét és mi nem az. A játékszerverekre irányuló forgalom jobbára így szokott kinézni. Továbbá, az UDP csomagokban a forrás IP nincs védve, így könnyen hamisítható. A postahivatalunk még a borítékon lévő válaszcímet sem tudja megnézni nyomokat keresve, mert a levélszemét küldői meghamisítják azt.",
      "A Steam sok bitet szállít a játéktartalomhoz, és ehhez nagy hálózatot épített ki.  Már használtuk ezt a hálózatot játékforgalom továbbítására dedikált kapcsolatokon keresztül, jó pont pont közötti kapcsolat elérésére, a javasolt hálózatüzemeltetési módszerek használatának biztosítására stb. Ez alacsonyan tartotta a játékosok pingjeit, de nem védett a DDoS támadás ellen. A probléma az, hogy az UDP protokollok nem védettek, tehát bár volt saját hálózatunk, az nem volt privát.",
      "Hogy meggátoljuk a támadókat a saját hálózatunk használatában a saját szervereink támadására, ellenőriznünk és biztosítanunk kellett minden bejáratot. Ezt úgy értük el, hogy proxykat hoztunk létre a játékforgalomhoz, és a hálózaton továbbított minden egyes adatcsomagot továbbítókon irányítottuk át. Így amikor egy kliens beszélni akart egy játékszerverrel, egy továbbítón keresztül kellett megtennie, amely egyszerre hitelesítette, és továbbította a forgalmat a játékszerverre. Ez azt jelentette, hogy a szerver IP-címe mindig rejtve volt; a támadónak egyszerűen fogalma sem volt, hol támadjon.",
      "Újra korábbi, elavult postahivatalos hasonlatunkat használva, a spammerünknek már nem volt címe, ahová a levélszemetet küldje. Elküldhette a környék minden postahivatalába, és megkérhette őket, hogy továbbítsák azt, de engedély nélkül a postahivatal ezt nem tette meg. (Ráadásul ez a postahivatal kissé gyanúsnak találta volna, hogy valaki egyetlen személynek 100 000 levelet próbál küldeni.)",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "De nem lehetne egyszerűen a továbbítót megtámadni? Technikailag meg lehet. De lényegében korlátlan számúval rendelkezünk belőlük, és arra vannak építve, hogy megtámadják őket. A „továbbító” csak egy másik név egy bizonyos szoftvert futtató számítógépre. Meg lehet támadni és üzemképtelenné lehet tenni, de a protokollt ezt a feltételezést szem előtt tartva terveztük. Ha egy kliens játszani próbál, és elveszíti a kapcsolatot egy továbbítóval, egyszerűen átvált egy másikra. A továbbítók olyanok, mint a világban szétszórt gyalogok százai, amelyek egyedüli rendeltetése a játékszerver védelme. (Egyébként egy továbbító kiiktatása nehezebb, mint amilyennek hangzik. Elég jól vannak megtervezve, és a hálózat egy bizonyos részén helyezkednek el, így bár arra készültek, hogy kiiktassák őket, még egyet sem veszítettünk el.)",
      "A megoldás egyszerű, de hatékony volt. Korábban, ha valaki meg akart zavarni egy játékot, csak egyetlen játékszerver legyűrése volt a dolga (nagyon könnyen megugorható léc). Most lényegében az egész adatközpontot kellett legyűrnie, ami sokkal, sokkal, sokkal magasabbra teszi a lécet. Van olyan támadás, ami mégis véghez tudja ezt vinni? Természetesen. Van olyan támadás, ami meg tudja ezt tenni, és bárki megveheti online öt dollárért? Nincs. Egy ilyen kifinomult támadás hivatalosan kívül esik az emberek többségének árkategóriáján.",
      "Az új rendszer összeállásával és működésbe lépésével megvilágosodtunk: ha saját magánhálózatunkat irányítanánk, nem lennénk alávetve annak, ahogyan a normál internet működik. Használhatnánk az ügyfélélmény még jobbá tételére. A normál interneten, amikor csomagot küldesz egy IP-címről egy másikra, az általad használt útvonalat a Border Gateway Protocol (BGP) határozza meg. Ez egy útválasztó algoritmus, amely eldönti, hogyan halad át a csomagod egy hálózaton, és nincs beleszólásod az általa választott útvonalba.",
      "De egy globális továbbítók és adatközpontok százaiból álló virtuális magánhálózattal lényegében megválaszthatnánk a saját útvonalunkat a klienstől a játékszerverhez; gyakran rövidebb, gyorsabb utat az alap útvonalnál. Ha Steam Datagram Relayt (SDR) használsz, a Steam Átfedés mutatni fogja a ping-idődet és az útvonalat, amit adunk neked, így magad is láthatod, hogyan van optimalizálva.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Egy funkció, amely a Dota játékszerverek védelmének módjaként indult, túlnőtt mindazon, amire bárki számíthatott volna. Az SDR-hálózat rutinszerűen 140 millió csomagot és akár 550 gigabitet szállít másodpercenként. Harmincegy adatközpontban vannak továbbítóink, amelyek kapacitása meghaladja az 5 terabitet. Amit ma Steam Datagram Relaynek nevezünk, nem csak DDoS támadások ellen véd, de javítja a kapcsolódást és csökkenti a pinget is minden Dota játékosnak. És ezt nem csak a Dotának teszi meg, hanem bármely játéknak a Steamen, amely hasznosítani akarja.",
      "Reméljük, élvezted ezt az újabb betekintés a Dota vonalai közé. Eléggé technikai jellegű volt, köszönjük, hogy átrágtad magad rajta! És bátran oszd meg velünk, miről szeretnél legközelebb olvasni tőlünk."
    ],
    "commentcount": 278,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 5433,
    "votedowncount": 295,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1710287207,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 5433,
  "votes_down": 295,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}