{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Νέα από τα Μέτωπα: Αρνούμαστε την Άρνηση Υπηρεσίας",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709751795
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Νέα από τα Μέτωπα: Αρνούμαστε την Άρνηση Υπηρεσίας",
    "posttime": 1709684506,
    "updatetime": 1709751795,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Καλώς ήρθατε ξανά στα «Νέα από τα Μέτωπα», τις αναρτήσεις ιστολογίου όπου μέλη της ομάδας ανάπτυξής μας θα μας εξηγούν μερικές από τις προκλήσεις, τις διορθώσεις σφαλμάτων και τα ευτυχή ατυχήματα που βρίσκουμε στον δρόμο μας, καθώς εργαζόμαστε σε ένα τόσο ξεχωριστό παιχνίδι όσο το Dota.[/i]",
      "Η ιστορία μας έχει να κάνει με το ίντερνετ και το πώς, όταν λειτουργεί, δε λειτουργεί όπως θα έπρεπε. Μόνο που δε λειτουργεί καθόλου. Είναι μια ιστορία για εκείνη τη φορά που το ίντερνετ σταμάτησε να δουλεύει για τους πελάτες μας και εμείς το φτιάξαμε.",
      "Το ίντερνετ είναι πολύ πιο αφιλόξενο απ' ό,τι πιστεύουμε. Μακριά από την ασφάλεια του ελέγχου ταυτότητας δύο παραγόντων και των έμπιστων cookie, μπορεί να αγριέψουν τα πράγματα, με τόσα κακοπροαίρετα τρολ που έχουν τη δυνατότητα να κάνουν τη ζωή σας δύσκολη, όλο και συχνότερα, απλά και μόνο επειδή μπορούν.",
      "Το μακρινό 2014, τα τρολ χρησιμοποιούσαν τις επιθέσεις κατανεμημένης άρνησης παροχής υπηρεσίας (DDoS). Η λέξη «κατανεμημένη» αναφέρεται σε έναν μεγάλο αριθμό κεντρικών υπολογιστών που πλημμύριζαν κακόβουλα με κίνηση μια συγκεκριμένη διεύθυνση IP-στόχο, προσπαθώντας να κατακλύσουν τη στοίβα δικτύου. Αυτό ονομάζεται «ογκομετρική επίθεση» και η πρόθεση δεν είναι η είσοδος στο δίκτυο. Είναι απλά η άρνηση υπηρεσίας. Κατανεμημένη άρνηση υπηρεσίας σημαίνει ότι κανονικοί άνθρωποι που θέλουν να χρησιμοποιήσουν μια κανονική υπηρεσία δεν μπορούν λόγω της κακόβουλης κίνησης.",
      "Το πρόβλημα με τις επιθέσεις DDoS ήταν ότι, στα τέλη του 2014, αυτοί που τις εξαπέλυαν δεν ήταν υπέρτατοι χάκερ που έκαναν διήθηση δεδομένων, έχοντας διδακτορικά στην πληροφορική. Τις εξαπέλυε ο κάθε τυχόντας που είχε τη διάθεση να πληρώσει μια υπηρεσία ή ένα bot για να το κάνει εκ μέρους του. Και ο λόγος είναι ξεκάθαρος. Αν και κάποιοι έπαιρναν απλά χαρά όντας βάνδαλοι, άλλοι είχαν κίνητρο: Μια επίθεση DDoS ήταν ο τέλειος τρόπος να τερματιστεί ένας αγώνας στον οποίο έχαναν είτε οι ίδιοι είτε κάποιος που υποστήριζαν. Δεν επρόκειτο πλέον για περιστασιακή ενόχληση. Ήταν εν ψυχρώ επίθεση ενάντια σε κάθε ανταγωνιστικό παιχνίδι.",
      "Στις αρχές του 2015, βλέπαμε τεράστια αύξηση στις επιθέσεις DDoS στο Dota και το CS:GO, με άλλες εταιρείες να αναφέρουν το ίδιο. Ξαφνικά, είχε γίνει πολύ εύκολο για τον οποιονδήποτε να το καταφέρει.",
      "Τον Αύγουστο του 2015, προκλήθηκαν προβλήματα στο The International λόγω επιθέσεων DDoS. Αν και δεν επηρεάστηκαν οι επαγγελματίες που έπαιζαν, οι εκφωνητές δεν μπορούσαν να μπουν στους αγώνες για να τους σχολιάσουν ζωντανά, για πάνω από δύο ώρες. Υπήρχαν δυσκολίες στην αποστολή της ροής σαν τηλεοπτική μετάδοση. Οι παίκτες ξαφνικά έπαιζαν στο κενό. Ήταν μια επαγγελματική εκδήλωση gaming με εκατομμύρια θεατές και διακύβευμα εκατομμυρίων δολαρίων και τη διέκοπταν τυχαία άτομα με λογισμικό των πέντε δολαρίων. Ήταν ένα πρόβλημα που η Valve δεν μπορούσε να αγνοήσει.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Δοκιμάσαμε αρκετές λύσεις για να αντιμετωπίσουμε τις επιθέσεις DDoS πριν καταλήξουμε στην πιο αποτελεσματική. Αρχικά, προσπαθήσαμε να φιλτράρουμε την κίνηση με έναν ισχυρό διακόπτη (switch) δικτύου. Δυστυχώς, αυτός ο τύπος φιλτραρίσματος είναι από τη φύση του δύσκολος να εφαρμοστεί με κίνηση παιχνιδιού. Οι διακομιστές παιχνιδιού λαμβάνουν, από τη φύση τους, αυτόκλητη κίνηση UDP (User Datagram Protocol) από τυχαίες διευθύνσεις IP. Φανταστείτε ότι έχετε ένα ταχυδρομείο που φιλτράρει την ανεπιθύμητη αλληλογραφία για εσάς. Και τώρα φανταστείτε ότι η δουλειά σας είναι αρθρογράφος σε στήλη συμβουλών και λαμβάνετε συνεχώς κανονική αλληλογραφία από άγνωστα άτομα. Για εσάς, το ταχυδρομείο δεν ξέρει τι είναι ανεπιθύμητη αλληλογραφία και τι όχι. Έτσι φαίνεται συνήθως η κίνηση στους διακομιστές παιχνιδιών. Επιπλέον, η πηγαία IP στα πακέτα UDP δεν είναι ασφαλής και μπορεί εύκολα να πλαστογραφηθεί. Τώρα το ταχυδρομείο μας δεν μπορεί καν να κοιτάξει τη διεύθυνση αποστολής για ενδείξεις, καθώς οι αποστολείς ανεπιθύμητης αλληλογραφίας την πλαστογραφούν.",
      "Το Steam παραδίδει πολλά bit για περιεχόμενο παιχνιδιού και έχει φτιάξει ένα μεγάλο δίκτυο για αυτόν τον σκοπό.  Εκμεταλλευόμασταν ήδη αυτό το δίκτυο για να παραδίδουμε κίνηση παιχνιδιού μέσω αποκλειστικών συνδέσμων, να έχουμε καλή συνδυασμένη δικτύωση (peering), να διασφαλίζουμε ότι χρησιμοποιούνται οι βέλτιστες πρακτικές μηχανικής δικτύωσης κτλ. Έτσι, οι χρόνοι ping των παικτών διατηρούνταν χαμηλοί αλλά δεν υπήρχε προστασία εναντίον επιθέσεων DDoS. Το πρόβλημα είναι ότι τα πρωτόκολλα UDP δεν είναι ασφαλή, οπότε, όσο είχαμε το δικό μας δίκτυο, δεν ήταν ιδιωτικό.",
      "Προκειμένου να μην επιτρέπουμε στους επιτιθέμενους να χρησιμοποιούν το δικό μας δίκτυο για να επιτίθενται στους διακομιστές μας, έπρεπε να ελέγχουμε και να ασφαλίζουμε όλες τις εισόδους. Το καταφέραμε δημιουργώντας διακομιστές μεσολάβησης για την κίνηση του παιχνιδιού και κατευθύνοντας κάθε πακέτο δεδομένων που μεταδίδεται στο δίκτυο μέσω διακομιστών αναμετάδοσης. Πλέον, όταν κάποιος υπολογιστής-πελάτης ήθελε να επικοινωνήσει με κάποιον διακομιστή παιχνιδιού, έπρεπε να το κάνει μέσω ενός αναμεταδότη, που επαλήθευε και δρομολογούσε την κίνηση προς τον διακομιστή παιχνιδιού. Αυτό σήμαινε ότι η διεύθυνση IP του διακομιστή ήταν πάντα κρυφή και ο επιτιθέμενος δεν ήξερε πού να επιτεθεί.",
      "Για να χρησιμοποιήσουμε και πάλι το απαρχαιωμένο παράδειγμά μας με το ταχυδρομείο, ο επιτιθέμενος δεν είχε πλέον τη διεύθυνση για να στέλνει ανεπιθύμητη αλληλογραφία. Θα μπορούσε να τη στείλει σε κάθε ταχυδρομείο στην περιοχή και να ζητήσει από όλα να την ταχυδρομήσουν, αλλά χωρίς εξουσιοδότηση, το ταχυδρομείο δεν θα το έκανε. (Επίσης, το ταχυδρομείο θα το θεωρούσε λίγο ύποπτο που κάποιος προσπαθεί να στείλει σε ένα άτομο 100.000 γράμματα.)",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Δεν θα μπορούσε όμως να επιτεθεί στον αναμεταδότη; Από τεχνικής άποψης, θα μπορούσε. Αλλά διαθέτουμε απεριόριστο αριθμό αναμεταδοτών και τους έχουμε φτιάξει για να δέχονται επιθέσεις. «Αναμεταδότης» είναι άλλος τρόπος να πούμε «υπολογιστής που εκτελεί λογισμικό». Μπορεί κάποιος να του επιτεθεί ή να τον βγάλει εκτός σύνδεσης, αλλά το πρωτόκολλο το έχει ήδη προβλέψει. Όταν ένας υπολογιστής προσπαθεί να παίξει κάποιο παιχνίδι και χάνει την επαφή με τον αναμεταδότη, απλά αλλάζει αναμεταδότη. Οι αναμεταδότες είναι σαν εκατοντάδες πιόνια σκορπισμένα σε ολόκληρο τον κόσμο, με μοναδικό σκοπό την προστασία του διακομιστή παιχνιδιού. (Παρεμπιπτόντως, το να βγει εκτός λειτουργίας ένας αναμεταδότης είναι πιο δύσκολο από ό,τι ακούγεται. Είναι πολύ καλοφτιαγμένοι και έχουν τοποθετηθεί σε ένα συγκεκριμένο μέρος του δικτύου, οπότε, αν και φτιάχτηκαν για να βγαίνουν εκτός σύνδεσης, δεν έχουμε χάσει κανέναν ακόμα.)",
      "Η λύση ήταν απλή, αλλά αποτελεσματική. Προηγουμένως, αν κάποιος ήθελε να διακόψει ένα παιχνίδι, μπορούσε απλά να υπερφορτώσει έναν διακομιστή παιχνιδιού (κάτι που ήταν πολύ εύκολο). Πλέον, έπρεπε ουσιαστικά να υπερφορτώσει ολόκληρο το κέντρο δεδομένων. Πολύ, πολύ πιο δύσκολο. Υπήρχαν ακόμα επιθέσεις που θα μπορούσαν να το καταφέρουν; Εννοείται. Μπορούσε να καταφέρει ο καθένας τέτοιες επιθέσεις με πέντε δολάρια; Όχι. Μια τόσο εξελιγμένη επίθεση ήταν αναμφίβολα πάρα πολύ ακριβή για τους περισσότερους.",
      "Όταν το νέο σύστημα έγινε πλήρως λειτουργικό, συνειδητοποιήσαμε κάτι: Εάν είχαμε τον έλεγχο του δικού μας ιδιωτικού δικτύου, δεν θα περιοριζόμασταν από το πώς λειτουργεί το κανονικό ίντερνετ. Θα μπορούσαμε να το αξιοποιήσουμε για να βελτιώσουμε ακόμα περισσότερο την εμπειρία των χρηστών. Με το κανονικό ίντερνετ, όταν ένα πακέτο αποστέλλεται από μια διεύθυνση IP σε μια άλλη, η διαδρομή του καθορίζεται από το πρωτόκολλο BGP (Border Gateway Protocol). Αυτός ο αλγόριθμος δρομολόγησης αποφασίζει πώς θα ταξιδέψει το πακέτο στο δίκτυο και η διαδρομή του δεν μπορεί να αλλάξει από κανέναν.",
      "Ωστόσο, με ένα εικονικό ιδιωτικό δίκτυο που αποτελείται από εκατοντάδες αναμεταδότες και κέντρα δεδομένων παγκοσμίως, ουσιαστικά μπορούσαμε να επιλέξουμε τη δική μας διαδρομή από τον υπολογιστή-πελάτη προς τον διακομιστή παιχνιδιού. Πολύ συχνά, αυτή η διαδρομή είναι γρηγορότερη από την προεπιλεγμένη. Αν χρησιμοποιείτε τον αναμεταδότη SDR (Steam Datagram Relay), η επικάλυψη Steam σάς δείχνει τον χρόνο ping σας και ποια διαδρομή σας δίνουμε. Οπότε, μπορείτε να δείτε και μόνοι σας τη διαφορά.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Ένα χαρακτηριστικό που ξεκίνησε ως τρόπος προστασίας των διακομιστών παιχνιδιού του Dota έχει ξεπεράσει τις προσδοκίες όλων. Το δίκτυο SDR παραδίδει τακτικά έως και 140 εκατομμύρια πακέτα και 550GBit το δευτερόλεπτο. Έχουμε αναμεταδότες σε 31 κέντρα δεδομένων, με χωρητικότητα άνω των 5TBit. Αυτό που αποκαλούμε τώρα Steam Datagram Relay, όχι μόνο μας προστατεύει από επιθέσεις DDoS, αλλά ταυτόχρονα αυξάνει τη συνδεσιμότητα και μειώνει το ping για κάθε πελάτη Dota. Μάλιστα, δεν το κάνει μόνο για το Dota, αλλά και για κάθε παιχνίδι στο Steam που θέλει να το αξιοποιήσει.",
      "Ελπίζουμε να απολαύσατε και αυτήν τη βόλτα στα Μέτωπα του Dota. Είχε αρκετές τεχνικές λεπτομέρειες και σας ευχαριστούμε που τις διαβάσατε όλες! Πείτε μας ποιο θέλετε να είναι το επόμενο θέμα μας."
    ],
    "commentcount": 192,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "mod_require_rereview"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 2610,
    "votedowncount": 118,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1709751796,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709693712,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 2604,
  "votes_down": 118,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}