{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Между алеите — Отхвърляне на атаките за отказ на услугата",
  "event_type": 28,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Между алеите — Отхвърляне на атаките за отказ на услугата",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Посрещаме Ви отново в „Между алеите“, характеристика на блога, където членове от нашия екип с разработчици обхващат някои от предизвикателствата, поправките на неизправности и случайните щастливи инциденти, на които се натъкваме, докато работим върху толкова уникална игра като Dota 2.[/i]",
      "Това е история за интернета и относно това как той не работи както трябва, когато изобщо работи, освен когато не работи. Това е история относно това как интернета спря да работи за клиентите ни и как го поправихме.",
      "Интернетът е много по-диво погранично пространство, отколкото му приписваме. Кривнете ли от безопасните граници на Вашата двуфакторна идентификация и доверените бисквитки… Кътчетата, на които можете да се озовете са някак необятни и немили. Изпълнени са с произволни злонамерени тролове, а все повече и със способността да Ви стъжнят живота по простата причина, че могат да го сторят.",
      "Още през 2014 методът, който тези тролове използваха, беше разпределени атаки за отказ на услуга (DDoS). „Разпределени“ се позовава на големия брой интернет хостове, които злонамерено пренасищат определен целеви IP адрес с трафик, в опит да претоварят мрежовия стек. Това се нарича обемна атака и стремежът не е направата на опити за влизане в мрежата. Просто се целят набези за отказ на достъпа до услугата. Разпределеният отказ на услуга означава, че легитимните хора, които искат достъп до общоприета услуга, биват изместени на заден план от недобронамерения трафик.",
      "Проблемът с разпределените атаки за отказ на услугата (DDoS) беше, че към края на 2014 те не бяха извършвани от източващи данни супер хакери с високи научни степени по компютърни науки. Това можеше да стане от почти всекиго, искащ да плати на някому за извършване на услугата или за бот, който да я свърши вместо него. И е повече от очевидно защо. Въпреки че някои хора на драго сърце го правеха чисто и просто заради самия вандализъм, други от тях имаха мотив. Дадена разпределена атака за отказ на услугата (DDoS) беше безпогрешен начин окончателно да прекратите мач, който Вие или някой, когото подкрепяте, отива към загуба. Това вече не беше просто периодично раздразнение. Превръщаше се в отявлено нападение срещу всяка игра, в която участниците се съревноваваха.",
      "До началните месеци на 2015 виждахме огромен прираст в разпределените атаки за отказ на услугата (DDoS) срещу Dota 2 и CS:GO. Други компании също отчитаха огромен скок. Съвсем внезапно някой беше улеснил направата на такава дейност от всекиго.",
      "През август 2015 The International беше прекъснат с разпределени атаки за отказ на услугата (DDoS). Въпреки че професионалистите, играещи мача, не бяха повлияни, в продължение на повече от два часа, операторите на предаването не можеха да влязат в мачовете, за да дават ситуационни и колоритни коментари. Изпращането на излъчването като телевизионно предаване също се превърна в проблем. Внезапно участниците се оказаха играещи в бездна. Това беше професионално игрално събитие с милиони зрители и милиони долари, поставени на карта, а беше прекъснато от произволни хорица с пет доларов софтуер. Това беше проблем, който Valve не можеше да пренебрегва.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Опитахме редица решения, за да се справим с разпределените атаки за отказ на услугата (DDoS), преди да стигнем до едно, което проработи. Първоначално опитахме да филтрираме трафика с мощен мрежов комутатор. За съжаление, по принцип е трудно да се направи този тип филтриране с игрален трафик. Естеството на игралните сървъри е да получават неизискан трафик чрез протокола за потребителски дейтаграми (UDP) от произволни IP адреси. Представете си, че разполагате с пощенска служба, която отсява нежеланата ненужна поща вместо Вас. А сега си представете, че работата Ви е да водите рубрика, даваща съвети, и получавате тонове легитимна поща от случайни непознати през цялото време. Във Вашия случай пощенската служба няма как да знае какво е или не е нежелана поща. Трафикът към игралните сървъри обикновено изглежда по този начин. При това, IP източникът в пакетите от протокола за потребителски дейтаграми (UDP) не е защитен и може лесно да бъде подправен. Пощенската ни служба дори не може да провери обратния адрес на плика за улики, защото подателите на нежеланата поща го фалшифицират.",
      "Steam поднася купища битове за игрално съдържание, а за да прави това е изградена голяма мрежа.  Вече се възползвахме от нея, за да предоставяме игрален трафик през специализирани връзки; да добиваме добри сесии с равноправен достъп; да се уверяваме, че са използвани най-добрите практики за мрежово инженерство и т.н. Това поддържаше времената за пинг на играчите ниски, но не предпазваше от разпределени атаки за отказ на услугата (DDoS). Проблемът е, че протоколите за потребителски дейтаграми не са защитени. И така, макар че имахме наш собствен интернет, той не беше личен.",
      "С цел да предотвратим това нападателите да използват собствената ни мрежа, за да атакуват нашите сървъри, трябваше да контролираме всички входящи точки и да ги защитим. Постигнахме това, като създадохме прокси сървъри за игралния трафик, маршрутизирайки всеки отделен пакет с данни, предаван през мрежата посредством предаватели. Сега, когато даден клиент искаше да говори с някой игрален сървър, той трябваше да го стори посредством предавател. Това същевременно го удостоверяваше и предаваше този трафик през прокси към игралния сървър. Това означаваше, че IP адресът на сървъра винаги беше скрит. Нападателят просто нямаше никаква представа къде да атакува.",
      "С цел пак да използваме старомодната ни пощенска метафора от по-рано, нашият спамър вече нямаше адрес, до който да изпраща нежелана поща. Биха могли да я изпратят до всяка пощенска служба в района и да поискат разпращането ѝ, но без упълномощения това няма да бъде направено. Нещо повече, тази пощенска служба би счела това, че някой се опитва да изпрати 100 000 писма до един човек, за малко подозрително.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Но не бихте ли могли просто да атакувате предавателя? Технически, да. Бихте могли. Но ние на практика разполагаме с неограничен брой от тях и ги изготвихме, за да бъдат атакувани. „Предавател“ е просто друга дума за компютър, работещ със софтуер. Можете да го атакувате или да го извадите извън линия, но протоколът е проектиран имайки предвид тази презумпция. Ако някой клиент се опитва да участва в игра и загуби контакт с даден предавател, просто се превключва към друг. Предавателите са като стотици пионки, разпръснати по целия свят с единствената цел да предпазват игралния сървър. Впрочем, изваждането на предавател от строя е по-трудно, отколкото звучи. Те са проектирани доста добре и са позиционирани в специфична част от мрежата, така че макар да са създадени, за да бъдат изваждани извън линия, все още не сме загубили нито един.",
      "Решението беше просто, но ефективно. Преди, ако някой искаше да подрине дадена игра, можеше просто да надделее само над един игрален сървър. Доста ниска летва за преодоляване. А сега, на практика трябваше да надделее над целия център за данни. Много, много, много по-висока летва за преодоляване. Има ли атаки, които все още могат да постигнат това? Разбира се. Има ли атаки, които могат да направят това и са достъпни за покупка на линия от всекиго за пет долара? Не. Атака с такава сложност официално беше извън ценовия диапазон на повечето хора.",
      "С тази нова система в действие, имахме прозрение. Ако контролирахме наша собствена лична мрежа, нямаше да сме зависими от това как работи нормалният интернет. Бихме могли да я използваме, така че да направим преживяването за клиентите още по-добро. При нормалния интернет, когато изпращате пакет от един IP адрес към друг, използваният маршрут се определя от протокола за граничен шлюз (BGP). Това е маршрутизиращ алгоритъм, който решава как Вашият пакет ще пътува през мрежата, а Вие нямате избор в подбрания от него маршрут.",
      "Но с виртуална лична мрежа, съставена от стотици глобални предаватели и центрове за данни, на практика бихме могли да изберем наш собствен маршрут от клиента до игралния сървър. Често по-бърз пряк път от маршрута по подразбиране. Ако използвате Steam дейтаграм предавател (SDR), Steam слоят ще показва Вашето време за пинг и какъв маршрут Ви даваме, така че ще можете сами да видите как се оптимизира.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Характеристика, която стартира като начин за предпазване на игралните сървъри за Dota 2, надрасна това, което някой можеше да очаква. Мрежата от Steam дейтаграм предаватели (SDR) рутинно доставя до 140 милиона пакета и 550 GBit в секунда. Разполагаме с предаватели в 31 центъра за данни с капацитет от над 5 TBit. Това, което сега наричаме Steam дейтаграм предаватели, не само предпазва от разпределени атаки за отказ на услугата (DDoS), но също така увеличава свързаността и намалява пинга за всеки Dota 2 клиент. И не прави това само за Dota 2, а за всяка игра в Steam, която иска да се възползва от тази характеристика.",
      "Надяваме се, че сте се насладили на още едно надзъртане между алеите на Dota 2. Това беше доста техническо постъпление, благодарим Ви, че останахте с нас! И не се колебайте да ни уведомите какво бихте искали да обхванем по-нататък."
    ],
    "commentcount": 313,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 23,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 7705,
    "votedowncount": 475,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1715113657,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7705,
  "votes_down": 475,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}