{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Entre les lanes : déni de déni de service",
  "event_type": 28,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Entre les lanes : déni de déni de service",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Le blog « Entre les lanes » revient pour donner la parole à nos dévs. L'équipe y relate certains des défis auxquels elle a dû faire face, les corrections de bugs et les heureux accidents qui arrivent parfois en travaillant sur un jeu aussi unique que Dota ou un évènement aussi marquant que The International.[/i]",
      "On y parle d'Internet et du fait que ça ne fonctionne jamais comme il se doit, et ce, quand ça marche, sauf quand ça ne marche pas. On y parle de comment Internet a cessé de coopérer avec notre clientèle et comment on a traité le problème.",
      "Internet est une jungle plus sauvage encore qu'on ne le pense. Éloignez-vous des sentiers sécurisés de votre identification à deux facteurs et de vos cookies de confiance, et votre chemin peut devenir assez périlleux, jonché de trolls en tous genres, qui font montre de malveillance et, de plus en plus, d'un certain talent à vous pourrir la vie. Pourquoi ? Parce qu'ils le peuvent.",
      "En 2014, ces trolls utilisaient des attaques par déni de service distribué (« distributed denial-of-service » ou DDoS en anglais). Le terme « distribué » fait référence au grand nombre d'hôtes Internet qui inondent de manière malveillante une adresse IP cible de trafic dans le but de submerger la pile réseau. C'est ce qu'on appelle une attaque volumétrique. Son intention n'est pas d'essayer de pénétrer le réseau, mais de refuser le service. Un déni de service distribué signifie que les personnes légitimes qui souhaitent un service légitime sont évincées par le trafic outrancier.",
      "Le problème avec les attaques DDoS, c'est qu'à la fin de l'année 2014, elles n'étaient plus le fait de pirates de génie, armés de diplômes spécialisés en informatique, experts en vol de données. Ces attaques pouvaient être commises par n'importe qui pouvant payer un service ou un robot pour le faire à sa place. La raison de ces méfaits était évidente. Si certaines personnes s'amusaient à attaquer ainsi autrui par pur plaisir de vandalisme, d'autres avaient un motif plus sérieux : une attaque DDoS était un moyen infaillible de mettre fin à un match que vous ou quelqu'un que vous souteniez était en train de perdre. Ces attaques n'étaient donc plus une irritation occasionnelle passagère, mais bien une agression pure et simple contre tout jeu offrant une forme de compétition en ligne.",
      "Au cours des premiers mois de 2015, nous avons assisté à une forte augmentation des attaques DDoS contre Dota et CS:GO, et d'autres entreprises ont également fait état d'une hausse considérable. Quelqu'un avait, tout à coup, facilité la tâche de quiconque souhaitait faire une attaque DDoS.",
      "Le tournoi The International d'aout 2015 a été perturbé par ces attaques. Bien que les professionnels jouant le match n'aient pas été affectés, pendant plus de deux heures, les personnes qui devaient commenter et analyser les rencontres n'ont pas pu assister aux matchs. La diffusion de l'évènement sous forme d'émission télévisée est devenue problématique. Les pros jouaient soudainement dans le vide. Cet évènement d'e-sport professionnel, suivi par des millions de personnes et aux enjeux financiers considérables, était perturbé par quelques figures inconnues armées d'un logiciel de cinq sous. C'était un problème que Valve ne pouvait ignorer.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Nous avons dû essayer plusieurs solutions pour faire face aux attaques DDoS avant d'en trouver une véritablement efficace. Dans un premier temps, nous avons essayé de filtrer le trafic à l'aide d'un puissant commutateur réseau. Malheureusement, ce type de filtrage est intrinsèquement difficile à appliquer au trafic d'un jeu. Il est dans la nature des serveurs de jeux de recevoir du trafic UDP (User Datagram Protocol) non sollicité provenant d'adresses IP arbitraires. Imaginez un bureau de poste qui éliminerait tout courrier indésirable pour vous. Mais imaginez maintenant que votre travail consiste à répondre aux questions des lecteurs et des lectrices d'un magazine, et que vous receviez en permanence des tonnes de lettres tout à fait légitimes de personnes inconnues. Le bureau de poste ne saurait pas faire la différence entre le courrier désirable et indésirable. On retrouve cette même problématique avec le trafic vers les serveurs de jeux. De plus, l'adresse IP source des paquets UDP n'est pas sécurisée et peut être facilement usurpée. Notre bureau de poste ne peut même pas consulter l'adresse de retour figurant sur l'enveloppe pour trouver des indices, car elles sont le plus souvent falsifiées.",
      "Steam envoie un grand volume de bits pour le contenu de ses jeux et, pour ce faire, a développé un vaste réseau.  Ce réseau était déjà largement mis à contribution pour acheminer le trafic des jeux via des liens dédiés, obtenir un bon peering, nous assurer que les meilleures pratiques d'ingénierie réseau étaient utilisées, etc. Cela permettait de limiter les délais de ping, mais n'offrait aucune protection contre les attaques DDoS. Le problème est que les protocoles UDP ne sont pas sécurisés, donc même si nous avions notre propre réseau, celui-ci n'était pas privé.",
      "Pour empêcher les pirates d'utiliser notre propre réseau pour attaquer nos serveurs, nous devions en contrôler toutes les entrées et les sécuriser. Nous avons gagné notre pari en créant des proxys (des serveurs mandataires) pour le trafic de jeu, ce qui permettait d'acheminer chaque paquet de données transmis sur le réseau via des relais. Lorsqu'un client voulait parler à un serveur de jeu, il devait le faire via un relai qui l'authentifiait et transmettait le trafic au serveur de jeu par proxy. Cela signifiait que l'adresse IP du serveur était toujours cachée : les pirates ne savaient tout simplement pas où attaquer.",
      "Pour reprendre notre métaphore postale, nos pirates n'avaient plus d'adresse à laquelle envoyer du courrier indésirable. L'envoyer à tous les bureaux de poste de la région pour qu'ils l'acheminent à destination était contreproductif, car sans mandat, le bureau ignorait la requête. (De plus, il aurait trouvé un peu suspect que quelqu'un essaie d'envoyer 100 000 lettres à une seule personne.)",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Pourquoi ne pas simplement attaquer le relai ? Techniquement, c'est possible. Cependant leur nombre est quasi illimité, et nous les avons conçus pour supporter les attaques. Un « relai » n'est qu'un autre terme pour désigner un ordinateur exécutant un logiciel. Vous pouvez l'attaquer ou le mettre hors ligne, mais le protocole a été conçu pour ces scénarios. Si un client essaie de jouer à un jeu et perd le contact avec un relai, il passe simplement à un autre relai. Ces derniers s'apparentent à des centaines de pions éparpillés à travers le monde dont le seul but est de protéger le serveur de jeu. D'ailleurs, faire tomber un relai est plus difficile qu'il n'y parait. Ils sont assez bien conçus et placés dans une partie spécifique du réseau, si bien que, même s'ils ont été conçus pour être désactivés, nous n'en avons pas encore perdu un seul.",
      "La solution était simple mais efficace. Auparavant, si quelqu'un voulait perturber une partie, il lui suffisait de neutraliser un seul serveur de jeu (ce qui est chose relativement aisée). À présent, il lui faut prendre le contrôle de l'ensemble du centre de données, ce qui n'est pas une mince affaire ! Y a-t-il des attaques encore susceptibles d'y parvenir ? Bien sûr. Existe-t-il des attaques de ce potentiel coutant moins de cinq dollars et accessibles au quidam moyen sur Internet ? Non. Une attaque aussi sophistiquée était officiellement hors de portée du commun des mortels.",
      "Une fois ce nouveau système opérationnel, nous avons eu une révélation : en contrôlant notre propre réseau privé, nous ne serions plus tributaires du fonctionnement normal d'Internet. Nous pouvions l'utiliser pour améliorer encore l'expérience de notre clientèle. Sur l'Internet grand public, lorsque vous envoyez un paquet d'une adresse IP à une autre, l'itinéraire que vous utilisez est déterminé par le protocole BGP (Border Gateway Protocol). Il s'agit d'un algorithme de routage qui décide de la façon dont votre paquet va voyager sur un réseau, et c'est à lui seul que revient le choix de l'itinéraire.",
      "Mais avec un réseau privé virtuel composé de centaines de relais et de centres de données dans le monde, nous pouvions choisir nous-mêmes l'itinéraire entre le client et le serveur de jeu, ce qui constituait bien souvent un raccourci par rapport à l'itinéraire par défaut. Si vous utilisez Steam Datagram Relay (SDR), l'overlay Steam vous indique le délai de ping et l'itinéraire que nous vous proposons pour que vous puissiez voir comment celui-ci est optimisé.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Cette fonctionnalité qui servait initialement à protéger les serveurs de jeux Dota a dépassé toutes les attentes. Le réseau SDR transfère régulièrement jusqu'à 140 millions de paquets à une vitesse de 550 Gbit par seconde. Nous disposons de relais dans 31 centres de données, pour une capacité de transfert supérieure à 5 téraoctets par seconde. Ce que nous appelons désormais le Steam Datagram Relay protège non seulement les serveurs contre les attaques DDoS, mais il augmente également la connectivité et réduit le ping pour chaque joueur et joueuse de Dota. Et cet avantage ne se limite pas à Dota : tous les jeux présents sur Steam peuvent en bénéficier.",
      "Nous espérons que vous avez aimé ce petit tour dans les coulisses de Dota. C'était assez technique, mais vous avez tenu bon ! Et n'hésitez pas à nous faire part des sujets que vous souhaiteriez voir abordés ensuite."
    ],
    "commentcount": 313,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 2,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 7705,
    "votedowncount": 475,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1715113657,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7705,
  "votes_down": 475,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}