{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Tra le Corsie: rimuovere il Denial of Service",
  "event_type": 28,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Tra le Corsie: rimuovere il Denial of Service",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Rieccoci con una nuova edizione di \"Tra le Corsie\", una rubrica del blog in cui i membri del nostro team di sviluppo raccontano nel dettaglio alcune delle sfide, dei bug da risolvere e delle fortunate coincidenze in cui ci imbattiamo mentre lavoriamo a un gioco unico come Dota.[/i]",
      "Questa è una storia che racconta di internet e di come a volte non funziona come dovrebbe (o meglio, non funziona affatto). È una storia che racconta come internet ha smesso di funzionare per i nostri clienti e come abbiamo risolto il problema.",
      "Internet è una frontiera più selvaggia di quanto pensiamo. Se ti allontani dai confini sicuri dell'identificazione a due fattori e dei cookie attendibili, potresti avventurarti in una terra di nessuno, piena di troll malevoli con l'intenzione e la capacità sempre maggiore di renderti la vita difficile per il puro gusto di farlo.",
      "Nel 2014, il metodo utilizzato da quei troll erano gli attacchi DDoS (Distributed Denial of Service). Il termine \"Distributed\" si riferisce a un gran numero di host internet che inondano di traffico un particolare IP di destinazione nel tentativo di sovraccaricare lo stack di rete. Questo si chiama attacco volumetrico e l'intento non è quello di accedere alla rete, bensì di negare il servizio. \"Distributed Denial of Service\" significa che le persone che vogliono accedere in modo legittimo a un servizio legittimo non possono farlo a causa del traffico eccessivo.",
      "Il problema degli attacchi DDoS era che, verso la fine del 2014, questi non venivano commessi da super-hacker con lauree avanzate in informatica e una specializzazione in esfiltrazione di dati, bensì da chiunque fosse disposto a pagare un servizio o un bot che lo facesse per loro. E il motivo è piuttosto ovvio. Sebbene alcune persone lo facessero per puro vandalismo, altre avevano uno scopo preciso: un attacco DDoS era un metodo infallibile per interrompere una partita che tu o la tua squadra preferita stavate perdendo. Non si trattava più di una scocciatura occasionale, ma di un vero e proprio assalto a qualsiasi partita che metteva in competizione i giocatori.",
      "Nei primi mesi del 2015, abbiamo assistito a un enorme aumento degli attacchi DDoS contro Dota e CS:GO, poi segnalato anche da altre aziende. Qualcuno, all'improvviso, era riuscito a facilitare questi attacchi per chiunque.",
      "Nell'agosto del 2015, il The International fu interrotto da attacchi DDoS. Sebbene i giocatori professionisti in partita non avessero subito gli effetti di questi attacchi, l'accesso ai commentatori per seguire le azioni in tempo reale non fu possibile per più di due ore. Diffondere l'evento sotto forma di trasmissione televisiva divenne un grande problema. Improvvisamente i giocatori si trovarono a giocare nel vuoto assoluto. Si trattava di un evento di gaming professionale con milioni di spettatori e milioni di dollari in gioco, interrotto da persone a caso con software da cinque dollari. Era un problema che Valve non poteva ignorare.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Abbiamo provato diverse soluzioni per affrontare gli attacchi DDoS prima di trovarne una che funzionasse. Inizialmente abbiamo cercato di filtrare il traffico con un potente commutatore di rete. Purtroppo questo tipo di filtro è intrinsecamente difficile da applicare con il traffico di gioco. È nella natura dei server di gioco ricevere traffico UDP (User Datagram Protocol) non richiesto da indirizzi IP arbitrari. Immagina di avere un ufficio postale che elimina la posta indesiderata per tuo conto. Ora immagina, però, che il tuo lavoro consista nel rispondere alle domande dei lettori del tuo giornale e di ricevere tonnellate di posta legittima da completi sconosciuti. L'ufficio postale non è in grado di distinguere la tua posta indesiderata da quella legittima. Ecco, il traffico nei server di gioco funziona più o meno così. Inoltre, l'IP di origine nei pacchetti UDP non è protetto e può essere facilmente falsificato. Il nostro ufficio postale non può nemmeno guardare l'indirizzo del mittente sulla busta per trovare indizi, perché i mittenti della posta indesiderata lo falsificano.",
      "Steam ha creato una rete su larga scala per consegnare i moltissimi bit relativi ai contenuti di gioco.  Già sfruttavamo questa rete per distribuire il traffico di gioco su link dedicati, ottenendo un buon peering, assicurandoci di usare le migliori prassi ingegneristiche per la rete e così via. Ciò ha mantenuto bassa la latenza dei giocatori, senza però proteggerci dagli attacchi DDoS. Il problema è che i protocolli UDP non sono sicuri: nonostante avessimo una nostra rete, questa non era privata.",
      "Per impedire che la nostra stessa rete fosse usata per attaccare i server, dovevamo poter controllare e proteggere tutti gli ingressi. Per farlo, abbiamo creato un proxy per il traffico di gioco instradando tramite relè ogni singolo pacchetto di dati trasmesso attraverso la rete. Così, quando un client voleva parlare con un server di gioco, doveva farlo tramite un relè che lo autenticava e inoltrava il traffico al server stesso. Ciò significava che l'indirizzo IP del server era sempre nascosto: l'aggressore semplicemente non aveva idea di dove attaccare.",
      "Tornando alla nostra metafora dell'ufficio postale, ora i malintenzionati non avevano più un indirizzo a cui inviare la posta indesiderata. Avrebbero potuto spedirla a tutti gli uffici postali della zona e chiedere di consegnarla al destinatario, ma gli uffici non lo avrebbero fatto senza autorizzazione (bisogna anche dire che un ufficio postale troverebbe un po' sospetto che qualcuno stia cercando di inviare 100.000 lettere a una sola persona).",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Ma non si potrebbe semplicemente attaccare il relè? Tecnicamente sì, ma ne abbiamo un numero praticamente illimitato e li abbiamo creati apposta perché vengano attaccati. Un \"relè\" è semplicemente un computer che esegue un software. Anche se è possibile attaccarlo o mandarlo offline, il protocollo è stato pensato proprio per questa evenienza. Se un cliente vuole avviare un gioco e si disconnette da un relè, semplicemente ne troverà un altro. I relè sono come centinaia di pedine sparse per il mondo con l'unico scopo di proteggere il server di gioco (tra l'altro, disattivare un relè è più difficile di quanto sembri: vengono progettati abbastanza bene e posizionati in una parte specifica della rete, quindi sebbene siano pensati per essere mandati offline, non ne abbiamo ancora perso uno).",
      "La soluzione è stata semplice ma efficace. In passato, se qualcuno voleva interrompere una partita, poteva semplicemente sovraccaricare un singolo server di gioco (un ostacolo davvero facile da superare), mentre ora avrebbe dovuto sovraccaricare l'intero centro dati (un ostacolo decisamente maggiore). Esistono attacchi che potrebbero ancora raggiungere questo obiettivo? Sì, certo. Esistono attacchi in grado di farlo con strumenti che possono essere acquistati online per cinque dollari? No. Un attacco così sofisticato era decisamente fuori portata in termini di costi per la maggior parte delle persone.",
      "Con questo nuovo sistema in funzione, abbiamo avuto un'idea geniale: se fossimo noi a controllare la nostra rete privata, non saremmo vincolati al normale funzionamento di internet. Potremmo usarla per migliorare ulteriormente l'esperienza del cliente. Il normale funzionamento di internet prevede che quando si invia un pacchetto da un indirizzo IP a un altro, il percorso utilizzato è stabilito dal Border Gateway Protocol (BGP). Si tratta di un algoritmo di instradamento che stabilisce in che modo il tuo pacchetto viaggerà attraverso una rete e non è possibile sceglierne il percorso.",
      "Tuttavia, con una rete privata virtuale composta da centinaia di relè e centri dati a livello globale, potremmo fondamentalmente decidere il percorso dal client al server di gioco, spesso più veloce rispetto al percorso predefinito. Se utilizzi Steam Datagram Relay (SDR), l'Overlay di Steam ti mostrerà la latenza e il percorso utilizzato, così da poter vedere di persona come questo venga ottimizzato.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Una funzionalità nata come un modo per proteggere i server di gioco di Dota è andata ben oltre le aspettative di chiunque. La rete SDR invia regolarmente fino a 140 milioni di pacchetti e 550 GBit al secondo. Disponiamo di relè in 31 centri dati, con una capacità di oltre 5 TBit. Quello che ora chiamiamo Steam Datagram Relay non solo protegge dagli attacchi DDoS, ma aumenta anche la connettività e riduce la latenza per ogni cliente di Dota. E non lo fa solo per Dota, ma per qualsiasi gioco su Steam che voglia trarne vantaggio.",
      "Ci auguriamo che questo sguardo tra le corsie di Dota sia stato di tuo gradimento. È stato un discorso piuttosto tecnico, grazie per aver letto fin qui! E facci sapere quale argomento vorresti che venga affrontato la prossima volta."
    ],
    "commentcount": 313,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 7705,
    "votedowncount": 475,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1715113657,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7705,
  "votes_down": 475,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}