{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Giữa làn đạn: Từ chối cái từ chối dịch vụ",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Giữa làn đạn: Từ chối cái từ chối dịch vụ",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Chào mừng bạn trở lại Giữa làn đạn, loạt bài blog tiêu điểm mà các thành viên đội phát triển trình bày những thử thách, lỗi sửa, và đôi khi vài tình huống cười chảy nước mắt trong chặng đường phát triển một trò chơi độc đáo như Dota.[/i]",
      "Đây là một câu chuyện về Internet, lúc chạy bình thường, lúc thì lâu lắc, lúc thì đứng luôn. Ngày xửa ngày xưa, Internet ngừng hoạt động, và chúng tôi thân chinh đi sửa cho quý khách hàng.",
      "Internet là chốn hoang dã hơn ta tưởng. Chỉ cần đi xa một chút khỏi giới hạn an toàn của công nghệ xác thực hai bước và cookie đáng tin cậy thôi là đã hơi hơi lạc vào rừng thiêng nước độc, nơi đầy rẫy những tên troll độc địa - và khả năng rất cao chúng sẽ khiến đời bạn khốn khổ, chẳng lý do gì ngoài việc thích vậy nên làm.",
      "Hồi 2014, bọn troll rất thích dùng các công cụ tấn công từ chối dịch vụ phân tán (DDoS). “Phân tán” ở đây là chỉ lượng lớn các máy chủ mạng lùa những đợt truy cập ác ý vào một địa chỉ IP cụ thể với lưu lượng nhằm áp đảo stack giao thức mạng. Phương cách đó được gọi là tấn công về băng thông, với mục đích không phải để thâm nhập hệ thống mạng,  mà chỉ gây ra sự cố từ chối dịch vụ. DDoS cũng có nghĩa là người chính đáng có nhu cầu sử dụng dịch vụ bị chèn ép với lưu lượng băng thông xấu.",
      "Vấn đề với các cuộc tấn công DDoS là, vào cuối 2014, chúng không hề được gây ra bởi bọn siêu tin tặc khai thác dữ liệu với bằng đại học khoa học máy tính loại xuất sắc. Trái lại, kẻ nã đạn có thể là bất cứ ai muốn trả tiền cho dịch vụ hoặc bot để tấn công dùm. Không khó để hiểu tại sao. Vài người phá hoại chỉ cho vui, nhưng vài người khác thì có động cơ hẳn hoi: tấn công DDoS là cách chắc như bắp để đánh sập một trận đấu mà bạn hoặc ai đó bạn ủng hộ đang chơi thua. Đây chẳng còn là chuyện lâu lâu ghẹo chút chơi nữa. Hành động đó đã biến thành cuộc tấn công chủ đích tới bất kì trận đấu nào có người chơi tranh tài.",
      "Vào những tháng đầu của năm 2015, chúng tôi chứng kiến sự gia tăng các đợt tấn công DDoS vào Dota và CS:GO, các công ty khác cũng báo cáo một lượng tăng mạnh. Chẳng biết ai từ đâu chui ra làm cho việc tấn công mạng trở nên dễ như ăn kẹo.",
      "Vào tháng 08/2015, một đợt đổ bộ DDoS đã phá giải The International. Dù không ảnh hưởng tới các tuyển thủ đang thi đấu, nhưng suốt hơn hai tiếng, nhà phát sóng không thể vào xem thông tin trận đấu để đưa ra các bình luận phân tích cho từng khoảnh khắc. Gửi luồng stream dưới dạng phát sóng truyền hình đã trở thành vấn đề. Người chơi bỗng dưng chơi trong một màn tối hư không. Sự kiện trò chơi điện tử chuyên nghiệp có hàng triệu người dõi theo và hàng triệu đô đổ vào, ấy thế mà lại bị một phần mềm 5 đồng bạc lẻ của tên ất ơ nào đó phá bĩnh. Đó là một vấn đề Valve không thể nhắm mắt làm ngơ.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Chúng tôi thử vài cách xử lý sự cố tấn công DDoS trước khi tìm được giải pháp hiệu quả. Ban đầu, chúng tôi thử lọc lưu lượng với bộ switch hàng khủng. Tiếc thay, kiểu lọc này vốn khó thực hiện với lưu lượng truy cập trò chơi. Bản chất các máy chủ trò chơi bao gồm việc nhận các gói UDP (User Datagram Protocol - Giao thức dữ liệu người dùng) từ các địa chỉ IP tùy ý. Thử hình dung bạn có một bưu điện dọn sạch đống thư rác không mong muốn. Nhưng giờ hãy tưởng tượng bạn là người phụ trách chuyên mục tư vấn, lúc nào cũng nhận được hàng tấn thư hợp lệ từ những người lạ nào đó. Đối với bạn, bưu điện chẳng biết đâu là thư rác, đâu là thư thật. Lưu lượng truy cập máy chủ trò chơi trông giống vậy đấy. Ngoài ra, địa chỉ IP gốc trong gói dữ liệu UDP không được bảo mật, và có thể dễ dàng bị giả mạo. Bưu điện của chúng tôi cũng không thể dựa vào địa chỉ trả về trên phong bì để lần ra manh mối, bởi vì tay gửi thư rác cũng làm giả được thông tin đó.",
      "Steam gửi rất nhiều phần cho nội dung trò chơi, và đã phát triển một hệ thống mạng lớn để làm thế.  Chúng tôi đã tận dụng hệ thống này để chuyển lưu lượng trò chơi qua các liên kết chuyên dụng, lấy các peer tốt, luôn sử dụng các phương pháp tối ưu nhất về kỹ thuật mạng, v.v. Điều này giữ thời gian ping của người chơi ở mức thấp, nhưng không bảo vệ họ trước cuộc tấn công DDoS. Vấn đề là giao thức UDP không bảo mật, vì vậy dù chúng tôi có mạng riêng, nhưng lại không đảm bảo tính riêng tư.",
      "Để ngăn kẻ tấn công dùng chính hệ thống mạng của chúng tôi để tấn công máy chủ của mình, chúng tôi cần kiểm soát và bảo mật tất cả lối vào. Điều này được thực hiện bằng cách tạo proxy cho lưu lượng trò chơi, định tuyến từng gói dữ liệu truyền qua mạng thông qua các relay. Giờ khi muốn giao tiếp với máy chủ trò chơi, máy khách phải thông qua một relay đã xác thực cũng như làm proxy cho lưu lượng đó tới máy chủ trò chơi. Điều này có nghĩa địa chỉ IP của máy chủ luôn được ẩn—kẻ tấn công đơn giản là không biết phải tấn công vào đâu.",
      "Để sử dụng lại phép ẩn dụ bưu điện trước đó, kẻ gửi thư rác của chúng ta không còn địa chỉ để quăng rác vào. Chúng có thể gửi tới mọi bưu điện trong khu vực và yêu cầu họ chuyển thư đi, nhưng thiếu xác thực thẩm quyền thì bưu điện sẽ không nhận làm. (Hơn nữa, bưu điện đó sẽ hơi nghi nghi khi ai đó đang cố gửi cho một người 100.000 lá thư).",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Nhưng nếu thế thì chỉ cần tấn công relay là được phải không? Về mặt kỹ thuật thì được. Nhưng chúng tôi đã thủ sẵn gần như vô hạn các relay, được thiết kế rất chịu đòn. “Relay” là từ ngữ khác để chỉ một máy tính chạy phần mềm. Bạn có thể tấn công hoặc làm sập, nhưng giao thức đã được thiết kế với giả định này. Nếu một máy khách tìm cách chơi một trận đấu và mất liên hệ với relay, thì chỉ cần chuyển qua một relay khác. Relay như hàng trăm con tốt thí dàn trải khắp mọi nơi trên thế giới với mục đích bảo vệ máy chủ trò chơi. (Trùng hợp thay, muốn hạ relay thì nói dễ hơn làm. Chúng được thiết kế tinh vi và đặt tại một nơi cụ thể của hệ thống mạng, vậy nên dù được phát triển để bị đánh sập, chúng tôi đến giờ vẫn chưa mất relay nào).",
      "Giải pháp đơn giản mà hiệu nghiệm. Trước đây, nếu có kẻ nào muốn phá bĩnh, chúng chỉ việc chế ngự một máy chủ duy nhất (gì mà đơn giản như đang giỡn). Giờ, về cơ bản, chúng phải chế ngự cả trung tâm dữ liệu - rất, rất chi là không giỡn mặt được. Liệu còn thủ thuật tấn công nào triệt phá được điều này? Có chứ sao không. Còn kiểu tấn công mà ai online bỏ ra 5 đô cũng có thể làm được nữa không? Không nhé. Một cuộc tấn công tinh vi vậy chính thức nằm ngoài hầu bao của cơ số người đấy.",
      "Với hệ thống mới đã thượng đài và xung trận, chúng tôi chợt ngộ ra: Nếu kiểm soát riêng hệ thống mạng, thì không còn phụ thuộc vào cách Internet thông thường hoạt động. Chúng tôi có thể dùng hệ thống để cải thiện hơn nữa trải nghiệm của khách hàng. Với mạng Internet thông thường, khi bạn gửi một gói từ địa chỉ IP này tới địa chỉ IP khác, tuyến đường gửi tới sẽ xác định bởi Border Gateway Protocol (BGP - Giao thức cổng đường biên). Đó là thuật toán định tuyến quyết định cách gói của bạn sẽ di chuyển ra sao trong mạng lưới, và bạn không thể quyết định tuyến đường được chọn.",
      "Nhưng với một mạng ảo bao gồm hàng trăm relay và trạm dữ liệu trên toàn cầu, chúng tôi cơ bản có thể định tuyến theo cách riêng từ máy khách tới máy chủ trò chơi—và thường là đường tắt nhanh hơn so với cách thông thường. Nếu đang sử dụng Steam Datagram Relay (SDR), lớp phủ Steam sẽ hiển thị thời gian ping và đường định tuyến được chọn cho bạn, vì thế bạn có thể thấy mọi thứ tối ưu ra sao.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Tính năng bắt đầu như một phương pháp để bảo vệ máy chủ Dota đã phát triển vượt xa hơn những gì mong đợi. Mạng lưới SDR định kỳ cung cấp tới 140 triệu gói mạng và 550 GBit dữ liệu mỗi giây. Chúng tôi có relay ở 31 trung tâm dữ liệu với công suất hơn 5 TBit. Hệ thống mang tên Steam Datagram Relay không chỉ bảo vệ khỏi các cuộc tấn công DDoS, mà còn cải thiện kết nối và giảm ping cho từng khách hàng Dota. Không phải mỗi Dota được hàng thơm đâu, mà bất kỳ trò chơi nào trên Steam cũng đều có thể tận dụng nếu muốn.",
      "Hy vọng các đồng đạo ngó qua ngó lại giữa làn đường Dota thật vui. Quả là một vấn đề nặng tính kỹ thuật, cảm ơn vì đã kiên nhẫn! Thoải mái cho chúng tôi biết đề tài bạn muốn chúng tôi đề cập tiếp theo nhé."
    ],
    "commentcount": 278,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 28,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 5433,
    "votedowncount": 295,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1710287207,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 5433,
  "votes_down": 295,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}