{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Mellem lanerne: Nej tak til DDoS-angreb",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684505
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709677787
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mellem lanerne: Nej tak til DDoS-angreb",
    "posttime": 1709684506,
    "updatetime": 1709684506,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Velkommen tilbage til \"Mellem lanerne\" – en blog, hvor vores udviklingsteam snakker om nogle af de udfordringer, fejlrettelser og til tider heldige uheld, som vi støder på i vores arbejde på et spil så unikt som Dota.[/i]",
      "Dette er en historie om internettet, og hvordan det ikke fungerer, som det skal, når det overhovedet fungerer, bortset fra når det ikke gør. Det er en historie om, hvordan internettet holdt op med at fungere for vores kunder, og hvordan vi rettede det.",
      "Internettet er et større vildnis, end vi giver det æren for. Forvilder du dig væk fra din tofaktorgodkendelses sikre rammer og cookies, du har tillid til, kan det være lidt af et vildnis derude, fyldt med tilfældige trolls med onde hensigter om – og i stigende grad dygtighed til – at gøre dit liv temmelig ubehageligt, bare fordi de kan.",
      "Tilbage i 2014 benyttede disse trolls sig af DDoS-angreb (Distributed Denial-of-Service). \"Distribueret\" refererer til et stort antal internetværter, som med onde hensigter oversvømmer en bestemt IP-adresse med trafik for at overbelaste netværkstjenesten. Dette kaldes et volumetrisk angreb, og hensigten er ikke at komme ind i netværket. Blot at prøve at forstyrre tjenesten. Et distribueret denial-of-service-angreb betyder, at legitime brugere, som ønsker at bruge tjenesten, ikke kan komme til det på grund af falsk trafik.",
      "Problemet med DDoS-angreb var, at de sidst i 2014 ikke blev begået af superhackere med en kandidatgrad i datalogi, som forsøgte at udtrække data. De blev begået af stort set alle, som ville betale for en tjeneste eller få en bot til at gøre det for sig. Og det var ret tydeligt hvorfor. Selvom nogle gladeligt gjorde det for hærværkets skyld, havde andre et motiv: Et DDoS-angreb var en bombesikker måde at lukke en kamp ned på, som de selv eller nogen, de heppede på, stod til at tabe. Det var ikke længere bare lejlighedsvis irritation. Det blev til et direkte angreb på alle spil, hvor spillere konkurrerede.",
      "I de første måneder af 2015 oplevede vi en markant stigning i DDoS-angreb på Dota og CS:GO, og andre firmaer meldte også om en voldsom stigning. Nogen havde lige pludselig gjort det meget nemt for alle at udføre dem.",
      "I august 2015 blev The International afbrudt af DDoS-angreb. Selvom de professionelle spillere ikke blev forstyrret, mens de spillede kampene, kunne broadcasterne ikke få adgang til kampene for at kommentere på dem i over to timer. Det blev et problem at lave streamingen som en TV-udsendelse. Spillerne spillede pludselig i et tomrum. Det var en professionel spilbegivenhed med millioner af seere og millioner af dollars på spil, og det blev afbrudt af tilfældige mennesker med software til 40 kroner. Det var et problem, som Valve ikke kunne ignorere.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Vi prøvede flere løsninger for at håndtere DDoS-angreb, før vi kom frem til en, der virkede. Først forsøgte vi at filtrere trafikken med en kraftig netværksafbryder. Men desværre er denne slags filtrering i sig selv vanskelig med spiltrafik. Spilservere er lavet til at modtage uopfordret UDP-trafik (User Datagram Protocol) fra vilkårlige IP-adresser. Forestil dig, at du havde et posthus, som frasorterede uønsket junkmail for dig. Men forestil dig så, at du er brevkasseredaktør og modtager tonsvis af legitim post fra tilfældige fremmede hele tiden. Posthuset ved ikke, hvad der er junkmail for dig, og hvad der ikke er. Det er sådan, at trafik til spilservere plejer at se ud. Kilde-IP-adressen i UDP-pakker er desuden ikke beskyttet og kan nemt forfalskes. Vores posthus kan ikke engang bruge returadressen på kuverten til hjælp, for afsendere af junkmail forfalsker den.",
      "Steam leverer store mængder spilindhold og har bygget et stort netværk til at gøre det.  Vi benyttede os i forvejen af dette netværk til at levere spiltrafik over dedikerede links, som giver god peering og bruger anbefalede netværksmetoder osv. Dette gav spillerne lave pingtider, men beskyttede ikke mod DDoS-angreb. Problemet er, at UDP-protokoller ikke er sikre, så selvom vi havde vores eget netværk, var det ikke privat.",
      "For at forhindre angribere i at bruge vores eget netværk til at angribe vores servere, var vi nødt til at kontrollere alle indgange og sikre dem. Vi opnåede dette ved at oprette proxyer til spiltrafik, som dirigerede hver eneste datapakke, som blev sendt over netværket, gennem relæer. Når en klient ønskede at tale til en spilserver, var den tvunget til at gøre det gennem et relæ, som både godkendte den og videresendte trafikken via en proxy til spilserveren. Dette betød, at serverens IP-adresse altid var skjult, og dermed vidste angriberen aldrig, hvor han skulle angribe.",
      "Tager vi vores forældede posthusmetafor fra tidligere igen, så betød dette, at spammeren ikke længere havde en adresse at sende junkmail til. Spammeren kunne sende det til alle posthuse i området og bede dem om at sende det videre, men uden autorisering vil posthuset ikke gøre det. (Desuden ville posthuset synes, at det var lidt mistænkeligt, at nogen forsøgte at sende 100.000 breve til én enkelt person).",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Men kunne man ikke bare angribe relæet? Teknisk set, jo. Men vi har stort set et ubegrænset antal af dem, og vi har lavet dem, så de kan modstå angreb. Et \"relæ\" er bare et andet ord for en computer, som kører software. Man kan angribe det eller tage det offline, men protokollen er designet ud fra denne antagelse. Hvis en klient prøver på at spille et spil og mister kontakten med et relæ, så skifter den bare til et andet. Relæer er som hundredvis af brikker, der er spredt rundt om i verden med det eneste formål at beskytte spilserveren. (Det er i øvrigt sværere at tage et relæ ud af drift, end det lyder. De er designet ret godt og placeret i en bestemt del af netværket, så selvom de er bygget til at blive taget offline, har vi ikke mistet et endnu).",
      "Løsningen var ligetil, men effektiv. Hvis nogen ønskede at forstyrre en kamp før dette, skulle de bare overmande en enkelt spilserver (hvilket var ret nemt). Men nu skulle de dybest set overmande et helt datacenter, så det blev meget, meget, meget sværere. Findes der angreb, som stadigvæk ville kunne opnå dette? Selvfølgelig. Er der angreb, som kunne gøre dette, som enhver ville kunne købe for 40 kroner? Nej. De fleste mennesker ville ikke have råd til at udføre et så sofistikeret angreb.",
      "Efter dette nye system kom op at køre, fik vi en åbenbaring: Hvis vi kontrollerede vores eget private netværk, ville vi ikke være bundet af, hvordan det normale internet fungerer. Vi kunne bruge det til at gøre kundeoplevelsen endnu bedre. Når man sender en pakke fra en IP-adresse til en anden på det normale internet, bestemmes ruten, som bruges, af Border Gateway Protocol (BGP). Dette er en routingalgoritme, som bestemmer, hvordan en pakke skal rejse på tværs af netværket, og man kan ikke selv vælge, hvilken rute den tager.",
      "Men med et virtuelt privat netværk bestående af hundredvis af globale relæer og datacentre kunne vi dybest set vælge vores egen rute fra klienten til spilserveren – og ofte en hurtigere genvej end standardruten. Hvis du bruger Steam Datagram Relay (SDR), viser vi din pingtid, og hvilken rute vi giver dig, så du selv kan se, hvordan det bliver optimeret.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "En funktion, som startede som en måde at beskytte Dota-spilservere på, har udviklet sig til meget mere, end nogen kunne have forestillet sig. SDR-netværket leverer rutinemæssigt op til 140 millioner pakker og 550 gigabit pr. sekund. Vi har relæer i 31 datacentre med en kapacitet på over 5 terabit. Det, vi nu kalder Steam Datagram Relay, beskytter ikke kun mod DDoS-angreb, men giver også en stærkere forbindelse og sænker pingtiderne for alle Dota-spillere. Og dette gælder ikke kun for Dota, men for alle spil på Steam, som ønsker at bruge det.",
      "Vi håber, du også kunne lide dette kig bag kulisserne i Dota. Det var et ret teknisk indlæg – tak for, at du hang på! Fortæl os endelig, hvad du kunne tænke dig, at vi dækker næste gang."
    ],
    "commentcount": 3,
    "tags": [],
    "language": 13,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1709684517,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}