{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Nas Entretrilhas: negando a negação de serviço",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Nas Entretrilhas: negando a negação de serviço",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Bem-vindos de volta à série [b]Nas Entretrilhas[/b], na qual membros da nossa equipe de desenvolvimento falam dos desafios, correções de erros e ocasionais \"acidentes felizes\" que ocorrem no desenvolvimento de um jogo único como o Dota.[/i]",
      "Isso é uma história sobre a internet e como ela não funciona como deveria, e como ela funciona, exceto quando não funciona. É uma história sobre como a internet parou de funcionar para os nossos jogadores, e como corrigimos isso.",
      "A internet é um ambiente mais selvagem do que costumamos imaginar. Basta se distanciar um pouco da segurança da identificação em duas etapas e cookies confiáveis para começar a parecer uma terra sem lei — cheia de [i]trolls[/i] aleatórios com o desejo (e uma crescente habilidade) de perturbar a vida alheia, simplesmente porque podem.",
      "Em 2014, essas pessoas costumavam usar o método de ataques distribuídos de negação de serviço (DDoS). \"Distribuídos\" refere-se à grande quantidade de requisições feitas a um endereço IP específico, na tentativa maliciosa de sobrecarregar a rede. Isso é conhecido como ataque volumétrico, e a intenção não é tentar entrar na rede — mas sim negar o serviço. Um ataque distribuído de negação de serviço faz com que usuários legítimos sejam \"expulsos\" pelo grande fluxo de tráfego prejudicial.",
      "O problema dos ataques DDoS era que, no final de 2014, eles não estavam sendo cometidos por hackers perigosos com formação avançada em ciência da computação. Eles eram cometidos por qualquer pessoa que quisesse pagar um serviço ou bot para fazer isso. E o motivo é óbvio. Embora algumas pessoas se deleitassem com o puro vandalismo, outras tinham motivos mais claros: um ataque DDoS era um jeito infalível de acabar com uma partida que você ou alguém que você torcia estivesse perdendo. E não era mais uma irritação ocasional. Estava se tornando um ataque direto presente em qualquer jogo on-line.",
      "No início de 2015, observamos um grande aumento nos ataques DDoS no Dota e no CS:GO, e outras companhias relatavam o mesmo problema. Alguém conseguiu, de repente, facilitar o processo para qualquer pessoa.",
      "Em agosto de 2015, o International foi afetado por ataques DDoS. Embora os jogadores não tenham sido afetados, a equipe de transmissão passou mais de duas horas sem conseguir entrar nas partidas para fazer comentários e análises mais precisas. Fazer o evento como uma transmissão televisiva tornou-se um problema. De repente, os jogadores estavam jogando às escuras. Era um evento de eSports profissional assistido por milhões de pessoas e com uma premiação de milhões de dólares — e ele estava sendo interrompido por pessoas aleatórias usando programas de vinte reais. Era um problema que não podia ser ignorado pela Valve.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Tentamos várias soluções para lidar com ataques DDoS até chegarmos em uma que funcionou. Inicialmente, tentamos filtrar o tráfego com um switch de rede poderoso. Infelizmente, esse tipo de filtragem é inerentemente complicado no contexto de tráfego de jogo. É da natureza dos servidores de jogos receber tráfego UDP (Protocolo de Datagrama do Usuário) não solicitado de endereços IP aleatórios. Imagine que existe um correio enviando correspondências indesejadas para a sua casa de forma incessante. Agora, imagine que você trabalha com aconselhamento e, portanto, recebe várias cartas legítimas de desconhecidos aleatórios o tempo inteiro. Os correios simplesmente não sabem o que é indesejado ou não para você. É assim que o tráfego em servidores de jogos costuma funcionar. Além disso, o protocolo UDP não exige a determinação do endereço IP original, e pode ser facilmente falsificado. Os nossos correios não podem nem olhar o endereço de devolução no envelope em busca de pistas, pois os remetentes forjam essa informação.",
      "O Steam entrega muitos bits de conteúdo, o que acabou construindo uma grande rede.  Nós já estávamos aproveitando essa rede para entregar o tráfego de jogos usando links dedicados, obtendo boas conexões, garantindo o uso de boas práticas de engenharia de rede, entre outros. Isso mantinha a latência dos usuários baixa, mas não protegia contra ataques DDoS. O problema é que protocolos UDP não são seguros, então embora tivéssemos a nossa própria rede, ela não era privada.",
      "Para impedir que invasores usassem a nossa própria rede para atacar os nossos servidores, precisávamos controlar e proteger todas as entradas. Alcançamos esse objetivo com a criação de [i]proxies[/i] para o tráfego de jogo, encaminhando todos os pacotes de dados na rede por meio de retransmissores. Agora, quando um cliente desejava conversar com o servidor de jogo, ele era processado de forma a autenticá-lo e reencaminhá-lo para o servidor. Dessa forma, o endereço IP do servidor estava sempre oculto — o atacante não conseguia descobrir o que atacar.",
      "Para voltarmos à nossa metáfora antiquada sobre os correios, o nosso malfeitor não tinha mais um endereço para onde enviar as suas besteiras. Ele podia ir a todos os correios da área e pedir para fazer o envio — mas, sem autorização, os correios não fariam isso (além disso, certamente achariam estranho alguém tentando enviar 100 mil cartas para a mesma pessoa).",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Mas você não podia simplesmente atacar o retransmissor? Tecnicamente, sim. Mas nós temos basicamente uma infinidade deles, e nós os construímos para resistir a ataques. Um \"retransmissor\" é apenas outra palavra para um computador usando programas. Você pode atacá-lo ou tirá-lo do ar, mas o protocolo foi projetado com isso em mente. Se um cliente está tentando jogar e perde contato com um retransmissor, ele simplesmente muda para outro. Retransmissores são como centenas de peões espalhados pelo mundo com o único objetivo de proteger o servidor de jogo (inclusive, derrubar um retransmissor é mais difícil do que parece — eles foram muito bem construídos e posicionados em uma área específica da rede, então embora tenham sido construídos para serem tirados do ar, ainda não perdemos nenhum).",
      "A solução foi muito simples, mas eficaz. Antes, caso alguém quisesse atrapalhar uma partida, bastava \"derrotar\" um único servidor de jogo (um obstáculo bem simples). Agora, seria preciso derrotar praticamente o [i]data center[/i] inteiro — um obstáculo bem maior. Isso é possível? Claro. Isso é possível e qualquer pessoa pode comprar por vinte reais? Não. Um ataque com esse nível de sofisticação estava oficialmente fora do alcance monetário da maioria das pessoas.",
      "Com esse novo sistema em funcionamento, tivemos uma epifania: caso nós controlássemos a nossa própria rede privada, não seríamos reféns do funcionamento da internet normal. Poderíamos usá-la para aprimorar ainda mais a experiência dos usuários. Com a internet normal, quando você envia um pacote de um endereço IP para outro, a rota usada é determinada pelo protocolo de roteamento BGP. Esse algoritmo de rotas decide como o seu pacote será transportado pela rede, e você não tem controle sobre a rota escolhida.",
      "Com uma rede virtual privada composta de centenas de retransmissores e data centers ao redor do mundo, nós podemos escolher a nossa própria rota entre o cliente e o servidor de jogo — geralmente um caminho mais rápido que a rota padrão. Caso você esteja usando a rede de retransmissão de datagramas do Steam (SDR), o Painel Steam exibe a sua latência e a rota definida, para que você possa conferir a otimização.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Um recurso que começou como uma forma de proteger os servidores de jogo do Dota cresceu além do que qualquer um podia imaginar. Rotineiramente, a rede da SDR entrega o equivalente a 140 milhões de pacotes e 550 gigas por segundo. Temos retransmissores em 31 data centers, com uma capacidade de mais de 5 terabytes. O que agora chamamos de rede de retransmissão de datagramas do Steam não protege apenas contra ataques DDoS, mas também aumenta a conectividade e reduz a latência para cada jogador de Dota. Aliás, para qualquer jogo no Steam que queira usá-lo.",
      "Esperamos que tenham gostado de dar outra olhadinha entre as trilhas do Dota. Essa foi bem técnica, mas obrigado por acompanhar! E fique à vontade para nos dizer o que gostaria de ver na próxima edição."
    ],
    "commentcount": 278,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 5433,
    "votedowncount": 295,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1710287207,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 5433,
  "votes_down": 295,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}