{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Entre as Lanes: Negar a negação de serviço",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Entre as Lanes: Negar a negação de serviço",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Estamos de volta para mais um \"Entre as Lanes\", a crónica do blog do Dota 2 onde os membros da nossa equipa de desenvolvimento descrevem alguns dos desafios, correções de bugs e ocasionais \"acidentes felizes\" com que nos deparamos quando trabalhamos num jogo tão distinto como o Dota 2.[/i]",
      "Esta é uma história sobre a internet e sobre como não funciona da forma pretendida, quando funciona sequer, exceto quando não funciona. É uma história sobre como a internet parou de funcionar para os nossos utilizadores e como corrigimos o problema.",
      "A internet pode ser muito mais do que uma \"terra de ninguém\". Basta que te afastes da segurança da autenticação de dois fatores e dos cookies de confiança para chegares a território inexplorado, cheio de trolls maliciosos e cada vez mais capazes de tornar a tua vida bastante miserável, só porque podem.",
      "Em 2014, o método que estes trolls usavam era através de ataques distribuídos de negação de serviço (\"distributed denial of service\", ou DDoS). \"Distribuídos\" aqui refere‑se a quando um grande número de utilizadores da internet congestiona maliciosamente com tráfego um endereço IP específico, como tentativa de sobrecarregar a pilha de rede. Isto é chamado de ataque volumétrico e a intenção não é tentar entrar na rede, mas sim tentar negar o serviço. Um ataque distribuído de negação de serviço faz com que utilizadores legítimos sejam \"expulsos\" pelo tráfego prejudicial.",
      "O problema dos ataques DDoS era que, no final de 2014, não estavam a ser cometidos por super‑piratas informáticos doutorados em ciência da computação avançada. Na verdade, qualquer pessoa podia pagar por um serviço que usaria bots para cometer esses ataques. E é bastante óbvio porquê. Embora algumas pessoas o fizessem apenas por puro vandalismo, outras tinham um motivo: um ataque DDoS era uma forma infalível de cancelar uma partida que tu ou a tua equipa favorita estivessem a perder. Já não era apenas uma inconveniência ocasional. Estava a tornar-se um ataque direto contra qualquer partida onde os jogadores competissem.",
      "Nos primeiros meses de 2015, observámos um grande aumento no número de ataques DDoS no Dota 2 e no CS:GO, com outras empresas a relatar também um surto considerável de ataques. Alguém conseguiu, de repente, facilitar o processo para qualquer pessoa.",
      "Em agosto de 2015, o International foi destabilizado por ataques DDoS. Embora os profissionais não tenham sido afetados enquanto jogavam as partidas, os comentadores estiveram mais de duas horas sem poder aceder às partidas para acompanhar e relatar a ação em tempo real. Fazer stream como uma transmissão televisiva passou a ser um problema. De um momento para o outro, os jogadores estavam a jogar num vácuo. Este era um evento de e-sports profissional, com milhões de espectadores e milhões de dólares em jogo, e estava a ser destabilizado por desconhecidos com programas que custavam menos de cinco euros. Era um problema que a Valve não podia ignorar.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Experimentámos várias soluções para lidarmos com ataques DDoS antes de chegarmos a uma que funcionasse. Ao início, tentámos filtrar o tráfego com um potente switch de rede. Infelizmente, este tipo de filtragem é muito difícil de usar no contexto de tráfego de jogos. Está na natureza dos servidores de jogos receber tráfego UDP (\"User Datagram Protocol\") não solicitado de endereços IP arbitrários. Imagina que o posto dos correios da tua área filtra correio indesejado por ti. Agora imagina que trabalhas para uma revista onde respondes a perguntas de leitores e estás sempre a receber cartas legítimas de estranhos. Os correios não vão saber quais são as cartas que consideras legítimas e quais não são. É assim que o tráfego para servidores de jogos costuma parecer. Além disso, o protocolo UDP não requer que o endereço IP original seja confirmado, permitindo que este seja facilmente falsificado. O tal posto dos correios do nosso exemplo não pode sequer verificar o endereço de devolução no envelope para ter uma ideia do que fazer, porque os remetentes falsificam essa informação.",
      "O Steam entrega muitos bits de conteúdo, o que levou à criação de uma grande rede.  Já estávamos a tirar partido desta rede para entregar tráfego de jogos através de links dedicados, obtendo boas ligações, garantindo o uso de boas práticas de engenharia de rede, etc. Esta rede mantinha baixo o ping dos utilizadores, mas não protegia contra ataques DDoS. O problema é que protocolos UDP não são seguros. Apesar de termos a nossa própria rede, não era privada.",
      "Para impedir que a nossa própria rede fosse usada para atacar os nossos servidores, tornou‑se necessário controlar e proteger todas as entradas. Alcançámos este objetivo ao criar proxies para o tráfego do jogo, encaminhando cada pacote de dados transmitido pela rede através de retransmissores. Assim, quando um cliente precisasse de comunicar com um servidor do jogo, teria de o fazer através de um retransmissor que o iria autenticar e reencaminhar esse tráfego por um proxy para o servidor. Como resultado, o endereço IP do servidor estaria sempre oculto: um atacante simplesmente não fazia ideia do que atacar.",
      "Voltando à nossa metáfora antiquada do posto dos correios: agora, o atacante já não tinha um endereço para onde enviar lixo postal. Podia enviá‑lo para todos os correios da zona e pedir que o entregassem, mas, sem autorização, os correios não o fariam (já para não falar que os correios iriam achar estranho alguém a tentar enviar 100 000 cartas para uma só pessoa).",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "\"Mas não é possível que ataquem o retransmissor?\" Tecnicamente, sim. Contudo, na prática, temos um número ilimitado de retransmissores que foram concebidos para serem atacados. Um \"retransmissor\" é só outra palavra para um computador que está a executar software. Pode ser atacado ou ficar offline, mas o protocolo foi projetado com isso em mente. Se um cliente estiver a tentar jogar um jogo e perder contacto com um retransmissor, simplesmente muda para outro. Os retransmissores são como centenas de peões de xadrez espalhados pelo mundo com o único objetivo de defender o servidor do jogo. (Além disso, é muito difícil para um atacante desativar um retransmissor. Foram muito bem projetados e posicionados numa parte específica da rede, então, apesar de terem sido concebidos para serem atacados, ainda não perdemos um.)",
      "A solução foi simples, mas eficaz. Antes, se alguém quisesse interferir com uma partida, era uma simples questão de sobrecarregar um único servidor de jogo (um obstáculo fácil de ultrapassar). Agora, era preciso sobrecarregar todo o centro de dados, um obstáculo muito, muito, muito maior. Existem ataques capazes de o fazer? Sim, claro. Existem ataques capazes de o fazer e ao alcance de qualquer pessoa com cinco euros no bolso? Não. Um ataque com este nível de sofisticação está definitivamente fora do orçamento da maioria das pessoas.",
      "Com este novo sistema em vigor, tivemos uma epifania: se controlássemos a nossa própria rede privada, não estaríamos limitados ao funcionamento da internet normal. Podíamos usá‑la para melhorar ainda mais a experiência dos utilizadores. Na internet normal, quando se envia um pacote de um endereço IP para outro, a rota usada é determinada pelo Border Gateway Protocol (BGP), um algoritmo de encaminhamento que decide como é que o pacote será transportado por uma rede, e não é possível definir a rota escolhida.",
      "No entanto, com uma rede virtual privada composta de centenas de retransmissores e centros de dados globais, podíamos basicamente escolher a nossa rota entre o cliente e o servidor do jogo (muitas vezes, um caminho mais rápido do que a rota normal). Se estiveres a usar o Steam Datagram Relay (SDR), o Painel Steam irá exibir o teu ping e a rota que te foi atribuída, para que possas verificar a otimização.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Uma funcionalidade que começou como uma forma de proteger os servidores de jogo do Dota 2 cresceu para além de todas as expectativas. A rede do SDR entrega, regularmente, tanto quanto 140 milhões de pacotes de dados e 550 gigabits por segundo. Temos retransmissores em 31 centros de dados com uma capacidade superior a 5 terabits. O que hoje chamamos de Steam Datagram Relay não só protege contra ataques DDoS, como também aumenta a conectividade e reduz o ping de todos os jogadores de Dota 2. Além disso, não o faz apenas para o Dota 2, mas sim para qualquer jogo no Steam que queira usufruir deste recurso.",
      "Esperamos que tenhas desfrutado de mais uma espreitadela entre as lanes do Dota 2. Foi um post muito técnico desta vez, obrigado por nos teres acompanhado! Não te esqueças de nos dizer o que gostarias que abordássemos na próxima edição."
    ],
    "commentcount": 278,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 5433,
    "votedowncount": 295,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1710287207,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 5433,
  "votes_down": 295,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}