{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "În spatele culoarelor: blocarea blocării serviciului",
  "event_type": 28,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "În spatele culoarelor: blocarea blocării serviciului",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Bine ai revenit la rubrica „Din spatele culoarelor” din cadrul blogului nostru, unde echipa noastră de dezvoltare prezintă unele dintre provocările, remedierile de erori și ocazionalele accidente fericite pe care le-am întâmpinat în timp ce lucram la un joc atât de unic precum Dota.[/i]",
      "În această postare vom vorbi despre internet și despre momentele în care nu funcționează așa cum ar trebui, nu funcționează deloc și când funcționează. Este vorba despre modul în care internetul a încetat să funcționeze pentru clienții noștri și cum am rezolvat această problemă.",
      "Internetul este o junglă mult mai sălbatică decât ne-am putea imagina. Dacă te abați de la căile sigure ale identificării cu doi factori și a cookie-urilor de încredere, vei ajunge într-un mediu sălbatic, în care trolii cu intenții rele pândesc peste tot și doresc să îți facă viața un calvar.",
      "În 2014, metodele folosite de acești troli constau în atacuri de tip DDoS (blocarea distribuită a serviciului), în care un număr mare de dispozitive conectate la internet generau cu rea intenție un trafic ridicat asupra unei anumite adrese IP pentru a suprasolicita rețeaua. Acesta este un atac de tip volumetric, iar intenția nu este aceea de a accesa rețeaua. Scopul unui astfel de atac este de a bloca serviciul. O blocare distribuită a serviciului împiedică astfel persoanele legitime să utilizeze serviciul, deoarece acesta este supraîncărcat cu trafic inutil.",
      "Problema atacurilor DDoS a fost că, până la sfârșitul anului 2014, acestea nu erau realizate de super-hackeri cu studii avansate în informatică. Aceste atacuri puteau fi realizate de aproape oricine era dispus să plătească un serviciu sau un bot să realizeze acest lucru, iar motivul este unul destul de evident. Deși unii o făceau pur și simplu de dragul vandalismului, alții aveau un motiv pentru aceste tipuri de atacuri: un atac DDoS reprezenta o modalitate sigură prin care puteau opri un meci în care aceștia sau favoriții lor pierdeau. Ajunsese să nu mai fie vorba doar de un moment ocazional de iritare. Totul se transforma efectiv într-un atac direct asupra oricărui meci în care jucătorii concurau.",
      "În primele luni ale anului 2015, am sesizat o creștere semnificativă a atacurilor DDoS asupra serverelor de Dota și CS:GO, iar alte companii au semnalat și ele o astfel de creștere a atacurilor. Cineva a reușit brusc să faciliteze acest proces pentru toată lumea.",
      "În 2015, campionatul The International a fost perturbat de atacurile DDos. Deși jucătorii profesioniști nu au fost afectați pe parcursul meciurilor, comentatorii nu au avut acces timp de mai bine de două ore la meciuri pentru a le putea relata spectatorilor în timp real ce se întâmpla în cadrul meciurilor. Difuzarea evenimentului sub forma unui program de televiziune s-a dovedit o problemă. Jucătorii au luptat într-o liniște deplină. Acesta era un eveniment cu jucători profesioniști, urmărit de milioane de spectatori, în care milioane de dolari se aflau în joc, dar care a ajuns să fie întrerupt de diverse persoane cu programe software de doi lei. Aceasta a fost o problemă pe care Valve nu o putea ignora.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Am încercat mai multe soluții pentru a combate atacurile DDoS înainte de a ajunge la una care s-a dovedit a fi eficientă. Inițial, am încercat să filtrăm traficul cu ajutorul unui switch de rețea puternic. Din păcate, acest tip de filtrare este dificil de aplicat asupra traficului jocurilor. Este normal ca serverele de joc să primească trafic nesolicitat de la adrese IP arbitrare prin UDP (protocolul datagramelor utilizator). Imaginează-ți un oficiu poștal care sortează pentru tine trimiterile poștale nesolicitate. Iar acum imaginează-ți că ești un jurnalist care are o rubrică de sfaturi și că primești tot timpul o mulțime de scrisori legitime de la persoane necunoscute. Dar oficiul poștal nu știe care sunt trimiterile nesolicitate și care nu. Cam așa arată traficul pentru serverele de joc. Mai mult decât atât, IP-ul sursă al pachetelor UDP nu este securizat și poate fi falsificat cu ușurință. Oficiul nostru poștal nici măcar nu se poate orienta după adresa expeditorului pentru indicii, pentru că cei care trimit mesaje nesolicitate pot falsifica și asta.",
      "Steam trimite un volum mare de biți pentru conținutul jocurilor sale, iar pentru a face acest lucru, a dezvoltat o rețea vastă.  La acea vreme ne foloseam deja de această rețea pentru a direcționa traficul jocurilor prin intermediul unor legături dedicate, pentru a oferi conexiuni bune, pentru a ne asigura că sunt aplicate cele mai bune pratici în domeniul ingineriei de rețea etc. Asta le-a permis jucătorilor să aibă un ping mic, însă nu a asigurat protecția împotriva atacurilor DDoS. Problema rezidă în faptul că protocoalele UDP nu sunt sigure, astfel că, deși aveam propria noastră rețea, aceasta nu era privată.",
      "Pentru a împiedica atacatorii să se folosească de propria noastră rețea pentru a ne ataca serverele, trebuia să controlăm toate intrările și să le securizăm. Am realizat acest lucru prin crearea de proxy-uri pentru traficul de joc, redirecționând fiecare pachet de date trimis în rețea prin relee. Acum, când un client dorea să comunice cu un server de joc, trebuia să realieze acest lucru prin intermediul unui releu care îl autentifica și transmitea traficul către serverul de joc prin intermediul proxy-ului. Cu alte cuvinte, adresa IP a serverului era întotdeauna ascunsă, iar atacatorul pur și simplu nu avea idee unde să atace.",
      "Pentru a reutiliza metafora de mai devreme cu oficiul poștal, persoanele care făceau spam nu mai aveau o adresă către care să trimită mesaje nedorite. Ar putea să le trimită către toate oficiile poștale din regiune și să le ceară să le expedieze, dar, fără autorizare, oficiul poștal nu le poate livra. (În plus, oficiul poștal ar considera puțin suspect faptul că cineva ar încerca să trimită unei singure persoane 100.000 de scrisori.)",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Dar nu ai putea lansa pur și simplu un atac asupra releului? Din punct de vedere tehnic, ai putea. Dar avem un număr practic nelimitat de relee și le-am conceput pentru a fi atacate. Un „releu” este doar un alt termen pentru un computer pe care rulează un software. Îl poți ataca sau scoate din funcțiune, dar protocolul a fost conceput în acest sens. Dacă un client încearcă să joace un meci și pierde contactul cu un releu, atunci va fi comutat la un altul. Releele sunt ca sute de pioni împrăștiați în întreaga lume cu scopul unic de a păzi serverul de joc. (De altfel, compromiterea unui releu este mai dificilă decât pare. Acestea sunt proiectate destul de bine și poziționate într-o parte specifică a rețelei, așa că, deși au fost create pentru a fi atacate, nu am pierdut până acum vreunul.)",
      "Soluția a fost simplă, dar eficientă. Înainte, dacă cineva dorea să perturbeze un meci, trebuia doar să suprasolicite un singur server de joc (un prag redus, ușor de depășit). Acum trebuie însă să suprasolicite, în esență, întregul centru de date, ceva ce este cu mult mai greu de realizat. Există atacuri care ar putea realiza acest lucru? Bineînţeles. Există atacuri capabile de așa ceva, care să fie accesibile oricui în schimbul unei sume modice? Nu. Un atac atât de sofisticat nu se încadrează deloc în posibilitățile financiare a majorității oamenilor.",
      "Cu acest nou sistem pus în funcțiune, am avut o revelație: dacă am deține controlul asupra propriei rețele private, nu am fi dependenți de modul în care funcționează internetul normal. Ne-am putea folosi de asta pentru a îmbunătăți și mai mult experiența clienților. Cu internetul normal, atunci când trimiți un pachet de la o adresă IP la alta, ruta utilizată este determinată de Border Gateway Protocol (BGP). Acesta este un algoritm de direcționare care decide modul în care pachetul tău de date va călători într-o rețea și nu poți influența ruta aleasă de acesta.",
      "Dar, cu o rețea privată virtuală compusă din sute de relee și centre de date la nivel mondial, ne-am putea alege în esență propria rută de la client către serverul de joc, aceasta fiind adesea mai rapidă decât ruta implicită. Dacă folosești Steam Datagram Relay (SDR), interfața suprapusă Steam îți va afișa pingul și ruta pe care o folosești, astfel încât să poți vedea cum funcționează optimizarea.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "O caracteristică gândită inițial ca o modalitate de a proteja serverele de joc Dota a evoluat dincolo de așteptări. Rețeaua SDR transmite în mod obișnuit până la 140 de milioane de pachete și 550 de gigabiți pe secundă. Avem relee în 31 de centre de date cu o capacitate de peste 5 terabiți. Ceea ce numim acum Steam Datagram Relay nu numai că protejează rețaua împotriva atacurilor DDoS, dar crește și conectivitatea și scade pingul pentru fiecare jucător de Dota. Iar asta nu e valabil doar pentru Dota, ci pentru orice joc de pe Steam care dorește să profite de această caracteristică.",
      "Sperăm că ți-a plăcut să arunci o altă privire în spatele culoarelor din Dota. Acesta a fost un articol destul de tehnic și îți mulțumim că l-ai citit în întregime! Și nu ezita să ne spui ce subiect ai dori să abordăm în ediția viitoare."
    ],
    "commentcount": 313,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 7705,
    "votedowncount": 475,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1715113657,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7705,
  "votes_down": 475,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}