{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Kulvarlar Arası: Hizmet Dışı Bırakma Saldırılarını Önlemek",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Kulvarlar Arası: Hizmet Dışı Bırakma Saldırılarını Önlemek",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Kulvarlar Arası'na tekrar hoş geldiniz. Bu blogumuzda, geliştirici ekibimiz Dota gibi eşsiz bir oyun üzerinde çalışırken karşılaştıkları bazı zorluklardan, hata düzeltmelerinden ve mutlu kazalardan bahsedecek.[/i]",
      "Bugün size internetin nasıl çalışması gerektiği zaman çalışmadığı ve çalıştığı hâlde çalışmaması gerektiği hakkında bir hikâye anlatacağız. Bu internetin müşterilerimiz için nasıl çalışmayı bıraktığının ve bunu nasıl çözdüğümüzün hikâyesidir.",
      "İnternet düşündüğümüzden çok daha vahşidir. İki faktörlü kimlik doğrulamanızın ve güvendiğiniz çerezlerin güvenli sınırlarından uzaklaşırsanız, ortalık biraz vahşileşebilir. Kötü niyetli ve giderek daha fazla beceriye sahip rastgele trollerle dolu olabilir ve sırf yapabildikleri için hayatınızı oldukça rahatsız edebilirler.",
      "2014 yılında bu trollerin kullandığı yönteme dağıtık hizmet dışı bırakma (DDoS) saldırıları dendi. \"Dağıtık\" kelimesi çok sayıda bilgisayarın, çalıştırılan hizmeti veya ağı devre dışı bırakmak amacıyla hedef IP adresini isteklerle doldurması anlamına gelmektedir. Buna hacimsel saldırı denir ve amaç ağa sızmaya çalışmak değildir. Sadece hizmet dışı bırakmaya çalışmaktır. Dağıtık hizmet dışı bırakma saldırısı, hizmeti kullanmak isteyen meşru kullanıcıların sahte trafik nedeniyle hizmete erişemeyeceği anlamına gelir.",
      "DDoS saldırılarıyla ilgili sorun, 2014'ün sonlarında, bilgisayar bilimleri alanında yüksek lisans derecesine sahip, veri madenciliği yapmaya çalışan süper bilgisayar korsanları tarafından yapılmamasıydı. Bunu kendileri için yapacak bir hizmete veya bota para ödemeye istekli olan hemen hemen herkes bunu yapabilir. Ve nedeni oldukça açık. Bazıları bunu vandalizm uğruna keyifli bir şekilde yaparken diğerlerinin bir nedeni vardı: DDoS saldırısı, kendilerinin veya destekledikleri birinin kaybetmek üzere olduğu bir maçı durdurmanın kati bir yoluydu. Ve artık sadece ara sıra yaşanan bir rahatsızlık değildi. Oyuncuların yarıştığı tüm oyunlara doğrudan saldırı hâline geldi.",
      "2015'in ilk aylarında Dota ve CS:GO'ya yönelik DDoS saldırılarında önemli bir artış gördük ve diğer şirketler de keskin bir artış bildirdi. Bazıları aniden herkesin bunu yapmasını çok kolaylaştırdı.",
      "2015 yılının Ağustos ayında The International'da DDoS saldırıları nedeniyle kesintiye uğradı. Maçı oynayan profesyonel oyuncular bundan etkilenmese de yorumcular iki saatten fazla bir süre boyunca sunuculara bağlanıp işlerini yapamadılar. Yayını herkese sunmak sorun olmaya başladı. Oyuncular aniden boşlukta oynamaya başladılar. Bu milyonlarca izleyicinin ve milyonlarca doların söz konusu olduğu profesyonel bir oyun etkinliğiydi ve rastgele kişiler tarafından beş dolarlık yazılımla kesintiye uğradı. Bu Valve'ın görmezden gelemeyeceği bir problemdi.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "İşe yarayan bir tanesinde karar kılmadan önce DDoS saldırılarıyla başa çıkmak için çeşitli çözümler denedik. Öncelikle güçlü bir ağ anahtarıyla trafiği filtrelemeye çalıştık. Ne yazık ki, oyun trafiğinde bu tür bir filtreleme doğası gereği zordur. Oyun sunucuları, rastgele IP adreslerinden istenmeyen Kullanıcı Veri Bloğu İletişim Kuralları (UDP) trafiğini alacak şekilde tasarlanmıştır. İstenmeyen postaları sizin için ayıklayan bir postaneniz olduğunu hayal edin. Şimdi de bir tavsiye köşe yazarı olarak olduğunuzu ve sürekli olarak rastgele yabancılardan düzenli postalar aldığınızı hayal edin. Postane, sıradan postalarla istenmeyen postalar arasındaki farkı bilemez. Oyun sunucularına giden trafik genellikle böyle görünür. Ayrıca, UDP paketlerindeki kaynak IP güvenli değildir ve kolaylıkla sahtekârlığa maruz kalabilir. Postanemiz bunu anlayabilmek için zarfın üzerindeki iade adresine bile bakamıyor çünkü bu istenmeyen postaları gönderenler sahte adres giriyor.",
      "Steam, oyun içerikleri için çok sayıda bit sağlıyor ve bu amaçla geniş bir ağ kurmuş durumda.  Oyun trafiğini özel bağlantılar üzerinden yönlendirmek, iyi bir eşleme sağlamak, en iyi ağ mühendisliği uygulamalarının kullanılmasını sağlamak vb. konularda bu ağa zaten büyük ölçüde güveniliyordu. Bu, oyuncuların ping sürelerini düşük tuttu ancak DDoS saldırılarına karşı koruma sağlamadı. Sorun şu ki, UDP protokolleri güvenli değil, dolayısıyla kendi ağımız olmasına rağmen özel değildi.",
      "Saldırganların kendi ağımızı kullanarak sunucularımıza saldırmasını önlemek için tüm girişleri kontrol etmemiz ve güvence altına almamız gerekiyordu. Bunu, oyun trafiği için ağ üzerinden iletilen her veri paketinin aktarma aracılığıyla yönlendirilmesine olanak tanıyan proxy'ler oluşturarak başardık. Bir istemci bir oyun sunucusuyla iletişime geçmek istediğinde, bunu hem kimliğini doğrulayan hem de trafiği oyun sunucusuna proxy yoluyla yönlendiren bir aktarma yoluyla yapmak zorundaydı. Yani, sunucunun IP adresi her zaman gizliydi. Bu nedenle saldırgan tam olarak nereye saldıracağını bilmiyordu.",
      "Postane örneğimizi tekrar kullanacak olursak, saldırganın artık istenmeyen posta göndereceği bir adres yoktu. Postayı bölgedeki tüm postanelere gönderip postalamalarını isteyebilir, ancak postaneler herhangi bir izin olmadan bunu yapmaz. (Ayrıca postaneler, birisinin tek bir kişiye 100.000 mektup göndermeye çalışmasını da biraz şüpheli bulacaktır.)",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Ama aktarıcıya saldıramazlar mı? Bu, teknik olarak mümkün. Ancak sınırsız sayıda aktarım mevcut ve saldırılara karşı dayanıklı olacak şekilde tasarlandılar. \"Aktarıcı\", yazılımı çalıştıran bilgisayarı tanımlamak için kullanılan bir terimdir. Bu aracıya saldırabilir veya çevrimdışı hâle getirebilirler, ancak protokol bu senaryolara göre tasarlanmıştır. Bir istemci oyun oynamaya çalışırken bir aktarmayla bağlantısı kesilirse, başka bir aktarmaya geçer. Aktarmalar, tek amacı oyun sunucusunu korumak olan, dünyanın dört bir yanına dağılmış yüzlerce piyon gibidir. (Ayrıca, aktarıcıları devre dışı bırakmak göründüğünden daha zordur. Oldukça iyi tasarlanmışlar ve ağın belirli bir bölümüne yerleştirilmişler, dolayısıyla devre dışı bırakılacak şekilde tasarlanmış olmalarına rağmen henüz bir tanesini bile kaybetmedik.)",
      "Çözüm basit ama etkiliydi. Önceden, birisi bir oyunu bozmak istediğinde tek bir oyun sunucusuna aşırı yükleme yapması yetiyordu (Bu oldukça kolaydı). Artık tüm veri merkezine aşırı yükleme yapması gerekiyor, ki bu hiç de kolay değil! Bunu başarabilecek saldırılar var mı? Tabii ki. Bunu internetten beş dolara satın alınabilecek araçlarla yapabilecek saldırılar var mı? Hayır. Böylesine karmaşık bir saldırı şüphesiz çoğu kişi için çok pahalıydı.",
      "Bu yeni sistem faaliyete geçtikten sonra bir şey fark ettik: Kendi özel ağımızı kontrol edersek, internetin normal işleyişle sınırlı kalmak zorunda olmayız. Bunu müşteri deneyimini daha da geliştirmek için kullanabiliriz. Normal internette bir IP adresinden diğerine paket gönderdiğinizde kullandığınız yol, Sınır Ağ Geçidi Protokolü (BGP) tarafından belirlenir. Bu, paketinizin ağda nasıl dolaşacağına karar veren bir yönlendirme algoritmasıdır ve seçtiği yol değiştirilemez.",
      "Ancak dünya çapındaki yüzlerce aktarıcı ve veri merkezinden oluşan sanal bir özel ağ sayesinde, istemci ile oyun sunucusu arasındaki yolu kendimiz seçebiliyorduk ki bu, genellikle varsayılan yola kıyasla daha hızlı bir kısayoldu. Steam Datagram Relay (SDR) kullanıyorsanız, Steam arayüzü bunun nasıl optimize edildiğini görebilmeniz için size ping sürenizi ve yolunuzu gösterecektir.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Başlangıçta Dota oyun sunucularını korumak için kullanılan bu özellik, tüm beklentileri aştı. SDR ağı düzenli olarak saniyede 140 milyona kadar paket ve 550 GBit sunar. 31 veri merkezinde 5 TBit'in üzerinde kapasiteye sahip aktarıcılarımız bulunmaktadır. Artık Steam Datagram Relay, yalnızca DDoS saldırılarına karşı koruma sağlamakla kalmıyor, aynı zamanda bağlantıyı artırıyor ve tüm Dota oyuncuları için ping'i düşürüyor. Ve bunu sadece Dota için değil, Steam'de bundan yararlanmak isteyen tüm oyunlar için yapıyor.",
      "Umarız Dota kulvarları arasına bir kez daha göz atmaktan keyif almışsınızdır. Teknik ayrıntı çoktu, sonuna kadar okuduğunuz için teşekkürler! Bir sonraki konumumuzun ne olmasını istediğinizi bize bildirmekten çekinmeyin."
    ],
    "commentcount": 313,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 7705,
    "votedowncount": 475,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1715113657,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7705,
  "votes_down": 475,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}