{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Abseits der Pfade: Verweigerung der Dienstverweigerung (DDoS)",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Abseits der Pfade: Verweigerung der Dienstverweigerung (DDoS)",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Willkommen zurück bei „Abseits der Pfade“, einem Blog, in dem unsere Entwickler über die Herausforderungen, Fehlerbehebungen und gelegentlichen glücklichen Zufälle berichten, die ihre Arbeit an einem so einzigartigen Spiel wie Dota mit sich bringt.[/i]",
      "Dies ist eine Geschichte über das Internet und seine Fallstricke. Insbesondere über einen Fallstrick, der das Internet für unsere Kunden komplett lahmgelegte, und wie wir es wieder zum Laufen gebracht haben.",
      "Das Internet ist so allgegenwärtig und selbstverständlich, dass wir manchmal vergessen, wie chaotisch es im World Wide Web zugehen kann. Jenseits der Sicherheit der Zwei-Faktor-Authentifizierung und vertrauenswürdigen Cookies lauert ein undurchdringlicher Dschungel voller unberechenbarer Trolle. Diesen Trollen hat es noch nie an Arglist gemangelt, mit der sie Ihnen das Leben versauern, und sie verfügen zunehmend auch über die technischen Fähigkeiten, um willkürlich großen Schaden anzurichten.",
      "2014 nahmen Trolle Valve mit sogenannten „distributed denial-of-service attacks“ ins Visier; auf Deutsch übersetzt „Verteilte Dienstverweigerungsangriffe“ oder gebräuchlich abgekürzt „DDoS-Attacken“. „Distributed” oder „Verteilt“ bezieht sich dabei auf eine große Anzahl von Internet-Hosts, die mit böswilliger Absicht einen bestimmten Internetdienst mit Datenverkehr überschwemmen, um dessen Netzwerk zu überlasten. Dies ist ein sogenannter volumetrischer Angriff, der zwar das Netzwerk nicht infiltriert, aber den Internetdienst mutwillig blockiert. Eine DDoS-Attacke führt dazu, dass legitime Kunden mit legitimen Anliegen durch den schlechten Datenverkehr verdrängt werden.",
      "Ende 2014 bestand das besondere Problem bei DDoS-Attacken darin, dass man dafür kein Superhacker mit einem fortgeschrittenen Informatikabschluss sein musste. Jeder Ottonormalverbraucher konnte ohne technisches Know-how und gegen eine geringe Vergütung jederzeit einen Bot oder einen Dienst mit einem Angriff beauftragen. Abgesehen von reinem Vandalismus, gab es ein offensichtliches Motiv für derartige Angriffe auf Valve. Eine DDoS-Attacke war eine todsichere Methode, ein Spiel zu beenden, wenn man selbst oder ein Spieler, den man unterstützte, auf die Verliererstraße geriet. Und die Situation artete in rasender Geschwindigkeit aus – fast jedes Wettkampfspiel wurde zur Zielscheibe von DDoS-Attacken.",
      "Anfang 2015 eskalierten die Angriffe auf Dota- und CS:GO-Spiele und auch andere Spieleentwickler beobachteten einen enormen Anstieg. Jemand im Dschungel hatte es den Trollen leichter gemacht, ihre Angriffe zu starten.",
      "Im August 2015 wurde The International durch DDoS-Angriffe gestört. Zwar waren die Partien der teilnehmenden Profiteams nicht betroffen, aber die Kommentatoren der offiziellen Übertragung konnten für mehr als zwei Stunden nicht auf die Spiele zugreifen und diese moderieren. Außerdem wurde die Umwandlung des Streams in die Fernsehübertragung beeinträchtigt. Die Teams spielten plötzlich in einem Niemandsland. Ein professionelles Gaming-Event mit Millionen von Zuschauern und Millionen von Dollar an Preisgeldern drohte von Trollen mit einer Fünf-Dollar-Software ruiniert zu werden. Selbstverständlich konnte Valve dieses Problem nicht ignorieren.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Wir probierten verschiedene Maßnahmen zur Abwehr von DDoS-Angriffen aus, bis wir eine Lösung fanden. Zunächst versuchten wir, den Datenverkehr mit einem leistungsstarken Netzwerk-Switch zu filtern. Leider ist diese Art der Filterung beim Datenverkehr von Spielen grundsätzlich schwierig. Spielserver empfangen über das Netzwerkprotokoll UDP (User Datagram Protocol) zwangsläufig Datenverkehr von beliebigen IP-Adressen. Stellen Sie sich zum Vergleich vor, Ihr Postamt würde unerwünschte Werbepost für Sie aussortieren. Doch wie es der Zufall will, arbeiten Sie als Ratgeberjournalist und erhalten ständig tonnenweise seriöse Post von unterschiedlichen Firmen. Das Postamt kann also in Ihrem Fall nicht mehr unterscheiden, welche Post unerwünscht ist und welche nicht. So sieht der Datenverkehr von Spielservern in der Regel aus. Außerdem ist die Quell-IP-Adresse in UDP-Paketen nicht verschlüsselt und kann leicht gefälscht werden. Somit kann unser „Postamt“ nicht einmal die Absenderadresse auf dem Umschlag als Anhaltspunkt heranziehen, weil die Absender der Werbepost diese fälschen.",
      "Steam stellt seinen Nutzern eine große Menge an Spielinhalten zur Verfügung und hat eigens dafür ein großes Netzwerk aufgebaut.  Wir nutzten dieses bereits vorhandene Netzwerk unter anderem dafür, den Datenverkehr für Spiele über dedizierte Verbindungen zu leiten, ein gutes Peering zu ermöglichen und zu gewährleisten, dass bewährte Methoden der Netzwerktechnik zur Anwendung kamen. Dadurch konnten wir die Ping-Zeiten der Spieler minimal halten, waren aber nicht vor DDoS-Angriffen geschützt. Das Problem besteht darin, dass UDP-Protokolle nicht verschlüsselt sind; wir hatten somit zwar unser eigenes Netzwerk, dieses war aber nicht privat.",
      "Um zu verhindern, dass unser eigenes Netzwerk für Angriffe auf unsere Server genutzt wurde, mussten wir alle Zugänge kontrollieren und sichern. Wir richteten Proxy-Server für den Datenverkehr der Spiele ein und leiteten jedes einzelne über das Netzwerk übertragene Datenpaket über Relais weiter, um dieses Ziel zu erreichen. Das bedeutet, ein Client kann nur über ein Relais mit einem Spielserver kommunizieren. Dieses nimmt die Authentifizierung vor und leitet dann den Datenverkehr an den Spielserver weiter. Dadurch bleibt die IP-Adresse des Servers immer verborgen – der Angreifer weiß also nicht, wo er angreifen soll.",
      "Um noch einmal unsere antiquierte Metapher mit dem Postamt zu bemühen: Unsere unerwünschten Absender haben keine Adresse mehr, an die sie ihre Werbepost schicken können. Sie haben zwar die Möglichkeit, die Werbepost an jedes Postamt in der Gegend zu schicken und darum zu bitten, diese weiterzuleiten, aber ohne die entsprechende Genehmigung wird das Postamt dieser Anfrage nicht nachkommen. (Außerdem würde es dem Postamt wohl etwas verdächtig vorkommen, wenn jemand versucht, einer einzigen Person 100 000 Briefe zu schicken.)",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Aber kann man nicht einfach das Relais angreifen? Technisch gesehen wäre das möglich. Allerdings haben wir eine praktisch unbegrenzte Anzahl davon und haben diese so konzipiert, dass sie Angriffen standhalten können. Ein „Relais“ ist übrigens nur ein anderes Wort für einen Computer, auf dem Software läuft. Man kann diesen angreifen oder lahmlegen, allerdings wurde das Protokoll speziell für diesen Fall entwickelt. Wenn bei der Ausführung eines Spiels auf einem Client die Verbindung zu einem Relais unterbrochen wird, wechselt der Client einfach zu einem anderen. Relais sind wie Hunderte Schachfiguren, die über die ganze Welt verstreut sind und den einzigen Zweck haben, den Spielserver zu beschützen. (Übrigens ist es schwieriger, ein Relais lahmzulegen, als es klingt. Relais sind ein kleines Meisterwerk der Technik und werden in einem bestimmten Teil des Netzwerks installiert. Obwohl sie bei Angriffen offline gehen können, haben wir bisher noch kein einziges Relais verloren.)",
      "Die Lösung war einfach, aber effektiv. Vor der Einrichtung der Relais mussten Angreifer nur einen einzigen Spielserver lahmlegen (was keine große Herausforderung war), um ein Spiel zu stören. Jetzt muss bei einem Angriff praktisch das gesamte Rechenzentrum lahmlegt werden, um eine Wirkung zu erzielen (was eine viel, viel größere Hürde darstellt). Gibt es Angriffsmethoden, mit denen dies dennoch gelingen könnte? Natürlich. Gibt es Angriffsmethoden, mit denen dies gelingen könnte und die jeder online für fünf Dollar bestellen kann? Nein. Ein derartig ausgeklügelter Angriff ist für die meisten Trolle praktisch unbezahlbar.",
      "Nachdem wir dieses neue System in Betrieb genommen hatten, kam uns eine Erleuchtung: Mit einem eigenen privaten Netzwerk wären wir nicht mehr an die Funktionsweise des klassischen Internets gebunden. Und das ermöglichte uns, das Kundenerlebnis noch besser zu gestalten. Im klassischen Internet wird beim Senden eines Pakets von einer IP-Adresse zu einer anderen die verwendete Route durch das Border Gateway Protocol (BGP) festgelegt. Hierbei handelt es sich um einen Routing-Algorithmus, der den Weg eines Pakets durch das Netzwerk festlegt, ohne dass dieser beeinflusst werden kann.",
      "Aber mit einem virtuellen privaten Netzwerk, das aus Hunderten von weltweit vernetzten Relais und Datenzentren besteht, konnten wir im Grunde unsere eigene Route vom Client zum Spielserver wählen. Diese war ggf. sogar schneller als die Standardroute. Wenn Sie das Steam Datagram Relay (SDR) verwenden, wird Ihnen die Ping-Zeit und die von uns gewählte Route im Steam-Overlay angezeigt. So können Sie selbst überprüfen, wie diese für Sie optimiert wird.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Was ursprünglich als Funktion zum Schutz von Dota-Spieleservern gedacht war, hat sich zu etwas Großartigem weiterentwickelt und viele Erwartungen übertroffen. Das SDR-Netzwerk überträgt in der Regel bis zu 140 Millionen Pakete und 550 Gigabit pro Sekunde. Wir verfügen über Relais in 31 Rechenzentren mit einer Bandbreite von über 5 Terabit. Und diese Steam Datagram Relais schützen nicht nur vor DDoS-Angriffen, sondern erhöhen auch die Konnektivität und verringern die Ping-Zeiten für jeden Dota-Spieler. Tatsächlich beschränkt sich dies nicht nur auf Dota, sondern kann von jedem Spiel auf Steam genutzt werden.",
      "Wir hoffen, dass Ihnen dieser neue Blick abseits der Pfade von Dota gefallen hat. Dieses Mal ging es ziemlich technisch zu; vielen Dank, dass Sie so lange durchgehalten haben! Teilen Sie uns gerne mit, worüber wir als Nächstes berichten sollen."
    ],
    "commentcount": 313,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 7705,
    "votedowncount": 475,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1715113657,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7705,
  "votes_down": 475,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}