{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Tussen de paden: ddos? Dacht 't niet!",
  "event_type": 28,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Tussen de paden: ddos? Dacht 't niet!",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Welkom terug bij 'Tussen de paden', een nieuw blog waarin we leden van ons ontwikkelingsteam aan het woord laten om de recente uitdagingen, bugfixes en 'happy accidents' te delen die ze tegenkomen bij hun werk aan een spel dat zo uniek is als Dota.[/i]",
      "Dit verhaal gaat over het internet en over hoe dat niet altijd werkt zoals het zou moeten, als het al werkt. Het is een verhaal over hoe het internet niet meer werkte voor onze klanten en hoe we dat hebben opgelost.",
      "We vergeten soms dat het internet een behoorlijk wilde woestenij kan zijn. Als je iets van je pad met tweefactorauthenticatie en vertrouwde cookies afwijkt, raak je zo verstrikt in het web. Er zijn overal trollen met kwade bijbedoelingen – en steeds vaker ook de vaardigheden – om jou het leven zuur te maken. Alleen maar omdat het kan.",
      "In 2014 maakten deze trollen gebruik van ddos-aanvallen, oftwel distributed denial of service. 'Distributed' betekent dat het om een gedistribueerde aanval gaat, waarbij heel veel internethosts tegelijkertijd een bepaald IP-adres overspoelen met verkeer, in de hoop dat de netwerkstack overbelast raakt. Dit wordt een volumetrische aanval genoemd en het doel is niet om toegang te krijgen tot het netwerk. Het enige doel is om de service onbereikbaar te maken voor anderen. Bij een ddos-aanval kunnen legitieme bezoekers geen toegang krijgen tot een legitieme dienst omdat de service overbelast is door het verkeer van de aanvallers.",
      "Het probleem met ddos-aanvallen was dat die aanvallen tegen 2014 niet meer alleen het domein waren van hoogopgeleide superhackers met uiterst geavanceerde datatools. Nee, zo'n beetje iedereen die bereid was om een dienst of bot te betalen, kon opdracht geven tot zo'n aanval. En de motieven waren duidelijk. Hoewel er altijd mensen zijn die alleen uit zijn op vandalisme, waren er ook mensen met diepere beweegredenen: een ddos-aanval was een goede manier om een wedstrijd te beëindigen die jij of een van je vrienden aan het verliezen was. Het was niet meer iets irritants waar je zo af en toe mee geconfronteerd werd. Het ontwikkelde zich tot een trend waarbij elk spel waarin spelers het tegen elkaar opnamen, continu werd verpest.",
      "Tegen het begin van 2015 zagen we een enorme toename in ddos-aanvallen bij Dota en CS:GO, en bij andere bedrijven werd hetzelfde waargenomen. Het was opeens heel erg makkelijk geworden om dit soort aanvallen uit te voeren.",
      "In augustus 2015 werd The International verstoord door ddos-aanvallen. Hoewel de wedstrijden van de pro's niet werden beïnvloed, konden commentatoren twee uur lang het spel niet openen om live verslag te doen. Ook het uitzenden van de livestream op tv werd een probleem. De spelers zaten plotseling in een vacuüm. Dit was een professioneel gamingevenement met miljoenen kijkers en waarbij miljoenen dollars op het spel stonden, en alles werd volledig in het honderd gestuurd door een paar figuren met 5 euro aan software. Valve kon het daar niet bij laten zitten.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "We hebben verschillende dingen geprobeerd voordat we een goede oplossing hadden voor het ddos-probleem. Ons eerste idee was om het verkeer te filteren met een krachtige netwerkswitch. Helaas is het heel lastig om deze manier van filteren toe te passen op spelverkeer. Bij spelservers is er eigenlijk altijd sprake van ongevraagd UDP-verkeer (User Datagram Protocol) van willekeurige IP-adressen. Stel je voor dat je een postkantoor hebt dat al je junkmail uit je normale post filtert. Maar wat nu als je een adviescolumn schrijft en dus iedere week bergen echte post krijgt van mensen die je niet kent? Het postkantoor kan dan minder makkelijk bepalen welke post je wel en niet wilt ontvangen. Voor verkeer op spelservers geldt hetzelfde. Bovendien is het bron-IP in UDP-pakketten niet beveiligd, waardoor het makkelijk gespooft kan worden. Ons postkantoor kan niet eens op de retouradressen op de enveloppen vertrouwen, omdat de afzenders van de junkmail echte adressen namaken.",
      "Steam bezorgt heel wat bits aan spelinhoud en heeft daar een groot netwerk voor opgebouwd.  Dankzij dit netwerk konden we al spelverkeer leveren via specifieke links, hadden we goede peering, konden we ervoor zorgen dat de best practices voor netwerkbeheer werden gevolgd, en nog veel meer. Hierdoor bleven spelerpings laag, maar het kon ons niet beschermen tegen een ddos-aanval. Het probleem is dat UDP-protocollen niet beveiligd zijn, dus ondanks dat we ons eigen netwerk hadden, was het niet privé.",
      "Om te voorkomen dat aanvallers ons eigen netwerk konden gebruiken om onze servers aan te vallen, moesten we alle toegangen afsluiten en ons netwerk beveiligen. Dit is gelukt door proxy's voor spelverkeer te maken en elk pakket gegevens dat over het netwerk werd verzonden, via een relais te sturen. Als een client nu met een spelserver wilde communiceren, ging dat via een relais dat de echtheid controleerde en dat verkeer vervolgens als proxy naar de spelserver stuurde. Op deze manier was het IP-adres van de server altijd verborgen en hadden aanvallers geen idee wat ze moesten aanvallen.",
      "Om ons ouderwetse voorbeeld van het postkantoor nog eens aan te halen, onze spammers hadden nu geen adres meer waar ze hun junkmail naartoe konden sturen. Ze konden hun post naar ieder postkantoor in de buurt sturen en vragen of zij het konden doorsturen, maar zonder autorisatie zal geen enkel postkantoor dat doen. (Bovendien zou het postkantoor het een beetje verdacht vinden als ze een enkele persoon 100.000 brieven probeerden te sturen.)",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Maar konden ze het relais dan niet aanvallen? In principe wel. Maar we hebben in feite een oneindig aantal relais en ze zijn ontworpen om aangevallen te worden. Een 'relais' is eigenlijk gewoon een computer die software uitvoert. Je kunt een relais aanvallen of offline halen, maar het protocol is daarop ontworpen. Als een client een spel probeert te spelen en het contact met een relais verliest, schakelt de client gewoon over op een ander relais. Je moet relais zien als honderden pionnen die over de hele wereld verspreid zijn met als enige doel het beschermen van de spelserver. (Het buiten spel zetten van een relais is wel iets moeilijker dan het lijkt. Ze hebben een redelijk robuust ontwerp en een specifieke plaats in het netwerk. Hoewel ze dus ontworpen zijn om offline te kunnen gaan, hebben we er nog nooit een verloren.)",
      "Deze oplossing was simpel maar effectief. Vroeger was het zo dat iemand die een spel wilde verstoren, maar één enkele spelserver plat hoefde te leggen (niet zo heel moeilijk). Nu moesten ze de strijd aangaan met zo'n beetje een heel datacentrum, en dat was een stuk ingewikkelder. Zijn er aanvallen die dat wel kunnen? Natuurlijk. Zijn er aanvallen die iedereen voor 5 euro online kan kopen? Nee. Zo'n geraffineerde aanval kunnen de meeste mensen niet betalen.",
      "Toen dit nieuwe systeem eenmaal actief was, realiseerden we ons iets anders: nu we ons eigen privénetwerk hadden, waren we niet meer afhankelijk van hoe het normale internet werkt. We zouden met dit eigen netwerk de spelervaring nog verder kunnen verbeteren. Op het normale internet wordt de route die een pakket aflegt van het ene IP-adres naar het andere, bepaald door het Border Gateway Protocol (BGP). Dit routingalgoritme beslist hoe je pakket door het netwerk wordt verplaatst en je hebt daar zelf geen invloed op.",
      "Maar met een virtueel privénetwerk met honderden relais en datacentra over de hele wereld, konden we onze eigen route bepalen van de client naar de spelserver. En vaak kon dat sneller dan via de standaard route. Als je SDR (Steam Datagram Relay) gebruikt, kun je in de Steam-overlay zien wat je ping is en welke route je van ons krijgt. Zo kun je zelf zien hoe we je snelheid optimaliseren.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Een functie die is begonnen als een manier om Dota-spelservers te beschermen, is nu uitgegroeid tot iets wat groter is dan we ooit hadden kunnen voorzien. Het SDR-netwerk bezorgt regelmatig tot wel 140 miljoen pakketten met een snelheid van 550 GBit per seconde. We hebben relais in 31 datacentra met een capaciteit van meer dan 5 TBit. De technologie die we nu Steam Datagram Relay noemen, beschermt ons niet alleen tegen ddos-aanvallen, maar verbetert ook de connectiviteit en verlaagt de ping voor elke Dota-speler. En dat niet alleen voor Dota, maar voor alle spellen op Steam die er gebruik van willen maken.",
      "We hopen dat je weer hebt genoten van deze blik tussen de paden van Dota. Dit was nogal een technisch verhaal, bedankt dat je tot het eind hebt doorgelezen! Laat het ons zeker weten als je een verzoek hebt voor een volgend onderwerp."
    ],
    "commentcount": 313,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 7705,
    "votedowncount": 475,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1715113657,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7705,
  "votes_down": 475,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}