{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Między ścieżkami: blokowanie blokad usługi",
  "event_type": 28,
  "appid": 0,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Między ścieżkami: blokowanie blokad usługi",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Witamy z powrotem w „Między ścieżkami”, rubryce na blogu, gdzie członkowie naszego zespołu rozwojowego dzielą się z wami szczegółami na temat wyzwań, rozwiązań błędów i okazjonalnych wesołych przypadków, które napotykamy przy pracy nad grą tak wyjątkową jak Dota 2.[/i]",
      "Oto opowieść o internecie i o tym, jak nie działa, tak jak powinien, o ile działa w ogóle, bo w sumie to nie działa. To opowieść o tym, jak internet przestał działać dla naszych klientów i jak to naprawiliśmy.",
      "Internet jest dziką prerią w większym stopniu, niż wynikałoby to z naszych rozważań o jego jestestwie. Z dala od bezpiecznych ograniczeń waszych identyfikacji dwuetapowych i zaufanych ciasteczek, gdzie może czekać na was dzicz, pełna losowych trolli kierowanych złośliwością i szkodliwością – i coraz większą zdolnością – w uprzykrzaniu wam życia z ni innego powodu, niż taki, że po prostu mogą to robić.",
      "W 2014 metodą używaną przez tych trolli były ataki w formie rozproszonej blokady usługi (DDoS). Mówiąc „rozproszonej”, odwołujemy się do dużej liczby hostów internetowych, które złośliwie zalewają ruchem sieciowym konkretny docelowy adres IP w celu przytłoczenia stosu sieciowego. Nazywa się to atakiem wolumetrycznym, a celem nie jest próba dostania się do sieci – jest nim po prostu zablokowanie usługi. Rozproszona blokada usługi oznacza, że faktyczni użytkownicy chcący dostępu do faktycznej usługi są wypychani przez zalew sztucznego, złośliwego ruchu sieciowego.",
      "Problemem z atakami DDoS było to, że (do końca 2014) nie były one popełniane przez wykradających dane superhakerów z zaawansowaną wiedzą z dziedziny informatyki. Zajmował się nimi w sumie ktokolwiek, kto był skłonny zapłacić za usługę lub bota, by wykonał dla nich takie zadanie. I powody ku temu są całkiem oczywiste. Mimo że niektórzy zadowalali się czynieniem tego czysto dla samego wandalizmu, inni mieli swój motyw: atak DDoS był pewnym sposobem na zamknięcie meczu, w którym dla was lub kogoś, komu kibicowaliście, gra zmierzała w stronę przegranej. Nie była to już kwestia okazjonalnego poirytowania, a sytuacja przeobraziła się w bezpośrednie natarcia na każdą grę, w której rywalizowali żywi gracze.",
      "Do końca pierwszych miesięcy 2015 obserwowaliśmy ogromny wzrost w atakach DDoS na Dota 2 i CS:GO, a inne firmy również odnotowywały spory skok tego typu aktywności. Ktoś, bardzo nagle, sprawił, że takie ataki były bardzo łatwe do przeprowadzenia przez dowolną osobę.",
      "W sierpniu 2015 The International został zakłócony przez ataki DDoS. Chociaż nie wpłynęło to na profesjonalistów rozgrywających spotkanie, przez ponad 2 godziny transmitujący nie mogli dostać się do gry, by komentować i analizować mecz. Przesył strumienia na potrzeby transmisji telewizyjnej stał się problemem. Gracze nagle grali w pustce. Było to profesjonalne wydarzenie ze świata gier z milionami widzów, gdzie stawką były miliony dolarów, a zakłócali je losowi ludzie z oprogramowaniem wartym pięć dolarów. Był to problem, którego Valve nie mogło zignorować.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Wypróbowaliśmy wielu rozwiązań, by poradzić sobie z atakami DDoS, zanim dotarliśmy do tego, który zadziałał. Na początku próbowaliśmy filtrować ruch sieciowy przy pomocy przełącznika sieciowego o sporej mocy. Niestety tego typu filtrowanie jest z natury trudne do wykonania, kiedy stosuje się je do ruchu sieciowego związanego z grą. Również w naturze serwerów gry jest otrzymywanie niechcianego ruchu z protokołu pakietów użytkownika (UDP) od losowych adresów IP. Wyobraźcie sobie, że macie oddział poczty, który zajmuje się odseparowywaniem śmieciowych wiadomości dla was. A teraz wyobraźcie sobie, że prowadzicie rubrykę z poradami i w związku z tym otrzymujecie tony prawidłowych wiadomości od obcych osób przez cały czas. W waszym wypadku poczta nie będzie wiedziała, które wiadomości są śmieciowe, a które nie. Mniej więcej tak wygląda ruch do serwerów gry. Ponadto źródłowe IP w pakietach UDP nie jest zabezpieczone i można łatwo się pod nie podszyć. Nasza poczta nie może nawet spojrzeć na adres zwrotny na kopercie w poszukiwaniu poszlak, bo wysyłający śmieciowe wiadomości podrabiają tę informację.",
      "Steam dostarcza sporą ilość danych na potrzeby treści gry i zbudował w tym celu ogromną sieć.  Korzystaliśmy już wcześniej z tej sieci, by dostarczać ruch sieciowy gry po przeznaczonych do tego celu łączach, oferując dobry peering, zapewniając, że stosowane są najlepsze praktyki w kwestii inżynierii sieci itd. Dzięki temu gracze mieli niski ping, ale nie byli chronieni przed atakami typu DDoS. Problemem jest to, że protokoły UDP nie są bezpieczne, więc mimo tego, że mieliśmy naszą własną sieć, nie była ona prywatna.",
      "Aby powstrzymać napastników od używania naszej własnej sieci do atakowania naszych serwerów, musieliśmy zacząć kontrolować wszystkie wejścia i zabezpieczyć je. Osiągnęliśmy to poprzez utworzenie pośredników (proxy) dla ruchu sieciowego związanego z grą, wyznaczając trasę dla dosłownie każdego transmitowanego z użyciem sieci pakietu przez przekaźniki. Wtedy gdy klient gry chciał porozumieć się z serwerem gry, musiał to zrobić przez przekaźnik, który zarówno weryfikował, jak i pośredniczył w przesyle tego ruchu sieciowego do serwera gry. Oznaczało to, że adres IP serwera był zawsze ukryty – atakujący zwyczajnie nie miał pojęcia, gdzie zaatakować.",
      "Ponownie przywołując naszą przestarzałą metaforę z urzędem pocztowym, nasz spamer nie miał już do dyspozycji adresu, pod który mógłby przesyłać śmieciową pocztę. Mógł on co prawda wysłać ją do każdego oddziału w okolicy i zlecić przekazanie jej dalej, ale bez autoryzacji ten oddział nie miał zamiaru tego wykonać. Ponadto taki urząd uznałby to za nieco podejrzane, że ktoś próbuje przesłać jednej osobie 100 000 listów.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Ale czy nie mógłby on po prostu zaatakować przekaźnika? Technicznie mógłby. Jednak zasadniczo mamy ich nieskończoną liczbę, a do tego skonstruowaliśmy je po to, by były atakowane. „Przekaźnik” jest po prostu innym słowem na komputer z uruchomionym oprogramowaniem. Możecie go atakować lub doprowadzić do jego wyłączenia, ale protokół został zaprojektowany, mając na uwadze to założenie. Jeżeli klient próbuje grać w grę i traci kontakt z przekaźnikiem, po prostu przełącza się na następny. Przekaźniki są niczym setki pionków szachowych rozrzuconych po świecie, których jedynym celem jest ochrona serwera gry (nawiasem mówiąc, zbicie takiego pionka jest trudniejsze, niż się to wydaje). Są one całkiem solidnie skonstruowane z technicznego punktu widzenia oraz umiejscowione w konkretnej części sieci, więc pomimo stworzenia ich z myślą o utracie połączenia z nimi, nie straciliśmy jeszcze ani jednego.",
      "Rozwiązanie było proste, ale skuteczne. Wcześniej, jeśli ktoś chciał zakłócić grę, mógł po prostu przytłoczyć pojedynczy serwer gry (bardzo niska poprzeczka do przeskoczenia). Lecz teraz musiał przytłoczyć de facto całe centrum danych – poprzeczkę zawieszoną o wiele, wiele, wiele wyżej. Czy istnieją ataki, którym wciąż mogłoby się to udać? Oczywiście. Czy istnieją ataki, które są w stanie to zrobić i które ktokolwiek w internecie mógłby kupić za pięć dolców? Nie. Tak wyrafinowany atak oficjalnie znalazł się poza progiem cenowym dla większości ludzi.",
      "Po uruchomieniu tego systemu mieliśmy objawienie: gdybyśmy kontrolowali naszą własną sieć prywatną, to nie krępowałyby nas reguły działania normalnego internetu. Moglibyśmy jej używać, by jeszcze bardziej dogodzić klientom. W normalnym internecie, kiedy wysyłacie pakiet z jednego adresu IP do drugiego, używana przez was trasa jest określana przez protokół bramy granicznej (BGP). Jest to algorytm trasowania, który decyduje o tym, jak wasz pakiet przemierzy sieć, i w którym nie macie głosu w sprawie wybieranej trasy.",
      "Ale w wirtualnej sieci prywatnej złożonej z setek globalnych przekaźników i centrów danych moglibyśmy tak naprawdę wybrać naszą własną trasę od klienta do serwera gry – często stanowiącą szybszy skrót niż trasa domyślna. Jeżeli korzystacie z przekaźnika datagramów Steam (Steam Datagram Relay, SDR), nakładka Steam pokaże wam czas pingu oraz trasę, jaką wam przydzielamy, więc możecie sami przekonać się o tym, jak jest to optymalizowane.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Funkcja, która powstała jako sposób na ochronę serwerów gier Dota 2 przerosła wszelkie możliwe oczekiwania. Sieć SDR rutynowo dostarcza nawet 140 milionów pakietów i 550 gigabitów danych na sekundę. Nasze przekaźniki znajdują się w 31 centrach danych o zdolności przesyłu ponad 5 terabitów. To, co teraz nazywamy SDR, nie tylko chroni przed atakami DDoS, ale również zwiększa zdolność do nawiązywania i utrzymywania połączeń oraz obniża ping dla każdego gracza Dota 2. Do tego jego działanie nie tyczy się tylko samej gry Dota 2, ale dowolnej gry na Steam, która chce korzystać z tego rozwiązania.",
      "Mamy nadzieję, że kolejne zerknięcie na to, co dzieje się między ścieżkami, sprawiło wam przyjemność. Ta edycja była dość techniczna; dzięki za waszą cierpliwość! Śmiało dajcie nam znać, o czym chcielibyście od nas usłyszeć następnym razem."
    ],
    "commentcount": 313,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 7705,
    "votedowncount": 475,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1715113657,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7705,
  "votes_down": 475,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}