{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Linjoilla: palveluneston estäminen",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684505
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709677787
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Linjoilla: palveluneston estäminen",
    "posttime": 1709684506,
    "updatetime": 1709684506,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Tervetuloa takaisin Linjoilla-blogisarjaan, jossa kehitystiimiläiset kertovat siitä, millaisia haasteita, bugeja ja välillä myös onnenkantamoisia tulee eteen Dotan kaltaisessa, ainutlaatuisessa pelissä.[/i]",
      "Tämä on tositarina internetistä ja siitä, miten se ei aina toimi niin kuin sen pitäisi (tai kun se ei toimi lainkaan). Tämä on tarina siitä, miten internet lakkasi toimimasta ja miten korjasimme sen.",
      "Internet ei aina toimi odotetulla tavalla. Kun poistut kaksivaiheisen tunnistautumisen ja luotettavien evästeiden kartoittamalta suojaisalta polulta, saatat joskus eksyä turvattomille erämaille. Ne ovat täynnä trolleja, jotka voivat pahantahtoisuudellaan ja alati kehittyvillä kyvyillään tehdä elämästäsi vaivalloista ihan vain huvin vuoksi.",
      "Kaukaisessa menneisyydessä, vuonna 2014, trollien tyypillisin tapa tehdä tuhoa oli hajautettu palvelunestohyökkäys (DDoS). Hajautettu tarkoittaa sitä, että suuri määrä internetlaitteita täyttää pahantahtoisesti tietyn IP-osoitteen liikenteellä tarkoituksenaan kohteen verkkopinon ylikuormittaminen. Tätä kutsutaan volumetriseksi hyökkäykseksi, eikä sen tarkoituksena ole päästä sisälle verkkoon, vaan pelkästään estää muiden pääsy siihen. Hajautettu palvelunestohyökkäys tarkoittaa, että oikeata palvelua haluavat oikeat henkilöt eivät pääse huonon liikenteen lävitse.",
      "DDoS-hyökkäysten ongelma oli se, että vuonna 2014 niitä eivät tehneet tietoja suodattavat, tietojenkäsittelyoppilinjan käyneet superhakkerit. Niitä teki melkein kuka tahansa, joka pystyi maksamaan sellaista tarjoavasta palvelusta tai botista. Ja niille oli varsin ilmiselvä syy. Vaikka jotkut saattoivat tehdä niitä ihan vain ilkivallan vuoksi, toisilla oli motiivi: DDoS-hyökkäyksellä pystyi keskeyttämään ottelun, jos pelaaja itse tai hänen kannattamansa joukkue oli häviämässä. Se ei ollut enää vain satunnainen haitta. Siitä tuli todellinen tuhoteko, jonka avulla minkä tahansa turnausottelun pystyi sabotoimaan.",
      "Alkuvuonna 2015 Dotaan ja CS:GO-peliin kohdistuneiden DDoS-hyökkäysten määrä oli kasvussa, ja useat muut peliyritykset ilmoittivat samasta ongelmasta. Yhtäkkiä joku oli tehnyt DDoS-hyökkäyksen toteuttamisesta äärimmäisen helppoa.",
      "Elokuussa 2015 DDoS-hyökkäykset häiritsivät The Internationalia. Vaikka pelaajat ja ottelut eivät häiriintyneet, selostajat eivät päässeet pelipalvelimille kommentoimaan pelejä suorana yli kahden tunnin ajan. Suoratoistolähetyksen lähettämisestä tuli ongelma. Yhtäkkiä pelaajat pelasivat tyhjiössä. Vuoden kohokohdaksi muodostunut miljoonien dollarien ja miljoonien katsojien vaalima lähetys olikin nyt viiden taalan ohjelmiston omistavien, satunnaisten henkilöiden hallussa. Tätä ongelmaa Valve ei voinut sivuuttaa.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Yritimme torjua DDoS-hyökkäyksiä usein keinoin, kunnes viimein löysimme ratkaisun. Aluksi yritimme suodattaa verkkoliikennettä tehokkaalla kytkimellä. Valitettavasti tämänkaltainen suodatus on luonnostaan vaikeaa peliliikenteen kanssa. Pelipalvelinten tarkoitus nimittäin on vastaanottaa pyytämätöntä UDP-liikennettä (User Datagram Protocol) satunnaisilta IP-osoitteilta. Kuvittele postitoimisto, joka karsii ei-toivotun roskapostin etukäteen. Kuvittele sitten, että kirjoitat Niksi-Pirkkaa, johon tarvitsetkin joka päivä lukijoidesi postissa lähettämiä niksejä. Postitoimisto ei tiedä, mikä on roskapostia ja mikä ei. Tältä pelipalvelimien tietoliikenne näyttää. Lisäksi UDP-pakettien lähteen IP-osoitetta ei ole suojattu, ja sen voi helposti väärentää. Lähetysosoite ei kerro postitoimistolle, onko kyseessä roskaposti, sillä osoitteeksi voi kirjoittaa mitä tahansa.",
      "Steam toimittaa paljon pelisisältöä käyttäjilleen ja on muodostanut suuren verkoston sitä varten.  Verkosto oli jo käytössä peliliikenteen tarjoamiseen palvelinlinkkien kautta, mikä loi hyvän ja luotettavan vertaisverkoston vuosien verkkotekniikan kokemuksella. Tämä piti pelaajien verkkoviiveet alhaisina, mutta ei suojellut DDoS-hyökkäyksiä vastaan. Ongelmana oli se, että vaikka oma verkkomme oli suojattu, UDP-protokollan paketit eivät olleet.",
      "Meidän piti valvoa ja suojata kaikkia verkon sisäänkäyntejä, jotta hyökkääjät eivät voineet käyttää verkkoamme hyökätäkseen palvelimillemme. Se mahdollistettiin luomalla välityspalvelimia peliliikenteelle ja reitittämällä jokainen datapaketti verkkovälittäjien kautta. Jos asiakasohjelma halusi kommunikoida pelipalvelimen kanssa, sen piti yhdistää pelipalvelimeen välityspalvelimella, joka sekä todensi että ohjasi liikenteen pelipalvelimelle. Tämä tarkoitti sitä, että palvelimen IP-osoite pysyi piilossa: hyökkääjä ei voinut tietää, minne hyökätä.",
      "Postitoimistoesimerkin roskapostittajalla ei enää ollut osoitetta, johon lähettää postia. Hän voi lähettää postinsa alueen jokaiseen postitoimistoon ja pyytää ohjaamaan sen eteenpäin, mutta ilman lupaa se ei etene minnekään. (Lisäksi postitoimistossa heräisi epäilyksiä, jos joku yrittäisi lähettää jollekulle satatuhatta kirjettä.)",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Mutta eikö hyökkäystä voisi kohdistaa lähetyspalvelimelle? Teoriassa voisi. Mutta käytännössä niitä on loputtomasti, ja ne ovat kuin luotuja hyökättäviksi. \"Välityspalvelin\" on tässä tapauksessa vain ylimääräinen ohjelmistoa käyttävä tietokone. Siihen voi hyökätä ja sen voi kaataa. Protokolla oli luotu tätä silmällä pitäen. Jos asiakas yrittää pelata peliä ja menettää yhteyden välityspalvelimeen, se vain yhdistää toiseen samanlaiseen. Välityspalvelimet ovat kuin satoja vartijoita, joiden ainoa tehtävä on seistä ympäri maailmaa ja vartioida pelipalvelinta. (Lisämaininta: välityspalvelimen kaataminen on vaikeampaa kuin uskoisi. Vaikka ne on suunniteltu kaadettaviksi ja hajautettu tiettyihin verkon osiin, yksikään ei ole vielä kaatunut.)",
      "Ratkaisu oli yksinkertainen, mutta tehokas. Aikaisemmin pelin häiritseminen vaati vain yhden pelipalvelimen ylikuormittamisen (mikä ei ollut vaikeaa). Nyt ylikuormittamista vaatii kokonainen datakeskus, mikä on todella paljon vaikeampaa. Onko olemassa hyökkäystä, joka voisi saavuttaa tämän? Totta kai. Onko olemassa tällaista hyökkäystä, jonka kuka tahansa voisi ostaa viidellä taalalla? Ei. Näin hienostunut hyökkäys on virallisesti useimpien henkilöiden lompakoiden saavuttamattomissa.",
      "Uuden järjestelmän myötä oivalsimme, että jos hallinnoisimme yksityistä verkkoa, emme olisi internetistä riippuvaisia.  Voisimme tarjota pelaajille entistä paremman kokemuksen. Internetin datapaketin lähetys IP-osoitteesta toiseen määräytyy BGD-protokollan (Border Gateway Protocol) avulla. BGP on reititysalgoritmi, joka määrittää datapaketin verkkoreitin, eikä sen valitsemaan reittiin voi vaikuttaa.",
      "Sadoista maailmanlaajuisista välityspalvelimista ja datakeskuksista muodostuvalla virtuaalisella yksityisverkolla olisi mahdollista luoda oma (usein nopeampi) reitti asiakasohjelmasta pelipalvelimelle. Kun käytät Steam Datagram Relaytä (SDR), näet viiveaikasi ja tarjoamamme reitin, joten näet optimoinnin itse.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Dotan pelipalvelimien suojeluun luodusta ominaisuudesta kasvoi jotain, jonka kokoluokkaa ei kukaan osannut kuvitella. SDR-verkkomme toimittaa rutiininomaisesti jopa 140 miljoonaa pakettia ja 550 gigabittiä sekunnissa. Meillä on välityspalvelimia 31 datakeskuksessa, joiden kapasiteetti ylittää jopa 5 terabittiä. Nykyisin Steam Datagram Relay -palvelu ei pelkästään suojele palvelimia DDoS-hyökkäyksiltä, vaan lisäksi se parantaa Dota-pelaajien yhteyksiä ja laskee heidän verkkoviiveitään. Eikä se tee sitä pelkästään Dotalle, vaan jokaiselle Steamissä olevalle pelille, joka haluaa hyödyntää sitä.",
      "Toivottavasti Linjoilla-blogin uudesta kurkistuksesta oli iloa. Tällä kertaa perehdyimme tekniseen puoleen. Kiitos, että jaksoit lukea loppuun asti! Kerro toki, mistä aiheesta haluaisit lukea seuraavaksi."
    ],
    "commentcount": 4,
    "tags": [],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 2,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1709684560,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}