{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Між лініями: як ми відмовили відмові в обслуговуванні",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Між лініями: як ми відмовили відмові в обслуговуванні",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Вітаємо з поверненням до серії дописів блогу «Між лініями», де члени нашої команди розробників розповідають про виклики, виправлення помилок та несподівано щасливі випадки, які трапляються під час розробки такої унікальної гри, як Dota.[/i]",
      "Це історія про інтернет, а саме — що він то не працює як слід, коли взагалі працює, то не працює зовсім. І це також історія про те, як він перестав працювати в наших користувачів і як ми виправили ситуацію.",
      "Інтернет — це така територія, що насправді ще більш неконтрольована, ніж ми звикли вважати. Варто лиш перестати користуватися двоступеневою автентифікацією та довіреними файлами cookie, і ви опинитеся на диких теренах, що сповнені тролів і зловмисників, які дедалі частіше мають змогу зробити ваше життя жалюгідним… просто тому що їм це під силу.",
      "У 2014 році ці тролі використовували розподілені атаки на відмову в обслуговуванні (DDoS), де «розподілені» означає, що зловмисники наповнюють трафіком конкретну IP-адресу за допомогою великої кількості інтернет-хостів із метою перевантаження мережевого стека. Такі атаки також називаються «об’ємними», метою яких є не потрапляння до мережі, а просто відмова в обслуговуванні. Розподілений характер цих атак означає, що справжні люди не можуть користуватися сайтом через штучно створений трафік.",
      "Станом на кінець 2014 року проблема DDoS-атак полягала в тому, що вони здійснювалися не суперхакерами з науковим ступенем у галузі ІТ, спроможними викрадати дані, а практично будь-ким, хто міг заплатити за цю послугу (власне атаки здійснювалися ботами). І неважко здогадатися чому. Хоча хтось займався цими атаками виключно з анархістською метою, інших на таке спонукало бажання гарантовано припинити матч, який програвали вони самі або гравець, за якого вони вболівали. Це вже було не випадковим дратуванням, а безпосередньою атакою на будь-яку змагальну гру.",
      "На початку 2015 року ми помітили значне зростання кількості DDoS-атак на Dota 2 та CS:GO. Аналогічну тенденцію помітили й інші компанії. Хтось дуже раптово уможливив здійснення таких атак для кого завгодно.",
      "У серпні того ж року ці атаки перервали The International. І хоча це не вплинуло на професійних гравців, які змагалися в той момент, протягом більш ніж двох годин глядачі були позбавлені яскравих коментарів й аналітики, тому що коментатори не могли приєднатися до матчів. Саме транслювання матчів стало проблемним. Гравці ніби раптово опинилися у вакуумі. Перебіг професійного ігрового змагання з мільйонами глядачів і мільйонами доларів США призового фонду було перервано якимись випадковими людьми, що за мізерну суму придбали зловмисну програмку. Valve не могла ігнорувати проблему такого масштабу.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Ми випробували різні підходи для вирішення проблеми з DDoS-атаками, але спрацював один. Спочатку ми намагалися відфільтрувати трафік за допомогою потужного мережевого комутатора. На жаль, такий тип фільтрування важко реалізувати у випадку ігрового трафіку. Ігрові сервери типово отримують незапитаний UDP-трафік із довільних IP-адрес. Уявіть поштове відділення, що відсіює вашу небажану пошту. А ще уявіть, що ваша робота — ведучий рубрики, що дає людям поради, тож ви постійно й очікувано отримуєте гори листів від незнайомців. Поштове відділення не знає, які з листів, що вам надходять, небажані, а які — ні. Аналогічна ситуація і з трафіком, що надходить до ігрових серверів. Окрім того, IP-адреси джерел в UDP-пакетах не захищені і їх можна легко підмінити. Поштове відділення навіть не враховує зворотну адресу, тому що і її можуть підробити відправники небажаної пошти.",
      "Обсяг ігрового вмісту, що розповсюджується в Steam, величезний, як і мережа для підтримки платформи.  Ми вже використовували цю мережу для надсилання ігрового трафіку через виділені канали, забезпечуючи хороший піринг, застосовуючи досвід мережевої інженерії тощо. Усе це дозволяло знизити мережеву затримку, однак не захищало від DDoS-атак. Проблема полягає в тому, що протоколи UDP не є безпечними, тому наша мережа не була приватною.",
      "Щоб не дозволити зловмисникам використовувати нашу власну мережу для здійснення атак на наші сервери, нам необхідно тримати під контролем усі точки входу та гарантувати їхню безпеку. Ми реалізували це шляхом створення проксі-серверів для ігрового трафіку, що переспрямовують через ретранслятори абсолютно всі пакети даних у мережі. Для зв’язку з ігровим сервером клієнту тепер потрібно проходити автентифікацію та переспрямовувати трафік через ретранслятор. А це означає, що IP-адреса сервера завжди буде прихованою, тож потенційні зловмисники просто не матимуть цілі для атаки.",
      "У продовження нашої старомодної метафори про поштове відділення: тепер зловмисники не знатимуть, на яку адресу надсилати небажані листи. Вони можуть надіслати їх до всіх місцевих поштових відділень із проханням переспрямувати їх, але без авторизації це буде неможливо. Ба більше, поштові співробітники не можуть не помітити підозрілу кількість листів (100 000), що намагається надіслати одна-єдина особа.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "А чом би не атакувати сам ретранслятор? З технічного боку це можливо, але їхня кількість практично необмежена, і вони мають вбудований захист. Ретранслятор — це лиш назва комп’ютера із запущеним програмним забезпеченням. Його можна атакувати чи вивести з мережі, однак такі загрози були враховані під час створення протоколу. Якщо під час гри клієнт втратить зв’язок із ретранслятором, просто буде використовуватися інший. Ретранслятори можна образно назвати пішаками, що розкидані по світу з єдиною метою — боронити ігровий сервер. До речі, вивести з ладу ретранслятори зовсім не просто, адже їхня інженерна складова добре розроблена, а їхнє конкретне місце в мережі не випадкове. Тож хоча ми й розраховували на те, що ретранслятори можна буде вивести з мережі, таких випадків поки не було зафіксовано.",
      "Наш підхід був простим, але ефективним. Якщо раніше, коли хтось намагався перервати гру, достатньо було лиш вивести з ладу один ігровий сервер (що не є надважким завданням), тепер для цього потрібно вивести з ладу цілий центр обробки даних (ось це точно надважке завдання). Чи існують атаки, яким це під силу? Звісно. Чи існують атаки, яким це під силу і які можна замовити за мізерну суму? Ні. Замовити атаку такого рівня просто задорого для більшості людей.",
      "Запустивши нову систему, ми усвідомили: керуючи власною приватною мережею, ми не матимемо дотримуватися принципів роботи звичайного інтернету. Власна приватна мережа дозволить нам ще значніше покращити досвід користувачів. Якщо використовувати звичайний інтернет, під час надсилання пакета з однієї IP-адреси на іншу маршрут визначатиметься протоколом граничного шлюзу (Border Gateway Protocol, BGP). Ви не маєте впливу на маршрут, адже він залежить від вибору, що здійснюється цим алгоритмом переспрямування.",
      "Однак враховуючи, що віртуальна приватна мережа (VPN) складається із сотень ретрансляторів і центрів обробки даних у всьому світі, ми здатні самостійно обирати маршрут від клієнта до ігрового сервера, і зазвичай обраний нами маршрут коротший за стандартний. Якщо ви використовуєте ретрансляцію датаграм Steam (Steam Datagram Relay, SDR), то зможете бачити в оверлеї Steam час затримки й маршрут і як вони оптимізуються.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Тепер ми маємо функцію, яка початково створювалася для захисту ігрових серверів Dota, але в результаті перевершила всі очікування. Мережа SDR регулярно надсилає до 140 мільйонів пакетів і 550 гігабіт даних за секунду. Ми маємо ретранслятори в 31 центрі обробки даних, що здатні зберігати понад 5 терабіт даних. Ретрансляція датаграм Steam не лише захищає від DDoS-атак, але й збільшує швидкість підключення та знижує затримку у всіх гравців, причому не лише в Dota 2, але й у будь-якій іншій грі в Steam, розробники якої бажають скористатися цією можливістю.",
      "Сподіваємося, вам сподобався цей сповнений технічними подробицями допис «Між лініями», і дякуємо, що дочитали його до кінця! Не вагайтеся надсилати нам свої ідеї для наступних дописів цієї серії."
    ],
    "commentcount": 313,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 7705,
    "votedowncount": 475,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1715113657,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 7705,
  "votes_down": 475,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}