{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Entre las sendas: Denegando la denegación de servicio",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709686550
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709853673
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Entre las sendas: Denegando la denegación de servicio",
    "posttime": 1709684506,
    "updatetime": 1709853673,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Te damos la bienvenida a \"Entre las sendas\", una característica en el blog en la que los miembros de nuestro equipo de desarrollo explican algunos de los desafíos, correcciones de errores y accidentes ocasionales felices que nos encontramos mientras trabajamos en un juego tan único como lo es Dota.[/i]",
      "Esta historia trata sobre el Internet y de cómo no funciona como debería, y si es que funciona, excepto cuando no funciona para nada. Es una historia sobre cómo el Internet dejó de funcionar para nuestros usuarios y sobre cómo lo arreglamos.",
      "El Internet es un entorno más salvaje de lo que solemos imaginar. Todo lo que necesitas hacer es distanciarte un poco de la autenticación de doble factor y las cookies confiables, para comenzar a caminar solo y desamparado en la selva, te llenas de una variedad de [i]trolls[/i] maliciosos que van persiguiendo el deseo (con una capacidad creciente) de perturbar tu vida, simplemente porque tienen el poder.",
      "En 2014, dichos [i]trolls[/i] usaban un método de ataques distribuidos de denegación de servicio (DDoS). \"Distribuidos\" se refiere a un gran número de servidores de Internet que sobrecargan maliciosamente con tráfico una dirección IP en particular, con el objetivo de saturar la red. Esto se llama ataque volumétrico y la intención no es intentar entrar en la red, sino intentar denegar el servicio. Una denegación de servicio distribuida significa que las personas que buscan recibir un servicio legítimo son desplazadas por un tráfico malicioso.",
      "El problema con los ataques DDoS era que, a finales de 2014, no los cometían los grandes [i]hackers[/i] informáticos con títulos especializados en informática para tratar de extraer datos. Todo contrario, los podía cometer cualquier persona que le pagara a un servicio o bot para que lo hiciera en su lugar. Y el motivo es bastante obvio. Algunos lo hacían por puro vandalismo, pero otros tenían un motivo claro: un ataque DDoS aseguraba el bloqueo de una partida cuando la persona, o un jugador al que la persona apoyaba, iba perdiendo. Esto se convirtió en algo más que una incomodidad momentánea. Se estaba convirtiendo en un ataque directo en contra de los jugadores de los títulos a nivel competitivo.",
      "En los primeros meses de 2015, fuimos testigos de un aumento enorme en los ataques DDoS en Dota y CS:GO. Otras compañías también indicaron un gran aumento. De alguna manera, alguien de repente hizo que fuera muy fácil cometer esos ataques.",
      "En agosto de 2015, The International fue interrumpido por ataques DDoS. A pesar de que los jugadores profesionales pudieron jugar las partidas normalmente, los comentaristas no pudieron ver las partidas para seguir la partida y hacer sus comentarios durante más de dos horas. Se convirtió en un problema enviar la retransmisión en forma de retransmisión televisiva. De repente, los jugadores estaban jugando sin la visibilidad de la retransmisión. Cualquier persona con un software de 5 dólares estaba interrumpiendo un evento de jugadores profesionales con millones de espectadores y con millones de dólares en juego. Era un problema que Valve no podía dejar pasar.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Antes de encontrar la solución adecuada, probamos varias soluciones para hacer frente a los ataques DDoS. Inicialmente, tratamos de filtrar el tráfico usando un potente conmutador de red. Desafortunadamente, este tipo de filtrado es intrínsecamente difícil de aplicar al tráfico de juegos. Es propio de los servidores de juegos recibir tráfico UDP (\"User Datagram Protocol\") no solicitado desde direcciones IP arbitrarias. Es como si la oficina de correos se encargara de filtrar la correspondencia no deseada por ti. Ahora imagínate que eres el periodista que se encarga de una sección de opinión y recibes toneladas de correspondencia de desconocidos constantemente. En ese caso, la oficina de correos no puede distinguir las cartas de correo no deseado del resto. Así es como suele verse el tráfico en los servidores de juegos. Además, la dirección IP de origen en los paquetes UDP no está protegida y puede ser falsificada fácilmente. Nuestra oficina de correos ni siquiera puede buscar pistas en la dirección del remitente del sobre, porque quienes envían el correo no deseado la falsifican.",
      "Steam distribuye una gran cantidad de información para el contenido de los juegos y, para ello, ha creado una red extensa.  Ya estábamos sacando ventaja de esta red para distribuir el tráfico de juegos a través de enlaces dedicados, obteniendo una buena interconexión ([i]peering[/i]), garantizando que se usaran las mejores prácticas de ingeniería de redes, etc. Esto logró mantener bajos los tiempos de ping de los jugadores; sin embargo, no protegía contra los ataques DDoS. El problema es que los protocolos UDP no son seguros, así que si bien teníamos nuestra propia red, no era privada.",
      "Necesitábamos controlar todas las entradas y protegerlas para evitar que los [i]hackers[/i] usaran nuestra red para atacar a nuestros servidores. Logramos este objetivo creando [i]proxies[/i] para el tráfico del juego, enrutando todos los paquetes de datos en la red a través de retransmisiones. Cuando un cliente quería comunicarse con un servidor del juego, tenía que hacerlo a través de una retransmisión que autenticara y enviara ese tráfico mediante un [i]proxy[/i] al servidor del juego. Esto significaba que la dirección IP del servidor siempre estaba oculta y el atacante simplemente no sabía por dónde atacar.",
      "Siguiendo con la metáfora de la oficina de correos, el emisor del correo no deseado ya no tenía una dirección a la que enviar su correo no deseado. Podría enviar cartas a todas las oficinas de correos y pedir que las distribuyan, pero esa oficina de correos no lo haría, ya que no tendría los permisos necesarios (además, a esa oficina de correos le resultaría muy sospechoso que alguien quiera enviar 100 000 cartas a un solo destinatario).",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "¿Pero no se podría simplemente atacar la retransmisión? En teoría, se puede. Pero tenemos un número prácticamente ilimitado de retransmisiones y las creamos para que las ataquen. Una retransmisión es simplemente una computadora que ejecuta un software. Puedes atacarlo o hacer que se desconecte, pero el protocolo se diseñó teniendo en mente este tipo de situaciones. Si un cliente está tratando de jugar un juego y pierde el contacto con una retransmisión, simplemente se cambia a otro. Las retransmisiones son como cientos de soldados repartidos por todo el mundo con el único propósito de proteger el servidor del juego. De hecho, desactivar una retransmisión es más difícil de lo que parece. Están diseñadas muy bien y están ubicadas en una parte específica de la red, y, aunque se concibieron para ser desconectadas, aún no hemos perdido ninguna.",
      "La solución fue sencilla pero eficaz. Antes, si alguien quería interrumpir un juego, bastaba con saturar uno de los servidores de juego (una expectativa muy baja). Ahora tendrían que saturar todo el centro de datos, lo cual es muchísimo más complicado. ¿Hay ataques que aún podrían lograrlo? Por supuesto. ¿Son el tipo de ataques que alguien puede hacer en línea comprando una herramienta por 5 dólares? No. Un ataque así de sofisticado quedó oficialmente fuera del alcance de la mayoría de la gente.",
      "Una vez que colocamos en funcionamiento el nuevo sistema, nos dimos cuenta de algo importante: al poder controlar nuestra propia red, no tendríamos las limitaciones del funcionamiento normal del Internet. Podríamos aprovecharlo para mejorar aún más la experiencia de los usuarios. Con el Internet normal, cuando envías un paquete desde una dirección IP a otra, la ruta que se usa está determinada por el protocolo de puerta de enlace fronteriza (BGP). Ese protocolo es el algoritmo de enrutamiento que decide cómo viajan tus paquetes por la red, y no te permite elegir su ruta.",
      "Sin embargo, con una red privada virtual compuesta por cientos de retransmisiones y centros de datos en todo el mundo, podíamos elegir nuestra propia ruta desde el cliente hasta el servidor del juego, encontrando a menudo un atajo más rápido que la ruta predeterminada. Si utilizas Steam Datagram Relay (SDR), la interfaz superpuesta de Steam te muestra el tiempo de ping y la ruta que te damos, para que compruebes la mejora personalmente.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "Esta característica, que comenzó como una forma de proteger los servidores de juego de Dota, se ha ampliado a tal punto de superar todas las expectativas. La red SDR distribuye de forma habitual hasta 140 millones de paquetes y 550 GBit por segundo. Tenemos retransmisiones en 31 centros de datos con una capacidad de más de 5 TBit. Lo que ahora llamamos Steam Datagram Relay no solo protege a los usuarios contra los ataques DDoS, sino que también aumenta la conectividad y reduce el ping para todos los clientes de Dota. Y no solo lo hace para Dota, sino para cualquier juego de Steam que desee aprovechar esa funcionalidad.",
      "Esperamos que hayas disfrutado de esta entrega de \"Entre las sendas\" de Dota. Sabemos que fue bastante técnica, ¡así que gracias por leer hasta el final! Y no dudes en sugerirnos qué temas te gustaría que abordemos en el futuro."
    ],
    "commentcount": 278,
    "tags": [
      "mod_reviewed",
      "ModAct_1415588329_1709686042_0",
      "ModAct_1415588329_1709693712_4",
      "ModAct_487176015_1709756813_4",
      "ModAct_1426387032_1709854961_4"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 5433,
    "votedowncount": 295,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1709684460,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1710287207,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1709854961,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 5433,
  "votes_down": 295,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}