{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Mellom slagene: Nei takk til tjenestenekt",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684505
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709677787
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mellom slagene: Nei takk til tjenestenekt",
    "posttime": 1709684506,
    "updatetime": 1709684506,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Velkommen tilbake til Mellom slagene – en bloggspalte der utviklere går gjennom noen av utfordringene, feilrettingene og heldige uhell vi møter mens vi jobber med et spill så unikt som Dota.[/i]",
      "Dette er en historie om internettet, og hvordan det ikke fungerer som det skal, når det i det hele tatt fungerer, unntatt når det ikke gjør det. Det er en historie om hvordan internettet sluttet å fungere for kundene våre, og hvordan vi løste det.",
      "Internettet er en større villmark enn vi gir det ære for. Forviller du deg bort fra de trygge rammene til tofaktorautentisering og pålitelige informasjonskapsler, kan det være litt av en villmark der ute, full av tilfeldige troll med onde hensikter og – stadig oftere – evnen til å gjøre livet ditt temmelig surt bare fordi de kan.",
      "Tilbake i 2014 benyttet disse trollene seg av en metode kalt distribuert tjenestenektangrep (DDoS). «Distribuert» henviser til et stort antall internettverter som ondsinnet overvelder en bestemt IP-adresse med trafikk i et forsøk på å overbelaste nettverkstjenesten. Dette kalles et volumetrisk angrep, og hensikten er ikke å komme inn i nettverket. Det prøver bare å forstyrre tjenesten. En distribuert tjenestenekt betyr at legitime brukere som oppriktig vil benytte tjenesten, ikke får plass på grunn av falsk trafikk.",
      "Problemet med DDoS-angrep var at de, helt siden slutten av 2014, ikke ble utført av superhackere med doktorgrader innen informatikk. De ble utførte av omtrent hvem som helst som ville betale for en tjeneste eller få en bot til å gjøre det for seg. Og det er ganske åpenbart hvorfor. Selv om noen bare ville gjøre det for hærverkets skyld, hadde andre et motiv: Et DDoS-angrep var en sikker måte å få avsluttet en kamp som enten de eller noen de heiet på, lå an til å tape. Dette var ikke lenger bare en sporadisk irritasjon. Det ble til et direkte angrep på alle spill der spillere konkurrerte.",
      "Innen de første månedene i 2015 så vi en enorm økning i DDoS-angrep på Dota og CS:GO, og andre selskaper rapporterte også et stort hopp. Noen hadde, veldig plutselig, gjort det veldig enkelt å gjøre dette for hvem som helst.",
      "I august 2015 ble The International forstyrret av DDoS-angrep. Self om proffene ikke ble forstyrret mens de spilte kampene, kunne ikke kringkasterne få tilgang til kampene for å kommentere dem i over to timer. Det ble et problem å lage sendingen som en TV-kringkasting. Spillerne spilte plutselig i ingenmannsland. Dette var en profesjonell spillturnering med millioner av seere og millioner av kroner på spill, og det ble forstyrret av tilfeldige folk med programvare til 50 kr. Det var et problem Valve ikke kunne ignorere.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Vi prøvde flere løsninger for å håndtere DDoS-angrepene før vi kom fram til en som fungerte. I utgangspunktet forsøkte vi å filtrere trafikken med en kraftig nettverkssvitsj. Dessverre er denne slags filtrering i seg selv vanskelig å gjøre med spilltrafikk. Spilltjenere er laget for å motta uoppfordret UDP-trafikk (User Datagram Protocol) fra vilkårlige IP-adresser. Tenk deg at du hadde et postkontor som luket ut uønsket søppelpost for deg. Men tenk deg så at du jobber med leserinnlegg i en avis, og du mottar massevis av legitim post fra tilfeldige fremmede hele tiden. I dette tilfellet vet ikke postkontoret hva som er søppelpost eller ei. Det er slik trafikken til spilltjenere pleier å se ut. Dessuten er ikke kilde-IP-en i UDP-pakker sikret, så den kan lett forfalskes. Postkontoret vårt kan ikke engang se på returadressen på konvolutten, fordi avsendere av søppelpost forfalsker den.",
      "Steam leverer store mengder spillinnhold og har bygget opp et stort nettverk for å gjøre det.   Vi benyttet oss allerede av dette nettverket for å levere spilltrafikk over faste lenker, som gir god forbindelse og benytter anbefalte fremgangsmetoder for nettverket osv. Dette holdt spillernes ping nede, men beskyttet ikke mot DDoS-angrep. Problemet er at UDP-protokoller ikke er sikre, så selv om vi hadde vårt eget nettverk, var det ikke privat.",
      "For å hindre at angripere bruker vårt eget nettverk til å angripere tjenerne våre, må vi kontrollere alle inngangene og sikre dem. Vi oppnådde dette ved å opprette mellomtjenere for spilltrafikk, som rutet hver eneste datapakke overført over nettverket, gjennom releer. Når en klient vil snakke med en spilltjener, må den gjøre det gjennom et relé som både autentiserer den og sender trafikken videre til spilltjeneren. Det betyr at tjenerens IP-adresse alltid er skjult – angriperne har dermed ingen anelse hvor de skal angripe.",
      "Vi kan fortsette med den gammeldagse postkontormetaforen fra tidligere. Avsendere har ikke lenger en adresse å sende søppelpost til.  De kan sende det til hvert postkontor i området og be dem om å sende det, men posten sendes ikke noe sted uten autorisasjon. (Dessuten synes nok postkontoret at det er litt mistenkelig at noen prøver å sende 100 000 brev til en enkelt person.)",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Men kan du ikke bare angripe releet? Jo, teknisk sett. Men vi har i bunn og grunn et ubegrenset antall av dem, og vi bygde dem for å tåle angrep. Et «relé» er bare et annet ord for en datamaskin som kjører programvare. Du kan angripe det eller sette det ut av stand, men protokollen ble designet med tanke på dette. Hvis en klient prøver å spille et spill og mister kontakten med et relé, bytter den bare til et annet. Releer er som hundrevis av brikker spredt rundt omkring i verden hvis eneste formål er å vokte spilltjeneren. (For øvrig er det vanskeligere å ta knekken på et relé enn det høres ut. De er bygget ganske bra og plassert i en bestemt del av nettverket, så selv om de ble bygget for å bli satt ut av stand, har vi ikke mistet en ennå.)",
      "Løsningen var enkel, men effektiv. Før, hvis noen ønsket å forstyrre et spill, kunne de bare overvelde en enkelt spilltjener (ikke så veldig vanskelig). Nå må de rett og slett overvelde hele datasenteret – som er mye, mye, mye vanskeligere. Finnes det angrep som fortsatt kan oppnå dette? Så klart. Finnes det angrep som kan gjøre dette og som hvem som helst kan kjøpe på nett for 50 kr? Nei. Et så avansert angrep var offisielt utenfor prisklassen til folk flest.",
      "Med dette nye systemet i gang fikk vi en åpenbaring: Hvis vi kontrollerte vårt eget private nettverk, trenger vi ikke å lene oss på hvordan det vanlige internettet fungerer. Vi kan bruke det til å gjøre kundeopplevelsen enda bedre. Når du sender en pakke fra en IP-adresse til en annen med det vanlige internettet, bestemmes ruten av Border Gateway Protocol (BGP). Dette er en rutingalgoritme som bestemmer hvordan pakken skal reise over et nettverk, og du kan ikke påvirke hvilken rute den tar.",
      "Men med et virtuelt privat nettverk sammensatt av hundrevis av globale releer og datasentre, kunne vi i hovedsak velge vår egen rute fra klienten til spilltjeneren – ofte en raskere snarvei enn standardruten. Hvis du bruker Steams datagramrelé (SDR), viser vi pingtid og hvilken rute vi gir deg, slik at du selv kan se hvordan den blir optimalisert.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "En funksjon som begynte som en måte å beskytte Dota-spilltjenere på, har vokst seg større enn det alle hadde forventet. SDR-nettverket leverer rutinemessig så mye som 140 millioner pakker og 550 gigabit per sekund. Vi har releer i 31 datasentre med en kapasitet på over 5 terabit. Det vi nå kaller Steams datagramrelé beskytter ikke bare mot DDoS-angrep, men styrker også forbindelsen og senker ping for alle Dota-kunder. Og det gjør ikke bare dette for Dota, men for alle spill på Steam som ønsker å dra nytte av det.",
      "Vi håper du likte en ny titt mellom slagene i Dota. Denne var ganske så teknisk, men takk for følget! Og gi oss gjerne beskjed om hva du vil vi skal snakke om neste gang."
    ],
    "commentcount": 4,
    "tags": [],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 2,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1709684560,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}