{
  "gid": "4115798034511159059",
  "clan_steamid": "103582791433224455",
  "event_name": "Mellan striderna: nej tack till DDoS-attacker",
  "event_type": 28,
  "appid": 570,
  "server_address": "",
  "server_password": "",
  "rtime32_start_time": 1709684460,
  "rtime32_end_time": 1709684820,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "0d69f196c6fa3b398260d8448d0f67f5923331c3.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1709684505
      },
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1709583176
      },
      {
        "strSteamID": "76561198093408953",
        "rtUpdated": 1709675626
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1709677787
      }
    ]
  },
  "announcement_body": {
    "gid": "4115798034511159060",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Mellan striderna: nej tack till DDoS-attacker",
    "posttime": 1709684506,
    "updatetime": 1709684506,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/4d7209c869530f3e0f737e28a1156e7017314660.jpg[/img]",
      "[i]Välkommen tillbaka till Mellan striderna, en ny blogg där medlemmarna i utvecklingsteamet berättar om utmaningar, buggåtgärder och en och annan lycklig tillfällighet som man stöter på när man jobbar med ett så unikt spel som Dota.[/i]",
      "Det här är en berättelse om internet och hur det inte fungerar som det ska när det fungerar överhuvudtaget, tills det inte gör det. Det är en berättelse om hur internet slutade fungera för våra kunder och hur vi fixade det.",
      "Internet är mer av en vildmark än man kanske tror. Om du avviker från tryggheten med tvåfaktorsidentifiering och tillförlitliga cookies kan det bli lite vilt där ute, med massor av troll som har både motivation och förmågan att göra ditt liv ganska eländigt utan någon särskild anledning, bara för att de kan.",
      "Redan 2014 använde trollen överbelastningsattacker (DDoS). Distribuerad överbelastning hänvisar till ett stort antal internetvärdar som på skadligt vis översvämmar en specifik ip-adress med trafik i ett försök att överväldiga nätverksstacken. Det kallas för en volymetrisk attack och avsikten är inte att försöka komma in i nätverket. Det är istället en avsiktlig blockering av tjänsten. En DDoS-attack innebär att legitima användare som vill ha legitim service trängs ut av den skadliga trafiken.",
      "Problemet med DDoS-attackerna i slutet av 2014 var att de inte begicks av datastjälande superhackare med avancerad datavetenskaplig utbildning. Attackerna begicks av vem som helst som var villig att betala för en tjänst eller en bot som kunde göra det åt dem. Och det är ganska uppenbart varför. Även om vissa vandaliserade för skojs skull, hade andra ett motiv: En DDoS-attack var ett säkert sätt att stänga ned en match som antingen du eller någon du hejade på förlorade. Det var inte längre bara ett tillfälligt irritationsmoment. Det förvandlades till ett direkt angrepp mot alla spel där spelare tävlade mot varandra.",
      "Under de första månaderna 2015 såg vi en enorm ökning av DDoS-attacker mot Dota och CS:GO. Andra företag rapporterade även de en rejäl stegring. Någon hade plötsligt gjort det mycket enkelt för alla att göra detta.",
      "I augusti 2015 stördes The International av DDoS-attacker. Proffsen som spelade påverkades inte men kommentatorerna kunde inte komma in i matcherna på över två timmar. Det blev ett problem att sända streamen som en tv-sändning. Spelare spelade plötsligt i ett tomrum. Detta var ett professionellt spelevent med miljontals tittare och miljontals dollar på spel, och det stördes av okänt folk med programvara värd 50 kr. Det var ett problem som Valve inte kunde ignorera.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/c63292d66774594361f081935573b7567dbfe7b6.jpg[/img]",
      "Vi testade flera lösningar för att hantera DDoS-attacker innan vi kom fram till en som fungerade. Inledningsvis försökte vi filtrera trafiken med en kraftfull nätverksväxlare. Tyvärr är denna typ av filtrering i sig svår att använda med speltrafik. Det är normalt för spelservrar att ta emot oombedd UDP-trafik (User Datagram Protocol) från godtyckliga ip-adresser. Tänk dig att du hade ett postkontor som slängde bort oönskad skräppost åt dig. Föreställ dig nu att du jobbar som rådgivare och du får massor av legitim post från främlingar varje dag. I den situationen vet inte postkontoret vad som är skräppost och vad som inte är det. Det är så trafiken till spelservrar ofta ser ut. Dessutom är käll-ip-adressen i UDP-paket inte säkrad och kan lätt förvanskas. Vårt postkontor kan inte ens använda kuvertets returadress som ledtråd eftersom avsändarna av skräppost förfalskar den.",
      "Steam levererar många bitar spelinnehåll, och har byggt upp ett stort nätverk för att göra det.  Vi drog redan nytta av detta nätverk för att leverera speltrafik över dedikerade länkar, få bra peering och se till att bästa praxis används för nätverksteknik. Detta gav spelare låg ping, men skyddade inte mot DDoS-attacker. Problemet är att UDP-protokoll inte är säkra, så även om vi hade vårt eget nätverk var det inte privat.",
      "För att förhindra att angripare använder vårt eget nätverk för att attackera våra servrar behövde vi kontrollera alla ingångar och säkra dem. Vi åstadkom detta genom att skapa proxyer för speltrafik som dirigerar varje enskilt datapaket som överförs över nätverket via reläer. När en klient ville kommunicera med en spelserver var den nu var tvungen att göra det genom ett relä som både autentiserade och skickade trafiken via en proxy till spelservern. Detta innebar att serverns ip-adress alltid var dold – angripare hade helt enkelt ingen aning om var de skulle attackera.",
      "För att återanvända vår föråldrade postkontorsmetafor från tidigare hade våra spammare inte längre en adress att skicka skräppost till. De kunde skicka den till varje postkontor i området och be dem att skicka den vidare, men utan tillstånd kommer postkontoret inte att göra det. (Dessutom skulle de bli lite misstänkta på postkontoret om någon försökte skicka 100 000 brev till en enda person.)",
      "[img]{STEAM_CLAN_IMAGE}/3703047/d4e0ef987a9df51ac53309c6a1483cfcdd6749fd.jpg[/img]",
      "Men kan man helt enkelt inte bara attackera reläet? Jo, tekniskt sett. Men vi har i stort sett ett obegränsat antal av dem, och de är byggda för att bli attackerade. Ett relä är bara ett annat ord för en dator som kör programvara. Det kan attackeras eller läggas offline, men protokollet utformades med det antagandet i åtanke. Om en klient försöker spela ett spel och förlorar kontakt med reläet, växlar klienten helt enkelt till ett annat relä. Reläer är som hundratals bitar som är utspridda runt om i världen, och de har ett enda syfte: att skydda spelservern. (Det är för övrigt svårare att förstöra ett relä än vad det låter. De är välkonstruerade och placerade i en specifik del av nätverket, så de må vara byggda för att läggas offline, men vi har inte blivit av med ett än.)",
      "Lösningen var enkel med effektiv. Om man ville störa en match förut kunde man helt enkelt övermanna en enskild spelserver (vilket inte var så värst svårt). Nu måste man övermanna i princip hela datacentret, och det är mycket, mycket, mycket svårare. Finns det attacker som fortfarande kan åstadkomma det? Självklart. Finns det attacker som kan göra det och som vem som helst kan köpa för 50 kronor på nätet? Nej. De flesta har inte råd att genomföra en så pass sofistikerad attack.",
      "Vi fick en uppenbarelse när det nya system var i gång: om vi kontrollerade vårt egna privata nätverk skulle vi inte vara beroende av hur internet i övrigt fungerar. Vi kunde använda det till att göra kundupplevelsen ännu bättre. När man skickar ett paket från en ip-adress till en annan på vanligt internet, bestäms rutten som man använder av Border Gateway Protocol (BGP). Detta är en routingalgoritm som bestämmer hur paketet förflyttar sig på nätverket. Man kan inte välja vilken rutt paketet tar.",
      "Men på ett privat nätverk bestående av hundratals globala reläer och datacenter skulle vi i princip kunna välja vår egen rutt från klienten till spelservern, och det är ofta en snabbare genväg än standardrutten. Om du använder Steam Datagram Relay (SDR) visar vi pingtiden och vilken rutt vi ger dig. På så vis kan du själv kan se hur det optimeras.",
      "[img]{STEAM_CLAN_IMAGE}/3703047/82554298cf9ed002daf92613c81d19d6072ef09c.jpg[/img]",
      "En funktion som skapades som ett sätt att skydda Dotas spelservrar har utvecklat sig mer än vad någon hade kunnat förvänta sig. SDR-nätverket levererar regelbundet så många som 140 miljoner paket och 550 gigabit per sekund. Vi har reläer i 31 datacenter med kapacitet på över 5 terabit. Det vi nu kallar Steam Datagram Relay skyddar mot DDoS-attacker samtidigt som det stärker anslutningen och sänker pingtiden för alla Dota-kunder. Och det gäller inte bara Dota, utan alla spel på Steam som vill dra nytta av det.",
      "Vi hoppas att du gillade även denna titt mellan striderna i Dota. Det var ganska tekniskt den här gången. Tack för att du höll ut! Berätta gärna vad du vill att vi ska ta upp härnäst."
    ],
    "commentcount": 3,
    "tags": [],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "4288061352804807411",
    "event_gid": "4115798034511159059",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4288061352804807411",
  "rtime32_last_modified": 1709684517,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4288061352804807411",
  "clan_steamid_original": "103582791433224455"
}