{
  "gid": "4692277172977135795",
  "clan_steamid": "103582791433224455",
  "event_name": "Wielcy mistrzowie The International",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1726872300,
  "rtime32_end_time": 1726875000,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "f8f19d42984bce7a36969a02727a79ac4e91f558.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1726864378
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1726858524
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1727113391
      }
    ]
  },
  "announcement_body": {
    "gid": "4692277172977135796",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Wielcy mistrzowie The International",
    "posttime": 1726872360,
    "updatetime": 1727113391,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/5d614dc7454bfde1701834ffc951eb194a3a55af.jpg[/img]Gratulacje dla Team Liquid, wielkich mistrzów The International 2024. Przegrywając tylko trzy mecze na swej drodze po mistrzostwo, nieustępliwa ekipa Team Liquid posłała do domu całe mrowie budzących grozę pretendentów i w huczny sposób zdobyła pozycję najświetniejszej drużyny Dota na świecie.",
      "Podróż Team Liquid po Egidę Czempionów rozpoczęła się w płynny sposób wraz ze zwycięstwami 2:0 z Aurora i beastcoast, jednak ich występ przeciwko broniącym mistrzowskiego tytułu Team Spirit, zakończony porażką 0:2, przypomniał każdemu, że ścieżka ku nieśmiertelności jest wypełniona rywalami, których nie można lekceważyć.",
      "Ich kolejny oponent miał to uwidocznić jeszcze bardziej. Liquid dysponowało przewagą 1:0 i miało pozycję w górnej drabince niemal na wyciągnięcie ręki, lecz BB Team udało się wykraść drugi mecz podczas ich serii decydującej o rozstawieniu, tym samym grożąc Liquid znacznie trudniejszą ścieżką przez dolną drabinkę. Niezrażeni gracze Liquid wykorzystali wczesną akcję w trzeciej rozgrywce do wytworzenia lawinowej przewagi nad rywalami i ostatecznie do zabezpieczenia trzeciego miejsca w górnej drabince w kolejnym etapie turnieju.",
      "Gdy już się tam znaleźli, nic nie zatrzymało ich na drodze po mistrzostwo. Ich bohaterowie byli niemal nie do zabicia w dominującym zwycięstwie 2:0 przeciw Xtreme Gaming – w drugim meczu postaciom Liquid przydarzył się tylko jeden zgon. Zachowując ten pęd, Team Liquid otwarło swoją serię przeciw Cloud9 już na głównej scenie kolejnym rozgromieniem. Drugi mecz okazał się bardziej wyrównany, lecz w późnej fazie gry Liquid całkowicie zdemolowali rywali, co doprowadziło do wygranej i miejsca w finale górnej drabinki, w którym mieli się zmierzyć ze znajomym przeciwnikiem – i ciągłym utrapieniem na drodze – groźną ekipą z Gaimin Gladiators.",
      "Odmieniając istniejący precedens, Liquid przetrzymało wczesną agresję ze strony Gaimin i wygrało serię 2:0, a następnie pewnym krokiem odmaszerowało w kierunku wielkiego finału. Po tym, jak Gaimin wywalczyło sobie drogę powrotną do rewanżu, Team Liquid wykorzystał tę okazję na zademonstrowanie, że wyniki ich pierwszego spotkania nie były jedynie łutem szczęścia. Gracze Team Liquid w decydującym stylu odesłali ich starych nemesis z kwitkiem i z wynikiem 3:0 sięgnęli po Egidę Czempionów i przypieczętowali swoje miejsce w historii Dota 2.",
      "Imiona, nazwiska i pseudonimy dzierżących ostateczny symbol zwycięstwa na zawsze pozostaną wyryte na Egidzie Czempionów.",
      "[b]2024 – Team Liquid[/b]",
      "[list]",
      "[*] Michael „miCKe” Vu",
      "[*] Michał „Nisha” Jankowski",
      "[*] Neta „33” Shapira",
      "[*] Samuel „Boxi” Svahn",
      "[*] Aydin „Insania” Sarkohi.",
      "[/list]",
      "[b]Spoglądając w przeszłość[/b]",
      "Chcielibyśmy raz jeszcze podziękować wszystkim graczom, prezenterom i całej społeczności Dota 2 za wcielenie tej globalnej uroczystości w życie. Jeśli przegapiliście którąkolwiek część turnieju lub po prostu pragniecie przeżyć te niesamowite zagrania na nowo, skierujcie się na [url=https://www.youtube.com/user/dota2]kanał Dota 2 na YouTube[/url], gdzie znajdziecie powtórki z całego turnieju. Możecie także znaleźć zbiór zdjęć z zakończenia wydarzenia na kontach Dota 2 w serwisach [url=https://www.instagram.com/dota2]Instagram[/url] i [url=https://www.flickr.com/photos/dota2ti/]Flickr[/url].",
      "[b]Niech żyją wielcy mistrzowie[/b]",
      "Pojemniki z naklejką ze specjalnej edycji mistrzów dla Team Liquid są już dostępne w sprzedaży. Każdy pojemnik zawiera jedną naklejkę przedstawiającą miCKego, Nishę, 33, Boxiego, Insanię lub Team Liquid. 50% środków z każdej sprzedaży trafia bezpośrednio do Team Liquid.",
      "[b]Kompendium The International[/b]",
      "Jeśli nadal macie jakieś wyzwania do dokończenia i nagrody do odebrania z Kompendium The International 2024, to wciąż macie trochę czasu, zanim to wszystko dobiegnie końca. W dalszym ciągu możecie zgarnąć dodatkowe poziomy dla waszego Kompendium do wtorku 15 października. Pozostałe drobiazgi jak pakiety klubu kibica, pakiety ekspertów i naklejki mistrzów będą dostępne przez kilka tygodni dłużej.",
      "[b]Nadchodzący bohater oraz akt IV Utraconej Korony[/b]",
      "Poza tym gdyby ominął was zwiastun na The International, zapowiedzieliśmy kolejnego bohatera w Dota 2. Przywódca Uziemionych, zaprzysięgły wróg królowej Imperii i ogółem typ niepokorny, [url=https://www.youtube.com/watch?v=ZqIFVTc8j80]Kez, dołączy do składu bohaterów Dota 2[/url] po wydaniu aktu IV Utraconej Korony."
    ],
    "commentcount": 434,
    "tags": [
      "mod_reviewed",
      "ModAct_1434573178_1726874146_0",
      "ModAct_1294976491_1727118145_4"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4848777451364620786",
    "event_gid": "4692277172977135795",
    "voteupcount": 11425,
    "votedowncount": 1108,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1726872300,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4848777451364620786",
  "rtime32_last_modified": 1730847147,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1727118145,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "votes_up": 11425,
  "votes_down": 1108,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4848777451364620786",
  "video_preview_type": "youtube",
  "video_preview_id": "ZqIFVTc8j80",
  "clan_steamid_original": "103582791433224455"
}