{
  "gid": "4692277172977135795",
  "clan_steamid": "103582791433224455",
  "event_name": "The International – Οι Μεγάλοι Πρωταθλητές",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1726872300,
  "rtime32_end_time": 1726875000,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "f8f19d42984bce7a36969a02727a79ac4e91f558.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1726864378
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1726858524
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1727113391
      }
    ]
  },
  "announcement_body": {
    "gid": "4692277172977135796",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International – Οι Μεγάλοι Πρωταθλητές",
    "posttime": 1726872360,
    "updatetime": 1727113391,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/5d614dc7454bfde1701834ffc951eb194a3a55af.jpg[/img]Συγχαρητήρια στους Team Liquid, τους μεγάλους πρωταθλητές του The International 2024. Χάνοντας τρία μόλις παιχνίδια στην πορεία της στο πρωτάθλημα, η αδυσώπητη ομάδα των Liquid «καθάρισε» όλους τους στιβαρούς διεκδικητές του τίτλου και κέρδισε με διαφορά τη θέση της ως η καλύτερη ομάδα Dota στον κόσμο.",
      "Ο δρόμος των Team Liquid προς το Aegis ξεκίνησε ομαλά με δύο νίκες με 2–0 στη σειρά εναντίον των Aurora Gaming και των beastcoast, αλλά η ήττα τους με 0–2 εναντίον των περσινών πρωταθλητών Team Spirit υπενθύμισε σε όλους ότι η διαδρομή για την αθανασία είναι γεμάτη με τρομερούς εχθρούς.",
      "Ο επόμενος αντίπαλός τους το κατέστησε ακόμα πιο σαφές. Ενώ οι Liquid είχαν πλεονέκτημα 1–0 και ο Άνω Όμιλος ήταν σχεδόν εξασφαλισμένος, οι αουτσάιντερ BB Team έκλεψαν τη νίκη στον δεύτερο αγώνα καθορισμού, απειλώντας να στείλουν τους Liquid στην πολύ πιο δύσκολη διαδρομή του Κάτω Ομίλου. Απτόητοι, οι Liquid εκμεταλλεύτηκαν τις πρώτες ενέργειες στο παιχνίδι τρία για να χτίσουν όλο και μεγαλύτερο προβάδισμα και να εξασφαλίσουν τελικά τη θέση τους στον Άνω Όμιλο, ξεκινώντας έτσι την επόμενη φάση.",
      "Από εκεί και πέρα, οι μελλοντικοί πρωταθλητές δεν κοίταξαν ποτέ πίσω. Οι ήρωές τους ήταν σχεδόν αθάνατοι στην κυρίαρχη νίκη τους με 2–0 ενάντια στους Xtreme Gaming, έχοντας μόλις έναν θάνατο στο παιχνίδι δύο. Με την ίδια ορμή, ξεκίνησαν έπειτα τη σειρά αγώνων στην κύρια εκδήλωση εναντίον των Cloud9, πετυχαίνοντας ακόμα μια καθοριστική νίκη. Το παιχνίδι δύο ήταν πολύ πιο αμφίρροπο, αλλά τελικά οι Liquid κατάφεραν μια επική εξάλειψη ομάδας αργά στον αγώνα και κέρδισαν μια θέση στους Τελικούς Άνω Ομίλου, εναντίον ενός γνωστού αντιπάλου που στέκεται συνεχώς εμπόδιο στο διάβα τους, των επικίνδυνων Gaimin Gladiators.",
      "Ανατρέποντας τα δεδομένα, οι Liquid άντεξαν την αρχική επιθετικότητα των Gaimin Gladiators και κέρδισαν τη σειρά με 2–0, βαδίζοντας αποφασιστικά προς τον Μεγάλο Τελικό. Αφού οι Gaimin Gladiators κατάφεραν να επιστρέψουν για ρεβάνς, οι Team Liquid άδραξαν την ευκαιρία να δείξουν ότι τα αποτελέσματα του πρώτου αγώνα δεν ήταν τυχαία. Αποτελείωσαν τον αιώνιο αντίπαλό τους με ένα αποφασιστικό 3–0, κατακτώντας το Aegis και μια θέση στην ιστορία του Dota 2.",
      "Έχοντας κατακτήσει το απόλυτο σύμβολο της νίκης, τα ονόματά τους θα χαραχτούν για πάντα πάνω στο Aegis of Champions:",
      "[b]2024 – Team Liquid[/b]",
      "[list]",
      "[*] Michael «miCKe» Vu",
      "[*] Michał «Nisha» Jankowski",
      "[*] Neta «33» Shapira",
      "[*] Samuel «Boxi» Svahn",
      "[*] Aydin «Insania» Sarkohi",
      "[/list]",
      "[b]Αναδρομή[/b]",
      "Θα θέλαμε να ευχαριστήσουμε όλους τους παίκτες, τα ταλέντα και όλα τα μέλη της κοινότητας του Dota που βοήθησαν για άλλη μία φορά να πραγματοποιηθεί αυτός ο παγκόσμιος εορτασμός. Αν χάσατε μέρος του τουρνουά ή απλά θέλετε να ξαναζήσετε τους απίστευτους αγώνες, μεταβείτε στο [url=https://www.youtube.com/user/dota2]YouTube του Dota 2[/url] για να βρείτε επαναλήψεις από ολόκληρο το τουρνουά. Μπορείτε επίσης να βρείτε ένα σύνολο φωτογραφιών από τη διοργάνωση στο [url=https://www.instagram.com/dota2]Instagram του Dota 2[/url] και στο [url=https://www.flickr.com/photos/dota2ti/]flickr του Dota 2[/url].",
      "[b]Τιμήστε τους πρωταθλητές[/b]",
      "Είναι πλέον διαθέσιμες για αγορά οι κάψουλες αυτοκόλλητων ειδικής έκδοσης πρωταθλητών για τους Team Liquid. Κάθε κάψουλα περιέχει ένα αυτοκόλλητο με τους miCKe, Nisha, 33, Boxi, Insania ή τους Team Liquid. Το 50% όλων των πωλήσεων θα πάει απευθείας στους Team Liquid.",
      "[b]Το Compendium του The International[/b]",
      "Αν δεν έχετε ολοκληρώσει όλες τις προκλήσεις και δεν έχετε λάβει όλες τις ανταμοιβές στο Compendium του The International 2024, υπάρχει ακόμα λίγος χρόνος πριν τη λήξη του. Μπορείτε ακόμα να κερδίσετε επιπλέον επίπεδα για το Compendium σας μέχρι την Τρίτη 15 Οκτωβρίου. Τα υπόλοιπα καλούδια, όπως πακέτα υποστηρικτών και ταλέντων, θα είναι διαθέσιμα για μερικές ακόμα εβδομάδες.",
      "[b]Επερχόμενος ήρωας και Crownfall – Πράξη IV[/b]",
      "Επίσης, σε περίπτωση που χάσατε το τρέιλερ κατά τη διάρκεια του The International, ανακοινώσαμε τον επόμενο ήρωα του Dota. Είναι ο αρχηγός των Απτήνων, ο ορκισμένος εχθρός της Βασίλισσας Ιμπίρια και γενικά ένας ταραχοποιός. [url=https://www.youtube.com/watch?v=ZqIFVTc8j80]Ο Kez θα ενταχθεί στο ρόστερ των ηρώων του Dota[/url] όταν κυκλοφορήσει η Πράξη IV του Crownfall."
    ],
    "commentcount": 434,
    "tags": [
      "mod_reviewed",
      "ModAct_1434573178_1726874146_0",
      "ModAct_1294976491_1727118145_4"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "4848777451364620786",
    "event_gid": "4692277172977135795",
    "voteupcount": 11425,
    "votedowncount": 1108,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1726872300,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4848777451364620786",
  "rtime32_last_modified": 1730847147,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1727118145,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "unlisted": 0,
  "votes_up": 11425,
  "votes_down": 1108,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4848777451364620786",
  "video_preview_type": "youtube",
  "video_preview_id": "ZqIFVTc8j80",
  "clan_steamid_original": "103582791433224455"
}