{
  "gid": "4692277172977135795",
  "clan_steamid": "103582791433224455",
  "event_name": "De grote kampioenen van The International",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1726872300,
  "rtime32_end_time": 1726875000,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "f8f19d42984bce7a36969a02727a79ac4e91f558.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1726864378
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1726858524
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1727113391
      }
    ]
  },
  "announcement_body": {
    "gid": "4692277172977135796",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "De grote kampioenen van The International",
    "posttime": 1726872360,
    "updatetime": 1727113391,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/5d614dc7454bfde1701834ffc951eb194a3a55af.jpg[/img]Wij feliciteren Team Liquid, de grote kampioenen van The International 2024. Dit meedogenloze Liquid-team liet tijdens het hele toernooi maar drie keer een overwinning liggen en heeft een leger aan formidabele tegenstanders van de kaart geveegd. Met hun indrukwekkende optreden hebben ze de titel van het beste Dota-team ter wereld meer dan verdiend.",
      "De weg van Team Liquid naar de Aegis begon rustig met twee wedstrijdseries waarin ze met 2-0 wonnen van zowel Aurora Gaming als beastcoast. Maar na het daaropvolgende 0-2 verlies tegen de voormalige kampioenen van Team Spirit, werden we allemaal met de neus op de feiten gedrukt en eraan herinnerd dat de weg naar onsterfelijkheid bezaaid is met geduchte tegenstanders.",
      "Hun volgende tegenstander bewees dat eens te meer. Liquid had een 1-0 voordeel en kon de winnaarsronde al bijna ruiken, maar de underdogs van BB Team wisten de tweede wedstrijd van dit kwalificatieduel te winnen, waardoor Liquid opeens oog in oog stond met de mogelijkheid om in de veel lastigere verliezersronde uit te moeten komen. Liquid liet zich echter niet uit het veld slaan en benutte alle kansen van de vroege actie in het derde spel, waarna ze steeds verder konden uitlopen en hun plaats in de winnaarsronde veilig wisten te stellen.",
      "Vanaf dat moment was er geen houden meer aan. Hun helden waren praktisch onverslaanbaar tijdens hun overtuigende 2-0 overwinning op Xtreme Gaming en in het tweede duel werd er zelfs maar één van hun helden gedood. Ze wisten die koers vast te houden en begonnen hun serie op het hoofdpodium met nog een klinkende overwinning, deze keer tegen Cloud9. De tweede wedstrijd was beter in evenwicht. Het ging een tijdje gelijk op, maar uiteindelijk wist Liquid een legendarische eindfase om te zetten in een teamwipe en een plek in de finale van de winnaarsronde, tegen een wel heel bekende tegenstander – en een eeuwig obstakel op hun pad – de altijd gevaarlijke Gaimin Gladiators.",
      "Maar de geschiedenis herhaalde zich dit keer niet: Liquid kon de vroege aanvallen van Gaimin weerstaan en haalde overtuigend de grote finale door de serie met 2-0 te winnen. Gaimin wist zich nog een keer terug te vechten voor een kans op revanche, maar Team Liquid greep die gelegenheid aan om te bewijzen dat ze de eerste keer niet per ongeluk hadden gewonnen. Ze rekenden vakkundig af met hun oude aartsrivaal en wisten met een 3-0 overwinning de Aegis en een plek in de geschiedenis van Dota 2 te bemachtigen.",
      "Als het ultieme symbool van hun overwinning zullen deze namen voor altijd in de Aegis of Champions worden gegraveerd:",
      "[b]2024 - Team Liquid[/b]",
      "[list]",
      "[*] Michael 'miCKe' Vu",
      "[*] Michał 'Nisha' Jankowski",
      "[*] Neta '33' Shapira",
      "[*] Samuel 'Boxi' Svahn",
      "[*] Aydin 'Insania' Sarkohi",
      "[/list]",
      "[b]Terugblik[/b]",
      "We willen nogmaals alle spelers, al het talent en de hele Dota-community bedanken voor hun bijdrage om dit wereldwijde evenement tot een groot feest te maken. Als je een gedeelte van het toernooi hebt gemist of gewoon nog eens wilt nagenieten van alle ongelofelijke actie, ga dan naar het [url=https://www.youtube.com/user/dota2]YouTube-kanaal van Dota 2[/url], waar je herhalingen kunt vinden van het hele toernooi. Daarnaast kun je op onze [url=https://www.instagram.com/dota2]Dota 2-Instagram[/url] en [url=https://www.flickr.com/photos/dota2ti/]Dota 2-flickr[/url] terecht voor een schat aan foto's van het evenement.",
      "[b]Vier de kampioenen[/b]",
      "Er zijn nu speciale capsules met kampioensstickers te koop voor Team Liquid. In iedere capsule vind je één sticker met miCKe, Nisha, 33, Boxi, Insania of het hele Team Liquid erop. 50% van de opbrengst gaat rechtstreeks naar Team Liquid.",
      "[b]Compendium van The International[/b]",
      "Als je nog uitdagingen hebt openstaan en nog niet alle beloningen hebt opgeëist voor het compendium van The International 2024, dan heb je nog even de tijd. Je kunt nog tot dinsdag 15 oktober het level van je compendium verhogen en andere goodies, zoals fanclubpakketten, talentbundels en kampioensstickers, zijn nog een paar weken langer beschikbaar.",
      "[b]Nieuwe held en Act IV van Crownfall[/b]",
      "En mocht je de trailer hebben gemist tijdens The International: we hebben de nieuwe Dota-held aangekondigd. Leider van de Grondvasten, gezworen vijand van Koningin Imperia en onruststoker pur sang [url=https://www.youtube.com/watch?v=ZqIFVTc8j80]Kez is onze nieuwste aanwinst[/url] en zal zich na de release van Crownfall Act IV aansluiten bij de huidige ploeg van Dota-helden."
    ],
    "commentcount": 434,
    "tags": [
      "mod_reviewed",
      "ModAct_1434573178_1726874146_0",
      "ModAct_1294976491_1727118145_4"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "4848777451364620786",
    "event_gid": "4692277172977135795",
    "voteupcount": 11425,
    "votedowncount": 1108,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1726872300,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4848777451364620786",
  "rtime32_last_modified": 1730847147,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1727118145,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "unlisted": 0,
  "votes_up": 11425,
  "votes_down": 1108,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4848777451364620786",
  "video_preview_type": "youtube",
  "video_preview_id": "ZqIFVTc8j80",
  "clan_steamid_original": "103582791433224455"
}