{
  "gid": "4692277172977135795",
  "clan_steamid": "103582791433224455",
  "event_name": "Marii campioni ai turneului The International",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1726872300,
  "rtime32_end_time": 1726875000,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "f8f19d42984bce7a36969a02727a79ac4e91f558.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1726864378
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1726858524
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1726872358
      }
    ]
  },
  "announcement_body": {
    "gid": "4692277172977135796",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Marii campioni ai turneului The International",
    "posttime": 1726872360,
    "updatetime": 1726872360,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/5d614dc7454bfde1701834ffc951eb194a3a55af.jpg[/img]Felicitări Team Liquid, marea campioană a turneului The International 2024. Pierzând doar trei jocuri de-a lungul campionatului, Team Liquid și-a îngenunchiat adversarii și a reușit să se impună drept cea mai bună echipă de Dota din lume.",
      "Team Liquid a început cu dreptul campionatul și a reușit să obțină două victorii cu scorul de 2-0 în confruntările cu Aurora Gaming și beastcoast, însă a pierdut cu 2-0 în fața campioanei de anul trecut, Team Spirit, amintindu-ne astfel tuturor că drumul spre trofeu este presărat cu adversari formidabili.",
      "Următoarea adversară n-a făcut nimic altceva decât să demonstreze cele spuse anterior. Deși Team Liquid se afla în avantaj cu un scor de 1-0, iar grupa superioară părea asigurată, echipa mai slab cotată, BB Team, a reușit să se impună în cel de-al doilea joc din seria de meciuri pentru repartizarea în grupe și să o pună astfel pe Team Liquid în fața riscului de a urma calea mai grea din grupa inferioară. Team Liquid nu s-a lăsat descurajată și a reușit chiar de la începutul celui de-al treilea joc să se impună pe câmpul de luptă, fapt ce i-a asigurat în cele din urmă locul în grupa superioară a fazei următoare.",
      "Odată ajunsă în grupa superioară, echipa care urma să devină campioană nu a mai privit înapoi. Team Liquid a obținut o victorie răsunătoare cu scorul de 2-0 împotriva echipei Xtreme Gaming după ce eroii săi au părut nemuritori în cel de-al doilea joc, în care adversarii au reușit să obțină doar o singură ucidere. Team Liquid a rămas pe val și în prima sa serie de meciuri de pe scena principală împotriva echipei Cloud9 și a reușit să-și zdrobească adversara. Deși al doilea meci a fost unul mai strâns, Liquid a reușit spre sfârșitul partidei să elimine întreaga echipă adversă și să-și asigure un loc în următoarea etapă a grupei superioare în care urma să înfrunte o adversară familiară, periculoasa echipă Gaimin Gladiators, care a fost un obstacol constant în drumul său din campionat.",
      "Împotriva tuturor așteptărilor, Team Liquid a reușit să facă față provocărilor echipei Gaimin Gladiators de la începutul meciului și a câștigat cu 2-0 seria de meciuri, avansând astfel în marea finală. Gaimin Gladiators a reușit în urma finalei din grupa inferioară să-și asigure revanșa față de Team Liquid, însă echipa din urmă a profitat de această ocazie pentru a demonstra că rezultatele primei întâlniri nu au fost întâmplătoare. Team Liquid a obținut o victorie răsunătoare cu scorul de 3-0 în fața vechii sale rivale și și-a asigurat trofeul Aegis și un loc în istoria Dota 2.",
      "Drept simbol suprem al acestei victorii importante, numele acestor jucători vor fi gravate pentru totdeauna pe trofeul Aegis of Champions:",
      "[b]2024 – Team Liquid[/b]",
      "[list]",
      "[*] Michael „miCKe” Vu",
      "[*] Michał „Nisha” Jankowski",
      "[*] Neta „33” Shapira",
      "[*] Samuel „Boxi” Svahn",
      "[*] Aydin „Insania” Sarkohi",
      "[/list]",
      "[b]Retrospectivă[/b]",
      "Am dori să le mulțumim din nou tuturor jucătorilor, realizatorilor și celor din comunitatea Dota care ne-au susținut și au făcut posibilă această sărbătorire mondială. Dacă ai ratat vreun meci sau dorești să retrăiești momentele incredibile ale acestui turneu, accesează [url=https://www.youtube.com/user/dota2]canalul Dota 2 de YouTube[/url] pentru a putea urmări reluările întregului turneu. De asemenea, o mulțime de fotografii de la eveniment sunt disponibile pe [url=https://www.instagram.com/dota2]contul Dota 2 de Instagram[/url] și [url=https://www.flickr.com/photos/dota2ti/]contul Dota 2 de Flickr[/url].",
      "[b]Sărbătorirea campionilor[/b]",
      "Capsulele cu ediția specială a abțibildurilor cu campioni sunt disponibile acum spre achiziție pentru Team Liquid. Fiecare capsulă conține un abțibild cu miCKe, Nisha, 33, Boxi, Insania sau Team Liquid. 50% din toate încasările generate vor fi distribuite direct către Team Spirit.",
      "[b]Compendiul The International[/b]",
      "Dacă mai ai de finalizat câteva provocări și de revendicat câteva recompense din compendiul The International 2024, mai ai la dispoziție ceva timp. Vei putea continua să obții niveluri suplimentare pentru compendiul tău până marți, 15 octombrie. Restul obiectelor tematice, precum pachetele fan cluburilor, pachetele cu realizatori și abțibildurile cu campioni vor continua să rămână disponibile timp de câteva săptămâni după această dată.",
      "[b]Noul erou și actul IV din Căderea Coroanei[/b]",
      "De asemenea, în cazul în care ai ratat trailerul de la The International, am anunțat următorul erou din Dota. Liderul nezburătorilor, dușmanul declarat al Reginei Imperia și un încurcă-lume notoriu, [url=https://www.youtube.com/watch?v=ZqIFVTc8j80]Kez se va alătura listei eroilor din Dota[/url] odată cu lansarea Actului IV din Căderea Coroanei."
    ],
    "commentcount": 2,
    "tags": [],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "4848777451364620786",
    "event_gid": "4692277172977135795",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4848777451364620786",
  "rtime32_last_modified": 1726872388,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4848777451364620786",
  "video_preview_type": "youtube",
  "video_preview_id": "ZqIFVTc8j80",
  "clan_steamid_original": "103582791433224455"
}