{
  "gid": "4692277172977135795",
  "clan_steamid": "103582791433224455",
  "event_name": "Die Champions von The International",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1726872300,
  "rtime32_end_time": 1726875000,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "f8f19d42984bce7a36969a02727a79ac4e91f558.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1726864378
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1726858524
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1727113391
      }
    ]
  },
  "announcement_body": {
    "gid": "4692277172977135796",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Die Champions von The International",
    "posttime": 1726872360,
    "updatetime": 1727113391,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/5d614dc7454bfde1701834ffc951eb194a3a55af.jpg[/img]Herzlichen Glückwunsch an Team Liquid, die Champions von The International 2024. Mit nur drei Niederlagen während des gesamten Turniers deklassierte Team Liquid die furchterregende Konkurrenz und sicherte sich verdient den Titel des besten Dota-Teams der Welt.",
      "Team Liquids Eroberung der Ägis der Champions begann mit zwei souveränen Siegesserien (jeweils 2–0) gegen Aurora Gaming und beastcoast. Doch eine klare Niederlage (0–2) gegen den Titelverteidiger Team Spirit erinnerte die Spieler daran, dass der Weg zur Unsterblichkeit mit gefährlichen Kontrahenten gespickt ist.",
      "Ihr nächster Gegner sollte dies erneut unter Beweis stellen. Nachdem Team Liquid in Führung ging und das Obere Bracket schon zum Greifen nahe schien, konnten die Außenseiter von BB Team die zweite Partie des Platzierungsspiels für sich entscheiden und drohten somit, Team Liquid in das wesentlich schwierigere Untere Bracket zu stürzen. Doch Team Liquid zeigte sich unbeeindruckt und erarbeitete sich in der dritten Partie schon früh einen großen Vorsprung. Der Sieg und ein Platz im Oberen Bracket waren somit nur noch eine Formalität.",
      "Dort angekommen, ließen die künftigen Champions nichts mehr anbrennen. Ihre Helden schienen bei ihrem dominanten Sieg (2–0) gegen Xtreme Gaming gar unbesiegbar zu sein: In der zweiten Partie hatten sie nur einen einzigen Tod zu beklagen. Mit diesem Rückenwind setzten sie ihre Erfolgsserie auf der Hauptbühne gegen Cloud9 mit einem weiteren Paukenschlag fort. Die zweite Partie entwickelte sich zu einem ausgeglichenen Schlagabtausch. Doch dank eines epischen Kampfes gegen Ende der Partie, der in der vollständigen Auslöschung von Cloud9 gipfelte, konnte sich Team Liquid den Sieg und damit den Einzug in das Finale des Oberen Brackets sichern. Dort wartete mit den Gaimin Gladiators ein altbekannter und gefürchteter Gegner.",
      "Immer wieder war Team Liquid in der Vergangenheit an dieser Hürde gescheitert, doch dieses Mal hielten sie den frühen Angriffen der Gaimin Gladiators stand, gewannen die Begegnung mit 2–0 und zogen eindrucksvoll ins Finale ein. Nachdem sich die Gaimin Gladiators gegen Tundra Esports einen Rückkampf erstritten hatten, demonstrierte Team Liquid im großen Finale, dass das Ergebnis der ersten Begegnung kein Zufall war. Sie besiegten ihren alten Erzfeind mit einem eindeutigen 3–0, um sich die Ägis und ihren Platz in der glorreichen Geschichte von Dota 2 zu sichern.",
      "Als Träger des ultimativen Siegessymbols sollen diese Namen für immer auf der Ägis der Champions zu lesen sein:",
      "[b]Team Liquid 2024[/b]",
      "[list]",
      "[*] Michael „miCKe“ Vu",
      "[*] Michał „Nisha“ Jankowski",
      "[*] Neta „33“ Shapira",
      "[*] Samuel „Boxi“ Svahn",
      "[*] Aydin „Insania“ Sarkohi",
      "[/list]",
      "[b]Ein Blick zurück[/b]",
      "Wir möchten uns bei allen Spielern, Talenten und der gesamten Dota-Community noch einmal dafür bedanken, dass wir dieses weltumspannende Event gemeinsam erleben durften. Falls Sie Begegnungen des Turniers verpasst haben oder einige der unglaublichen Spielmomente erneut erleben möchten, können Sie sich auf dem [url=https://www.youtube.com/user/dota2]YouTube-Kanal von Dota 2[/url] Aufnahmen des gesamten Turniers anschauen. Auf [url=https://www.instagram.com/dota2]Instagram[/url] und [url=https://www.flickr.com/photos/dota2ti/]flickr[/url] können Sie auch zahlreiche Fotos vom Event ansehen.",
      "[b]Ein Hoch auf die Champions[/b]",
      "Besondere Aufkleberkapseln der Champions sind jetzt für Team Liquid erhältlich. Jede Kapsel enthält einen Aufkleber von miCKe, Nisha, 33, Boxi, Insania oder das Teamlogo von Team Liquid. 50 % aller Erlöse aus dem Verkauf fließen direkt an Team Liquid.",
      "[b]Das Kompendium zu The International[/b]",
      "Falls Sie noch einige Herausforderungen zu bewältigen und Belohnungen einzulösen haben, bleibt Ihnen noch etwas Zeit, bis das Kompendium zu The International 2024 abläuft. Sie können noch bis Dienstag, den 15. Oktober, weitere Kompendium-Level erhalten. Andere Gegenstände wie Fanclub- und Talentpakete sowie die Aufkleberkapsel der Champions werden noch einige Wochen länger erhältlich sein.",
      "[b]Neuer Held und Thronsturz-Akt IV[/b]",
      "Während The International haben wir unseren neuen Dota-Helden angekündigt. Klicken Sie hier, falls Sie den Trailer verpasst haben: [url=https://www.youtube.com/watch?v=ZqIFVTc8j80]Der Anführer der Fluglosen, der Erzfeind von Königin Imperia und der allgemeine Unruhestifter Kez[/url] schließt sich dem Heldenkader von Dota an, sobald Thronsturz-Akt IV veröffentlicht wird."
    ],
    "commentcount": 434,
    "tags": [
      "mod_reviewed",
      "ModAct_1434573178_1726874146_0",
      "ModAct_1294976491_1727118145_4"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4848777451364620786",
    "event_gid": "4692277172977135795",
    "voteupcount": 11425,
    "votedowncount": 1108,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1726872300,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4848777451364620786",
  "rtime32_last_modified": 1730847147,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1727118145,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "votes_up": 11425,
  "votes_down": 1108,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4848777451364620786",
  "video_preview_type": "youtube",
  "video_preview_id": "ZqIFVTc8j80",
  "clan_steamid_original": "103582791433224455"
}