{
  "gid": "4692277172977135795",
  "clan_steamid": "103582791433224455",
  "event_name": "Campioni del The International",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1726872300,
  "rtime32_end_time": 1726875000,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "f8f19d42984bce7a36969a02727a79ac4e91f558.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1726864378
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1726858524
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1727113391
      }
    ]
  },
  "announcement_body": {
    "gid": "4692277172977135796",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Campioni del The International",
    "posttime": 1726872360,
    "updatetime": 1727113391,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/5d614dc7454bfde1701834ffc951eb194a3a55af.jpg[/img]Congratulazioni a Team Liquid, campioni del The International 2024. Con sole tre sconfitte in tutto il campionato, l'inarrestabile Team Liquid ha spazzato via una schiera di temibili avversari e si è affermata come una delle migliori squadre di Dota al mondo.",
      "Il cammino di Team Liquid verso l'Egida è iniziato senza problemi, con due vittorie per 2-0 contro Aurora Gaming e beastcoast, ma uno 0-2 contro i campioni dello scorso anno, Team Spirit, ha sottolineato che la strada verso l'immortalità è disseminata di avversari formidabili.",
      "Il loro prossimo avversario non avrebbe fatto altro che dimostrare ulteriormente questa tesi. Con Team Liquid in vantaggio per 1-0 e con il girone superiore quasi in tasca, gli sfavoriti di BB Team si sono assicurati una vittoria nella seconda partita della fase in cui si decide la distribuzione delle squadre nei playoff, minacciando Team Liquid con la sfortunata possibilità di finire nel girone inferiore. Imperterriti, i ragazzi di Team Liquid hanno sfruttato al meglio la parte iniziale della terza partita per prendere un notevole vantaggio sugli avversari e assicurarsi finalmente un posto nel girone superiore.",
      "Da quel momento in poi, i futuri campioni non si sono più voltati indietro. I loro Eroi si sono dimostrati praticamente indistruttibili nella clamorosa vittoria per 2-0 contro gli Xtreme Gaming, con una sola vittima nella seconda partita. Continuando su questa linea, Team Liquid ha aperto la serie successiva sul palco principale con un'altra splendida vittoria contro Cloud9. Anche se la seconda partita è stata più combattuta, Team Liquid è riuscita a eliminare l'intera squadra avversaria alla fine della battaglia, ottenendo un posto nella finale del girone superiore contro un avversario ben noto che ha costantemente spaventato Team Liquid, Gaimin Gladiators.",
      "Contro ogni pronostico, Team Liquid ha resistito all'aggressione iniziale di Gaimin Gladiators vincendo la serie per 2-0 e qualificandosi per la finalissima. Dopo che Gaimin si è battuto per riprendersi la rivincita, Team Liquid ha colto l'occasione per dimostrare che i risultati del primo incontro non sono stati un caso fortuito. Hanno sconfitto la loro vecchia nemesi con un decisivo 3-0 per assicurarsi l'Egida e un posto nella storia di Dota 2.",
      "Come portatori del simbolo supremo della vittoria, questi nomi saranno per sempre incisi sull'Egida dei Campioni:",
      "[b]Team Liquid - 2024[/b]",
      "[list]",
      "[*] Michael \"miCKe\" Vu",
      "[*] Michał \"Nisha\" Jankowski",
      "[*] Neta \"33\" Shapira",
      "[*] Samuel \"Boxi\" Svahn",
      "[*] Aydin \"Insania\" Sarkohi",
      "[/list]",
      "[b]Guardando al passato[/b]",
      "Vorremmo ringraziare ancora una volta tutti i giocatori, i talenti e tutta la Comunità di Dota per aver contribuito a dare vita a questa celebrazione globale. Se ti sei perso una parte del torneo o vuoi semplicemente rivivere le giocate incredibili durante le partite, visita il [url=https://www.youtube.com/user/dota2]canale YouTube di Dota 2[/url], dove troverai l'intero torneo. Inoltre, puoi trovare una gran quantità di foto dell'evento sul [url=https://www.instagram.com/dota2]canale Instagram di Dota 2[/url] e sulla [url=https://www.flickr.com/photos/dota2ti/]pagina Flickr di Dota 2[/url].",
      "[b]Celebriamo i Campioni[/b]",
      "La serie speciale di adesivi dei Campioni per Team Liquid è ora disponibile per l'acquisto. Ogni capsula contiene un adesivo di MiCke, Nisha, 33, Boxi, Insania o Team Liquid. Il 50% di tutte le vendite verrà devoluto direttamente a Team Liquid.",
      "[b]Il Compendio del The International[/b]",
      "Se hai ancora delle sfide da completare e delle ricompense da riscattare nel Compendio del The International 2024, hai ancora un po' di tempo prima che tutto si concluda. Puoi ancora accaparrarti livelli aggiuntivi per il tuo Compendio fino a martedì 15 ottobre; altri gadget come i pacchetti dei tifosi, i pacchetti dei talenti e gli adesivi dei campioni saranno disponibili ancora per qualche settimana.",
      "[b]Nuovo Eroe e Atto IV di Crownfall in arrivo[/b]",
      "Inoltre, nel caso ti fossi perso il trailer durante The International, abbiamo annunciato il prossimo Eroe di Dota. Capo dei Tarpati, nemico giurato della regina Imperia e più in generale piantagrane, [url=https://www.youtube.com/watch?v=ZqIFVTc8j80]Kez entrerà a far parte del roster degli Eroi di Dota [/url] all'uscita dell'Atto IV di Crownfall."
    ],
    "commentcount": 434,
    "tags": [
      "mod_reviewed",
      "ModAct_1434573178_1726874146_0",
      "ModAct_1294976491_1727118145_4"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "4848777451364620786",
    "event_gid": "4692277172977135795",
    "voteupcount": 11425,
    "votedowncount": 1108,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1726872300,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4848777451364620786",
  "rtime32_last_modified": 1730847147,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1727118145,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "crowdin_project_id": null,
  "crowdin_file_id": null,
  "automatically_push_to_crowdin": null,
  "votes_up": 11425,
  "votes_down": 1108,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4848777451364620786",
  "video_preview_type": "youtube",
  "video_preview_id": "ZqIFVTc8j80",
  "clan_steamid_original": "103582791433224455"
}