{
  "gid": "4692277172977135795",
  "clan_steamid": "103582791433224455",
  "event_name": "Os campeões do International",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1726872300,
  "rtime32_end_time": 1726875000,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "f8f19d42984bce7a36969a02727a79ac4e91f558.jpg"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561198042665686",
        "rtUpdated": 1726864378
      },
      {
        "strSteamID": "76561199113010392",
        "rtUpdated": 1726858524
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1727113391
      }
    ]
  },
  "announcement_body": {
    "gid": "4692277172977135796",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Os campeões do International",
    "posttime": 1726872360,
    "updatetime": 1727113391,
    "body": [
      "[img]{STEAM_CLAN_IMAGE}/3703047/5d614dc7454bfde1701834ffc951eb194a3a55af.jpg[/img]Parabéns à Team Liquid, a equipa campeã do International 2024. Perdendo apenas três partidas durante todo o campeonato, o implacável plantel da Team Liquid arrasou um exército de temíveis concorrentes para conquistar incontestavelmente o título de melhor equipa de Dota do mundo.",
      "A jornada triunfante da Team Liquid começou bem com um par de vitórias por 2-0 contra a Aurora Gaming e a beastcoast, mas uma derrota por 0-2 contra a anterior equipa campeã, a Team Spirit, lembrou a todos de que o caminho para a imortalidade está repleto de adversários formidáveis.",
      "E certamente formidáveis foram os seus próximos oponentes. Após a Team Liquid conseguir uma vantagem de 1-0 e um lugar no Grupo Superior dentro do seu alcance, a desafiadora BB Team assegurou uma vitória na segunda partida da série de jogos que decidem a distribuição das equipas nos playoffs, ameaçando a Team Liquid com a possibilidade infeliz de acabar no Grupo Inferior. Inabalados, os jogadores da Team Liquid dominaram a terceira partida desde o início, culminando numa vitória esmagadora e um lugar no Grupo Superior da fase seguinte.",
      "Nos playoffs, os eventuais campeões foram imparáveis. Os heróis que usaram foram quase imortais numa arrasadora vitória por 2-0 contra a Xtreme Gaming, com apenas uma única morte na segunda partida. Continuando com este lanço, a Team Liquid inaugurou a série seguinte no palco principal com outra vitória estonteante contra a Cloud9. A segunda partida da série foi renhida, mas a Team Liquid conseguiu exterminar a equipa adversária no fim do jogo, assegurando a vitória e um lugar na final do Grupo Superior contra uma equipa rival familiar (e um obstáculo constante no seu caminho): a perigosa Gaimin Gladiators.",
      "Invertendo precedentes, a Team Liquid resistiu à agressão inicial da Gaimin Gladiators e conseguiu o resultado de 2-0 na série, marchando invictamente para a Grande Final. Após a Gaimin Gladiators ter assegurado uma oportunidade de desforra na Grande Final, a Team Liquid aproveitou para demonstrar que os resultados do duelo anterior na final do Grupo Superior não foram uma questão de sorte. A equipa derrotou a sua rival num decisivo 3-0, conquistando assim a Égide dos Campeões e um lugar na História do Dota 2.",
      "Os nomes destes novos detentores do derradeiro símbolo do triunfo ficarão para sempre gravados na Égide dos Campeões:",
      "[b]2024 - Team Liquid[/b]",
      "[list]",
      "[*] Michael \"miCKe\" Vu",
      "[*] Michał \"Nisha\" Jankowski",
      "[*] Neta \"33\" Shapira",
      "[*] Samuel \"Boxi\" Svahn",
      "[*] Aydin \"Insania\" Sarkohi",
      "[/list]",
      "[b]Em retrospetiva[/b]",
      "Gostaríamos de agradecer mais uma vez a todos os jogadores, talentos e fãs do Dota por ajudarem a dar vida a esta celebração global. Caso tenhas perdido o torneio ou apenas queiras reviver jogadas incríveis, acede ao [url=https://www.youtube.com/user/dota2]canal no YouTube do Dota 2[/url], onde podes encontrar as repetições de todo o torneio. Também podes encontrar várias fotografias do evento no [url=https://www.instagram.com/dota2]Instagram do Dota 2[/url] e no [url=https://www.flickr.com/photos/dota2ti/]Flickr do Dota 2[/url].",
      "[b]A celebração dos campeões[/b]",
      "Estão agora disponíveis versões especiais de Campeão dos autocolantes da Team Liquid. Cada cápsula contém um autocolante de miCKe, Nisha, 33, Boxi, Insania ou da Team Liquid. 50% de todas as receitas revertem diretamente para a Team Liquid.",
      "[b]Compêndio do International[/b]",
      "Se tiveres algum desafio por completar e recompensas por reclamar no Compêndio do International 2024, ainda tens tempo para tal. Podes adquirir mais alguns níveis para o teu Compêndio até terça‑feira, 15 de outubro. Outras coisas como pacotes de Claques, pacotes de talentos e autocolantes dos campeões estarão disponíveis por mais algumas semanas.",
      "[b]O próximo herói e o Ato IV de Crownfall[/b]",
      "Para terminar, caso tenhas perdido o trailer que passou no International, anunciámos o próximo herói do Dota. Líder dos Não-Voadores, inimigo mortal da Rainha Imperia e arruaceiro em geral, [url=https://www.youtube.com/watch?v=ZqIFVTc8j80]Kez vai-se juntar ao plantel de heróis do Dota[/url] quando o Ato IV de Crownfall for lançado."
    ],
    "commentcount": 434,
    "tags": [
      "mod_reviewed",
      "ModAct_1434573178_1726874146_0",
      "ModAct_1294976491_1727118145_4"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "4848777451364620786",
    "event_gid": "4692277172977135795",
    "voteupcount": 11425,
    "votedowncount": 1108,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 1726872300,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4848777451364620786",
  "rtime32_last_modified": 1730847147,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1727118145,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 11425,
  "votes_down": 1108,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4848777451364620786",
  "video_preview_type": "youtube",
  "video_preview_id": "ZqIFVTc8j80",
  "clan_steamid_original": "103582791433224455"
}