{
  "gid": "501689139151766973",
  "clan_steamid": "103582791433224455",
  "event_name": "The International 2025: Αιτήματα για ζωντανή μετάδοση και άδεια χρήσης μεταδόσεων",
  "event_type": 28,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1738107840,
  "rtime32_end_time": 1738111260,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [
      "Companies interested in producing and distributing regional language broadcasts of The International 2025 are encouraged to apply now",
      "Les sociétés intéressées par un partenariat avec Valve pour produire et distribuer des diffusions de l'édition 2025 de The International dans différentes langues peuvent d'ores et déjà envoyer leur candidature.",
      "Le aziende interessate a produrre e distribuire le trasmissioni nella propria lingua del The International 2025 sono invitate a farne richiesta ora",
      "The International 2025의 현지 언어 방송 제작 및 배포에 관심이 있는 기업은 지금부터 신청하실 수 있습니다",
      "有意向制作和转播2025年国际邀请赛直播的公司可以从即日起提出申请",
      "我們鼓勵有興趣為 2025 年國際錦標賽製作並發佈地區語言實況直播的公司開始申請",
      "Мы ждём предложений от компаний, которые хотели бы проводить и распространять трансляцию The International 2025 на региональном языке",
      "เราขอแนะนำให้บริษัทที่สนใจในการผลิตและเผยแพร่การออกอากาศต่าง ๆ ในภาษาระดับภูมิภาคของ The International 2025 สมัครในตอนนี้",
      "「The International 2025」の各地域の言語での制作および配信に関心のある企業からの提案を募集中です",
      "As empresas interessadas em produzir e distribuir transmissões regionais do International 2025 em determinados idiomas devem efetuar o requerimento agora.",
      "Vi opfordrer firmaer, som er interesserede i at producere og distribuere regionale broadcasts på forskellige sprog under The International 2025, til at ansøge nu",
      "The International -tapahtuman alueellisten kielilähetysten tuottamisesta ja jakelusta kiinnostuneita yrityksiä pyydetään lähettämään lisenssihakemus",
      "Selskaper som er interesserte i å produsere og distribuere regionale sendinger av The International 2025 på forskjellige språk, oppfordres til å søke nå",
      "Företag som är intresserade av att producera och distribuera regionala språksändningar av The International 2025 uppmanas att ansöka nu",
      "A The International 2025 regionális nyelvű közvetítése és terjesztése iránt érdeklődő társaságokat arra bátorítjuk, hogy jelentkezzenek most.",
      "Hledáme společnosti, které mají zájem o produkci a distribuci regionálních přenosů ze šampionátu The International 2025.",
      "Companiile care sunt interesate să producă și să distribuie transmisiuni în limbile locale cu campionatul The International 2025 sunt încurajate să se înscrie acum",
      "The International 2025'in bölgesel dil yayınlarını yapmak ve dağıtmakla ilgilenen şirketleri başvuru yapmaya davet ediyoruz",
      "Estamos aceitando propostas de empresas interessadas em produzir e distribuir transmissões regionais em diferentes idiomas para o International 2025.",
      "Προτείνουμε στις εταιρείες που ενδιαφέρονται για την παραγωγή και διανομή μεταδόσεων του The International 2025 σε τοπικές γλώσσες να κάνουν αίτηση τώρα",
      "Ми вже приймаємо комерційні пропозиції від компаній, які зацікавлені в партнерстві з Valve для створення й поширення трансляцій The International 2025 своїми мовами"
    ],
    "localized_title_image": [],
    "localized_capsule_image": [
      "6daab563d5f3933fe6bc90da2c9108ffab92ab3c.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "automatically_push_updated_source": true,
    "valve_access_log": [
      {
        "strSteamID": "76561199476720737",
        "rtUpdated": 1738107874
      }
    ]
  },
  "announcement_body": {
    "gid": "501689139151766974",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "The International 2025: Αιτήματα για ζωντανή μετάδοση και άδεια χρήσης μεταδόσεων",
    "posttime": 1738107877,
    "updatetime": 1738107877,
    "body": [
      "Το The International 2025 έρχεται στη Γερμανία τον Σεπτέμβριο. Προτείνουμε στις εταιρείες που ενδιαφέρονται για την παραγωγή και διανομή μεταδόσεων του The International σε τοπικές γλώσσες να κάνουν αίτηση τώρα. ",
      "Όπως και τα τελευταία χρόνια, θα γίνουν αποδεκτές προτάσεις για την παραγωγή της ζωντανής μετάδοσης του The International στα ρωσικά, τα κινεζικά και τα ισπανικά. Μπορείτε να βρείτε την τεκμηρίωση του αιτήματος πρότασης (RFP), καθώς και οδηγίες για τον τρόπο υποβολής του [url=https://cdn.cloudflare.steamstatic.com/apps/dota2/assets/RFP_TI_2025_Official.pdf]εδώ[/url].",
      "Αν ενδιαφέρεστε για επιπλέον άδειες και μεταδόσεις, συμπληρώστε τη φόρμα που σχετίζεται με το αντίστοιχο αίτημα:",
      "[list]",
      "    [*]Οι εταιρείες παραγωγής που ενδιαφέρονται για εμπορική άδεια παραγωγής μετάδοσης του The International 2025 σε τοπική γλώσσα, χωρίς επιπλέον πρόσβαση στη διοργάνωση, μπορούν να συμπληρώσουν αυτήν την [url=https://docs.google.com/forms/d/e/1FAIpQLSf3Dke77rrtftifNh4eVEwix57WRTZXo4L_rRTlaX5R1THyog/viewform]αίτηση[/url].",
      "    [*]Οι πλατφόρμες μετάδοσης που ενδιαφέρονται για αναμετάδοση των επίσημων μεταδόσεων, μπορούν να κάνουν αίτηση [url=https://docs.google.com/forms/d/e/1FAIpQLSc9ECtSgjr1HrBYWsnT4A4EVOMM7aJMRuBZv3JhNGVvAOxSUQ/viewform]εδώ[/url].",
      "[/list]\t ",
      "Υπενθυμίζουμε ότι οι φαν του Dota 2 μπορούν να δημιουργήσουν αυστηρά και μόνο μη εμπορικές μεταδόσεις από το DOTATV, ακολουθώντας την Πολιτική Κοινότητας για Μετάδοση Dota 2 [url=https://www.dota2.com/dotatv]εδώ[/url] και δεν χρειάζεται να υποβάλουν επίσημο αίτημα.",
      "Επικοινωνήστε μαζί μας στη διεύθυνση theinternationalrfp@valvesoftware.com με τυχόν ερωτήσεις. ",
      "Ευχαριστούμε εκ των προτέρων όλους εσάς που ενδιαφέρεστε να συνεργαστείτε μαζί μας για να πάρει σάρκα και οστά το The International 2025.  "
    ],
    "commentcount": 38,
    "tags": [
      "hide_store",
      "hide_library_overview",
      "hide_library_detail",
      "mod_reviewed",
      "ModAct_1519738978_1738109007_0"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "598517164755911815",
    "event_gid": "501689139151766973",
    "voteupcount": 139,
    "votedowncount": 7,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "598517164755911815",
  "rtime32_last_modified": 1738169044,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1738109007,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "unlisted": 0,
  "votes_up": 139,
  "votes_down": 7,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "598517164755911815",
  "clan_steamid_original": "103582791433224455"
}