{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Ενημέρωση παιχνιδιού 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ενημέρωση παιχνιδιού 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "Η ενημέρωση 7.36c κυκλοφόρησε. Μπορείτε να δείτε τις σημειώσεις ενημέρωσης [url=https://www.dota2.com/patches/7.36c]εδώ[/url].",
      "Επιπλέον, διορθώθηκαν μερικά σφάλματα τις τελευταίες ημέρες:",
      "[list]",
      "[*] Διορθώθηκε πρόβλημα παροπλισμού των χλευασμών, όταν γίνονταν αλλαγή όψεων.",
      "[*] Διορθώθηκε απρόσμενος τερματισμός που σχετιζόταν με το Block of Cheese.",
      "[*] Διορθώθηκε απρόσμενος τερματισμός κατά τη δημιουργία αντικειμένων με αυτοαναπληρούμενες φορτίσεις σε προσαρμοσμένα παιχνίδια.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Abaddon και ο Nyx Assassin δεν απέφευγαν σωστά ζημιά.",
      "[*] Διορθώθηκε πρόβλημα όπου το Sanguivore του Bloodseeker θεράπευε λιγότερο από το προβλεπόμενο.",
      "[*] Διορθώθηκε πρόβλημα όπου το Bristleback του Bristleback με Snot Rocket εκτόξευε αγκάθια όταν λάμβανε επιδράσεις μεγάλης ζημιάς.",
      "[*] Διορθώθηκε το Aghanim's Scepter του Clinkz που δεν αύξανε τη ζημιά των σκελετών τοξοτών.",
      "[*] Διορθώθηκε σφάλμα όπου η πρώτη επίθεση του Burning Barrage του Clinkz δεν λάμβανε τις επαυξήσεις από το Tar Bomb.",
      "[*] Διορθώθηκε πρόβλημα όπου το Crystal Clone της Crystal Maiden εκτελούταν πάντα προς τον στόχο που ήταν επηρεασμένος από Frostbite, αν γινόταν εκτέλεση του Crystal Clone κατά την κίνηση επαναφοράς.",
      "[*] Διορθώθηκε πρόβλημα όπου το ταλέντο επιπέδου 10 του Dark Seer, «Ζημιά ψευδαισθήσεων Wall of Replica», δεν λειτουργούσε σωστά.",
      "[*] Διορθώθηκε πρόβλημα όπου το Precision Aura της Drow Ranger μερικές φορές προκαλούσε απρόσμενους τερματισμούς.",
      "[*] Διορθώθηκε πρόβλημα όπου το ταλέντο επιπέδου 15 του Earthshaker, «+200 βεληνεκές Fissure», δεν αύξανε το βεληνεκές του Fissure.",
      "[*] Διορθώθηκε πρόβλημα όπου το Overcharge του Io παρείχε αντίσταση επιβράδυνσης χωρίς Aghanim's Shard.",
      "[*] Διορθώθηκε πρόβλημα όπου το Special Delivery της Marci λειτουργούσε σε ψευδαισθήσεις της Marci.",
      "[*] Διορθώθηκε πρόβλημα όπου το ταλέντο επιπέδου 10 της Marci, «Βεληνεκές εκτέλεσης/άλματος Rebound», δεν αύξανε το βεληνεκές εκτέλεσης.",
      "[*] Διορθώθηκε πρόβλημα όπου αναβαθμίζονταν αυτόματα τα χαρακτηριστικά στον Meepo και στον Ogre Magi, ενώ θα μπορούσαν να αναβαθμίσουν κάποια ικανότητα.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Meepo δεν λάμβανε φορτίσεις Urn of Shadows και Spirit Vessel, όταν ήταν τοποθετημένα στην υποδοχή ουδέτερων αντικειμένων μέσω του Pack Rat.",
      "[*] Διορθώθηκε πρόβλημα όπου το Simian Stride του Monkey King δεν παρείχε μειωμένη επαναφόρτιση, όταν ο Monkey King ήταν μεταξύ 90% και 100% ζωής.",
      "[*] Διορθώθηκε πρόβλημα όπου το Ebb του Morphling εμφάνιζε λανθασμένες επαναφορτίσεις αντικειμένων.",
      "[*] Διορθώθηκε πρόβλημα όπου το Flow του Morphling μείωνε ελάχιστα τις επαναφορτίσεις.",
      "[*] Διορθώθηκε πρόβλημα όπου το Morph του Morphling έκλεβε μόνιμα το One Man Army του Axe.",
      "[*] Διορθώθηκε πρόβλημα όπου η ένδειξη εμβέλειας Blur της Phantom Assassin χρησιμοποιούσε τις παλιές τιμές.",
      "[*] Διορθώθηκε πρόβλημα όπου το Blur της Phantom Assassin με Aghanim's Scepter άλλαζε τη διάρκεια της καθυστέρησης αποκάλυψης.",
      "[*] Διορθώθηκε πρόβλημα όπου το Dying Light του Phoenix προκαλούσε λιγότερη ζημιά από την προβλεπόμενη.",
      "[*] Διορθώθηκε πρόβλημα όπου η επιβράδυνση ταχύτητας επίθεσης του Fire Spirits του Phoenix δεν χρησιμοποιούσε τις ενημερωμένες τιμές.",
      "[*] Διορθώθηκε πρόβλημα όπου το Trample του Primal Beast μερικές φορές προκαλούσε απρόσμενους τερματισμούς.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Riki και οι σύμμαχοί του είχαν πιθανότητα αστοχίας, όταν προσπαθούσαν να αρνηθούν εντός του σύννεφου καπνού.",
      "[*] Διορθώθηκε πρόβλημα όπου ο Rubick μπορούσε μερικές φορές να κλέψει το Second Chakram, την παλιά ικανότητα του Timbersaw.",
      "[*] Διορθώθηκε πρόβλημα όπου τα φίδια του Shadow Shaman με Aghanim's Shard έληγαν μερικές φορές πρόωρα.",
      "[*] Διορθώθηκε πρόβλημα όπου η Άρνηση Βοήθειας δεν σταματούσε το Hex του Shadow Shaman.",
      "[*] Διορθώθηκε πρόβλημα όπου ο συνδυασμός Ricochet II + Blade Mail της Snapfire ενεργοποιούσε επιθέσεις εξοστρακισμού εναντίον του Supernova.",
      "[*] Διορθώθηκε πρόβλημα όπου ο συνδυασμός Ricochet II + Lil' Shredder της Snapfire προκαλούσε λιγότερη ζημιά από την προβλεπόμενη.",
      "[*] Διορθώθηκε πρόβλημα όπου ο συνδυασμός Ricochet II + Revenant's Brooch της Snapfire εναντίον στόχων με υψηλή αποφυγή, έκανε τις δευτερεύουσες επιθέσεις να ενεργοποιούν περισσότερες δευτερεύουσες επιθέσεις.",
      "[*] Διορθώθηκε πρόβλημα όπου οι επιθέσεις του Ricochet II μπορούσαν να αστοχήσουν.",
      "[*] Διορθώθηκε πρόβλημα όπου το ενεργό μέρος του Aghanim's Shard της Spectre δεν ενημερωνόταν στις σωστές τιμές.",
      "[*] Διορθώθηκε το ταλέντο επιπέδου 15 της Templar Assassin, «Βεληνεκές επίθεσης και διαπέρασης Psi Blades», που παρείχε περισσότερο βεληνεκές επίθεσης από το προβλεπόμενο.",
      "[*] Διορθώθηκε πρόβλημα όπου ήταν λανθασμένο το βεληνεκές επίθεσης στην επεξήγηση του Metamorphosis του Terrorblade (αλλαγή μόνο στην επεξήγηση ικανότητας).",
      "[*] Διορθώθηκε πρόβλημα όπου το Sapling του Treant Protector μερικές φορές έκανε τις συμμαχικές μονάδες να «κολλούν» στο δέντρο.",
      "[*] Διορθώθηκε πρόβλημα όπου οι υποτακτικοί από το Abyssal Horde του Underlord δεν εξαπέλυαν επίθεση, αν η ρύθμιση «Αυτόματη επίθεση κλητευμένης μονάδας» ήταν απενεργοποιημένη.",
      "[*] Διορθώθηκε πρόβλημα όπου τα Plague Wards του Venomancer εξαπέλυαν επίθεση, όταν ο φορέας ήταν αόρατος στον στόχο.",
      "[*] Διορθώθηκε πρόβλημα όπου τα προσαρτημένα Plague Wards του Venomancer δεν τραβούσαν επιθετικότητα (aggro).",
      "[*] Διορθώθηκαν διάφορα προβλήματα με τους ακόλουθους του Visage.",
      "[*] Διορθώθηκε πρόβλημα όπου το Voodoo Switcheroo του Witch Doctor έκανε μερικές φορές τον Witch Doctor να «κολλήσει», αν φυτευόταν ένα δέντρο ενώ ήταν μεταμορφωμένος.",
      "[*] Διορθώθηκε πρόβλημα στο Ability Draft, όπου μερικές φορές γινόταν επιλογή μη επιθυμητής όψης.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 24,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}