{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Gameplayupdate 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Gameplayupdate 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "Gameplayupdate 7.36c is nu live. Bekijk de laatste wijzigingen [url=https://www.dota2.com/patches/7.36c]hier[/url].",
      "Daarnaast zijn er de afgelopen dagen ook een aantal problemen opgelost:",
      "[list]",
      "[*] Probleem opgelost waarbij uitgeruste bespottingen werden verwijderd bij het veranderen van facet.",
      "[*] Crash opgelost die gerelateerd was aan Block of Cheese.",
      "[*] Crash opgelost die zich voordeed bij het maken van items met zelfherstellende ladingen in aangepaste spellen.",
      "[*] Probleem opgelost waarbij Abaddon en Nyx Assassin schade niet juist ontweken.",
      "[*] Probleem opgelost waarbij Sanguivore van Bloodseeker voor minder genezing zorgde dan bedoeld.",
      "[*] Probleem opgelost met Bristleback van Bristleback, waarbij hij, als Snot Rocket was geactiveerd, overging op het afvuren van Quills wanneer hij bij een enkele aanval veel schade moest incasseren.",
      "[*] Probleem opgelost waarbij Aghanim's Scepter voor Clinkz er niet voor zorgde dat de gezondheid van Skeleton Archers werd verhoogd.",
      "[*] Probleem opgelost waarbij de eerste aanval met Burning Barrage van Clinkz niet profiteerde van de effecten van Tar Bomb.",
      "[*] Probleem opgelost waarbij Crystal Clone van Crystal Maiden altijd werd toegepast op het doelwit van Frostbite, als Crystal Clone werd geactiveerd tijdens de aanvalsanimatie van Frostbite.",
      "[*] Probleem opgelost waarbij het Level 10-talent van Dark Seer voor hogere illusieschade bij Wall of Replica niet correct werkte.",
      "[*] Probleem opgelost waarbij Precision Aura van Drow Ranger soms clientcrashes veroorzaakte.",
      "[*] Probleem opgelost waarbij het Level 15-talent voor Fissure-bereik van Earthshaker niet toenam zoals verwacht.",
      "[*] Probleem opgelost waarbij Overcharge van Io ook zonder Aghanim's Shard vertragingsweerstand toekende.",
      "[*] Probleem opgelost waarbij Special Delivery van Marci werkte op de illusies van Marci.",
      "[*] Probleem opgelost waarbij het Level 10-talent van Marci voor meer spreuk- en sprongbereik bij Rebound, niet zorgde voor een toegenomen spreukbereik.",
      "[*] Probleem opgelost waarbij Meepo en Ogre Magi automatisch een hoger level kregen voor hun attributen, terwijl ze in plaats daarvan ook een hoger level voor een vaardigheid hadden kunnen krijgen.",
      "[*] Probleem opgelost waarbij Meepo geen ladingen kreeg voor Urn of Shadows en Spirit Vessel wanneer deze via Pack Rat in het vak voor neutrale items werden gezet.",
      "[*] Probleem opgelost waarbij de afkoeltijd van Simian Stride van Monkey King niet werd verlaagd wanneer de HP van Monkey King zich tussen de 90% en 100% bevond.",
      "[*] Probleem opgelost met Ebb van Morphling waarbij de verkeerde afkoeltijden voor items werden weergegeven.",
      "[*] Probleem opgelost waarbij de afkoeltijden onder invloed van Flow van Morphling niet genoeg werden verminderd.",
      "[*] Probleem opgelost waarbij Morph van Morphling de One Man Army van Axe permanent stal.",
      "[*] Probleem opgelost waarbij er verouderde waarden werden weergegeven voor het bereik van Blur van Phantom Assassin.",
      "[*] Probleem opgelost waarbij Blur van Phantom Assassin met Aghanim's Scepter ervoor zorgde dat de duur van de onthullingsvertraging werd gewijzigd.",
      "[*] Probleem opgelost waarbij Dying Light van Phoenix minder schade veroorzaakte dan bedoeld.",
      "[*] Probleem opgelost waarbij er verouderde waarden werden gebruikt voor de aanvalssnelheidsvertraging van Fire Spirits van Phoenix.",
      "[*] Probleem opgelost waarbij Trample van Beast soms clientcrashes veroorzaakte.",
      "[*] Probleem opgelost waarbij Riki en zijn bondgenoten kans hadden om te missen bij een poging tot afwijzen tijdens Smoke Screen.",
      "[*] Probleem opgelost waarbij Rubick soms de oude vaardigheid Tweede Chakram van Timbersaw kon stelen.",
      "[*] Probleem opgelost waarbij de Serpent Wards van Shadow Shaman met Aghanim's Shard soms te vroeg konden verlopen.",
      "[*] Probleem opgelost waarbij Hex van Shadow Shaman soms niet werd uitgeschakeld met 'Hulp uitschakelen'.",
      "[*] Probleem opgelost waarbij Snapfire met Ricochet II en Blade Mail, Ricochet-aanvallen kon uitvoeren tegen Supernova.",
      "[*] Probleem opgelost waarbij Snapfire met Ricochet II en Lil' Shredder minder schade veroorzaakte dan verwacht.",
      "[*] Probleem opgelost waarbij secundaire aanvallen van Snapfire met Ricochet II en Revenant's Brooch, meer secundaire aanvallen veroorzaakten bij het aanvallen van doelwitten met een hoge ontwijkingskans.",
      "[*] Probleem opgelost waarbij aanvallen van Snapfire met Ricochet II konden missen.",
      "[*] Probleem opgelost waarbij de waarden van het actieve component van Aghanim's Shard van Spectre soms niet werden bijgewerkt naar de juiste waarden.",
      "[*] Probleem opgelost waarbij het Level 15-talent voor aanvals- en splitsbereik van Templar Assassin een groter aanvalsbereik toekende dan bedoeld.",
      "[*] Probleem opgelost waarbij het aanvalsbereik dat in de tooltip werd weergegeven voor Metamorphosis van Terrorblade, niet correct was (alleen de tooltip is aangepast).",
      "[*] Probleem opgelost met Sapling van Treant Protector waarbij vriendelijke eenheden soms vast kwamen te zitten aan Sapling-bomen.",
      "[*] Probleem opgelost waarbij de minions van de Abyssal Horde van Underlord niet aanvielen als de instelling 'Autom. aanvallen opgeroepen eenheden' was uitgeschakeld.",
      "[*] Probleem opgelost waarbij de Plague Wards van Venomancer aanvielen terwijl hun drager onzichtbaar was voor het doelwit.",
      "[*] Probleem opgelost waarbij er geen aggro werd geactiveerd door Plague Wards van Venomancer.",
      "[*] Verschillende problemen opgelost met Familiars van Visage.",
      "[*] Probleem opgelost met Voodoo Switcheroo van Witch Doctor, waarbij Witch Doctor vast kon komen te zitten als er een boom geplant werd terwijl hij getransformeerd was.",
      "[*] Probleem opgelost waarbij tijdens de selectie van facetten in de vaardigheidstrekking soms een verkeerd facet werd gekozen.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 14,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}