{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Aktualizacja rozgrywki 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aktualizacja rozgrywki 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "Aktualizacja 7.36c jest już dostępna. Listę zmian możecie sprawdzić [url=https://www.dota2.com/patches/7.36c]tutaj[/url].",
      "Dodatkowo w ciągu ostatnich dni naprawiono kilka błędów:",
      "[list]",
      "[*] Naprawiono błąd powodujący, że drwiny były usuwane z ekwipunku po zmianie aspektu.",
      "[*] Naprawiono błąd związany z Block of Cheese powodujący nieoczekiwane zamknięcie klienta.",
      "[*] Naprawiono błąd powodujący nieoczekiwane zamknięcia klienta podczas tworzenia przedmiotów z samoistnie przywracanymi ładunkami w niestandardowych grach.",
      "[*] Naprawiono błąd powodujący, że Abaddon i Nyx Assassin nie unikali obrażeń, tak jak powinni.",
      "[*] Naprawiono błąd powodujący, że um. Sanguivore od Bloodsekera leczyła go o mniej, niż powinna.",
      "[*] Naprawiono błąd powodujący, że um. Bristleback od Bristlebacka w połączeniu z aspektem Glucia Rakieta wystrzeliwała kolce po otrzymaniu ogromnej ilości obrażeń od jednego źródła.",
      "[*] Naprawiono błąd powodujący, że po zdobyciu Aghanim's Scepter zdrowie szkieletów Clinkza nie było zwiększane.",
      "[*] Naprawiono błąd powodujący, że pierwszy atak um. Burning Barrage od Clinkza nie zyskiwał premii od um. Tar Bomb.",
      "[*] Naprawiono błąd powodujący, że um. Crystal Clone od Crystal Maiden zawsze była rzucana w kierunku celu pod wpływem um. Frostbite, jeśli Crystal Clone użyto podczas końcowej animacji od Frostbite.",
      "[*] Naprawiono błąd powodujący, że talent 10. poziomu od Dark Seera zwiększający obrażenia od replik z um. Wall of Replica nie działał prawidłowo.",
      "[*] Naprawiono błąd powodujący, że um. Precision Aura od Drow Ranger okazjonalnie powodowała nieoczekiwane zamknięcia klienta.",
      "[*] Naprawiono błąd powodujący, że talent na 15. poziomie od Earthshakera zwiększający zasięg um. Fissure nie działał prawidłowo.",
      "[*] Naprawiono błąd powodujący, że um. Overcharge od Io przyznawała odporność na spowolnienie, nawet jeśli nie posiadał on Aghanim's Shard.",
      "[*] Naprawiono błąd powodujący, że um. Special Delivery od Marci działała na iluzjach samej Marci.",
      "[*] Naprawiono błąd powodujący, że talent 10. poziomu od Marci zwiększający zasięg rzutu/skoku um. Rebound nie zwiększał zasięgu rzutu.",
      "[*] Naprawiono błąd powodujący, że Meepo i Ogre Magi automatycznie zwiększali poziom swoich atrybutów, gdy zamiast tego mogli zwiększyć poziom którejś ze swoich umiejętności.",
      "[*] Naprawiono błąd powodujący, że Meepo z aspektem Chomik nie otrzymywał ładunków przedmiotów Urn of Shadows i Spirit Vessel, gdy umieszczono je w miejscu na przedmiot neutralny.",
      "[*] Naprawiono błąd powodujący, że aspekt Małpi Krok od Monkey Kinga nie skracał czasu oczekiwania um. Tree Dance, gdy zdrowie bohatera wynosiło między 90% a 100%.",
      "[*] Naprawiono błąd powodujący, że po wybraniu aspektu Odpływ od Morphlinga przedmioty pokazywały nieprawidłowy czas oczekiwania.",
      "[*] Naprawiono błąd powodujący, że aspekt Przypływ od Morphlinga nie skracał czasów oczekiwania o tyle, co powinien.",
      "[*] Naprawiono błąd powodujący, że um. Morph od Morphlinga trwale kradła aspekt Jednoosobowa Armia od Axe'a.",
      "[*] Naprawiono błąd powodujący, że wskaźnik promienia zasięgu um. Blur od Phantom Assassin używał starych wartości.",
      "[*] Naprawiono błąd powodujący, że po zdobyciu Aghanim's Scepter um. Blur od Phantom Assassin zmieniała czas trwania bufora zniknięcia.",
      "[*] Naprawiono błąd powodujący, że aspekt Gasnące Światło od Phoenixa zadawał mniej obrażeń, niż powinien.",
      "[*] Naprawiono błąd powodujący, że spowolnienie szybkości ataku z um. Fire Spirits od Phoenixa nie używało zaktualizowanych wartości.",
      "[*] Naprawiono błąd powodujący, że um. Trample od Primal Beasta okazjonalnie powodowała nieoczekiwane zamknięcia klienta.",
      "[*] Naprawiono błąd powodujący, że Riki i jego sojusznicy mieli szansę na chybienie ataku, gdy próbowali kogoś dobić wewnątrz zasłony dymnej z um. Smoke Screen.",
      "[*] Naprawiono błąd powodujący, że czasami Rubick był w stanie ukraść starą um. Second Chakram od Timbersawa.",
      "[*] Naprawiono błąd powodujący, że wężowi stróże od Shadow Shamana czasami znikali przedwcześnie, gdy miał on Aghanim's Shard.",
      "[*] Naprawiono błąd powodujący, że um. Hex od Shadow Shamana nie była wyłączana przez funkcję „Wyłącz pomoc”.",
      "[*] Naprawiono błąd powodujący, że po wybraniu aspektu Rykoszet II ataki rykoszetem od Snapfire mogły być aktywowane przeciwko um. Supernova od Phoenixa, jeśli Snapfire miała przedmiot Blade Mail.",
      "[*] Naprawiono błąd powodujący, że po wybraniu aspektu Rykoszet II um. Lil' Shredder od Snapfire zadawała mniejsze obrażenia, niż powinna.",
      "[*] Naprawiono błąd powodujący, że po wybraniu aspektu Rykoszet II ataki rykoszetem od Snapfire przeciwko celom o wysokiej szansie na unik tworzyły kolejne rykoszety, jeśli Snapfire miała przedmiot Revenant's Brooch.",
      "[*] Naprawiono błąd powodujący, że po wybraniu aspektu Rykoszet II ataki rykoszetem od Snapfire mogły chybić celu.",
      "[*] Naprawiono błąd powodujący, że aktywny komponent Aghanim's Shard dla Spectre niekiedy nie był aktualizowany o prawidłowe wartości.",
      "[*] Naprawiono błąd powodujący, że talent 15. poziomu od Templar Assassin zwiększający zasięg ataku i rozszczepienie um. Psi Blades zwiększał zasięg o więcej, niż było to zamierzone.",
      "[*] Naprawiono błąd powodujący, że zasięg ataku um. Metamorphosis od Terrorblade'a podany w objaśnieniu był nieprawidłowy (zmiana dotyczy tylko objaśnienia).",
      "[*] Naprawiono błąd powodujący, że po wybraniu aspektu Sadzonka um. Leech Seed od Treant Protectora sporadycznie powodowała zacinanie się sojuszniczych jednostek na drzewie z sadzonki.",
      "[*] Naprawiono błąd powodujący, że stwory od Underlorda z aspektem Horda z Otchłani nie atakowały, jeśli wyłączono ustawienie autoataku dla przyzwanych jednostek.",
      "[*] Naprawiono błąd powodujący, że po wybraniu aspektu Nosiciel Zarazy stróże z um. Plague Ward od Venomancera atakowały, gdy jednostki, do których były przyczepione, były niewidoczne dla celu.",
      "[*] Naprawiono błąd powodujący, że po wybraniu aspektu Nosiciel Zarazy przyczepieni stróże z um. Plague Ward od Venomancera nie aktywowali ataku.",
      "[*] Naprawiono rozmaite problemy z chowańcami z um. Summon Familiars od Visage'a.",
      "[*] Naprawiono błąd powodujący, że Witch Doctor po użyciu um. Voodoo Switcheroo czasami zacinał się w miejscu, jeśli drzewo zostało zasadzone, gdy miał przemienioną postać.",
      "[*] Naprawiono błąd powodujący, że wybranie aspektu w trybie Ability Draft czasami prowadziło do wyboru niezamierzonego aspektu.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 12,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}