{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Aggiornamento di gioco 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Aggiornamento di gioco 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "L'aggiornamento 7.36c è ora disponibile. Puoi leggere le note [url=https://www.dota2.com/patches/7.36c]qui[/url].",
      "Inoltre, negli ultimi giorni sono stati corretti alcuni bug:",
      "[list]",
      "[*] Risolto il problema per cui le provocazioni non erano equipaggiate quando si cambiavano le faccette.",
      "[*] Risolto un arresto anomalo relativo a Forma di Formaggio.",
      "[*] Risolto un arresto anomalo che si verificava durante la creazione di oggetti con cariche che si rigenerano automaticamente nelle partite personalizzate.",
      "[*] Risolto il problema per cui Abaddon e Nyx Assassin non evitavano correttamente i danni.",
      "[*] Risolto il problema per cui Sanguivoro di Bloodseeker guariva per un valore inferiore rispetto a quello previsto.",
      "[*] Risolto il problema per cui Razzo moccoloso di Bristleback sparava aculei quando riceveva singole e grandi istanze di danno.",
      "[*] Risolto il problema per cui lo scettro di Aghanim di Clinkz non faceva aumentare la salute di Scheletro Arciere.",
      "[*] Risolto il problema per cui il primo attacco con Fuoco di sbarramento di Clinkz non beneficiava della Bomba di catrame.",
      "[*] Risolto il problema per cui Clone di Cristallo di Crystal Maiden veniva usato sempre sul bersaglio Assiderato se Clone di cristallo veniva usato durante l'animazione post-attacco di Morsa di ghiaccio.",
      "[*] Risolto il problema per cui il danno per le illusioni di Muro di repliche (talento di livello 10 di Dark Seer) non funzionava correttamente.",
      "[*] Risolto il problema per cui l'Aura da tiratrice di Drow Ranger in certi casi causava arresti anomali del client.",
      "[*] Risolto il problema per cui gittata di Spaccatura di Earthshaker (talento di livello 15) non aumentava la gittata di Spaccatura.",
      "[*] Risolto il problema per cui il sovraccarico di Io faceva ottenere resistenza ai rallentamenti senza il Frammento di Aghanim.",
      "[*] Risolto il problema per cui Consegna speciale di Marci funzionava sulle illusioni di Marci.",
      "[*] Risolto il problema per cui gittata di lancio/salto per Rimbalzo di Marci (talento di livello 10) non aumentava la gittata di lancio.",
      "[*] Risolto il problema per cui Meepo e Ogre Magi aumentavano automaticamente il livello degli attributi nei casi in cui potevano aumentare un'abilità.",
      "[*] Risolto il problema per cui Meepo non riceveva le cariche Urna delle Ombre e Ricettacolo Spirituale quando venivano posizionate nello slot degli oggetti neutrali attraverso il talento \"Accumulatore\".",
      "[*] Risolto il problema per cui Passo scimmiesco di Monkey King non aveva un tempo di ricarica ridotto quando Monkey King si trovava tra il 90% e il 100% di salute.",
      "[*] Risolto il problema per cui Ebb di Morphling mostrava tempi errati di ricarica degli oggetti.",
      "[*] Risolto il problema per cui Flusso di Morphling riduceva troppo poco i tempi di ricarica.",
      "[*] Risolto il problema per cui Metamorfosi di Morphling rubava permanentemente Uno contro tutti di Axe.",
      "[*] Risolto il problema per cui l'indicatore del raggio di Sfocatura di Phantom Assassin utilizzava valori vecchi.",
      "[*] Risolto il problema per cui Sfocatura con lo Scettro di Aghanim di Phantom Assassin modificava la durata del tempo di sparizione.",
      "[*] Risolto il problema per cui Luce Morente di Phoenix infliggeva meno danni del previsto.",
      "[*] Risolto il problema per cui non venivano usati i valori aggiornati per la riduzione della velocità di attacco di Spiriti di fuoco di Phoenix.",
      "[*] Risolto il problema per cui Pestaggio di Primal Beast a volte causava arresti anomali del client.",
      "[*] Risolto il problema per cui Riki e i suoi alleati avevano una probabilità di fallire quando tentavano una negazione in Cortina di fumo.",
      "[*] Risolto il problema per cui Rubick a volte riusciva a rubare la vecchia abilità Secondo chakra di Timbersaw.",
      "[*] Risolto il problema per cui Guardiani serpenti del Frammento di Aghanim di Shadow Shaman a volte scomparivano prematuramente.",
      "[*] Risolto il problema per cui Maledizione di Shadow Shaman non veniva disabilitata tramite Disabilita aiuto.",
      "[*] Risolto il problema per cui Rimbalzo II e Cotta di Lame di Snapfire attivavano attacchi dei proiettili contro Supernova.",
      "[*] Risolto il problema per cui Rimbalzo II e Piccolo distruttore di Snapfire infliggevano meno danni del previsto.",
      "[*] Risolto il problema per cui Rimbalzo II e la Spilla del Redivivo di Snapfire contro bersagli a elevata elusività facevano sì che gli attacchi secondari attivassero ulteriori attacchi secondari.",
      "[*] Risolto il problema per cui gli attacchi con Rimbalzo II di Snapfire potevano fallire.",
      "[*] Risolto il problema per cui l'effetto attivo del Frammento di Aghanim di Spectre a volte non veniva aggiornato ai valori corretti.",
      "[*] Risolto il problema per cui la gittata primaria e secondaria di Lame psioniche di Templar Assassin (talento di livello 15) facevano ottenere più gittata d'attacco del previsto.",
      "[*] Risolto il problema per cui la gittata d'attacco di Metamorfosi di Terrorblade risultava errata nella descrizione dell'abilità (è stata modificata solo la descrizione).",
      "[*] Risolto il problema per cui Alberello di Treant Protector a volte faceva sì che le unità alleate rimanessero bloccate sull'Alberello.",
      "[*] Risolto il problema per cui i servitori dell'Orda abissale di Underlord non attaccavano se l'impostazione \"Attacco automatico delle Unità evocate\" era disattivata.",
      "[*] Risolto il problema per cui Guardiani Pestilenziali di Venomancer attaccavano mentre il loro portatore era invisibile al bersaglio.",
      "[*] Risolto il problema per cui Guardiani Pestilenziali legati di Venomancer non attivavano l'aggressione.",
      "[*] Risolti vari problemi relativi ai famigli di Visage.",
      "[*] Risolto il problema per cui Trasformazione vudù a volte faceva sì che Witch Doctor restasse bloccato se veniva piantato un albero mentre si trasformava.",
      "[*] Risolto il problema per cui nella selezione delle faccette nella modalità Ability Draft a volte veniva selezionata una faccetta errata.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 3,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}