{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "7.36c Oynanış Güncellemesi",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "7.36c Oynanış Güncellemesi",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "7.36c güncellemesi çıktı. Güncelleme notlarını [url=https://www.dota2.com/patches/7.36c]buradan[/url] inceleyebilirsiniz.",
      "Ayrıca son birkaç gün içinde birkaç hata düzeltildi:",
      "[list]",
      "[*] Yükselticiler değiştirilirken alay hareketlerinin ekipmandan çıkarılması düzeltildi.",
      "[*] Block of Cheese ile ilgili bir çökme düzeltildi.",
      "[*] Özel oyunlarda kendi şarjını yenileyen öğeler oluştururken meydana gelen çökme düzeltildi.",
      "[*] Abaddon ve Nyx Assassin'in düzgün bir şekilde hasardan kaçınmaması düzeltildi.",
      "[*] Bloodseeker'ın Sanguivore doğal yeteneğinin amaçlanandan daha az iyileştirme vermesi düzeltildi.",
      "[*] Bristleback tek seferde büyük hasarlar aldığında Snot Rocket yükselticisinin diken fırlatması düzeltildi.",
      "[*] Clinkz'in Aghanim's Scepter'ının Skeleton Archer'ın sağlığını artırmaması düzeltildi.",
      "[*] Clinkz'in Burning Barrage yeteneğiyle ilk saldırısının Tar Bomb etkisine sahip olmaması düzeltildi.",
      "[*] Crystal Maiden'ın Crystal Clone'unun, Frostbite saldırı animasyonu sırasında kullanıldığında, her zaman Frostbitten hedefine doğru kullanılması düzeltildi.",
      "[*] Dark Seer'ın seviye 10 hüneri \"Wall of Replica İllüzyon Hasarı\"nın düzgün çalışmaması düzeltildi.",
      "[*] Drow Ranger'ın Precision Aura yeteneğinin bazen istemci çökmelerine neden olması düzeltildi.",
      "[*] Earthshaker'ın Seviye 15 hüneri \"Fissure Menzili\"nin Fissure menzilini artırmaması düzeltildi.",
      "[*] Io'nun Overcharge yeteneğinin Aghanim's Shard olmadan yavaşlatma direnci sağlaması düzeltildi.",
      "[*] Marci'nin Special Delivery doğal yeteneğinin illüzyonları üzerinde çalışması düzeltildi.",
      "[*] Marci'nin Seviye 10 hüneri \"Rebound Kullanım/Zıplama Menzili\"nin kullanım menzilini artırmaması düzeltildi.",
      "[*] Meepo ve Ogre Magi'ın bir yeteneğin seviyesini yükseltebilecekken otomatik olarak özelliklerin seviyesini yükseltmesi düzeltildi.",
      "[*] Meepo'nun, Pack Rat yükselticisiyle tarafsız eşya yuvalarına yerleştirilen Urn of Shadows ve Spirit Vessel şarjlarını almaması düzeltildi.",
      "[*] Monkey King'in sağlığı %90 ile %100 arasındayken Simian Stride yükselticisinin dolum süresinin azalmaması düzeltildi.",
      "[*] Morphling'in Ebb yükselticisinin yanlış eşya dolum sürelerini göstermesi düzeltildi.",
      "[*] Morphling'in Flow yükselticisinin dolum sürelerini çok az azaltması düzeltildi.",
      "[*] Morphling's Morph yeteneğinin Axe'ın One Man Army yükselticisini kalıcı olarak çalması düzeltildi.",
      "[*] Phantom Assassin'in Blur menzili yarıçap göstergesinin eski değerleri kullanması düzeltildi.",
      "[*] Phantom Assassin'in Aghanim's Scepter'lı Blur yeteneğinin görünmezlik sonu gecikmesini değiştirmesi düzeltildi.",
      "[*] Phoenix'in Dying Light yeteneğinin amaçlanandan daha az hasar vermesi düzeltildi.",
      "[*] Phoenix'in Fire Spirits saldırı hızı yavaşlatmasının güncellenmiş değerleri kullanmaması düzeltildi.",
      "[*] Primal Beast'in Trample yeteneğinin bazen istemci çökmelerine neden olması düzeltildi.",
      "[*] Riki ve dostlarının Smoke Screen içindeyken reddetmeye çalıştıklarında ıskalayabilmeleri düzeltildi.",
      "[*] Rubick'in bazen Timbersaw'ın eski Second Chakram yeteneğini çalabilmesi düzeltildi.",
      "[*] Shadow Shaman'ın Aghanim'in Shard'lı Serpent Ward'larının bazen erken yok olması düzeltildi.",
      "[*] Shadow Shaman'ın Hex yeteneğinin \"Yardımı Kapat\" butonuyla devre dışı bırakılamaması düzeltildi.",
      "[*] Snapfire + Ricochet II + Blade Mail etkileşiminin Supernova'ya karşı Ricochet saldırıları tetiklemesi düzeltildi.",
      "[*] Snapfire + Ricochet II + Lil' Shredder etkileşiminin beklenenden daha az hasar vermesi düzeltildi.",
      "[*] Snapfire + Ricochet II + Revenant's Brooch etkileşiminin yüksek savuşturmaya sahip hedeflere karşı ikincil saldırıların daha fazla ikincil saldırı tetiklemesine neden olması düzeltildi.",
      "[*] Snapfire'ın Ricochet II saldırılarını ıskalayabilmesi düzeltildi.",
      "[*] Spectre'nin aktif Aghanim's Shard bileşeninin bazen doğru değerlere güncellenmemesi düzeltildi.",
      "[*] Templar Assassin'in seviye 15 hüneri \"Psi Blades Saldırı ve Bölünme Menzili\"nin amaçlanandan daha fazla saldırı menzili vermesi düzeltildi.",
      "[*] Terrorblade'in Metamorphosis yeteneğinin saldırı menzilinin yetenek açıklamasında yanlış gösterilmesi düzeltildi (yalnızca araç ipucu değişikliği).",
      "[*] Treant Protector'ın Sapling yükselticisinin dost birimlerin bazen dikilen ağaca sıkışıp kalmasına sebep olması düzeltildi.",
      "[*] Underlord'un Abyssal Horde yaratıklarının \"Çağrılan Birimin Otomatik Saldırısı\" ayarı kapalıyken saldırmaması düzeltildi.",
      "[*] Venomancer'ın Plague Ward'larının, taşıyıcı hedefe görünmüyorken saldırması düzeltildi.",
      "[*] Venomancer'ın bağlı Plague Ward'larının düşman saldırılarını tetiklememesi düzeltildi.",
      "[*] Visage'ın Familiar'larının çeşitli sorunları düzeltildi.",
      "[*] Witch Doctor'ın Voodoo Switcheroo' yeteneğinin, Witch Doctor'ın dönüşmüşken bir ağaç dikildiğinde bazen takılıp kalmasına neden olması düzeltildi.",
      "[*] Yetenek Çekilişi modunda yükseltici seçiminin bazen istenmeyen bir yükselticiyi seçmesi düzeltildi.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 21,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}