{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Parche de jugabilidad 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Parche de jugabilidad 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "Ya está disponible el parche 7.36c. Puedes consultar las notas del parche [url=https://www.dota2.com/patches/7.36c]aquí[/url].",
      "Además, se corrigieron algunos errores durante estos últimos días:",
      "[list]",
      "[*] Se corrigieron las burlas que no estaban equipadas al cambiar de faceta.",
      "[*] Se corrigió un bloqueo relacionado con el Bloque de Queso.",
      "[*] Se corrigió un bloqueo al crear objetos con cargas autorestaurables en partidas personalizadas.",
      "[*] Ahora Abaddon y Nyx Assassin evitan el daño correctamente.",
      "[*] Se corrigió Sanguívoro de Bloodseeker que restauraba la vida por menos de lo previsto.",
      "[*] Se corrigió Espalda Espinosa de Bristleback con la faceta Mococohete, que disparaba espinas al recibir una gran cantidad de daño en una sola instancia.",
      "[*] Se corrigió el Cetro de Aghanim de Clinkz, que no aumentaba la vida de los esqueletos arqueros.",
      "[*] El primer ataque de Aluvión Llameante de Clinkz ahora se beneficia de Bomba de Alquitrán.",
      "[*] Se corrigió que el Clon de Cristal de Crystal Maiden que siempre se lanzaba hacia el objetivo afectado por Congelación en caso de lanzarse durante la animación posterior al ataque de Congelación.",
      "[*] Se corrigió el talento de nivel 10 de Dark Seer \"20 % de daño de las réplicas para Muro de las Réplicas\" que no funcionaba correctamente.",
      "[*] Se corrigió la habilidad innata Aura de Precisión de Drow Ranger, que a veces provocaba bloqueos en el cliente.",
      "[*] Se corrigió el talento de nivel 15 de Earthshaker \"+200 de alcance para Fisura\" que no aumentaba el alcance de Fisura.",
      "[*] Se corrigió Sobrecarga de Io, que otorgaba resistencia a ralentización sin el Fragmento de Aghanim.",
      "[*] Se corrigió Entrega Especial de Marci que funcionaba con sus ilusiones.",
      "[*] Se corrigió el talento de nivel 10 de Marci \"+10 % de vel. de mov. adicional para Rebotar\", que no aumentaba el alcance de lanzamiento.",
      "[*] Se corrigió que los atributos de Meepo y Ogre Magi subieran de nivel automáticamente, sin la opción de subir de nivel una habilidad.",
      "[*] Meepo ya recibe cargas de Urna de las Sombras y de Vasija Espiritual al colocarse en la ranura para objetos neutrales a través de Equipamiento Flexible.",
      "[*] Se corrigió la faceta Mono Mosqueado de Monkey King que no tenía un tiempo de recarga reducido cuando su vida está entre el 90 % y el 100 %.",
      "[*] Se corrigió la faceta Reflujo de Morphling, que mostraba tiempos de recarga incorrectos para objetos.",
      "[*] Se corrigió la faceta Flujo de Morphling, que reducía los tiempos de recarga muy poco.",
      "[*] Transformación de Morphling ya no roba permanentemente la faceta Ejército de un Solo Hombre de Axe.",
      "[*] Se corrigió Desvanecer de Phantom Assassin, ya que el indicador de radio de alcance utilizaba valores antiguos.",
      "[*] Se corrigió Desvanecer de Phantom Assassin con Cetro de Aghanim, que cambiaba la duración del retraso del desvanecimiento.",
      "[*] Se corrigió Luz Agonizante de Phoenix, que infligía menos daño del que debería.",
      "[*] Se corrigió la ralentización de velocidad de ataque de Espíritus Ígneos de Phoenix que no usaban los valores actualizados.",
      "[*] Se corrigió la habilidad Pisotear de Primal Beast, que ocasionalmente provocaba bloqueos en el cliente.",
      "[*] Se corrigió que Riki y sus aliados tuvieran una oportunidad de fallo al intentar denegar dentro de Cortina de Humo.",
      "[*] Se corrigió que Rubick a veces podía robar la habilidad antigua Segundo Chakram de Timbersaw.",
      "[*] Se corrigió que Guardianes Serpiente con Fragmento de Aghanim de Shadow Shaman terminaran prematuramente.",
      "[*] Se corrigió Maldición de Shadow Shaman que no se desactivaba mediante Desactivar ayuda.",
      "[*] Se corrigió Snapfire + Rebote II + Malla de Cuchillas con probabilidad de ataques de Rebote contra Supernova.",
      "[*] Se corrigió Snapfire + Rebote II + Ametralladora que infligía menos daño de lo previsto.",
      "[*] Se corrigió Snapfire + Rebote II + Broche del Renacido contra objetivos de alta evasión, lo que provocaba ataques secundarios para provocar más ataques secundarios.",
      "[*] Ahora los ataques Rebote II de Snapfire ya no fallan.",
      "[*] Se corrigió que el componente activo del Fragmento de Aghanim de Spectre a veces no se actualizaba a los valores correctos.",
      "[*] El talento de nivel 15 de Templar Assassin \"+100 de alcance de ataque base y secundario para Hojas Psiónicas\" ya no otorga más alcance de ataque del previsto.",
      "[*] Se corrigió el rango de ataque de Metamorfosis de Terrorblade en la descripción emergente de la habilidad que era incorrecto (solo cambia la descripción emergente).",
      "[*] Se corrigió Plántula de Treant Protector que ocasionalmente causaba que las unidades aliadas se quedaran atoradas en el árbol.",
      "[*] Se corrigieron los súbitos de Horda Abisal de Underlord, que atacaban si la configuración “Ataque automático de unidad invocada” estaba desactivada.",
      "[*] Se corrigió Guardianes de la Plaga de Venomancer, que atacaban mientras el portador estaba invisible para el objetivo.",
      "[*] Se corrigió Guardianes de la Plaga de Venomancer que no activaba la agresividad.",
      "[*] Se corrigieron los Familiares de Visage que tenían varios problemas.",
      "[*] Se corrigió Cambiazo Vudú de Witch Doctor, que algunas veces hacía que Witch Doctor se quedara atorado si había un árbol plantado mientras se estaba transformando.",
      "[*] Se corrigió la selección de Facetas en la selección de habilidades que, ocasionalmente, seleccionaba la faceta incorrecta.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 27,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}