{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Spilloppdatering 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719899273
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Spilloppdatering 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719899273,
    "body": [
      "Spilloppdatering 7.36c er ute nå. Se endringsloggen [url=https://www.dota2.com/patches/7.36c]her[/url].",
      "I tillegg har vi fikset noen feil i løpet av de siste dagene:",
      "[list]",
      "[*] Fikset at hån ikke lenger ble utstyrt når man endret fasetter.",
      "[*] Fikset et krasj relatert til Block of Cheese.",
      "[*] Fikset et krasj når man oppretter gjenstander med selvgjenopprettende ladninger i tilpassede spill.",
      "[*] Fikset at Abaddon og Nyx Assassin ikke unngikk skade ordentlig.",
      "[*] Fikset at Bloodseekers Sanguivore helbredet mindre enn tilsiktet.",
      "[*] Fikset at Bristlebacks Bristleback med Snot Rocket avfyrte Quills når han tok store enkelttilfeller av skade.",
      "[*] Fikset at Clinkz' Aghanim's Scepter ikke økte skjelettbueskytteres helse.",
      "[*] Fikset at Clinkz' Burning Barrage ikke dro nytte av Tar Bomb på det første angrepet.",
      "[*] Fikset at Crystal Maidens Crystal Clone alltid ble brukt mot målet for Frostbite hvis Crystal Clone ble brukt under Frostbites ettersving.",
      "[*] Fikset at Dark Seers talent på nivå 10 med illusjonsskade for Wall of Replica ikke fungerte ordentlig.",
      "[*] Fikset at Drow Rangers Precision Aura av og til førte til klientkrasj.",
      "[*] Fikset at Earthshakers talent på nivå 15 med rekkevidde for Fissure ikke økte rekkevidden.",
      "[*] Fikset at Ios Overcharge gav hemmingsresistens uten Aghanim's Shard.",
      "[*] Fikset at Marcis Special Delivery fungerte på illusjoner av Marci.",
      "[*] Fikset at Marcis talent på nivå 10 med bruks-/sprettrekkevidde for Rebound ikke økte bruksrekkevidde.",
      "[*] Fikset at Meepo og Ogre Magi automatisk økte nivået til attributter når de kunne ha oppgradert en evne istedenfor.",
      "[*] Fikset at Meepo ikke fikk ladninger av Urn of Shadows og Spirit Vessel når de var plasserte i en nøytral gjenstandsplass via Pack Rat.",
      "[*] Fikset at Monkey Kings Simian Stride ikke hadde redusert nedkjøling når Monkey King har mellom 90 % og 100 % helse.",
      "[*] Fikset at Morphlings Ebb viste feil gjenstandsnedkjølinger.",
      "[*] Fikset at Morphlings Flow reduserte nedkjølinger for lite.",
      "[*] Fikset at Morphlings Morph permanent stjal Axes One Man Army.",
      "[*] Fikset at rekkeviddeindikatoren til Phantom Assassins Blur brukte gamle verdier.",
      "[*] Fikset at Phantom Assassins Blur med Aghanim's Scepter endret avsløringsforsinkelsen.",
      "[*] Fikset at Phoenix' Dying Light gjorde mindre skade enn tilsiktet.",
      "[*] Fikset at angrepshemmingen til Phoenix' Fire Spirits ikke brukte oppdaterte verdier.",
      "[*] Fikset at Primal Beasts Trample av og til førte til klientkrasj.",
      "[*] Fikset at Riki og hans allierte hadde sjanse for bom når de skulle berøve i Smoke Screen.",
      "[*] Fikset at Rubick noen ganger kunne stjele Timbersaws gamle Second Chakram-evne.",
      "[*] Fikset at Shadow Shamans Serpent Wards fra Aghanim's Shard noen ganger utløpte for tidlig.",
      "[*] Fikset at Shadow Shamans Hex ikke ble deaktivert av «Deaktiver hjelp».",
      "[*] Fikset at Snapfire + Ricochet II + Blade Mail utløste rikosjettangrep mot Supernova.",
      "[*] Fikset at Snapfire + Ricochet II + Lil' Shredder gjorde mindre skade enn forventet.",
      "[*] Fikset at Snapfire + Ricochet II + Revenant's Brooch mot mål med høy unnvikelse førte til at sekundære angrep utløste flere sekundære angrep.",
      "[*] Fikset at Snapfires angrep fra Ricochet II kunne bomme.",
      "[*] Fikset at Spectres aktive komponent fra Aghanim's Shard noen ganger ikke ble oppdatert til riktige verdier.",
      "[*] Fikset at Templar Assassins talent på nivå 15 med angreps- og delt rekkevidde for Psi Blades gav mer angrepsrekkevidde enn tilsiktet.",
      "[*] Fikset at angrepsrekkevidden til Terrorblades Metamorphosis var feil i evnes verktøytips (kun i verktøytipset).",
      "[*] Fikset at Treant Protectors Sapling av og til gjorde at allierte enheter satte seg fast i Sapling-treet.",
      "[*] Fikset at undersåttene fra Underlords Abyssal Horde ikke angrep hvis innstillingen «Auto-angrep for tilkalt enhet» var slått av.",
      "[*] Fikset at Venomancers Plague Ward angrep mens bæreren er usynlig for målet.",
      "[*] Fikset at Venomancers festede Plague Ward ikke tiltrakk aggro.",
      "[*] Fikset at Visages vardøger hadde ulike problemer.",
      "[*] Fikset at Witch Doctors Voodoo Switcheroo noen ganger gjorde at Witch Doctor satte seg fast hvis et tre ble plantet i mellomtiden.",
      "[*] Fikset at fasettutvalget i Ability Draft av og til valgte en utilsiktet fasett.",
      "[/list]"
    ],
    "commentcount": 187,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_871423085_1719282120_0",
      "ModAct_1415588329_1719356296_4",
      "mod_require_rereview"
    ],
    "language": 16,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1755,
    "votedowncount": 233,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719899273,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1719356297,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 1755,
  "votes_down": 233,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}