{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização de jogabilidade 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Atualização de jogabilidade 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "A atualização 7.36c foi lançada. Confira os detalhes [url=https://www.dota2.com/patches/7.36c]aqui[/url].",
      "Além disso, também corrigimos alguns problemas nos últimos dias:",
      "[list]",
      "[*] Correção das provocações, que eram desequipadas ao alternar facetas.",
      "[*] Correção de travamento relacionado ao Bloco de Queijo.",
      "[*] Correção de travamento ao criar itens com cargas restauráveis em partidas personalizadas.",
      "[*] Abaddon/Nyx Assassin: correção de problema que os impedia de evitar dano apropriadamente.",
      "[*] Bloodseeker: correção de Sanguívoro, que curava menos que o esperado.",
      "[*] Bristleback: correção da Proteção de Cerdas com a faceta \"Ranhento\", que disparava Espinhos ao sofrer uma instância de dano alto.",
      "[*] Clinkz: correção do Cetro de Aghanim, que não aumentava a vida dos Esqueletos Arqueiros.",
      "[*] Clinkz: correção da Rajada Ardente, cujo primeiro ataque não afetava a Bomba de Piche.",
      "[*] Crystal Maiden: correção do Clone Cristalino, que era sempre lançado em direção ao alvo Congelado caso a habilidade fosse usada durante a animação após o uso do Congelamento.",
      "[*] Dark Seer: correção do Talento Nível 10 \"+20% de dano para ilusões da Parede de Réplicas\", que não aplicava o aumento de dano.",
      "[*] Drow Ranger: correção da Aura de Precisão, que causava travamentos ocasionais.",
      "[*] Earthshaker: correção do Talento Nível 15 \"+200 de alcance para Fissura\", que não aplicava o aumento de alcance.",
      "[*] Io: correção da Sobrecarga, que concedia resistência a retardos mesmo sem o Fragmento de Aghanim.",
      "[*] Marci: correção da Entrega Especial, que funcionava em ilusões de Marci.",
      "[*] Marci: correção do Talento Nível 10 \"+100 de alcance de uso/salto para Rebote\", que não aumentava o alcance de uso.",
      "[*] Meepo/Ogre Magi: correção de problema que resultava no aprimoramento automático dos atributos mesmo com a opção de aprimorar uma habilidade.",
      "[*] Meepo: correção do não recebimento de cargas para Urna das Sombras e Receptáculo Espiritual quando no compartimento de itens neutros com a faceta \"Acumulador\".",
      "[*] Monkey King: correção do Passeio Símio, cujo intervalo entre usos não era reduzido quando o Monkey King tinha entre 90% e 100% de vida.",
      "[*] Morphling: correção do Escorrego, que exibia intervalos entre usos incorretos para itens.",
      "[*] Morphling: correção do Tobogã, que reduzia intervalos entre usos aquém do esperado.",
      "[*] Morphling: correção da Morfose, que roubava permanentemente o Exército de Um Homem Só do Axe.",
      "[*] Phantom Assassin: correção da Ofuscada, cujo indicador de alcance usava os valores antigos.",
      "[*] Phantom Assassin: correção da Ofuscada com o Cetro de Aghanim, que estava alterando a duração do atraso até a revelação.",
      "[*] Phoenix: correção da Luz Agonizante, que causava dano aquém do esperado.",
      "[*] Phoenix: correção dos Espíritos de Fogo, que não causavam os valores atualizados para o retardo da velocidade de movimento.",
      "[*] Fera Primal: correção de Pisotear, que causava travamentos ocasionais.",
      "[*] Riki: correção da Cortina de Fumaça, que fazia com que Riki e aliados pudessem errar negações.",
      "[*] Rubick: correção de problema que ocasionalmente o fazia roubar a antiga habilidade Chakram Secundário do Timbersaw.",
      "[*] Shadow Shaman: correção das Serpentes Sentinelas com o Fragmento de Aghanim, que expiravam prematuramente.",
      "[*] Shadow Shaman: correção de Enfeitiçar, que não era desativada pela configuração \"Desativar ajuda\".",
      "[*] Snapfire: correção da interação entre Ricochet II e a Cota de Lâminas, que ativava ricochetes contra a Supernova.",
      "[*] Snapfire: correção da interação entre Ricochet II e a Rajada Bélica, que causava dano aquém do esperado.",
      "[*] Snapfire: correção da interação entre Ricochet II e o Broche do Regressor contra alvos com muita esquiva, que fazia com que ataques secundários criassem novos ataques secundários.",
      "[*] Snapfire: correção de Ricochet II, cujos ataques podiam errar o alvo.",
      "[*] Spectre: correção do componente ativo do Fragmento de Aghanim, que às vezes não usava os valores certos.",
      "[*] Templar Assassin: correção do Talento Nível 15 \"+100 de alcance para ataques/divisões de Lâminas Psíquicas\", que concedia alcance de ataque além do esperado.",
      "[*] Terrorblade: correção da Metamorfose, que exibia valores incorretos para o alcance de ataque na descrição da habilidade (a habilidade em si usava os valores corretos).",
      "[*] Treant Protector: correção da Mudinha, que às vezes prendia unidades aliadas na árvore plantada.",
      "[*] Underlord: correção da Horda Abissal, cujos demônios não atacavam caso a configuração \"Ataque auto. de unidade invocada\" estivesse desativada.",
      "[*] Venomancer: correção das Sentinelas de Praga, que atacavam enquanto o portador estivesse invisível para o alvo.",
      "[*] Venomancer: correção das Sentinelas de Praga, que não ativavam a agressividade de unidades/torres durante a Carona Envenenada.",
      "[*] Visage: correção de diversos problemas com os Familiares.",
      "[*] Witch Doctor: correção do Vudu Transfigurante, que às vezes prendia o Witch Doctor caso uma árvore fosse plantada durante a transformação.",
      "[*] Correção da seleção de facetas no modo de Seleção de Habilidades, que às vezes definia a faceta errada.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 22,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}