{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Ігроладне оновлення 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Ігроладне оновлення 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "Оновлення 7.36c вже вийшло. Про всі зміни можна дізнатися [url=https://www.dota2.com/patches/7.36c]ось тут[/url].",
      "Окрім того, за останні дні було виправлено кілька помилок:",
      "[list]",
      "[*] Виправлено помилку, через яку зміна грані скидала обране кепкування.",
      "[*] Виправлено аварійне завершення гри, пов’язане зі Шматом сиру (Block of Cheese).",
      "[*] Виправлено аварійне завершення гри, що відбувалося під час створення предметів із самовідновлювальними зарядами в нестандартних іграх.",
      "[*] Виправлено помилку, через яку Абаддон і Нікс-Убивця неправильно уникали шкоди.",
      "[*] Виправлено помилку, через яку Кровоядність (Sanguivore) Кривавого Жерця лікувала менше здоров’я, ніж потрібно.",
      "[*] Виправлено помилку, через яку Колюча спина (Bristleback) Бронеспина з гранню Шмарклемет стріляла голками, якщо герой отримував багато шкоди за раз.",
      "[*] Виправлено помилку, через яку Уламок Аґаніма не збільшував здоров’я лучників-скелетів Клінкза.",
      "[*] Виправлено помилку, через яку перша атака від Палючого обстрілу (Burning Barrage) Клінкза не отримувала ефект Смоляної бомби (Tar Bomb).",
      "[*] Виправлено помилку, через яку Кришталевий клон (Crystal Clone) Кришталевої Діви застосовувався завжди в бік цілі Обмороження (Frostbitten), якщо анімація останнього ще не завершилася.",
      "[*] Виправлено помилку, через яку талант 10-го рівня Темновидця неправильно враховував шкоду ілюзій від Стіни ілюзій (Wall of Replica).",
      "[*] Виправлено помилку, через яку Аура влучності (Precision Aura) Дроу-Рейнджер іноді викликала аварійне завершення клієнта гри.",
      "[*] Виправлено помилку, через яку талант 15-го рівня в Землетруса не збільшував довжину Розлому (Fissure).",
      "[*] Виправлено помилку, через яку Надлишковий заряд (Overcharge) Іо давав опір сповільненню без Уламка Аґаніма.",
      "[*] Виправлено помилку, через яку Особлива доставка (Special Delivery) Марсі працювала на її ілюзіях.",
      "[*] Виправлено помилку, через яку талант 10-го рівня в Марсі не збільшував дальність чаклування Перескоку (Rebound).",
      "[*] Виправлено помилку, через яку в Міпо та Огр-Мага автоматично вивчався бонус до характеристик, коли можна було вивчити здібність.",
      "[*] Виправлено помилку, через яку Міпо не отримував заряди Урни тіней (Urn of Shadows) та Чаші душ (Spirit Vessel), якщо ці предмети були в ланці нейтральних предметів завдяки грані Пакувальник.",
      "[*] Виправлено помилку, через яку грань Мавпячий крок Мавпячого Короля не працювала, якщо він мав між 90% та 100% здоров’я.",
      "[*] Виправлено помилку, через яку в Морфника з гранню Відплив зарядки предметів показувалися неправильно.",
      "[*] Виправлено помилку, через яку в Морфника з гранню Приплив зарядки недостатньо зменшувалися.",
      "[*] Виправлено помилку, через яку Морф (Morph) Морфника дозволяв назавжди викрасти грань Людина-армія в Сокирника.",
      "[*] Виправлено помилку, через яку індикатор радіуса здібності Мара (Blur) Фантомної Вбивці використовував старі значення.",
      "[*] Виправлено помилку, через яку Скіпетр Аґаніма змінював затримку перед появою в Мари (Blur) Фантомної Вбивці.",
      "[*] Виправлено помилку, через яку Фенікс з гранню Помираюче світло завдавав менше шкоди, ніж потрібно.",
      "[*] Виправлено помилку, через яку здібність Вогняні духи (Fire Spirits) Фенікса використовувала старі значення сповільнення атаки.",
      "[*] Виправлено помилку, через яку Розтоптування (Trample) Первісного Звіра іноді призводило до аварійного завершення клієнта гри.",
      "[*] Виправлено помилку, через яку Рікі та його союзники могли схибити атакою по союзному кріпу в Димовій завісі (Smoke Screen).",
      "[*] Виправлено помилку, через яку Рубік іноді крав стару здібність Другий чакрам (Second Chakram) у Лісопила.",
      "[*] Виправлено помилку, через яку змієварди Шамана Тіней з Уламком Аґаніма іноді зникали раніше часу.",
      "[*] Виправлено помилку, через яку застосування Перетворення (Hex) Шамана Тіней на союзника не можна було вимкнути через опцію вимикання допомоги.",
      "[*] Виправлено помилку, через яку атаки Запальниці з гранню Рикошет II і предметом Укольчуга (Blade Mail) могли зрикошетити в сонці від Наднової (Supernova) Фенікса.",
      "[*] Виправлено помилку, через яку атаки від Малої дробарки (Lil' Shredder) Запальниці з гранню Рикошет II завдавали менше шкоди, ніж потрібно.",
      "[*] Виправлено помилку, через яку атаки Запальниці з гранню Рикошет II і предметом Брошка примари (Revenant's Brooch) по істотах зі значним ухиленням могли зрикошетити кілька разів.",
      "[*] Виправлено помилку, через яку Запальниця з гранню Рикошет II могла схибити рикошетними атаками.",
      "[*] Виправлено помилку, через яку активні складові Розсіювання (Dispersion) Спектральної Мари з Уламком Аґаніма іноді мали неправильні значення.",
      "[*] Виправлено помилку, через яку талант 15-го рівня Тамплієра-Вбивці збільшував дальність атаки більше, ніж потрібно.",
      "[*] Виправлено помилку, через яку бонус до дальності атаки від Метаморфози (Metamorphosis) Терора неправильно показувався в підказці (ігрові значення були правильні).",
      "[*] Виправлено помилку, через яку союзні істоти іноді застрягали в дереві від Насінини-кровопивці (Leech Seed) Ента-Захисника з гранню Насіння.",
      "[*] Виправлено помилку, через яку демони від Потойбічних врат (Fiend's Gate) Підземного Лорда з гранню Пекельна орда не атакували, якщо автоатаку прикликаних істот було вимкнено в налаштуваннях.",
      "[*] Виправлено помилку, через яку чумні варди Трутоманта з гранню Носій чуми атакували істот, коли вони не бачили носія.",
      "[*] Виправлено помилку, через яку чумні варди Трутоманта з гранню Носій чуми не викликали агресію.",
      "[*] Виправлено різні помилки у фамільярів Візажа.",
      "[*] Виправлено помилку, через яку Знахар міг застрягти в дереві, посадженому під час дії Вуду-перетворення (Voodoo Switcheroo).",
      "[*] Виправлено помилку, через яку в режимі Відбір здібностей (Ability Draft) випадково обиралася інша грань.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 26,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}