{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Pelipäivitys 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Pelipäivitys 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "Pelipäivitys 7.36c on nyt saatavilla. Katso päivitystiedot [url=https://www.dota2.com/patches/7.36c]täältä[/url].",
      "Lisäksi korjattiin muutamia virheitä.",
      "[list]",
      "[*] Korjattiin virhe, jonka vuoksi kulmakiven vaihto poisti pilkan käytöstä.",
      "[*] Korjattiin Block of Cheeseen liittyvä kaatuminen.",
      "[*] Korjattiin itsestään latauksia palauttaviin esineisiin liittynyt kaatuminen yhteisöpeleissä.",
      "[*] Korjattiin virhe, jonka vuoksi Abaddonin ja Nyx Assassinin vahingontorjunta ei toiminut kunnolla.",
      "[*] Korjattiin virhe, jonka vuoksi Bloodseekerin Sanguivore paransi liian vähän terveyttä.",
      "[*] Korjattiin virhe, jonka vuoksi Bristlebackin Snot Rocket -kulmakivi sai Bristlebackin laukaisemaan Quill Spraytä liian suurilla vahinko-osumilla.",
      "[*] Korjattiin virhe, jonka vuoksi Clinkzin Aghanim's Scepter -päivitys ei nostanut jousiluurankojen terveyttä.",
      "[*] Korjattiin virhe, jonka vuoksi Clinkzin Burning Barragen ensimmäinen hyökkäys ei hyötynyt Tar Bombista.",
      "[*] Korjattiin virhe, jonka vuoksi Crystal Maidenin Crystal Clone liukui aina Frostbiten kohteen suuntaan, kun kykyä käytettiin Frostbiten jälkianimaation aikana.",
      "[*] Korjattiin virhe, jonka vuoksi Dark Seerin tason 10 Wall of Replica -taitopäivitys ei toiminut oikein.",
      "[*] Korjattiin Drow Rangerin Precision Auran aiheuttamia asiakasohjelmakaatumisia.",
      "[*] Korjattiin virhe, jonka vuoksi Earthshakerin tason 15 Fissure-taitopäivitys ei nostanut Fissuren kantamaa.",
      "[*] Korjattiin virhe, jonka vuoksi Ion Overcharge antoi hidastusvastustusta ilman Aghanim's Shard -päivitystä.",
      "[*] Korjattiin virhe, jonka vuoksi Marcin Special Delivery -luontaiskyky toimi Marcin harhoilla.",
      "[*] Korjattiin virhe, jonka vuoksi Marcin tason 10 Rebound-taitopäivitys ei nostanut käyttöetäisyyttä.",
      "[*] Korjattiin virhe, jonka vuoksi Meepo ja Ogre Magi päivittivät kykypisteillään automaattisesti piirteitä kykyjen sijaan.",
      "[*] Korjattiin virhe, jonka vuoksi Meepo ei saanut Urn of Shadows- tai Spirit Vessel -latauksia, kun esine asetettiin neutraaliesinepaikkaan Pack Rat -kulmakiven avulla.",
      "[*] Korjattiin virhe, jonka vuoksi Monkey Kingin Simian Stride -kulmakivi ei laskenut Tree Dancen latausaikaa Monkey Kingin terveyden ollessa 90–100 %.",
      "[*] Korjattiin virhe, jonka vuoksi Morphlingin Ebb-kulmakivi näytti esineille vääriä latausaikoja.",
      "[*] Korjattiin virhe, jonka vuoksi Morphlingin Flow-kulmakivi ei lyhentänyt latausaikoja tarpeeksi.",
      "[*] Korjattiin virhe, jonka vuoksi Morphlingin Morph varasti pysyvästi Axen One Man Army -kulmakiven.",
      "[*] Korjattiin virhe, jonka vuoksi Phantom Assassinin Blurin vaikutusalueympyrä näytti vanhoja arvoja.",
      "[*] Korjattiin virhe, jonka vuoksi Phantom Assassinin Aghanim's Scepter -päivitys muutti Blurin ilmestymisviivettä.",
      "[*] Korjattiin virhe, jonka vuoksi Phoenixin Dying Light -kulmakivi teki liian vähän vahinkoa.",
      "[*] Korjattiin virhe, jonka vuoksi Phoenixin Fire Spiritsin hyökkäyshidastus käytti vanhoja arvoja.",
      "[*] Korjattiin Primal Beastin Tramplen aiheuttamia asiakasohjelmakaatumisia.",
      "[*] Korjattiin virhe, jonka vuoksi Riki ja hänen liittolaisensa saattoivat lyödä ohi evätessään liittolaista Smoke Screenin sisällä.",
      "[*] Korjattiin virhe, jonka vuoksi Rubick saattoi joskus varastaa Timbersaw'n vanhan Toinen Chakram -kyvyn.",
      "[*] Korjattiin virhe, jonka vuoksi Shadow Shamanin Aghanim's Shard -päivityksen luomat Serpent Wardit saattoivat päättyä ennenaikaisesti.",
      "[*] Korjattiin virhe, jonka vuoksi Shadow Shamanin Hex ei noudattanut liittolaisten kykyjen estoa.",
      "[*] Korjattiin virhe, jonka vuoksi Snapfiren Ricochet II -kulmakivi laukaisi lisähyökkäyksiä Supernovaan Blade Mailin vuoksi.",
      "[*] Korjattiin virhe, jonka vuoksi Snapfiren Ricochet II -kulmakivi teki liian vähän vahinkoa Lil' Shredderin aikana.",
      "[*] Korjattiin virhe, jonka vuoksi Snapfiren Ricochet II -kulmakiven lisähyökkäykset Revenant's Broochin avulla seurasivat toisiaan vihollisten väistellessä niitä.",
      "[*] Korjattiin virhe, jonka vuoksi Snapfiren Ricochet II -kulmakiven lisähyökkäyksiä pystyi väistämään.",
      "[*] Korjattiin virhe, jonka vuoksi Spectren Aghanim's Shard -päivityksen aktiivinen ominaisuus ei aina päivittynyt oikeisiin arvoihin.",
      "[*] Korjattiin virhe, jonka vuoksi Templar Assassinin tason 15 Psi Blades -taitopäivitys antoi liikaa hyökkäysetäisyyttä.",
      "[*] Korjattiin virhe, jonka vuoksi Terrorbladen Metamorphosiksen kykytekstin hyökkäysetäisyys näytti väärän lukeman, vaikka itse kyky toimi oikein.",
      "[*] Korjattiin virhe, jonka vuoksi Treant Protectorin Sapling-kulmakivi saattoi saada liittolaisen jumiin Leech Seedin puun sisälle.",
      "[*] Korjattiin virhe, jonka vuoksi Underlordin Abyssal Horde -kulmakiven alamaiset eivät hyökänneet, jos kutsuttujen hahmojen automaattihyökkäysasetus oli pois päältä.",
      "[*] Korjattiin virhe, jonka vuoksi Venomancerin Plague Carrier -kulmakiven Plague Wardit hyökkäsivät vihollisia kohti, kun niiden kantaja oli näkymätön.",
      "[*] Korjattiin virhe, jonka vuoksi Venomancerin Plague Carrier -kulmakiven Plague Wardien hyökkäykset eivät laukaisseet kätyriaggressiota.",
      "[*] Korjattiin lukuisia Visagen henkiolentoihin liittyneitä ongelmia.",
      "[*] Korjattiin virhe, jonka vuoksi Witch Doctorin Voodoo Switcheroo saattoi jättää Witch Doctorin jumiin, jos hänen Death Wardinsa kohdalle istutettiin puu.",
      "[*] Korjattiin virhe, jonka vuoksi kykyvalinta saattoi antaa väärän kulmakiven.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 15,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}