{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Actualizarea de joc 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Actualizarea de joc 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "Actualizarea de joc 7.36c este disponibilă acum. Consultă detaliile actualizării [url=https://www.dota2.com/patches/7.36c?l=romanian]aici[/url].",
      "De asemenea, au fost remediate câteva erori în ultimele zile:",
      "[list]",
      "[*] A fost remediată problema în care batjocurile erau dezechipate atunci când jucătorii schimbau fațetele.",
      "[*] A fost remediată o cădere care era cauzată de Block of Cheese.",
      "[*] A fost remediată o cădere care avea loc la crearea obiectelor cu reîncărcare automată în meciurile personalizate.",
      "[*] A fost remediată problema în care Abaddon și Nyx Assassin nu evitau corespunzător daunele.",
      "[*] A fost remediată problema în care abilitatea Sanguivore a lui Bloodseeker oferea mai puțină vindecare decât trebuia.",
      "[*] A fost remediată problema în care abilitatea Bristleback (Snot Rocket) a lui Bristleback declanșa Quill Spray atunci când încasa cantități mari de daune.",
      "[*] A fost remediată problema în care Aghanim's Scepter nu mărea viața scheletelor arcașe.",
      "[*] A fost remediată problema în care primul atac cauzat de abilitatea Burning Barrage a lui Clinkz nu beneficia de efectul Tar Bomb.",
      "[*] A fost remediată problema în care abilitatea Crystal Clone a eroinei Crystal Maiden era invocată întotdeauna către ținta aflată sub efectul abilității Frostbite dacă Crystal Clone era invocat cât timp era redată animația de invocare a abilității Frostbite.",
      "[*] A fost remediată problema în care talentul de la nivelul 10 al lui Dark Seer care mărește daunele iluziilor create de Wall of Replica nu funcționa corect.",
      "[*] A fost remediată problema în care abilitatea Precision Aura a eroinei Drow Ranger cauza ocazional căderi pentru client.",
      "[*] A fost remediată problema în care talentul de la nivelul 15 al lui Earthshaker care mărește distanța pentru Fissure nu mărea distanța.",
      "[*] A fost remediată problema în care abilitatea Overcharge a lui Io oferea rezistență la încetiniri fără Aghanim's Shard.",
      "[*] A fost remediată problema în care abilitatea Special Delivery a eroinei Marci funcționa pe iluziile eroinei.",
      "[*] A fost remediată problema în care talentul de la nivelul 10 al eroinei Marci care mărește distanța de invocare/salt nu mărea distanța de invocare.",
      "[*] A fost remediată problema în care Meepo și Ogre Magi își măreau automat nivelul atributelor atunci când ar fi putut să-și mărească nivelul unei abilități.",
      "[*] A fost remediată problema în care Meepo nu primea încărcături de Urn of Shadows și Spirit Vessel atunci când erau amplasate în slotul pentru obiecte neutre prin intermediul talentului Pack Rat.",
      "[*] A fost remediată problema în care fațeta Simian Stride a lui Monkey King nu elimina repausul abilității Tree Dance atunci când Monkey King avea între 90% și 100% viață.",
      "[*] A fost remediată problema în care fațeta Ebb a lui Morphling determina afișarea unor repausuri incorecte pentru obiecte.",
      "[*] A fost remediată problema în care fațeta Flow a lui Morphling reducea prea puțin repausurile.",
      "[*] A fost remediată problema în care abilitatea Morph a lui Morphling fura permanent fațeta One Man Army a lui Axe.",
      "[*] A fost remediată problema în care indicatorul de rază al abilității Blur a eroinei Phantom Assassin folosea valori vechi.",
      "[*] A fost remediată problema în care abilitatea Blur a eroinei Phantom Assassin îmbunătățită de Aghanim's Scepter modifica durata efectului pozitiv de dispariție.",
      "[*] A fost remediată problema în care fațeta Dying Light a lui Phoenix cauza mai puține daune decât trebuia.",
      "[*] A fost remediată problema în care încetinirea vitezei de atac aplicată de abilitatea Fire Spirits a lui Phoenix nu utiliza valorile actualizate.",
      "[*] A fost remediată problema în care abilitatea Trample a lui Primal Beast cauza ocazional căderi pentru client.",
      "[*] A fost remediată problema în care Riki și aliații săi aveau o șansă de a rata atacurile atunci când încercau să realizeze sacrificări în instanța de Smoke Screen.",
      "[*] A fost remediată problema în care Rubick putea fura uneori vechea abilitate Second Chakram a lui Timbersaw.",
      "[*] A fost remediată problema în care unitățile Serpent Ward ale lui Shadow Shaman îmbunătățite de Aghanim's Shard expirau prematur.",
      "[*] A fost remediată problema în care abilitatea Hex a lui Shadow Shaman nu era dezactivată de opțiunea „Dezactivează ajutorul”.",
      "[*] A fost remediată problema în care Snapfire + Ricochet II + Blade Mail declanșau atacuri ricoșate care ținteau Supernova.",
      "[*] A fost remediată problema în care Snapfire + Ricochet II + Lil' Shredder cauzau mai puține daune decât trebuia.",
      "[*] A fost remediată problema în care Snapfire + Ricochet II + Revenant's Brooch determinau atacurile secundare împotriva țintelor cu grad mare de evitare să declanșeze mai multe atacuri secundare.",
      "[*] A fost remediată problema în care atacurile cauzate de fațeta Ricochet II a eroinei Snapfire puteau rata ținta.",
      "[*] A fost remediată problema în care abilitatea Dispersion a eroinei Spectre îmbunătățită de Aghanim's Shard nu utiliza uneori valorile corecte.",
      "[*] A fost remediată problema în care talentul de la nivelul 15 al eroinei Templar Assassin care mărește distanța pentru atacul principal și atacurile principale ale Psi Blades oferea o distanță de atac mai mare decât trebuia.",
      "[*] A fost remediată problema în care distanța de atac a abilității Metamorphosis a lui Terrorblade indicată în descrierea abilității era incorectă (problema afecta doar descrierea).",
      "[*] A fost remediată problema în care fațeta Sapling a lui Treant Protector cauza ocazional blocarea unităților aliate în copacul creat de Leech Seed.",
      "[*] A fost remediată problema în care minionii creați de fațeta Abyssal Horde a lui Underlord nu atacau dacă setarea „Unitățile invocate atacă automat” era dezactivată.",
      "[*] A fost remediată problema în care unitățile Plague Ward (Plague Carrier) ale lui Venomancer atacau atunci când aliatul de care erau atașate era invizibil țintei.",
      "[*] A fost remediată problema în care unitățile Plague Ward (Plague Carrier) a lui Venomancer nu declanșau agresiunea.",
      "[*] Au fost remediate diversele probleme pe care le întâmpinau unitățile Familiar ale lui Visage.",
      "[*] A fost remediată problema în care abilitatea Voodoo Switcheroo a lui Witch Doctor cauza uneori blocarea lui Witch Doctor dacă un copac era plantat cât timp acesta era transformat.",
      "[*] A fost remediată problema în care selecția de fațete din modul de joc „Selecție abilități” alegea ocazional o fațetă greșită.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 20,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}