{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Parche de jugabilidad 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719899273
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Parche de jugabilidad 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719899273,
    "body": [
      "Ya está disponible el parche 7.36c. Puedes consultar las notas del parche [url=https://www.dota2.com/patches/7.36c]aquí[/url].",
      "Además, se corrigieron algunos errores durante estos últimos días:",
      "[list]",
      "[*] Se corrigió que las burlas no estuvieran equipadas al cambiar de faceta.",
      "[*] Se corrigió un bloqueo relacionado con el Bloque de Queso.",
      "[*] Se corrigió un bloqueo que se producía al crear objetos con cargas restaurables automáticamente en las partidas personalizadas.",
      "[*] Abaddon y Nyx Assassin ya evitan el daño correctamente.",
      "[*] Se corrigió la curación de Sanguívoro, de Bloodseeker, que era menor de lo que debería.",
      "[*] Se corrigió la habilidad Espalda Espinosa de Bristleback con la faceta Cohete Moqueante, que disparaba espinas al recibir gran cantidad de daño en una sola instancia.",
      "[*] Se corrigió el Cetro de Aghanim de Clinkz, que no aumentaba la vida de los esqueletos arqueros.",
      "[*] El primer ataque del Aluvión Llameante de Clinkz ya se beneficia de la Bomba de Alquitrán.",
      "[*] Se corrigió que el Clon de Cristal de Crystal Maiden siempre se lanzase hacia el objetivo afectado por Congelación en caso de lanzarse durante la animación posataque de Congelación.",
      "[*] El talento de nivel 10 de Dark Seer «+20 % de daño de las réplicas para Muro de las Réplicas» ya funciona correctamente.",
      "[*] Se corrigió la habilidad innata de Drow Ranger, Aura de Precisión, que a veces provocaba bloqueos del cliente.",
      "[*] El talento de nivel 15 de Earthshaker «+200 de alcance para Fisura» ya funciona correctamente.",
      "[*] Se corrigió que la Sobrecarga de Io otorgara resistencia a la ralentización sin el Fragmento de Aghanim.",
      "[*] Entrega Especial, la habilidad innata de Marci, ya no funciona con réplicas de Marci.",
      "[*] Se corrigió el talento de nivel 10 de Marci «+100 de alcance de lanzamiento/salto para Rebotar», que no aumentaba el alcance de lanzamiento.",
      "[*] Se corrigió que los atributos de Meepo y de Ogre Magi subieran de nivel automáticamente, sin darles la opción de subir de nivel una habilidad.",
      "[*] Meepo ya recibe cargas de la Urna de las Sombras y de la Vasija Espiritual al colocarse en la ranura para objetos neutrales a través de Equipamiento Flexible.",
      "[*] La faceta Zancada Simiesca de Monkey King ya tiene tiempo de recarga reducido cuando su vida está entre el 90 % y el 100 %.",
      "[*] Se corrigió la faceta Reflujo de Morphling, que mostraba tiempos de recarga incorrectos para objetos.",
      "[*] Se corrigió la faceta Flujo de Morphling, que reducía los tiempos de recarga demasiado poco.",
      "[*] Morphling ya no roba para siempre la faceta Ejército de un Solo Hombre de Axe cuando se transforma en él mediante Transformación.",
      "[*] Se corrigió la habilidad Desvanecer de Phantom Assassin, cuyo indicador de radio de alcance utilizaba valores antiguos.",
      "[*] Se corrigió la habilidad Desvanecer de Phantom Assassin con el Cetro de Aghanim, que cambiaba la duración del retraso del desvanecimiento.",
      "[*] Se corrigió la faceta Luz Agonizante de Phoenix, que causaba menos daño del que debería.",
      "[*] La ralentización de la velocidad de ataque de los espíritus ígneos de Phoenix ya utiliza los valores actualizados.",
      "[*] Se corrigió la habilidad Pisotear de Primal Beast, que a veces provocaba bloqueos del cliente.",
      "[*] Se corrigió la habilidad Cortina de Humo de Riki, que hacía que este y sus aliados pudieran fallar al intentar realizar denegaciones.",
      "[*] Se corrigió que Rubick a veces pudiese robar la antigua habilidad de Timbersaw Segundo Chakram.",
      "[*] Se corrigieron los Guardianes Serpiente de Shadow Shaman mejorados con el Fragmento de Aghanim, que a veces desaparecían antes de tiempo.",
      "[*] Se corrigió la Maldición de Shadow Shaman, para la cual no se desactivaba la ayuda.",
      "[*] Se corrigió la interacción entre la faceta de Snapfire Ricochet II y la Malla de Cuchillas, que activaba rebotes contra Supernova.",
      "[*] Se corrigió la interacción entre la faceta Rebote II y la habilidad Ametralladora de Snapfire, que provocaba menos daño del que debería.",
      "[*] Se corrigió la interacción entre la faceta de Snapfire Rebote II y el Broche del Renacido, que hacía que los ataques secundarios activaran más ataques secundarios al usarse contra objetivos con una evasión alta.",
      "[*] Los ataques de la faceta Rebote II de Snapfire ya no pueden fallar.",
      "[*] Se corrigió que el componente activo del Fragmento de Aghanim a veces no se actualizara a los valores correctos.",
      "[*] El talento de nivel 15 de Templar Assassin «+100 de alcance de ataque base y secundario para Hojas Psiónicas» ya no otorga más alcance de ataque del que debería.",
      "[*] Se corrigió la descripción emergente de la habilidad Metamorfosis de Terrorblade, que mostraba un alcance de ataque incorrecto (el cambio solo afecta a la descripción emergente).",
      "[*] Se corrigió que la faceta Pimpollo de Treant Protector a veces causara que las unidades aliadas se quedasen atascadas en el árbol plantado.",
      "[*] Los esbirros invocados por la faceta Horda Abisal de Underlord ya atacan aunque la opción «Ataque automático de unidad invocada» esté desactivada.",
      "[*] Los Guardianes de la Plaga de Venomancer ya no atacan si su portador es invisible para el objetivo.",
      "[*] Se corrigió que los Guardianes de la Plaga de Venomancer unidos a aliados no activaran la agresividad.",
      "[*] Se corrigieron varios problemas de los familiares de Visage.",
      "[*] Se corrigió que el Cambiazo Vudú de Witch Doctor a veces provocara que este se quedase atascado si se plantaba un árbol mientras se transformaba.",
      "[*] Se corrigió la elección de facetas en la selección de habilidades, que a veces escogía la faceta equivocada.",
      "[/list]"
    ],
    "commentcount": 187,
    "tags": [
      "patchnotes",
      "mod_reviewed",
      "ModAct_871423085_1719282120_0",
      "ModAct_1415588329_1719356296_4",
      "mod_require_rereview"
    ],
    "language": 5,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1755,
    "votedowncount": 233,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719899273,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 1719356297,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 0,
  "build_branch": "",
  "votes_up": 1755,
  "votes_down": 233,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}