{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Atualização de jogabilidade 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Atualização de jogabilidade 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "A atualização 7.36c já está disponível e podes ler as notas [url=https://www.dota2.com/patches/7.36c]aqui[/url].",
      "Além disso, alguns bugs foram corrigidos nos últimos dias:",
      "[list]",
      "[*] Foi corrigido um problema que fazia com que provocações fossem desequipadas ao mudar de Faceta.",
      "[*] Foi corrigida uma falha crítica relacionada com o item Block of Cheese.",
      "[*] Foi corrigida uma falha crítica que ocorria ao criar itens com cargas autorrestauráveis em modos customizados.",
      "[*] Abaddon/Nyx Assassin: foi corrigido um problema que impedia estes heróis de evitar dano corretamente.",
      "[*] Bloodseeker: foi corrigido um problema com a habilidade inata Sanguivore, que curava menos do que o esperado.",
      "[*] Bristleback: foi corrigida a habilidade Bristleback em combinação com a Faceta \"Snot Rocket\", que disparava Quill Spray quando o herói sofria grandes instâncias de dano.",
      "[*] Clinkz: foi corrigido um problema na interação com Aghanim's Scepter, que não estava a aumentar a vida dos esqueletos arqueiros.",
      "[*] Clinkz: foi corrigido um problema que fazia com que o primeiro ataque de Burning Barrage não tivesse o efeito de Tar Bomb.",
      "[*] Crystal Maiden: foi corrigido um problema com a habilidade Crystal Clone, cujo clone era sempre lançado na direção do alvo afetado por Frostbite se a habilidade tivesse sido usada durante a animação pós-habilidade de Frostbite.",
      "[*] Dark Seer: foi corrigido um problema com o talento de nível 10 \"Wall of Replica: Ilusões causam +20% do dano\", que não estava a funcionar corretamente.",
      "[*] Drow Ranger: foi corrigido um problema que fazia com que a habilidade inata Precision Aura causasse falhas críticas.",
      "[*] Earthshaker: foi corrigido um problema com o talento de nível 15 \"Fissure: +200 de alcance\", que não estava a aumentar o alcance de Fissure.",
      "[*] Io: foram corrigidos casos onde a habilidade Overcharge concedia um bónus de resistência a abrandamentos, mesmo sem Aghanim's Shard.",
      "[*] Marci: foi corrigido um problema com a habilidade inata Special Delivery, que funcionava em ilusões da Marci.",
      "[*] Marci: foi corrigido um problema com o talento de nível 10 \"Rebound: +100 ao alcance de uso/salto\", que não estava a aumentar o alcance de uso da habilidade.",
      "[*] Meepo/Ogre Magi: foi corrigido um problema que fazia com que um ponto de nível fosse usado automaticamente para conceder um bónus de atributos, mesmo com a opção de subir o nível de uma habilidade.",
      "[*] Meepo: foi corrigido um problema com a Faceta \"Pack Rat\", que fazia com que este herói não recebesse cargas de Urn of Shadows e Spirit Vessel se fossem colocados no compartimento de item neutro.",
      "[*] Monkey King: foi corrigido um problema com a Faceta \"Simian Stride\", que não removia o cooldown de Tree Dance se o herói tivesse entre 90% e 100% da vida.",
      "[*] Morphling: foi corrigido um problema com a Faceta \"Ebb\", que fazia com que a descrição de itens indicasse o cooldown errado.",
      "[*] Morphling: foi corrigido um problema com a Faceta \"Flow\", que estava a reduzir demasiado os cooldowns.",
      "[*] Morphling: foi corrigido um problema com a habilidade Morph, que roubava permanentemente a Faceta \"One Man Army\" do Axe.",
      "[*] Phantom Assassin: foi corrigido um problema com a habilidade Blur, cujo indicador de alcance ainda estava a usar os valores antigos.",
      "[*] Phantom Assassin: foi corrigido um problema na interação com Aghanim's Scepter, que estava a alterar o tempo de transição de Blur.",
      "[*] Phoenix: foi corrigido um problema com a Faceta \"Dying Light\", que causava menos dano do que o esperado.",
      "[*] Phoenix: foi corrigido um problema com a habilidade Fire Spirits, cujo efeito de redução de rapidez de ataque ainda tinha os valores antigos.",
      "[*] Primal Beast: foram corrigidos casos em que a habilidade Trample causava falhas críticas.",
      "[*] Riki: foi corrigido um caso onde negações desferidas por este herói e os seus aliados podiam falhar enquanto estivessem dentro da nuvem de fumo de Smoke Screen.",
      "[*] Rubick: foi corrigido um caso em que era possível roubar a antiga habilidade Second Chakram (do Timbersaw).",
      "[*] Shadow Shaman: foi corrigido um problema com as Serpent Wards melhoradas por Aghanim's Shard, que desapareciam prematuramente.",
      "[*] Shadow Shaman: foi corrigido um problema com a opção de desativação de ajuda, que estava a ignorar a habilidade Hex.",
      "[*] Snapfire: foi corrigido um problema na interação entre a Faceta \"Ricochet II\" e o item Blade Mail, que ativavam ricochetes contra Supernova (do Phoenix).",
      "[*] Snapfire: foi corrigido um problema na interação entre a Faceta \"Ricochet II\" e a habilidade Lil' Shredder, que causava menos dano do que o esperado.",
      "[*] Snapfire: foi corrigido um problema na interação entre a Faceta \"Ricochet II\" e o item Revenant's Brooch contra alvos com evasão elevada, que fazia com que os ataques secundários ativassem novos ataques secundários.",
      "[*] Snapfire: foi corrigido um problema com a Faceta \"Ricochet II\", cujos ataques podiam falhar.",
      "[*] Spectre: foi corrigido um problema ocasional na componente ativa de Dispersion com Aghanim's Shard, que não usava os valores corretos.",
      "[*] Templar Assassin: foi corrigido um problema com o talento de nível 15 \"Psi Blades: +100 de alcance de ataque base e secundário\", que concedia mais alcance do que o esperado.",
      "[*] Terrorblade: foi corrigido um problema na descrição da habilidade Metamorphosis, que indicava os valores incorretos para o alcance de ataque (este problema era apenas visual, a habilidade usava os valores corretos no jogo).",
      "[*] Treant Protector: foi corrigido um problema com a Faceta \"Sapling\", que podia fazer com que unidades aliadas ficassem presas na árvore plantada.",
      "[*] Underlord: foi corrigido um problema com as unidades criadas pela Faceta \"Abyssal Horde\", que não atacavam se a definição \"Ataque automático de unidades invocadas\" estivesse desativada.",
      "[*] Venomancer: foi corrigido um problema com a Faceta \"Plague Carrier\", que permitia às Plague Wards atacar enquanto o hospedeiro estivesse invisível para o alvo.",
      "[*] Venomancer: foram corrigidos casos em que Plague Wards alojadas (Faceta \"Plague Carrier\") não ativavam a agressividade de inimigos.",
      "[*] Visage: foram corrigidos vários problemas com Familiars.",
      "[*] Witch Doctor: foi corrigido um problema com a habilidade Voodoo Switcheroo, que permitia ao Witch Doctor ficar preso se uma árvore fosse plantada no local da transformação.",
      "[*] Foram corrigidos casos em que a Faceta errada era escolhida no modo de Seleção de Habilidades.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 11,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}