{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Gameplay-Update 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Gameplay-Update 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "Das Gameplay-Update 7.36c ist jetzt verfügbar. Die Patchnotizen dazu finden Sie [url=https://www.dota2.com/patches/7.36c]hier[/url].",
      "Darüber hinaus wurden in den vergangenen Tagen einige weitere Probleme behoben:",
      "[list]",
      "[*] Fehler behoben, durch den Spottgegenstände beim Facettenwechsel abgelegt wurden.",
      "[*] Absturz im Zusammenhang mit dem Gegenstand „Käselaib“ behoben.",
      "[*] Absturz behoben, der in angepassten Partien bei Gegenständen mit sich selbst wiederherstellenden Aufladungen auftrat.",
      "[*] Fehler behoben, durch den Abaddon und Nyx Assassin Schaden nicht ordnungsgemäß ausweichen konnten.",
      "[*] Fehler behoben, durch den der Effekt von Bloodseekers Facette „Sanguivore“ weniger heilte als vorgesehen.",
      "[*] Fehler behoben, durch den Bristlebacks Fähigkeit „Bristleback“ mit der Facette „Rotzrakete“ Borsten abfeuerte, wenn ihm eine einzelne Instanz enormen Schadens zugefügt wurde.",
      "[*] Fehler behoben, durch den Clinkz’ Zepterbonus die Lebenspunkte der Skelettbogenschützen nicht erhöhte.",
      "[*] Fehler behoben, durch den der erste Angriff von Clinkz’ Fähigkeit „Burning Barrage“ nicht die Effekte der Fähigkeit „Tar Bomb“ zufügte.",
      "[*] Fehler behoben, durch den Crystal Maidens Fähigkeit „Crystal Clone“ immer in Richtung der von der Fähigkeit „Frostbite“ betroffenen Einheit gewirkt wurde, wenn dies während der Animationsverweildauer der letztgenannten Fähigkeit geschah.",
      "[*] Fehler behoben, durch den Dark Seers Level-10-Talent „+20 % Schaden für Wall-of-Replica-Illusionen“ nicht ordnungsgemäß funktionierte.",
      "[*] Fehler behoben, durch den Drow Rangers Begabung „Aura der Präzision“ gelegentlich zu Client-Abstürzen führte.",
      "[*] Fehler behoben, durch den Earthshakers Level-15-Talent „+200 Reichweite für Fissure“ die Reichweite nicht erhöhte.",
      "[*] Fehler behoben, durch den Ios Fähigkeit „Overcharge“ Verlangsamungsresistenz auch ohne den Splitterbonus gewährte.",
      "[*] Fehler behoben, durch den auch Illusionen von Marci von ihrer Begabung „Sonderlieferung“ profitierten.",
      "[*] Fehler behoben, durch den Marcis Level-10-Talent „+100 Sprung-/Zauberreichweite für Rebound“ die Zauberreichweite nicht erhöhte.",
      "[*] Fehler behoben, durch den Meepos und Ogre Magis Attribute automatisch aufgewertet wurden, obwohl sie auch eine Fähigkeit hätten aufwerten können.",
      "[*] Fehler behoben, durch den Meepo keine Aufladungen für die Gegenstände „Urn of Shadows“ und „Spirit Vessel“ durch seine Begabung „Packesel“ erhielt, wenn diese in dem neutralen Gegenstandsslot platziert wurden.",
      "[*] Fehler behoben, durch den der Effekt von Monkey Kings Facette „Affenausdauer“ keine reduzierte Abklingzeit gewährte, wenn sich Monkey Kings Lebenspunkte zwischen 90 % und 100 % befanden.",
      "[*] Fehler behoben, durch den Morphlings Facette „Ebbe“ die falschen Abklingzeiten für Gegenstände anzeigte.",
      "[*] Fehler behoben, durch den Morphlings Facette „Flut“ die Abklingzeiten nicht genug reduzierte.",
      "[*] Fehler behoben, durch den Morphlings Fähigkeit „Morph“ dauerhaft Axe’ Facette „Ein-Mann-Armee“ stahl.",
      "[*] Fehler behoben, durch den Phantom Assassins Fähigkeit „Blur“ die alten Werte für den Reichweitenindikator verwendete.",
      "[*] Fehler behoben, durch den Phantom Assassins Fähigkeit „Blur“ mit Zepterbonus die Übergangszeit bis zum Verschwinden veränderte.",
      "[*] Fehler behoben, durch den der Effekt von Phoenix’ Facette „Schwindendes Licht“ weniger Schaden als vorgesehen zufügte.",
      "[*] Fehler behoben, durch den Phoenix’ Fähigkeit „Fire Spirits“ nicht die aktualisierten Werte verwendete.",
      "[*] Fehler behoben, durch den Primal Beasts Fähigkeit „Trample“ gelegentlich zu Client-Abstürzen führte.",
      "[*] Fehler behoben, durch den Riki und seine Verbündeten eine Verfehlchance erhielten, wenn sie versuchten, Einheiten im Wirkungsbereich seiner Fähigkeit „Smoke Screen“ zu denyen.",
      "[*] Fehler behoben, durch den Rubick gelegentlich Timbersaws alte Fähigkeit „Second Chakram“ stehlen konnte.",
      "[*] Fehler behoben, durch den die von Shadow Shamans Fähigkeit „Shackles“ mit Splitterbonus erschaffenen Schlangenwächter gelegentlich zu früh verschwanden.",
      "[*] Fehler behoben, durch den Shadow Shamans Fähigkeit „Hex“ die Einstellung „Hilfe deaktivieren“ ignorierte.",
      "[*] Fehler behoben, durch den Snapfire mit der Facette „Querschläger II“ und dem Gegenstand „Blade Mail“ Querschläger-Angriffe gegen Phoenix’ Supernova auslöste.",
      "[*] Fehler behoben, durch den Snapfire mit der Facette „Querschläger II“ und der Fähigkeit „Lil’ Shredder“ weniger Schaden als vorgesehen zufügte.",
      "[*] Fehler behoben, durch den Querschläger-Angriffe von Snapfire mit der Facette „Querschläger II“ und dem Gegenstand „Revenant’s Brooch“ gegen Ziele mit hoher Ausweichchance weitere Querschläger-Angriffe auslösten.",
      "[*] Fehler behoben, durch den Snapfires Querschläger-Angriffe mit der Facette „Querschläger II“ verfehlen konnten.",
      "[*] Fehler behoben, durch den die Werte der aktiven Komponente von Spectres Fähigkeit „Dispersion“ mit Splitterbonus nicht korrekt aktualisiert wurden.",
      "[*] Fehler behoben, durch den Templar Assassins Level-15-Talent „+100 Sekundärziel-/Angriffsreichweite für Psi Blades“ mehr Angriffsreichweite als vorgesehen gewährte.",
      "[*] Fehler behoben, durch den die Angriffsreichweite für Terrorblades Fähigkeit „Metamorphosis“ im Beschreibungstext falsch angezeigt wurde (die Fähigkeit funktionierte ordnungsgemäß).",
      "[*] Fehler behoben, durch den verbündete Einheiten an dem mit Treant Protectors Fähigkeit „Leech Seed“ und der Facette „Jungholz“ gepflanzten Baums stecken bleiben konnten.",
      "[*] Fehler behoben, durch den die mit Underlords Begabung „Horde des Abgrunds“ beschworenen Einheiten nicht angriffen, wenn die Einstellung „Autom. Angriff (beschworene Einheiten)“ deaktiviert war.",
      "[*] Fehler behoben, durch den die mit Venomancers Facette „Pestträger“ an einem Verbündeten angebrachten Pestwächter ein Ziel angriffen, obwohl der Träger unsichtbar war.",
      "[*] Fehler behoben, durch den die mit Venomancers Facette „Pestträger“ an einem Verbündeten angebrachten Pestwächter kein Aggro auslösten.",
      "[*] Diverse Fehler im Zusammenhang mit Visages Begleitern behoben.",
      "[*] Fehler behoben, durch den Witch Doctor beim Wirken seiner Fähigkeit „Voodoo Switcheroo“ gelegentlich an einem Baum stecken bleiben konnte, wenn dieser während seiner Verwandlung gepflanzt wurde.",
      "[*] Fehler behoben, durch den bei der Facettenauswahl im Ability Draft gelegentlich eine ungewollte Facette ausgewählt wurde.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 1,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}