{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "7.36c játékmenet-frissítés",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "7.36c játékmenet-frissítés",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "Megjelent a 7.36c frissítés. A frissítésjegyzéket [url=https://www.dota2.com/patches/7.36c]itt tudod megnézni[/url].",
      "Ezenkívül néhány hibát is javítottunk az elmúlt pár napban:",
      "[list]",
      "[*] Javítottuk, hogy a gúnyolódások le lettek szerelve vetületváltáskor.",
      "[*] Javítottunk egy, a Block of Cheese-zel kapcsolatos összeomlást.",
      "[*] Javítottunk egy összeomlást önmaguktól helyreálló töltetekkel rendelkező tárgyaknál egyedi játékokban.",
      "[*] Javítottuk, hogy Abaddon és Nyx Assassin nem megfelelően kerülték el a sebződést.",
      "[*] Javítottuk, hogy Bloodseeker Sanguivore-ja a szándékosnál kevesebbet gyógyított.",
      "[*] Javítottuk, hogy Bristleback Bristlebackje Snot Rockettel tüskéket lőtt ki nagy sebzéspéldányok elszenvedésekor.",
      "[*] Javítottuk, hogy Clinkz Aghanim's Sceptere nem növelte a Skeleton Archer életerőt.",
      "[*] Javítottuk, hogy Clinkz Burning Barrage képességének első támadása nem használta ki a Tar Bombot.",
      "[*] Javítottuk, hogy Crystal Maiden Crystal Clone-ja mindig a Frostbite célpontja felé varázsolódott, ha a Crystal Clone a Frostbite visszamozgási animációja alatt volt varázsolva.",
      "[*] Javítottuk, hogy Dark Seer 10. szintű Adottsága, a Wall of Replica illúziósebzés nem megfelelően működött.",
      "[*] Javítottuk, hogy Drow Ranger Precision Aurája néha kliensösszeomlást okozott.",
      "[*] Javítottuk, hogy Earthshaker 15. szintű Fissure hatótáv Adottsága nem növelte a Fissure hatótávját.",
      "[*] Javítottuk, hogy Io Overcharge képessége lassítás-ellenállást adott Aghanim's Shard nélkül.",
      "[*] Javítottuk, hogy Marci Special Delivery képessége működött Marci illúzióin.",
      "[*] Javítottuk, hogy Marci 10. szintű, Rebound varázslási/ugrási távolság Adottsága nem növelte a varázslási távolságot.",
      "[*] Javítottuk, hogy Meepo és Ogre Magi tulajdonságok szintjét fejlesztették automatikusan, amikor képességet is tudtak volna helyette fejleszteni.",
      "[*] Javítottuk, hogy Meepo nem kapott Urn of Shadows és Spirit Vessel tölteteket, amikor azok a Semleges tárgyhelyre voltak téve a Pack Rattel.",
      "[*] Javítottuk, hogy Monkey King Simian Stride-jának nem volt csökkentett újratöltődése, amikor Monkey King 90% és 100% ÉP között van.",
      "[*] Javítottuk, hogy Morphling Ebbje helytelen tárgyújratöltődéseket mutatott.",
      "[*] Javítottuk, hogy Morphling Flowja túl kevéssel csökkentette az újratöltődési időket.",
      "[*] Javítottuk, hogy Morphling Morphja véglegesen ellopta Axe One Man Armyját.",
      "[*] Javítottuk, hogy Phantom Assassin Blurjének hatósugárjelzője régi értékeket használt.",
      "[*] Javítottuk, hogy Phantom Assassin Blurje Aghanim's Scepterrel megváltoztatta az eltűnési késleltetés időtartamát.",
      "[*] Javítottuk, hogy Phoenix Dying Lightja a szándékosnál kevesebb sebzést okozott.",
      "[*] Javítottuk, hogy Phoenix Fire Spirits támadásai nem a frissített értékeket használták.",
      "[*] Javítottuk, hogy Primal Beast Trample-je néha kliensösszeomlást okozott.",
      "[*] Javítottuk, hogy Rikinek és szövetségeseinek elvétési esélye volt, amikor Smoke Screenben próbáltak beáldozni.",
      "[*] Javítottuk, hogy Rubick néha el tudta lopni Timbersaw régi Second Chakram képességét.",
      "[*] Javítottuk, hogy Shadow Shaman Aghanim's Shardos Serpent Wardjai néha idő előtt lejártak.",
      "[*] Javítottuk, hogy a „Segítség tiltása” nem kapcsolta ki Shadow Shaman Hex képességét.",
      "[*] Javítottuk, hogy Snapfire + a Ricochet II + a Blade Mail Ricochet támadásokat aktivált Supernova ellen.",
      "[*] Javítottuk, hogy Snapfire + a Ricochet II + a Lil' Shredder a vártnál kevesebb sebzést okozott.",
      "[*] Javítottuk, hogy Snapfire + a Ricochet II + a Revenant's Brooch magas kitérésű célpontok elleni használatakor a másodlagos támadások további másodlagos támadásokat aktiváltak.",
      "[*] Javítottuk, hogy Snapfire Ricochet II támadásai célt tudtak téveszteni.",
      "[*] Javítottuk, hogy Spectre Aghanim's Shardjának aktív összetevője néha nem frissült a helyes értékekre.",
      "[*] Javítottuk, hogy Templar Assassin 15. szintű, Psi Blades harctáv és szóródási távolság Adottsága a szándékosnál több harctávot adott.",
      "[*] Javítottuk, hogy Terrorblade Metamorphosis harctávja helytelen volt a képességleírásban (csak a leírás változott).",
      "[*] Javítottuk, hogy Treant Protector Saplingje miatt a szövetséges egységek néha elakadtak a facsemetében.",
      "[*] Javítottuk, hogy Underlord Abyssal Horde csatlósai nem támadtak, ha a „Megidézett egység automatikus támadása” ki volt kapcsolva.",
      "[*] Javítottuk, hogy Venomancer Plague Wardjai támadtak, miközben a hordozójuk láthatatlan volt a célpontnak.",
      "[*] Javítottuk, hogy Venomancer kapcsolt Plague Wardjai nem váltottak ki támadást.",
      "[*] Javítottunk különféle problémákat Visage familiárisainál.",
      "[*] Javítottuk, hogy Witch Doctor Voodoo Switcherooja hatására Witch Doctor néha beragadt, ha fát ültettek, miközben ő át volt alakulva.",
      "[*] Javítottuk, hogy Vetületválasztás Ability Draft során néha nem szándékos vetületet választott.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 18,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}