{
  "gid": "4175480871061328922",
  "clan_steamid": "103582791433224455",
  "event_name": "Speluppdatering 7.36c",
  "event_type": 12,
  "appid": 570,
  "server_address": null,
  "server_password": null,
  "rtime32_start_time": 1719276900,
  "rtime32_end_time": 1719280801,
  "comment_count": 0,
  "creator_steamid": "0",
  "last_update_steamid": "0",
  "event_notes": "see announcement body",
  "jsondata": {
    "localized_subtitle": [],
    "localized_summary": [],
    "localized_title_image": [],
    "localized_capsule_image": [
      "20246e3ed17e94352b9fdc475c3387d683c9bfe8.png"
    ],
    "bSaleEnabled": false,
    "sale_show_creator": false,
    "sale_sections": [],
    "sale_browsemore_text": "",
    "sale_browsemore_url": "",
    "sale_browsemore_color": "",
    "sale_browsemore_bgcolor": "",
    "localized_sale_header": [],
    "localized_sale_overlay": [],
    "localized_sale_product_banner": [],
    "localized_sale_product_mobile_banner": [],
    "localized_sale_logo": [],
    "sale_font": "",
    "sale_background_color": "",
    "sale_header_offset": 530,
    "referenced_appids": [],
    "bBroadcastEnabled": false,
    "broadcastChatSetting": "hide",
    "default_broadcast_title": "#Broadcast_default_title_dev",
    "localized_broadcast_title": [],
    "localized_broadcast_left_image": [],
    "localized_broadcast_right_image": [],
    "broadcast_whitelist": [],
    "bScheduleEnabled": false,
    "scheduleEntries": [],
    "valve_access_log": [
      {
        "strSteamID": "76561199370270521",
        "rtUpdated": 1718994000
      },
      {
        "strSteamID": "76561198090269208",
        "rtUpdated": 1719276984
      },
      {
        "strSteamID": "76561198166130601",
        "rtUpdated": 1719271878
      }
    ],
    "clone_from_event_gid": "4176605502420155695",
    "clone_from_sale_enabled": false
  },
  "announcement_body": {
    "gid": "4175480871061328923",
    "clanid": "3703047",
    "posterid": "0",
    "headline": "Speluppdatering 7.36c",
    "posttime": 1719276949,
    "updatetime": 1719276984,
    "body": [
      "Speluppdatering 7.36c är ute nu. Kolla in uppdateringsanteckningarna [url=https://www.dota2.com/patches/7.36c]här[/url].",
      "Dessutom har några buggar åtgärdats under de senaste dagarna:",
      "[list]",
      "[*] Åtgärdade att hån inte längre var utrustade vid byte av fasetter.",
      "[*] Åtgärdade en krasch relaterad till Block of Cheese.",
      "[*] Åtgärdade en krasch som inträffade när man skapade föremål med självåterställande laddningar i anpassade spel.",
      "[*] Åtgärdade att Abaddon och Nyx Assassin inte undvek skada ordentligt.",
      "[*] Åtgärdade att Bloodseekers Sanguivore helade mindre än avsett.",
      "[*] Åtgärdade att Bristlebacks Bristleback avfyrade Quills när han tog emot en stor mängd skada vid ett tillfälle när Snot Rocket användes.",
      "[*] Åtgärdade att Clinkz Aghanim's Scepter inte ökade skelettbågskyttens HP.",
      "[*] Åtgärdade att första attacken från Clinkz Burning Barrage inte drog nytta av Tar Bomb.",
      "[*] Åtgärdade att Crystal Maidens Crystal Clone alltid användes på målet för Frostbite om Crystal Clone användes under Frostbites baksvingsanimation.",
      "[*] Åtgärdade att Dark Seers nivå 10-talang (illusionsskada med Wall of Replica) inte fungerade ordentligt.",
      "[*] Åtgärdade att Drow Rangers Precision Aura ibland gjorde att klienten kraschade.",
      "[*] Åtgärdade att Earthshakers nivå 15-talang (+200 räckvidd med Fissure) inte ökade räckvidden.",
      "[*] Åtgärdade att Ios Overcharge gav långsam resistens utan Aghanim's Shard.",
      "[*] Åtgärdade att Marcis Special Delivery fungerade på Marcis illusioner.",
      "[*] Åtgärdade att Marcis nivå 10-talang (+100 räckvidd/hopplängd med Rebound) inte ökade räckvidden.",
      "[*] Åtgärdade att Meepo och Ogre Magi automatiskt ökade nivån på attribut när de hade kunnat öka nivån på en förmåga istället.",
      "[*] Åtgärdade att Meepo inte fick Urn of Shadows- och Spirit Vessel-laddningar när de placerades i den neutrala föremålsplatsen med Pack Rat.",
      "[*] Åtgärdade att Monkey Kings Simian Stride inte hade reducerad cooldown när Monkey King hade mellan 90 % och 100 % HP.",
      "[*] Åtgärdade att Morphlings Ebb visade felaktiga föremålscooldowns.",
      "[*] Åtgärdade att Morphlings Flow minskade cooldowns för lite.",
      "[*] Åtgärdade att Morphlings Morph stal Axes One Man Army permanent.",
      "[*] Åtgärdade att Phantom Assassins räckviddsindiktator för Blur använde inaktuella värden.",
      "[*] Åtgärdade att Phantom Assassins Blur med Aghanim's Scepter ändrade varaktigheten på avslöjningsfördröjning.",
      "[*] Åtgärdade att Phoenix Dying Light gjorde mindre skada än avsett.",
      "[*] Åtgärdade att attacknedsaktningen på Phoenix Fire Spirits inte använde aktuella värden.",
      "[*] Åtgärdade att Primal Beasts Trample ibland gjorde att klienten kraschade.",
      "[*] Åtgärdade att Riki och hans allierade kunde missa sina attacker när de försökte utföra förnekelser i Smoke Screen.",
      "[*] Åtgärdade att Rubick ibland kunde stjäla Timbersaws gamla Second Chakram-förmåga.",
      "[*] Åtgärdade att Shadow Shamans Serpent Wards från Aghanim's Shard ibland löpte ut för tidigt.",
      "[*] Åtgärdade att Shadow Shamans Hex inte inaktiverades av Inaktivera hjälp.",
      "[*] Åtgärdade att Snapfire + Ricochet II + Blade Mail utlöste Ricochet-attacker mot Supernova.",
      "[*] Åtgärdade att Snapfire + Ricochet II + Lil' Shredder gjorde mindre skada än förväntat.",
      "[*] Åtgärdade att Snapfire + Ricochet II + Revenant's Brooch mot mål med högt undvikande orsakade att sekundära attacker utlöste fler sekundära attacker.",
      "[*] Åtgärdade att Snapfires Ricochet II-attacker kunde missa.",
      "[*] Åtgärdade att Spectres aktiva komponent från Aghanim's Shard ibland inte uppdaterades till rätt värden.",
      "[*] Åtgärdade att Templar Assassins nivå 15-talang (+100 attack- och spridningräckvidd på Psi Blades) gav mer attackräckvidd än avsett.",
      "[*] Åtgärdade att Terrorblades attackräckvidd på Metamorphosis i förmågans verktygstips var felaktig. Ändringen gäller endast verktygstipset.",
      "[*] Åtgärdade att Treant Protectors Sapling ibland gjorde att allierade enheter kunde fastna på Sapling Tree.",
      "[*] Åtgärdade att Underlords Abyssal Horde-undersåtar inte attackerade om inställningen Auto-attack för frammanad enhet var inaktiverad.",
      "[*] Åtgärdade att Venomancers Plague Wards kunde attackera när bäraren var osynlig för målet.",
      "[*] Åtgärdade att Venomancers Plague Wards inte utlöste aggro.",
      "[*] Åtgärdade flera problem relaterade till Visages Familiars.",
      "[*] Åtgärdade att Witch Doctors Voodoo Switcheroo ibland gjorde att Witch Doctor kunde fastna om ett träd planterades medan han förvandlades.",
      "[*] Åtgärdade att fasettval i Ability Draft ibland valde en oavsiktlig fasett.",
      "[/list]"
    ],
    "commentcount": 2,
    "tags": [
      "patchnotes"
    ],
    "language": 17,
    "hidden": 0,
    "forum_topic_id": "4355625398141686028",
    "event_gid": "4175480871061328922",
    "voteupcount": 1,
    "votedowncount": 0,
    "ban_check_result": 0,
    "banned": 0
  },
  "published": 1,
  "hidden": 0,
  "rtime32_visibility_start": 0,
  "rtime32_visibility_end": 0,
  "broadcaster_accountid": 0,
  "follower_count": 0,
  "ignore_count": 0,
  "forum_topic_id": "4355625398141686028",
  "rtime32_last_modified": 1719276985,
  "news_post_gid": "0",
  "rtime_mod_reviewed": 0,
  "featured_app_tagid": 0,
  "referenced_appids": [],
  "build_id": 14821388,
  "build_branch": "",
  "votes_up": 0,
  "votes_down": 0,
  "comment_type": "ForumTopic",
  "gidfeature": "1636418037459185108",
  "gidfeature2": "4355625398141686028",
  "clan_steamid_original": "103582791433224455"
}